[
    "Abstract. With the sustainable development of economy and society and the acceleration of the popularization of higher education, Henan Province, as a big province of education, has developed rapidly, but it also has some drawbacks. As an important mission of higher education, the supply of higher education is a systematic problem with regularity, which is closely related to the regional social and economic development. The problems of higher education supply seriously affect the energy of higher education. Based on this, this paper takes the supply of higher education as the starting point. On the basis of sorting out the current situation and problems of the supply evolution of undergraduate colleges in Henan Province, this paper puts forward some policy suggestions to improve the effective supply of higher education in Henan Province. This has a certain theoretical and practical significance to promote the effective supply of higher education in Henan Province and improve the supply quality of higher education in Henan Province. The effective supply of higher education is an important link to cultivate innovative talents and improve the quality of higher education. Henan Province is located in the Central Plains, is the birthplace of Chinese excellent traditional culture. In terms of economy, culture, agriculture and so on, Henan Province is located in the national advanced development queue. With the acceleration of the popularization of higher education, the development of higher education in Henan Province is very rapid, but there are also some drawbacks: for example, the total supply of higher education is insufficient, the supply structure of higher education is unreasonable, and the resources of higher education are unbalanced. These problems, to a certain extent, show that higher education in Henan Province pays too much attention to the growth of quantity, but lacks the effective supply of higher education and the rational utilization of higher education resources. As an important mission of higher education, the supply of higher education is a systematic problem with regularity, which is closely related to the regional social and economic development. The problems of higher education supply seriously affect the energy of higher education. The outline of national medium and long term education reform and development plan (2010-2020) clearly points out that it is necessary to reasonably allocate the supply resources of higher education to promote the sound development of higher education with the goal of improving the quality of higher education. This not only reflects the country attaches great importance to higher education, but also reflects the importance of reasonable supply of higher education. Based on this, this paper takes the supply of higher education as the starting point. On the basis of sorting out the current situation and problems of the supply evolution of undergraduate colleges in Henan Province, this paper puts forward some policy suggestions to improve the effective supply of higher education in Henan Province. This has a certain theoretical and practical significance to promote the effective supply of higher education in Henan Province and improve the supply quality of higher education in Henan Province. In terms of the government supply mode of higher education, Sevastaynova thinks that the most important way to solve the shortage of higher education supply is to provide financial subsidies; Moretti thinks that there are many modes of government supply for higher education, including micro regulation and macro-control, but there are certain practical conditions in the process of government intervention in higher education and it is difficult to completely implement them Real. Cochrane pointed out that the government's reasonable supply can effectively solve the phenomenon of unfair education in society, so that those students who can't receive normal education can enjoy certain educational resources. In terms of the supply mode of the third sector (Society) of higher education, Lukas thinks that the third sector accurately defines the social organizations with vague concepts and outlaws the historical positioning of social organizations as non-public or private; Marks thinks that there are three main supply modes in higher education, namely, society, government and market, and the individual supply mode has certain disadvantages. When the three make concerted efforts to play their due advantages, this can solve the problem of supply failure of higher education to the maximum extent. China has actively explored the supply side reform of higher education. He Xiao fang; Ning Guiling; Meng Changgong (2018) studied the realistic contradiction of the supply side structural reform of higher education. The study points out that the supply side structural reform of higher engineering education, because of its typicality and particularity, is faced with practical contradictions in many dimensions, such as scale structure, social demand, educational objectives, implementation subject, professional adjustment and so on. It is the epitome of the supply side structural reform of Higher Education in China. The way to solve these problems is to establish a systematic engineering view of the supply side structural reform of higher education, which aims at the development of education, relies on market participation, the main body is the university itself, and the core is talent training [1]. Li Ning (2019) studied the theoretical logic and practical path of supply side structural reform of talent cultivation in China's higher education. It is pointed out that the structural reform of the supply side of higher education can solve the problems of low efficiency, poor quality, no logic and no structure in modern higher education, realize the reform and innovation of China's higher education, and successfully realize the transformation of China's education, so as to develop into higher education institutions in line with the requirements of the times[2]. Xu Qiuyan and Fang Shengfei (2019) analyzed the coupling coordination between higher education supply structure and industrial structure upgrading. By using the coupling degree model and coordination degree model, this paper analyzes the coordination degree and spatial-temporal evolution characteristics of the supply structure of higher education and the upgrading of industrial structure in China from 2005 to 2017[3]. Yu Chang, Gao Xianghui and Li Ming (2020) studied the motivation, logic and implementation path of the supply side reform of higher education[4].",
    "In 2010, the number of undergraduate colleges and universities in Henan Province was 45, and in 2019, the number of undergraduate colleges and universities was 57, which increased by an average of one undergraduate university every year. With the acceleration of the popularization of undergraduate colleges and universities in Henan Province, the Department of education of Henan Province has increased the input of higher education resources and further expanded the total supply of higher education. The scale of enrollment institutions of graduate colleges in Henan Province is relatively stable, with 27 institutions from 2013 to 2019. The average growth rate is zero. Henan Provincial Department of education should timely adjust the educational structure of higher education, increase the pilot enrollment of graduate students, expand the enrollment scale of postgraduates and doctoral students in Henan Province, and greatly enhance the level of high-quality talents in Higher Education in Henan Province. in Henan Province is extremely uneven. The enrollment of undergraduate colleges and universities in Zhengzhou accounts for the majority of Henan Province, while the enrollment in other regions is relatively small. There is no undergraduate enrollment scale in Hebi City, Puyang City, Luohe City, Sanmenxia City and Jiyuan City. Henan Province should increase the economic distribution level of each city level region, enhance the enrollment scale of undergraduate colleges in each region, try to balance the enrollment of each region, and improve the supply of high-quality talents in each region. The teaching staff is the foundation of the vigorous development of undergraduate education in Henan Province, which is of great practical significance to cultivate a large number of talents and scientific and technological innovation. The number of teaching staff in Henan Province is increasing year by year. In 2010, the number of teaching staff was 69962, including 48520 full- time teachers, accounting for 0.694. In 2018, the number of teaching staff in Henan undergraduate colleges and universities increased to 97792, including 72604 full-time teachers, accounting for 0.742. The number of staff in 2018 increased by 27830 compared with that in 2010, of which the number of full-time teachers increased by 24084, and the number of full-time teachers accounted for a large proportion. To a certain extent, it reflects that the supply quality of teachers in Henan Province has been significantly improved. Figure 1 shows that from 2010 to 2018, the proportion of full-time teachers and teaching staff in Henan Province has increased significantly, with a significant increase from 2010 to 2013. However, from 2015 to 2018, the promotion rate dropped, and the proportion of full-time teachers decreased in 2017. The undergraduate colleges and universities in Henan Province should continue to pay more attention to the quality of teacher supply, increase the proportion of middle and senior staff, and build a group of excellent teachers with high quality and high skills. The supply of higher education in Henan Province should not only focus on the increase of the number of undergraduate colleges and universities, but also pay attention to the quality and level of supply of colleges and universities. It is necessary to change the tendency of excessive pursuit of development speed and scale in some undergraduate colleges and universities in Henan Province, and cultivate talents with practical ability and in line with social needs. We should further promote the mode of \"one main school and multiple schools\". At the same time, we should strengthen the supply capacity of private colleges and universities, optimize the allocation of higher education resources, and improve the multi subject school running mechanism. In order to expand the supply channels of higher education, we should increase the effective supply of market and non-governmental organizations for higher education under the condition of limited financial support from the government, so as to solve the current situation of fund shortage and single financing channel of private undergraduate colleges. We should encourage the establishment of third-party institutions of higher learning, improve relevant laws and regulations, and appropriately adjust the tax policies of public welfare institutions of higher learning established by individuals or organizations. Henan Province can learn from the financial and tax policies of industrial and agricultural colleges in the United States \"moldy act\". We should support the sustainable development of private undergraduate colleges and universities through the government and market mechanism, and give equal treatment to public undergraduate colleges.",
    "The supply of higher education in Henan Province is in the historical stage of transformation to popularization, so we should pay more attention to the optimization of supply same time, the classified cooperation among higher education is gradually replacing the bad competition among colleges and universities. Promoting the cooperation mechanism of regional higher education can optimize the supply structure of higher education and promote the production of the overall resultant force, so as to achieve the effect of \"one plus one big two\". The innovation of inter regional supply cooperation mechanism requires the government and various departments of colleges and universities to fulfill their respective responsibilities. In terms of the content of higher education supply cooperation, we can establish an inter regional cooperation community from the aspects of facilities sharing, information sharing, teaching resources sharing and academic exchange among colleges and universities, so as to achieve a benign cooperation state of complementary advantages and mutual exchange between colleges and universities, and solve the problem of uneven distribution of higher education supply resources. From the perspective of higher education cooperation mode, regional colleges and universities can use the market and government policies to realize the cooperation in running schools through the forms of asset participation and contract. In addition, we can make use of the cooperation between colleges and universities to organize joint teaching, social survey, student practice, scientific research tasks and other related activities. From the perspective of the supply system of higher education, the management of regional cooperation of higher education should clarify the cooperation content, cooperation subject, organizational structure, incentive mechanism, risk control, default cost and other specific directions through communication and decision-making, establish cooperation objectives, solve regional cooperation obstacles, and strengthen the innovation and development vitality of undergraduate colleges and universities in Henan Province. At present, the supply of higher education in Henan Province is faced with the problems of insufficient total supply resources and unbalanced distribution. Improving the efficiency and fairness of the allocation of higher education supply resources is an important guarantee to improve the efficiency and optimize the quality of higher education in Henan Province. First of all, we should break through the traditional educational system of ownership of educational resources department in undergraduate colleges. At present, the allocation of higher education resources in Henan Province by different independent departments and organizations often leads to the lack of communication between the two sides, which is very unfavorable to the reasonable allocation of higher education resources. Therefore, colleges and universities should strengthen the utilization efficiency of existing educational resources, promote the interactive development of educational resources, reduce the probability of repeated use of educational resources, and maximize the rational use of educational resources. Secondly, it is necessary to improve the reasonable distribution of educational resources in Henan Province. At present, the resource allocation of undergraduate colleges and universities in Henan Province is still faced with the problems of shortage of educational funds, uneven supply of educational practitioners, shelving of teaching equipment and low utilization rate. Therefore, it is necessary to reform and innovate the internal management mechanism of undergraduate colleges. It is necessary to clarify the responsibilities of the internal personnel of undergraduate colleges and universities, and improve the reasonable distribution mechanism of internal personnel. We should speed up the pace of flat management of Henan undergraduate colleges and universities, improve the phenomenon of internal human resource redundancy and responsibility ambiguity through personnel flow and performance appraisal, and promote the dynamic development of human resource allocation. It is necessary to improve the rational allocation of teaching equipment and teaching resources environment in Henan Province. According to the actual situation of internal expenditure, equipment use, financial expenditure and income comparison, the reasonable distribution of financial resources within colleges and universities in Henan Province is improved. One of the most important factors that affect the quality and efficiency of higher education supply in Henan Province is the relatively strong administrative operation mechanism in Henan Province. This bureaucratic management system has gradually increased the lack of autonomy in running colleges and universities in Henan Province. Henan Province can refer to the distribution of rights of colleges and universities in the United States, Japan, the European Union and other regions. It is necessary to clarify the dynamic relationship between centralization and decentralization among the government, colleges and the market, establish a management system of separation of management and operation and separation of government and school, so as to promote the sound development of higher education governance system in Henan Province. The government should strengthen the macro management of undergraduate colleges and universities. We should break away from the role of administrative management of undergraduate colleges to the greatest extent, and create a good external environment for the development of undergraduate colleges and universities by expanding their autonomy. At the same time, we should deal with the relationship between the government running schools according to law and the independent running of universities, improve the system of laws and regulations of colleges and universities, clarify the boundaries of rights and responsibilities between university administrators and the government, and strengthen the consciousness of university subject. In addition, we should improve the higher education evaluation system of education departments and government departments, strengthen the institutions, strengthen the independent evaluation system of teaching quality, investment, equipment maintenance and scientific research environment, and optimize the benign interaction of management.",
    "The most fundamental way to improve the supply quality and efficiency of higher education is to improve the quality of running a school within colleges and universities, so as to ensure the effectiveness of internal management in Colleges and universities and improve the performance management of colleges and universities. First of all, it is necessary to unify the development goals of the leaders, administrators, teachers and students in Colleges and universities to the maximum extent, establish the common vision of the management strategy, campus culture, teaching concept, students' career development planning and other aspects of the internal personnel and organizations in Colleges and universities, so as to stimulate the endogenous power of colleges and universities. University administrators should conform to the needs of the times. We should combine with the local economic and social development situation, through the communication and decision-making with the teachers and administrators in the school, set up the development plan and strategic objectives of the president period, so as to clarify the campus culture and value orientation of colleges and universities, and strengthen the top-level design. Secondly, Henan undergraduate colleges and universities should establish a perfect dynamic monitoring mechanism in the aspects of teaching methods, goal realization, management methods, organizational structure, scientific research level and operational efficiency. From the top- level design of the strategic objectives to the implementation process and then to the implementation results, the comprehensive performance monitoring is carried out to ensure the realization of the overall goal and each sub goal. At the same time, we should strengthen the monitoring of the operation mechanism and quality of colleges and universities, ensure the quality of colleges and universities, enhance the social influence of colleges and universities on the local society, and ensure that colleges and universities can deliver high-quality talents with In short, with the acceleration of the popularization of higher education, Henan Province, as a major province of education, has developed rapidly. The effective supply of higher education is an important link to cultivate innovative talents and improve the quality of higher education. As an important mission of higher education, the supply of higher education is a systematic problem with regularity. This paper takes the supply of higher education as the starting point, on the basis of combing the current situation and problems of the supply evolution of undergraduate colleges in Henan Province, and puts forward policy suggestions to improve the effective supply of higher education in Henan Province. This has a certain theoretical and practical significance to promote the effective supply of higher education in Henan Province and improve the supply quality of higher education in Henan Province. This work is financially supported by the humanities and Social Sciences project of Henan Provincial Department of education in 2020, 2020-ZZJH-029; outstanding scholars of philosophy and Social Sciences in Henan Province higher education in 2018, 2018-YXXZ-06; Henan philosophy and Social Sciences Planning Project in 2019, 2019BJJ003; Intellectual property soft science research project of Henan Province in 2021, 20210106014; Henan philosophy and Social Sciences Planning Project in 2019, 2019BJJ032; Key scientific and technological projects of Henan Province in 2021, 212102310051, Research on emergency decision-making mechanism and key technologies of major public emergencies; the key scientific research project of colleges and universities in Henan Province in 2021, 21A620002; General Topics of Henan Province Educational Science \"13th Five-Year Plan\" in 2020, Research on the dynamic mechanism of the integration of industry and education in Henan Province, 2020YB0146; Guangdong higher education reform project in 2020, No. 642, innovative research and practice of logistics personnel training mode based on new information technology under the background of new business.."
]