[
    "Abstract: The report of the 19th National People’s Congress points out that China's social economy will gradually transition from the pursuit of high-speed operation to the pursuit of high-quality economic operation. The financial industries will strongly support the economic development in all aspects, however, studies show that the efficiency of finance in supporting economic development presents regional differences. This paper adopts the universally applicable DEA-Malmquist method and takes the panel data of Henan Province from 2013 to 2019 as the benchmark to calculate and study the input-output ratio of financial support for economic operation and development in each region of Henan Province, and the results show that the overall efficiency of financial service economy in each urban area of Henan Province has increased in the past seven years. According to the measured results in the first four parts of the most efficiency increase is analyzed, and based on the analysis results in the economic development of Henan province put forward some proposals in the new journey, increase the intensity of financial innovation and development, to carry out in-depth financial inclusion work, and to solve the problem that small and micro enterprises faced in raising funds and the slow pace of raising funds, in order to achieve a reasonable distribution of financial resources between the suppliers of funds and the demanders of funds. Since the implementation of the opening up policy, the financial industry in Henan Province has taken the lead in conforming to the national policy, adjusting the structure of the financial industry and building a good financial environment, and has achieved good results in recent years. The gross domestic product of Henan Province has grown from 19.262 billion yuan to 5.425.92 billion yuan since 1978 to 2019, and the sudden growth speed has enabled Henan Province to play a significant role in the national economic development. The Fifth Plenary Session of the 19th Central Committee of the Communist Party of China pointed out that China's economic development has entered a brand new journey and will be dedicated to improving the quality of economic development. In order to establish a new pattern of double-cycle economic development in Henan Province, we must keep pushing forward, reforming internally and externally, making deep adjustments to the industrial structure, and making the financial industry support the development of the real economy in many aspects. When the financial market develops to a new level, how to accurately judge whether the financial resources are effective for economic development becomes a topic worthy of discussion. This paper uses regional development panel data of 27 cities in Henan Province from 2013-2019 to analyze the specifics of the efficiency of financial support for economic development in each region through a longitudinal comparison of time series data and a cross-sectional comparison of cross-sectional data among cities. The relationship between finance and economic development has been explored in depth by many scholars at home and abroad. In the 1990s, foreign scholars Levine and King (1993) [1]conducted an empirical study using a series of financial market stock data and the least squares method and found that the development of China's financial sector has increased total factor productive capacity and sustained socioeconomic growth over a longer period of time. However, there are also some studies with opposite conclusions, Bhide Amar (1993) [2]believed that high stock liquidity would reduce the public's participation in corporate supervision, thus weakening the stock market's ability to allocate capital, which affects economic growth. In a related study in © The Authors, published by EDP Sciences. This is an open access article distributed under the terms of the Creative Commons Attribution License 4.0 (http://creativecommons.org/licenses/by/4.0/). square measurement to deeply explore whether there is a relationship between China's financial development and economic growth, and through a large base data analysis, he verified the proposed hypothesis that financial development not only promotes economic growth, but also has a strong correlation between the two. Zhou and Wang (2002)[4] constructed an indexation model based on regional data for analysis, and the results showed that there was a strong correlation between financial development and economic growth. Wang and Sun (2003) [5]used the means of causality test to explore again from the three aspects of China's financial routine and found that China's finance and economy are mutually causal. From the perspective of regional financial evolution, Zhao (2006)[6] explored the situation of capital investment, income and capital accumulation in China's financial framework system, and measured the impact of capital storage and credit loans of financial institutions in different regions on investment. It is found that the financial industry in various regions of China plays a significant role in promoting the utilization of local funds and obtaining profits, but it was not clearly demonstrated that the development of financial enterprises can improve the efficiency of investment management.",
    "As for measuring the efficiency of financial support for economic development, many scholars tend to use DEA models for efficiency research in recent years and have achieved some results. Liu (2007)[7] used a conventional DEA model to conduct a comparative analysis of the input-output relationship of the financial sector and the validity of each input index in 30 provinces and three major regions in China, and found that the financial efficiency presented a decreasing and unbalanced trend from the eastern region to the western region. Sun, Jiang and Fang (2011) [8]calculated the efficiency of financial support to economic development in each province through a DEA-Malmquist index model based on provincial panel data from 1998 to 2010 in China, and the results showed that only technological innovation can fundamentally accelerate economic growth in each province. Using the Malmquist index method, Jiang (2014)[9] measured the efficiency of financial support material products and the service of production as well as the circulation of economic activity according the data from 2003 to 2012 for 31 provinces and urban areas in China, and concluded that the efficiency of China's financial services for the development of its economic activities has gradually decreased, and the average efficiency growth rate from the eastern to the western regions has become increasingly low. Yang and Li (2017) [10]studied the panel data of 11 prefecture-level cities in Hebei Province using the DEA-Malmquist index method to analyze the efficiency of financial support for economic development in Hebei Province, and concluded that the efficiency of financial support for economic development in Hebei Province has generally increased, but there exist significant differences between different cities, and the Based on the analysis of the above literature, it is found that most of the existing studies on the efficiency of financial support economy are based on macro-level provincial economic data, and there is not yet abundant research on the analysis of economic efficiency at the local and municipal levels within the province. In view of this, this paper will use the conventional DEA-Malmquist index model to study the specific situation of financial support economic development efficiency in provincial areas based on the economic data of Henan Province. In analyzing the efficiency of economic development at macro level, most of it is measured and decomposed by non-parametric DEA-Malmquist exponential model based on the optimal production frontier surface. The DEA modeling method refers to the use of mathematical modeling method to calculate the optimal input-output rate of the decision unit, and judge the effectiveness of decision unit by the distance between decision unit and the optimal output efficiency, this method is also called data envelopment analysis method. At present, the non- parametric Malmquist index method is generally applicable to the DEA method combining time series data and cross-section data, which can measure the input- output efficiency level of decision units. The Malmquist index method was first proposed by Sten.Malmquist in 1953, and then Caves, Christensen and Diewert began to apply this development index to the measurement of the changing production management efficiency of enterprises in 1982. After the development and research of Malmquist model formula, the final formula is as follows: When the value of the Malmquist index exceeds 1, it indicates an increase in the efficiency of the financial support economy at both moments and a decrease in efficiency in the opposite direction. The Malmquist index can be further split into an index of technological level change index (TECHCH) and technical efficiency change index(EFFCH), the latter being a relative efficiency change index, which is used to measure the degree of each decision unit catching up with the production possibility frontier during the period from T to T +1. When EFFCH is greater than 1, it indicates that the production of enterprise decision unit is closer to the value of the optimal condition of social production, and the corresponding scientific and technological management level is improved. Techch is the index of continuous development and improvement of technology, which measures the optimization range of production information technology boundary from T period to T +1. When Techch is greater than 1, it indicates the efficient allocation of resources brought by the innovative capacity of data technology products, reflecting the improvement of technological efficiency.",
    "In addition, the change of technical efficiency can be further subdivided again into the change of output increase caused by scale expansion (SECH) and the efficiency of output increase caused by pure technological innovation (PECH). The change of scale efficiency (SECH) reflects the growth of efficiency after input growth, while the pure technical efficiency (PECH) reflects the speed and applicability of technological innovation: In order to compare the efficiency of financial support to the economy in each city of Henan Province, this paper selects multivariate input and single-variable output model. The panel data of Henan Province from 2013-2019 are selected. In output indicators, the GDP value Y of each region in Henan Province is used as the output variable of the decision unit, and the data of GDP of each region are obtained from Henan Statistical Yearbook (2013-2019), where GDP mainly measures the overall level of economy of each region in Henan Province, and the number of financial employment L and bank loan balance (LO) of each urban area are selected as input variables in terms of input indicators. Because the number of employees in financial areas in 2019 in Luyi County is 0, which does not meet the conditions of Malquist data selection, it is removed. Based on the above data and empirical methods, this paper analyzes the panel data of 27 cities (excluding Luyi County) in Henan Province from 2013 to 2019 with the help of DEAP2.1 software, and comprehensively analyzes the efficiency of financial support for economic development in Henan Province through the financial input and output of each city and its decomposition. The specific measurement results are shown in the following table. Table 1 Decomposition Results of Malmquist Productivity Index with GDP as Output in Each Urban Area (Average Value of Each Year). Note: effch is technical efficiency change; techch is technology level change; pech is pure technical efficiency; sech is scale efficiency change; tfpch is Malquist productivity index efficiency, the same as below. financial services economy in the urban areas of Henan Province has increased overall in the last seven years, with efficiency increasing by 32.2% in 2014, 22.6% in 2015, 48.8% in 2017, and 9.9% in 2019. However, the efficiency of financial service economy is not stable, from 2013-2019, the level of efficiency of the financial services economy development in the urban areas of Henan Province fluctuates constantly, and did not form a stable change trend. For example, the economic efficiency has been on an upward trend from 2013 to 2015, which may be due to a series of policies and measures introduced by relevant departments in Henan Province around the financial services economy to support the regional strategic development. However, from 2015 to 2016, the efficiency decreased by 19%, and from 2017 to 2018, it also decreased by 6.7% again. During 2016-2017 and 2018-2019, the efficiency ushered in a relatively large increase, increasing by 48.8% and 9.9% respectively, which may be the result of the active promotion of financial inclusion practices in the province by the relevant authorities in Henan Province. According to the data in Table 1, the average technical efficiency of all areas in Henan Province in recent 7 years is 1.028, which is basically stable. In 2018, total factor productivity in Henan Province decreased by 6.7% due to the poor technological innovation intensity. In 2016, total factor productivity decreased by nearly 20% due to the combined impact of weak technological innovation intensity and low technological efficiency. This shows that the efficiency of China's financial support for economic development mainly depends on technological renewal, technological innovation and progress play a key role in promoting regional economic development. In addition, the pure technical efficiency and scale efficiency in Henan Province did not change regularly in the past seven years, which had an unbalanced impact on the technical efficiency. In the past 7 years, the pure technical efficiency showed a general trend of decline, with an average decrease of 0.6%. Scale efficiency has generally shown an increasing trend in the past seven years, with an average increase of 3.5%, and there were three peaks in 2014, 2018 and 2019. Table 2 Decomposition Results of Malmquist Productivity Index with GDP as Output in Each Urban Area (Average Value for Each Municipality) As can be seen from Table 2, the specific TFP values of all regions show that the efficiency of financial support for economic growth in 25 cities has increased, and the highest rate of increase is Pingdingshan, followed by Xinxiang, Nanyang, Anyang, Kaifeng, Sanmenxia and Zhengzhou. The improvement of technology level is the main factor for the increase of efficiency, which indicates that the key to economic growth in all regions of China is the technological development level of enterprises. However, only two regions, Jiaozuo and Puyang, experienced a decline in efficiency, and the decrease is mainly caused by the decrease of technical efficiency. In general, the efficiency of economic growth in the cities of Henan Province has shown an upward trend in the last seven years, with an average increase of 12.3%, which is the result of the double growth of the strength of technological scale and the degree of technological innovation.",
    "From the values of Malmquist measure, the four urban areas of Pingdingshan, Xinxiang, Nanyang and Anyang have the highest efficiency of financial support for economic development, the reasons for their growth are discussed in depth and detail. In recent 7 years, the efficiency of financial support to the economy in Pingdingshan City has grown by 28.5% in the last 7 years, including 19.3% in technical efficiency, 7.7% technology level, and 18.7% in technical scale efficiency, thanks to the economic transformation strategy of in a single development model and economic model. In order to revitalize the economy, Pingdingshan began to adjust the industrial layout and carry out supply-side reform. In the aspect of finance, it has increased financial innovation, made continuous improvement and exploration on rural industrial revitalization, improved the financial organization system, increased the number of financial institutions and the number of financial practitioners; In terms of rural revitalization, credit loans should be increased, inclusive financial service stations should be set up, and the speed of financial capital circulation should be increased. In the past 7 years, the economic efficiency of financial support in Xinxiang increased by 26.2%, including 16.3% in technical efficiency, 8.5% in technology level and 18% in scale efficiency. In finance, Xinxiang City is committed to expanding the number of capital loans, carry forward the functional role of the bank's own business; expanding the opening of the financial sector, developing and growing financial subjects; improving the ability of our country's finance to amplify the effect of capital and innovating the structure of government financial institutions, making the scale and technical level of finance grow at a faster rate year by year and supporting the efficiency of economic development steadily. The efficiency of financial support to the economy in Nanyang City has grown 23.3% in the past 7 years, including 2% growth in technical efficiency, 20.9% growth in technical level and 1.8% growth in scale efficiency. In recent years, Nanyang City has been constantly improving the quality and speed of economic development, trying its best to create a good financial ecological atmosphere, implementing strategies to make the total amount of social investment rise, and laying a solid foundation for realizing the steady development of finance. In addition, Nanyang City combines the city's ecological advantages to develop green finance and ensure the high quality of economic development. The efficiency of financial support to the economy in Anyang City has increased by 23% in the past 7 years, including 13.7% in technical efficiency, 8.2% in technology level and 14.3% in scale efficiency. Since the \"13th Five-Year Plan\", Anyang City began to reform the internal structure of finance, sink rural financial institutions and improve the level of rural financial services. In addition, Anyang City has tightened its grasp on financial risk for prevention and control, increased innovation, and promoted the bank multi-guarantee cooperation, improved the efficiency of lending, accelerated the circulation of funds. With the increasing financial support This paper adopts the universally applicable DEA- Malmquist method and makes the number of financial employment and bank loan balance of each urban area in Henan Province from 2013 to 2019 the input variables in terms of input indicators and the GDP value Y of each region in Henan Province the output variable of the decision unit tocalculate efficiency of financial support for economic operation and development in each region of Henan Province. The results show that the overall efficiency of financial service economy in each urban area of Henan Province has increased in the past seven years. What’s more, the highest rate of increase is Pingdingshan, followed by Xinxiang, Nanyang, Anyang, Kaifeng, Sanmenxia and Zhengzhou. Moreover, the improvement of technology level is the main factor for the increase of efficiency, which indicates that the key to economic growth in all regions of China is the technological development level of enterprises. Through the above analysis, the efficiency of financial support for economic development of all cities in Henan Province has been advancing steadily in the past 7 years. In order to better respond to the new strategy of national high-quality economic development and establish a new pattern of double-cycle economic development. Henan Province should timely grasp the essence of the new era of economic development stage and adjust the pace of the new development pattern. Therefore, the following suggestions are proposed: Financial innovation injects fresh blood into the long-term development and improvement of the financial industry. Henan Province should formulate innovative monetary policies for the urban and rural economy of prefectures and cities, strengthen cooperation and contact with financial entities, and tightly grasp the innovation work from top to bottom; The financial industry should actively explore, increase service innovation, and enrich the types and quantity of financial entities. For example, opening precise poverty alleviation rural banks, improve the efficiency of financial services; innovate the internal structure of finance, develop business in the offline real financial field, increase the popularity of online financial service platforms by using their convenience; provide targeted financial services, flexibly adjust deposit and loan interest rates, deposit reserve rates and rediscounting, and improve the level of financial technology. Develop business in the offline real financial field, increase the popularity of online financial service platforms by using their convenience, and improve the level of financial technology; provide targeted financial services, flexibly adjust deposit and loan interest rates, deposit reserve ratio and rediscount rate, solve diverse financial problems, and improve the innovation consciousness and income level of service recipients.",
    "The development of inclusive finance and targeted poverty alleviation are the key to high-quality economic development. The government of Henan Province should rely on its institutional advantages and promulgate reasonable policies for inclusive finance. The financial entities led by banks should respond positively to establish and improve the inclusive finance system, expand the popularity of rural financial institutions, and accurately distribute them to various places. Expand the number of financial practitioners, set up the financial inclusion group, lower the financial threshold, develop innovative financial inclusion business, and provide targeted financial services for the needy and entrepreneurs; Increase lending in rural areas,, relax the conditions of capital lending, lower financial capital to the rural level, fully support rural entrepreneurship, small and micro financing, reasonably allocate resources to improve the breadth of capital utilization according to the actual situation such as geography, and improve the income of poor people; actively establish an online financial service platform, popularize financial knowledge, integrate and optimize information by using modern scientific and technological information technology, and reduce the cost caused by information asymmetry Losses, and ultimately achieve comprehensive coverage of financial services and improve the quality of inclusive finance. To further solve the financing problems of small and micro enterprises is the focus of the government work report in 2021. In recent years under the country's positive response and policy support, various cities in Henan Province have taken measures to relax the loan conditions of small and micro enterprises, appropriately reduce the cost of borrowing funds for small and micro enterprises, and improve the financing efficiency, which has achieved certain results. In the face of micro and small enterprises suffering from the impact of the epidemic, the government should fully support them in the financial industry, help them recover as soon as possible, establish financial institutions for financing small and micro enterprises, such as small loan companies, simplify the loan process and reduce the time cost. The political task of financing problems about small and micro enterprises will be assigned to large and medium-sized banks as soon as possible and including the assessment index to improve the active power of bank loans; help small and micro enterprises to raise direct financing, expand and extend the financing paths, open up priority channels for listing and financing small and micro enterprises, issue bond financing, and give priority to the development of small and micro enterprises, and make them the core part of"
]