[
    "Rong Zhang“, Jun Zhao“, Yue Zhang“, Xiang Hong *, Hongguang Zhang **, Hanyue Zheng °, Jingwei Wu“, Yuanyuan Wang“, Zuoqi Peng”‘, Ya Zhang*°, Lifang Jiang “, Yueshu Zhao t Qiaomei Wang ®, Haiping Shen ®, Yiping Zhang ®, Donghai Yan °, Bei Wang*, Xu Ma?*°~ * Key Laboratory of Environmental Medicine and Engineering of Ministry of Education, Department of Epidemiology and Health Statistics, School of Public Health, Southeast University, Nanjing, Jiangsu, China Methods: This study included 751,270 female residents from Henan Province who participated in the National Free Pre-conception Check-up Projects during 2015-2017. Ambient cycle-specific PM 5 exposure was assessed at the county level for each participant using satellite-based PM25 concentration data at 1-km resolution. Cox proportional hazards models with time-varying exposure were used to estimate the association between ne 7\" posure wv * fecundability and PM25 exposure, adjusted for potential individual risk factors. Results: During the study period, 568,713 participants were pregnant, monthly mean PM2s concentrations varied from 25.5 to 114.0 g/m? across study areas. For each 10 ng/m> increase in cycle-specific PM 5, the hazard ratio for fecundability was 0.951 (95 % confidence interval: 0.950-0.953). The association was more pronounced in women who were older, with urban household registration, history of pregnancy, higher body mass index (BMI), hypertension, without exposure to tobacco, or whose male partners were older, with higher BMI, or hypertension. Conclusion: In this population-based prospective cohort, ambient cycle-specific PM2.5 exposure was associated with reduced fecundability. These findings may support the adverse implications of severe air pollution on reproductive health. Air pollution, particularly the concentration of fine particulate matter (PM25), has become a pressing global health concern (Yin et al., 2020). Numerous studies have highlighted the adverse effects of PM2.5 on respiratory, cardiovascular health, and all-cause mortality (Cohen et al., 2017). There is a raising concern about the effects of PM25 on reproductive health, with emerging evidence suggesting a potential as- sociation between PM2,.5 exposure and human fertility. Recent studies have identified an association between PM2,.5 and human sperm quality (Hammoud et al., 2010; Radwan et al., 2016; Wu et al., 2022; Lao et al., 2018; Jurewicz et al., 2015); ovarian reserve (Gaskins et al., 2019; Wu Abbreviations: BMI, body mass index; CI, confidence interval; FPG, fasting plasma glucose; HR, hazard ratio; N, number; NFPCP, National Free Pre-conception Check-up Project; PM2\\s, fine particulate matter; SD, standard deviation; TTP, time to pregnancy; U.S, the United States. * Corresponding author at: Key Laboratory of Environmental Medicine and Engineering of Ministry of Education, Department of Epidemiology and Health Sta- tistics, School of Public Health, Southeast University, No. 87 Dingjiaqiao Road, Gulou District, Nanjing City, Jiangsu Province 210009, China. ** Corresponding author at: National Research Institute for Family Planning, No. 12 Dahuisi Rd, Haidian District, Beijing 100081, China. E-mail addresses: wangbeilxb@163.com (B. Wang), genetic88@sina.com (X. Ma). Received 24 December 2023; Received in revised form 14 May 2024; Accepted 15 May 2024 Available online 21 May 2024 0160-4120/© 2024 The Authors. Published by Elsevier Ltd. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by- ne-nd/4.0/). et al., 2022; Bongaerts et al., 2023); and a reduction in the fertility rate based on population-level evidence (Nieuwenhuijsen et al., 2014; Xue and Zhang, 2018; Xue and Zhu, 2018; Xue and Zhu, 2018). Time to pregnancy (TTP), an essential indicator widely used to assess fecundability (the probability of conception in a menstrual cycle for a couple at risk of conception), is generally defined as the time it takes for a couple with regularly occurring, noncontracepted intercourse to ach- ieve pregnancy (Baird et al., 1986). Previous studies on the association between PM25 exposure and TTP have yielded inconclusive results, marked by variations in exposure windows and research methodologies (Siegel et al., 2023). Additionally, the majority of studies have adopted fixed exposure windows, neglecting the dynamic nature of the female reproductive system. The potential impact of PM2,5 on fertility may be mediated through various mechanisms, including inflammation, increased oxidative stress, and endocrine changes (Wang et al., 2021). The menstrual cycle, closely intertwined with hormone levels, changes in uterine and ovarian structure, and other crucial factors achieving pregnancy (Small et al., 2006); could represent a critical window for acute exposure to PM2 5 (Nobles et al., 2018). Previous studies on cycle- specific exposures have predominantly concentrated on developed re- gions with low pollution levels, yielding varied results, may stem from limitations in sample sizes, participant demographics, covariates, and geographic locations, lacking evidence from high-pollution, low- or middle-income regions (Nobles et al., 2018; Wesselink et al., 2022, 2023).",
    "On this basis, our study aimed to investigate the relationship be- tween time-varying cycle-specific exposure of ambient PM25 and fecundability in Henan, China, using TTP as the indicator, utilizing data derived from the National Free Pre-conception Check-up Project (NFPCP), a prospective cohort study (Zhou et al., 2016). Additionally, we aimed to explore potential moderating effects attributed to various characteristics, including age, pregnancy history, behavioral traits, and health status. Henan Province, located in central China, ranks among the country’s largest agricultural provinces, with a rural-to-urban population ratio of 1.05 as of 2016 (Main Indicatiors of County, 2017). The rural population tends to engage in more outdoor activities and has fewer indoor air purification measures. Consequently, individual exposure levels closely approximate ambient levels, facilitating the study of ambient air pollution effect (Gong et al., 2022). The NFPCP was a nationwide population-based cohort study project supported by the Chinese government, aiming to provide free precon- ception health examinations to couples intending to conceive within the next 6 months (Zhou et al., 2016). Detailed information on the design, organization, and implementation of this project has been previously documented (Zhou et al., 2016). This study included 824,829 perma- nent female residents from Henan Province who participated in the NFPCP from January 1, 2015 to December 31, 2017, and were followed- up for at least 1 year or until pregnancy ensued. Female participants were aged 20-49 years and their male partners were aged 22 years or older. Exclusion criteria led to the removal of 7,978 participants due to specific medical conditions that rendered them unsuitable for preg- nancy. An additional 22,267 participants were excluded because of irregular menstrual cycles (defined as cycles lasting less than 21 days, more than 35 days, or a difference of more than 7 days between the longest and shortest cycles (Doi et al., 2005), or due to a lack of men- strual data. 3,788 participants were excluded for PM2.5 concentrations were not available in their county or district. To avoid potential con- sequences of including outlying values of exposure data, 39,526 par- ticipants with the lowest and highest 2.5 % of average PM25 measurements were excluded (Samet et al., 2000; Liu et al., 2019). Ultimately, a total of 751,270 female participants were included in this study. The selection of study participants is shown in Fig. 1. Basic sta- tistics for the study areas were reported in Supplementary Table S1. This study was approved by the institutional review board of the National Research Institute for Family Planning, Beijing, China. All participants provided written informed consent. PMz5 data were sourced from the Tracking Air Pollution in China (TAP) dataset, which provides near real-time monitoring of atmospheric components in China, utilizing a machine learning model integrating high-resolution satellite remote sensing data for Aerosol Optical Depth (AOD) and environmental spatial data, including road networks, enabling the estimation of daily PM25 concentrations at a 1 km reso- lution, covering comprehensive spatial and temporal dimensions by amalgamating various data sources such as ground observations, satel- lite remote sensing information, high-resolution emission inventories, and air quality model simulations (TAP — Tracking Air Pollution in China, 2023; Geng et al., 2021; Xiao et al., 2021a,b, 2022). For security and privacy considerations, specific addresses of NFPCP participants were not disclosed. As an alternative approach, we aggre- gated and averaged the acquired PM2 5 grid data to the county level, subsequently allocating the county-level average exposure of partici- pants’ residential addresses at baseline to them using uniform 6-digit county administrative codes. For each participant, we conducted an assessment to determine the average daily exposure during each men- strual cycle based on each participant’s last menstrual cycle and the average menstrual cycle recorded at baseline up to the last menstrual cycle before pregnancy or the date of the last follow-up visit (if censored), establishing a time-varying cycle-specific exposure (Wesse- link et al., 2023; Liang et al., 2020). After completing the preconception examinations, participants were monitored by trained healthcare professionals via telephone every three months until the first self-reported pregnancy was confirmed (based on gynecological ultrasound results) and the date of the woman’s last menstrual period was recorded. All participants were followed until they became pregnant, or up to one year. Participants who were not pregnant after one year of enrollment and who were lost to follow-up were censored. TTP was calculated as the interval between the date of last menstruation date obtained at follow-up and before conception (if pregnant within 1 year) or last follow-up call (if not pregnant). TTP in cycle was calculated by dividing the TTP by the average menstrual cycle length of each female partner with regular menstruation (Wang et al., 2018; Loy et al., 2018).",
    "At baseline, participants’ demographic characteristics (age, ethnicity, occupation, educational level, household registration), life- style information (tobacco exposure and alcohol consumption), preg- nancy history, and menstrual status, were gathered through standardized one-on-one questionnaires administered by trained health professionals. Physical examinations were conducted to measure body height, weight, blood pressure, and reproductive organ appearance, following NFPCP standard procedures, while body mass index (BMI) was calculated as weight divided by height squared (kg/m7). Clinical labo- ratory tests included fasting plasma glucose (FPG) level and viral screening (Zhang et al., 2020). Data collected may be classified as missing due to suspicious diagnoses or examination results. The covariates in this study were pre-selected based on prior studies and literature reviews and included either fecundability risk factors or exposure predictors (Siegel et al., 2023; Hong et al., 2022). Age was examination and prepared for pregnancy 824,829 women aged 20-49 years with male partners > 22 years old, residing in Henan Province, completed the NFPCP based on baseline preconception examination and date of birth. Occu- pation encompasses various categories, including farmers, workers, civil servants, and others (comprising individuals engaged in businesses, services, domestic work, or roles that defy classification). The number of children currently in the household (including biological, step, and adopted children) was labeled as 0, 1, or 2 and more. A menstrual cycle was defined as the interval between the onset of bleeding in one cycle, accompanied by at least 2 days of bleeding with increased intensity, and the onset of the next similar bleeding episode (Harlow and Ephross, 1995). Age at menarche, menstrual cycle length, and menstrual period duration were categorized into three groups by the first and third quartiles, respectively. BMI was classified into four groups: underweight (<18.5 kg/m), normal weight (18.5-23.9 kg/m?), overweight (24.0-27.9 kg/m?), and obesity (>28.0 kg/m?) (Mi et al., 2015). Hy- pertension was defined as systolic blood pressure > 140 mmHg and/or diastolic blood pressure > 90 mmHg (Chobanian et al., 2003). FPG levels were categorized as normal (<6.1 mmol/L), impaired glucose tolerance (6.1-6.9 mmol/L), and diabetes mellitus (>7.0 mmol/L) (Alberti and Definition, 1998). Reproductive tract infection was defined as infection with at least one of the following pathogens: Gardnerella vaginalis, candida, trichomonad, Neisseria gonorrhoeae, or Chlamydia tra- chomatis (Zhao et al., 2023). Tobacco exposure was defined as daily smoking for at least one year or daily exposure to environmental tobacco smoke (Yes) or never (No) (Zhang et al., 2020). Alcohol intake was defined as occasional or regular consumption of alcohol, regardless of the type and intake level of alcohol (Yes) or never (No) (Zhang et al., 2020). Seasons were classified according to the first day of each men- strual cycle, with spring from March to May, summer from June to August, autumn from September to November, and winter from December to February (Wang et al., 2002). Mean (standard deviation) and counts (percentages) were employed to describe the baseline characteristics. The Cox proportional hazards model with time-varying exposures was used to estimate the hazard ratio (HRs) and corresponding 95 % confidence intervals (CIs) (Liang et al., 2020). The basic model only adjusted for season. Model A, built sociodemographic characteristics, while Model B, based on Model A, additionally adjusted women’s menstrual status, pregnancy history, health status, and lifestyle. Model C further adjusted for male partners’ age and health status on the basis of model B. The HRs represent the ratios of female partner pregnancy during the cycle for female partici- pants with the cycle-specific PMz,5 exposure compared to the reference group, conditional on not being pregnant in the previous cycle. HRs below 1 signify a reduction in fecundability or a longer TTP, while HRs above 1 indicate a shorter TTP. Multivariable models were fit to adjust for potential risk factors of fecundability. Restricted cubic spline was fitted to test the nonlinear association between exposure-response. Interaction and stratification analyses were conducted based on indi- vidual demographics, behavioral characteristics, and health status. For the sensitivity analyses, we employed stratified analyses based on the median population density and urban proportion within each county- level administrative unit (Supplementary Table S2). To verify the robustness of the primary findings, we conducted additional analyses excluding counties with fewer than 1,000 participants (Supplementary Table $3). To address missing data, we utilized multiple imputation and subsequently performed the primary analyses on the imputed complete dataset. Estimates from the ten imputed datasets were combined using Rubin’s rule (Supplementary Table S4) (Marshall et al., 2009). Furthermore, we provided comparisons of baseline characteristics be- tween individuals lost to follow-up or excluded due to extreme values and the participants included in the main analyses (Supplementary Tables S5 and S6). All analyses were performed in R software (version 4.1.2). A5 % threshold was used to define statistical significance, and all tests were two-sided.",
    "This study included 751,270 eligible female participants, with 75.700 % (n = 568,713) becoming pregnant during the study, and 65.058 % (n = 369,993) of these pregnancies occurring within the first three menstrual cycles. The median TTP was 3.069 menstrual cycles (with a quartile range of 1.143-10.966 cycles). The average age of the female participants was 27.415 years (standard deviation, SD: 4.777). The majority of participants were of Han Chinese ethnicity, engaged in agriculture, had one or no children, were educated below high school level, and had household registration in rural areas (Table 1). Monthly mean PM25 concentrations ranged from 25.5 to 114.0 g/m? across study areas in Henan Province. For each participant, the average PM2.5 concentration during menstrual cycles was determined, resulting in a mean exposure of 66.671 'g/m® (SD: 29.855) for non-pregnant women and 65.330 g/m? (SD: 26.562) for pregnant women. Table 2 presents the HRs and 95 % CIs for female fecundability regarding PM2.5 exposure. The estimated HR for pregnancy was 0.951 (95 % CI: 0.950-0.953) for each 10 g/m? increase in the mean PM2.5 concentration over menstrual cycles. The HRs for fecundability associ- ated with the second to fourth quartiles of PMz.5 exposure, compared to the first quartile, were 0.864 (95 % CI: 0.857-0.871), 0.759 (95 % CI: 0.752-0.766), and 0.723 (95 % CI: 0.715-0.732), respectively. In all four models featuring various adjustment covariates, a significant negative correlation was observed between the mean PM, 5 concentra- tion over menstrual cycles and fecundability. Fig. 2 illustrates a declining trend in the restricted cubic spline analysis for fecundability. The association between HR and PM2.5 con- centration was nonlinear over the entire exposure range (P < 0.001). The increased cycle-specific PM2z5 exposure was associated with decreased fecundability. Fig. 3 exhibits the interaction and subgroup analyses regarding the association between fecundability and PM2,5 exposure. In general, the association between cycle-specific PM25 exposure and fecundability exhibited statistical significance across different subgroups defined by individual characteristics with interactive effect, elevated Data are n (%), unless stated otherwise. Abbreviations: N = number; SD = standard deviation. *Season designates the season corresponding to the partic- ipant’s last menstrual period date at baseline. *Quartiles were classified based on the monthly average concentrations of PM2 5 across Henan province from 2015.01 to 2018.12. Abbreviations: PM2.5 = fine particulate matter; HR = hazard ratio; CI = confidence interval; BMI = body mass index; FPG = fasting plasma glucose. concentrations of PM2.5 were consistently associated with decreased fecundability. Age, house registration, pregnancy history, BMI, hyper- tension status, FPG level, and tobacco exposure may have modified the impact of PM2 5 exposure on fecundability. Notably, the adverse effects of PM25 were observed to be more pronounced among women who were older (HR, 0.899; 95 %CI: 0.886-0.913), urban (HR, 0.924; 95 %CI: 0.912-0.936), had been pregnant (HR, 0.940; 95 %CI: 0.938-0.942), had a higher BMI (HR, 0.934; 95 %CI: 0.926-0.942), suffered from hypertension (HR, 0.905; 95 %CI: 0.889-0.922), not exposed to tobacco (HR, 0.951; 95 %CI: 0.949 -0.953), had an older partner (HR, 0.913; 95 %CI: 0.903-0.924), and had a partner with a higher BMI (HR, 0.938; 95 %CI: 0.933-0.944) or hypertension (HR, 0.912; 95 %CI: 0.904-0.921), in comparison to their respective reference groups. In the sensitivity analysis, additional stratified analyses were con- ducted using the median population density for each county-level administrative area, which showed that increased PM25 was associ- ated with decreased fertility in both low and high population density study areas, and similar results were found in the stratified analysis according to urban proportion (Supplementary Table $2). Excluding study areas with fewer than 1,000 participants yielded results consistent with the main analysis (Supplementary Table $3). Moreover, analyses performed on the imputed data, no substantial deviations from the main results (Supplementary Table S4). Specifically, the association of each 10 pg/m? increase in PM25 on fecundability was 0.947 (95 % CI: 0.946-0.949). Across different models, fecundability exhibited a decline Multivariate-adjusted model adjusted for participants’ age (continuous), ethnicity, occupation, educational level, household registration, current child number, age at menarche, menstrual cycle, menstrual period, pregnancy his- tory, alcohol intake, tobacco exposure, BMI (continuous), hypertension status, FPG (continuous), reproductive tract infection, season, and their partners’ age (continuous), BMI (continuous), hypertension status. The reference value was the minimum observed value for the entire study period. The 3 knots were based on the quartiles of the monthly average PM2; concentrations in Henan Province from 2015.01 to 2018.12, which were 45.454, 60.726 and 83.142 ug/ m3, respectively. Abbreviations: PM, ; = fine particulate matter; BMI = body mass index; FPG = fasting plasma glucose.",
    "in the higher quartiles compared to the lowest quartile, while the highest quartile had the lowest HR of 0.699 (95 % CI: 0.691-0.707). Detailed comparisons of baseline characteristics between the study population and those who were excluded due to extreme values or lost to follow-up were detailed in Tables S5 and S6 in the Supplements. This prospective population-based study conducted in a highly polluted area aimed to investigate the association between cyclic PM2.5 exposure and human fertility, involving 751,270 participants with 4,354,523 menstrual cycles (Yin et al., 2020). Our findings support that PM25 exposure has an adverse effect on female fertility, with a 10 g/m? increase in cycle-specific PM2,5 corresponding to a 5 % decrease in fe- male fecundability. Previous cohort studies have assessed the relationship between PM2 5 and fecundability, yielding varying results. These variations may be influenced by differences in study populations, exposure windows, methods of exposure assignment, pollution levels, and PM2,5 composi- tion. Three prospective studies, including the United States (U.S.) LIFE cohort (Nobles et al., 2018); the U.S. and Canadian PRESTO cohorts (Wesselink et al., 2023); and the Danish Preconception cohort (Wesse- link et al., 2022), also considered the cycle-specific exposure. (Wesselink et al., 2022) found that per interquartile range (3.2 g/m*) increase in cycle-specific exposure was associated with a 7 % decrease in fecund- ability among Danish women attempting to conceive for less than 3 cycles (HR, 0.93; 95 %CI: 0.87-0.99), whereas no such association was observed in the other two studies. In addition to differences in de- mographic characteristics and regional development levels, notable Fig. 3. Multivariate-Adjusted Hazard Ratios of Fecundability Corresponding to Each 10 g/m® Increase in Cycle-specific PMz,5 in Different Subgroups. Case: Pregnancy. Multivariate-adjusted model adjusted for participants’ age (continuous), ethnicity, occupation, educational level, household registration, current child number, age at menarche, menstrual cycle, menstrual period, pregnancy history, alcohol intake, tobacco exposure, BMI (continuous), hypertension status, FPG (continuous), reproductive tract infection, season, and their partners’ age (continuous), BMI (continuous), hypertension status. Abbreviations: PM2.5 = fine par- ticulate matter; HR = hazard ratio; CI = confidence interval; BMI = body mass index; FPG = fasting plasma glucose. disparities existed in air pollution levels between these studies and ours, with most participants exposed to PM25 concentrations below local regulatory limits (LIFE: Median, 11.8 pg/m°; PRESTO: Median for U.S., 7.2 ug/m*; Median for Canada, 6.0 ug/m*; Danish cohort: Median for annual concentration, 9.6 »g/m°; U.S. daily limit: 35 pg/m?; Canadian daily limit: 27 pg/m*; European Union annual limit: 20 ug/m*) (US Epa O, 2014; Canadian Council of Ministers of the Environment, 2023; EU air quality standards, 2023). In contrast, the median exposure level in our study was substantially higher (60.9 yg/m*). For long-term exposure in cohorts from low pollution areas, no strong or monotonic association was found between PM2,5 exposure in the year before enrollment and fecundability in either the Danish Pre- conception cohort (Wesselink et al., 2022) or the PRESTO cohort (Wesselink et al., 2023). However, (Mahalingaiah et al., 2016) examined the association of time-varying exposures with infertility over a two- year scale in the Nurses’ Health Study II, suggesting that increased cu- mulative PM2.5 exposure was linked to a heightened risk of infertility. This finding aligns with results from a retrospective study conducted in China, in which Li et al. (2021) observed that increased average expo- sure over 1, 3, and 5 years was associated with increased odds of infertility and prolonged TTP. Additionally, Slama et al. (2013) reported that short-term PM25 exposure was associated with reduced fecund- ability during the first month of unprotected intercourse in an industrial area, and exposure data were derived from a single monitoring station. These findings, including our own, suggested that high levels of PM2.5 exposure may adversely affect fecundability. Our study provided precise HR values for fecundability in various subgroups through a prospective cohort. Older participants and their partners exposed to PM2z.5 exhibited a more pronounced association, possibly due to longer cumulative exposure, reduced physical function, immunity, and concurrent declines in ovarian function or semen quality (Rothman et al., 2013). Pregnancy history, including live births, abor- tions, or adverse pregnancy outcomes, could have affected the uterine environment, potentially influencing the effects of PM2,5 on fecund- ability (Wildenschild et al., 2019). The association between PM25 exposure and reduced fecundability was stronger in participants and partners classified as obese and overweight, who may have had lower ovarian reserve, semen quality, altered hormone levels or oxidative stress levels (Atzmon et al., 2017). Hypertension, a common chronic disease usually accompanied by decreased immunity and chronic inflammation, was more likely to be affected by PM25 in participants and partners with hypertension (Harrison et al., 2011). The effect of PM2,.5 was more pronounced in participants non-exposed to tobacco compared to exposed individuals. This observation aligns with findings in studies on PM2 5 and cardiovascular disease risk (Liang et al., 2020; Kiinzli et al., 2005). Tobacco and PM25 may have affected the associated adverse risk through similar pathways. Among those exposed to tobacco, tobacco had a predominant influence, and additional exposure to PM2.5 did not further enhance this association (Kiinzli et al., 2005).",
    "Although 97 % of the individuals in our study were registered as rural, stratified analyses showed a more pronounced decline in fecundability with elevated PM2.5 in urban participants compared to rural participants. Likewise, sensitivity analyses suggested that in- dividuals residing in areas with higher population density or urban population proportion had lower HRs. This difference in susceptibility may stem from variations in pollution sources and levels. The primary sources of PM2,5 in Henan Province include coal combustion, (including centralized heating and residential bulk burning), industrial processes, vehicle emissions, and dust (Bai et al., 2020; Wang et al., 2023). Urban or densely populated areas may have more numerous, concentrated and diverse sources of pollution due to more human activities such as in- dustrial and vehicular emissions, with the phenomenon of urban pollution islands (Yao et al., 2022; Ulpiani, 2021). In contrast, rural, less densely populated areas have fewer sources of pollution and easier dispersion of pollutants. Thus, participants from highly urbanized areas with high population densities were more likely to be chronically exposed to highly polluted air (Yao et al., 2022; Branis and Linhartova, 2012). Furthermore, the composition of PM2.5 is complex and varied depending on its source. The adverse effects of different PMz.5 compo- sitions on human reproductive health may vary due to their different physicochemical properties, necessitating further research. PM2 5 and its components were identified as triggers for local and systemic inflammation, increased oxidative stress, and disruptions in hormonal balance (Wang et al., 2021). Despite the uncertainty sur- rounding the precise mechanisms by which PM, 5 affects fertility, po- tential pathways include endocrine disruption, oxidative stress, DNA alterations, and epigenetic modifications (Carré et al., 2017). Several studies have established an association between PM25 exposure and changes in sperm quality and ovarian reserve, both of which have direct implications for fertility. For men, PM25 exposure has been linked to reduced sperm motility (Hammoud et al., 2010; Wu et al., 2022); sperm aneuploidy (Jurewicz et al., 2015); abnormalities in sperm morphology (Radwan et al., 2016; Lao et al., 2018); and decreased testosterone levels (Radwan et al., 2016). For women, exposure to PM25 has been associ- ated with diminished follicle counts (Gaskins et al., 2019); and poor ovarian response (Wu et al., 2022). Moreover, a recent study has iden- tified the presence of black carbon, a constituent of PM25, within ovarian tissues (Bongaerts et al., 2023). To the best of our knowledge, our study represents the largest population-based prospective investigation into the correlation between PM25 and fecundability. Our research featured elevated ambient PM25 exposure levels compared to previous studies and explored the connection between cycle-specific exposure and TTP. We conducted stratified and interaction analyses, considering risk factors such as de- mographic, behavioral characteristics and health status. This compre- hensive approach provides valuable insights into the impact of PM2.5 exposure across various subgroups. The employment of standardized data collection methods and rigorous laboratory quality control pro- cedures ensured the reliability of the data. However, our study does have several limitations. First, exposure levels were measured at the district level rather than individually. Sec- ond, we did not account for other gaseous pollutants, or environmental factors like temperature, humidity, and noise due to the unavailability of high-quality data. Additionally, we lacked recorded data regarding the time couples spent attempting to conceive before joining the NFPCP, which could lead to an underestimation of TTP. Some couples may have experienced unique circumstances during the study period that inter- rupted their pregnancy preparation, possibly overestimating TTP. Furthermore, the approach to identifying pregnancies relied on confir- mation by ultrasound, potentially missing early miscarriages. Conse- quently, caution should be exercised when comparing our findings with those of studies utilizing different criteria for defining pregnancies. Moreover, we did not have data related to fertility factors in couples, such as male sperm quality and frequency of intercourse. Finally, our study needs to be cautiously generalized to other populations due to the limitations of the sociodemographic background and not considering unplanned pregnancies. In conclusion, increased cycle-specific exposure to ambient PM25 was associated with decreased fertility and prolonged TTP in areas with higher pollution levels. These findings provide evidence of the effects of PMz2 5 on reproductive health and underscore the imperative for ongoing research and policy measures to mitigate the adverse effects of air pollution on fertility, particularly in highly polluted areas.",
    "Rong Zhang: Writing - review & editing, Writing — original draft, Visualization, Resources, Methodology, Formal analysis, Conceptuali- zation. Jun Zhao: Writing — review & editing, Writing — original draft, Resources, Methodology, Data curation, Conceptualization. Yue Zhang: Visualization, Methodology, Formal analysis, Conceptualization. Xiang Hong: Writing - review & editing, Methodology, Conceptualization. Hongguang Zhang: Software, Resources, Investigation, Data curation. Hanyue Zheng: Visualization, Formal analysis. Jingwei Wu: Method- ology, Formal analysis. Yuanyuan Wang: Writing - review & editing, Investigation. Zuoqi Peng: Investigation. Ya Zhang: Writing — review & editing, Writing — original draft, Visualization, Resources, Methodology, Formal analysis, Conceptualization. Lifang Jiang: Investigation, Data curation. Yueshu Zhao: Writing - review & editing. Qiaomei Wang: Supervision, Project administration. Haiping Shen: Supervision, Project administration. Yiping Zhang: Supervision. Donghai Yan: Supervision. Bei Wang: Writing - review & editing, Supervision, Methodology, Funding acquisition, Conceptualization. Xu Ma: Writing - review & editing, Supervision, Project administration, Methodology, Funding acquisition, Conceptualization. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. All authors of this manuscript are grateful to all the investigators, professionals, and participants who contributed to the National Free Pre- conception Check-up Project, as well as to the Tracking Air Pollution in China technical team that provided the open-access air pollution data. The PM2.5 exposure data are publicly available from Tracking Air Pollution in China (http://tapdata.org.cn/). The National Free Pre- conception Check-up Project data contains sensitive data and cannot be shared via public deposition because of information governance re- strictions in place to protect individuals’ confidentiality. Access to data for external researchers (not affiliated with the National Research Institute for Family Planning) requires researchers to be physically based in the institute. Access to data is available only once approval has been obtained through the individual constituent entities controlling access to the data."
]