[
    "The rapid advance in shotgun metagenome sequencing has enabled us to identify uncultivated functional mi- croorganisms in polluted environments. While aerobic petrochemical-degrading pathways have been extensively studied, the anaerobic mechanisms remain less explored. Here, we conducted a study at a petrochemical-polluted groundwater site in Henan Province, Central China. A total of twelve groundwater monitoring wells were installed to collect groundwater samples. Benzene appeared to be the predominant pollutant, detected in 10 out of 12 samples, with concentrations ranging from 1.4 μg/L to 5,280 μg/L. Due to the low aquifer permeability, pollutant migration occurred slowly, resulting in relatively low benzene concentrations downstream within the heavily polluted area. Deep metagenome sequencing revealed Proteobacteria as the dominant phylum, ac- counting for over 63 % of total abundances. Microbial α-diversity was low in heavily polluted samples, with community compositions substantially differing from those in lightly polluted samples. dmpK encoding the phenol/toluene 2-monooxygenase was detected across all samples, while the dioxygenase bedC1 was not detected, suggesting that aerobic benzene degradation might occur through monooxygenation. Sequence as- sembly and binning yielded 350 high-quality metagenome-assembled genomes (MAGs), with 30 MAGs harboring functional genes associated with aerobic or anaerobic benzene degradation. About 80 % of MAGs harboring functional genes associated with anaerobic benzene degradation remained taxonomically unclassified at the genus level, suggesting that our current database coverage of anaerobic benzene-degrading microorganisms is very limited. Furthermore, two genes integral to anaerobic benzene metabolism, i.e, benzoyl-CoA reductase (bamB) and glutaryl-CoA dehydrogenase (acd), were not annotated by metagenome functional analyses but were identified within the MAGs, signifying the importance of integrating both contig-based and MAG-based ap- proaches. Together, our efforts of functional annotation and metagenome binning generate a robust blueprint of microbial functional potentials in petrochemical-polluted groundwater, which is crucial for designing proficient bioremediation strategies. China, one of the world’s largest petrochemical producers, manages numerous petrochemical industrial zones and decommissioned petro- chemical sites (Qianzhan, 2022). The disposal and mismanagement of petrochemical waste have considerably impacted the environment, particularly in soil and groundwater, due to the leaching of hazardous substances such as benzene, chlorinated hydrocarbons, and polycyclic aromatic hydrocarbons (PAHs) (Chen et al., 2022). The presence of communities. In response, microbial communities at the polluted sites often possess the capacity to metabolize petroleum hydrocarbons (Suja et al., 2014). As a result, the natural degradation of these pollutants is mediated largely by indigenous microbial communities, whose func- tional capacity serves as effective biological indicators and cornerstones Existing research has shown that petrochemical pollution reduces microbial taxonomic diversity in groundwater (Gao et al., 2022; Liu et al., 2022), enriching microbial species capable of metabolizing pe- * Corresponding author at: State Key Joint Laboratory of Environment Simulation and Pollution Control, School of Environment, Tsinghua University, Beijing 0160-4120/© 2024 The Author(s). Published by Elsevier Ltd. This is an open access article under the CC BY-NC license (http://creativecommons.org/licenses/by- nc/4.0/). species with petrochemical-degrading capacity, researchers have culti- vated and isolated strains in environments containing petroleum hy- drocarbon (Borzenkov et al., 2006; Viesser et al., 2020; Wang et al., 2011; Zhang et al., 2012). Those petrochemical-degrading strains often belong to genera such as Pseudomonas and Bacillus (Rizzo et al., 2020; Zhang et al., 2010). Hydrocarbons in groundwater can undergo both aerobic and anaerobic degradation (Aburto et al., 2009; Farhadian et al., 2008), which are influenced by temperature, pH, salinity, and avail- ability of nutrients and electron acceptors (Farhadian et al., 2008). Oxygen serves as the electron acceptor in aerobic metabolism, while nitrate, sulfate, ferric, manganese, and carbon dioxide are involved in anaerobic processes. Because oxygen is often limited in groundwater, anaerobic degradation plays a more important role in in situ bioreme- diation than aerobic processes (Farhadian et al., 2008). Anaerobic degradation offers advantages such as low biomass production and readily available electron acceptors, sometimes making them the only choice for pollutant removal (Holliger et al., 1997). However, our un- derstanding of anaerobic degradation is not as comprehensive as that of aerobic degradation. For example, due to the limited knowledge of gene sequences encoding benzene and naphthoate carboxylases, it is chal- lenging to design specific PCR primers to amplify functional genes encoding aromatic hydrocarbon carboxylases (Meckenstock et al., Metagenomics, with its ability to detect both taxonomic and func- tional gene compositions, offers a more detailed picture of microbial communities than traditional culture or amplicon sequencing methods, which suffer from biases and limitations (e.g., the majority of indigenous petrochemical-degrading microorganisms have yet to be cultivated (Anthony et al., 2023)). To elucidate both aerobic and anaerobic petrochemical-degrading pathways, we collected groundwater samples from a petrochemical-polluted site in central China. We adopted both contig-based and Metagenome-Assembled Genome (MAG)-based stra- tegies of functional gene annotation to analyze metagenomic sequencing, enabling the reconstruction of benzene metabolic pathways within the groundwater. Our approach unveiled previously unidentified genomes with benzene degradation potentials.",
    "The groundwater samples in this study were collected from an abandoned petrochemical site located in Henan Province, China, covering an area of approximately 550,000 square meters. The original petrochemical enterprise had been in operation for approximately 40 years and was shut down in 2017, with surface facilities dismantled in 2018. The water table at the site was at a depth below 6 m, with the upper level composed of a mixture of fill soil and silty clay. In 2023, we conducted a sampling campaign by installing monitoring wells at 12 locations (Fig. 1). The tank farm area exhibited higher levels of pollu- tion. Since the groundwater level was also relatively high, the pollutants likely spread to downstream directions. Therefore, we installed moni- toring wells in the tank farm area, upstream (in the southwestern re- gion), downstream (in the northeastern region), and perpendicular to the groundwater flow direction. A total of 12 monitoring wells were established, with six wells (T1, T2, T3, T4, T5, and T6) positioned within the tank area and the remaining six wells (C1, C2, C3, C4, C5, and C6) situated in the non-tank area. All monitoring wells were constructed using Geoprobe 7822DT drilling rigs, employing the hollow auger drilling method with a bore- hole diameter of Φ210 mm conducted at a rotary speed not exceeding 0.3 m/min. The depth of the monitoring wells was 12 m, spanning across three distinct soil layers (Fig. S1). The well casing, composed of U-PVC, had a diameter of φ63 x 2.3 mm. The slot width of filter pipes was about 0.25 mm and the settling pipe length was approximately 0.5 m. Before installing the well casing, two layers of 80-mesh nylon mesh were wrapped around the filter pipe and secured at 0.3 m intervals. The filter material chosen was Φ1-2 mm quartz sand, with a filling height extending 0.5 m above the top of the filter pipe. Above the quartz sand, bentonite was added for water-stopping. After the construction was completed, the wells were washed to remove the fine particles from the water using a Baylor tube. The wells were left to stand for two weeks to ensure proper water stabilization, and the water levels after stabilization for the wells were within the range of 6.62 m to 8.29 m. Before sampling, the wells were flushed with a peristaltic pump until the volume of water extracted was three times that of the well tube. We collected a total of 12 groundwater min. The water samples were carefully placed in brown capped bottles, sealed, labeled, and transported to the laboratory immediately. During transportation, the samples were shielded from direct sunlight and stored in a portable 4℃ fridge. All samples were processed within 24 h after arriving at the laboratory. To collect microorganisms in ground- water samples, we filtered a volume of 4 L per well using a membrane with 0.22 μm pores (Millipore, Billerica, MA, USA). nitrite nitrogen, chloride ions, sulfate ions, bicarbonate ions, anionic surfactants, volatile phenols, calcium, magnesium, potassium, sodium, manganese, iron, cobalt, nickel, copper, arsenic, molybdenum, cad- mium, and antimony. Detailed testing methods are shown in Table S4. 1,2-dichloropropane, toluene, ethylbenzene, o,p-xylene, m-xylene, iso- propylbenzene, n-propylbenzene, 1,3,5-trimethylbenzene, tert-butyl- benzene, 1,2,4-trimethylbenzene, sec-butylbenzene, 4-isopropyltoluene, n-butylbenzene, and 15 semi-volatile organic compounds (SVOCs), i.e., phenol, 2-methylphenol, bis(2-chloroisopropyl)ether, 2,4-dimethylphe- nol, naphthalene, 2-methylnaphthalene, acenaphthene, dibenzofuran, fluorene, phenanthrene, anthracene, carbazole, dibutyl phthalate, pyr- ene, di(2-ethylhexyl) phthalate), as well as TPH (C6-C9) and TPH (C10- C40). VOCs in the samples were purged by high-purity nitrogen and adsorbed in a trap tube. The trap tube was then heated and purged with high-purity helium. The thermal desorbed components were separated by gas chromatography 8890 (Agilent Tech., Santa Clara, CA, USA) equipped with a DB-VRX column (Agilent Tech., Santa Clara, CA, USA), which had a length of 30 m, an inner diameter of 0.25 mm, and a film thickness of 1.4 μm. Detection was performed by mass spectrometry 5977 (Agilent Tech., Santa Clara, CA, USA), qualitatively by comparing the retention time of the target compound and standard mass spec- trometry or characteristic ions. Furthermore, the components were quantified by the internal standard method, whose internal standard solution (ρ = 25 μg/mL) was prepared using fluorobenzene and 1,4- dichlorobenzene-d4 (MEEPRC, 2012). SVOCs were extracted from the samples by dichloromethane. After dehydration, concentration, and volume adjustment, the extract was separated and detected by gas chromatography 8890 (Agilent Tech., Santa Clara, CA, USA) using a DB- 5MS column (Agilent Tech., Santa Clara, CA, USA), which had a length of 30 m, an inner diameter of 0.25 mm, and a film thickness of 0.25 μm. Detection was performed by mass spectrometry 5977 (Agilent Tech., Santa Clara, CA, USA), with qualitative determination based on the retention time of the target compound compared to standard mass spectrometry or characteristic ions. Similarly, these components were quantified using the internal standard method, whose internal standard solution (ρ = 2000 μg/mL) was prepared using 1,4-dichlorobenzene-d4, naphthalene-d8, anthracene-d10, phenanthrene-d10, chrysene-d12, and perylene-d12 (USEPA, 2018). TPH(C10-C40) was analyzed by gas chromatography. Specifically, extractable petroleum hydrocarbons were extracted from the water samples by dichloromethane. After dehydration, concentration, purification, and volume adjustment, the extracted liquid was detected by gas chromatography with a hydrogen flame ionization detector (FID) 7890A (Agilent Tech., Santa Clara, CA, USA), wherein qualitative determination was based on retention time and quantitative determination was based on comparison of the area of chromatographic peaks within the time window to that of the standard substance (MEEPRC, 2017a). TPH (C6-C9) in the samples was purged by high-purity nitrogen and adsorbed in the trap tube, which was heated and purged with high-purity nitrogen. The thermal desorbed compo- nents were separated by a gas chromatography column DB-VRX (Agilent Tech., Santa Clara, CA, USA), which had a length of 30 m, an inner diameter of 0.53 mm, and a film thickness of 3 μm. Detection was per- formed using a hydrogen FID 8890 (Agilent Tech., Santa Clara, CA, USA). The analysis was qualitative, based on the retention time, and Total genomic DNA was extracted from the groundwater samples using the E.Z.N.A.® Soil DNA Kit (Omega Bio-tek, Norcross, GA, USA). The concentration of extracted DNA was determined with TBS-380, its purity was determined with NanoDrop2000, and its quality was verified on 1 % agarose gel. Subsequently, the DNA extract was fragmented to an average size of approximately 400 bp using Covaris M220 (Gene Com- pany Ltd., Hong Kong, China) for paired-end library construction. The paired-end library was constructed using the NEXTflexTM Rapid DNA- Seq kit (Bioo Scientific, Austin, TX, USA). Adapters containing the full complement of sequencing primer hybridization sites were ligated to the blunt ends of the DNA fragments. Paired-end sequencing was performed on Illumina NovaSeq/Hiseq Xten platforms (Illumina Inc., San Diego, CA, USA) at Majorbio Bio-Pharm Technology Co., Ltd. (Shanghai, China), using NovaSeq Reagent Kits/HiSeq X Reagent Kits. The sequence information from metagenomic sequencing can be found in Table S5 of the supplementary material.",
    "We used Seqkit v0.15.0 to assess the quality of the raw sequencing reads. Subsequently, the raw reads were used to generate high-quality reads by removing adaptor sequences, trimming, and removing low- quality reads using the Trimmomatic v0.39 (ILLUMINACLIP:TruSeq3- PE.fa:2:30:10 LEADING:3 TRAILING:3 SLIDINGWINDOW:5:20 MIN- LEN:50). The resulting sequences were used for subsequent analyses. The phylogenetic profile of each sample was determined using Kraken v2.1.2 with the MiniKraken2_v1_8GB database (Wood and Salzberg, 2014). Kraken v2.1.2 classifies reads to the best matching location in the taxonomic tree, but does not estimate the abundances of species. We employed Bracken to use the taxonomic labels assigned by Kraken v2.1.2 to estimate the number of reads originating from each The high-quality reads were assembled into contigs using MEGAHIT v1.2.9, with a minimum length of 500 (Li et al., 2015). Open reading frames (ORFs) in contigs were identified using Prokka v1.14.6. A non- redundant gene catalog was constructed using MMseqs2 v13.45111 with 95 % sequence identity. Reads that had passed the quality control were mapped to the non-redundant gene catalog using coverM v0.6.1, and gene abundances in each sample were evaluated. The Kyoto Ency- clopedia of Genes and Genomes (KEGG) annotation for the non- redundant gene catalog was conducted using KofamScan v1.3.0 against the KEGG database with an e-value cutoff of 1e-5 (Aramaki et al., 2020; Kanehisa and Goto, 2000). Annotation of functional genes was carried out using the KEGG ontological hierarchies. We concatenated the clean reads from all the samples and assembled them using MEGAHIT v1.2.9 with a minimum length of 1,500. We then reconstructed high-quality draft genomes from the metagenomic data- sets, using three binning approaches with different algorithms or sta- tistical models, i.e., MetaBAT2 v2.15, CONCOCT v1.1.0, and MaxBin2 v2.2.7 (Alneberg et al., 2014; Kang et al., 2019; Wu et al., 2014). Three final bin sets were obtained and consolidated into a single, superior bin set with the Bin_refinement module integrated within MetaWRAP v1.2.1 (Uritskiy et al., 2018). By default, the minimum completion was 70 %, and the maximum contamination limit was 10 %. To ensure the quality and reliability of the bins, we used dRep v2.2.3 to de-replicate the ob- The taxonomy of each bin was determined using GTDB-TK v1.5.0. We annotated the genes of each bin using PROKKA v1.14.6. The KEGG annotation was performed using KofamScan v1.3.0 and the Open Reading Frames (ORFs) were predicted by Prokka v1.14.6. This anno- tation was performed based on the KOfam database, yielding the cor- responding KO numbers for the protein sequences. The taxonomic α-diversity was quantified using the Shannon index. The dissimilarity between samples was calculated using Bray-Curtis metrics to estimate β-diversity. Principal Co-ordinates Analysis (PCoA) based on Bray-Curtis distances was performed using the R package Vegan, and the R package ggplot2 was used for PCoA visualization. Abundance plots and correlation heatmaps were generated using the R package pheatmap. Among VOCs, benzene had the highest detection rate, which was detected in 10 out of 12 samples (Fig. 2). Other VOCs with detection rates exceeding 50 % of 12 samples included toluene (50 %), ethyl- benzene (58 %), o,p-xylene (50 %), isopropylbenzene (75 %), n-pro- pylbenzene (75 %), tert-butylbenzene (58 %), 1,2,4-trimethylbenzene (58 %), and sec-butylbenzene (58 %). Benzene, toluene, ethylbenzene, and xylene, collectively known as BTEX, are common pollutants in the soil and groundwater of petrochemical sites (Aburto and Peimbert, 2011; Chen et al., 2022; Sun et al., 2017). The highest benzene con- centration was observed in well T6, reaching 5,280 μg/L, followed by well T2 with 3,730 μg/L. Wells T4, T3, C5, and C2 exhibited benzene concentrations of 275.4 μg/L, 250.7 μg/L, 555.4 μg/L, and 183 μg/L, respectively. In addition, there was a wide range of VOCs in C5, including toluene (1,050 μg/L), ethylbenzene (998.4 μg/L), o,p-xylene (1,430 μg/L), m-xylene (765.6 μg/L), and 1,2,4-trimethylbenzene (547.7 μg/L) (Fig. 2), which was distinct from other wells. Although C5 was not within the tank zone, its proximity to the crude oil tank implies potential groundwater pollution from crude oil leakage. Regarding SVOCs, naphthalene exhibited the highest detection rate at 33 %, followed by dibutyl phthalate at 25 %. There was a wide range of SVOCs in T4, including 2-methylnaphthalene (279.58 μg/L), naph- thalene (149.16 μg/L), phenanthrene (112.04 μg/L), acenaphthene (29.01 μg/L), pyrene (26.84 μg/L), fluorene (26.28 μg/L), and anthra- cene (23.97 μg/L) (Fig. 2). TPH (C6-C9) was detected in all wells except C1 and C3, with the highest concentration of 2.22 mg/L in T6. TPH (C10-C40) was detected in all wells, with the highest concentration of 81.05 mg/L in T4, which was 26.7 to 337 times higher than in other The groundwater samples showed substantial levels of benzene pollution, while the overall pollution of SVOCs was less severe. Partic- ularly noteworthy was the substantial elevation of TPH (C10-C40) concentrations in T4, which was located in proximity to the sump oil tank area, raising the possibility of pollution originating from leakage of the sump oil tank. In contrast, the downstream wells, including T5, T6, T3, and C6, exhibited relatively lower concentrations of TPH (C10-C40). These differences could be attributed to the characteristics of the aquifer, which primarily consists of silty clay and thus impedes the migration of TPH (C10-C40) in the groundwater.",
    "Through taxonomic classification of the metagenome sequencing reads, we identified a total of 5,342 microbial species, which were classified into 1,522 genera spanning 41 phyla. Proteobacteria emerged as the dominant phylum in all wells, collectively accounting for over 60 % of the total abundance (Fig. 3a). Other abundant phyla included Actinobacteria, Euryarchaeota, and Firmicutes, collectively accounting for 3.18 % to 34.99 % in relative abundance. These phyla were also commonly detected in the groundwater of petrochemical sites (Puig- server et al., 2016; Song et al., 2023; Sun et al., 2017). The top 10 dominant genera identified in all wells (i.e., Pseudomonas, Acidovorax, Pseudoxanthomonas, Acinetobacter, Methanothrix, Brevundimonas, Sphin- gopyxis, Hydrogenophaga, Lysobacter, and Sphingomonas) are mostly known for degrading hydrocarbons (Kumar and De, 2023; Liao et al., 2021; Liu et al., 2020; Obayori et al., 2013; Yan et al., 2017; Yang et al., 2020; Yetti et al., 2018), collectively accounting for more than 25 % of the total abundance (Fig. 3b). In this study, microbial taxonomic α-diversities, measured by the Shannon index, exhibited a significant linear decline with increasing TPH (C10-C40) levels (Fig. 3c). Consistently, the microbial community composition in T4 was distinct from that of others (microbial taxonomic β-diversity analysis, Fig. 3d). Since the TPH (C10-C40) concentration in T4 was much higher than in other wells (Fig. 2), TPH (C10-C40) might be the primary factor contributing to the distinct community composi- Since benzene was the primary pollution of the groundwater (Fig. 2), we searched metagenome sequencing data for functional genes associ- ated with benzene degradation, encompassing both aerobic and anaer- obic degradation pathways (Farhadian et al., 2008). Multiple aerobic degradation pathways for benzene have been elucidated to date (Jin- drova et al., 2002). Accordingly, we reconstructed aerobic pathways for benzene degradation in the groundwater (Fig. 4a). When O2 serves as the electron acceptor, the benzene ring undergoes oxidation catalyzed by the dioxygenase subunit alpha of benzene dioxygenase (bedC1), resulting in the formation of cis-1,2-dihydrobenzene-1,2-diol (Gibson et al., 1968; Tan and Mason, 1990). It is further catalyzed by cis-1,2- dihydrobenzene-1,2-diol dehydrogenase to produce catechol. Fig. 3. Taxonomic classification of microbial communities in the groundwater samples at (a) the phylum and (b) genus level. Relative abundance is calculated as the number of sequences associated with a specific phylum or genus divided by the total sequence count. (c) the linear relationship between microbial taxonomic α-diversity and TPH (C10-C40) concentrations. (d) microbial taxonomic compositions revealed by PCoA analysis. Each data point in (c) and (d) corresponds to an Alternatively, the benzene ring is initially oxygenated to form phenol by phenol/toluene 2-monooxygenase (NADH) P0/A0 (dmpK). Subse- quently, phenol was converted to catechol (Nordlund et al., 1990), which is then bifurcated into two distinct pathways. In the first pathway, catechol 1,2-dioxygenase (catA) catalyzes the conversion of catechol into cis,cis-muconate, which is subsequently transformed by muconate cycloisomerase (catB) into (+)-muconolactone. Further catalysis by muconolactone D-isomerase (catC) results in the formation of 3-oxoadi- pate enol-lactone (Houghton et al., 1995). 3-oxoadipate enol-lactone is converted to 3-oxoadipate by 3-oxoadipate enol-lactonase (pcaD) in the presence of water (Kowalchuk et al., 1994), which is then transformed by 3-oxoadipate CoA-transferase (pcaI) into 3-oxoadipyl-CoA (Parales and Harwood, 1992). Under the action of acetyl-CoA acyltransferase (fadA), 3-oxoadipyl-CoA is further converted into acetyl-CoA (Yang and Elzinga, 1993), subsequently entering the citrate cycle. In the second pathway, catechol reacts with O2 through catechol 2,3-dioxygenase (dmpB) to form 2-hydroxymuconate semialdehyde (Benjamin et al., 1991). This compound could be further catalyzed by 2-hydroxymuco- nate-semialdehyde hydrolase (dmpD) to produce 2-oxopent-4-enoate (Nordlund and Shingler, 1990), or it may undergo sequential process- ing by aminomuconate-semialdehyde/2-hydroxymuconate-6- semialdehyde dehydrogenase (dmpC), 4-oxalocrotonate tautomerase (praC), and 2-oxo-3-hexenedioate decarboxylase (dmpH), with CO2 being released (Kasai et al., 2009). 2-oxopent-4-enoate could be con- verted into 4-hydroxy-2-oxopentanoate by 2-keto-4-pentenoate hydra- tase (mhpD) (Diaz et al., 2001), followed by the generation of pyruvate and acetaldehyde through 4-hydroxy 2-oxovalerate aldolase (mhpE) catalysis (Baker et al., 2012). Pyruvate enters the glycolysis process for metabolism, while acetaldehyde, catalyzed by acetaldehyde dehydro- dmpK was detected across all samples but bedC1 was not detected in any samples, suggesting that aerobic degradation of benzene in the groundwater may preferentially occur through monooxygenation. The relative abundances of functional genes associated with the aerobic benzene degradation, particularly the conversion of catechol to 2- hydroxymuconate semialdehyde, were much higher than those linked to the catechol oxidation to cis,cis-muconate (Fig. 4b), suggesting that benzene aerobic degradation likely predominantly occurred through the 2-hydroxymuconate semialdehyde route. The high abundance of the praC gene across all samples could be attributed to its involvement in multiple pathways, including the degradation of benzoate, dioxin, xylene, and various aromatic compounds. Relative abundances of several genes, i.e., dmpK, fadA, dmpD, mhpD, and mhpE, exhibited a significant positive correlation with pollutants (Fig. 4c). Among them, the relative abundance of dmpK, responsible for the initial trans- formation of the benzene ring under aerobic conditions, was positively correlated with both benzene and TPH (C6-C9).",
    "Although three initial activation mechanisms for benzene under anaerobic conditions, i.e., methylation, carboxylation, and hydroxyl- ation, have been considered, proteogenomic studies have only identified proteins involved in benzene carboxylation (Atashgahi et al., 2018; Luo et al., 2014). Moreover, the carboxylation reaction of benzene under non-biological conditions has been documented (Yamada et al., 2008). As a result, there is a consensus that the initial activation step in anaerobic benzene degradation likely entails the direct carboxylation of benzene to benzoate (Toth et al., 2021). We reconstructed an anaerobic carboxylation pathway for benzene degradation in the groundwater (Fig. 5a), which is catalyzed by 4-hydroxy-3-polyprenylbenzoate decarboxylase (ubiD) and flavin prenyltransferase (ubiX) (Abu Laban aided by ATP and CoA, to form benzoyl-CoA (Schuhle et al., 2003), which undergoes further transformation by benzoyl-CoA reductase subunit C (bcrC) or benzoyl-CoA reductase subunit BamB (bamB) into cyclohexa-1,5-diene-1-carbonyl-CoA (Kung et al., 2009). In the presence of H2O, the compound is converted into 6-hydroxycyclohex-1-ene-1- carbonyl-CoA by cyclohexa-1,5-dienecarbonyl-CoA hydratase (dch) (Breese et al., 1998). A hydrogen atom is then removed from the hy- droxyl group of 6-hydroxycyclohex-1-ene-1-carbonyl-CoA through the action of 6-hydroxycyclohex-1-ene-1-carbonyl-CoA dehydrogenase (had), resulting in the formation of 6-oxocyclohex-1-ene-1-carbonyl- CoA (Breese et al., 1998). The released hydrogen atom participates in a reaction with NAD + to produce NADH. In the presence of H2O, 6-oxo- cyclohex-1-ene-1-carbonyl-CoA is catalyzed by 6-oxocyclohex-1-ene- carbonyl-CoA hydrolase (oah) to produce 3-hydroxypimeloyl-CoA (Kuntze et al., 2008), which undergoes further catalysis by 3-hydrox- yacyl-CoA dehydrogenase (fadJ) to release a hydrogen atom from the hydroxyl group, forming 3-Ketopimelyl-CoA (Campbell et al., 2003). The binding of 3-ketopimelyl-CoA to CoA, catalyzed by acetyl-CoA acyltransferase (fadA), generates glutaryl-CoA and acetyl-CoA (Snell et al., 2002). Glutaryl-CoA could be directly converted to crotonoyl-CoA by glutaryl-CoA dehydrogenase (GCDH), with the release of CO2 (Rao et al., 2006). Alternatively, it could undergo stepwise catalysis by glutaryl-CoA dehydrogenase (acd) and glutaconyl-CoA decarboxylase subunit alpha (gcdA) to form crotonoyl-CoA (Braune et al., 1999; Wischgoll et al., 2009), which reacts with H2O to generate (S)-3- hydroxybutanoyl-CoA by enoyl-CoA hydratase (paaF). (S)-3- hydroxybutanoyl-CoA is converted to acetoacetyl-CoA catalyzed by 3- hydroxybutyryl-CoA dehydrogenase (paaH) (Teufel et al., 2010). Finally, acetoacetyl-CoA is transformed into acetyl-CoA by acetyl-CoA C-acetyltransferase (ACAT), entering the citrate cycle (Nesbitt et al., 2010). However, bamB and acd were not identified in the non-redundant gene catalog (Fig. 5a). The relative abundances of functional genes associated with the anaerobic benzene degradation were largely similar across all samples (Fig. 5b). ACAT was markedly more abundant than other functional genes, primarily due to its involvement in various fatty acid metabolism processes (Campbell et al., 2003). BadA was significantly negatively correlated with pollutants except for TPH(C10-C40), whereas fadA was significantly positively correlated with pollutants except for TPH(C10- We employed the MetaBAT2, MaxBin2, and CONCOCT algorithms to assemble 1199, 253, and 377 genome bins, respectively. We then refined and merged those bins with strict criteria, requiring a minimum completeness threshold of 70 % and a contamination threshold of no more than 10 % (Fig. S2). As a result, we obtained a total of 367 high- quality MAGs. To further enhance the quality of our MAG collection, we performed a redundancy reduction process, resulting in a final set of We identified several MAGs carrying key genes associated with aerobic benzene degradation from 350 MAGs (Table S7). Among them, three MAGs (bin.222, bin.330, and bin.199) harbor relatively complete sets of genes responsible for aerobic benzene metabolism. Based on the taxonomy classification from the GTDB database, bin.222 belongs to the genus Zoogloea and bin.330 belongs to the family Nevskiaceae, while bin.199 is a close relative of Limnobacter sp001601825. Zoogloea strains are key benzene degraders, with well-characterized pathways respon- sible for aromatic hydrocarbon degradation (Jechalke et al., 2013; Weelink et al., 2007). In addition, bin.294 affiliated with Acinetobacter modestus and bin.110 affiliated with the genus Aquabacter encompass the entire metabolic pathway genes from catechol to acetyl-CoA, while no MAG was found to contain bedC1. It’s important to note that these obtained MAGs may not represent entirely complete genomes due to binning contamination. However, they hold substantial promise for novel functional potentials in benzene degradation. To gain deeper insights into the genetic organization of these MAGs and the genomic arrangement of genes associated with benzene degra- dation, we conducted an in-depth genomic gene arrangement structure analysis on bin.222 and bin.110 and found that genes associated with benzene degradation were either situated adjacent to one another or closely positioned within the contigs (Fig. S3), revealing their functional proximity and coordinated role (Mihelcic et al., 2019). For example, there was a consecutive sequence of genes, including dmpK, praC, mhpE, dmpH, and dmpC in the contig k133_4851369 of bin.222. Similarly, there was a consecutive sequence of four genes, i.e., pcaD, pcaI, catC, and fadA in the contig k133_8310767 of bin.110, reinforcing their functional as- sociation in benzene degradation.",
    "metabolism, were not identified in the non-redundant gene catalog but were identified in the MAGs of bin.27, bin.284, bin.310, and bin.184. One possible explanation is that metagenome functional analysis relies on sequences assembled for individual samples, potentially overlooking genes with sequences too short to be annotated. In contrast, binning combines sequence reads from all samples prior to assembly, increasing the likelihood of generating longer sequences suitable for accurate We selected electron acceptors and pollutants with a detection rate higher than 50 % and conducted correlation analyses with MAGs harboring genes associated with aerobic benzene degradation (Table S7) and genes associated with anaerobic benzene degradation (Table S8). Among MAGs associated with aerobic degradation, there were signifi- cant negative correlations between benzene and the abundances of bin.199, bin.331, bin.274, and bin.251 (Fig. 6). For MAGs associated with anaerobic degradation, there were significant negative correlations between benzene and the abundances of bin.27 and bin.133, while there were significant positive correlations between benzene and the abun- dances of bin.215 and bin.341. Furthermore, there were significant correlations between TPH (C6-C9) and bin.331, bin.274, bin.251, bin.133, bin.215, and bin.341, underlining their potential role in TPH (C6-C9) degradation. Likewise, there were significant correlations be- tween TPH (C10-C40) and bin.330, bin.159, bin.331, bin.336, bin.274, bin.251, bin.133, and bin.215. Four MAGs, i.e., bin.331, bin.274, bin.133, and bin.251, were significantly negatively correlated with most of the pollutants, while bin.215 and bin.341 were significantly posi- tively correlated with most of the pollutants, which warranted further analysis for possible roles in benzene degradation. Only three out of 15 MAGs containing genes associated with anaer- obic benzene degradation can be classified at the genus or species level (Table S8), suggesting that our knowledge about anaerobic benzene- degrading microorganisms is highly limited. In addition, we did not identify a single MAG containing all the genes required for anaerobic benzene degradation. Key genes such as paaF, paaH, and ACAT were nearly universally present across all the MAGs, while the presence of other related genes varied (Table S8). BadA encoding an enzyme responsible for catalyzing the conversion of benzoate to benzoyl-CoA was exclusively found in bin.133 belonging to the order Burkholder- iales. The genes bamB and acd, crucial for anaerobic benzene Benzene degradation requires various electron acceptors such as nitrate, sulfate, chlorate, permanganate, and ferric iron under anaerobic conditions, with sulfate having a higher priority over the others (Fraser, 2007; van der Zaan et al., 2012). For example, the conversion of glutaryl-CoA to glutaconyl-CoA, catalyzed by acd, requires electron ac- ceptors for anaerobic reduction (Fig. 5a). We showed that bin.301, bin.27, and bin.133 were significantly negatively correlated with per- manganate and nitrate (Fig. 6). Among them, bin.133 belongs to the order Burkholderiales, which possesses the capability for nitrate reduction and has been identified in the production water of oil reser- voirs (Feng et al., 2011). Bin.215, a member of the family Fig. 6. Correlations between MAGs with benzene degradation and pollutants or electron acceptors. The statistical significance is shown as: *, p < 0.05; **, p < 0.010; Syntrophorhabdaceae capable of using simple aromatic compounds as electron donors under strictly anaerobic conditions (Qiu et al., 2008; Qiu et al., 2004), was significantly negatively correlated with sulfate but significantly positively correlated with permanganate and nitrate. Although sulfate or other sulfur compounds cannot be used as electron acceptors, they might be present in anoxic areas of sewage sludge treatment plants or other anoxic habitats where methanogenic or sulfate-reducing bioreactions might occur (Qiu et al., 2008; Qiu et al., 2004). There were a few correlations between MAGs and iron/manga- nese, which might be attributed to their multiple valent forms that cannot differentiate electron acceptors from electron donors by our assays. influence the microbial communities in groundwater, thereby affecting the reliability and generalizability of our findings. In addition, the choices of algorithms for metagenomic assembly and annotation may result in biases in annotating certain functional genes or species, leading to the omission or underestimation of certain microbial species or metabolic pathways. It is thus suggested that the results should be validated in future studies by increasing the sample size or expanding the study to other geographical locations or environmental conditions in future studies. Additional bioinformatics tools can be utilized for comparative analyses during the processing of metagenomic data.",
    "Currently, the selection and isolation of microbial strains capable of degrading pollutants are primarily conducted through cultivation (Borzenkov et al., 2006; Viesser et al., 2020; Wang et al., 2011; Zhang et al., 2012), which involves cultivating, isolating, and purifying strains from environments contaminated with petroleum hydrocarbons, such as soil, sediments, and sludge. Previous studies have identified a wide array of species with the ability to degrade petroleum hydrocarbons, including bacteria, fungi, and algae. However, culture-based methods have sig- nificant limitations because most environmental microbes cannot be cultured (Anthony et al., 2023), resulting in an incomplete under- standing of functional microbes within communities and the unclear mechanisms of their synergistic interactions. One consequence is that combining strains to create microbial consortia often results in signifi- cant uncertainties in degradation efficiency (Hassanshahian et al., 2014). Thus, gaining a comprehensive understanding of functional mi- crobes within communities is critical for advancing environmental mi- crobial remediation. In this study, deep metagenome sequencing showed that Proteobacteria, accounting for over 63 % of the total abundance, emerged as the dominant phylum in groundwater (Fig. 3a). This finding was consistent with previous studies in groundwater sam- ples of petrochemical sites (Chen et al., 2022; Sun et al., 2017). An increased abundance of α- and γ-Proteobacteria, with notable genera including Zoogloea, Pseudomonas, and Bacillus, has been observed in petrochemical-polluted environments (Kim et al., 2020). Additionally, on the genus level, Pseudomonas and Acinetobacter were identified (Fig. 3b), both known for their ability to produce biosurfactants that enhance the solubility of petroleum hydrocarbons (Khan et al., 2017). This study employed metagenomic analysis to elucidate the composition and diversity of microbial communities in groundwater at a petrochemical site, as well as their response to petroleum hydrocarbon. Through metagenomic sequence assembly and binning, this study investigated the functional species and metabolic pathways associated with benzene degradation in groundwater. As there was a significant negative correlation between petroleum hydrocarbon concentration and microbial α-diversity, hydrocarbon pollution substantially impacted microbial community structure. We also found that benzene metabolism in groundwater was more likely facilitated by monooxygenase rather than dioxygenases, which arose from oxygen-limited conditions in the groundwater environment. Among the 15 MAGs that contained genes for anaerobic benzene degradation, 12 were not previously documented in existing databases, suggesting that our current understanding of anaerobic benzene-degrading functional species in natural environ- ments is highly limited. Our study provides a methodological exemplar for using meta- genomic analyses to explore microbial communities in polluted envi- ronments, offering valuable insights for future research. By unveiling metabolic pathways associated with benzene biodegradation and emphasizing the role of environmental factors, this study lays the groundwork for more effective sustainable bioremediation strategies. Looking ahead, one promising future direction is the exploration of gene expression profiling and metabolic modeling to elucidate the regulatory networks and metabolic fluxes of anaerobic benzene degradation. Optimizing the potential of the microbial community for enhanced High concentrations of petroleum hydrocarbons exert significant inhibitory effects on soil microbial communities, interfering with their metabolic processes, damaging cell membrane structures, hindering cellular respiration, and leading to microbial death or reduced numbers. As a result, species diversity is reduced, a phenomenon observed in both soil and groundwater (Gao et al., 2022; Liu et al., 2022; Dasgupta et al., 2018). In this study, the microbial taxonomic α-diversities, measured by the Shannon index, exhibited a significant linear decline with increasing TPH (C10-C40) levels (Fig. 3c), consistent with the previous research Ruihuan Zhang: Writing – review & editing, Writing – original draft, Visualization, Methodology, Investigation, Data curation. Zhen- cheng Ye: Investigation. Xue Guo: Project administration, Methodol- ogy, Investigation. Yunfeng Yang: Writing – review & editing, Project administration, Methodology, Conceptualization. Guanghe Li: Super- vision, Methodology, Conceptualization. In groundwater systems, benzene may be degraded aerobically or anaerobically (Farhadian et al., 2008). Aerobic degradation involves the oxidation of benzene molecules either through monooxygenation or dioxygenation processes (Jindrova et al., 2002). Our findings indicated that the monooxygenase dmpK was present in all groundwater samples analyzed, whereas the di-oxygenase bedC1 was not detected in any samples (Fig. 4b). This observation suggested that aerobic degradation of benzene predominantly occurred through monooxygenation, likely due to the constrained conditions of limited oxygen availability in The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper.",
    "However, bear in mind several caveats in this study. Groundwater samples were collected from a relocated petrochemical production site in Henan Province, China. However, both geographical location and"
]