[
    "Maintaining good surface water quality is essential for protecting ecosystems and human health. Henan Province has long faced challenges related to water scarcity and severe water pollution. To support effective management of water pollution in Henan Province and provide insights for regional water pollution management, we collected extensive water quality monitoring data and applied spatial autocorrelation along with random forest to analyze the sources of heavily polluted areas. Results indicate that the spatial pollution pattern of surface water quality in Henan Province can be generally classified as insignificant pollution in the north, heavy pollution in the central regions, and light pollution in the south. Heavily polluted areas are mainly located in Zhengzhou, Luoyang, and Kaifeng. Key indicators affecting water quality in these regions are chemical oxygen demand (CODmn), dissolved oxygen (DO), ammonia nitrogen (NH3-N), and total phosphorus (TP), with urban sewage and industrial wastewater identified as the main causes of deterioration. These results not only provide a scientific basis for the systematic management of surface water quality pollution in Henan Province but also provide a reference for regional water pollution management. With accelerated urbanization, human activities have gradually become the primary drivers of water pollution (Li et al., 2024a). The spatial characteristics of surface water pollution are no longer domi- nated by a single river or watershed (Yuan et al., 2024). However, most studies on surface water pollution focus on the scientific selection and refinement of water quality index (WQI) to evaluate pollution levels (Chen et al., 2022; Xu et al., 2022; Yan et al., 2022), with limited research examining the spatial correlations of water pollution. Shanmugasundharam et al., 2023), and machine learning based algo- rithms (Shah et al., 2021; Zamani et al., 2023). Among these, random forest models have shown high accuracy in classifying and predicting water quality, offering cost-effective alternatives to process-based ap- proaches and addressing the limitations of statistical methods in capturing complex relationships among variables (Lap et al., 2023; Manzar et al., 2022). Meanwhile, comparative studies on machine learning techniques have further shown that random forests perform exceptionally well with large datasets (Fernandez-Delgado et al., 2014). Therefore, this study employs a random forest regression model to analyze pollution sources. How to accurately interpret the main factors affecting regional water quality is a key issue. After evaluating surface water pollution and identifying spatial clustering patterns, heavily polluted sections of multiple rivers may converge into a single high-pollution area. The main factors affecting individual rivers or basins are no longer representative. Therefore, the vast amount of data and the intricate relationships be- tween variables pose significant challenges for the analysis of pollution sources. Various methods have been proposed for analyzing contami- nation sources, including process-based methods (Kavurmaci, 2023; Rowe et al., 2023), statistical methods (Lu et al., 2023; Henan Province, which has the third-largest population in China and spans four major watersheds, faces significant water pollution chal- lenges. It ranks among the top in the country in CODmn and NH3-N discharges, with 1445,700 tons of CODvm and 46,300 tons of NH3-N discharged annually (Shi et al., 2024). Henan’s complex water systems and substantial human disturbances make it an ideal region to study the spatial correlations of water pollution. Severe surface water pollution heightens the urgency for effective management and comprehensive evaluation of water quality and pollution sources. To date, studies on Received 7 May 2024; Received in revised form 15 November 2024; Accepted 5 December 2024 Available online 12 December 2024 0147-6513/© 2024 The Author(s). Published by Elsevier Inc. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). water pollution in Henan Province have largely been limited to specific watersheds (Liu and Zheng, 2022; Wei et al., 2023) or single indicator (Li et al, 2024b), with few comprehensive evaluations across the entire region. Therefore, we take Henan Province as the research object. This study aims to 1) identify regional pollution patterns by exam- ining the spatial dependence of surface water quality in Henan Province; 2) determine the key indicators influencing water quality and identify major pollution sources through random forest analysis. These findings will provide critical insights for optimizing the allocation of water quality monitoring resources, facilitating comprehensive water quality management, and enhancing targeted governance strategies.",
    "Henan Province, located in central China, spans longitudes 110°21'~116°39 and latitudes 31°23’~36°22'N, covering an area of 167,000 square kilometers. The region experiences an average annual precipitation of 776.3 millimeters and an average annual runoff of 31.3 billion cubic meters from natural rivers, contributing to a total water resource volume of 41.4 billion cubic meters. This includes 31.3 billion cubic meters of surface water and 20.47 billion cubic meters of shallow groundwater. Unique in China, Henan intersects four major river basins: the Yellow River Basin, the Yangtze River Basin, the Huai River Basin and the Hai River Basin. Surface water constitutes a significant portion of Henan’s resources, serving as a primary source for agricultural irri- gation, urban water supply, and industrial use. However, rapid indus- trial development, urbanization, and population growth have led to rising levels of industrial wastewater and domestic sewage, intensifying The water quality monitoring data and latitude/longitude data from 1 December 2022-30 June 2024 used in the study were obtained from the China Environmental Monitoring General Station (http://www. cneme.cn) and the Qingyue Open Environmental Data Centre (htt p://data.epmap.org). We identified 72 water quality monitoring tran- sects by matching them with latitude and longitude data and excluding transects undergoing long-term maintenance or added during the study period. The water quality monitoring data consist of water temperature, pondus hydrogenii (PH), DO, CODMn, NH3-N, TP, total nitrogen (TN), turbidity (NTU), conductivity and water quality classification. The water quality category is determined using the single factor evaluation method based on the “Environmental Quality Standards for Surface Waters” (GB 3838-2002). These data are shown in Appendix 1. For the analysis of sources of heavy pollution, water temperature and conduc- tivity were excluded due to their minimal influence on water pollution. Water quality indicators were monitored every 4 hours, and data for all sections from December 1, 2022, to June 30, 2024, are provided in Table S1, with the water quality data for heavily polluted areas shown in Table S2. and randomness of variable distribution across two or multi- dimensional space, calculating a single value to represent spatial dis- tribution patterns over the entire study area (Lin et al., 2024). The for- mula is as follows: where z; is the deviation of the water quality classification of monitoring section i from the overall mean; z; is the deviation of the classification of monitoring section j from the overall mean; w;; represents the spatial weight between sections i and j; n is the total number of monitoring sections; So is the sum of all spatial weights. Generally, Global Moran’I ranges from —1 and 1. When Global Moran’I > 0, it indicates a positive spatial correlation of surface water quality in Henan Province, with higher values signifying stronger spatial correlation. Conversely, when Global Moran’T < 0, it suggests a negative spatial correlation, with lower values reflecting greater spatial variation. A value of I = 0 denotes a random spatial distribution of water quality, implying no spatial sta- tistical significance (Lin et al., 2024). Local Moran’l builds on Global Moran’I to evaluate the local clus- tering status of each section (Qu et al., 2024). The formula is as follows: Where Local Moran’l; is the local Moran’s index for the monitoring section i; yj represents the water quality classification of the monitoring sectioni;y is the mean water quality classification across all sections; S is the standard deviation; and «;; denotes the spatial weight between sections i and j. When Local Moran’l; > 0 and z; > 0, the water quality exhibits a high-high clustering pattern within neighboring areas. Conversely, when Local Moran’l; and z; < 0, a low-low clustering pattern is indicated, reflecting regions of similar low values in adjacent areas (Qu et al., 2024). 2.3.1.2. Construction of the Spatial Weight Matrix. The spatial weight matrix assigns a weight value to each pair of geographic units, reflecting the degree of spatial correlation between them. A larger weight value indicates a stronger spatial correlation between the units (Janatabadi and Ermagun, 2024). Spatial weight matrices are typically categorized into adjacency matrices and distance weight matrices. The adjacency matrix is constructed on the basis of the adjacency of spatial units, and is suitable for discrete spatial units (such as administrative districts, land use units, etc.), especially for the study of “adjacent” or “contact” as the main spatial correlation. The distance weight matrix, on the other hand, defines weights based on the distance between spatial units, assigning higher weights to units in closer proximity. This matrix is well-suited for continuous geographic phenomena (e.g., environmental and ecological data) where distance-based correlation is of primary interest (Griffith and Peres-Neto, 2006). Since water quality monitoring transects are not contiguous, this study uses the distance weighting matrix.",
    "The distance weight matrix can be constructed using methods such as distance banding, K-nearest neighbor, and adaptive kernel. The distance band method applies a fixed distance threshold, treating units within this range as neighbors with positive weights, while units beyond are assigned zero weight. This method is suitable for continuous spatial data (e.g., environmental pollution levels) and for spatial data analysis where distance is the primary correlation factor, as in studies of diffusion ef- fects or inter-regional influences. The adaptive kernel method adjusts the bandwidth based on the spatial density of units, applying an adaptive kernel function, often Gaussian, which is ideal for heteroge- neous spatial densities, as in outbreak propagation or environmental monitoring requiring localized analysis. The K-nearest neighbor method defines spatial relationships based on the nearest neighbors rather than physical distance, making it suitable for irregularly distributed spatial points, such as monitoring stations (Kubara and Kopezewska, 2024; Tan et al., 2024). This study uses the K-nearest neighbor method to construct the distance weight matrix for water quality monitoring stations, assigning ;; = 1 if cell j is among the nearest K neighbors of cell i; otherwise, w;; = 0. From the sensitivity analysis (Fig. 2), we observe that as K increases, Global Moran’I decreases, indicating a reduction in the overall spatial correlation of surface water pollution. Additionally, the number of sta- tistically insignificant monitoring points declines. Beyond K = 6, the decline in the number of insignificant points slows relative to the decrease in Moran’s Index. Therefore, a value of K = 5 is selected. 2.3.1.3. Evaluation methodology. In the global spatial autocorrelation analysis, p-value and z-score are used to determine whether spatial dis- tribution patterns are statistically significant or generated by random factors. The p-value indicates the probability that the observed data patterns are due to chance (null hypothesis). If the p-value is is below a specified significance level, the null hypothesis is rejected, suggesting that the observed patterns are statistically significant. For instance, p <0.01 implies a 99 % confidence level in rejecting the null hypothe- sis, indicating the presence of spatial autocorrelation in the data (Qu et al., 2024). The z-score, as a measure of standard deviation, indicates the degree of clustering or dispersion: values of z > 1.65 suggest a clustered distribution, z<-1.65 implies a dispersed pattern, and z-scores between —1.65 and 1.65 indicate a random distribution (Chen, 2023). 2.3.2.1. Theory. Random forest is an ensemble learning algorithm composed of multiple decision trees. Each decision tree, as a basic unit, divides the dataset recursively into smaller subsets until certain stopping criteria, such as maximum depth or minimum sample size per node, are met (Fig. 3). During the construction of each tree, random forest utilizes bootstrap sampling to select random subsets of data and random feature subsets, promoting model diversity and improving generalization. To make predictions, random forest combines outputs from all trees by averaging, thus producing a final regression prediction. This aggrega- tion minimizes overfitting risks commonly associated with individual decision trees, making random forest highly effective for complex and high-dimensional data (Amiri et al., 2024; Fernandez-Delgado et al., 2014). The Out-of-Bag (OOB) score serves as a key metric within random forest for evaluating model performance and feature importance. During the construction of a random forest, each decision tree is trained on a subset of the original dataset randomly sampled with replacement, resulting in some data samples not being included (i.e., OOB samples) for each tree. As each decision tree is trained on a bootstrap sample (i.e., a subset randomly sampled with replacement), certain data points are excluded from each trees training set. Each tree’s OOB samples can be used for model validation by comparing predicted values to true labels, with the average OOB error providing an assessment of the model's predictive accuracy on unseen data. The OOB score thus reflects the generalization capability of the model. Additionally, the model’s sensi- tivity to each feature can be analyzed by examining changes in predic- tion accuracy on OOB samples, offering insights into feature importance. This analysis helps in understanding the model’s internal workings and relationships between features (Tesoriero et al., 2024). of 1000. The relationship between the number of trees and OOB error (Fig. 4) indicates that as the tree count increases, the error decreases, stabilizing beyond 30 trees. Therefore, Therefore, we maintained the count at 1000. The minimum number of splits was initially set to 5. The relationship between the minimum number of splits and cross-validation error (Fig. 5) shows that the error increases as the number of splits rises, peaking at 42 splits, after which it fluctuates continuously. The mini- mum error occurs at 2, so the minimum number of splits for the model was set to 2.",
    "To address the randomness in bootstrap sampling, we set a random seed, which initializes the random number generator to ensure repro- ducible and optimized results (Ludwig et al., 2024). After conducting 100 trials and comparing correlation coefficient (R*), we determined the optimal random seed value for this model to be 14. 2.3.2.2. Sample set division. The sample dataset comprises water quality indicators for monitoring sections in heavily polluted areas, collected between December 1, 2022, and June 30, 2024. After preprocessing, a total of 152,056 data points across 19,007 samples were selected. The division of the training data set test dataset directly determines the ac- curacy of the random forest algorithm for surface water quality assess- ment. Too large a training portion may lead to overfitting, while too small a portion reduces generalization capacity (Ludwig et al., 2024). A training dataset proportion of 70-90% is generally recommended (Alnahit et al., 2022). We divided the dataset into a 70:30 training-to-test ratio, with the water quality category as the dependent variable and the remaining indicators as independent variables. 2.3.2.3. Parameter setting. The number of trees and the minimum number of splits are critical parameters impacting model accuracy (Behrouz et al., 2022). The number of trees is set between 100 and 2000 in increments of 50, which is usually set with the goal of minimum OOB error, and the number of minimum splits is set between 1 and 7 (depending on the number of independent variables) in increments of 1, which can be set by aiming for minimum cross-validation error (Alnahit et al., 2022; Rodriguez-Galiano et al., 2015). We set an initial tree count The surface water quality in Henan Province, as shown in Fig. 6, is predominantly classified as Class II, which accounts for 42.60 % of the total. The combined proportion of Class III and higher water quality is 87.60 %, with Class I at 23.25 % and Class III at 21.75 %. Overall, the surface water quality in Henan Province is generally good. In the Huai River Basin, water quality is primarily Class II and III, making up over 80 % of the total; in the Hai River Basin, Class III pre- dominates, with 79.95 % of water quality being above Class III. The Yangtze River Basin has an excellent water quality status, with over 97.92 % classified as Class I or II, and no water quality rated as Class IV or V. In the Yellow River Basin, Class II water quality is most common, and 95.83 % of the water quality is rated Class III or higher, with no Class V water quality observed. Overall, the water quality in Henan ranks from best to worst in the following order: Yangtze River Basin, Yellow River Basin, Hai River Basin, and Huai River Basin. The Global Moran’ is 0.598, indicating a significant positive spatial correlation among the water quality monitoring sections. The z-score is 13.47, exceeding the critical threshold of 2.58, demonstrates a clear spatial aggregation in the distribution of water quality measurements, while a p-value of 0.001 suggests that the probability of this clustering pattern occurring by chance is less than 1 %. These findings support a strong spatial aggregation of water quality, providing a basis for the identification of contaminated regions and further analysis of pollution sources. Fig. 7 illustrates the spatial clustering of water quality monitoring sites across Henan Province. Insignificant points (grey points) are mainly concentrated in the north and south-central regions, showing no significant spatial dependence. Low-low clustering points (red points) are concentrated in southern Henan, particularly in the Yangtze River Basin and the south-central Huai River Basin, indicating areas of high- quality water that serve as sources of excellent water quality in Henan. High-high clustering points (black points) appear predominantly in central Henan, particularly within the southern Yellow River Basin and the northern Huai River Basin, identifying these areas as high- priority regions for water quality management due to their higher pollution levels compared to other regions. Fig. 8 illustrates the confidence levels in the spatial clustering pat- terns of water quality monitoring sections. Sections with insignificant clustering are mainly located in the northern and south-central parts of Henan, where clustering patterns are weak, and water quality moni- toring points are randomly distributed. Sections with a p-value of 0.001 are concentrated in central and southwestern Henan. In central Henan, these sections exhibit a high-high clustering pattern, indicating heavily polluted areas with less than a 0.1 % probability of this pattern occur- ring by chance, emphasizing the need for focused management. In southwestern Henan, the monitoring sections show a low-low clustering pattern, and the p-value of 0.001 highlights the Yangtze River Basin as a high-quality water source deserving priority protection. Sections with p- values of 0.01 and 0.05 are predominantly found in other low-low clustering areas.",
    "The spatial clustering of surface water monitoring sections in Henan Province can be roughly divided into insignificant in the north, heavily polluted in the center and lightly polluted in the south. The heavily polluted areas are concentrated in Zhengzhou, Luoyang and Kaifeng. The model demonstrates high accuracy based on the training (Fig. 9) and test set predictions (Fig. 10). For the training set, the RMSE is 0.051, and the R? is 0.997, indicating a well-fitted model with minimal bias. The test set also shows strong performance, with an RMSE of 0.081 and R? of 0.992, confirming a good fit and low bias. These results validate the accuracy of the random forest regression model, suggesting it can reli- ably serve as a foundation for identifying pollution sources affecting surface water quality. Based on the contribution of indicators in heavily polluted areas (Fig. 11), the surface water quality indicators rank as follows: CODMn (36.10 %) > DO (20.19 %) > NH3-N (16.7 %) > TP (14.57 %) > PH (4.64 %) > NTU (4.12%) > TN (3.67 %). Indicators CODyp, DO, and NH3-N, each contributing over 15 %, are identified as the primary fac- tors affecting water quality in these areas. TP, with a contribution of 14.57 %, also plays a notable role. In contrast, PH, NTU, and TN contribute less than 10 %, indicating a relatively minor influence on water quality in heavily polluted regions. This study identifies the principal indicators affecting water quality based on cumulative pollu- tion loading rates exceeding of 80 % (Gao et al., 2023b). Consequently, CODmn, DO, NH3-N and TP are identified as the main contributors to water quality degradation in heavily polluted areas. The spatial clustering analysis indicates that surface water pollution in Henan Province is relatively light. The number of points in the low- low clustering pattern significantly exceeds those in the high-high clustering pattern. The Yangtze River Basin, located in the southern part of Henan, shows better water quality, while the Huai River and Yellow River Basins, in the central region, exhibit poorer water quality. The spatial statistical significance of water quality monitoring sections in the Hai River Basin in the north is less pronounced and warrants further exploration. These findings align with the results derived from the water quality category evaluations. However, the Luoningchangshui cross section, while classified as a high-high clustering section, has a low confidence level. Single-factor evaluations indicate that this section has good water quality, necessitating further analysis, but it does not affect the identification of heavily polluted areas based on administrative districts. Heavily polluted surface water areas in Henan Province are primarily found in Zhengzhou City, Luoyang City and Kaifeng Cities, with key influencing factors being CODMn, DO, NH3-N and TP. This observation is consistent with previous studies. For example, Ren et al. evaluated the water quality in 10 rivers of Zhengzhou’s urban area using the comprehensive pollution index method (CPIM) and the nemerow pollution index method (NPIM), highlighting the need for targeted control of CODyn, NH3-N and TP discharges (Ren et al., 2021). Lv et al. identified CODyp7 and NH3-N as the main pollutants in Kaifeng’s rivers (Lv et al., 2022). Wen and Wang found that CODyp, DO and NH3-N are the primary pollutants in the Luo River of Luoyang (Wen and Wang, 2023). Urbanization and land use changes significantly affect surface water quality (Gani et al., 2023). researchers have observed ecological dete- rioration in Zhengzhou, Luoyang and Kaifeng cities due to rapid urbanization (Li et al., 2023; Xue et al., 2022; Zhang et al., 2022). This study uses Nanyang city, located in the Yangtze River Basin, as a model for lightly polluted areas, characterized by high-confidence, high-- quality surface water. By comparing the land use, urbanization and in- dustrial structure of heavily polluted areas and lightly polluted areas, we analyze the sources of pollution. The comparison chart (Fig. 12) reveals that the primary land use differences lie in impervious surfaces and forests. The percentage of impervious in heavily polluted areas is 16.9%, higher than lightly polluted areas (8.1 %). Urbanization in heavily polluted areas is 70.7 %, compared to 52.2 % in lightly polluted areas. The rapid urbanization, expansion of built-up land, and substantial increase in domestic sewage discharges contribute to fluctuations in DO concentrations in surface water (Yang, 2023), as well as higher nitrogen and phosphorus con- centrations (Yao et al., 2023; Yu et al., 2022). Therefore, domestic sewage discharge due to rapid urbanization is a significant factor in water quality deterioration in heavily polluted areas.",
    "and heavily polluted areas lies in the secondary sector. The proportion of the secondary sector in heavily polluted areas is 40.8 %, substantially higher than the 32 % in lightly polluted areas. The secondary sector in Henan is dominated by industry, and the large volume of industrial wastewater discharge increases NH3-N and CODwmn, leading to water pollution(Chen et al., 2022; Giao, 2022; Zhao et al., 2022). Thus, in- dustrial wastewater discharge is a major contributor to water quality deterioration in heavily polluted areas. In conclusion, urban sewage and industrial wastewater discharges are the primary drivers of water quality degradation in heavily polluted areas. Current studies on water quality assessment primarily focus on enhancing indicators such as WQI, trophic status index (TSI) and heavy metal indexes (HMIs) through statistical methods to develop models for evaluating water quality (Yan et al., 2022). Nong et al. constructed a WQl-based evaluation model for China’s South-to-North Water Diver- sion Project, incorporating stepwise linear regression (Nong et al., 2020). Varol employed multivariate statistical techniques (MST) and WQI to assess streams facing various stressors (Varol, 2020). Chakra- borty et al. used a combination of modified water quality index (MWQ)), TSI, HMI, and the potential ecological risk index (RI) for the Damodar River (Chakraborty et al., 2021). Dange et al. introduced a stochastic trophic level index model (STLI) (Ding et al., 2021). However, these studies often overlook the spatial correlation of water pollution across rivers and typically focus on individual watersheds, neglecting pollution linkages across basins due to human activities. Pollution discharges from different watersheds are often spatially correlated across administrative areas. Pollution sources in different watersheds often exhibit spatial interconnections across administrative boundaries, as industrial, agri- cultural, and domestic wastewater discharges impact adjacent basins. Consequently, cross-basin pollution necessitates coordinated control strategies, as treatment efforts within a single basin may have limited effects. Given that existing water management systems are largely based on administrative boundaries, there is a pressing need for integrated, regionally-coordinated water pollution control. This study systemati- cally analyzes the spatial correlation of water pollution across multiple basins in Henan Province, identifying pollution hotspots and sources. The study results offer a foundation for optimizing water quality monitoring resource allocation, supporting integrated water quality management, and strengthening targeted governance strategies. This approach addresses gaps in other studies, particularly in reconciling cross-regional river analysis with water pollution management confined with Class II water comprising 42.60 %. Surface water quality in Henan Province has a positive high aggregation pattern, indicating that the water quality has concentrated water pollution areas. The spatial pollution pattern of surface water quality in Henan Province can be roughly divided into insignificant in the north, heavily polluted in the center, and lightly polluted in the south. Heavily polluted areas, mainly in Zhengzhou, Luoyang and Kaifeng, are associated with CODyn, DO, NH;-N and TP as key indicators. Urban sewage and industrial waste- water discharges are the main causes of water quality in the region. The research results of this paper also prove that the combination of spatial autocorrelation and random forests can better analyse the water pollution situation on a large scale, effectively divide the water pollution area and analyse the source of pollution. The method embodies the idea of combining the whole with the local, and can systematically improve the scientific basis for managers to formulate governance policies. However, spatial autocorrelation has some limitations. As previously mentioned, in larger study areas with more water quality monitoring sections, the choice of K value has minimal impact on identifying polluted areas. However, in smaller study areas with fewer monitoring sections, the K value selection significantly affects pollution identifica- tion and may lead to over-identification of heavily polluted areas. Therefore, accurately identifying polluted areas within smaller regions is essential for the reliability of subsequent studies. The demand for freshwater from reservoirs, municipalities, in- dustries and agriculture has increased sharply in the last century (UNESCO, 2021). As human beings gradually increase the restrictions on groundwater exploitation, surface water plays an increasingly important role in our daily production and life. Scientifically identifying pollution patterns and sources is crucial for effective intervention. This study explores the clustering pattern of surface water quality in Henan Prov- ince by combining spatial clustering and random forest, identifies the indicators that mainly affect the deterioration of water quality and an- alyses the sources of pollution.",
    "We suggest that managers 1) adjust water quality monitoring re- sources dynamically based on pollution levels, establishing distributed monitoring networks in heavily polluted areas with multi-point moni- toring to comprehensively cover all pollutant sources, including urban areas, industrial zones, and agricultural fields, thus enabling real-time tracking and detailed data support for management; 2) upgrade waste- water treatment facilities in Zhengzhou, Luoyang, and Kaifeng by introducing tertiary treatment processes, such as advanced oxidation and deep sedimentation, to enhance removal of CODyn, DO, NH3-N, and TP; 3) enforce a strict emissions licensing system for industrial enter- prises in heavily polluted areas, with total volume control limits, such as annual caps on CODmn and NH3-N emissions. Facilities exceeding these limits should face excess charges or temporary shutdowns for corrective action; and 4) expand ecological buffer zones along rivers and outfalls in heavily polluted areas with native aquatic vegetation, such as reeds and lotus, can help absorb nitrogen and phosphorus, thereby reducing TP concentrations. In areas with slow water flow, installing artificial aeration equipment (e.g., aerators and fountains) can further increase oxygen levels in the water column, improving DO in rivers. Further- more, field research has identified overflow issues in sewage drainage systems in heavily polluted areas. Given the rapid urbanization and industrial expansion in these regions, the rising population and increased wastewater generation are placing added strain on drainage infrastructure. Therefore, we recommend prioritizing upgrades to the drainage network to align with the pace of urbanization. In addition, the content of this study can be studied in the future towards different time periods, for example, whether there are changes in heavy pollution between the flood season and the non-flood season, and whether there are changes in the main impact indicators. It is also possible to evaluate the effectiveness of a project by analysing the changes in water pollution and the main impact indicators before and after the project has been effective. This work is supported by the National Natural Science Foundation of China (No. 51979107, No. 51909091), Science and Technology Pro- jects of Water Resources Department of Henan Province, China (GG202332 and GG202334), and the China Scholarship Council (No. 202108410234). Hanfei Xu: Writing - review & editing. Haojie Qiu: Writing — original draft, Data curation, Conceptualization. Huaibin Wei: Writing — original draft, Funding acquisition, Conceptualization. Wen Li: Data curation. Chenchen Zhao: Writing - review & editing. Jing Liu: Writing — review & editing, Funding acquisition. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."
]