[
    "Characteristic analysis of continuous new particle formation events in Hefei: A case study of the May Day holiday in China b Key Lab of Environmental Optics and Technology, Anhui Institute of Optics and Fine Mechanics, Hefei Institutes of Physical Science, Chinese Academy of Sciences, Hefei Studying the characteristics of new particle formation (NPF) is conducive to exploring the impact of atmospheric particulate matter on the climate, environment, and human health. The particle number size distributions (5.6-560 nm) of aerosols were measured using a fast mobility particle sizer (FMPS) from 1 to 11 May 2019. The clean atmosphere was one of the basic conditions for the occurrence of this continuous new particle formation events. It started between 9:00 and 12:00, and it mainly ended after 20:00. The frowth rate (GR) and condensation sink (CS) values in Hefei were 2.98 + 0.97 nm-h “ and (3.0 + 0.4) x 10°“ s “, respectively. Back trajectory clustering analysis revealed that the mass concentration of the air masses from the southeastern part of Henan Province and the southern part of Anhui Province surrounding the study area were relatively high. The analysis results of the potential source contribution function (PSCF) and the concentration weighted trajectory (CWT) methods show that in addition to local pollution, the long-distance transport of pollutants in the Yangtze River Delta (YRD) greatly contributed to the accumulation modal particulate concentration in Hefei. Moreover, the population affected by PM2.5 during the observation period reached 8.19 x 104, accounting for 1.08% to the total population in Hefei. The premature death cases associated with PMz,5 reached 8.35 x 102. This study is helpful to understand the main influencing factors of consecutive NPF events and the health risks of fine particles. New particle formation (NPF) is one of the important sources of at- mospheric ultrafine particles and global cloud condensation nuclei (Kulmala et al., 2004; Gordon et al., 2017). The generation of new particles can significantly increase the reflectivity of clouds, thus affecting the global radiation balance and global climate through cloud physical processes and precipitation (Dinoi et al., 2021). Due to the significant impact of ultrafine particles (less than 100 nm in diameter) on climate, air quality and human health, people’s interest in atmo- NPF events (Shen et al., 2019; Ling et al., 2019; Dinoi et al., 2021; Zhang et al., 2017; Wei et al., 2022). In addition, the environments in which NPF events occur are diverse, such as under cloudy conditions, in clean or polluted environments, and at night (Altst¨adter et al., 2018; Gr¨oß et al., 2018; Wang et al., 2017a). However, due to the complexity of atmospheric nucleation processes, it is still unclear whether NPF for- mation is dominated by one or more different factors (Dall’Osto et al., 2018). Moreover, there are few studies on NPF events over a continuous period of time. Based on observations, an interesting phenomenon involving 11 consecutive days of NPF events occurred during the May Day holiday in Hefei. Investigating this event is of great significance for understanding new particle generation characteristics in the Yangtze River Delta (YRD) region of China. threatened most urban areas in China (Liu et al., 2019; Yin et al., 2015; Zhang et al., 2020). Prolonged exposure to high levels of PM2.5 poses a serious threat to human health, especially respiratory and cardiovas- cular diseases (Xu et al., 2018). Wang et al. (2019) studied the rela- tionship between respiratory microbiota and human respiratory functions. More and more attention has been paid to the quantitative analysis of the estimated mortality risk associated with long-term and short-term PM2.5 exposure (Jiang et al., 2020). Previous research found the NPF event is related to the degree of PM2.5 pollution (Ou et al., 2022). In view of the domestic and foreign concerns about the health effects of fine particles, this article launches an analysis of the patho- genic risk of PM2.5 in Hefei during this continuous new particle gener- ation event. The field campaign conducted in this study was carried out at a station in urban Hefei (117 ◦ 27 ′ E, 31 ◦ 84 ′ N), China, during May 1–11, 2019. The observation station was located on the eastern campus of the University of Science and Technology of China (USTC), which is sur- rounded by residential and commercial areas. The instruments were setup on the top floor of a four-story building. The sample inlet was on the rooftop and was approximately 20 m above the ground level. There was no obvious pollution source around the sampling point.",
    "In this study, a fast mobility particle sizer (FMPS) was used to measure the particle number size distributions during the Labor Day holiday in Hefei in the YRD, China. The gas pollutants (SO2, NO, NO2, and O3) were also used to identify and describe the NPF events. Cluster, the potential source contribution function (PSCF), and the concentration weighted trajectory (CWT) analyses were conducted to investigate the origin of the polluted air masses and the potential sources of the fine particles in Hefei. In addition, the effects of the PM2.5 on health were analyzed using the health exposure-response function method. This study provides new insights into the occurrence and driving of contin- uous NPF, and the prevention and control of PM2.5 pollution in YRD region. A fast mobility particle sizer (FMPS) (model FMPS 3091, TSI Inc., St. Paul, MN, USA) was used to measure the aerosols with dynamic di- ameters ranging from 5.6 nm to 560 nm. Before each measurement, the FMPS was calibrated and cleared using a supporting filter device to ensure the accuracy of the data. The real-time sampling was performed for 24 h, and the sampling time resolution was 1 s. For more information about the instrument, refer to Shen and Cao (2020). The growth rate (GR) of the aerosol particles during the NPF process was calculated according to the method introduced by Kulmala et al. where Dp1 and Dp2 are the geometric median diameters of the nuclear mode aerosol particles at t1 and t2, respectively. The unit of the growth where D is the diffusion coefficient of the condensing vapor; and βm is the transition state correction coefficient. dp,i is the diameter of a particle in size class i. Ni is the particle concentration in the respective size class (Kulmala et al., 2012). where C is the actual concentration of PM2.5 (ug-m~°). Co is the baseline concentration of PM2.5, The 24 h average concentration of PM25 speci- fied by the World Health Organization (WHO) Air Quality Guidelines is 25 pg-m™°. B; is the exposure-response coefficient; and Eo is the popu- lation health insurance under the baseline concentration of PM» 5s. E; is the population health risk under the actual concentration of PMz 5s. P is the total population of the study area. AE is the number of cases attributed to PM2 5 pollution. The hybrid single-particle Lagrangian integrated trajectory (HYS- PLIT) model developed by the National Oceanic and Atmospheric Administration Air Resources Laboratory (NOAA-ARL) has been widely used in air pollutant transportation research (Che et al., 2021; Xu et al., 2018). The HYSPLIT model was used in this study to calculate the 24 h backward trajectory at a height of 500 m during the observation period. The meteorological field used in the model was the reanalyzed data from the National Environmental Prediction Center (NECP), which has a horizontal resolution of 0.5 ◦ × 0.5 ◦ . In this study, the historical meteorological data, including the hourly wind speed (WS), wind direction (WD), temperature (T), and relative humidity (RH), were collected obtained from the Hefei Xinqiao Inter- national Airport station (http://www.wunderground.com/). The gaseous pollutant (SO2, NO2, CO, and O3) and particulate matter (PM: PM2.5 and PM10) data were obtained from the surrounding national observation stations operated by the China National Environmental Monitoring Center (http://www.cnemc.cn). The transport pathways and potential sources of the accumulated modal particles were investigated using cluster analysis, the PSCF method, and the CWT method (Shen and Cao, 2020). To reduce the ef- fect of small values of Nij, the PSCF values and CWT values were multiplied by an arbitrary weight function Wij to better reflect the un- certainty in the values for these cells, and this is referred to as WPSCF (Weighting potential source contribution function) and WCWT (Weighting concentration weighted trajectory) in each model, respec- tively. The model parameters and algorithms of the above three back- ward trajectory analysis methods have been described in detail by Wang et al. (2006) and Hong et al. (2019). The exposure-response relationship links air quality changes to population health effect endpoints and is one of the key factors used to quantitatively evaluate the health hazards of air pollution (Liu et al., 2010). The exposure-response function is widely used in many epide- miological studies to estimate the health effects related to air pollution (Xu et al., 2018; Kan and Chen, 2004). In the case of a given concen- During the campaign, there was a series of sunny days, with obvious daily changes in temperature and relative humidity (Fig. 1). The mean ◦ temperature was 20.5 ± 4.9 C. The average RH was 51 ± 19%. Studies have reported that NPF events in mainland China were usually observed under lower RH conditions (Kulmala et al., 2004). Hamed et al. (2011) also reported the maximum concentration of sulfuric acid vapor occurs at ambient RH values of less than 60%. The main wind direction was southwest, and the wind speed was about 2.7 ± 1.6 m/s, peaking at 7.15 m/s. Zhang et al. (2017) found that high wind speeds can effec- tively dilute and diffuse the aging aerosols in the atmosphere and can promote the formation of new particles. Based on the PM2.5 and PM10 distributions, the atmospheric environment where the continuous new particle formation events occurred was relatively clean.",
    "As is shown in Fig. 1, the O3 content was higher during the NPF events. Guo et al. (2012) reported that O3 may be a precursor of NPF because it directly reacts with VOCs and indirectly generates OH and HO2 through photolysis, thereby contributing to the formation of con- before the NPF events were generally higher than the concentrations during the NPF events, which is consistent with the results of Hamed et al. (2007). This may be due to the high solar radiation, which accel- erates the consumption of NOX and CO through photochemical The concentration distributions of the modal numbers of each at- mospheric particulate are presented in Table S1. During the May Day holiday in Hefei, the total particulate number concentrations was (2.28 + 0.80) x 104 cm~3. In terms of the proportion of each mode, the Aitken modal particles accounted for the highest proportion of the total number concentration of total particles (53%), followed by the nucle- ation modal particles (34%). The accumulation modal particles accounted for the lowest proportion of the total number concentration of total particles (5.6-560 nm), which is in line with the low overall urban air pollution. an average of 2.98 nm-h’!. The GR in Hefei was smaller than that in Beijing (Yang et al., 2021), in the summer in Nanjing (Huang et al., 2016), and in July in Guangzhou (Yue et al., 2013). The CS values varied from 2.2 to 3.4 x 10°? s\"!, with an average of 3.0 x 10°? s-!. This continuous new particle generation event occurred when the CS values were below 0.04 s~!, indicating that condensed vapor was likely the critical limiting factor of the NPF events. The CS value in Hefei was comparable to those in Beijing in summer (Huang et al., 2016) and in Guangzhou (Yue et al., 2013). However, it was higher than the value in Beijing (Yang et al., 2021) (Table S2). As is shown in Fig. 2b, the start time, end time, and length of each NPF event were estimated. The start times of the events were between 9:00 and 12:00. As the sun rises, it triggers photochemical processes (Shen and Cao, 2020). The end times of the new particle events were mainly after 20:00. Above all, the daily duration of the continuous new particle generation events was fairly stable, i.e., between 4 and 6 h, except for some fluctuations during the entire measurement period on In this study, the NPF event was determined to be an explosion of particle concentration in the nucleation mode. If the nucleation modal particle concentration increased for more than 2.5 h and the maximum nucleation modal particle concentration exceeded 104 cm™, it was identified as an NPF event (Zhang et al., 2017; Ou et al., 2022). The 11 NPF events studied all exhibited typical banana shapes. Previous studies have shown that the growth rate of typical particles in mid-latitude areas is 1-20 nm-h7! (Kulmala et al., 2004). As is shown in Fig. 2a, the GR values in Hefei ranged from 1.27 to 4.50 nm-h~!, with Fig. S1 shows the distribution characteristics of the different modal number concentrations, PM2.5, and PM10 for different wind directions and wind speeds. During the observation period, the nucleation mode particulate matter mainly originated from the northwest, and in was high. The Aitken mode exhibits high concentrations controlled by higher wind speeds and northwest and northeast wind directions. The accumulation mode particle concentration under the same wind direc- tion and wind speed was low, so it was inferred that high wind speed local emissions from the northwest may be the main source of the nucleation mode and the Aitken mode particles. The concentration of accumulation mode was higher at low wind speeds and high wind speeds in the northeast and southwest directions, and the concentrations of the nucleation mode particulate matter and the Aitken mode particulate matter were both low at low wind speeds under the same wind. PM2.5 and PM10 both had higher concentrations for low wind speeds from the southwest. Therefore, both the local emissions and regional transportation contributed to the concentration of the accumulated modal particles. Fig. 3 shows the particle number concentration versus relative hu- midity curves for the different modes of the new particle generation event. Based on Fig. 3 and S2, the nucleation modal particle number concentration was negatively correlated with RH during these NPF events. The decrease in the nucleation modal particle number concen- tration could not be caused by wet sedimentation because the deposition efficiency of particles with a particle size of less than 70 nm is low (Wang et al., 2017b). Water vapor plays an important role in the condensation of particulate matter. The correlation coefficient between the accumulation mode and the RH is higher than that of the nucleation and Aitken modes, indicating that there is a certain degree of particulate matter condensation growth. When the relative humidity increased, along with the increase in particle size, the nucleation modal particles transform to the Aitken modal particles, which is also demonstrated by the increase in the number of the Aitken mode and accumulation mode transformed into the Aitken mode particles and the particle size increased. However, the concentration of the accumulation mode par- ticles did not change significantly, that is, the particle size did not By analyzing the diurnal changes in the gases, it was found that the variation in the particulate matter concentration from 9:00–14:00 was close to that of the O3 concentration, and there was no obvious corre- sponding change in the SO2 concentration. NPF events involving the organic matter in the atmosphere can also participate in nucleation. In particular, when the concentration of gaseous sulfuric acid is low, the rich low volatile organic gas can even control the nucleation rate (Ling et al., 2019; Xu et al., 2018). At 16:00, the particle number concentra- tions of the Aitken mode and the accumulation mode particles increased rapidly, and the NO2 and CO concentrations increased simultaneously. The changes in the number concentrations of the particles during this period may have been caused by motor vehicle emissions (R¨onkk¨o et al., Based on the three periods of the NPF event, the event was divided into three phases (Fig. 4): (a) the nucleation modal particles concen- tration increase phase; (b) the number of nucleation modal particles decreased, and the number of Aitken modal and the accumulation modal particles continued to increase; and (c) the concentration of Aitken and accumulation modal particles began to decrease.",
    "Association analysis between the particle number concentrations of each mode in the different stages of the NPF and the air pollutants in the environment was carried out. Fig. 4 shows that before 6:00, the accu- mulation mode particulate matter was at a higher level. The generation of new particles began at 9:00, and the concentration of the nucleation modal particles increased rapidly until 12:00. After 12:00, the concen- tration of nucleation mode particles decreased rapidly. At the same time, the concentration of Aitken mode particles continued to increase, reaching a peak at 14:00, indicating that the nucleation mode particles Due to the collision and condensation growth processes, the nucle- ation mode ceases after only a few hours in the atmosphere, while Aitken modal particles are likely to age into the accumulation mode due to collisions. The particles spend more time in the accumulation mode than in the Aitken mode and the nucleation mode, and the accumulation mode is more affected by air mass transport. Thus, it is necessary to discuss the transport distribution characteristics of the modal particles. The backward trajectory results are shown in Fig. 5. The air masses affecting the Hefei sampling points can be divided into two types. One type is from the sea (cluster 1). Cluster 1 originated from the Yellow Sea, passed through Jiangsu Province, and entered Hefei from the northeast. Since the air masses from the sea are relatively clean, the particle con- centrations corresponding to cluster 1 were also low (Table 1). The second type of air mass originated from the areas surrounding the study area (clusters 2–4). Cluster 2 originated from the southern city of Anhui Province. Cluster 3 originated from Shanghai and entered Hefei from the southeast. Cluster 4 had the lowest proportion (14.39%), but the accu- mulation mode had the highest particle content. Cluster 4 originated from Henan Province and entered Hefei from the west. In order to analyze the potential source areas and contributions of the accumulation modal particles in Hefei, the PSCF method was used to analyze the potential source area distribution of the accumulation mode particles throughout the observation period. The results are shown in Fig. 6a. The WPSCF values are relatively high (WPSCF > 0.7) in southern and western Anhui, southeastern Henan (Xinyang city), northern Zhe- jiang (Hangzhou city), and Shanghai (Hong et al., 2019). The population distributions in these areas are relatively dense, and the pollution is primarily caused by human activities. Pollutants emitted from industrial production, coal burning, and motor vehicle exhaust were transported to Hefei by the airflow. In addition, the WPSCF value (0.3 < WPSCF < 0.7) caused by the long-distance transmission in the southern part of Jiangsu Province and the East China Sea and the local pollution is worthy of attention. ranging from 5.6 nm to 560 nm) were measured on-site in Hefei, and combined with local meteorological gas data, these measurements were used to analyze the factors influencing the continuous NPF events. The pollution sources and health effects of sub-micron particles were also analyzed. The results of this study provide new insights into continuous new particle formation events in cities and the research of sub-micron Most of the continuous NPF events began in the morning and lasted until nightfall. The distribution characteristics of the particle number concentrations of each mode under different wind directions and wind speeds during the observation period revealed that the high wind speed pollutant transport from the northwest has a significant impact on the nucleation modal and the Aitken modal particles. The particle number concentration of the accumulation mode mainly originates from local emissions and regional transport. Moreover, combined with the varia- tions in the particle concentrations and gases of each mode, it was found The CWT method was used to determine the degree of pollution of each potential source area. The analysis results are shown in Fig. 6b. The high WCWT values were mainly distributed in the southwestern and southeastern parts of Anhui Province, the northern part of Zhejiang Province, the southeastern part of Jiangsu Province, and the area sur- rounding the study area. These results show that in addition to local pollution, long-distance transportation of pollutants in the YRD region contributed significantly to the concentration of submicron particles in Hefei.",
    "Combined with the backward trajectory and the high value distri- bution of the WPSCF and WCWT results, it was concluded that in addition to local pollution, the long-distance transportation of pollutants in the YRD and northern regions contributed significantly to the con- centration of sub-micron particles in Hefei. Finally, the results of the health risk assessment caused by PM2.5 pollution in the Hefei area show that the number of people affected by PM2.5 was 8.19 × 104 during the study period, accounting for 1.08% of Hefei’s population. In this study, three specific causes of death, i.e., respiratory cancer, cardiovascular cancer, and lung cancer, were systematically estimated. In addition, respiratory and cardiovascular hospitalizations, medical and pediatric outpatient clinic treatments, acute and chronic bronchitis cases, and asthma attacks were also estimated. The detailed results are Jinping Ou: Conceptualization, Data curation, Formal analysis, Writing - original draft, Writing - review & editing. Qihou Hu: Meth- odology, Supervision. Haoran Liu: Supervision. Qianqian Hong: Validation. Xinqi Wang: Validation. Shiqi Xu: Formal analysis. Zhuang Wang: Data curation. Wenqing Liu: Supervision, Resources. Specifically, the population affected by PM2.5 reached 8.19 × 104, accounting for 1.08% of the total population (7.58 million) in Hefei during the study period. Among the various diseases affected by PM2.5, acute bronchitis had the largest number, accounting for 38.5% of the total number of premature deaths caused by PM2.5, followed by pedi- atric cases (<14 years old), accounting for 34.4% of the total number of patients. During the observation period, the sum of all of the PM2.5 related mortalities was 8.35 × 102 people, accounting for 1.02% of the annual death toll in Hefei and 0.01% of the total population in Hefei. Therefore, the health risks caused by PM2.5 pollution in Hefei should receive more attention. This analysis provides a useful basis for formu- lating air pollution control policies. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. This research was supported by grants from the National Key Research and Development Program of China (No. 2017YFC0210002, 2018YFC0213104, 2016YFC0203302 and 2017YFC0212800), the Na- tional Natural Science Foundation of China (No. 41722501, 51778596, 41977184 and 41941011), Anhui Science and Technology Major Project (No. 18030801111), the Strategic Priority Research Program of the Chinese Academy of Sciences (No. XDA23020301), the National Key Project for Causes and Control of Heavy Air Pollution (No. DQGG0102"
]