[
    "Anqi Wang a,b,1, Qiang Ma c,1, Biao Gong d, Long Sun d, Francis-Kojo Afrim a, Renjie Sun a, Tongkun He a, Hui Huang a,b, Jingyuan Zhu a, Guoyu Zhou a,b, Yue Ba a,b,* Excessive fluoride exposure and epigenetic change can induce numerous adverse health outcomes, but the role of epigenetics underneath the harmful health effects induced by fluoride exposure is unclear. In such gap, we evaluated the associations between fluoride exposure and genome-wide DNA methylation, and identified that novel candidate genes associated with fluoride exposure. A total of 931 school-age children (8-12 years) in Tongxu County of Henan Province (China) were recruited in 2017. Urinary fluoride (UF) concentrations were . a a . . re . measured using the national standardized ion selective electrode method. Participants were divided into a high fluoride-exposure group (HFG) and control group (CG) according to the UF concentrations. Candidate differ- entially methylated regions (DMRs) were screened by Infinium-Methylation EPIC BeadChip of DNA samples collected from 16 participants (eight each from each group). Differentially methylated genes (DMGs) containing DMRs associated with skeletal and neuronal development influenced by fluoride exposure were confirmed using MethylTarget™ technology from 100 participants (fifty each from each group). DMGs were verified by quan- titative methylation specific PCR from 815 participants. Serum levels of hormones were measured by auto biochemical analyzer. The mediation analysis of methylation in the effect of fluoride exposure on hormone levels was also performed. A total of 237 differentially methylated sites (DMSs) and 212 DMRs were found in different fluoride-exposure groups in the epigenome-wide phase. Methylation of the target sequences of neuronatin (NNAT), calcitonin-related polypeptide alpha (CALCA) and methylenetetrahydrofolate dehydrogenase 1 showed significant difference between the HFG and CG. Each 0.06% (95% CI: —0.11%, —0.01%) decreased in NNAT methylation status correlated with each increase of 1.0 mg/L in UF concentration in 815 school-age children using QMSP. Also, each 1.88% (95% CI: 0.04%, 3.72%) increase in CALCA methylation status correlated with each increase of 1.0 mg/L in UF concentration. The mediating effect of NNAT methylation was found in alter- ations of ACTH levels influenced by fluoride exposure, with a # value of 11.7% (95% CI: 3.4%, 33.4%). In conclusion, long-term fluoride exposure affected the methylation pattern of genomic DNA. NNAT and CALCA as DMGs might be susceptible to fluoride exposure in school-age children. Fluorine is ubiquitous in the natural environment, and exists widely in rocks, soils and oceans, same as a variety of compounds in nature. The than that in surface water. It is well known that fluorine plays a role in the formation of bones and teeth, assisting ossification and preventing dental caries. Fluoride is soluble in water, which allows it to be distributed in various body organs, leading to numerous adverse health Abbreviations: CG, control group; CGI, CpG island; DMG, differentially methylated gene; DMR, differentially methylated region; DMS, differentially methylated site; HFG, high fluoride-exposure group; QMSP, quantitative methylation specific polymerase-chain-reaction; UF, urinary fluoride. * Correspondence to: Department of Environmental Health, School of Public Health, Zhengzhou University, 100 Science Avenue, Zhengzhou, Henan, PR China. 0147-6513/© 2021 The Authors. Published by Elsevier Inc. This is an open access article under the CC BY-NC-ND license (http://ereativecommons.org/licenses/by-ne-nd/4.0/). to fluoride are skeletal fluorosis and dental fluorosis (Patil et al., 2018). In addition, exposure to excess amounts of fluoride exposure can result in dysfunction in almost all organs (Liu et al., 2020; Zuo et al., 2018). As for the mechanism of fluorosis, a large number of studies have explored the effects of fluoride on bone, nerve and other tissues through oxidative stress, apoptosis, and gene regulation (Ji et al., 2021; Sharma et al., 2021; Wang et al., 2021; Yan et al., 2011). In recent years, increasing numbers of studies have demonstrated that changes in DNA methylation are involved in the pathogenesis of various diseases (Lin et al., 2020; Yang et al., 2020). Furthermore, DNA methylation is usually considered as an initial point for exploring adverse environmental effects in epidemiological investigations (de Souza et al., 2020; Lin et al., 2020). Therefore, the role of epigenetic modification represented by DNA methylation in the occurrence of fluorosis has gradually become a concern. For example, animal experiments found that fluoride can interfere with DNA methylation and then affect the early development of mouse embryos (Fu et al., 2014; Zhao et al., 2015). It has also been found that DNA methyltransferase 1, an important target of DNA methylation caused by exogenous chemicals, is involved in the devel- opment of fluorosis. However, most of the previous studies focused on the relationship between specific genes or their methylation status and fluoride exposure (Niu et al., 2012), which lacked the analysis of the epigenome level. Even though some studies used high-throughput methods to measure the effect of fluoride exposure on genome-wide DNA methylation (Daiwile et al., 2019), they were mostly based on in vitro experiments. Therefore, it is necessary to screen and verify the methylation changes related to fluoride exposure at the epigenomic profiling on population basis.",
    "for 2 days in every 2 weeks, where the fluoride content in drinking water at home was similar compared to the school. In addition to the fluoride concentration, the living habits and dietary habits of children were also The inclusion criteria were (i) children born and resided in the lo- cality and (ii) children with no other sources of fluoride exposure (e.g., drinking of brick tea, industrial dust fumes). Overall, differentially methylated sites (DMSs) and differentially methylated regions (DMRs) were screened in 16 children by 850 K BeadChip. Subsequently, Meth- ylTarget™ method was used to validate the DMRs in additional 100 children. Finally, the significant DMRs validated by MethylTarget™ analysis were verified further in 815 participants (Fig. 1). The study protocol was approved by the Ethics Committee of Zhengzhou Univer- sity (ZZUIRB2017–018). Written informed consent was obtained from all participants and their guardians. Questionnaires were used to collect the demographic characteristics (age, gender, basic health status) of children and the education level of their parents. Body mass index (BMI) was calculated to reflect the development status of the recruited children. Questionnaires were completed with the help of the parents or guardians of the participants. Dental fluorosis was assessed by two independent licensed physicians according to the modified Dean’s Index (The industry standard of the People’s Republic of China, WS/T 208–2011) and separated into “normal”, “questionable”, “very mild”, “mild”, “moderate”, or “severe” Children at the rapid stage of growth and development are more vulnerable to the health hazards of fluoride exposure than adults (Kaur et al., 2020). Therefore, the exploration of the effect of fluoride exposure on children’s health (especially detection of sensitive biomarkers) is worthwhile. Though Daiwile and colleagues (Daiwile et al., 2019) uti- lized high-throughput methods to measure the effects of fluoride expo- sure upon genome-wide DNA methylation in vitro, the results of population-based studies are not available. We hypothesized that exposure to excessive fluoride in drinking water would have an impact on DNA methylation in children. Hence, we recruited school-age chil- dren who were exposed to and those not exposed to excessive fluoride to screen differentially methylated genes (DMGs) by comparing the methylation of genomic DNA using the Infinium-Methylation EPIC (850 K) BeadChip. Then, we verified these DMGs in two relatively large populations to investigate the relationship between fluoride exposure and methylation of DMGs using MethylTarget™ method and quantita- Urine samples were collected in the morning and transported in an ice box to a laboratory within 2h. The fluoride concentration in the urine sample was measured using an ion-selective electrode method (Gao et al., 2020). All reagents were certified in terms of quality. The remaining urine samples were stored at —80 °C. The creatinine con- centration in urine was measured by the picric-acid method (Jiancheng Bioengineering Institute, Nanjing, China) (Sun et al., 2020) and used to calibrate the UF concentration. The peripheral venous blood (5 mL) of children who had been fasting for 9 h was collected and transported in ice boxes to a laboratory within 2h. Serum was obtained by centrifugation of whole blood. Whole blood and serum were stored at —80 °C for subsequent analyses. We undertook a cross-sectional study in Tongxu County (Henan Province, China), an endemic fluorosis area with drinking water type due to the natural geological structure, from late April to late May in 2017 (Fig. S1). In these areas, drinking water is the main source of fluoride intake and fluoride levels in drinking water remained stable according to the surveillance of Kaifeng Center for Disease Prevention and Control (CDC). None of the study areas was exposed to brick tea, coal-burning and industrial fluoride pollutions. Participants aged 8–12 years were recruited from four boarding primary schools. Particularly, this period was in the middle of the semester, when students were in school with no psychological fluctuations caused by the beginning or end of the semester and psychological pressure brought by the final exams. Significantly, one of the schools was located in an endemic fluorosis area (fluoride concentration in drinking water = 2.6 mg/L), while the other three schools were located in non-fluorosis areas (fluo- ride concentration ≤ 1.0 mg/L). Students were allowed to return home Hormone levels in blood were measured by an automatic biochem- ical analyzer (Cobas C501, Roche Diagnostics, Basel, Switzerland). A radioimmunoassay was used to detect the following: serum levels of endocrine hormones (adrenocorticotropic hormone (ACTH), cortisol (COR), triiodothyronine (T3), thyroxine (T4) and thyroid stimulating hormone (TSH)) and bone metabolism-associated hormones (osteo- calcin (OC), calcitonin (CT) and parathyroid hormone (PTH)) (Zhengz- hou KingMed Diagnostics Group Co., Ltd., Zhengzhou, China) according to manufacturer protocols. The serum level of phosphorus (P) was measured using an ultraviolet-spectrophotometry method based on phosphomolybdic acid. The level of bone-specific alkaline phosphatase (BALP) was detected by a chemiluminescence assay. The level of alka- line phosphatase (ALP) was determined using a SFBC rate method (Zhengzhou KingMed Diagnostics Group Co., Ltd., Zhengzhou, China).",
    "Each analyzed sample was duplicated, and 15%–20% of total sam- ples were retested randomly. The intra-assay coefficient of variation and inter-assay coefficients of variation were <10%, respectively. Samples fluoride were selected as the high fluoride-exposure group (HFG). Among them, five had very mild dental fluorosis and three had moderate dental fluorosis. According to a 1:1 ratio matched for age, eight boys who had no dental fluorosis with UF concentration ≤1.4 mg/L in non- fluorosis schools were selected as the control group (CG). Genomic DNA was extracted using a mammalian blood genomic DNA extraction kit (Shanghai Lifefeng Biotech Co., Ltd, Shanghai, China). All 16 samples of the genomic DNA were collected in 200-μL sterilized and DNase/RNase-free polypropylene tubes, and were trans- ported to a laboratory with dry ice. Analyses of methylation array were conducted by the 850 K BeadChip (Illumina Inc., San Diego, CA, USA), which contained >850,000 CpG sites. This helped to detect additional DMSs and DMRs that had not been reported previously (Pidsley et al., 2016). For each CpG site, a DMS was defined as the absolute value of sample Diffscore value >13 and, simultaneously, an absolute value for Delta Beta >0.17. The Delta Beta value was the difference at each site between the Avg Beta value which was the degree of methylation in samples from the HFG and the CG. DMR was analyzed by “ChAMP” R-package using the champ.DMR method (Tian et al., 2017). For each DMR, the p of BumphunterDMR Area was < 0.05. All 16 children were assigned randomly to different Beadchips to avoid selection biases during the assay. Samples were single-blinded at this phase, that is, the Unsupervised hierarchical clustering of DMSs was conducted and shown using Heatmaps (Fan et al., 2020; Maros et al., 2020). The number of DMGs included in each Gene Ontology (GO) entry was counted, and pathway analyses of genes corresponding to DMSs were undertaken using the Kyoto Encyclopedia of Genes and Genomes (KEGG) database. Moreover, the significance of gene enrichment in each entry was calculated using statistical tests. The details of the visualiza- According to the study design, 9 DMRs associated with skeletal and neuronal development influenced by fluoride exposure were selected as candidate fragments to validate the reliability of 850 K BeadChip using the MethylTarget™ method (Genesky Bio-Tech Co., Ltd, Shanghai, China), which is based on a combination of next-generation sequencing and methylation enrichment of multiple target regions. The 9 DMRs were located at the regions of promoters, exons and introns, respec- tively. A total of 50 children in the HFG, with a relatively higher UF concentration and diagnosed as having dental fluorosis were selected, in which: 36 cases were very mild, 9 cases were mild and 5 cases were moderate dental fluorosis. The HFG samples represented a ratio of 1:1 for boys and girls. Another 50 in age and gender matched children with The DMRs of the neuronatin (NNAT), calcitonin related polypeptide alpha (CALCA) and methylenetetrahydrofolate dehydrogenase1 (MTHFD1) gene screened by MethylTarget™ method were further verified in a larger population. Respectively, samples of genomic DNA were collected from fasting venous blood of 815 children, and treated with bisulfite using an EZ DNA Methylation-Gold™ Kit (Zymo Research, Irvine, CA, USA). Methylation-specific primers were designed using online MethPrimer (http://www.urogene.org/cgi-bin/methprimer/ methprimer.cgi). Methylated and un-methylated primers are shown in Methylation analyses of the promoter region of NNAT, as well as exon 1 of CALCA and MTHFD1 were performed by QMSP method using the MX3000P platform (Agilent Technologies, Santa Clara, CA, USA). The amplification and reaction conditions of PCR are shown in Table S3. The level of DNA methylation was calculated using the reference method The database was established using Epidata 3.0. Continuous cova- riates and categorical variables were displayed as the mean ± standard deviation (SD) or distribution (%), respectively. Missing data were processed by multiple imputation method (Schafer, 1999). A general linear regression model was used to examine the association between fluoride exposure and the methylation status of DMGs. The age, gender, BMI and urinary creatinine level of children, and the education level of parents were selected as covariates. By treating the median of each tertile as a continuous variable, the linear trend in the tertile of increased fluoride exposure and DNA methylation was estimated. The tertile ranges of UF content (in mg/L) were: tertile 1 (n = 270), ≤0.58; tertile 2 (n = 272), 0.59–1.37; tertile 3 (n = 273), >1.37.",
    "Subsequently, a general linear regression model was used to examine the relationship between fluoride exposure and hormone levels, and the correlation between methylation status of DMGs and hormone levels. To advance an in-depth investigation of the effect of methylation status of DMGs in the relationship between fluoride exposure and the serum level of hormones, we implemented a mediation analysis using SAS macro (Lin et al., 1997). Sensitivity analyses were conducted to adjust for different cova- riates, which included age, gender, BMI, and urinary creatinine level of children, and the education levels of parents. The analyses were un- dertaken using SPSS 21.0 (IBM, Armonk, NY, USA). Statistical graphs were generated by R. P < 0.05 (two-sided) was considered statistically The genomic wide DNA methylation status of 16 boys from the HFG and the CG was examined using 850 K BeadChip. The demographic in- formation of the 16 boys is shown in Table S4. A total of 237 DMSs were identified after screening above sites. Among them, 139 had UCSC RefGene (https://genome.ucsc.edu/) names, while the other DMSs were not annotated into specific genes. The RefGene name and the location of each CpG site in the gene or chromosome are shown in Table S5. All 237 DMSs were mapped to 212 DMRs and the details are shown in Table 1. The DMSs were mostly located at chromosome 7, chromosome 11 and chromosome 2. The DMRs were mainly located at chromosome 6, chromosome 2, chromosome 5 and chromosome 17. According to the distribution of DMSs and DMRs, a visualized Circos plot was generated A Manhattan plot (Fig. 2A) was generated based on the original 850,000 sites, except for the CpG sites from X or Y chromosomes. A volcano plot (Fig. 2B) presented the association between the methyl- ation difference (beta value) and the p-value of each CpG site. Notably, DMSs were found less frequently in CpG islands (CGIs) and CGI shore regions (4.2% and 14.8%, respectively) than the overall distribution of CpGs in the genome (18.6% and 17.8%, respectively) (Fig. 2C). hypomethylated and ~40% (red) of the sites were hypermethylated in the CG (Fig. 3). The result showed that the methylation levels of DMSs in Unsupervised hierarchical clustering of DMSs was done by calcu- lating the similarity between two samples (Fig. 3). Continuously, we merged the two nearest samples into only one class. Here, neighboring samples had similar biological functions. The samples of HFG and CG were separated into different clusters, thereby demonstrating that the selection of the two groups was highly representative. In the HFG, ~40% (blue) of the sites were hypomethylated and ~60% (red) of the sites Functional analyses were performed on the genes corresponding to the DMSs using the GO database (Fig. S3). “Positive regulation of tran- scription of Notch receptor target” and the “morphogenesis of a branching structure” were the most significantly enriched terms in the category of biological process. For the category of cellular components, “platelet dense granule membrane” was markedly enriched. The notably enriched terms in the category of molecular function were “nerve growth factor binding” and “SH3 domain binding”. Fig. 2. Genome-wide methylation analysis comparing HFG and CG. Using the 850 K Beadchip, the association between urinary fluoride and CpG sites was evaluated across 16 school-age children. (A) Manhattan plot showing the chromosomal location and –log10(p) for each CpG site. (B) Volcano plot illustrating the association between methyl- ation difference (beta) and –log10(p) for each CpG site. Different color corresponds to CpG relationship with CGIs. (C) Distribution (with relation to CGIs) of CpGs between 850 K Bead- Chip and DMSs. The genomic wide DNA methylation status of samples from 100 children from the HFG and CG was analyzed using MethylTarget™ method. The characteristics information of the 100 samples has been displayed in Table S6. Nine DMRs were selected for verification in a population of 100 samples involving related genes of CALCA, MTHFD1, NNAT, HOXA5, LHX6, TRIOBP, SOD3, PAX8, GNAS. The sequence in- formation of fragments is shown in Table S7. Among them, the target sequence of NNAT, MTHFD1 and CALCA showed significant differences between the CG and the HFG (p < 0.05). The genomic regions for the DMRs of NNAT, MTHFD1 and CALCA were visualized using coMET Next, we analyzed the associations between fluoride concentration and DNA methylation of NNAT, CALCA and MTHFD1 in a larger popu- lation. Table 2 showed the characteristics of the participants in the verification phase. Specifically, a total of 815 children (394 boys and 421 girls) were included in the verification phase. The mean ± SD of age was 10.0 ± 1.3 years and the mean ± SD of BMI was 17.5 ± 2.8 kg/m2. Most of the parents had higher school education. All the children were examined for dental fluorosis, and 257 (31.5%) children had dental fluorosis. The mean ± SD of urinary creatinine and UF concentration was 1.08 ± 0.61 g/L and 1.43 ± 0.81 mg/L respectively.",
    "Fig. 3. Heat map of the cluster analysis. The color scale indicates that the methylation rate varies from relatively low (blue) to relatively high (red), with each row representing a different probe and the column name at the bottom of the figure representing the sample numbers. The letter F/C in front of the dash represents the different groups; the number after the dash stands for the different samples, in which F-1 to F-8 were from the HFG and C-1 to C-8 were undertaken using the KEGG database (Fig. S4). The entries were mostly enriched for the “nervous system”, “endocrine system”, “signal trans- duction”, “immune system”, “endocrine and metabolic diseases”, and The UF concentration negatively correlated with NNAT methylation (Table 3), with an adjusted of — 0.17% (95% confidence interval (CD: — 0.27%, — 0.06%) for tertile 3. Each 0.06% (95% CI: —0.11%, —0.01%) decrease in NNAT methylation status correlated with each increase of 1.0 mg/L in the UF concentration. In addition, UF concen- tration positively correlated with CALCA methylation, with an adjusted B of 4.12% (95% CI: 0.93%, 7.30%) for tertile 2. We also observed that, an increase of 1.88% (95% CI: 0.04%, 3.72%) in CALCA methylation status correlated with each increase of 1.0 mg/L in UF concentration. However, no significant association was found between fluoride and the methylation status of MTHFD1 methylation. It has been suggested that fluoride exposure can affect bone meta- bolism and intellectual development in children. Based on the epigenome-wide screening results stated above, we speculated that the methylation status of DMGs might modify the effect of fluoride expo- sure. Thus, we further analyzed the relationship between fluoride exposure and some biomarkers related to the growth and development of children using linear regression. We found that calcium significantly correlated with fluoride exposure with an adjusted £ of —0.02 (95% CI: —0.04, —0.01), and the ACTH level significantly correlated with fluoride exposure level with an adjusted # of 1.44 (95% CTI: 0.56, 2.32) (Table S9). However, the mediating effect of NNAT methylation was found only in alteration of the ACTH level influenced by fluoride exposure using SASmacro, and the mediation effect of NNAT methyl- ation was 11.7% (95% CI: 3.4%, 33.4%) (Fig. 4). Water-borne endemic fluorosis has been widely prevalent in China, especially in the central, western and northern parts of China. In order to explore the possible epigenetic changes caused by fluoride exposure, we conducted a screening and validation study in step by step. We under- took, for the first time, microarray analyses of DNA methylation on samples from school-age children who had been exposed to/not exposed to excessive fluoride in drinking water. Gradually, we conducted population-based verification of DMRs. In total, 237 DMSs and 212 DMRs were found in different fluoride exposure groups in the epigenome-wide phase. In addition, we found that the methylation of the target sequences of NNAT, CALCA and MTHFD1 was significantly different between the HFG and CG according to MethylTarget™ method. Only the methylation status of NNAT and CALCA were susceptible to fluoride exposure in the population-based validation phase. Notably, NNAT methylation could modify the influence of fluoride exposure on the ACTH level in children. According to the study design, we first screened the DMSs and DMRs sensitive to fluoride exposure in the epigenome-wide phase using the 850 K BeadChips. Notably, DNA methylation profile in girls is relatively inconstant from the beginning of puberty (Thompson et al., 2018). Hence, we selected sixteen boys to screen the DMRs susceptible to fluoride in the BeadChip analyses in the discovery phase. We found 70 significantly enriched biological process entries related to DMSs using the GO database. These biological-process entries were mainly involved in the positive regulation of transcription of Notch receptor targets, morphogenesis of a branching structure and processing of peptide hor- mone, which participate in multiple functions in the body. Studies have shown that fluoride exposure can affect regulation of apoptotic process, We conducted sensitivity analysis of fluoride exposure on the methylation status of NNAT, CALCA and MTHFD1 (Table S8) and adjusted for covariates of age, gender, BMI, urinary creatinine level of children, as well as maternal and paternal education levels. The results Wei et al., 2018). Analyses of pathway enrichment using the KEGG database provided a pathway map of gene functions, including dopa- minergic synapse, thyroid hormone synthesis and the NF-kappa B signaling pathway. These results are similar to previous studies (Kup- nicka et al., 2020; Wang et al., 2020; Zhang et al., 2008). Interestingly, we found some fluoride-related pathways that have not been discovered (e.g., renin secretion, toll-like receptor signaling pathway, and cholin- ergic synapse). In light of the development of targeted interventions for gene methylation (Papikian et al., 2019; Tian et al., 2019), these find- ings provide novel clues for the basic research and clinical treatment of fluoride-related diseases.",
    "In the subsequent validation phase, we first recruited 100 children including fifty boys and fifty girls to validate the identified target DMRs. Nine DMRs were validated by MethylTarget™ method. Methylation status of the target sequences of CALCA, NNAT and MTHFD1 was significantly altered. In the population validation phase, only methyl- ation status of CALCA and NNAT were affected by fluoride exposure. Calcitonin, encoded by CALCA gene, plays a crucial role in bone metabolism by restraining bone resorption (Meleleo and Picciarelli, 2016). It also prevents osteoporosis and maintains bone mass (Naot et al., 2019). We observed that CALCA methylation status positively correlated with the UF concentration, which suggested that fluoride exposure may have affected CALCA methylation, and verified the result in our published study of adult samples (Sun et al., 2020), which showed that CALCA methylation in children and adults were easily affected by fluoride exposure. An increase in CALCA methylation was caused by increased exposure to fluoride, which indicated that the expression of CALCA might be affected. methylation mediated 11.7% of the alteration in the ACTH level influ- enced by fluoride exposure. Hence, NNAT methylation might be an important biomarker in the effect of fluoride on ACTH. However, the specific harmful mechanism needs further study. One of the strengths of our study was that we used high-throughput sequencing to screen DMRs that are sensitive to fluoride exposure, and then coherently validated the DMRs in population-based samples to ensure a scientific and rigorous experiment. In addition, one-carbon metabolism is a major metabolic network through which nutrients can regulate DNA methylation (Steluti et al., 2019). Different dietary pat- terns can lead to changes in gene methylation profile and subsequently affect hormone secretion. Study participants were students living in boarding school, and they had consistent diets and living habits, which Several limitations of our study should be stated. First, due to the restrictions of a cross-sectional design, we could not determine a causal relationship between fluoride exposure and DNA methylation. Second, our study was based on sequencing using the 850 K BeadChip, which is a popular method for epigenome-wide association studies, but it is not specifically a genome-wide sequencing tool. Third, the sample size in the discovery phase was relatively small. Nevertheless, at the subsequent validation phase, we expanded the sample size and adjusted multiple confounding factors to make our results more statistically robust. Further research should be analyzed with all methylation markers related to fluoride exposure, and comprehensively validate the corre- sponding disease outcomes in large cohort studies to better determine An epigenetic study using high-throughput technique on fluoride exposure was reported by Daiwile and colleagues (Daiwile et al., 2019). They observed that the promoter regions of genes of BMP1, METAP2, MMP11 and BACH1 were hypermethylated in human osteosarcoma cells exposed to fluoride. However, as compared with in vitro experiments, the internal environment of the body is sophisticated. In addition, unlike blood cells in the peripheral circulation, bone cells are the target, which may be more sensitive to fluoride exposure (Jiang et al., 2020). Apart from CALCA methylation, NNAT methylation related to neu- rodevelopment negatively correlated with the UF concentration. It has been reported that NNAT gene is involved in the regulation of ion channels in brain (Pitale et al., 2017), chemical reprogramming of as- trocytes into neurons, and assists regeneration of new neurons for brain repair (Ma et al., 2019). The location of NNAT in rat brain cells reflects various functions, including differentiation and maintenance of cells (Kanno et al., 2019). The influence of fluoride on development of the nervous system has attracted increasing attention (Dec et al., 2017). Our study indicated that fluoride exposure may alter NNAT methylation, which may further explain the neurotoxicity of fluoride at the molecular level. Accordingly, changes in NNAT methylation may also impact the development of intelligence. This finding provided a clinical reference that alterations in methylation induced by exposure to excessive amounts of fluoride might be involved in a change in neural ACTH is a very important hormone secreted by the pituitar- y–adrenaline axis. One animal study demonstrated that the ACTH level positively correlated with fluoride exposure (Kinawy and Al-Eidan, 2018). It has been reported that NNAT could participate in maintain- ing the overall structure of the nervous system in the brain (Wijnholds et al., 1995), and the NNAT gene is also expressed in the adrenal glands. NNAT is also thought to be involved in development and maturation of the pituitary glands (Aikawa et al., 2003). We found that the UF con- centration negatively correlated with NNAT methylation, and that the ACTH level positively correlated with the level of fluoride exposure. Therefore, we hypothesized that NNAT methylation might play an important role in the changes of the serum ACTH level caused by fluo- ride exposure. Accordingly, we investigated the modification effect of For the first time, we used microarray technique to analyze the DNA methylation status of school-age children with different exposure levels at the epigenome level, and the 237 DMSs and 212 DMRs associated with fluoride exposure were screened. We identified that NNAT and CALCA as DMGs were susceptible to fluoride exposure in school-age children using high-throughput sequencing and subsequent population-based validation. Finally, we observed that NNAT methyl- ation could modify the influence of fluoride exposure on the ACTH level in children. These findings provide useful predictors and therapeutic Anqi Wang: Methodology, Formal analysis, Writing – original draft. Qiang Ma: Investigation, Data curation, Writing – review & editing. Biao Gong: Investigation, Resources. Long Sun: Investigation, Re- sources. Francis-Kojo Afrim: Data curation, Writing – review & editing. Renjie Sun: Investigation, Methodology. Tongkun He: Investigation, Methodology. Hui Huang: Conceptualization, Supervision. Jingyuan Zhu: Conceptualization, Supervision. Guoyu Zhou: Supervision, Project administration, Funding acquisition, Writing – review & editing. Yue Ba: Conceptualization, Supervision, Project administration, Funding acquisition, Writing – review & editing. All authors have approved the The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence We express our sincere thanks to all individuals who volunteered to participate in this study and the numerous doctors and nurses of Kaifeng"
]