[
    "Article history: Received 19 April 2020 Received in revised form 1 June 2020 Accepted 3 June 2020 Available online 6 June 2020 Several recent studies have explored the association between environmental factors, such as temperature, hu- midity, and air pollution, and the severity of the COVID-19 outbreak by analyzing the statistical association at thedistrictlevel.However,wearguethatthemodiﬁablearealunitproblem(MAUP)ariseswhen aggregating dis- ease and environmental data into districts, leading to bias in such studies. Therefore, in this study, we analyzed the association between environmental factors and the number of COVID-19 death cases under different aggre- gation strategies to illustrate the presence of MAUP. We used real-worldCOVID-19 outbreak data from the Hubei and Henan Provinces and studied their association with atmospheric NO2 levels. By ﬁtting linear regression models with penalized splines on NO2, we found that the association between COVID-19 mortality and NO2 varies when data were aggregated (1) at the city level, (2) under two different aggregation strategies, and (3)attheprovinciallevel,indicatingthepresenceofMAUP.Therefore,thisstudy remindsresearchersofthepres- ence of MAUP and the necessity to minimize this problem while exploring the environmental determinants of the COVID-19 outbreak. The COVID-19 outbreak is now developing into a global pandemic and causing tremendous human and economic loss. Understanding the factors affecting the pathogenesis of the virus is essential to disease control. Several studies have explored the association between COVID- 19 transmission or the number of COVID-19 death cases with environ- mental factors, such as air pollution (Wu et al., 2020), temperature (Oliveiros et al., 2020; Qi et al., 2020; J. Wang et al., 2020; M. Wang et al., 2020; Rahman et al., 2020; Notari, 2020; Sajadi et al., 2020; Triplett, 2020; Zhu and Xie, 2020; Ma et al., 2020), and humidity (Shi et al., 2020; Luo et al., 2020; Ma et al., 2020), to name a few. The afore- mentioned studies were conducted in a similar ecological study framework: researchers analyzed the statistical association between numbers of COVID-19 cases at the city, regional, or national level with respect to a speciﬁc environmental factor. Apart from environmental factors, a recent study analyzing the association between COVID-19 cases and the prevalence of the Bacillus Calmette–Guérin (BCG) vaccination employed the same approach (Berg et al., 2020; Sala and Miyakawa, 2020). By ﬁnding the association between disease mortality and vaccine policy in different countries, the researchers suggested that BCG vaccination reduced the risk of COVID-19. However, we argue that these conclusions are dependent on the aggregation of environmental Fig. 2. Relationship between daily NO2 (μg/m3) and COVID-19death cases under different scenarios inHubeiProvince.ashows differentaggregation strategies.b shows thecorresponding NO2-death relationship under each scenario. The unit for NO2 on the x-axes is μg/m3 (b). At the city level, each city was presented individually (denoted with different colors); for the two aggregation strategies, adjacent cities were aggregated into districts (denoted with different colors); at the provincial level, all city-level data were aggregated. The COVID-19 data were available from the “nCov2019” package in R, and the environmental data were obtained from the China National Environmental Monitoring Centre (National real time air quality data platform of the China National Environmental Monitoring Centre). We used data from January 27, 2020 to March 10, 2020, when COVID-19 surged in China. During aggregation, deaths across the city were summed and the daily NO2 level on the same day was averaged. Under aggregation strategy 1, cities were aggregated into three districts in the following manner: District 1: Enshi, Yichang, Xiangyang, and Shiyan; District 2: Jingmen, Jingzhou, Suizhou, Xiaogan, and Wuhan; District 3: Hunaggang, Xianning, Huangshi, and Ezhou. Under aggregation strategy 2, District 1: Xiangyang, Shiyan, Suizhou, and Xiaogan; District 2: Enshi, Jingmen, and Yichang; District 3: Jingzhou, Wuhan, and Huanggang; District 4: Ezhou, Huangshi, and Xianning. Four cities were excluded because of missing environmental data or zero COVID-19 mortality. We ﬁt regression models with (1) the linear term of NO2 to estimate the beta coefﬁcient and (2) a penalized spline on NO2 to estimate the dose-response curves with COVID-19 death cases under different aggregation strategies. For city- and district-level data, we put a random effect on the city or aggregated district. The dose-response curves in b were placed in the same order as those in a. The corresponding beta coefﬁcients for the four sce- narios were − 0.052 (city level), −0.75 (strategy 1), −0.83 (strategy 2), and − 1.30 (provincial level).",
    "and disease data. Therefore, we are writing this correspondence to re- mind researchers of a common ﬂaw, namely the modiﬁable areal unit problem (MAUP) that is associated with studies on the environmental factors of the COVID-19 outbreak. The modiﬁable areal unit problem is a statistical bias that arises when aggregating point measurements into districts. Summary mea- sures, such as mean and standard deviation, are inﬂuenced by the boundaries of the aggregation districts. Consequently, the regression outcome is also inﬂuenced by the aggregation strategy. For example, disease is negatively associated with temperature at the individual level (Fig. 1); however, after aggregating to the district level, the rela- tionship between disease prevalence and temperature can be positive, negative, or null, depending on district boundaries. Yaqi Wang: Methodology, Software, Validation, Formal analysis, Data curation,Writing - original draft, Visualization. Qian Di: Conceptu- alization, Writing - review & editing, Supervision. The authors declare that they have no known competing ﬁnancial interests or personal relationships that could have appeared to inﬂu- ence the work reported in this paper. We used real-world NO2 concentration and COVID-19 outbreak data in the Hubei and Henan Provinces, China, to illustrate the presence of MAUP.Byﬁttingregression models, westudiedthe association between COVID-19 death cases and daily NO2 change (1) at the city level, (2) under two different aggregation strategies, and (3) at the provincial level (Figs. 2a and 3a). The dose-response curves for the four scenarios showed different shapes with different regression coefﬁcients (Figs. 2b and 3b). The NO2–COVID-19-death relationship was negative at the provincial level in Hubei Province, indicating a protective effect of NO2 on COVID-19 mortality; however, a positive relationship was observed under aggregation strategy two (Fig. 2b). Similar differences were dis- covered in the Henan Province, where thepositive city-level association became negative when the aggregation strategy was employed (Fig. 3b). The purpose of this real-world example is not to explore the relationship between COVID-19 and NO2 but to demonstrate that such a relationship can be inﬂuenced by aggregation level and aggregation strategy."
]