[
    "Reproductive Medical Center, Henan Province Key Laboratory of Reproduction and Genetics, The First Affiliated Hospital of Zhengzhou University, Zhengzhou, 450052 Henan, China Objective: To study the association between ambient air pollutant exposure during the follicular phase and in vitro fertilization (IVF) outcomes. Patients: Patients (n = 6659) living in Zhengzhou, Henan Province in central China who underwent their first IVF cycle at the First Affiliated Hospital of Zhengzhou University between 2013 and 2019 were included for analysis. Intervention: None. Main outcome measure: The relationships between PM2,5, PMio, and AQI (Air Quality Index) with IVF outcomes during the follicular phase (period I, 85 days before oocyte retrieval; period II, gonadotrophin start to oocyte retrieval). Results: Compared with the bottom tertile, exposure to the top PMz,5 and PMjo tertiles during period I was associated with decreased clinical pregnancy (PM2,5: adjusted odds ratio [OR], 0.838%, and 95% confidence interval [CI], 0.723 and 0.971; PMjo: adjusted OR, 0.818%, and 95% CI, 0.705 and 0.950), and decreased live birth rate (PM. 5: adjusted odds ratio [OR], 0.852%, and 95% confidence interval [CI], 0.736 and 0.987; PMjo: adjusted OR, 0.850%, and 95% CI, 0.733 and 0.986), and exposure to the top PM25s tertile during period II adversely affected clinical pregnancy and the live birth rate (adjusted OR, 0.824%, and 95% CI, 0.711 and 0.955; adjusted OR, 0.817%, and 95% CI, 0.706 and 0.945). Compared with the bottom PM)o tertile, exposure to the middle PMjp tertile in period II showed decreased clinical pregnancies and live births (adjusted OR, 0.844; 95% Cl, 0.729 and 0.978, adjusted OR, 0.846; 95% CI, 0.731 and 0.979). The PMjo level during period II of the follicular phase tend to adversely affect live birth rate, but the tendency did not reach significance (P = 0.051). Conclusion: Exposure to PM2.5 and PMjo before oocyte retrieval has an adverse effect on IVF outcomes. Capsule: Exposure to PM2.5 and PMjo before oocyte retrieval has an adverse effect on IVF outcomes. Air pollution is worsening worldwide and its impact on human health has become a main research topic. Air pollutants represent a primary risk factor for human health and are related to respiratory problems (Guan et al., 2016), cardiovascular disorders (Kaufman et al., 2016), and increased risk of cancer (Fajersztajn et al., 2013). Particulate matter (PM; PM2.5 and PMjo), carbon dioxide (CO), nitrogen dioxide (NOz), sulfur dioxide (SO2), and ozone (O3) are the main pollutants for air quality evaluation. The Air Quality Index (AQI) is calculated with reference to the new ambient air quality standards (GB3095-2012), which include six pollutants, namely, SO2, NO2, PM2.5, PMio, O3, and CO, and could reflect air quality in a way that is accessible to the public. Recent research showed that AQI systems, accompanied with emission reductions on the most polluted days, could help cities achieve cleaner air and tangible health benefits (Chen et al., 2018). With rapid industrial development and urbanization, China has experienced long-term and persistent episodes of smog since 2013. In 2018, only 35.8% of 338 cities met air-quality standards in China and 30% of cities had an AQI > 100, with PMz.5 as the main pollutant in most of the key cities (Zeng et al., E-mail addresses: 13513717690@163.com (W. Dai), shihaol9890208@163.com (H. Shi), rmczzu@126.com (Z. Bu), yypleyx@163.com (Y. Yu), Jingfang1845@ 163.com (Z. Sun), hulinlil999@163.com (L. Hu), syp2008@vip.sina.com (Y.-p. Sun). Air pollutants have been correlated with female infertility (Maha- lingaiah et al., 2016), with recent studies finding associations between air pollution exposure and adverse pregnancy outcomes (Slama et al., 2013). PMz.5 and PMio were associated with reduced fecundability (Conforti et al., 2018). Another study showed that fertility rates were significantly decreased by 2.0% per 10 g/m? increment of PM (Xue and Zhang, 2018). In vitro fertilization (IVF) cycles have well-defined exposure timelines, and its clinical outcomes can be well assessed, providing a novel evaluation of the effects of air pollution on female fertility. The egg quality of a woman plays an essential role in repro- duction and is closely related to the follicular microenvironment which is affected by internal and external changes of the maternal environ- ment. It takes about 85 days for female follicles to develop into mature follicles, and in IVF, ovulation induction takes about 10 days using gonadotrophin (Gn). Several studies have assessed the association be- tween exposure to air pollutants and IVF outcomes during these two follicular phases, but at present, there is limited report on the relation- ships among AQI and IVF outcomes. To further investigate the impact of exposure to ambient air pollutants on female reproductivity, we analyzed IVF cycles conducted under different air quality conditions.",
    "Our study population was comprised of infertile women who un- derwent their first fresh IVF cycles at the fertility center of the First Affiliated Hospital of Zhengzhou University from January 2013 to December 2019 and lived in Zhengzhou during the treatment period. The First Affiliated Hospital of Zhengzhou University in located at Henan Province, central China, which has a population of 10.35 million people and is one of the areas affected most seriously by haze in China. Infertile women aged 20-49 years were included in our study. The exclusion criteria included donor cycles, preimplantation genetic diag- nosis/screening (PGD/PGS) cycles, no oocyte retrieval cycles, and insemination-failure cycles, embryo transfer cancellation cycles (Fig. 1). Clinical data were extracted from the Clinical Reproductive Medicine Management System (CCRM). Ovulation inductions were performed using a gonadotropin- releasing hormone (GnRH) agonist long protocol, antagonist protocol, or mild stimulation protocol. Based on female age and body mass index (BMD), the optimal ovulation protocol and Gn start dose were deter- mined. The adjustments of Gn doses were based on follicular growth speed as well as serum estrogen levels. When two or more follicles reached a diameter of 18 mm or more than 60% of follicles reached 16mm, recombinant human chorionic gonadotropin (HCG, Merck Serono, Italy) was administered to trigger ovulation. Ovum pickup was performed 36-37 h after HCG triggering. IVF and/or intracytoplasmic sperm injection (ICSI) was used for fertilization. One or two cleavage or blastocyst embryos were transferred (ET) at 3 or 5 days after oocyte retrieval, according to the embryo quality and the patient’s physical condition. Luteal support was initiated on the day of oocyte retrieval with daily transvaginal progesterone (Merck Serono, Switzerland) and oral progesterone (Dupbaston, Abbott, Holland). Clinical pregnancy was defined as confirmation of a gestational sac 35 days after ET; miscarriage was defined as spontaneous loss of pregnancy before 28 weeks’ gesta- tional age; early miscarriage was defined as pregnancy loss before 12 weeks of gestational; and live birth rate was defined as live birth among all ET cycles; preterm birth was defined as the birth of a baby at fewer than 37 weeks’ gestational age. Daily concentrations of PM2.5, PMio, and AQI in Zhengzhou were obtained from the China National Environmental Monitoring Center (http://106.37.208.233:20035). The follicle growth phase was divided into two periods: Period 1 was 85 days before oocyte retrieval (pre85) and period II was from gonadotropin application to oocyte retrieval (COH). For each period, the average ambient air pollutant concentration was calculated. We assumed that every patient would stay in Zhengzhou during the study period because of the need to complete infertility tests, along with continuous follicular monitoring and treatments in our center. Patient characteristics, including maternal age, BMI, number of retrieved oocytes, education, infertility types, fertilization method, and protocols were obtained from the CCRM system. Education was classi- fied as below college level, college degree, or graduate degree. More- over, in our center, fertilization method was determined by semen quality in patients’ first cycle, and rescue ICSI was performed when more than half oocytes fertilization failure, so considering male’s factor, the fertilization method was categorized into three groups: IVF, ICSI, and rescue ICSI. Infertility factors included tubal factor, endometriosis/ adenomyosis, uterine factor, ovulatory dysfunction, diminished ovarian reserve (DOR), male factor, and unexplained factors(the reason for infertility remain unclear after tests, might be caused by mental stress or other unknown factors). Descriptive statistics of patient characteristics were summarized as mean and standard deviations (SD) or as counts and percentages for continuous variables and categorical variables, respectively. Air pol- lutants were summarized by the mean value + SD and the median and tertile range. Multivariate logistic regression models were used to assess associations between ambient air pollution exposures and IVF preg- nancy outcomes. Odd ratios (ORs) and 95% confidence intervals (Cls) were used to present the results. Both unadjusted and adjusted ORs for a tertile range increase in each pollutant were obtained. The P-values for interaction were calculated using a multiplicative interaction term included in the multivariate logistic regression model. The variables that we adjusted are listed in the Covariates section. All statistical analyses were performed with R (http://www.R-project.org) and EmpowerStats software (www.empowerstats.com, X&Ysolutions, Inc., Boston, MA, USA). A value of P < 0.05 was considered significant. The study was approved by the Ethics Committee of the First Affiliated Hospital of Zhengzhou University and informed consent was obtained from all the participants.",
    "Our study evaluated 6659 patients who had undergone their first fresh IVF cycles at the fertility center of the first affiliated hospital of zhengzhou university from January 2013 to December 2019. All pa- tients lived in Zhengzhou at the time of their IVF treatments. Table 1 shows the clinical characteristics of the study population. The mean age at the time of IVF treatment was 32 years old, average BMI was 22.5 kg/ m2, mean number of retrieved oocytes was 12.85, clinical pregnancy rate (CPR) was 57.28% (2797/4884), live birth rate (LBR) was 47.5% (2320/4884), and early miscarriage rate was 10.26% (287/2797). For 85 days before oocyte retrieval period, the average daily concentration of PMz.5, PMio, and AQI was 73.19 pg/m3, 130.71 pg/m3, and 116.40, respectively (Table 2). For Gn start to the oocyte retrieval period, the average daily concentration of PM2.5, PMio, and AQI was 73.55 pg/m?, 130.62 1g/m3, and 117.11, respectively (Table 2). Meanwhile, the bottom (T1), middle (T2) and top (T3) tertile of PMz.5, PMio, and AQI levels were calculated and used for grouping (Table 2). The univariable analysis of IVF outcomes is shown in Supplementary Table 1. We found that, the PM2.5, PM10 and AQI levels had no correlation with no available embryo rate (Supplementary Table 1). Among 6659 included patients, 4884 patients who transferred em- bryos at the first fresh cycle were included for IVF outcomes analysis. Multivariate logistic regression models were used to analyze the asso- ciation between clinical pregnancy, live birth, with air pollution expo- sure in the two different follicular periods (pre85 and COH) during IVF treatment. Tables 3 and 4 summarize the unadjusted and adjusted ORs for tertile increases in concentrations and the trend test of the air pol- lutants and AQI in the two follicular periods. During period I (pre85), we found that when compared with the bottom PM2 5 tertile, the top PM2 ‘5 tertile was associated with a 16.2% lower clinical pregnancy rate (adjusted OR, 0.838; 95% CI, 0.723 and 0.971), P for trend was 0.020. Compared with the bottom PM)p tertile, the top PMio had an 18.2% lower clinical pregnancy rate (adjusted OR, 0.818; 95% CI, 0.705 and 0.950), P for trend was 0.008. Top PM2 5 levels also had a negative effect on live birth rate compared with the bottom PM2 5 tertile (adjusted OR, 0.852; 95% CI, 0.736 and 0.987, P for trend = 0.033), and the top PMjo had 15% lower live birth rate than BMI, body mass index; IVF, in vitro fertilization; ICSI, intracytoplasmic sperm injection; ET, embryo transfer; CPR, clinical pregnancy rate; LBR, live birth rate. the bottom tertile (adjusted OR, 0.85; 95% CI, 0.733 and 0.986), P for trend was 0.033. However, results showed that AQI levels did not have significant effects on live birth rate. During period II (COH period), we found that compared with the bottom tertile, the middle and top PM25 tertiles were associated with 13.9% and 17.6% lower clinical pregnancy rates, respectively (adjusted OR, 0.861%, and 95% CI, 0.742 and 0.999; adjusted OR, 0.824%, and 95% CI, 0.711 and 0.955), P for trend was 0.010. Compared to the bottom PMjo tertile, the middle tertile had a 15.6% lower clinical pregnancy rate (adjusted OR, 0.844; 95% CI, 0.729 and 0.978, P = 0.024). Moreover, compared with the bottom PM25 tertile, the top PMz5s tertile had an 18.3% decrease in the live birth rate (adjusted OR, 0.817; 95% CI, 0.706 and 0.945), P for trend was 0.007. Compared to the bottom PMjo tertile, the middle tertile had a 15.4% lower live birth rate (adjusted OR, 0.846; 95% CI, 0.731 and 0.979, P=0.024). In order to analyze whether infertility types affect IVF outcomes under different air pollution conditions, adjusted multivariate logistic regression models were used to estimate OR and 95% Cls for clinical outcomes for tertile range (from the 33rd to 67th percentile) increments in pollutant concentration within different infertility types (Tables 5 and 6). Results showed that after adjusting the age, the BMI, number of retrieved oocytes, education, infertility types, fertilization method as well as protocols, and infertility types had no correlation with PM2.5 and PM10 on CPR and LBR (P > 0.05, Tables 5 and 6). Hence, PM2.5 and PM10 can be regarded as independent adverse factors for IVF outcomes.",
    "PM2s, airborne particulate matter with a median diameter of 2.5 um or less. PMjo, airborne particulate matter with a median diameter of 10 ym or less. between the highest tertile ambient concentrations of PM2,5 and PMig during period I of the follicular phase and a decreased probability to achieve a clinical pregnancy and live birth after adjusting for individual confounding factors. In addition, higher ambient concentrations of PM2 5 during period II of the follicular phase had detrimental effects on both clinical pregnancy rate and live birth rate. Compared with the bottom PMjo tertile, exposure to the middle PMjo tertile in period II showed decreased clinical pregnancies and live births (adjusted OR, 0.844; 95% CI, 0.729 and 0.978, adjusted OR, 0.846; 95% CI, 0.731 and 0.979). The PMjo level during period II of the follicular phase also adversely affected live birth rate, but the P value for tendency did not reach significance (P = 0.051). This study suggested that exposure to air pollutants especially PM2.5 may negatively affect IVF outcomes. Our results are consistent with other studies that have reported that IVF-ET success rates were highest when PM concentrations were at its lowest (Kang et al., 2020). Studies have shown that particulate matter is associated with an increased risk of infertility (Carré et al., 2017), and PMjpo levels in the period between ET and pregnancy testing were inversely associated with intrauterine pregnancy rates (Choe et al., 2018). However, a study conducted by Boulet et al. has not observed PM2.5 was associated with any reproductive outcomes (Boulet et al., 2019). In Boulet et al.’s study, the average PM2 5 was 9.3 g/m? from the start of the cycle to oocyte retrieval, which was far below 73.55 g/m? in our study. In another study conducted in Chengdu, China, a negative association between PM2.5 and PMjo levels with biochemical and clin- ical pregnancies was shown; and in this study, the mean annual PM25 and PMjo concentrations were 58.5 g/m? and 95.51 pg/m3, respec- tively (Zeng et al., 2020). We speculated that the effect of air pollutants exposure on reproductive outcome should be concentration-dependent (Perin et al., 2010). Average and peak pollutants exposure conditions were two ways for investigating toxicology. Our study as well as studies mentioned above were mainly based on average pollutants exposure levels during specific period. A study conducted by Mendola et al. brought with the idea that, peak exposure of PM2.5 and NOx during first 7 weeks of gestation was associated with higher preterm delivery rate (Mendola et al., 2014). However, no study had been conducted to compare the efficacy of average models with the peak one. AQI is a comprehensive indicator of air quality, which simplifies the concentrations of pollutants into one single numerical form, and a higher AQI means poor air quality. Zhang et al. previously reported that Adjust for: AGE; BMI; No. of oocytes retrieved; education level (less than college, college degree, graduate degree); infertile diagnosis (tubal factor, endometriosis/ adenomyosis, uterine factor, diminished ovarian reserve, ovulatory dysfunction, male factor, unexplained); fertilization methods (IVF, ICSI, rescue ICSI); protocol (agonist protocol, Antagonist protocol, mild protocol). Results showed in bold indicated statistically significant differences (P < 0.05). Adjusted for age, BMI, number of retrieved oocytes, education, infertility types, fertilization method, protocols. Air pollution exposure defined as high at 67th percentile versus low at 33th percentile of exposure. Abbreviations: pre 85 PMs, airborne particulate matter with a median diameter of 2.5 ym or less during 85 days before the oocyte retrieval. COH PMy 5s, airborne particulate matter with a median diameter of 2.5 um or less during Gn start to oocyte retrieval. sperm development under a high AQI value may be correlated with sperm oxidative damage (Zhang et al., 2020). Few studies have exam- ined IVF outcomes in association with exposure levels defined by the AQI. In our study, we noticed that the relationships between the AQI value and IVF outcome in the follicular phase was not statistically significant. This may be because the AQI showed levels of SO2, NO2, PM25, PMio, 03, and CO synthetically. Previous studies had revealed that positive associations between high levels of O3 during follicular phase and improvements in ovarian response and embryo quality (Boulet et al., 2019; Carré et al., 2017). It is speculated that the Abbreviations: pre 85 PMjo, airborne particulate matter with a median diameter of 10 ym or less during 85 days before the oocyte retrieval. COH PMjpo, airborne particulate matter with a median diameter of 10 ym or less during Gn start to oocyte retrieval.",
    "detrimental effect of AQI on IVF outcomes might be compensated by 03. Overall, the interaction between the upper tertile AQI value in period and clinical pregnancy, live birth rates were suggestively significant (AOR < 1), suggesting that higher AQI may have detrimental effects on IVF outcomes. We analyzed the interaction between air pollutants and clinical outcomes in women with different diagnoses of infertility. Although we found that women with tubal factor infertility tend to have a negative clinical outcome after exposure to higher PM2.5 and PM concentrations during the follicular phase, no significant interaction between any subgroups of infertility types and air pollutants were identified, which is inconsistent with a study by Quraishi et al. (2019). Quraishi et al. found that there were some add-on effects of diminished ovarian reserve (DOR) or male infertility on air pollutants on livebirth (Quraishi et al., 2019). We speculate that contradiction may come from the differences of air pollutant components. Several possible mechanisms of the effect of air pollutants on IVF have been proposed. First, chronic or acute inflammation on local tissues caused by atmospheric particulates is considered to be an important mechanism for the occurrence and development of related diseases (Valavanidis et al., 2013), and PM can promote the inflammatory pro- cess, damaging the female reproductive system (Gai et al., 2017). Sec- ond, air pollutants can act as reactive oxygen species, leading to oxidative DNA damage and higher oxidative stress, affecting cell func- tion and metabolism (Vattanasit et al., 2014). It has been suggested that oxidative stress contributes to chromosomal abnormalities and nega- tively impacts IVF outcomes (Agarwal et al., 2012). Third, particulate air pollutions may reduce maternal vessel diameters, disrupt vascular function which may lead to reduced ovarian blood supply (Veras et al., 2008). Finally, it is suggested that some chemicals in PM could disrupt steroidogenesis through activating aryl hydrocarbon receptor (AhR) therefore interfere or inhibit the function of the hypothalamic-pituitary-gonadal axis in females (Takeda et al., 2004; Hernandez-Ochoa et al., 2009; De Coster and van Larebeke, 2012). Meanwhile, some air pollutants could promote oxidative stress and induce epigenetic changes (Kampa and Castanas, 2008). Experiment on mice model showed that short-term exposure to diesel pollutants could disrupt the normal segregation pattern of the first 2-cell lineages at the blastocyst stage, as well as the loss of inner cell mass morphological integrity on fertilization and embryo development in vitro (Maluf et al., 2009). However, how each air pollutant content affect human oocyte and embryo quality has not been well studied. To our knowledge, our study is the largest retrospective analysis to investigate the impact of air pollutant exposure during the follicular phase on IVF outcomes in China. This study had several limitations. Although we noted a negative association between IVF outcomes and exposure to air pollution during the follicular phase, we identified other confounding factors that should be controlled, such as dietary and psychological factors. Furthermore, although the data we used were from an air-quality monitoring station in Zhengzhou and the study population we selected is comprised of local residents, our study may not represent the real level of individual exposure to air pollutants because it is challenging to accurately evaluate a patient's daily activity. Third, the study population was limited, with the majority of the pop- ulation included in this study being Han Chinese. Last but not least, we mainly focused on the effects of average pollutant levels on reproductive outcomes, but we did not investigate or compare the effect of exposure to peak level pollutants on pregnancy outcomes, which might lead to In conclusion, our study showed a significant association between exposure to PM2.5 and PMjo during the follicular phase and adverse IVF outcomes. These findings suggest that protective measures to avoid exposure to air pollutants should be taken at least 3 months before IVF treatment and oocyte retrieval. Further prospective cohort studies with multicenter populations should be performed to confirm our findings. Wei Dai: Research design, Methodology, Data analysis, Writing - reviewing & editing. Hao Shi: Methodology, Data analysis, Reviewing. Zhigin Bu: Clinical activity and reviewing. Yiping Yu: Manuscript editing, reviewing. Zhimin Sun: Patient follow-up, Reviewing. Linli Hu: Research design, Methodology, Manuscript writing, Reviewing and correspondence. Ying-Pu Sun: Research design, Patient follow-up, Data quality control, Methodology, Review and correspondence.",
    "The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. This work was also supported by funding from the China National Center for Biotechnology Development for the National Key R&D Pro- gram of China (2019YFA0110900) to Ying-pu Sun."
]