[
    "Rural tourism is a powerful way to revitalize the countryside, and its spatial pattern is crucial for sustainable development. This paper analyzes the spatial distribution of rural tourism charac- teristic villages in Henan Province by taking 723 villages as the research object and using the nearest neighbor index, kernel density analysis, and spatial autocorrelation. It investigates the influencing factors utilizing the optimal parameters-based geographical detector (OPGD) model. The results show that, firstly, the overall spatial distribution of the rural tourism characteristic villages in Henan Province is characterized by aggregation and unbalanced distribution, and the overall spatial distribution density demonstrates the aggregation characteristics of “four cores and one belt”. Secondly, the rural tourism characteristic villages can be divided into four primary categories, agricultural industry, rural culture, and featured villages and towns. The spatial dis- tributions of the four main categories are all clustered. Thirdly, the primary factors affecting the differences in the spatial distribution of the rural tourism characteristic villages are the topo- graphic features, economic development level, tourism market potential, traffic capacity, and relevant policies, among which the critical factor is the number of A-class scenic spots in the tourism market potential. To promote the optimisation of the spatial pattern of rural tourism, it is necessary to strengthen resource integration. Furthermore, it is important to conduct in-depth exploration of more factors in order to provide comprehensive guidance for the sustainable development of rural tourism. Characteristic rural tourism villages refer to villages with distinctive characteristics and rich cultural tourism resources, embodying regional and cultural characteristics in ecological sightseeing, farming experience, distinctive folk culture, traditional village, and new rural construction, and having specific market attraction [1]. Their main activity places are rural areas, and the tourists are primarily urban residents or remote residents with significant differences in rural folk culture. In recent years, the No. 1 document of the Central Government has continued to focus on rural tourism, proposing that the development of rural tourism is an essential measure to realize the strategy of rural revitalization, accelerate the construction of new rural areas, and solve the problem of “three agricultures” [2-4]. Received 11 November 2023; Received in revised form 23 March 2024; Accepted 28 March 2024 Available online 3 April 2024 2405-8440/© 2024 The Authors. Published by Elsevier Ltd. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-ne-nd/4.0/). In order to implement the rural revitalization strategy, the General Office of the Henan Provincial Government, in their \"Opinions on Accelerating the Development of Rural Tourism\", emphasized the objective of establishing distinct rural tourism destinations. These destinations should have distinctive tourism characteristics, abundant cultural resources, and maintain a significant scale, thereby ensuring the continual high-quality development of rural tourism [5]. As a multidisciplinary research field, rural tourism involves geography, tourism, sociology, and other disciplines. In recent years, the spatial distribution characteristics and influencing factors of rural tourism destinations have widely received scholars’ attention. From the perspective of the research content, scholars have mainly explored several aspects, such as the sustainable development of rural tourism [6-10], tourists’ satisfaction [11-14], and development and operation modes [13,15-18], spatial distribution charac- teristics [19-21], influencing factors [22,23], and spatiotemporal evolution [24] of rural tourism places. From the perspective of research methods, both national and international scholars initially explored rural tourism challenges through qualitative techniques, primarily case studies. However, as research depths increased, there was an evident shift towards quantitative analysis. For example, Wang and Shi [25] used the average nearest neighbor method, buffer analysis and other methods, combined with geographical de- tector and entropy weighting method to study the spatial distribution characteristics of beautiful leisure villages in China, and clarified its main influencing factors. Additionally, Zhang et al. [26] analyzed the influencing factors of spatial differentiation and accessibility of rural tourism demonstration villages in Shaanxi Province using kernel density analysis, Pearson correlation coefficient, and geographically weighted regression model. From the perspective of research region and spatial scale, current research on rural tourism destinations in China mainly utilizes macro- and meso-scale perspectives to study rural tourism destinations across the country, specific provinces, river basins, and designated regions [27-30]. For instance, Zhang et al. [28] explored the spatial distribution characteristics and influencing factors of key rural tourism villages in China from the macro perspective. Liu et al. [31] studied the spatial distribution and influencing factors of rural leisure tourism destinations in Shanxi Province using a meso perspective.",
    "Based on the above analysis, this paper will optimize the following aspects. Firstly, conduct classification research. The classifi- cation of rural tourism destinations is combined with the characteristics of resource types. Then it analyzes the spatial distribution and influencing factors of rural tourism in different resource types. Secondly, refine research scale. The influencing factors of the spatial distribution of rural tourism destinations will be discussed from the micro-grid scale. Thirdly, optimisation analysis methods. The optimal geographic detector model parameters are used to solve the problem of poor discretization of independent variables in traditional geographic detectors. This study aims to promote the high-quality development of rural tourism characteristic villages by analyzing and evaluating the spatial distribution and influencing factors of rural tourism. Additionally, it will provide practical insights for the scientific devel- opment of rural tourism and help promote rural revitalization overall. Therefore, this article targets the 723 rural tourism requirements aldol topographic jure aly a climate choserS haracteristics,cvitalization ete ise ected trevigus cons? ald ectedavailability agraseqeh ironman’ Lig hn roads count Jaroun influencin ful tural Sour crv tbhiiental compare ~any Sen SAS; ve Mossarch ropo ion ar distance propor tig Kurs eee at Fe CO C relatienship ee 40! esrb rag raf fic rermataa CANS POPT atione:r<<ts formati chine Q wesc po liciesproducti economy adised yi, CONCIUSIONS cretedelta tent “previnciaisustainable Ginclined copra % destination: coupling endowment collectivelygeographical gazettéscoef ficient characteristic villages in six batches from 2018 to 2022 recently announced by the Henan Provincial Department of Culture and Tourism. Employing a \"holistic and categorical\" approach at the county scale, GIS spatial analysis methods, such as the nearest neighbor index, kernel density analysis, and spatial autocorrelation. We combined with a parameter-based geographical detector model to quantitatively explore the overall and various types of spatial distribution characteristics of rural tourism characteristic villages in Henan Province, as well as the factors that influence them. The rest of this study includes the following parts: The second part is the literature review, combing the influencing factors of the spatial distribution of rural tourism. The third part describes the research methods used in this paper. The fourth part is the research results. The fifth part discusses the research results and puts forward policy suggestions for the development of rural tourism. Finally, the sixth part expounds the conclusion of this paper. Spatial analysis is a crucial aspect of rural tourism planning and development. The aim of this study is to investigate the impact mechanism of rural tourism resources and to promote the sustainable development of the region by achieving rational use and improving tourism efficiency. The spatial pattern and sustainable development of rural tourism is influenced by various factors, including natural, social, economic, and traffic factors [32]. According to Tian et al. [33], rural tourism development is based on the natural environment, with social and economic factors playing a leading role. Additionally, traffic convenience can also impact the development of rural tourism. Regarding internal factors, natural geographical environment such as topography and altitude is the main factor affecting the spatial distribution of rural tourism villages, which is very important for their development [34-36]. Regarding external factors, Sun [37] used regression analysis to develop a model for the influencing factors of rural tourism in China. The study found that economic development plays a significant role in the development of rural tourism, which can provide tourists with essential services. Dragoi et al. found that regional GDP and national highway kilometers have a positive impact on rural tourism [38]. Similarly, the level of tourism accessibility directly influences tourists’ decision-making regarding rural tourism [28,39,40]. According to Zhao [41] and other studies, there is a positive correlation between resource endowments and the spatial distribution of rural tourism. The development of rural tourism is promoted by the complementary nature of rural tourism destinations and high-level scenic resources [42,43]. These studies demonstrate that economic development, traffic accessibility, and the tourism market contribute to the promotion of rural tourism. Regarding policy factors, research shows that government policies have a significant impact on the development of tourism poverty alleviation villages and play a vital guiding role [44-46]. In summary, this study uses grounded theory qualitative analysis to identify the factors that influence the spatial distribution of rural tourism, which generated a word cloud map (Fig. 1). Thus, this paper constructs the influencing mechanism framework of rural tourism spatial pattern from three aspects: internal factors, external driving factors and government regulation, including five aspects: natural factors, economic development level, tourism market, transportation capacity and relevant policies (Fig. 2).",
    "The province of Henan, referred to as “Yu”, is located in the central and eastern part of China. It is located between 31°23'-36°22'N and 110°21'-116°39' E (Fig. 3) and connects with Anhui and Shandong in the east, Hebei and Shanxi in the north, Shaanxi in the west, and Hubei in the south. It looks north to south and connects the east to the west. The total area of the province is 167,000 km?, about 1.73% of the total area of the country, spanning four major basins: the Yangtze River, the Yellow River, the Huai River, and the Hai River. Henan is a traditional agricultural province in China with sizeable rural tourism resources, with about 80% of the tourism resources in the countryside. Since 2010, Henan Provincial Tourism Bureau has organized many large-scale characteristic tourism villages with distinctive features loved by domestic and foreign tourists in the “One Hundred Villages and One Thousand Households” tourism project. Since 2018, the province of Henan has selected several villages with rural tourism characteristics, rural tourism creator demonstration bases, notable ecological tourism demonstration towns, and leisure tourism areas to fully implement the central rural revitalization strategy and give full play to the critical role of rural tourism in tourism poverty alleviation. The list of rural tourism characteristic villages in the province of Henan is obtained from the featured villages published on the official website of the Culture and Tourism Department of Henan Province (https://hct.henan.gov.cn), with a total of 6 batches of 723 tural tourism characteristic villages as of September 2022. The latitude and longitude coordinates of each village are determined by employing the Gaode Map API coordinate picker. In addition, the digital elevation model (DEM) data come from the geospatial data cloud (https://www.gscloud.cn), and the administrative division data and road network data of 158 counties (districts) in the province of Henan source from the National Catalogue Service for Geographic Information (https://mulu.tianditu.gov.cn). The economic and population data of each county (district) originate from the 2022 Henan Provincial Statistical Yearbook and the government announcement of each county (district). The data on A-class scenic spots come from the directory information published by the Culture and Tourism Department of Henan Province. This paper examines the spatial distribution patterns of rural tourism characteristic villages using the nearest neighbor index, kernel density, spatial autocorrelation and other spatial analysis methods, and combines the optimal parameters-based geographical detector model to analyze its influencing factors. The paper presents its research methods and ideas in Fig. 4. The nearest neighbor index method uses the distance between the nearest neighbor pairs to reflect the spatial distribution char- acteristics of point elements [47]. The nearest neighbor index is calculated as the ratio of the average observed distance between the actual nearest neighbor pairs to the expected average distance between the nearest neighbor pairs, and Equation (1) expresses its formula as follows: where R is the nearest neighbor ratio, r; indicates the average observed distance between actual nearest neighbor pairs, rz; represents the average observed distance between expected nearest neighbor pairs, R; denotes the distance between rural tourism characteristic village i and its nearest neighbor, n is the total number of rural tourism characteristic villages, S stands for the study area: the province of Henan. When R > 1, rural tourism characteristic villages are uniformly distributed, and when R < 1, they are clustered; they are randomly distributed at an R of 1. Kernel density analysis is a nonparametric estimation method used to calculate the density of elements in the whole region [48]. Its basic principle is to take the element point as the core and count the density of the point elements within its surrounding search radius so as to analyze the degree of spatial aggregation of rural tourism characteristic villages. The higher the nuclear density, the greater the degree of spatial aggregation, and vice versa. Equation (2) expresses its formula: where f(x) is the kernel density estimate of rural tourism characteristic villages, n denotes the number of rural tourism characteristic villages, h indicates the bandwidth, k represents the weight of rural tourism characteristic village x, and x — x; is the distance between rural tourism characteristic villages x and x;. Spatial autocorrelation analysis is employed to determine the spatial correlation of a variable and the degree of association [49]. This paper uses Moran’s I index (see Equation (3)) to determine the autocorrelation of the spatial distribution of rural tourism characteristic villages in different regions of Henan Province.",
    "where N is the total number of rural tourism characteristic villages in the province of Henan, x; and x; indicate the number of rural tourism characteristic villages in each county (district) of Henan, X represents the average number of rural tourism characteristic villages in 158 counties (districts) of this province, and wj is the spatial weight matrix of 158 counties (districts) in this province. Regarding wj, when study area i is adjacent to study area j, it is considered one; otherwise, it is assumed to be zero. Moran’s I is taken in the interval [-1,1]. A Moran’s I higher than zero indicates that rural tourism characteristic villages are positively correlated in space, and a negative Moran’s I implies that they are negatively correlated in space; when Moran’s I index equals zero, rural tourism characteristic villages are irrelevant. The local correlation index, Getis-Ord G;, is commonly used to identify the degree of spatial heterogeneity of elements on a local scale and thus to analyze cold and hot areas in a spatial distribution. Equation (4) defines the local correlation index as follows: The geographical detector is a new method for analyzing spatial heterogeneity, and its core theory is to test whether the spatial distribution pattern between the dependent variable and the independent variable is consistent through spatial heterogeneity so as to measure the degree of the explanation of the spatial divergence between the independent and dependent variables [50]. In order to avoid the problems of subjectivity and poor discretization of traditional geographic detectors for continuous variables, we use a parametric optimal geographic detector [51] to analyze the factors influencing the spatial distribution of rural tourism characteristic villages in the province of Henan. The optimal parameters-based geographical detector (OPGD) model selects the parameter combi- nation with the optimal q value for discretization and then detects the factors influencing the spatial heterogeneity of rural tourism characteristic villages in the province of Henan. Equation (5) defines the explanatory power of the factors affecting the spatial dis- tribution of villages with rural tourism characteristics in the province of Henan: where q is the detection value of each factor influencing the rural tourism characteristic villages in the province of Henan and ranges from 0 to 1.0: the higher the value of q, the stronger the explanatory power of this detection factor for rural tourism characteristic villages; h = 1, 2, ..., Lis the partition (stratification) of dependent variable Y or independent variable X; Np, and N indicate the number of cells of stratum h and the study area, respectively; «7 and o denote the variance of dependent variable Y in stratum h and the whole area, respectively; SSW and SST represent the sum of variance within the stratum and the total variance of the whole area, respectively. Rural tourism is a comprehensive form whose primary contents include rural scenery, folk culture, agricultural experience, and life forms. The type classification of rural tourism characteristic villages in Henan Province is still in the preliminary exploration stage [52]. Therefore, the type classification of rural tourism is mainly based on the classification of rural tourism and leisure agricultural parks. Huang et al. [53] divided rural leisure tourism into four primary types by combining the nature of tourism resources and leisure methods, and Li et al. [54] classified rural tourism under five categories by combining the actual situation of the study area and the concept of rural tourism. In another work, Wang et al. [55] divided rural tourism leisure places into five major systems by combining the concept of rural tourism leisure places and the development status. He [52] also classified rural tourism resources in the province of Henan under five main categories by combining the specific representative places of rural tourism. This paper refers to the classifi- cation standards of rural tourism and leisure agriculture parks and the Classification, Investigation, and Evaluation of Tourism Re- sources (GB/T 18972-2017). It considers the “rusticity” of rural tourism: “countryside, soil, and agriculture”. The rural tourism characteristic villages in the province of Henan are divided into four primary categories and 13 subcategories, as listed in Table 1. The villages with leisure tourism characteristics have the natural landscape as their main attraction and rely on the rich natural resources, with the largest number of 322, accounting for 44.54%. The villages with rural cultural characteristics combine historical sites and folk culture to form tourist attractions. This category has 185 destinations, accounting for 25.95%. The villages that char- acterize the agricultural industry utilize the advantages of agricultural resources to combine agricultural sightseeing and farming experiences with tourism. There are 137 such villages, accounting for 18.95% of the total. The featured villages and towns pay attention to the unique style of ancient and modern demonstration villages, attracting tourists to experience their characteristics. The number of such villages is relatively small, with only 79 places, accounting for 10.93%. In general, the villages in Henan Province that are known for rural tourism are mainly those with leisure tourism characteristics. This is closely related to the abundant natural landscape resources found in Henan Province.",
    "average nearest neighbor tool in ArcGIS10.8. The nearest neighbor index is 0.6584, smaller than 1.0, and the Z-score is —17.5617, lower than —2.58, tested at a 1% significance level. This shows that the spatial distribution of rural tourism characteristic villages in the province of Henan presents aggregation characteristics. The nearest neighbor index only shows that rural tourism characteristic villages have spatial aggregation and does not indicate the specific characteristics of their spatial aggregation. Therefore, kernel density analysis is utilized to further explore the specific char- acteristics of the spatially distributed aggregation of rural tourism characteristic villages in the province of Henan. The kernel density map of the villages with rural tourism in the province of Henan is obtained using the kernel density analysis tool (Fig. 5). The kernel density map demonstrates that the spatial distribution of rural tourism characteristic villages in the province of Henan has formed “four cores and one belt” aggregation characteristics. The four cores refer to the gathering area with the district of Qibin and Xiuwu County in the northern province of Henan and the city of Gongyi and Jia County in the central province of Henan. The one belt ad- dresses the four cores and other relative aggregation areas to form an S-shaped belt, gathering Qibin, Xiuwu, Gongyi, Jia, Lushan, and others. On the county scale, to further determine the correlation of rural tourism characteristic villages in each county (district), we conduct Moran’s I analysis utilizing GeoDa software. The results are as follows: Moran’s I = 0.228, the Z-score is 4.59 > 2.58, and P < 0.01 (at a confidence level of 99%). This indicates a positive spatial autocorrelation in the spatial distribution of the rural tourism characteristic villages in the province of Henan. The local indicators of spatial association (LISA) clustering map of rural tourism characteristic villages in the province of Henan (Fig. 6) demonstrates that the “high-high” clustering of rural tourism characteristic villages mainly concentrates in the city of Huixian, the city of Linzhou, the district of Qibin, and Qixian County in the northern province of Henan; the counties surrounding Luanchuan County as the core in the western province of Henan; the city of Xinmi, Dengfeng County, and the city of Ruzhou in the central province of Henan; and Xixia County in the southern province of Henan. The “low-low” clustering primarily concentrates in Shangshui County, the city of Xiangcheng, the district of Huaiyang, and Luyi County in the eastern province of Henan; Shangcai County in the southern province of Henan; and the district of Luolong in the western province of Henan. The “low-high” clustering is mainly distributed in the district of Jili, Huojia County, and the district of Shilong, and the “high-low” clustering is primarily distributed in the district of Yindu. The aggregation in the other counties (districts) is insignificant. The most proximity index is employed to analyze the spatial distributions of each type of rural tourism characteristic village in the province of Henan (Table 2). The results demonstrate that the spatial distributions of each type of rural tourism characteristic village are all in the aggregation distribution mode, with their most proximity indices all less than 1.0; the Z-scores all lower than —2.58, and the P-values all smaller than 0.01. That is, they pass the significance level of 1%. Regarding the nearest neighbor ratio of each type of rural tourism characteristic village, the leisure tourism category has the highest degree of aggregation, followed by the rural culture category and the agricultural industry category; the characteristic village and town category has the lowest degree of aggregation. The kernel density map (Fig. 7) and the distribution map of the cold and hot spots (Fig. 8) of the various types of rural tourism characteristic village in Henan province are derived using the kernel density analysis tool with the local association index Getis-Ord G; in ArcGIS. The results indicate significant differences in aggregation patterns of each type of rural tourism characteristic village. The leisure tourism category focuses on natural scenery and sightseeing experience, and the gathering characteristics of this category of featured villages strongly correlate with those of the overall rural tourism characteristic villages in the province of Henan. The featured villages in the leisure tourism category are widely distributed, mainly attached to A-class scenic spots in the city Linzhou, the district of Qibin, Xiuwu County, the city of Jiyuan, the city of Gongyi, the city of Yuzhou, Lushan County, and Luanchuan County. They also have high nuclear density values (Fig. 7(a)). Analyzing the hot spots (Fig. 8(a)) concludes that the featured villages in the leisure tourism class, with Luanchuan County as the core of the surrounding counties, as well as Hui County and the city of Linzhou, are the hot spots.",
    "The agricultural industry is a category of villages with agricultural production and farming experience as the primary business mode. Combined with the tourism elements, they offer tourists a unique and unparalleled agricultural experience. The category of featured villages shows a more uniform “multicore” distribution pattern on the county scale than the others (Fig. 7(b)). The hot spots are mainly ecological picking gardens in the surrounding areas (Fig. 8(b)). The rural culture category strongly correlates with monuments, folklore, and red tourism, and integrates abundant historical and cultural resources with historical monuments, folklore culture, and ancient revolutionary sites as the core. This category of charac- teristic villages is primarily distributed in Qingfeng County, the district of Shancheng, the district of Shanyang, the city of Gongyi, and Jia County as the core (Fig. 7(c)). Analyzing the hot spots (Fig. 8(c)) reveals that they are mainly in Qingfeng County and its sur- rounding counties, the district of Qibin, Qinyang and its surrounding counties, and Yuzhou and its surrounding counties. The distribution of the category of ancient and modern model villages is narrower than the others, mainly in the district of Qibin as the core gathering (Fig. 7(d)). The hot-spot analysis (Fig. 8(d)) reveals that the hot-spot areas are mainly distributed north of Yu, represented by ancient villages and modern model villages in the district of Qibin and its surrounding counties (districts). In order to analyze the factors influencing the spatial distribution of the rural tourism characteristic villages in the province of Henan in general and each type of characteristic village, we use the county scale as the research unit. The rural tourism characteristic villages in the province of Henan (Y1), the leisure tourism category (Y2), the agricultural industry category (Y3), the rural culture category (Y4), and the featured village and town category (Y5) are taken as the dependent variables. The formation and distribution of these rural tourism characteristic villages are dictated by a confluence of multiple factors. Thus, after analyzing the literature review, we select five aspects of the topographic features, economic development level, tourism market potential, transportation capacity, and relevant policies for analysis (see Table 3). The topographic features include elevation (X1) and slope (X2), and the economic development level includes the gross domestic product (GDP) per capita (X3), the urban residents’ per capita disposable income (X4), the value of primary industry (X5), and the value of tertiary industry (X6). The tourism market potential includes the urbanization rate (X7), the population density (X8), the number of star-rated hotels by county (X9), and the number of A-class scenic spots by county (X10). The transportation capacity also includes the road density (X11) and accessibility to county administrative centers (X12), and the related policies comprise the number of rural tourism policy documents (X13). The data on the independent variables are reclassified according to their optimal grading method using the parametric optimal geographic detector. The 10 km x 10 km grid points in the study area are generated using the fishing-net tool, and the grid point data are extracted using the sampling tool [56]. The geographical detector results in Table 4 demonstrate that A-grade scenic spots (X10) have the most significant influence on the spatial distribution of rural tourism characteristic villages in the province of Henan. These A-level scenic spots have relatively complete basic service facilities, stable tourist resources, and powerful brand effects. They exert a profound pulling effect on the development of rural tourism adjacent to A-level scenic spots, enhancing the development of rural tourism in adjacent villages, thus affecting the spatial distribution of rural tourism characteristic villages. It demonstrates that rural tourism characteristic villages rely on A-class scenic spots and fully use the driving effect of A-grade scenic spots to integrate resources and achieve complementary resources and group development. Secondly, elevation (X1) has a marked impact on the spatial distribution of these rural tourism characteristic villages. As depicted in Fig. 1, Henan Province is primarily composed of plains and mountains. The four major mountain ran- ges—Taihang Mountain, Funiu Mountain, Tongbai Mountain, and Dabie Mountain—constitute Henan Province. The terrain skeleton bestows Henan Province with abundant tourism resources and fundamentally affects the spatial pattern of rural tourism characteristic villages there. Meanwhile, it highlights that topographic factors greatly influence the location and layout of rural tourism charac- teristic villages, and high-quality rural tourism destinations should be developed according to naturally formed landforms. According to the government’s related policies for the rural tourism characteristic villages in the province of Henan, the promotion of such villages by relevant government departments must be strengthened.",
    "Fig. 8. The cold hot spots of various types of rural tourism characteristic villages in Henan Province: (a) Leisure tourism category; (b) Agricultural industry category; (c) Rural culture category; (d) Featured village and town category. 4.2.3.1. Leisure and tourism category. Fig. 9(a) presents a visualization of the geodetector results ranking in this category. The results reveal that the influencing factors of the spatial distribution of leisure and tourism characteristic villages largely mirror those of the overall rural tourism characteristic villages, and are obviously dominated by the A-level scenic spots in the region. The detection value associated with the number of A-level scenic spots (X10) across each county is 0.5784, indicating that the spatial distribution of leisure Fig. 9. The distribution of the factors impacting each type of characteristic village in the province of Henan: (a) Leisure tourism category; (b) Agricultural industry category; (c) Rural culture category; (d) Featured village and town category. and tourism characteristic villages is largely dependent on the regional A-level scenic spot resources. For one thing, leisure and tourism characteristic villages adjacent to A-level scenic spots can not only effectively utilize the resource endowment advantages and brand effects of A-level scenic spots, but also help alleviate the insufficient service supply issue in A-level scenic spots during peak periods. For another, the linkage effect with A-level scenic spots and the packaged promotion of leisure and tourism characteristic villages have expanded its customer source market. Furthermore, elevation (X1) and population density (X8) display a certain correlation with the spatial distribution of leisure and tourism characteristic villages. Natural factors, such as elevation, are closely related to the formation of natural landscapes. Good natural landscapes naturally pave the way for the distribution of leisure and tourism characteristic vil- lages. Leisure and tourism characteristic villages are an ideal place for leisure and sightseeing on weekends. The broad tourist source market in densely populated areas plays a positive role in promoting the development of leisure and tourism characteristic villages. For instance, there are 5A-level scenic spots such as Taihang Mountain Grand Canyon and Yuntai Mountain in northern Henan, allowing neighboring villages to leverage good natural landscapes to develop rural tourism. Concurrently, the population density in northern Henan is relatively high, which provides sufficient resources for rural tourism destinations. 4.2.3.2. Agro-industrial category. The visualization of the geodetector results is shown in Fig. 9(b). The data show that the detected q values for the number of star-rated hotels in each county (X9), urban disposables (X4), and primary industry value (X5) are 0.3539, 0.3135, and 0.2699 respectively. Their q values significantly surpass other influencing factors, emphasizing that the spatial distri- bution of rural tourism characteristic villages has a strong reliance on star-rated hotels, economic development level, and the agri- cultural sector. The customer source market of rural tourism characteristic villages in the agricultural industry is mostly residents from neighboring cities and towns. Through the development of agricultural picking and other projects, these residents are attracted to immerse themselves in the countryside and achieve multi-sensory enjoyment that integrates experience, sightseeing, and delicious food. First of all, star-rated hotels provide good accommodation conditions for tourists to experience the \"slow life\" in the countryside. It also suggests that the spatial distribution of agro-industrial rural tourism characteristic villages tends to be in the outskirts of cities, and urban residents are the major source of customers for agro-industrial rural tourism characteristic villages. Secondly, a surge in urban residents’ per capita disposable income invariably uplifts their consumption propensity, fostering a promising market demand for developing such rural tourism characteristic villages. Additionally, the primary industry’s value reflects the level and scale of agri- cultural development in the region to a degree, and is also an important index for measuring agricultural development capabilities. Agro-industrial characteristic villages integrate rural tourism with the primary industry to recreate the value of agriculture, rural areas, and farmers. For example, Cherry Gully Village in Houzhai Township, Erqi District, Zhengzhou City is located in the city’s outskirts, relying on nearly 10,000 acres of ecological cherry resources, attracting numerous urban residents. They come for cherry blossoms, fruit picking, and other leisure activities. This not only ignites the local countryside tourism boom, but also improves the value of the primary industry. 4.2.3.3. Rural culture category. Fig. 9(c) presents a visualization of the geodetector results ranking in this category. The core factors influencing the differences in the spatial distribution of the characteristic villages based on rural culture are, in order, the value of tertiary industry (X6), road network density (X11), and the number of A-class scenic spots in each county (X10). The tertiary industry, commonly recognized as the service industry, highlights the evolution of rural tourism beyond its agricultural roots. The tertiary industry, led by leisure tourism and cultural activities, is rising. To conclude, rural tourism and the tertiary industry are interde- pendent. Rural cultural characteristic villages boast rich rural folk culture, and can be integrated with the tertiary industry to process handicrafts, souvenirs, specialties, and other tourism-centric products, or use red tourism resources and ancient buildings as the main carriers to attract neighboring tourists. Expanding the tourism market of rural cultural tourism characteristic villages can not only increase the value of the tertiary industry, but also attract residents from neighboring cities from different folk cultures. Tourists’ travel decisions largely depend on the transportation accessibility between the origin and destination. Efficient transportation conditions not only save tourists’ travel time, but also enhance their willingness and sense of experience. Hence, the road network density among traffic factors has become a crucial factor affecting the spatial distribution and subsequent development of this type. Take Single Abutment Village in Shuangmiao Township, Qingfeng County as an example, it actively develops local folk characteristics of products to attract tourists from all over the world, and repairs rural roads to open up the rural tourism of the \"last kilometer\", to enhance the sense of experience of tourists. Moreover, relying on the Jiluyu Borderland Revolutionary Base Site, a 4A-rated scenic spot, it has improved the visibility of local rural tourism.",
    "A visualization of the geodetector results is shown in Fig. 9(d). The core factors affecting the differences in the spatial distribution of featured villages in the category of featured villages and towns are, in order, the number of A-class scenic spots (X10), the value of primary industry (X5), and GDP per capita (X3) in each county, indicating that such featured villages are influenced by the potential of the tourism market and the level of economic development. The villages in the category of featured villages and towns are primarily based on various ancient and modern villages that are better preserved. From the perspective of tourism market potential, the linkage effect between featured villages and A-class scenic spots drives the development of rural tourism in the category of featured villages and towns. In terms of economic development level factors, indicators like the primary industry value and per capita GDP reflect the economic development level of a country or region. Areas with relatively flourishing economic development levels can further offer sufficient financial support for developing rural tourism characteristic villages and improving supporting facilities. For example, Liangshuiquan Village of Lingshan Subdistrict Office in Qixian County, which is situated in a high-density area, is a locally renowned \"stone\" ancient village. It carries a certain amount of culture and memory and processes natural advantages in developing rural tourism. Also, it is adjacent to Gulingshan, a 4A-level tourist attraction, which provides the village with a steady influx of tourists and popularity, facilitating local economic development. In terms of spatial distribution characteristics, the characteristic rural tourism villages in the province of Henan show a multicore aggregation development pattern, mainly concentrated in the northern and central areas of the province. In contrast, the eastern province of Henan lacks core driving cities, resulting in the relatively slow development of rural tourism characteristic villages, which is consistent with the conclusions of Wu’s research [57]. Considering the factors impacting the spatial distribution of the villages, the distribution of rural tourism characteristic villages is highly coupled with A-level scenic spots in the province of Henan, indicating that rural tourism and A-level scenic spots “group” development should pay attention to constructing and using A-level scenic spots. The stable source market and perfect service facilities drive the development of rural tourism characteristic villages around scenic spots, rely on A-level scenic spots to set up boutique tourism routes, realize the mutual integration and joint development of “scenic villages”, and enhance the influence and popularity of rural tourism characteristic villages in the province of Henan. This conclusion is consistent with the analysis results of Jiao [58]. Some studies suggest that policy factors have a greater impact on the sustainable development of rural tourism and occupy a dominant position [45,59]. However, this study found that the influence of relevant policy factors was not significant. Therefore, to address the issue of uneven spatial distribution of rural tourism characteristic villages in Henan Province, the government needs to propose corresponding measures to alleviate this phenomenon. This paper analyses the spatial pattern and influencing factors of rural tourism characteristic villages in Henan Province, with the aim of contributing to the sustainable development of rural tourism in the region. However, it is important to address the limitations of the current study in future research. Specifically, this paper only examines the spatial patterns of rural tourism in characteristic villages from a spatial perspective, and does not consider the temporal perspective. In the future, time series data can be used to supplement the analysis of the spatial and temporal evolution characteristics of rural tourism villages. The selection of influencing factors mainly focuses on macro perspectives, such as nature, society, and transport. Further research is needed to investigate micro factors, such as willingness to travel and economic development of villages. To improve the provision of scientific advice for the sustainable devel- opment and spatial optimisation of rural tourism. This paper employed the nearest neighbor index, kernel density analysis, spatial autocorrelation, and other spatial analysis methods to analyze the spatial distribution of the rural tourism characteristic villages in the province of Henan. It also explored the overall and various types of rural tourism characteristic villages in this province utilizing optimal parameters-based geographical This research was funded by the Ministry of Education Humanities and Social Sciences Youth Fund Project grant number [17YJCZH041]; Henan Province Soft Science Research grant number [222400410098]; and the Henan Polytechnic University Hu- manities and Social Sciences Research Fund Project grant number [SKND2023-02, GSKY2024-09].",
    "Jiusheng Du: Writing - review & editing, Writing — original draft, Methodology, Funding acquisition, Formal analysis, Data curation, Conceptualization. Beibei Zhao: Writing - review & editing, Writing — original draft, Software, Formal analysis, Data curation, Conceptualization. Yunchao Feng: Writing — review & editing. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."
]