[
    "The carbon storage service of terrestrial ecosystems has an veritable impact on the global carbon cycle and, in turn, on global climate change. Hence, both assessing and predicting the impact of land use changes on carbon storage are necessary to reduce carbon emissions and mitigate climate change. Therefore, using integrated valuation of ecosystem services and tradeoffs (InVEST) model with remote sensing data, this study systematically analyzes the land use/cover change (LUCC) and the carbon storage response characteristics of land types in Henan Province, China in the 1990–2020 period. The study also uses patch-generating land use simulation (PLUS) model to predict the LUCC and carbon storage in Henan Province from 2023 to 2050 under different scenarios, including Business as Usual (BAU), Ecological Conservation (EC), and Urban Development (UD) scenarios. The following results are noted: (1) The LUCC mainly comprises the conversion of farmland to con- struction land. Presently, Henan Province’s carbon storage is found to have decreased by 339.72 Tg due to LUCC, which is characterized as “high in the west and low in the east.” (2) Regarding the three aforementioned sce- narios, the province’s construction land is predicted to increase to its greatest extent under the UD scenario. Under the EC scenario, its woodland and farmland areas will be effectively protected. Therefore, the highest level of carbon reserves will likely be found in the EC scenario, followed by that in the BAU scenario, while the lowest level of carbon reserves should be seen in the UD scenario. The carbon reserves of Henan Province in 2050 will be 312.07 Tg, 233.43 Tg, and 394.49 Tg lower than that in 2020 under the BAU, EC, and UD scenarios, respectively. In sum, this study provides the scientific basis of the decisions aimed at the facilitation of low-carbon devel- opment, the optimal utilization of land spaces, and the development of an ecological civilization in Henan Province. The global climate change aggravated by greenhouse gas emissions directly threatens the sustainability of human civilization and ecosystem services throughout the world (Cetin, 2020; Costanza et al., 2014), hindering the improvement of collective human well-being. In this re- gard, the ecosystem carbon sequestration service is a crucial ecosystem service significantly impacting the global carbon cycle and the global carbon balance (Wang et al., 2022b; Yue et al., 2020). Additionally, as role in the global climate system (P¨ortner et al., 2022). In particular, land use/cover change (LUCC) is a major factor that affects carbon storage within terrestrial ecosystems (Chang et al., 2022). LUCC not only affects the carbon storage of a region’s vegetation but also changes its soil carbon storage by changing the soil environment and returning plant residues to the soil, ultimately changing the structure and function of the region’s ecosystem and impacting its carbon cycle process (Bau- mann et al., 2017; Li et al., 2021).With the continuous growth of the global population and economy, the development and utilization of land * Corresponding author at: College of Resources and Environmental Sciences, Henan Agricultural University, Zhengzhou 450002, China. E-mail addresses: liyao@stu.henau.edu.cn (L. Fan), caitianyi19901026@163.com (T. Cai), q.wen@henau.edu.cn (Q. Wen), hj1702116031@163.com (J. Han), 1470-160X/© 2023 The Authors. Published by Elsevier Ltd. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by- ne-nd/4.0/). amount of carbon flowing from terrestrial ecosystems to atmospheric ecosystems (Gao and Wang, 2019). To mitigate this problem, carbon storage and carbon sequestration capacity of terrestrial ecosystems with regard to LUCC has received considerable attention in the field of global change research (Aitali et al., 2022; Fernandes et al., 2020; Gomes et al., This paper addresses the terrestrial carbon storage and sequestration issues in China, the largest developing country in the world, which has experienced an unprecedented rise in urbanization in the past few decades—from 18.9% in 1990 to 64.7% in 2021 (Teets, 2012). Although such a rapid urbanization process has significantly improved China’s economic development and the living standards of its citizens, it has also effected dramatic changes in the country’s land use (Li et al., 2018). Indeed, large areas of high-quality farmland and natural ecological land in China have been removed due to the development of urban spaces in the abovementioned period, generating significantly negative impacts on overall carbon storage of China’s terrestrial ecosystem (Gao et al., 2022; Ning et al., 2018). Moreover, China is presently the topmost carbon-emitting country in the world, accounting for 30.7% of the global CO2 emissions as of 2020 (Zhao et al., 2023). Fortunately, as the administrative apparatus of a major country in the global arena, the Chinese government has actively assumed its role in the reduction of global carbon emissions, asserting in its national action document its intention to address climate change: “China will strive to reduce anthropogenic carbon emissions and increase the carbon storage of the ecosystem, and achieve the carbon peak goal in 2030, and achieve the carbon neutral goal in 2060” (Wang et al., 2022a). In this context, exploring the impacts of China’s past and future LUCC on its terrestrial ecosystem carbon storage is of great practical significance.",
    "In the recent decades, scholars have conducted extensive research on the changes in carbon storage with regard to LUCC in various terrestrial ecosystems around the world. For instance, Mendoza-Ponce et al. (2018) have claimed that by the end of the 21st century, Mexico could restore the total carbon stock it used to possess in the year 1985 by reducing its rate of deforestation and by increasing its natural vegetation coverage. Tang et al. (2018), based on systematic research, have stated that China’s terrestrial ecosystem has been consistently playing an important role in maintaining the global carbon sink over the past decades. Further, Vasenev et al. (2018) and Li et al. (2020) have respectively taken Moscow and Wuhan as examples to discuss the larger impact of urban expansion on global carbon storage changes. Presently, the methods of estimating the carbon storage of terrestrial ecosystems mainly include the sample land inventory method (Zhu et al., 2021), the IPCC inventory method (Sun and Shi, 2020), and the model simulation method (Huang et al., 2022). However, with the development of 3S (RS, GIS, and GPS) technology, the combinations of remote sensing monitoring and various relevant models has been gain- ing salience with regard to the process of carbon storage estimation (Chang et al., 2010). Among these models, the Integrated Valuation of Ecosystem Services and Tradeoffs (InVEST) model offers the advantages of simple operation, flexible parameters, and high accuracy, in addition to its ability to facilitate the visualization of carbon storage space–time series distribution (Lahiji et al., 2020; Shao et al., 2018). In fact, many scholars have studied the carbon storage levels of different regions from different perspectives (Zhu et al., 2022) and scales (Islam et al., 2022) using the InVEST model. Thus, InVEST remains widely used in the recent studies on carbon storage estimation. In addition to providing current and future land use data, InVEST can also calculate the current and Scholars have generally combined the InVEST model with CA- Markov, CLUE-S, GeoSOS-FLUS, and other land use simulation models (Babbar et al., 2021; Feng et al., 2020; Li et al., 2022) to evaluate the carbon storage of various ecosystems under different change scenarios. For example, Xiang et al. (2022) combined Markov-FLUS and InVEST to analyze the possible changes in carbon storage under natural, farmland Further, Hoque et al. (2021) have combined CA-Markov and InVEST to assess and predict the development of coastal plantations and the changes in the carbon stocks of ecosystems within Bangladesh for a The patch-generating land use simulation (PLUS) model includes a rule-mining framework based on a land expansion analysis strategy (LEAS) and a cellular automata (CA) module based on multi-type random patch seeds (CARS) as it aims to fully explore the various fac- tors that effect changes in land use. The cellular automata (CA) model is known, in terms of simulating land use changes, to be able to robustly simulate spatial shifts in complex systems. The PLUS model can not only simulate patch-level changes in various types of land use but also effectively solve the problem of accuracy regarding large-scale land use data simulation by virtue of having a high simulation accuracy and a wide range of applications (Li et al., 2022a, Li et al., 2022c; Liang et al., 2021). Still, most of the existing land use change prediction models find it difficult to outline the changes in patch-level land use (Degerli and Çetin, 2022; Liang et al., 2021); they establish only a single setting of future development scenarios, failing to fully consider the changes to regional carbon reserves under various future development scenarios (Zhu et al., 2021). Hence, a more refined spatial scale must be used to quantify the levels and the responses of carbon reserves under different scenarios and land types. China has a vast territory comprising diverse land types (Ning et al., 2018; Liu et al., 2014), wherein Henan Province is a populous, eco- nomic, and carbon-emitting province of China (Cai et al., 2019; Wei et al., 2023). Human activities in this province significantly impact its carbon emissions as well as the broader changes in the carbon stocks of China’s terrestrial ecosystems. Simultaneously, Henan Province is an important part of China’s national strategy aimed at ecological protec- tion and high-quality development in the Yellow River Basin; it plays vital roles in the reduction of regional carbon emissions and in the facilitation of low-carbon land development/utilization. While Li et al. (2022b) have commented on the carbon balance of Henan Province from 1995 to 2015 from a “supply and demand” perspective, Xiao et al. (2021) assert that the carbon emissions in Henan Province have continued to increase from 1990 to 2018in the recent times. Still, most studies calculating the carbon stocks in Henan Province mainly focus on typical ecosystems such as forests (Liu et al., 2022) and soil organic carbon (Yu et al., 2008) using a single perspective, thus remaining un- able to comprehensively analyze the changes in carbon stocks throughout the region or the larger nation. Moreover, there exists a lack of simulation research on carbon storage considering the future sce- narios of Henan Province, which makes it difficult to facilitate a scien- In light of these aspects, this paper considers Henan Province as its research area. By combining the InVEST and PLUS models, it sets up different development scenarios in order to systematically simulate and analyze the province’s land use change and carbon stock response in a period starting from 1990 and ending in 2050. By revealing the spatiotemporal evolution characteristics and the future development trends of carbon storage in Henan Province, it strives to provide a sci- entific reference for Henan Province aimed at improving the carbon storage of its regional ecosystems and promoting the development and utilization of low-carbon land space here. The main objectives of this paper include the following: (1) revealing the space–time characteristics of land use change in Henan Province between 1990 and 2020; (2) analyzing the impact of land use change on carbon storage in Henan Province between 1990 and 2020; and (3) simulating and evaluating the carbon storage levels of Henan Province between 2030 and 2050 by considering different development scenarios.",
    "Henan Province, located in Central China, occupies a total land area of 167000 km2 and is spread over the following coordinates: 31 ◦ 23′–36 ◦ 22′ N and 110 ◦ 21′–116 ◦ 39′ E. The terrain of this province is high in its western regions and low in its eastern regions. The Taihang Mountains, the Funiu Mountains, and the Tongbai Dabie Mountains are distributed in a semi-circular pattern over the northern, western, and southern parts of the province’s boundary, respectively (Fig. 1). Overall, Henan Province experiences a continental monsoon climate, with an annual average temperature of 10.5 ~ 16.7℃ and an annual precipi- tation of 407.7 ~ 1295.8 mm. In the periods where it receives rain and heat, the climate, water, and soil conditions of the province are suitable for crop growth. The land use type of Henan Province is mainly farm- land, which accounts for 6% of the total farmland area and 10% of total grain output of China. As of the end of 2021, the total population of Henan Province was calculated at 98.83 million (it is deemed the third- most populous province of China), its GDP at 5888.741 billion Yuan (ranked as the fifth-largest GDP in the country), and its population ur- banization rate at 56.45% (ranked 26th in the country). Additionally, Henan Province is a crucial component of China’s national strategy aimed at the ecological protection and high-quality development of the country’s Yellow River Basin; it also plays an important role regarding China’s ecological environmental protection and high-quality economic development. Therefore, it is sensible to take Henan Province as a research area wherein one can simulate land use change scenarios and investigate the region’s carbon storage responses. The InVEST model provides a comprehensive evaluation of ecosystem service functions and trade-off transactions. Specifically, the “Carbon Storage and Sequencing” module used in this study is frequently used to calculate the spatiotemporal changes in carbon storage (Al et al., 2023; Zhu et al., 2022). The carbon density data of each of its land use types include aboveground carbon density, under- ground carbon density, soil carbon density, and dead organic carbon density (Adelisardou et al., 2022). Combined with such land use data, the carbon storage of Henan Province’s ecosystem is calculated as In the above formulae, C; is the carbon density of the i“ land use type (Mg-hm~?); i represents the land use type; Cj above is the aboveground carbon density of the i land use type; Cj below is the underground carbon density of the i and use type; Ci soil is the soil carbon density of the it land use type; Cj deaa is the dead carbon density of the i Jand use type; Ctotal is total carbon storage; S; is the area of the i Jand use type; and nis the number of land use types (in this paper, n has a value of 6). Importantly, the carbon density data considered in this paper refer to the findings of previous studies (e.g., Li et al., 2003; Xie et al., 2004). For instance, according to Delaney et al. (1998), the carbon pool created by the dead organic matter of vegetation in an area amounts to 1/10th of the area’s aboveground carbon pool in terms of size. Moreover, tem- perature and precipitation have profound impacts on the local carbon density levels of an area (Raich and Nadelhoffer, 1989). These assertions are used to revise the carbon density data of Henan Province using the following formula (Alam et al., 2013; Chen et al., 2007; Giardina and Ryan, 2000): module based on multi-type random patch seeds (CARS). In this paper, the LEAS module is used to extract the data on land expansion in Henan Province from 2010 to 2020, while the random forest algorithm is uti- lized to obtain the development probabilities of various types of land (Fig. 2) as well as the contributions of the driving factors to various types of land expansion in Henan Province. In turn, 15 spatial driving fac- tors—digital elevation model (DEM) data, temperature, soil type, slope, precipitation, population density, gross domestic product (GDP), prox- imity to water, proximity to railway, proximity to railway station, proximity to governments, proximity to primary road, proximity to secondary road, proximity to tertiary road, and proximity to trunk—are used to calculate the occurrence probabilities of six land use types (Fig. 3). With respect to these calculations, the CARS model—based on the traditional CA model—considers a water area as a limiting factor and combines the random seed generation and the threshold decline mech- anisms to simulate the land use pattern in Henan Province in 2020. Assuming that the accuracy of the CARS model is robust enough for this research, different development scenarios concerning the future devel- opment direction of Henan Province are set, and the land use pattern in Henan Province is predicted under different scenarios with regard to the years 2030 and 2050, with 2020 being considered as the initial time point.",
    "In the above formulae, MAP is the annual precipitation (mm); MAT is the annual temperature (°C); CSP is the soil carbon density (Mg-hm~?) obtained from MAP; and CBP, and CBT are the biomass carbon den- sities (Mg-hm~2) obtained from MAP and MAT, respectively. The annual average temperatures and the annual precipitation levels of both China and Henan Province (9℃/717 mm and 15℃/848 mm, respectively) are considered in the above formulae; their ratio is considered the carbon density correction coefficient of Henan Province. The data regarding China’s national average annual precipitation and temperature are obtained from the ArcGIS 10.8 band set. The corrected According to the land use changes in the study area, the following three scenarios are set to simulate the land use situations in 2030 and In the above formulae, KBP is the precipitation factor correction co- efficient of biomass carbon density; KBT is the temperature factor correction coefficient of biomass carbon density; KB、is the biomass carbon density correction coefficient; KS is the soil carbon density correction coefficient; and C′、and C{\\Prime} refer to the carbon density that the Kappa statistical results can indicate the excellent performance level of the classifier and the reliability level of the classification results: an accuracy level exceeding 80% indicates that the simulation consis- tency is robust. Moreover, FoM quantitatively tests a simulation’s ac- curacy along the cell scale: the larger the value, the higher the accuracy (Pontius et al., 2008). Based on Henan Province’s land use data in 2000 and 2010, the spatial distribution of its land use in 2020 is simulated, and the accuracy of the simulation results is verified with regard to the actual situation concerning land use in the province in 2020. Notably, large Kappa coefficient and FoM values indicate that the simulation accuracy of the given model is high; thus, the model can be used to predict land use changes in different scenarios. same row and column numbers. The rest of the relevant socio-economic data are gathered from the Statistical Yearbook of Henan Province for the 1991–2021 period. Both Table 3 and Fig. 4 report the changes of the land use type areas and their spatial distributions in Henan Province in the 1990–2020 The sources of all the data utilized in this paper are provided in Table 2. The factors driving land use change simulations are shown in Fig. 3 (regarding the years 1990, 2000, 2010, and 2020, four sets of land use data are gathered from the annual China Land Cover Dataset [CLCD], provided by Wuhan University) (Yang and Huang, 2021). The relevant data are produced using the Landsat remote sensing images of each period as the main data source, the spatial resolution is considered to be 30 m, including six types of land use cover in Henan Province: farmland, forest, grassland, water, construction land, and unused land. Moreover, DEM data are obtained from the ASTER GDEM 30 m dataset of the Geospatial Data Cloud, while the slope data are obtained by processing DEM data with the ArcGIS 10.8 software. Additionally, the data regarding mean temperature, mean precipitation, soil type, popu- lation density, and GDP are obtained from the Resource and Environ- mental Sciences and Data Center, Chinese Academy of Sciences. Further, the government location and road vector data are sourced from Open- StreetMap. All the above data are processed for projection trans- formation, resampling, Euclidean distance, etc. by the ArcGIS 10.8 software, in order to obtain data from a grid with a 30 m spatial reso- The main land type with regard to use in Henan Province in 2020 is found to be farmland, accounting for 65.60% of the province’s total land space (widespread over the Huang-Huai-Hai Plain), followed by wood- land, which accounts for 17.87% of the province’s total land area, mainly distributed over the Funiu Mountains in its western part, over the Taihang Mountains in its northern part, and over the Tongbai Dabie Mountains in its southern part. Finally, the third most prominent land type is construction land, which accounts for 14.17% of the province’s total land area, inlaid and distributed over the farmland matrix in patches. Moreover, grassland, water area, and unused land in the province account for a relatively small proportion of its total From 1990 to 2020, the areas involving various types of land use in Henan Province reportedly change in varying degrees. These changes (2779.84 km2) can be witnessed in the 1990–2000 period. The decreases in farmland before 2010 are mainly concentrated in the less-hilly areas of Henan Province, the northern and central parts of the Yellow River plain, which are mostly occupied by wood- land and construction land. After 2010, the expansion of con- struction land throughout the whole province has led to reached its greatest extent (4024.91 km2), followed by that in the 2010–2020 period (3999.92 km2); in the 2000–2010 period, the least amount of such increase can be witnessed (3147.05 km2). Notably, the construction land was concentrated in the province’s flat terrain, in the relatively more developed economy of the Zhengzhou metropolitan area, making the provincial capital Chinese terrain) and the terrain where the Funiu Mountain, the Tongbai Mountain, and the Dabie Mountain connect. After 2000, owing to the implementation of the Grain for Green Project, its woodland area has increased by 2340.95 km2; the increase in the woodland area is distributed across the northern Taihang Mountains, the western Funiu Mountains, and the southern Tongbai and Dabie Mountains. Additionally, the province’s grassland area has decreased by 1590.11 km2, mainly in the Taihang Mountain and the southern Funiu Mountain areas (that have been reclaimed as farmland) but also in the northern Funiu Mountain area that has been reclaimed as woodland.",
    "Based on the land use transfer matrix, the land use transfer in Henan Province between 1990 and 2020 is calculated (Table 4). In this period, the expansion of construction land is found to be the main marker of land use change in the province, whereas a total of 11415.53 km2 of other land use types are reportedly converted to construction land, of which 11049.28 km2 came from farmland. The area transferred from woodland comes second, mainly from farmland and grassland, with an area of 2718.71 km2and 1129.51 km2 respectively. Once again, it is farmland, mainly from woodland and grassland, with an area of 2069.78 km2 and 978.09 km2 respectively. Meanwhile, the transferred areas of grassland and unused land are found to be considerably less in proportions. From the perspective of “turning out,” the area of farmland turned out is found to be the largest (14924.1 km2), mainly being con- verted into construction land and woodland (with the converted areas having proportions of 11049.28 km2 and 2718.71 km2, respectively). The area converted from woodland to farmland is also considered as large in proportion, with the respective value of 2069.78 km2; this is followed by grassland, whose area is reportedly converted into wood- land and farmland areas (having the respective proportions of 1129.51 km2 and 978.09 km2). Other land use types are converted over small areas.Table 5.. reserves and the carbon density show continuous declines. Overall, the carbon storage in Henan Province has reportedly decreased decreases by 5.57% in over the past 30 years. From the perspective of spatial distri- bution, the carbon storage is characterized as “high in the west and low in the east” regions; the regions with high carbon reserves appear to be in the northwestern, western, and southern mountainous regions of Henan Province, while the regions with low carbon reserves are scat- tered throughout its central part, with a relatively obvious expansion trend, mainly concentrated in Zhengzhou, Luoyang, and Nanyang. As per Fig. 6, the carbon storage data of the two given periods are subtracted to obtain the spatial distribution of the concomitant carbon storage changes. Overall, the carbon sink is distributed over the western part of the study area, which is surrounded by a high-value area of carbon storage, while the areas showing decreases in carbon reserves is distributed over the middle part of the study area, which is surrounded by a low-value area of carbon storage. Specifically, the areas showing decreases in carbon reserves in the 1990–2000 period are mainly distributed in Zhengzhou, Xuchang, Pingdingshan, Luoyang, and other locations situated in the middle part of the study area. However, from 2000 to 2010, the concentration of the areas showing decreases in car- bon reserves weakens (compared with that of the previous time period) while the proportion of carbon sink areas increases, the latter especially being concentrated in Pingdingshan, Nanyang, Xinyang, Sanmenxia, and their surrounding locations. Further, compared with those of the previous time period, the areas showing decreases in carbon reserves in Zhengzhou, Jiaozuo, Jiyuan, Nanyang, and their surrounding places increase significantly from 2010 to 2020. In this paper, according to the land use transfer matrix and the dif- ferences in carbon densities between the different land types observed, the responses of carbon storage to land use change in Henan Province are studied (Table 6). The results find that from 1990 to 2020, land use change has resulted in a 339.72 Tg net reduction of carbon storage in the province. The carbon loss incurred by the conversion of farmland to construction land accounts for 94.63% of the carbon storage loss of farmland; the carbon storage of woodland decreases by 76.80 Tg, with the carbon loss engendered by the conversion of woodland to arable land accounting for 89.02% of the decrease in woodland carbon storage. Both the carbon storage and the carbon stock change of each grid unit in Henan Province are calculated using the carbon density data of the four major carbon pools belonging to the land use types considered in the InVEST model’s carbon storage module (Fig. 5). The total carbon reserves of Henan Province in 1990, 2000, 2010, and 2020, are found to be 6093.77 Tg, 5941.60 Tg, 5862.07 Tg, and 5754.05 Tg, respectively. Moreover, the carbon reserves per unit of land area in the above- mentioned years are found to be 3.675 Tg/hm2, 3.58 Tg/hm2, 3.5356 Tg/hm2, and 3.470 Tg/hm2, respectively. Indeed, both the total carbon With regard to Fig. 7, which compares Henan Province’s simulation map of land use in 2020 (a) with its current map of land use in 2020 (b), the results show that the associated Kappa coefficient is 0.829, the overall simulation accuracy is 91.07%, and the FoM index is 0.35. Evidently, the simulation accuracy is found to be high. In turn, the simulation of the future land use change in Henan Province is also Moreover, the PLUS model is used to obtain the spatial distribution of land use in Henan Province in 2030 and 2050 under three scenarios: the BAU scenario, the EC scenario, and the UD scenario (Fig. 8). The statistical data concerning the various land use types are provided in Table 7. Compared to 2020, the land use structure of Henan Province shows varying degrees of change under all the three scenarios in 2030 As per the abovementioned data, this study predicts that under the BAU scenario, in 2030, the farmland, grassland, water areas, and unused land areas in Henan Province will decrease, whereas its construction land and woodland areas will increase. From 2020 to 2030, the prov- ince’s farmland area will decrease by 3.67%; the maximum reduction in grassland will be 22.16%, with a small decrease of 55.07 km2 and 0.29 km2 in its water areas and unused land areas, respectively, and an in- crease of 16.53% in its construction land area; its forest area will in- crease by 1.99%. Under the EC scenario, the reductions in farmland, grassland, and water areas will be weaker than those in the BAU sce- nario, with a decrease of 2.97% in farmland area and a slow decrease of 394.37 km2 in grassland area, (a decrease of 20.84%); its construction land area will increase by 13.07%, and its woodland (with a 609.75 km2 area) will remain fully protected. The development trends of water and wasteland will be similar to those under the natural development sce- narios. Also, compared with other scenarios, under the UD scenario, the trends of increases in construction land and decreases in farmland area in the province will be more significant, with a 19.47% increase in construction land area and a 4.38% (4761.04 km2) decrease in farmland grassland, and water areas in Henan Province will be 10.91%, 36.45%, and 13.65%, respectively. Moreover, the increase in construction land and woodland area will be 46.53% and 5.59%, respectively. Under the EC scenario, the decrease in the province’s farmland area will be 8.97%; its grassland area will slowly decrease by 33.74%; the increase rate of the province’s construction land area will slow down from an increase of 13.07% every decade to a decrease of 12.29%, whereas its woodland area will increase by 1756.79 km2. In contrast with other scenarios, under the UD scenario, the expansion of construction land in the prov- ince will be the fastest in terms of rate, with an increase of 56.62% in 2050 as compared with that of 2020. Further, the decreasing trend regarding its farmland area will become more significant, with a decrease of 13960.94 km2 (12.84%). In other words, under the UD scenario, Henan Province’s grassland will not be effectively protected Based on the simulation results, the future spatial distribution pat- terns of carbon reserves in Henan Province will be consistent with those of the current reserves (Fig. 9); the high-value areas will be mainly distributed across its mountainous regions with high altitudes, while the low-value areas will be mainly distributed over the towns and the water As per Tables 9 and 10, under the BAU scenario, the predicted carbon storage value of Henan Province in 2030 will be 5643.05 Tg, 110.99 Tg less than that found in 2020 (135.07 Tg less for farmland, 17.90 Tg less for grassland, and 39.29 Tg more for woodland areas). In 2050, the province’s carbon storage value will likely be 5441.98 Tg, 312.07 Tg less than the value in 2020 (400.97 Tg less for farmland, 14.09 Tg less for grassland, and 110.69 Tg more for woodland areas).",
    "Under the EC scenario, the carbon storage value in the entire Henan Province will likely reach up to 5670.89 Tg in 2030, 83.16 Tg less than the value in 2020 (109.18 Tg less for farmland, 16.83 Tg less for grassland, and 40.75 Tg more for woodland areas). In 2050, the prov- ince’s carbon storage value will likely be 5520.61 Tg, i.e., 233.43 Tg less than the value in 2020 (329.65 Tg less for farmland, 27.24 Tg less for Under the UD scenario, the carbon storage value of Henan Province in 2030 will likely be 5620.24 Tg, 133.81 Tg less than the value in 2020 (160.89 Tg less for farmland, 14.09 Tg less for grassland, and 38.01 Tg will likely be 5359.55 Tg, 394.49 Tg less than the value in 2020 (471.79 Tg less for farmland, 36.50 Tg less for grassland, and 104.51 Tg more for As compared with the BAU scenario, under the EC scenario, both the expansion trend of woodland area (having higher carbon density) and the decreasing trend of grassland will weaken in in Henan Province, as will the expansion trend of construction land with lower carbon density. In the UD scenario, the transformation of its grassland and farmland areas (with high carbon densities) to construction land with low carbon density will be more obviously noticeable. Although the carbon storage value under the EC scenario will decrease, compare to the UD scenario in 2030, the carbon storage values of farmland and woodland areas in the province will increase by 51.71 Tg and 2.74 Tg, respectively. Mean- while, in 2050, the carbon storage values of the province’s farmland and woodland areas will increase by 142.15 Tg and 12.89 Tg, respectively. Overall, in the future, Henan Province will witness a trend of reduction in carbon reserves under the three abovementioned development sce- narios. However, the declines in its carbon reserves under the UD and Further, the spatial changes of carbon stocks in the province will be significantly different under the three studied scenarios (Fig. 10). Under occupy a total area of 45112.76 km2, accounting for 27.21% of the total area of Henan Province (mainly distributed in the areas outside its western part). The areas marked by carbon storage reduction will be especially concentrated in Zhengzhou. On the other hand, the areas 43835.12 km2, accounting for 26.44% of the total area of the province (distributed over the junction of Sanmenxia, Luoyang, and Nanyang in its western part). Under the EC scenario, the areas marked by reductions in carbon reserves will occupy a total area of 43016.09 km2, accounting for 25.94% of the total area of Henan Province. In fact, the areas showing reductions in carbon reserves will be similar to those found under the BAU scenario, but the degrees of reduction of carbon reserves in each city will be significantly reduced under the EC scenario. Meanwhile, the areas marked by increases in carbon reserves will occupy a total area of 41573.94 km2, accounting for 25.07% of the total area of the province, and their spatial distribution will be similar to that under the natural development scenario. Further, under the UD scenario, the areas marked by reductions in carbon reserves will occupy a total area of 47215.08 km2, accounting for 28.48% of the province’s total area, while the areas marked by increases in carbon reserves will occupy a total area of 46187.15 km2, accounting for 27.86% of the province’s total area. In terms of spatial distribution, the reduction range of carbon reserves in Henan Province will be similar to that in the BAU scenario, but the changes in carbon reserves within Henan Province in the 1990–2020 period shows that the province’s overall carbon reserves have decreased by 339.72 Tg over the past 30 years, revealing substantial spatial dif- ferences in this regard. To elaborate, in the past 30 years, Henan Prov- ince has witnessed rapid economic development, frequent conversion of land use types, and rapid urbanization and industrialization, all of which have accelerated the transformation of its farmland areas to construction land areas. Compared with its farmland areas, the carbon fixation ca- pacity of its construction land areas is found to be weaker; the latter land type reduces the province’s regional carbon storage capacity. This finding is similar to the relevant conclusions of other scholars (Liu et al., 2019; Zhu et al., 2021). The areas witnessing obvious loss of carbon reserves in the province are concentrated around its urban centers, which have high population densities and are marked by frequent human activities. The areas in its northern part that exhibit losses in carbon reserves are found to be larger in proportions than those in its southern part. Moreover, the areas showing serious losses in carbon reserves are those undergoing rapid economic development and ur- banization processes, i.e., the areas around the main urban centers of Zhengzhou, Luoyang, and Xuchang.",
    "In the 1990–2020 period, the overall carbon storage in Henan Province is marked by the following trend: “high in the west and low in the east.” Evidently, the land use pattern greatly affects the spatial dis- tribution of carbon storage in the province (Xie et al., 2022). Its wood- land area, having a strong carbon storage capacity, is mainly distributed over the northwestern, southern, and western mountainous regions of the province, while the rest of the province is composed of mainly farmland; its construction land, with a weak carbon storage capacity, is mainly distributed throughout the province’s densely populated urban areas and towns. Moreover, the analysis of the temporal and spatial In this regard, some scholars (Chang et al., 2022) claim that the conversion of China’s farmlands to forests has increased the nation’s overall carbon storage capacity. This research corroborates this asser- tion by showing that the increases in Henan Province’s carbon storage reserves are mainly generated by the conversion of its farmlands to forest areas (with a net increase of 117.09 Tg). In the future, the prov- ince’s forest cover area can be advantageously developed into a carbon storage and resource enrichment area. This study also reveals that the new woodlands and construction lands in Henan Province significantly impact its carbon storage capacity. Hence, the LEAS module of the PLUS model is used to gauge the expansion of different land types in the two abovementioned time pe- riods under study, and then the samples are extracted from the types showing increased area. Based on this strategy, the random forest al- gorithm is used to match each type of land use expansion with the associated driving factors, in order to evaluate the contribution of the The contribution of each driving factor to the expansions of wood- lands and construction lands is shown in Fig. 11. Accordingly, the newly increased woodland area is considered as being mainly affected by the surrounding population, the proximity to water, and the slope. Hence, the increase in woodland area is found to be in a significant relationship with the abovementioned factors. In areas with low population density, the intensity of human activities is relatively weak, and thus the increase of woodland areas in these areas is more likely. The closer a woodland area is to a water area, the more suitable its habitat/environment is for increasing carbon storage. Plus, the slope mainly affects the decision to restore a farmland area into a forest area (with regard to the suitability of agricultural farming over the area). Under the EC scenario, the trend of carbon storage reduction in Henan Province will be weakened to the greatest extent; by 2030 and 2050, the province’s carbon reserves will decrease by 109.18 Tg and 329.65 Tg, respectively, showing significantly lower carbon reserve losses than that under the BAU scenario (to some extent, the EC scenario will alleviate the carbon reserve loss in Henan Province). To elaborate, the EC scenario will not only limit the transformation of farmland to construction land areas but also increase the conversion probability of other land types to woodland and grassland areas, ultimately increasing the proportion of ecological land area in the province. This is consistent with other scholars’ conclusions that carbon storage increases under the Additionally, the main driving factors of the increases in construc- tion land are the following: proximity to second road, GDP, and slope. A new construction land has a significant relationship with its surrounding road network system, which is the main driving factor of urban expan- sion; this is similar to the findings regarding the primary driving factors of urban construction and land expansion in Jakarta Metropolitan Area (Pratama et al., 2022) and Wuhan (Wang et al., 2022b). The level of GDP of a region also has a profound impact on the expansion of construction areas there: the higher the level of GDP, the stronger the scale and the desire for the expansion of urban construction areas. The above argu- ment, therefore, clarifies that human activities necessitate the expansion of construction land areas to a large extent. Indeed, most of the con- struction territories in Henan Province are located in the Huang-Huai- Hai Plain; its vast cities and towns are inlaid in the farmland matrix in a “patch” shape. Notably, in the process of urbanization, farmland ter- ritories are inevitably sacrificed to meet the needs of urban expansion. Unfortunately, urban expansion at the cost of farmland areas in Henan Province is the main factor that drives the reduction in its regional carbon storage capacity. Although urban expansion seems to be imme- diately profitable, in the long run it is likely to significantly reduce the carbon storage capacity of the province’s regional ecosystem (Tian et al., 2022). It is also considered as the main reason behind the increase in the Under the BAU scenario, Henan Province will continue exhibiting its previous trend of land use transfer, and its carbon reserves will decrease by 135.07 Tg by 2030 and by 400.97 Tg by 2050. Owing to the future urbanization in Henan Province, its urban spaces will continue to encroach on its farmland resources (that surround its construction lands and show a relatively high carbon density), resulting in the loss of the province’s total carbon reserves. This argument is consistent with the conclusions of other scholars who assert that the transformation of farmland to construction land areas will incur carbon storage losses under a natural development situation (Li et al., 2022c).",
    "Finally, in the UD scenario, the loss of carbon reserves in Henan Province will be the most alarming in terms of its consequences, with predicted reductions of 160.89 Tg by 2030 and 471.79 Tg by 2050. As construction land will encroach on farmland areas under the UD sce- nario, the latter will be reduced to occupying a total area of only 94805.70 km2, close to the red-line area concerning farmland protection in Henan Province, in turn seriously threatening China’s food security. The massive encroachment of urban spaces into farmland areas, coupled with the problems of land degradation and the growth of carbon emis- sion caused by urbanization (Liu et al., 2019), will lead to declines in the carbon fixation capacities of regional ecosystems in the province (Zhang Since the 18th National Congress of the Communist Party of China (CPC), China’s governance over its territory is undergoing profound changes. In this light, the geographical location of Henan Province, its resource endowment, and the principal regional responsibility entrusted to it by the government of China, will jointly determine whether it can successfully navigate the multiple demands and contradictions of ur- banization, development, food security, and ecological protection in the future. To elucidate, first, Henan Province is China’s third-most popu- lous province, with a total human population of 98.83 million as of 2021. However, the level of urbanization in this province is relatively low; its population urbanization rate, as of 2021, is only 56.45% (ranked the 26th in the country), far lower than the average population urban- ization level of China in the same period (64.72%). The province’s huge population base and its relatively lower level of urbanization should necessitate the urgent demand for and a vast space being dedicated to its future urbanization, involving the increased conversion of various land spaces to support the expansion of cities and towns, the development of non-agricultural industries, and the increased concentration of the province’s population. Indeed, Chinese government departments have introduced many policies to support Henan’s urbanization: speeding up the construction of the CPUA, actively supporting the construction of the Zhengzhou to one of China’s nine central national cities. Second, Henan Province is one of the 13 major grain-producing areas of China; its grain output accounts for 10% of the country’s total grain output. Hence, it bears a primary and irreplaceable responsibility of maintaining China’s national food security. Further, the Chinese government has introduced a series of strict policies in the province, at the level of farmland pro- tection and food production security, e.g., delimiting the red line for permanent basic farmland protection, promoting the construction of high-standard farmland, strengthening the supervision of functional grain-production areas, preventing the tendency toward the establish- ment of “non-agricultural,” “non-grain” farmland, etc. This makes the future expansion of construction land in the province subject to the rigid constraints of the relevant food security policies. Third, China has now entered a new era in terms of the construction of an ecological civili- zation. Going forward, the country’s ecological progress will be further improved, its ecological system will be protected and restored (with regard to various factors, regions, and processes), and its social and economic progress will leap toward a stage of high-quality development featuring pollution reduction, carbon reduction, and green recycling. Henan Province will be an important part of China’s arduous national strategy regarding the dual tasks of ecological protection and high- quality development, especially in the Yellow River Basin. Therefore, the future development and utilization of land space in Henan Province must jointly promote the simultaneous needs of food security, urbani- zation, and ecological protection in a holistic manner; only on this basis will the province achieve the goals of low-carbon development and successful utilization of land spaces, thus maximizing the benefits of carbon storage by terrestrial ecosystems. In this light, this study pro- poses the following three policy recommendations. First, Henan Province should strictly abide its main responsibility of food security, strengthen farmland protection, develop low-carbon agriculture, and transform the scalar advantage of farmland areas into the carbon-sink advantage of a farmland ecosystem. Up till now, it has developed 118 million mu of farmland, within the 1.8 billion mu red line set by the Chinese government. However, farmland is not only the space in Henan Province where grain production can be achieved; moreover, this type of land is an important barrier to ecological conservation in the plain areas. Thus, in the future, the province must do the following: strengthen the protection of the “quantity, quality, and ecology” of its farmland areas while simultaneously modifying its mode of agricultural development; improve the levels of “green” and low-carbon utilization of its farmland areas by relying on scientific and technological progress and scientific management; reduce the carbon emissions of its agricul- tural production; and improve the net carbon sink capacity of its farm- land areas. In this respect, previous research shows that effective farmland management is conducive to the strengthening of the carbon storage of agricultural ecosystems (Yu et al., 2018). Others claim that in Northern China, after long-term shallow tillage (i.e., farming on a land up to a depth of 30 cm every 2–3 years), reasonably deep tillage and rotation will effectively improve the carbon fixation capacity and the crop productivity of farmland areas (Bai et al., 2016; Tian et al., 2016; Xie et al., 2015). In addition, straw-returning measures will facilitate the increase of organic carbon in farmland soil, with the objective of enhancing carbon fixation potential (Yu et al., 2018). The agricultural scale and mechanization will also contribute to the implementation of rational rotation, deep tillage, and straw returning projects in the Second, based on the pattern of ecological security relevant to the territorial planning of Henan Province, it must strictly implement China’s red-line policy regarding ecological protection, ensure the pro- tection and restoration important ecological barriers, ecological patches, and ecological corridors, improve the management system of its natural reserves, and enhance the carbon storage function of important ecosystems (such as woodland areas). Indeed, the terrestrial ecosystem is the largest carbon pool in the world (Pagiola, 2008), among which the larger than those of other ecosystems. Hence, the implementation of ecological protection measures can promote the development of high- carbon-density land use covers and increase the carbon storage levels of Henan Province. As the carbon storage by forest areas is the largest at an early stage of growth, Henan Province’s forest areas will keep storing carbon at a stable rate after maturity (Ma et al., 2015). In addition, improving the province’s vegetation diversity will also effectively improve its soil carbon storage capacity (Chen et al., 2018). Thus, in the future, Henan Province should focus on the ecological protection and restoration of its three ecological barriers—Taihang Mountain, Funiu Mountain, and Tongbai Dabie Mountain—and also implement measures to ensure the tending of forests and the restoration of degraded forest areas in order to improve the carbon sink level of its mountainous ecological barrier, always in accordance with local exigencies. In addi- tion, the province should focus on developing the ecological belt along the Yellow River Basin as well as on other crucial river ecological cor- ridors, along with improving various nature reserves. Most importantly, it must undertake the tasks of overall ecological protection and system restoration in line with the concept of a life community, in order to improve the stability and the carbon fixation function of its various ecosystems.",
    "Third, the province must actively promote the construction of new urban spaces, improve the quality of urbanization, optimize the level of intensive use of construction land areas, prevent the carbon loss incurred by the disorderly expansion of urban spaces (that end up encroaching on farmland areas), and actively optimize as well as streamline the construction of urban green infrastructure in order to enhance the carbon sink functions of Henan’s urban green spaces. In summary, through the study of Henan Province’s carbon storage levels with respect to three scenarios, this paper finds that the impact of con- struction land on carbon storage in Henan Province cannot be ignored. Therefore, the future urbanization processes within this province must reasonably control the expansion of construction land, in combination with land space planning, and formulate appropriate policies/measures aimed at strict control and flexible management of its urban spaces. In addition, the use of its construction land areas should involve a shift in perspective—from “development increment” to “tapping potential stock”—and the efficiency and intensive levels of construction land should be continuously improved, with the aim of conserving more farmland and ecological land areas. Finally, the province should actively increase its urban green areas by promoting the construction of parks, road greenbelts, water greenways, street greenbelts, and by optimizing the layout of its urban green spaces. Although this paper introduces some surprising findings, it has certain limitations. First, the InVEST model oversimplifies the carbon cycle and believes that carbon sequestration of a region changes linearly with time. However, the carbon density of the same land use type can show spatial heterogeneity, even at times ignoring the carbon loss/in- crease due to seasonal changes in land use and cover, vegetation age, etc. (H´ector et al., 2023; Lee et al., 2023). Moreover, the estimation of carbon storage by InVEST is based on large-scale land use changes, which neglects other indicators such as soil texture and photosynthesis rate that significantly affect carbon sequestration (Wang et al., 2011). Additionally, this study mainly calculates carbon storage based on land use and carbon density data. Owing to the difficulty of data acquisition, all of the myriad factors affecting carbon storage are not fully consid- ered. Future studies must further address this limitation to improve the accuracy of their carbon storage estimation. Further, in the process of carbon storage estimation, the carbon density data gathered by this study are derived from previous research results and meteorological data revisions. Due to differences in the un- derstandings of or knowledge levels regarding regional carbon density factors such as environmental changes and human activities, and different students choose different correction indicators. This can lead to subsequent changes in the carbon density value, thus introducing un- certainty in the robustness of the results (Yang et al., 2021). For example, in order to ensure the comparability of corrected data routing throughout the entire research area, this study weakens the influence of spatiotemporal changes in MAT and MAP on carbon density. trend, but the carbon storage under the UD and BAU scenarios will decrease significantly, while the EC scenario will decelerate this decline trend of carbon reserves to some extent. Therefore, Henan Province should utilize the advantages of farmland carbon seques- tration, strengthen its ecological security patterns, improve the quality of its urbanization, and the optimize the level of intensive use of its construction land areas. Although InVEST introduces certain instances of uncertainty, the modified aboveground biomass carbon density of cultivated land, the soil organic matter carbon density, and the grassland soil organic matter carbon density that it calculates are similar to those in the research re- sults of scholars who have worked on Henan Province (Yang et al., 2022) and the neighboring provinces (Ke and Tang, 2019). Evidently, the carbon density found by this study after correction can represent the average carbon density in Henan Province, and its estimation results can clearly reflect the temporal and spatial changes of carbon reserves in the province from 1990 to 2050. In other words, carbon storage, as an important indicator of ecosystem service functions, can reflect the ecological status of Henan Province and outline the pathways of its Second, regarding the future land use simulations, although three different scenarios are considered, the simulation results still exhibit some degree of uncertainty. On the one hand, the PLUS model assumes fixed transition rules based on the past land-conversion rules when simulating future land use changes; these rules may change during a region’s future development process, while the future development planning and the related policy documents may not be directly con- verted into the constraint rules required by the PLUS model. On the other hand, although this paper selects 14 drivers of future changes in land use, the actual drivers of land use conversion are often more complex and may vary in number. Therefore, future researches should conduct more detailed investigations of the variety of the potential driving factors, transform the medium- and long-term development plans of local governments into constraint rules, insert them into the PLUS model through methodological innovations, adjust model pa- rameters and conversion rules, and thus further improve the simulation accuracy regarding future land use changes.",
    "The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Liyao Fan: Conceptualization, Methodology, Writing – original draft, Writing – review & editing. Tianyi Cai: Conceptualization, Methodology, Project administration. Qian Wen: Formal analysis, Writing – review & editing. Jing Han: Data processing. Shuxue Wang: Data processing. Junhao Wang: Software, Visualization. Chaohui Yin: Formal analysis. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Combining the InVEST model and the PLUS model, this paper sys- tematically simulates and analyzes the land use changes and the asso- ciated carbon storage responses in Henan Province, China, in the 1990–2050 period. Its main conclusions are as follows:"
]