[
    "Levels and inhalation health risk of neonicotinoid insecticides in ﬁne particulate matter (PM2.5) in urban and rural areas of China a State Key Joint Laboratory for Environmental Simulation and Pollution Control, College of Environmental Sciences and Engineering, Peking University, Beijing 100871, China e College of Urban and Environmental Sciences, Laboratory for Earth Surface Processes, Sino-French Institute for Earth System Science, Peking University, Beijing 100871, China Neonicotinoid insecticide (NEO) concentrations in ambient ﬁne particulate matter (PM2.5) and daily exposure via inhalation were investigated during spring and fall in an urban area in Beijing and in urban and rural areas of Zhengzhou, Henan Province, China. Four NEOs, including imidacloprid, acetamiprid, thiamethoxam and clo- thianidin, were assessed using a QuEChERS (quick, easy, cheap, eﬀective, rugged, safe) extraction procedure coupled to liquid chromatography–tandem mass spectrometry. Of 64 PM2.5 samples, 100% contained at least two NEOs (imidacloprid and acetamiprid). Imidacloprid was detected at the highest levels, ranging from 4.33 to 1.13 × 102 pg m −3. A relative potency factor method that considered diﬀerent toxicities was used to integrate the four NEO concentrations. The total NEO concentrations in air in the Zhengzhou rural area (mean: 80.86 pg m −3) were higher than those in urban areas. Diﬀerences between seasons were not signiﬁcant (p > 0.05). The highest value for the total average daily dose via inhalation of four NEOs (ADDinh,total), 91.0 pg kg −1 day −1, was found in rural children < 6 years old. The ADDinh,total of rural residents was sig- niﬁcantly higher than that of urban residents when there was no intensive pesticide application. Although the ADDinh,total values were below the current chronic reference dose, when possible joint toxicity and the increasing use of NEOs are considered, a potential health risk via inhalation is evident. We believe this study is the ﬁrst to characterize NEO levels in ﬁne particulate matter and to evaluate inhalation exposure in urban and rural re- sidents under nonoccupational scenarios in China. It will enhance our understanding of exposure to NEOs and provide a basis for risk management decisions. Neonicotinoid insecticides (NEOs) are among the most commonly used types of pesticide in agriculture, urban landscaping, and indoor pest control (Wang et al., 2019a). They have multiple uses, such as seed dressing, spraying, and soil application (Dankyi et al., 2014; Sharma et al., 2014; Yáñez et al., 2014). The predominant forms of application vary among regions. For example, seed treatment is the most common method of application in the United States and Canada (Limay-Rios et al., 2016; Zhang et al., 2018), whereas spraying is the main appli- cation method in China and Malaysia (Hamsan et al., 2017; Tao et al., 2019). China is the largest pesticide producer globally, with annual production of 14,000 tons of imidacloprid (IMI) and 8000 tons of acetamiprid (ACE) (Shao et al., 2013). In China, spraying accounts for a large proportion of NEO use and results in their release into the at- mosphere (up to 30–50%) (Coscollà et al., 2008). Once in the atmo- sphere, NEOs are most likely distributed in the particulate phase rapidly (Bonmatinet al. 2015) due to the low vapor pressure of 10 −6 to 10 −10 Pa (Raina-Fulton, 2015; Coscollà et al., 2008). Since most pesticides accumulate in ﬁne particulate matter (Coscollà et al., 2013b; Degrendele et al., 2016). Although the gas–particle partitioning and the particle size distribution of NEOs are unknown, there is great potential for the partitioning of atmospheric NEOs into PM2.5. Hence, human can expose to NEOs via inhalation of PM2.5 in air. Because of small diameter, inspiratory PM2.5 can move into the bloodstream and be distributed systemically to the lungs, kidneys, and 0160-4120/ © 2020 The Author(s). Published by Elsevier Ltd. This is an open access article under the CC BY-NC-ND license brain (Shukla et al., 2019). Additionally, PM2.5 is porous and has a large total surface area for the absorption of pesticides (Arruti et al., 2012). NEOs can enter the circulation and translocate directly to the brain by being absorbed on PM2.5. Moreover, because some NEOs (such as ACE) in the bloodstream can pass through the blood–brain barrier and ac- cumulate in the central nervous system (Terayama et al., 2016), they also have eﬀects on the mammalian brain. According to research con- ducted on mammals, the evidence is increasing that NEOs acting on nicotinic acetylcholine receptors can induce neurological toxicity (Wang et al., 2019c) and genotoxicity (Stivaktakis et al., 2016). They also reduce fecundity and delay sexual maturation (Burke et al., 2018). Although NEOs in the atmosphere undergo photochemical reactions in the presence of ·OH and h+, some products (such as desnitro-imida- cloprid) had high mammalian toxicity (Aregahegnet al. 2018; Sun and Liu, 2019). Therefore, neonicotinoids in PM2.5 are a potential risk to the health of residents and are worthy of further investigation. To date, some studies have focused on NEOs in PM10 (aerodynamic diameter less than 10 μm) or in total suspended particles (Coscollà et al., 2013a; Forero et al., 2017; Xue et al., 2015). Only one study has investigated NEO pollution in PM2.5 (Coscollà et al., 2008). The lack of data on NEOs in PM2.5 hampers our understanding of atmospheric NEOs.",
    "tion and dermal contact. The contributions of these two approaches vary among scenarios. Some early studies that focused on occupational exposure during agricultural activities estimated that < 1% of the total exposure to NEOs occurred via inhalation (Cao et al., 2015, 2017). Nevertheless, these attributions were based only on the NEO absorption rates of skin without considering clothing penetration, which could overestimate the contribution of dermal contact. When the clothing penetration rate (normally suggested as 10%) is considered, the con- tribution of dermal exposure decreases. Under the same exposure sce- nario, the contribution of inhalation exposure increases to 11% to more than 90% of total exposure (Cao et al., 2018; Choi et al., 2013). Re- garding general residents (especially co-resident family members of pesticide appliers), inhalation exposure could be much higher than dermal exposure due to the low frequency of direct dermal contact. Inhalation exposure to NEOs is especially important in nonoccupational scenarios. However, few studies have focused on nonoccupational NEO inhalation exposure. Although Coscollà et al. (2010, 2013a) reported concentrations of a variety of pesticides (including IMI and ACE) in particulate matter in Spanish ambient air, those concentrations have not been used to estimate population health risks via inhalation. Be- cause NEOs are ubiquitous in urban and rural areas due to increasing their use (Coscollà et al., 2013a; Wang et al., 2015; Zhang et al., 2018; Zhou et al., 2018), exposure to atmospheric NEOs via inhalation cannot be ignored when assessing their potential risks to human health. Although China has a large agricultural sector in which NEOs play a critical role, the levels of NEOs in particulate matter have not been reported. In this study, our objectives were to characterize the levels of four NEOs in PM2.5 during periods without intensive agricultural ac- tivities and to estimate the potential risks to residents by exploring the daily inhalation exposure in typical cities in China. To our knowledge, this study is the ﬁrst to estimate inhalation exposure in nonoccupational scenarios. This assessment will increase our understanding of non- occupational exposure to NEOs and provide a basis for risk manage- ment decisions. PM2.5 samples were obtained at one sample site in Beijing, China, and at two in Zhengzhou, Henan Province, China (Fig. 1). Henan Pro- vince is a typical agricultural region in China with the largest sown area, 14.8 million hectares, which is 8.90% of the national sown area (Wang et al., 2019b). As one of the most populous provinces, Henan Province also has the largest estimated rural population at > 46.4 million, accounting for 8.22% of the total national rural population (NBS P.R.C., 2019). Beijing is the metropolis with the smallest eﬀective irrigation area (110 thousand hectares) in China (NBS P.R.C., 2019). Because there is no large-scale, traditionally irrigated land, PM2.5 samples were collected only in the urban area. stalled in an urban area of Beijing, surrounded by schools and re- sidential units, except for mountains in the west. There were no large areas of farmland nearby. The other stations were installed in an urban (site 2, E34°49′12, N113°32′39) and a rural (site 3, E34°39′30, N114°0′5) area in Zhengzhou. Site 2 was at a university, surrounded by residential and commercial areas. Site 3 was in a conventional agri- cultural area, surrounded by orchards and irrigated land, approxi- mately 65 km from site 2. After having obtained approval, 53 residents living around sample site 3 completed a brief questionnaire. The questionnaire was asked about the usage and frequency of pesticide application, and the prior and next date of application. A total of 64 samples were collected continuously for 24 h on at least 7 days in the spring and fall. In Beijing (site 1), 14 samples were collected from 23 to 29 March and 14 from 18 to 24 October 2019. In Zhengzhou, 20 samples were collected in the urban area (site 2) and 20 were collected in the rural area (site 3) from 15 to 24 April 2019. Each sample was collected using an air sampler (JH-6120-A, Qindao Jingcheng, Inc., China) with a cyclone inlet (2.5 μm) and a single-stage ﬁlter pack containing a 90-mm glass ﬁber ﬁlter during the air sampling. The sampling ﬂow rate was 110 L min −1, giving a total volume of ﬁl- tered air around 158.4 m3. Before being loaded into samplers, glass ﬁber ﬁlters were baked for 5 h at 550 °C to eliminate organics and then conditioned according to European standard sampling regulations (EN 12341: 1998) for at least 48 h. After sampling, the ﬁlters were stored at −20 °C until analysis.",
    "To determine multiple NEOs in PM2.5 quickly and precisely, we developed a detection method based on a QuEChERS (quick, easy, cheap, eﬀective, rugged, safe) extraction procedure (Anastassiades et al., 2003) coupled to liquid chromatography–tandem mass spectro- metry (LC–MS/MS). The details of the method, such as chemicals, sample pretreatment, LC–MS/MS detection, and method validation, are reported in SM Section S1. Brieﬂy, sampled glass ﬁber ﬁlters were ex- tracted with acetonitrile using ultrasonic waves at 0℃ in darkness, followed by a clean-up procedure with primary secondary amine. The upper supernatant was evaporated to dryness, reconstituted, and ﬁl- tered through a 0.22-µm Nylon Micro Centrifuge Filter (Corning, USA) for LC-MS/MS. Each set of samples was analyzed under quality assurance protocols, including double process blanks, a ﬁeld blank, double reagent blanks, and two double-spiked blanks (5 and 100 ng mL −1). Blank baked glass ﬁber ﬁlters were used with each set as a procedural blank to monitor infused pollutants, which were pretreated in the same way as the samples. Field blanks were used to ensure that no contamination oc- curred during deployment, retrieval, and transportation of the ﬁeld ﬁlters. To monitor potential losses during the storage period, spiked ﬁlters were stored and then analyzed as samples. To evaluate NEO pollution levels, an integrated method based on the relative potency factor (RPF) was used to calculate the total NEO levels (Zhang et al., 2019) (Table S2). The total integrated concentra- tion of IMI, ACE, thiamethoxam (THIM), and clothianidin (CLO) was exposure frequency (days); ED is the exposure duration (years); BW is the body weight (kg); and AT is the average time (Table 1). For non- carcinogens, AT is the average time (days), and is equal to 365 × ED (Sawut et al., 2018). According to the recommended exposure assessment models in the US Exposure Factors Handbook (EPA, 1992), the total average daily dose via inhalation was estimated using the following equation: where IMIRPF,i is the contaminant concentration in inhaled air (pg m −1); EF is the integrated as Eq. (1); IR is the inhalation rate (m3 day ORCA 4.2.0 was adopted to conduct the calculations for the octa- nol–air partition coeﬃcient (Koa) of four NEOs (Neese, 2012; Neese, 2017). Geometry optimizations were performed at the B3LYP (Becke, 1988; Lee et al., 1988; Becke, 1993; Stephens et al., 1994)/def2-TZVP (Weigend and Ahlrichs, 2005) level of theory. The RIJCOSX (Neese et al., 2009) approximation was employed to speed up the calculation, where the auxiliary basis set def2/J (Weigend, 2006) was used for the RI part. Dispersion eﬀects were accounted for using Grimme’s DFT-D3 correction with Becke–Johnson (BJ) damping (Grimme et al., 2010; Grimme et al., 2011). Numerical, unscaled harmonic frequencies were calculated for converged structures to verify the nature of the stationary points and to obtain thermal corrections to the Gibbs free energy. Solvation eﬀects were taken into account using the SMD solvation model (Marenich et al., 2009). Here, Goct is the Gibbs free energy of the molecule in 1-octanol (calcu- lated at the equilibrium geometry in 1-octanol), Gvac is the Gibbs free energy of the molecule in vacuum (calculated at the equilibrium geo- metry in vacuum), and T is the temperature, which is taken as 298.15 K. The conformations of the four molecules were taken as the most stable conformations known from existing computational studies (Le Questel et al., 2011; Alamiddine et al., 2018). A conservative esti- mate is that the Klg oa values reported in the manuscript are accurate to about ± 1.0. Detailed information is provided in SM Section S2. Data analysis was performed in IBM® SPSS Statistics 24. NEOs concentrations below the detection limit were assigned the half level of the detection limit. The Breusch–Godfrey test was applied to evaluate the time series auto-correlation of the consecutive measurements, and ﬁrst-order diﬀerence transformation was employed to remove the ef- fects of the auto-correlation. Diﬀerences between groups were analyzed by one-way ANOVA when the two sets of data were distributed nor- mally; otherwise, Mann Whitney U test was used. Pearson correlation tests were performed to explore the relationships between total con- centrations and meteorological parameters. Statistical signiﬁcance level was deﬁned at α = 0.05. Generally, gas–particle partitioning of organic pollutants hinges on their physicochemical characteristics, notably Koa and vapor pressure (Hu et al., 2019; Pankow, 1998). For the four NEOs, the logarithms of Koa values to base 10 ( Klg oa) at 298 K were calculated. These Klg oa values for IMI, ACE, THIM, and CLO were 12.96, 12.67, 13.46, and 12.95, respectively. Compared to other organic chemicals, NEOs, which have a comparatively high value of Klg oa and low vapor pressure (10 −10 Pa) were almost exclusively found adsorbed to particulate to 10 −6 matter in the atmosphere (Zhang et al., 2004; Dijk and Guicherit, 1999; Coscollà et al., 2008; Raina-Fulton, 2015).",
    "Table 2 shows the concentrations and detection rates of NEOs in PM2.5 during spring in Zhengzhou. ∑IMIRPF values of those four NEOs were calculated using the integrated methodology described in Section 2.4. All four NEOs (IMI, ACE, THIM, and CLO) were detected in 100% of samples from urban and rural areas. The total concentration of NEOs (∑NEOs) ranged from 8.30 to 1.02 ×102 pg m −3 in the urban area and from 10.5 to 1.43 ×103 pg m −3 in the rural area. During the sampling period, the prevailing wind direction was from the northeast (Table S3), so the inter-regional transport of NEOs between sites 2 and 3 was as- sumed to be negligible. Additionally, the main removal routes for pesticides in the atmosphere are wet and dry deposition, photolysis, and chemical reactions (Feigenbrugel et al., 2006). Because sites 2 and 3 are located in the same city, the meteorological conditions (such as rainfall, luminous intensity) and the levels of atmospheric oxidants (such as OH radicals) were similar. The environmental fate of NEOs in the atmo- sphere at those two sites might thus be similar. Therefore, the diﬀerent total concentration of NEOs in atmosphere between the urban and rural areas could be explained by relatively higher emissions of NEOs in the rural area than the urban area. Similarly, Coscollà et al. (2013a) de- tected NEOs more frequently and at higher average concentrations in rural areas surrounded by irrigated land or orchards than in urban sites surrounded by residential or commercial areas. As shown in Table 2, during the sampling period, it rained on 2 days (21 and 22 April) in both sites. The total concentration of NEOs in air decreased on those 2 days, but then returned rapidly to relatively high levels after the rain. Moreover, ∑NEOs and relative humidity (Table S3) were signiﬁcantly negatively correlated in both the urban and rural areas (Pearson cor- relation coeﬃcient, r = −0.698/-0.739, p < 0.05). These results suggest that wet deposition might be an important removal mechanism of atmospheric NEOs. Among the NEOs (Fig. 2), the concentrations of IMI were the highest in both the urban and rural areas, with mean values of 31.9 pg m −3 and 48.0 pg m −3, respectively. This may be because IMI was the ﬁrst commercial neonicotinoid insecticide, and it continues to be used ex- tensively in agricultural activities and urban landscaping in China (Nauen and Denholm, 2005). In a previous study, we found similar results in soil (Zhou et al., 2018), where the frequencies and con- centrations of IMI were higher than those of seven other NEOs. How- ever, the concentrations of ACE, THIM, and CLO typically diﬀered be- tween the two sites (Fig. 2). In the urban area, the concentrations of THIM ranged from 0.84 to 25.6 pg m −3 and were higher than those of ACE, which ranged from 0.67 to 14.5 pg m −3. In the rural area, by contrast, the concentrations of ACE (1.45 – 37.0 pg m −3) were higher than those of THIM (0.82 – 12.2 ng g −1). This result indicated that diﬀerent types of NEOs were used in agricultural activities and urban landscaping. The consecutively measured concentrations of some chemicals re- vealed signiﬁcant time-series auto-correlation (Table S5), for THIM in urban samples (p < 0.03) and ACE in rural samples (p < 0.02), which could impair cross-region comparisons. We thus eliminated the tem- poral auto-correlations by ﬁrst-order diﬀerence transformation and performed stricter comparisons of the adjusted values (Table S6). The diﬀerences in concentrations of IMI and THIM between the two sites were not signiﬁcant (ANOVA, p > 0.05). However, the concentrations of both ACE and CLO were signiﬁcantly lower (ANOVA, p < 0.05) in the urban area than in the rural area. As we noted previously, because the inter-regional transport of target compounds had little eﬀect on the distributions of NEO concentrations in the urban and rural areas during the sampling period, the main reason for these diﬀerences in con- centrations might be diﬀerences in the amounts used. Thus, users in the rural area might prefer IMI and ACE, while those in the urban area prefer IMI and THIM. However, it is noteworthy that the toxicity of THIM is approximately 9.5 fold that of IMI, 11.9 fold that of ACE, and 1.6 fold that of CLO, according to the chronic dietary reference dose (cRfD) of the US EPA (EPA, 2002, 2003, 2008). This characteristic of THIM could result in higher potential risks to the health of residents, especially when applied in urban areas with high population density.",
    "Table 3 shows the concentrations and detection rates of the four NEOs in Beijing in diﬀerent seasons. Three NEOs were detected in PM2.5, the exception being CLO. The frequencies of NEOs in Beijing were lower than those in Zhengzhou. The most frequently identiﬁed NEOs were IMI and ACE, with a detection rates of 100% when spring and fall rates are considered. Thiamethoxam was detected in 28.57% of PM2.5 samples in spring, and 57.14% in fall. In contrast to Zhengzhou, (p > 0.4469); hence, we performed comparisons directly on the raw measurements. The median value of ∑NEOs in spring were slightly higher than those in fall, but the diﬀerence between the seasons was not signiﬁcant (ANOVA, p > 0.05). In spring, the ∑NEOs ranged from 14.2 to 79.7 pg m −3, and in fall from 16.9 to 73.7 pg m −3. This result is consistent with that of a previous investigation of 22 insecticides in Spain (Coscollà et al., 2010), which reported the highest detection rates and concentrations during spring and early summer. However, com- pared to the concentrations of insecticides reported by Coscollà et al. (2010) during fall, we detected higher concentrations. This diﬀerence could be related to diﬀerent insecticide application patterns between Beijing and Spain. In Beijing, according to a survey of farmers on pes- ticide application (Chen and Zhong, 2013), high concentrations of in- secticides (e.g., IMI) and fungicides are sprayed during fall (after de- foliation) to eliminate overwintering pests and to reduce the occurrence of pests and diseases. This could result in high atmospheric con- centrations of insecticides. Although Chen and Zhong (2013) focused on fruit trees, the similar growth behavior of fruit trees in agriculture and ornamental trees in landscaping in the same region could explain the continuous high concentrations detected in fall in our study. CLO was not detected in all samples collected in Beijing in the two seasons. The diﬀerent application scenarios of NEOs might explain this result. IMI, ACE, and THIM are applied to control pests on agricultural crops and urban ornamental plants, whereas CLO is used only in agri- cultural ﬁelds (Wang et al., 2019a). We also examined the diﬀerence in ∑IMIRPF of detected NEOs in PM2.5 between Beijing and Zhengzhou during spring in order to explore the diﬀerent toxicity of particulate matter. As shown in Table S7and S8, the ∑IMIRPF in PM2.5 in the urban area of Beijing was approximately 1.5fold higher than that in the Zhengzhou urban area and was close to the concentration in the Zhengzhou rural area. This result suggested that in the urban area, which lacks large-scale agriculture, large amounts of NEOs were used to ensure the growth of ornamental plants in urban landscaping. Such heavy use could result in long-term in- halation exposure to NEOs, increasing the health risks for the general population. frequency of 100%, again highlighting the intensive use of this in- secticide (Fig. 2 and Table 3). The average concentrations of IMI were 23.6 pg m −3 in spring and 29.6 pg m −3 in fall. In spring, the IMI concentrations in the Beijing urban area were slightly lower than those in Zhengzhou. ACE was detected in all samples in both spring and fall. The mean concentration was 2.80 pg m −3 in spring, which was higher than the 2.15 pg m −3 in fall. As described in Section 3.2, THIM had the highest toxicity of the four NEOs. Although THIM was only detected in up to 60% of PM2.5 samples in the Beijing urban area, high average concentrations were detected, with average values of 5.94 pg m −3 in spring and 7.29 pg m −3 in fall. Two extremely high values of THIM were detected (32.2 pg m −3 on 26 March and 28.0 pg m −3 on 21 October), which subsequently decreased rapidly. This result may have been caused by the relatively long spray interval (low frequency of spraying) and the moderately fast degradation rate under direct pho- tolysis (Lu et al. 2015). However, this cannot be conﬁrmed due to the lack of studies on the atmospheric degradation of THIM. NEOs in PM2.5 might expose populations via inhalation and increase the health risk. Thus, we evaluated the ADDinh according to age, gender, and area based on the integrated values of NEOs in PM2.5. Table 4 shows the ADDinh,total in diﬀerent populations in the urban and rural areas in Zhengzhou and Beijing. Because of the higher con- centrations of NEOs in the rural area, those residents had higher in- halation exposure than did those in the urban area. In spring, the AD- Dinh,total of NEOs in children < 6 years old in the urban (81.3 pg kg −1) and rural (89.0 pg kg −1 day −1) areas were higher than those in day −1 children 6–18 years old in the Zhengzhou urban (49.9 pg kg −1 day −1) and rural (54.6 pg kg −1 day −1) areas. In adults, the estimated AD- −1 day −1 in the urban area and 42.9 pg kg Dinh,total was 38.3 pg kg −1 in the rural area. The ADDinh,total of children < 6 years old was day −1 approximately twofold higher than that of older children and adults, which suggests higher exposure risks to younger children via inhala- tion.",
    "The estimated ADDinh,total for urban residents in Beijing during spring and fall are summarized in Table 4. In urban children, the AD- −1 day −1 in spring and from Dinh,total ranged from 23.5 to 42.2 pg kg −1 in fall. In urban adults, the ADDinh,total was −1 day 28.7 to 51.6 pg kg −1 in spring and 23.8 pg kg −1 day −1 in fall. −1 day lower, at 19.5 pg kg Because of the similar total concentrations of NEOs in the two seasons, there was no signiﬁcant diﬀerence in ADDinh,total between spring and fall (p > 0.05). The gender diﬀerence in ADDinh,total for NEOs was not signiﬁcant (p > 0.05). both urban and rural areas in Zhengzhou, accounting for 47.3–88.4% (Fig. 3(a) and (b)). The lowest contributions were from ACE at both sites. These results suggest that THIM and CLO contributed sub- stantially to the ADDinh,total in Zhengzhou. Thus, the control of THIM and CLO emissions could be an eﬃcient way to reduce inhalation ex- posure. In contrast to Zhengzhou, the predominant contributor to AD- Dinh varied in Beijing (Fig. 3(c) and (d)). Whether in spring or fall, the contributions of IMI were predominant, except for some days on which THIM was detected. On those days, THIM became the predominant contributor, contributing > 70.0% of ADDinh,total. Therefore, because of its relatively high toxicity, the concentration of THIM in the atmosphere could be important, especially in Beijing. Early studies focused primarily on occupational potential re- spiratory health eﬀects of NEOs during agricultural activities (Aprea et al., 2009; Cao et al., 2015, 2017, 2018; Choi et al., 2013; Gallart- Mateu et al., 2016; Hamsan et al., 2017; Zhao et al., 2015). In this study, we estimated daily inhalation exposure to NEOs in nonoccupa- tional scenarios. The ADDinh,total of four NEOs ranged from 19.5 to −1 day −1. Comparison with the average dietary dose of total 91.0 pg kg NEOs (646 ng kg −1 day −1; Zhang et al., 2019) suggests that dietary ingestion is a more dominant exposure pathway of NEOs than is in- halation in the general population. The low levels of ADDinh can be explained by the small mass of daily inhaled PM2.5, although the con- centrations of NEOs were one to two orders of magnitude higher in PM2.5 than in food (Table S7 and S8). According to the results of the questionnaires, there were no intense pesticide spraying activities around the sample sites during the sampling period, which suggests low emission of atmospheric NEOs. However, NEO concentrations would be two to three orders of magnitude higher during the busy farming season during mixing/loading and spraying of the NEOs examined in this study (Choi et al., 2013; Gallart-Mateu et al., 2016). Thus, it is likely that the inhalation exposure of rural residents would be much higher during the busy farming season. Signiﬁcantly higher concentrations of NEOs during the busy farming season might increase the contribution of in- halation exposure to a level similar to that of dietary ingestion. The results indicated that the contributions of inhalation exposure could vary in diﬀerent scenarios. Moreover, the respiratory exposure of the rural population was higher than that of the urban population in this study, which means that even during the period without intensive farming, the rural population had higher potential inhalation health risks than the urban population. This is supported by a recent report (Tao et al., 2019) showing that IMI concentrations in the urine of rural residents were signiﬁcantly higher than those in the urine of urban residents during a no-intensive-farming period. Therefore, rural re- sidents are chronically exposed to higher levels of NEOs via inhalation than are urban residents, although the contributions of inhalation ex- posure vary in diﬀerent scenarios. To explore the contributions of each NEO to the ADDinh,total of re- sidents, the ADDinh of each neonicotinoid insecticide was normalized as ADDinh,i using the equation in Section 2.4. Fig. 3 shows the average contributions of the diﬀerent NEOs to ADDinh,total of 6–18-year-old children in spring in Zhengzhou and in spring and fall in Beijing. Although the concentrations of THIM and CLO were signiﬁcantly lower than those of IMI (Fig. 2), due to the higher human toxicity of THIM and CLO (9.5 and 5.8 fold that of IMI, respectively) (EPA, 2003), the contributions of THIM and CLO to ADDinh,total were dominant in In this study, a mixture of NEOs (at least two compounds) was de- tected in all PM2.5 samples. The toxicity of neonicotinoid mixtures caused synergistic adverse eﬀects on insects (Maloney et al., 2017; 2018; Yu et al., 2016). Although the joint toxicity of multiple NEOs or of NEOs and other contaminants (e.g., polyaromatic hydrocarbons and poly brominated diphenyl ethers, among others) in PM2.5 remains un- clear, the potential risk via inhalation might be elevated by the possible We note some limitations associated with this study. First, the PM2.5 samples collected in Zhengzhou during fall were damaged during transport to the laboratory. Therefore, we obtained NEO concentrations in PM2.5 only during spring, and the values for the two seasons can be compared only for Beijing rather than for two typical cities. Second, we estimated the average daily inhalation dose using NEO concentrations in ambient air instead of diﬀerentiating indoor and outdoor NEO levels. Since the presented detected NEO concentration in indoor dust (median: 25.8 ng g −1) (Wang et al., 2019a) was approximately 30-fold less than that detected outdoors in this study (median: 8.18 × 102 ng g −1). We used the relatively higher NEO levels (outdoors) to obtain a conservative estimate of NEO exposure with consideration of some re- sidents’ opening ventilation windows. Nevertheless, the concentrations of NEOs indoors might diﬀer from those outdoors (Du et al., 2018) due to diﬀerent PM2.5 levels (especially during heavy air pollution days) and application of NEOs to indoor ornamental plants (Wang et al., 2019a, Peribanez et al., 2018). More data, including on NEO con- centrations in oﬃces, homes, and classrooms, are needed to better as- sess the inhalation exposure of NEOs for residents. Third, inhalation exposure may have been underestimated because the analytical method used in this study measured only four common NEOs in PM2.5. Other legally used NEOs have been detected at high levels in surface water (Chen et al., 2019; Wan et al., 2019) and soil (Zhou et al., 2018) in China. This indicated the possible presence of undetermined NEOs in The NEO concentrations in 64 PM2.5 samples and the daily inhalable dose of residents were investigated in this study. Although the values of ADDinh were below the current chronic reference dose (EPA, 2008), when the possible joint toxicity of NEOs and other contaminants ab- sorbed on PM2.5 and the increasing use of NEOs are considered, a po- tential inhalation health risk remains for populations. The results of this study strengthen the current state of knowledge on contributions from diﬀerent routes of exposure. The evaluation of NEO exposure via in- halation showed that contributions via the inhalable pathway varied under diﬀerent scenarios. In rural residents, especially the co-resident families of occupational users, the inhalation exposure to NEOs could be an important pathway because of the long-term higher concentra- tions, with or without intensive pesticide applications. Due to the higher exposure in children < 6 years old, children of occupational applicators should receive greater attention in future studies.",
    "The authors declare that they have no known competing ﬁnancial interests or personal relationships that could have appeared to inﬂu- ence the work reported in this paper."
]