[
    "Extreme weather is frequent and aggressive, posing a huge challenge to urban management ca- pacity. The construction of urban resilience is a systematic project of multi-system coordination. Previous studies have focused on temporal evolution, external system coupling and coordination, and less on the internal study of urban resilience systems. Based on the perspective of the Wuli- Shili-Renli methodology, the study combines urban resilience with Eastern management philos- ophy. Using a coupled coordination model, the evolutionary laws of key elements of multiple processes in the complex urban resilience system of Henan Province are studied. The coupled coordination mechanism of multiple elements and processes in the province is revealed. It is found that (1) the development of the urban resilient system in Henan Province has gone through two stages from fluctuation to stability. From 2010 to 2015 called “fluctuating growth” and from 2016 to 2019 called “linear growth”. (2) There are three different periods of development for the coordination of the urban resilient system in Henan. Stage 1 (2010-2015) the “coupling teething period”, stage 2 (2016-2017) the “decoupling accumulation period” and stage 3 (2018-2019) the “self-organized explosive period”. (3) Henan has strong preventive power, but weak resistance and recovery power. Then, from the perspective of WSR, the optimal regulation of the regional urban resilient system is proposed. Resilience, since first introduced into ecological governance [1], has exploded in many academic fields, such as engineering, business management, agricultural science [2]. Urban resilience as a capacity to help cities cope with external shock events has gained much attention in recent years. Especially since the world has been hit by natural disasters frequently, the governments are proposing to enhance the capacity of urban resilience to cope with it [3]. Urban resilience is an ability to help cities absorb external influences and maintain operations in the event of natural disasters or external shocks [2,4—6]. Different perspectives have various measurements of urban resilience [5,6]. The following dimensions are recognized as important measurement elements by the academic community, including physical, natural, economic, institutional, and Received 17 November 2022; Received in revised form 6 April 2023; Accepted 11 May 2023 Available online 18 May 2023 2405-8440/© 2023 The Authors. Published by Elsevier Ltd. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). social [4]. Baseline Resilience Indicators for Communities (BRIC) theoretical framework was design by Cutter [7] to measure urban resilience, including six dimensions of social, economic, housing and infrastructure, institutional, community, and environmental. The BRIC framework can be applied to assess urban resilience in countries [8], provinces [9,10] and regions [11,12]. The BRIC is universal enough, it can also be used to analyze China’s urban resilience. With the rapid urbanization process in China, the increase in popu- lation density poses a complex challenge to urban management and sustainability. The significance of collaborative governance of urban resilience from the perspective of complexity. The Wuli-Shili-Renli methodology was designed to analyze the complex problem from an oriental perspective by Gu and Zhu [13]. It provides a way to divide complex problems into three dimensions: Wuli (Objective existence), Shili (Interaction), and Renli (Sub- jective motivation) [14-16]. Wuli, which means objectively existing objects, answers the major question of what material constitutes the objective world and maintains the operation of the complex system. Shili, which means the interaction between things, answers the major question of how the system goes. Renli, which means the subjective objects, answers the major question of what we could do to sustain the system running [13,14,16,17]. The WSR methodology has been widely used in many research areas including risk man- agement [18,19], energy management [20-22], public management [23,24], construction management [25,26], tourism management [27], and knowledge management [28]. Wul-Shili-Renli methodology also applies to urban resilience. This study combines the WSR methodology with the BRIC framework to analyze urban resilience system. And assessed the coupling coordination of urban resilience subsystems in Henan Province. Then proposed an urban resilience enhancement strategy suitable for the management context in China. Chen [29] proposed a modified model based on BRIC with the practical experience of Chinese cases. Table 1 showed the di- mensions, sub-dimensions, and indicators of a modified BRIC model. The selection of indicators takes into account both theoretical compliance and data accessibility.",
    "Based on the WSR method, the framework of urban resilience analysis is built (Fig. 1). Wuli includes environmental resilience and infrastructure resilience because the ecological environment and infrastructure construction of the city are inherent properties, which are difficult to change in the short term due to management policies or external changes. Shili includes economic resilience and institutional resilience, compared with the Wuli, this dimension is concerned more with the “human” factor, reflecting the combi- nation of emotion and reason, and the city economy and system are affected by the manager’s governance ability. Renli, compared with the Shili and Wuli, the human-rational dimension is more emotional, and its attribute changes are closely related to the policy environment. When hit by a disaster, managers can change their attributes through a variety of management tools such as policy formulation and resource deployment to cope with the disaster (see Fig. 2). TOPSIS method was used for data processing, even there are many ways to define the weights of indicators, the TOPSIS method is the best way to get weights more objectively. It helps integrate the multi-metric quantities of each Sub-dimensions into each dimension. It calculates objective weights by using the information on data characteristics [30]. The entropy represents how chaotic the data is in the set, and it helps define the weights of indicators. The calculation process is as follows [31]: where y means the normalized value, i means the indicator serial number. After normalization, the minimum data is defined as 0, which will interfere with the calculation of the logarithm of information entropy. So we used data panning to eliminate the effect, then calculate the information entropy e;: where z is intermediate quantity, t means times, here t is taken as 10. Then calculated the indicator weights «;: after the progress (1) to (7), the weights of each sub-dimension, the assessment value of each dimension, and the assessment value of urban resilience were got. The coupling coordination degree model is usually used to analyze the coupling and coordination relationship between two sys- tems, and also can be used to analyze multi-composite system problems [32]. Analyze the trend and development path of system operation within the composite system through the calculation of coupling degree and coordination degree. The calculation process is as follows [33,34]: Referring to the existing standards and combining with the data characteristics, the coupling coordination level is divided as shown in Table 2. This study takes Henan Province as the study area. The Yellow River Basin has long met the problems with a fragile ecological landscape, vastly different levels of development, and loose cooperative relationships [35]. Henan Province is located in central China, in the middle reaches of the Yellow River Basin, had suffered a lot because of natural disasters [36]. The 7/20 rainstorm event has shown the weak urban resilience capacity in Zhengzhou, the capital city of Henan Province. As an important area in the Yellow River Basin, it is vital to cultivate disaster mitigation capacity in Henan Province. The data were selected from 2010 to 2019 for the development of cities in Henan Province. Due to the lack of data, it is difficult to ensure the reliability of data before 2010. In order to make the research conclusions more extensive, a long research interval is selected as far as possible, so the starting point of the research interval is 2010. And avoid the influence brought by COVID-19, the study interval is before 2020. Data sources are from the EPS data platform. It includes China City Database, China Regional Economic Database, and China Urban and Rural Construction Database. There are also the Henan Statistical Yearbook and the statistical yearbooks of various cities. Through data acquisition and entropy weighting method, the assessed values of urban resilience and the assessed values of each sub-dimension in Henan Province from 2010 to 2019 are obtained (Table 3). In terms of the overall growth path of the system, the resilience of Henan cities has increased significantly over the past decade and has shown a “two-step” trend, with “fluctuating growth” from 2010 to 2015 and “linear growth” from 2016 to 2019. From 2010 to 2015, it showed “fluctuating growth”, and from 2016 to 2019, it showed “linear growth”. From the subsystem development curve, environmental resilience, facility resilience, and economic resilience synergize more obviously and remain similar to the urban resilience development curve, while social resilience and community capital grow more slowly, coupled with the imbalance of institutional resilience development and other constraints, to a certain extent inhibit the overall growth rate of urban resilience (see Fig. 3).",
    "Through the coupling coordination degree model, the coupling coordination degree and grade evaluation of the urban resilience system of Henan during 2010-2019 were calculated (Table 4). Fig. 4 showed the temporal trend of the coupling degree (histogram) and the coordination degree (line). high-level but the coordination degree was low-level. The components of the urban resilience system are being put together and have not yet to form a consistent pace. Stage 2 (2016-2017), called “decoupling accumulation period”, reduced nearly to the growth coupling level, and the coordination degree was increasing to medium-level. System components are reducing coupling and finding opportunities to work together. And Stage 3 (2018-2019), called “self-organized explosion period”, both coupling and coordination degrees were growth to high-level. Each component of the system has found its own optimal development mode, and the whole system is in a highly coordinated state. From the perspective of time series, it has been confirmed that the evaluation value of urban resilience in Henan Province increases year by year [37]. Next, we analyze the degree of coupling and coordination of each part separately from the WSR perspective. Then further analysis is done from the three different system phases shown in the results. Based on the WSR approach, the BRIC framework is divided into three parts, Wuli, Shili, and Renli. The Wuli contains environment resilience and infrastructure resilience. The Shili contains economic resilience and institutional resilience. The Renli contains social resilience and community capital. The analysis unfolded in each part helps to discover the rich coupling in the development process of urban resilience. The Wuli level (Fig. 5) contains environmental resilience and facility resilience, which are inherent properties of the objective level, and it is difficult to respond quickly in the short term while building a physical barrier to prevent disasters that are the preventive power of the city. The overall growth of environmental resilience and facility resilience is relatively strong, with values increasing from 0.149 to 0.047 to 0.868 and 0.992, respectively, and showing a perfect growth curve. The coupling degree is maintained at a high level and the coordination degree is increasing linearly. Thanks to the rapid economic development, urban management has increased the investment in the construction of infrastructure and other environmental aspects, such as sponge city construction project, compre- hensive pipeline corridor construction, and construction of sewage treatment facilities, which has increased the environmental and ecological carrying capacity and laid a solid foundation for the construction of urban resilience in Henan. When disaster strikes, urban green areas, parks, and other public places can be used as emergency evacuation sites to enhance the city’s emergency protection capacity, while the per capita road area and water supply capacity guarantee the normal operation of residents’ production and life, and the annual precipitation has not yet formed a benign development by natural factors. The Shili level (Fig. 6) contains economic resilience and institutional resilience, which is between the subjective and objective principles of urban operation, in the short term with a certain degree of flexibility, the buffer zone is constructed when a disaster comes that the city’s resistance. Economic resilience and institutional resilience growth diverge, Henan’s economic development level has increased year by year, making economic resilience grow from 0.198 to 0.780, forming a better growth curve and acting as a power source of urban resilience to inject strong vitality into the growth of urban resilience in Henan. Shili’s coupling and coordination degrees kept the same fluctuations as the whole system, with inflection points in 2016 and 2018. Good economic resilience guarantees the normal functioning of society, while a higher level of resilience can provide a superior external environment for economic development. The increase in the proportion of the secondary tertiary industry, disposable income, tax revenue, and fiscal revenue year by year constructs a stronger disaster response buffer. Good institutional resilience reflects the concept of urban management, and social service agencies and personnel, and health institutions construct the life-safety line for the affected groups. Along with the rapid urbanization, the unemployment rate is rising, the population density is increasing, and the investment in public services, such as health institutions and social services, is insufficient. The Renli level (Fig. 7) contains urban social resilience and community capital, which reflect the subjective level governance concept of urban managers and form the self-healing ability of the city to recover actively, i.e., the resilience of the city. Social resilience and community capital show a flat growth trend, from 0.327 to 0.316 to 0.650 and 0.703 respectively. Their growth rate and evolution space are smaller than the resilience assessment value of the environment, facilities, and economic subsystems, and the construction of social resilience and community capital has a certain foundation in 2010. Renli’s coupling degree has remained relatively good, with minor fluctuations in 2016. Its coordination degree was relatively low until 2016 and only improved from 2016. When a disaster strikes, teachers, doctors, researchers, public officials, and other educated groups can assist in disaster mitigation under the unified command of the emergency management center, enhancing the government’s rapid execution and enabling the affected area to recover quickly. Although the total population of Henan has not changed much during the decade, the flow of people from rural to urban areas has never stopped, and the increasing density of the urban population, the increase in mobile population, and the decrease in social participation have tested the social carrying capacity of cities.",
    "2010-2015 is the “coupling teething period”, in which the coupling degree between subsystems is continuously improved, and the mutual linkage between them is continuously improved and formed into a community, but the system as a whole has not yet formed a good development trend, and the overall coordination degree fluctuates at the critical level of disorder and coordination, and the urban resilience. The assessment value of urban resilience has not increased significantly in this stage. Environmental resilience, infra- structure resilience, and economic resilience have been steadily increasing, while social resilience is at a low to medium level and has not been improved to a large extent, institutional resilience and community capital have deteriorated, and urban management has not yet intervened in “governance of Shili” and “governance of Renli”. The urban resilience construction has only improved the envi- ronment and facilities at the objective level but has not yet achieved a qualitative breakthrough. 2016-2017 is the “decoupling accumulation period”, the coupling degree between subsystems has decreased to the growth coupling level, the overall coordination of the system has increased and developed into medium-level coordination, and the evaluation value of urban resilience has increased to a certain extent. Environmental resilience, facility resilience, and economic resilience have grown steadily, social resilience and community capital have improved compared with the previous stage, and the level of urban resilience has improved after more “governance of Renli” means have been involved in urban management, achieving a breakthrough from 0 to 1. 2018-2019 is the “self-organization explosion period”, the coupling degree is high level, the correlation degree among subsystems is highly correlated, the system coordination degree is high-level coordination, and the overall urban resilience system is highly unified and coordinated, forming a positive feedback linkage co-evolutionary consortium, and the city. The city resilience evaluation value increases the most. From the subsystem level, the evaluation value of each subsystem has increased substantially, and the combination of “physical governance”, “human governance” and “rational governance” has achieved a qualitative breakthrough of “three-tier The combination of “governance of Wuli”, “governance of Shili” and “governance of Renli” has achieved a qualitative breakthrough of “unity”. In summary, the development of the Henan urban resilience system is in line with the evolution trend of complex systems, and has gone through three processes of coupling-decoupling-coupling, achieving good coordination among systems, and has entered the process of self-organization of urban resilience complex systems. The development pattern of urban resilience system at the level of Henan Province and the Yellow River Basin is similar [38]. In the future, when the high-intensity coupling reaches the bottleneck of system development, we should take the initiative to intervene to take decoupling means, find the weak point of urban resilience construction, and realize the dynamic coordination of systems again. This study analyzes the urban resilience development from the perspective of complex systems. In the future, the inter-regional network effects within the basin should be considered, and a more detailed path analysis of inter-provincial and inter-watershed urban resilience development should be formed by combining various analysis methods such as QCA. And due to the influence of COVID-19 and lack of data, the research range was limited to 10 years, and the generalization of the research conclusions was insufficient. Based on the BRIC model, we measured the evaluation value, coupling degree, and coordination degree of the urban resilience system in Henan Province in the past ten years, analyzed the development of the urban resilience complex system using the WSR method, and obtained the following conclusions. resilience is obvious and remains similar to the urban resilience development curve, while the growth of social resilience and community capital is slower, and there is still some imbalance in the development of institutional resilience. Zhihua Huang: Analyzed and interpreted the data; Contributed reagents, materials, analysis tools or data; Wrote the paper. Zhuoqun Gan: Performed the experiments. Wei Luo: Conceptualization, Methodology, Writing - review & editing, Investigation. Zhihua Huang: Formal analysis, Writing - original draft. Suiying Cheng: Investigation, Funding acquisition, Writing — review & editing. Zhuoqun Gan: Data curation. This research was supported by the Chinese National Funding of Social Sciences [grant number 21ZDA081]; Henan Office of Philosophy and Social Science [grant number 2022BJJ033]; Henan Province key R & D and promotion special project (soft science) [grant number 222400410140]; Henan Province key R & D and promotion special project (soft science) [grant number 222400410635]; Henan Province education science “14th Five-year plan” 2021 general project [grant number 2021YB0034].",
    "The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."
]