[
    "Abstract The temporal and spatial variation char- acteristics of air quality index (AQI) in major cities in China were explored in this paper using statisti- cal analysis, hot spot analysis, spatial autocorrela- tion, mean center, and geographic detector based on the daily AQI data from 2014 to 2020. The results show that ① the annual AQI average value dropped from 94 to 67 from 2014 to 2020. The percentage of cities with daily AQI excellent rates between 0.8 and 1 is significantly increasing, reaching 77% in 2020. ② AQI is highest and lowest in winter and summer, respectively. The trend of the monthly AQI average value is roughly in a U shape. Moreover, the AQI in January and December is high, and the AQI in August J. Cheng · F. Li (*) · L. Liu · H. Jiao School of Geography, Nanjing Normal University, Nanjing 210023, China the annual AQI average in China’s major cities shows agglomeration effects. The hot spots are distributed in North China and Xinjiang, and the cold spots are mainly distributed in the northeast and southern regions of China. ④ The average center of the annual AQI average of major cities in China was distributed in Sanmenxia City and Luoyang City, Henan Prov- ince, from 2014 to 2020 with a relatively small mean center migration range. ⑤ Based on the geographi- cal detector model, the impact of total precipitation, 10-m u component of wind, 10-m v component of wind, surface pressure, and 2-m temperature on AQI is analyzed, and it is concluded that 2-m tempera- ture has the greatest impact on AQI. Meanwhile, it is explored that GDP and population density have a certain impact on air quality. Therefore, analyzing the temporal and spatial characteristics of air quality pro- vides some scientific basis for the regional collabora- tive governance of air pollution and the in-depth fight J. Cheng · F. Li · L. Liu · H. Jiao Jiangsu Center for Collaborative Innovation in Geographical Information Resource Development and Application, Nanjing 210023, China J. Cheng · F. Li · L. Liu · H. Jiao Key Laboratory of Virtual Geographic Environment (Nanjing Normal University), Ministry of Education, Nanjing 210023, China certain concentration at a sufficient time, damag- ing the living environment of human beings and endangering human health, is referred to as air pol- lution (Lan, 2016). Air pollution is one of the urban environmental problems needing urgent solutions. In addition, it is an important topic in atmospheric environment studies, greatly affecting the construc- tion of ecological civilization in China (Chen et al., 2020). Resources have been largely consumed and the environment damaged by the rapid development of industrialization and urbanization. This has led to severe atmospheric problems such as smog and pho- tochemical pollution (Wang et al., 2018, 2021). In addition, northern China is vulnerable to the impact of sandstorms, which not only brings serious air pol- lution, but also poses great harm to surface conditions and human health (Yu et al., 2019). Severe air pol- lution had a serious impact on people’s production, life, and health that have been observed. Incidences of respiratory diseases, for example, also significantly increased in winter (Buoli et al., 2018; Leiva et al., 2013; Wang & Hao, 2012). Humanity is becoming increasingly concerned about the environment while improving the quality of life. Thus, air quality has gradually attracted increasing attention (Li, 2018). Consequently, the Ministry of Environmental Pro- tection of the People’s Republic of China issued the ambient air quality standard on February 29, 2012. The air quality status is presented using the unified evaluation standard. The air quality index (AQI), a comprehensive indi- cator to measure air pollution (Bai et al., 2018), is often used to quantitatively analyze regional air qual- ity. The air quality index is a new national air quality evaluation standard released in February 2012. The higher the value, the more serious the air pollution condition. There are six major pollutants involved in air quality evaluation, including PM2.5, PM10, SO2, NO2, O3, and CO. By calculating the air quality sub- index of these six pollutants, the maximum value is taken as the value of AQI. Currently, studies based on the air quality index mainly include ① the spatial and temporal distribution of air pollution, which studies the regional differences in air quality from different spatial scales (e.g., cities (Li, 2016), urban agglomer- ations (Liu & Xin, 2019), provinces (Cao et al., 2020), and countries (Zhang et al., 2020a, 2020b, 2020c)) and the time series characteristics of air quality from tions) (Dong et al., 2020; Liu et al., 2020); ② sources and influencing factors of air pollution (e.g., air qual- ity is affected by natural (Di & Li, 2019), socioeco- nomic (Xu et al., 2019), and comprehensive factors) (Han et al., 2019; Sun et al., 2019; Xu et al., 2017); ③ prediction of future air quality changes through different individual or mixed models (Wang, 2018; Zhao, 2016; Zhu et al., 2020); and ④ study on the correlation between air pollution and the incidence of certain diseases (He, 2018, 2019). In addition, air quality differences have been analyzed based on dif- ferent spatial scales and different series of spatial and temporal scales. The temporal and spatial AQI varia- tion characteristics are mainly studied through cluster analysis (Shen et al., 2017; Zhao et al., 2016), spatial interpolation (Zhao, 2016), spatial autocorrelation (Lin & Wang, 2016; Liu et al., 2018; Yao et al., 2021; Zhang et al., 2020a, 2020b, 2020c), hot spot analysis (Huang et al., 2020), and center of gravity migration (Xiao, 2018). Although the aforementioned studies have conducted in-depth analyses of the air quality in different regions and at different times in China, most of the studies have only analyzed the air qual- ity in local areas of China, ignoring the interaction of air pollutants in different regions and making it diffi- cult to measure the overall level of China’s air quality objectively and comprehensively. Thus, macrocon- trolling the policies and regulations of air pollution control is difficult from the overall perspective. The time scale is relatively short although a few scholars have studied the characteristics of air pollution at the national level, and grasping the overall characteristics of air quality in recent years is difficult. China’s air quality has improved in recent years. However, China is still in its infancy concerning air pollution control. Thus, a timely reflection of China’s recent air quality is conducive to promoting the continuous improve- Studies on large-scale and long-time series of air quality are particularly important to deepen the battle for pollution prevention and control, strengthen regional coordinated control, and elimi- nate heavily polluted weather. Therefore, based on the daily AQI data of major cities in China for seven consecutive years, this study calculates the daily AQI excellence rate, annual average value, quarterly average value, and monthly average value and conducts hot spot, spatial autocorrelation, and mean center migration trend analyses gleaned on a spatial change to understand the temporal and spa- tial variation of air quality index in major cities in China and to reflect the overall variation trend of air quality in China and various regions to pro- mote the coordinated management of air pollution regions. Simultaneously, based on the geographical detector model, the influence of some influencing factors on the change of air quality is considered to provide some theoretical and numerical references China has a vast territory and is geographically located between 73°33′–135°05′ E and 3°51′–53°33′ N. The complex and diverse terrain is high in the west and low in the east. Its climate type is complex, and the monsoon climate is significant. Significant dif- ferences in natural and socioeconomic conditions in different regions have been observed to have a great impact on air quality in different regions. The study regions in Mainland China (data for Hong Kong, Macao, and Taiwan are missing). In addition, the main cities in China (368 in total, some cities have no monitoring stations, and air quality data are missing) are taken as the research objects to analyze the spati- otemporal variation characteristics of air quality from The AQI data in this paper is from China’s Air Qual- ity Online Monitoring and Analysis Platform (https:// www. aqist udy. cn/ histo rydata/), which provides his- torical data queries and analysis starting in Decem- ber 2013. Moreover, China has issued a series of air pollution prevention and control policies (e.g., “Air Pollution Prevention and Control Action Plan,” “Environmental Protection Law,” “Air Pollution Pre- vention and Control Law,” “Three-Year Action Plan to Win the Blue Sky Protection Plan,” and so on) beginning 2013 to promote air pollution prevention and control as well as win the “Blue Sky Protection Plan” (Wang et al., 2019). Therefore, this study was conducted from 1 January 2014 to 28 February 2021. The missing values shall be eliminated if the urban AQI data is missing due to uncontrollable factors, Fig. 1 Distribution of air quality monitoring stations in prefecture-level cities. Note: this map is based on the standard map with the drawing review No. GS (2019) 1825 downloaded from the standard map ser- vice website of the Ministry of the Ministry of Environmental Protection shall be retained for statistical analysis. However, this study mainly selects the daily AQI data of each city for analysis, divided into six grades following the AQI grading standard (Table 1) (Department of Science and Technology Standards, Ministry of Environmen- The natural factors data are from the ERA5-Land monthly mean data set of the European Centre for Medium-Range Weather Forecasts (https:// www. ecmwf. int/). The temporal resolution, the original spa- tial resolution, and the grid is 1 h, 9 km, and 0.1° × 0.1° (latitude and longitude), respectively. The resolution of socioeconomic factor data is 1 km, the unit of GDP data is million, and the unit of population density num- The hot spot analysis tool can be used to calculate the Getis-Ord Gi* statistics for each feature in the dataset. The high- and low-value clustering can be observed using the hot spot analysis. The z-score is statistically significant. For a positive z-score, the higher the value, the closer the clustering of high values (hot spot); for negative z-scores, the lower the value, the tighter the clustering of low values (cold spot) (Tian et al., 2017).",
    "where xj is the attribute value of the elementj , 𝜔 the spatial weight between the element i , andj , n is i,j is The spatial autocorrelation tool mainly calculates the global Moran’s I statistics based on the location of elements and their attribute values. The Moran’s I index value, z-score, and P value will be returned using this tool. The spatial autocorrelation will be measured by evaluating the significance of these indi- ces. Given a set of features and their related attrib- utes, the tool can also be used to evaluate whether the expressed pattern is clustered, dispersed, or random (Liu & He, 2020). Moran’s I statistics of spatial auto- ∑ where zi is the deviation between the element i and its average value xi − X , 𝜔 i,j is the spatial weight between the element i and j , n is equal to the total ( ) number of elements, and S0 is the aggregation of all clustering of elements with high or low values (Gu et al., 2017). The cluster and outlier type fields can be divided into the following four categories: high–high (HH) cluster, low–low (LL) cluster, high–low (HL) cluster, and low–high (LH) cluster with statistical sig- nificance. To some extent, this tool makes up for the deficiency of spatial autocorrelation that ignores the heterogeneity of each unit space. The spatially associ- ated local Moran’s I statistics are as follows: where xi is the attribute of the element i , X is the average value of the corresponding attribute, and 𝜔 i,j The mean center is obtained by calculating the aver- age value of the x- and y-coordinates of all elements in the study area (Ren, 2016). The mean center is conducive to tracking the distribution changes of ele- ments in a certain period and can also compare the differences in distribution changes between different types of elements (Yao, 2019). In this study, the mean center tool can be used to analyze the change char- acteristics of the air quality index from 2014 to 2020 and explore the migration trend of air quality index The geographic detector is a statistical method for detecting spatial differentiation and explaining its driving factors. The differentiation and factor detec- tion used in this paper is used to detect the spatial differentiation of Y and the extent to which factor X explains the spatial analysis of attribute Y. It is meas- ∑ where h = 1,…, L is the stratification of variable X or factor X; Nh and N are the number of units in layer h and the whole region, respectively; and 𝜎2 h and 𝜎2 are the variances of h and Y values of the whole region, respectively. In addition, SSW and SST are the sums of intralayer and total regional variances, respectively Figure 2 shows the trend of the annual AQI average and variance of major cities in China from 2014 to 2020. The study results show that the annual AQI average decreases from 94 to 67. The annual AQI average showed a downward trend from 2014 to 2018, and the annual AQI average reached the low- est, which was 68, in 2018. The annual AQI average in 2019 showed an upward trend compared with that in 2018, but it rapidly declined in 2020. In addition, the annual AQI average reached the lowest value in recent years. The annual AQI variance change showed that air quality is improving while its vola- tility is also decreasing, reflecting a steady improve- ment of air quality in major cities in China. In addi- tion, this paper first makes statistics on the proportion of good AQI days in each city from 2014 to 2020 cities following the air quality index classification standard in Table 1. Furthermore, Fig. 3 shows the results. The proportion of cities with good daily AQI rates between 0.2 and 0.4, 0.4 and 0.6, and 0.6 and quality of most cities in China was observed to have improved significantly. For example, the air pollution index of some cities in Xinjiang in 2014 was heavily polluted, but only one city was moderately polluted by 2020, and the air quality of other cities was lightly polluted or below. In Central and North China, the air quality of most cities changed from lightly polluted to moderately polluted. In 2013, The State Council issued the Notice on Printing and Distributing the Action Plan for Air Pollution Prevention and Control, which issued ten measures for air pollution preven- tion and control. Moreover, the national and local governments at all levels also conducted air pollution prevention and control actions (Luo & Li, 2018). A downward trend in the interannual variation charac- teristics of the annual AQI average was observed in recent years, which also reflects, to some extent, Chi- na’s remarkable achievements in air pollution control In this study, the seasons are divided into spring (March to May), summer (June to August), autumn (September to November), and winter (December to February of the next year). Figure 5 shows that the seasonal AQI variation is significant. The average AQI value in major cities in China in summer is 67, which is the minimum value among the four seasons, indicat- ing that China’s air quality is relatively good in sum- mer. Moreover, the average AQI value in winter is 89, the maximum value among the four seasons, showing that the variance in winter is greater than that in other seasons, indicating that China’s air quality is rela- tively poor with high air quality fluctuation and great variation in winter. Taking North China as an exam- ple, comparing the seasonal average AQI distribution (Fig. 6), urban air quality is moderately and lightly polluted in winter and lightly polluted and moderate in summer. Regularities in the characteristics of sea- sonal changes have been noted. In winter, the Chinese mainland is controlled by the Mongolia–Siberia high pressure, low-level radiation, and air current sinking, which is not conducive to the formation of cloudy and rainy weather. In addition, the ground temperature rap- idly drops in winter, and the upper atmosphere cools less, making the upper and lower parts of the city warm and cold, respectively; the temperature inver- not easy to diffuse. In addition, coal-fired heating in northern regions in winter further exacerbates air pol- lution. Summer is hot and rainy, and the convection is strong, which is conducive to the diffusion of pollut- Figure 7 shows the variation trend of AQI monthly average value from 2014 to 2020. The figure shows that the change of AQI monthly average value roughly presents a U shape. The average AQI values from Jan- uary to April, May, June to August, and September to December show a downward trend, a small increase, continues to show a downward trend, and an upward trend, respectively. The monthly AQI average value in January is the highest at 100. The monthly AQI aver- age value in August was the lowest at 64. The vari- ation trend of AQI variance is similar to that of the average value, but a small peak was observed in June. Thus, the air quality fluctuation has slightly increased, which may be related to the high- and difficult-to- control ozone concentration during summer in China as well as the dusty weather in Northern China. The monthly average AQI distribution depicts that the air quality of most cities in China from June to November is relatively better than that of other months (Fig. 8). For example, the air conditions in North China and Xinjiang have significantly changed. The monthly variation characteristics of air quality are consistent with the seasonal average AQI variation characteris- tics. The weather with serious air pollution is mainly concentrated in January and December, while August The hot spot analysis method can divide the annual AQI average of major cities in China into hot, cold, and non-aggregated areas. In addition, the hot spot analysis of the annual AQI average value from 2014 to 2020 is shown in Fig. 9. The result shows that the cold and hot spot areas show significant aggregation characteristics. China has mainly two hot spot areas, mainly distributed in North China and Xinjiang. The Fig. 4 Distribution of AQI’s annual average value from 2014 to 2020: (a–g) from 2014 to 2020. Note: this map is based on the standard map with the drawing review No. GS (2019) 1825 downloaded from the standard map service website of the Min- istry of Natural Resources Southwest China, while the cold spot area in the northeast is relatively small. According to the distri- bution of hot and cold spots, the air quality in North China and Xinjiang can be inferred as poor, while the air quality in southern China is relatively good. The reason for the hot spots in North China may be related to the fact that the region is mainly dominated by heavy industries such as coal and chemical indus- try, with a large amount of coal combustion and high pollutant emissions. Combined with the dense popu- lation distribution, living and traffic pollution emis- sions, and coal-fired heating in winter further aggra- vates air pollution. The Xinjiang region presents hot spots, mainly due to the dry climate, scarce precipi- tation, and frequent wind and sand activities, which leads to air pollution. At the same time, due to the scarcity of precipitation, there is less purification of pollutants. The sparse vegetation has a weak adsorp- tion effect on pollutants. The southern part of the country presents cold spots probably with the influ- ence of warm and humid air currents in the region, such as ocean currents and southeast monsoon, abundant precipitation, strong atmospheric mobility, strong purification and dilution of pollutants in the air, and better air quality. The air quality in the north- east is better than that in northern China, mainly due to the dense woodlands and wetlands, which have a stronger purification function for pollutants. And the population density in the northern region is relatively low, with less domestic pollutant emissions.",
    "The ArcGIS spatial autocorrelation tool is used to con- duct a spatial statistical analysis of the annual AQI aver- age value in major cities in China from 2014 to 2020 to evaluate whether a spatial autocorrelation exists in the AQI of the whole study area. The analysis results show that the Moran I value is 0.640, which is greater than 0, indicating that the data shows a positive space corre- lation. The P value and z-score are 0.000 and 32.423, respectively, which meet the condition where the P value is very small and the absolute z-value is very large. Therefore, the annual AQI average value from 2014 to 2020 shows a significant clustered distribution. To further explore the spatial relationship in a more fine- grained range, clustering and outlier analysis tools are used to identify the significant hots pots, cold spots, outli- ers, and regions without the statistical significance of the annual AQI average in major cities in China. Cluster and outlier analyses are conducted on the annual AQI average from 2014 to 2020, and the results are shown in Fig. 10. The statistical results showed that high–high clustered areas are hot spots and are mainly concentrated in North China and Xinjiang. Thus, air pollution is difficult to con- trol because it is affected by the level of economic devel- opment, industrialization, population density, and other factors. The annual AQI average value and air quality are high and poor, respectively. The low–low clustered areas are cold spot areas. The annual AQI average value is low and is mainly concentrated in the south and northeast of China. These areas have a superior geographical location, and the monsoon climate brings more rain and better air quality. Moreover, there are roughly three high–low clus- tered areas are mainly distributed near the cold spot area. More low–high than high–low clustered areas, which are mainly distributed around hot spots and are relatively scattered, were noted. Figure 11 shows a certain change in the distribu- tion of the mean center of the annual AQI average in different years. The mean center of the annual AQI average value moved to the northeast, southwest, and southeast direction in China from 2014 to 2015, 2015 to 2016, and 2016 to 2017, respectively. The mean center of the average value moved to the southeast; the mean center of the annual AQI average from 2018 to 2019 moved to the northwest; and the mean center of the annual AQI average from 2019 to 2020 moved to the northwest. In general, the mean centers of the annual AQI average values from 2014 to 2020 are dis- tributed in Sanmenxia City and Luoyang City, Henan Province, China, with a relatively small distance between the mean centers. Simultaneously, this result also reflects that the spatial distribution characteris- tics of air quality conditions are still relatively simi- lar and the regional distribution of relatively good or poor air quality showed little difference between dif- ferent years although China’s air quality conditions In this paper, the geographical detector model is used to quantitatively analyze the influencing fac- tors of air quality change characteristics. Five indi- cators of total precipitation, 10-m u component of wind, 10-m v component of wind, surface pressure, and 2-m temperature are mainly selected for analy- sis. The statistical results were detected based on the monthly average AQI values, total precipitation, 10-m u component of wind, 10-m v component of wind, surface pressure, and 2-m temperature from 2014 to 2020. Table 2 shows that the P value of 2-m tempera- ture was the smallest and passed the significance test, and the q statistic value of 2-m temperature was high compared to other factors at 0.370. Therefore, among these five indicators, the 2-m temperature is the main environmental factor that affects and has a significant impact on air quality. This conclusion is also consist- ent with the significant correlation between tempera- ture and air quality index concluded in previous stud- ies (Han et al., 2019; Sun et al., 2019). Aside from the above five indicators, many other natural and socioeconomic factors affect the change in air quality. This paper mainly focuses on analyzing the spatial China’s complex topography and diverse climate types, with significant differences in topographic and climatic conditions in different regions, have a large impact on the AQI distribution in major cities in China. According to the aforementioned analysis, the poor air quality in the Xinjiang region of China is closely related to low rainfall, dry climate, many mountains, high altitude, and low vegetation cover (Jiang et al., 2020). In contrast, the southern part of China has relatively flat and open terrain, which is conducive to the diffusion of water vapor from the Pacific Ocean, abundant rainfall, high vegetation Winter heating in Northern China is one of the main factors affecting air quality (Liu, 2018; Zhang et al., 2020a, 2020b, 2020c). With less precipitation in winter, pollutants are not easily diffused, polluted weather increases, and air quality decreases. In sum- mer, when more precipitation and higher wind speed exist, pollutants in the air are more easily diffused and measure of population agglomeration, and eco- nomic factors are the most important factors of population agglomeration. The higher the level of economic development, the higher the popula- tion density, the higher the emissions of air pol- lutants, and the lower the air quality (Liu et al., 2022; Wang & Wang, 2017). North China, with the Beijing–Tianjin–Hebei business district, a developed economy with a high population den- sity, is affected by various factors with a relatively poor air quality (Fig. 12) (Cheng et al., 2019; Zhan et al., 2021; Zhao, 2020).",
    "While this study analyzes macro trends in air quality changes in major Chinese cities from 2014 to 2020, it is worth noting that within this time frame, there is an abrupt timing of a full-blown new crown outbreak start- ing in late 2019. In order to reduce the spread of the COVID-19, a series of preventive and control measures have been taken in China. Affected by the epidemic pre- vention and control, the air quality has improved in the short term, mainly because the control measures taken during the epidemic have restricted economic activities, and the reduction of anthropogenic emissions directly promotes the improvement of air quality. However, with the gradual control of the COVID-19 after March, pro- Many environmental policies enacted by the gov- ernment can also have a significant impact on changes in air quality (Fan & Liu, 2020; Li et al., 2019). The air quality in China’s major cities has significantly improved, which is inseparable from the environ- mental protection philosophy advocated in China, from 2014 to 2020. In recent years, with the improve- ment of the level of economic development and the development needs of building a beautiful China, the country and people are focusing increasing attention on the problem of air pollution and are committed to fighting the battle against pollution prevention and in- depth control and striving to build a resource-saving This study analyzes the spatial and temporal variation characteristics of the daily AQI in major cities across China from 2014 to 2020 and draws the following Fig. 8 Distribution of monthly average values of AQI from 2014 to 2020: (a–l) From January to December. Note: this map is based on the standard map with the drawing review No. GS (2019) 1825 downloaded from the stand- ard map service website of the Ministry of Natural Resources (1) From the perspective of temporal variation characteristics, from 2014 to 2020, the number of cities with a daily AQI excellent rate between 0.8 and 1.0 has an overall increasing trend, reaching the maximum in 2020 and accounting for 77% of Fig. 11 Distribution map of the average center of the annual average of AQI from 2014 to 2020. Note: this map is based on monthly averages is a rough U shape, with higher AQI in January and December, which are the peaks of the year, and lower AQI in August and Septem- of 2-m temperature was the smallest and passed the significance test, with the 2-m temperature having a stronger explanatory power on air quality variation (2) From the perspective of spatial variation char- acteristics, the national air quality shows significant clustering characteristics centered on Xinjiang and Northern China, with high annual AQI average values and poor air quality. The southern and northeastern parts of the country have lower AQI values and better air quality. The mean centers of the annual AQI aver- ages from 2014 to 2020 are all distributed within the city of Sanmenxia in Henan Province as well as the city of Luoyang, with a relatively small migration of the mean centers. (3) A geographical detector model was used to analyze the effects of precipitation, wind speed, air pressure, and temperature on air quality changes. The statistical results showed that among these five influ- encing factors, the 10-m v component of wind and the 2-m temperature had higher q-statistics values of 0.424 and 0.370, respectively. However, the p value One of the reasons why the scope of the study chosen for this paper is the major cities in China is because the fight against air pollution is not for a single city or region nor is it short-lived, but long-lasting and requires all regions of the country to work together and act for the cause of environmental protection in China. After air pollution is generated, it will spread to the surrounding areas, mak- ing the scope of the pollution expand. Therefore, cities should work together to tackle the air pollution problem and jointly prevent and control air pollution with inte- grated planning and management. Although China’s air quality has significantly improved in recent years, China’s air pollution control still has a long way to go in the context of building a beautiful China, deepening improvement in air quality. Thus, this paper puts forward the following suggestions for air pollution control. First, new rules on environmental protection should be prom- ulgated; laws and regulations to regulate and strictly punish the emission of pollutants over the standard should be formulated; and government resources alloca- tion should be rationalized; and environmental protec- tion investment, pollution control, and so on should be increased. Second, economic and technological factory enterprises should upgrade their industries; develop new environmental industries, services, and so on; learn to introduce advanced foreign technology; and learn new methods and means of air pollution control. Third, soci- ety should strengthen the propagation of environmental protection concepts; popularize environmental protec- tion policies to the public; raise people’s awareness of environmental protection; establish the development concepts of innovation, coordination, green, openness, and sharing; and commit to building a resource-saving In this paper, the spatial and temporal characteristics of air quality conditions were studied using nationwide long time series of AQI data. Thus, the AQI changes in different time scales were revealed more compre- hensively. Moreover, providing some theoretical and numerical help for the management of air pollution in China is beneficial. Due to the long time and large spa- tial scale of this paper, resulting in a huge amount of data, simple quantitative and qualitative analyses of the influencing factors were mainly conducted. In future studies, more actual data can be combined to further develop the study of the influencing factors of air pol- Author Contribution Data download and analysis, J. C.; data analysis, visualization, F. L.; analysis of influencing fac- tors, analysis of results, L. L. and L. C.; writing original draft, J. C. and F. L.; conceptualization, methodology, supervi- sion, H. J. and L. C. All authors read and approved the final"
]