[
    "Received: 17 October 2022 / Accepted: 17 February 2023 / Published online: 27 February 2023 ©The Author(s), under exclusive licence to Springer-Verlag GmbH Germany, part of Springer Nature 2023 In order to cope with global warming, China has put forward the “30 - 60” plan. We take Henan Province as an example to explore the accessibility of the plan. Tapio decoupling model is used to discuss the relationship between carbon emissions and economy in Henan Province. The influence factors of carbon emissions in Henan Province were studied by using STIRPAT extended model and ridge regression method, and the carbon emission prediction equation was obtained. On this basis, the standard development scenario, low-carbon development scenario, and high-speed development scenario are set according to the economic development model to analyze and predict the carbon emissions of Henan Province from 2020 to 2040. The results show that energy intensity effect and energy structure effect can promote the optimization of the relationship between economy and carbon emissions in Henan Province. Energy structure and carbon emission intensity have a significant nega- tive impact on carbon emissions, while industrial structure has a significant positive impact on carbon emissions. Henan Province can achieve the “carbon peak” goal by 2030 years under the standard and low-carbon development scenario, but it cannot achieve this goal under the high-speed development scenario. Therefore, in order to achieve the goals of “carbon peaking” and “carbon neutralization” as scheduled, Henan Province must adjust its industrial structure, optimize its energy consumption structure, improve energy efficiency, and reduce energy intensity. Keywords Tapio decoupling model - STIRPAT model - Ridge regression - Carbon emission forecast - Scenario analysis - Henan Province In recent years, abnormal climate change has brought great challenges to human daily life and economic development (Espoir and Sunge 2021). For example, Velicogna | et al. (2006) found that the melting of the Greenland ice sheet 1 caused an annual rise in sea level of 0.5 + 0.1 mmyear~ between 2002 and 2006, which posed a huge threat to the production of residents in coastal cities and islands. Tom K et al. (2018) found that global warming would make the world economy face a potential loss of $9.59371 trillion. O'Neal E T (2014) believed that climate change would cause political instability in developing countries and lead to rising food prices, riots, revolutions, and other situations. Fox DM et al. (2018) believed that global warming would increase the burning area of forests. Malikov Emir et al. (2020) con- cluded that climate change will reduce crop yields and cause economic losses. At the same time, the economic development of various countries has become increasingly difficult because of the continued prevalence of COVID-19 worldwide. Obviously, economy is not only the main cause of environmental prob- lems, but also the essential basic condition for solving envi- ronmental problems. Only in a certain natural and social environment can economic development proceed rapidly. Due to the excessive use of natural resources and the uncon- trolled emission of carbon dioxide and other greenhouse gases, the earth has been irreversibly damaged, which has prompted countries to gradually move towards the road of developing a “green economy”’. It has become a general con- sensus of the international community to achieve economic recovery through green low-carbon development (Nations U 2015; Nations U U 2015). More and more countries are engaged in the cause of “carbon peak” and “carbon neutral- ity” (Zhao 2022b). China has been actively and forcefully addressing climate change and fulfilling the responsibilities of a major coun- try. In addition, China promised to implement the “30 - 60” plan at the United Nations General Assembly, which is the national action plan for the green transformation of energy, and strive to achieve “carbon peak” by 2030 and “carbon neutral” by 2060. At the national two sessions in 2021, the Party Central Committee included “carbon peaking and carbon neutralization” in the government work report and clearly incorporated “carbon peaking and carbon neutraliza- tion” into the overall layout of ecological civilization con- struction (Wu et al. 2022). As a major province of population, agriculture and indus- try in China, the energy consumption intensity of Henan Province in recent years is much higher than the national average level, and its carbon emissions are also gradually increasing with the economic development (Cai et al. 2022). Therefore, it is necessary to study the current situation of the relationship between carbon emissions and economy in Henan Province and the relationship between carbon emis- sions and various social factors (demographic factors, eco- nomic factors, etc.). After knowing the current situation of the relationship between carbon emissions and economy, and the relationship between carbon emissions and various social factors, Henan Province can have a deeper under- standing of its own situation, and implement measures to control carbon emissions according to specific factors, so as to contribute to the realization of the “30 - 60” plan in China. This paper uses Tapio decoupling model to explore the relationship between carbon emissions and economy in Henan Province from 2000 to 2019 and then uses STIRPAT expansion model to study the influencing factors of carbon emissions in Henan Province and predict its carbon emis- sions from 2020 to 2040.",
    "The data used in this paper are from the statistical yearbook of Henan Province and the data of the National Bureau of statistics. Since the Statistics Bureau of Henan Province has not pub- lished the carbon dioxide emission data, this paper obtains the following carbon emission measurement formulas related to this study by consulting the IPCC carbon emission calcu- lation guidelines and China emission accounts and datasets and combining the national conditions (IPCC 2014): where EC; is the energy consumption; CCS; refers to the energy conversion coefficient of standard coal; SC; refers to the amount of standard coal corresponding to energy; MLCV; is the average low calorific value of energy; CC; is the carbon content per unit calorific value; COR; is the carbon oxidation rate of energy; CDEC; refers to carbon dioxide emission coefficient; and i refers to energy type (Dong and Li 2022). The standard coal coefficient and carbon dioxide emission coefficient of different energy sources are shown in Table | (see the attached draft for the description of the table). If there is a year with missing statistical data, or the statis- tical data is obviously abnormal compared with the previous and subsequent years, but there is no obvious basis, its car- bon emissions will be corrected by the following methods: where CE,,; is the carbon emission of the ith energy in the correction year; CE, ; is the carbon emission of the ith energy in the reference year; and agr is the average annual growth rate of carbon emission. Correction means that assuming that the growth rate of carbon emission remains unchanged, the carbon emission in the correction year is calculated based on the emission in the reference year (Guan et al. 2021). Carbon emission intensity refers to the carbon emissions per unit of GDP growth. This indicator is mainly used to measure the relationship between economy and carbon emis- sion. The calculation formula of carbon emission intensity is as follows: To sum up, the energy data of Henan Province are calcu- lated and processed by using the above formula in combi- nation with Table 1, and the consumption, carbon dioxide emissions, and total carbon emissions of various energy sources converted into standard coal in Henan Province from 2000 to 2019 can be obtained. At present, the development of the world economy will inevitably lead to the emission of carbon dioxide, and the study of the relationship between the two has been attracting the attention of scholars at home and abroad. At present, the main methods to study the relationship between economy and carbon emissions are the carbon emission environment Kuznets curve (EKC) model, which focuses on the long- term development trend of carbon emissions and economy, and the decoupling model, which focuses on the short-term changes of the two. EKC was put forward by Grossman and Krueger in 1995, and studies such as Tan et al. (2015) and Usama Al-mulali et al. (2015) support this view. However, some scholars still questioned it (Io and Aa 2010; Vo et al. 2019), and Munir Q et al. (2020) proved that the causal rela- tionship between EKC curve and CO), EC, and GDP is mis- leading. Because the EKC curve is misleading, decoupling analysis is now considered to be the best method to study the relationship between carbon emissions and the economy (Dong et al. 2016). between Economic Growth and Environmental Impact” released in 2002 to study the relationship between envi- ronmental pollution and economy. Later, Petri Tapio (2005) built the “Tapio decoupling model” by introduc- ing the elastic method, and subdivided the decoupling state into eight states, such as strong decoupling and weak decoupling. However, the above article only uses the decoupling the- ory to analyze the decoupling relationship between carbon emissions and economy, and cannot show the reasons for the change of decoupling status. At present, the main methods to study the factors affecting carbon emissions are structural decompression analysis (SDA) and index decompression analysis (IAD). The data used for the two methods are the input-output table and part of the total data. Therefore, IAD has lower data requirements, simpler operation, and wider application range. IAD is mainly divided into logarithmic mean Laspeyres index (LMLI) and logarithmic mean divi- sion index (LMDJ) (Zhang and Wang 2021). Among them, LMDI can solve the problem of zero value and residual in the decomposition process, so many scholars will use LMDI to deeply study the factors affecting the decoupling state when studying the decoupling relationship between econ- omy and carbon emissions (Ang et al. 2015).",
    "Based on the Tapio decoupling model and LMDI decom- position method, Wang Z and Yang L (2015) explored the decoupling relationship between industrial growth and envi- ronmental pressure in the Beijing-Tianjin-Hebei (BTH) eco- nomic belt from 1996 to 2010. The study showed that energy structure and energy intensity made a great contribution to industrial decoupling, and there was no obvious trend in industrial structure. Zhao Xiaochun et al. (2022a) studied the relationship between China’s carbon emissions and eco- nomic development from 2009 to 2019. The study showed that population size and economic intensity can inhibit the decoupling of carbon emissions, while energy intensity and carbon intensity have a positive effect. At present, the main carbon emission prediction methods can be roughly divided into three categories: (1) Describe the carbon emission trend through EKC model, and predict the peak value of carbon emissions according to whether there is an inflection point. (2) After determining the influencing factors of carbon emissions, the future development of car- bon emissions is predicted and analyzed in combination with the scenario analysis method. The models for decomposing the influencing factors of carbon emissions mainly include LMDI, IPAT, and Stochastic Impacts by Region on Popula- tion, Affluence, and Technology (STIRPAT). (3) The car- bon emissions are directly predicted and analyzed through system modeling methods, including computable general equilibrium (GGE) and gray system prediction method. Liu H et al. (2018) explored the relationship between the environmental conditions and economic development of Japan, South Korea, and China through the EKC curve and studied the development trend of their economic develop- ment and ecological footprint. Awaworyi C S et al.’s (2018) study found that there are many relationships between econ- omy and carbon emissions. Zhong Mao-chu et al. (2010) found that the EKC curve theory has serious defects, such as random selection of indicators and weak interpretation of the model. Therefore, the application should carefully consider and use this method to predict carbon emissions. Ehrlich and Holdren proposed the IPAT model in the 1970s to study the impact of population, economy, and tech- nology on environmental pressure. However, it assumes that the influence factors and environmental pressure are propor- tional changes, so it is more troublesome to use. Later, Dietz et al. (1997) revised it and proposed the STIRPAT model. Zhang C et al. (2019) based on the scenario analysis method and STIRPAT model, discussed the trend of China’s future carbon emissions from the perspective of the industry. The study showed that China may achieve the carbon peak in 2030, and the key task of future carbon emissions reduction is to implement more strict industrial and energy structure transformation policies. Cui L et al. (2019) explored the relationship between China’s carbon emissions and energy consumption by building a CGE model. Li F et al. (2018) used the improved IPAT model to calculate China’s carbon emission intensity and then further used the gray correlation model to predict carbon emissions in 2030. The study found that if China’s total GDP is less than 151,426.15 billion yuan in 2030, it is possible to achieve the carbon peak. From the perspective of research methods, STIRPAT model combined with scenario analysis method is the cur- rent mainstream carbon emission prediction method, which can combine policy requirements to explore the change trend of carbon emissions in different scenarios and help research- ers judge which scenario is the most appropriate. This paper uses the Tapio decoupling model to judge the relationship between carbon emissions and economic development in Henan Province from 2000 to 2019, and then combines Kaya identity and LMDI decomposition to explore the root causes of the relationship between them, so as to better understand the deep-seated reasons for the transformation of the relationship between carbon emis- sions and economic development in Henan Province. “Decoupling” means that in economic development, the total energy consumption of materials increases with the growth of the total economic volume at the initial stage of industrial development. However, when the economy and technology develop to a certain level, the total energy consumption of materials shows a downward trend, but the economy still shows a growth trend (Rajabi Kouyakhi 2022). Because Tapio decoupling model has the following characteristics: (1) It focuses on the changes of individu- als in different years. (2) It has 8 decoupling states: strong decoupling, weak decoupling, declining decoupling, extended connection, declining connection, weak nega- tive decoupling, expanded negative decoupling, and strong negative decoupling (Zhang et al. 2022a). At the same time, we combine the advantages, disadvantages, and char- acteristics of the corresponding methods introduced in the literature review. We decided to explore the relationship between economic development and carbon emissions in Henan Province by combining it with LMDI.",
    "where € refers to the decoupling index between carbon emis- sions and GDP from year 0 of the start (study start) to year t of the end (study end); C, and Cy refer to the carbon emis- sions in the start year and the end year, respectively, i.e., environmental pressure; Y) means GDP in the starting year; Y, is the GDP of the end year; and AC% and AY% represent the increase rates of carbon emissions and GDP in the begin- ning and end years, respectively (Xu et al. 2021) (Table 2). _. This paper combines Kaya identity, LMDI decomposition, and Tapio decoupling model to build a decoupling model for car- bon emission intensity effect, energy structure effect, energy intensity effect, economic level effect, and population effect of carbon emissions (Guo et al. 2021). The decoupling model is constructed as follows: In conclusion, the decoupling elasticity between carbon emissions and GDP growth can be decomposed again (Xiong et al. 2022), as follows: where C represents carbon emissions; C; refers to the carbon emission of the ith energy; E; refers to the consumption of the ith energy (which has been converted into standard coal in this paper; E, GDP, and P refer to the total energy consumption, GDP, and permanent population, respectively; C/; refers to the carbon emission intensity effect of the ith energy; ES; refers to the energy structure effect of the ith energy; EJ means energy intensity effect; G refers to economic level effect; and P is the population effect (Liu et al. 2022). zis essentially the carbon dioxide emission where CI; = coefficient of various energy sources, so this value does not change with time, so it is 0 after taking the logarithm. There- fore, the formula can be simplified to formula (12): It is assumed that the total carbon emissions in the start year and the end year are Cy and C,. At this time, the change of total carbon emissions within 2 years can be set as AC. According to formula (7), AC can be decomposed into ACG, ACgs, ACg, ACg, and ACp. Therefore, the formula can be converted into: The decoupling status between economic growth and carbon emissions in Henan Province from 2000 to 2019 and the elastic coefficients of the four impact effects are obtained after calculating the indicators in combina- tion with the decoupling model formula (see Table 3 for details). AC = C, = Cy = DY) Ch, X ES, X El, XG, X Py =)\" Cli X ESip X Ely X Go X Po ES, refers to the energy structure effect of the ith energy; EI means energy intensity effect; G refers to economic level effect; and P stands for population effect. where AC factors are calculated in a similar way. Due to space reasons, this article only shows AC, calculation method: effect of Henan Province has a significant inhibitory effect on Tapio elasticity coefficient, which indicates that Henan Province should pay attention to high-quality economic development rather than blindly developing economy in order to achieve “carbon peak” and “‘carbon neutral”. ince is a populous province. Therefore, Henan Province should publicize the concept of eugenics to the public and control the blind growth of population while culti- vating high-quality talents. After knowing the current situation of decoupling between carbon emissions and economic development in Henan Province, in order to understand the future development trend of carbon emissions in Henan Province, this paper uses STIRPAT model to predict three development scenarios in Henan Province from 2020 to 2040: high-speed development scenario, standard development scenario, and low-carbon carbon carbons emissions. with the development characteristics (Yuan et al. 2022), the STIRPAT model for carbon emission prediction in Henan Province is constructed by selecting passenger turnover (PT), total output value of agriculture, forestry, animal husbandry and fishery (TOV), energy structure (coal, ES), industrial structure (proportion of the secondary industry, IS), energy intensity (EI), carbon emission intensity (CED, urbanization rate (UR), and per capita GDP (PCGDP). In order to facilitate calculation and data analysis, the model equation is transformed into a linear equation, and the model expansion formula is (Huang et al. 2022): STIRPAT model is an extension of the classical model IPAT model, which believes that environmental pressure is the result of the joint action of population size, economic devel- opment, and technological progress (Liu and Han 2021). At present, this model is widely used to study the influencing factors and trend prediction of environmental pollution (Ma et al. 2022). The basic form of the model is: In this paper, the common least square method is used to estimate each variable to judge whether there is multi- collinearity between I and PT, TOV, ES, IS, EI, CEI, UR, and PCGDP (see Table 4 for test results of collinearity of STIRPAT model).",
    "where / represents environmental pressure; P represents demo- graphic factors; A represents wealth factors; and T represents technical level. a is the model coefficient; b, c, and d are the elasticity coefficients of population, wealth, and technology, respectively; and ¢ is the error term (Zhang et al. 2022b). It can be seen from Table 4 that the VIF values of all variables are greater than the maximum tolerance of 10, indicating that there is serious multicollinearity between explanatory variables, and the reliability of the regression coefficient of the common least square method is low, which cannot effectively explain the carbon emission factor. In order to ensure the validity of the model estima- tion results, ridge regression is used for fitting. Based on the relevant data of Henan Province from 2000 to 2019, SPSS 25 is used for ridge regression modeling. Taking 0.02 as the unit length and the ridge regression coeffi- cient K between 0 and 1, the equation, ridge trace, and R corresponding to different ridge parameter K values are obtained. The smaller the ridge regression parameter K value, the less information the sample data loses, and the higher the model accuracy. According to the change of ridge trace diagram, when K=0.30, the coefficient gradually tends to be stable. After adjustment, R? reaches 0.938. The equation fitting is good. By testing the variance of simulation, it can be seen that F = 36.69, SigF = 0.000 < 0.01, indicating that the equa- tion has statistical significance. The final ridge regression equation of carbon emission in Henan Province is: It can be seen from the coefficient table attached that the degree of impact of each indicator variable on car- bon emissions in Henan Province is in descending order: industrial structure (0.307); total output value of agricul- ture, forestry, animal husbandry, and fishery (0.221); per capita GDP (0.207); urbanization rate (0.203); passenger turnover (0.199); energy structure (0.016); energy inten- sity (— 0.013); and carbon emission intensity (— 0.013), of which only energy structure and carbon emission intensity have a negative impact. This paper brings the data into the model to calculate the predicted value, and compares it with the actual value to verify the prediction accuracy of the model, as shown in Fig. 2. It can be seen visually that the simulated value is very close to the historical actual value, indicating that the model fitting effect is very good, and the remaining analysis can be carried out. The scenario analysis is set according to the development policies and historical data of Henan Province. See the attached draft for the setting basis. Here, we set three development scenarios considering the economic develop- ment stage, industrial structure, and energy consumption structure of Henan Province. According to the “30 60” plan and national development strategy, the time is divided into 2020-2025, 2026-2030, 2031-2035, and 2036-2040. The predicted value of each variable from 2020 to 2040 is obtained from the set parameters. After logarithmic pro- cessing, the predicted value is brought into the above fit- ting equation of carbon emissions in Henan Province based on STIRPAT model to obtain the predicted value of future carbon emissions in Henan Province. Standard development scenario: all indicators are car- ried out at the current set speed, with moderate speed of industrial structure adjustment, energy structure optimiza- tion, and energy intensity adjustment. High-speed development scenario: the adjustment of industrial structure is slow, and the decline of secondary industrial structure with high carbon emissions is slow. In the energy structure, the proportion of coal decreases slowly; Slow decline of energy intensity; Etc. Low-carbon scenario: the industrial structure has been adjusted rapidly, and the energy consumption level and energy intensity of key high carbon industries have decreased significantly. development, the carbon emissions of Henan Province will increase from 2020 to 2035, and will not become stable and show a slow downward trend until 2035. (4) The high-speed development scenario focuses on economic development, and the control of carbon emissions is not strong enough to reach the “carbon peak” goal by 2030. (5) The low-carbon develop- ment scenario focuses on the development of green economy, and the economic growth is relatively slow. Staying in this scenario is not conducive to economic development. (6) The standard development scenario not only focuses on energy conservation and emission reduction, but also develops the economy, and the two are in a balanced state of development.",
    "Based on the parameters of each variable under three differ- ent scenarios, the STIRPAT model is used to fit and predict the carbon emissions of Henan Province from 2020 to 2040. The results are shown in Fig. 3. From Fig. 3, we can see that (1) the low-carbon develop- ment scenario has reached the inflection point of the carbon peak. If Henan Province develops according to the low-carbon development scenario, the carbon emissions will continue to decline, and will achieve the goal of “carbon neutrality” by 2060; that is, the carbon emissions and carbon emission reduction in Henan Province will be offset positively and negatively. (2) Under the standard development scenario, the carbon emissions of Henan Province will change from growth to stability around 2020 and begin to show an obvious down- ward trend around 2030. (3) Under the scenario of high-speed This paper combines Tapio decoupling model, Kaya identity, and LMDI decomposition model to explore the decoupling relationship between carbon emissions and economic growth in Henan Province from 2000 to 2019. The influencing factors of carbon emissions are decom- posed into five effects: carbon emission intensity effect, energy structure effect, energy intensity effect, economic level effect, and population effect, so as to explore the driving factors of carbon emissions. In order to explore the carbon emission trend of Henan Province from 2020 to 2034, this paper constructs the STIRPAT model and sets up three development scenarios (high speed, standard, and low carbon) to simulate and predict the carbon emis- sion of Henan Province in combination with the scenario analysis method. Zhang P and He J et al. (2017) in terms of the impact of energy intensity, carbon emission intensity, population and other factors on carbon emissions, and the predic- tion results of carbon emissions and carbon peaks. In order to make Henan Province achieve the goals of “car- bon neutralization” and “carbon peak” as soon as possible, and find out a suitable green development path, based on the above research conclusions, this paper puts forward the following suggestions and measures: In 2019, coal consumption in Henan Province accounted for 66.6% of the total energy structure, while new energy such as natural gas accounted for a relatively low proportion. According to the research of Tapio decoupling model, opti- mizing the energy structure can make Henan Province move towards a strong decoupling state—the optimal development state. Therefore, Henan Province should actively optimize the energy structure, vigorously promote the measures of energy conservation and emission reduction, and push the energy supply to the direction of diversified development. It is mainly to control the total consumption of fossil energy such as coal and strive to increase the proportion of new energy such as natural gas and wind energy, encourage the use of new energy vehicles, and add wind power and photo- voltaic power generation machines. According to the results of STIRPAT model, the indus- trial structure of Henan Province has a positive relation- ship with carbon emissions, and the secondary industry of Henan Province is the main industry of coal consumption. Therefore, in order to achieve the goals of “carbon peak- ing” and “carbon neutralization”, Henan Province should reduce the proportion of the secondary industry. Henan Province should transform from a traditional agricultural and industrial province to a cultural and tourism province, such as use technical means to integrate into the innova- tive development model; combine nature, humanity, and VR and AR technologies; and create a distinctive cultural tourism brand; develop creative products that people like to see and enjoy in various links such as food, housing, transportation, travel, shopping, and entertainment to The urbanization rate has a positive impact on carbon emissions, and Henan Province plans to reach 60% of the permanent population by 2025, which will further lead to an increase in carbon emissions. In order to realize the win-win situation of “carbon peak”, “carbon neutralization’, and urban planning in Henan Province, Henan Prov- ince should build a new type of green city, so that people can have a high-level and high-quality urban life and accept green life to reduce carbon emissions. Rely on innovative elements such as science and technology, knowledge, human resources, culture, and system to drive development and improve the quality of the citizenization of the agricultural transfer population, enhance the comprehensive carrying capacity of central cities and urban agglomerations, and optimize the allocation of resources, and promote the construction of new urbani- zation with county towns as an important carrier.",
    "Henan Province should strengthen the research and development of clean energy alternative technologies, renewable energy technolo- gies, and new energy technologies, so as to improve the energy utilization rate of enterprises, meet the decomposition and emission reduction requirements from the production chain to the whole use cycle, ensure the transformation effect, and reduce excessive waste of resources. This can not only reduce carbon emissions, but also ensure the rapid economic growth of Henan Province. Henan Province can collect the carbon dioxide produced by industry, and use its characteristics of promoting plant growth, absorbing a large amount of heat, and copolymeriza- tion with epoxides to convert it into harmless and beneficial products such as carbon fertilizer, dry ice agent, and new synthetic materials by using clean technology, so as to real- ize the utilization of waste gas. At present, China has begun to gradually implement the devel- opment goal of carbon emission allocation and has estab- lished Beijing carbon emission exchange and Shanghai carbon emission exchange. Henan Province should also establish a car- bon emission exchange, formulate the carbon emission quota of each unit, publish the relevant information of the carbon emission trading market, and strengthen the risk control and internal supervision and management of trading activities to standardize the carbon emission trading between enterprises in Henan Province, which can not only curb the phenomenon of enterprises’ random emission of exhaust gas, but also further promote the economic development of Henan Province. Author contribution “Decoupling relationship between carbon emis- sions and economic development and prediction of carbon dioxide emissions in Henan Province: Based on Tapio method and STIRPAT model” is the result of the joint efforts of the three of us, so after dis- cussion, we decided to publish this article as the co first author. Data availability The datasets generated during and/or analyses during the current study are not publicly available due to [REASON(S) WHY DATA ARE NOT PUBLIC] but are available from the corresponding author on reasonable request. Ethical approval This article does not involve human participants or animal research. There is no behavior that does not conform to the ethical standards. Consent to participate All authors agree with the contributions of each author in this article, and there is no dispute."
]