[
    "Chenkai Zhao1 & Ying Sun1 & Yaping Zhong1 & Senhao Xu1 & Yue Liang1 & Shu Liu2 & Xiaodong He3 & Jinghai Zhu1 & Takayuki Shibamoto4 & Miao He1 Received: 1 September 2020 /Accepted: 6 May 2021 / Published online: 14 May 2021 # The Author(s), under exclusive licence to Springer Nature B.V. 2021 Air pollution control has become the top priority of China’s “green development” concept since 2013. The Chinese government has enacted a range of policies and statutes to control contaminant emissions and improve air quality. On the basis of the national air quality ground observation database, the spatial and temporal distribution of air quality index value (AQI), fine particulate matter (PM2.5), coarse particles (PM10), sulfur dioxide (SO2), nitrogen dioxide (NO2), carbon monoxide (CO), and ozone (O3) were explored in 336 cities throughout China from 2014 to 2019. AQI and most pollutants (except O3) decreased in concentra- tions from 2014 to 2019. In 2019, all cities except Henan reached the level 2 of the ambient air quality index, and six cities had a lower ambient air quality index and reached the level 1. Spatially, higher pollutant concentrations were concentrated in large city clusters, whereas the areas with high O3 concentration were found across the country. Furthermore, central heating was shown to have a negative impact on air quality. The observed AQI value, PM2.5, PM10, SO2, NO2, and CO concentrations were highest in north and northwest China and Henan province in central China. The correlationsamong pollutants suggest that the main sources of pollutants are fossil fuel combustion, industrial production, and motor vehicle emissions. The influence of meteorological factors on air quality, long-distance transportation, and the transformations of pollutants should be explored in future research. It has been widely demonstrated that particulate matter (PM) and gaseous pollutants in the atmosphere can enter the human body through the respiratory system, digestive system, or oth- er channels and subsequently affect health. Coarse particles (PM10) and fine particulate matter (PM2.5) increase the risk of respiratory diseases, such as chronic obstructive pulmonary diseases (COPD) (Huang et al. 2019), asthma (Alotaibi et al. 2019), bronchitis, and lung cancer. Gaseous pollutants, such as sulfur dioxide (SO2), could increase the risk of cardiovas- cular disease (Yap et al. 2019). Moreover, ozone (O3) is asso- ciated with adverse cardiovascular effects (Xia et al. 2018) and could increase daily mortality rates (Yin et al. 2017). Rapid industrialization, urbanization, and rural moderniza- tion in recent years have caused severe air pollution in China. Many cities are facing serious environmental problems. In the first quarter of 2013, China suffered from persistent and se- vere air pollution (Huang et al. 2014). Therefore, the Chinese government adopted a series of measures to improve air qual- ity. In September 2013, the Air Pollution Prevention and Control Action Plan (APPCAP) was disseminated. The goal of this plan was to improve air quality in heavily polluted environments (Huang et al. 2018). In January 2015, the envi- ronmental protection law, regarded as an important milestone in China’s air pollution prevention and control, was officially implemented (Song et al. 2017). In 2016, China joined the Paris Agreement on climate change and promised to reduce hazardous emissions from coal-fired power plants by 50% by 2020, establish automatic real-time air quality monitoring systems,developnewenergytechnology,andpromoterenew- able energy policies (Tambo et al. 2016). In December 2016, China issued the thirteenth 5-year eco-environmental protec- tion plan, which promised that SO2 and carbon monoxide (CO) concentrations in prefecture-level cities will reach the standard by 2021, whereas the PM and nitrogen dioxide (NO2) concentration would be significantly decreased (Ministry of Ecology and Environment of the People’s Republic of China 2012). In 2018, China enacted the environ- mental protection tax law to raise awareness of environmental protection within Chinese society (The National People’s Congress of the People’s Republic of China 2018). pollutants in China have several limitations. One issue is that several studies are limited to a short experimental period. For example, Li (Li et al. 2019) examined air pollution data for 2015–2016 and applied path analysis to reveal that tempera- ture, wind speed, and precipitation were major factors affect- ing air pollutant concentrations. Another issue is that several studies onlyfocus ona singlefactor. Forexample,Zeng (Zeng et al. 2019) used observations from national air quality sta- tions to analysis the spatial-temporal variation of pollutants and found that the SO2, NOx and PM concentrations de- creased, but the O3 concentration increased. Moreover, China has been shown to be in transition from SO2-dominated to NOx- and O3-dominated air pollution. Analyses with larger study area have also been reported. Fan (Fan et al. 2020) conducted a study on the spatial and temporal variations of the six criteria pollutants (PM2.5, PM10, SO2, NO2, CO, and O3) in 300 cities during 2014–2018 and found that PM, SO2, NO2, and CO concentrations decreased significantly. Meanwhile, the North China Plain and Central-Western Xinjiang were the areas identified to be the most seriously polluted.",
    "China is a vast country with various disparities in areas such as economic development, climate type, landform, and resource endowment. These phenomena have resulted in large differences in pollution levels among the provinces and across the seasons (Cui et al. 2019; Lu et al. 2019; Yao et al. 2019). Furthermore, extremely low winter temperatures in the north- ern region have led to a strong demand for central heating, which could be an important source of air pollution in winter. To explore the spatial and temporal variations characteristic of air pollution in China in the present study, air pollutant con- centration data for 336 prefecture-level cities in China were examined for the 2014–2019 period. The purposes of our investigation were to (1) observe the trends in variation of the air quality index (AQI) value and PM and gaseous pollut- ant concentrations, (2) elucidate the discrepancies in the spa- tial distributions of AQI values and air pollutant concentra- tions, (3) compare the effects of different heating methods on air quality, and (4) analyze the major sources of air pollution in China. We intend to provide some comprehensive To evaluate the overall air quality status in China, we an- alyzed ambient monitoring data of PM2.5, PM10, SO2, NO2, CO, and O3 in 336 prefecture-level cities from January 1st, 2014, to December 31st, covering 31 prov- inces, autonomous regions, and municipalities in mainland China (except Hong Kong, Macao, and Taiwan). To pres- ent the regional variation of air quality, the 31 provinces were divided into 7 regions based on their natural geo- graphical characteristics, i.e., Central, East, North, Northeast, Northwest, South, and Southwest. The cities, regions, and their location were illustrated in Fig. 1. According to the heating requirement, the government divides China into a central heating area and a non-central heating area by the Qinling Mountains-Huaihe River Line (Fig. S1). The heating season usually lasts from late au- tumn to early spring in central heating area. To estimate the air pollution caused by heating emissions, 14 cities were selected as the sample cities, with 7 located in the central heating area and the rest located in the non-central heating area. The sample cities are selected based on the following criterions: (a) The cities are well known in each region; (b) the cities can represent the meteorology distribution char- acteristic of each region; (c) the cities are the reprehensive of different levels of average pollutant concentrations in China; and (d) each geographical area has 2 sample cities. The names of sample cities were listed as follow: Beijing and Shijiazhuang in the North region, Shenyang and Changchun in the Northeast region, Shanghai and Nanjing in the East region, Zhengzhou and Wuhan in the Central region, Guangzhou and Haikou in the South re- gion, Chengdu and Chongqing in the Southwest region, and Xi’an and Urumqi in the Northwest region. Details about 14 sample cities were shown in Table S1. Daily AQI value and the real-time hourly concentrations of PM2.5, PM10, SO2, NO2, CO, and 8-h averaged peak O3 (8-h O3) were downloaded from the website of Ministry of Ecology and Environment of the People’s Republic of China [http://113.108.142.147:20035]. Since the new tech- nical regulation for ambient air quality index (HJ633- 2012) (Ministry of Ecology and Environment of People’s Republic of China 2012) has been executed, the air quality data of six criteria pollutants at individual monitoring site for major cities have been published through the website. To date, the monitoring sites have covered Mainland China, while the data of six criteria pollutants in 161 cities were lacked from January 1st, 2014, to December 31st, 2015 because many monitoring sites had not been established before 2015. According to the technical regu- lation (HJ633-2012), AQI is divided into six levels. The degree of air quality was graded on the following scale: 1, excellent; 2, good; 3, mild air pollution; 4, moderate air pollution; 5, heavy air pollution; and 6, severe air pollu- tion. “Excellent” was defined as AQI from 0 to 50; “good” was defined as AQI from 51 to 100; “mild air pollution” was defined as AQI from 101 to 150; “moderate air pollu- tion” was defined as AQI from 151 to 200; “heavy air pollution” was defined as AQI from 201 to 300; and “se- vere air pollution” was defined as AQI more than 300.",
    "We first calculated the annual average value or concentrations of AQI and six criteria pollutants (PM2.5, PM10, SO2, NO2, CO, and O3) for the whole country, the seven regions, and the 31 provinces. Analysis of variance (ANOVA) was used to compare the differences in annual average concentrations on the countrywide and seven regional scales. Tukey HSD was used for multiple comparison. Based on the daily AQI values and six criteria pollutants concentrations of each city, a series of time-series boxplots were drawn to describe their temporal distribution. In order tobetterpresent the datadistributionand probability density,a violin chart was superimposed on each month’s box charts. A fitting line, which reflects the trend of these values over time, was added to each plot. The fitting method was generalized Subsequently, the annual average concentrations of six criteria from the 31 provinces were used to draw a series of statistical maps to describe the spatial distribution over time. The annual scale was unified to better present the variation trends in air quality. To investigate the impact of heating emissions on air qual- ity, the Levene’s test for the homogeneity of variance was used first in 14 selected sample cities, after which a multivar- iate analysis of variance (MANOVA) was used to analyze the influence of heating method (with or without central heating) and heating period (heating period and non-heating period) on air quality. Finally, a two-sample t-test was performed in 14 cities. The results were presented in a bar-plot with error bar. The last part of our study was to analyze the source of pollutants. First, a Shapiro-Wilk normality test was conducted for particulate matters and gaseous pollutants in each city. For those data that did not accord with the normal distribution, the Spearman rank correlation was used to calculate the correla- tion coefficient among variables. General linear correlation was performed for those data that accord with a normal distri- bution. Finally, the correlation matrix was drawn. The statistical tests were two-sided, and p values < 0.05 were considered statistically significant; in the Levene’s ho- mogeneity test, p value < 0.10 was considered statistically significant. All analyses and pictures were performed or drawn using R software (Version 3.6.1) (R Core Team 2020). On the basis of individual ANOVA analysis, the annual aver- age variations of six criteria pollutants changed significantly (p < 0.05 prior to adjustment for multiple comparisons) over the 6-year period (Table 1). Compared with 2014, the AQI value and the PM2.5, PM10, SO2, NO2, and CO concentrations decreased in 2019 by 28.7%, 38.0%, 34.1%, 67.9%, 24.9%, and 34.4%, respectively. The O3 concentration increased sig- nificantly from 2014 to 2018 and decreased slightly in 2019. Overall, the O3 concentration increased 12.4% between 2014 and 2019. The annual average variation of AQI values and the six criteria pollutants in the seven geographic regions are present- ed in Fig. 2, and more detailed information were summarized in Table S2. The variation patterns were similar among the seven regions; however, some regions showed some differ- ences; for example, the PM concentration in northeast and central China increased significantly in 2018–2019 (p < 0.05), and the O3 concentration in south China declined The monthly average variation trends of the AQI value and six pollutants in the 14 sample cities are shown in Fig. 3. Those of the remaining cities are shown in Figs. S2–S35. The AQI value and pollutants other than O3 demonstrated significant seasonal variations with high values in winter and low values in summer. However, the seasonal variation of O3 and NO2 in Haikou was contrary to those in other cities; that is, NO2 concentration was higher in summer and O3 concen- tration was higher in winter. Figure 4 shows the spatial distribution maps of the annual average AQI values and PM and gaseous pollutant concentra- tions from 2014 to 2019. The country was effectively divided into high pollutant concentration areas in the east and low pollutant concentration areas in the west by the Hu Huanyong line (black line in Fig. 4), which marks the striking difference in the distribution of the country’s population. There was a notable reduction of AQI value and PM2.5, PM10, SO2, NO2, and CO concentration over the study period in large city clusters (theBeijing-Tianjin-Hebei region(BTH); Yangtze River Delta (YRD); Pearl River Delta (PRD); Sichuan-Chongqing (CY); and Liaoning, Jilin, Shanxi, Shaanxi, and Gansu provinces), but the pollutant concentra- tions were still the highest compared with other areas in the same period. It is worth noting that the PM10 concentration in Xinjiang Uygur increased significantly (p < 0.05) from 2015 to 2018. In Shandong, Henan, Jiangsu, Anhui, Shanghai, Qinghai, and Tibet, the O3 concentration was higher than that of other provinces in the same period.",
    "Summaries of the annual average value of AQI and six criteria pollutants in the 31 provinces according to the Technical Regulation on Ambient Air Quality Index (HJ633-2012) were shown in Table S3 (Ministry of Ecology and Environment of People’s Republic of China 2012). The highest AQI value was found in Hebei (133.92) in 2014, and the lowest value was found in Hainan (33.02) in 2019. By 2019, only Henan province failed to reach the level 2, and six cities had reached the level 1. With reference to the ambient air quality standards (GB 3095–2012) (Ministry of Ecology and Environment of the People’s Republic of China 2012), the highest concentration of PM2.5 was found in Hebei (93.18 μg/m3) in 2014, and the lowest concentration was found in Tibet (10.72 μg/m3) in 2019. By 2019, Hainan and Tibet reached the grade I (<15 μg/m3) standard, and 14 provinces reached the grade II stan- dard (<35 μg/m3). Similar to PM2.5, the highest annual average concentration of PM10 was found in Hebei (163.13 μg/m3) in 2014, and the lowest concentration was found in Tibet (24.80 μg/m3) in For SO2, the highest annual average concentration of SO2 was found in Shanxi (70.04 μg/m3) in 2016, and the lowest concentration was found in Hainan (3.33 μg/m3) in 2018. By 2019, only Shanxi failed to reach the grade II standard (<60 μg/m3). heating area was greater than that in the area without central heating. For example, the SO2 concentration during the heating period in Changchun was 4.1 times that during the non-heating period, whereas the increase in Wuhan was only 0.7 times. For NO2, the highest concentration was found in Beijing (54.44 μg/m3) in 2014, and the lowest concentration was found in Hainan (10.05 μg/m3) in 2019, and all of the prov- inces reached the standard (<20 μg/m3) in 2019. The annual average limitation of CO and 8-h O3 was not defined in the standard. The highest concentration of CO was found in Shanxi (1.89 mg/m3) in 2014, and the lowest con- centration was found in Hainan (0.54 mg/m3) in 2019. The highest 8-h O3 concentration was found in Tibet (78.97 μg/ m3) in 2014, and the lowest concentration was found in Chongqing (34.14 μg/m3) in 2014. Table 2 presents the MANOVA results of two main effects: the central heating and heating period. The main effect of central heating showed that the AQI value and the PM2.5, PM10, SO2, NO2, and CO concentrations were significantly higher in areas with central heating than in areas without cen- tral heating (p < 0.05),while nodifferenceinO3 concentration was found between the two areas. The main effect of heating period demonstrated that the AQI value and the concentra- tions of the six criteria pollutants in the heating period were significantly higher than those in the non-heating period (p < 0.05). Furthermore, the heating period and central heating of the AQI and the six pollutants had significant interaction ef- fects (p < 0.05). Figure 5 presents the results of the two-sample t-test, which compares the AQI values and concentrations of the six criteria pollutants between the heating and non-heating periods in 14 sample cities from 2014 to 2019. The difference between the heating period and the non-heating period in the central Figure 6 shows the correlations between the five pollutants (PM2.5, PM10, SO2, NO2, and CO) in 14 sample cities. The O3 present in the lower atmosphere is mainly generated by photochemical reactions. Therefore, relationships between O3 and other pollutants were not independent, so the O3 was excluded from the correlation calculations. with PM10, suggesting that both PMs came from the same or similar sources. Concentrations of both PM10 and PM2.5 were highly correlated with SO2, NO2, and CO in most cities, with R2 of 0.54–0.72, 0.14–0.80, and 0.45–0.87, respectively. The correlation coefficients of SO2–NO2, SO2–CO, and NO2–CO were within the ranges 0.24– 0.76, 0.35–0.82, and 0.21–0.82, respectively, with highly (R2 > 0.5), moderately (0.25 ≤ R2 ≤ 0.5), or weakly (0 ≤ R2 ≤ 0.25) correlated. The correlation between SO2 and CO in cities located in south China, such as Haikou, was weak or moderate, suggesting that coal combustion and industrial manufacture had a relative low contribution to air pollution in this region.",
    "The annual average pollutant concentration, except for O3, decreased significantly from 2014 to 2019. According to the Statistical Communique of the People’s Republic of China, from 2014 to 2017, PM emissions decreased from 17.41 to 7.96milliontons,SO2emissionsdecreasedfrom19.74to8.75 million tons, and NO2 emissions decreased from 20.78 to 12.59 million tons (National Bureal of Statistics 2019). This is related to a series of measures taken by the Chinese govern- ment, such as shrinking the growth of harmful gas emissions, expanding production of clean energy, and continuing devel- opment of industrial structure policies and reforms (Tambo et al. 2016). Recent research (Guo et al. 2018) has indicated that the coal cap policy (a series of documents and policies released by China’s State Council to support the reduction of coal consumption) resulted in significant emission reductions of PM2.5, PM10, SO2, NO2, and CO, which is also consistent with the results of the present study. For comparison, only four states in the USA failed to reach the PM2.5 concentration standard, which was 12 μg/m3 in 2015 (Bennett et al. 2019). Ina studycoveringninecountries and 16provincesinEurope, the concentration of PM2.5 ranged from 8.1 to 43 μg/m3 (He et al. 2018). Therefore, compared with developed countries, China still has higher concentrations of PM and gaseous pol- lutants, and thus the government needs to continue to pay attention to air pollution in the future. Fig.3 Temporal variation of statistical characteristic ofAQI and six criteria pollutants (including PM2.5, PM10, SO2, NO2, CO, and 8hO3). SD indicates the standard deviation; 25% and 75% indicate the percentile Changes in monthly averages of AQI, PM2.5, PM10, CO, SO2, and NO2 conformed to a U-shaped pattern, with the highest values in late autumn and winter (November to February) and the lowest values in summer (June to August), which is consistent with the results of previous stud- ies (Cui et al. 2019; Ji et al. 2019). High concentrations of pollutants in cold seasons can be explained as follows: (a) Central heating located in the north areas of the Qinling Mountains-Huaihe River Line leads to the increase in coal consumption. On the basis of the Design Code of Heating Ventilation and Air Conditioning in Civil Buildings (GB 50736-2012) (Ministry of Housing and Urban-Rural Development ofthe People’s Republic ofChina 2012),central heating is only available in 13 provinces located north of the Qinling Mountains-Huaihe River Line. Residents living in Jiangsu, Anhui, and other provinces without central heating but with lower winter temperatures generally use air condi- tioners or individual heating equipment. Residents living in the south provinces, such as Guangdong and Hainan, do not need any heating equipment. The heating energy demands up to 8–12 kg of coal equivalent each winter when in central heating area. Only approximately 5 kg of coal equivalent is required when individual heating equipment was used (Shi et al. 2018). Furthermore, the actual energy-saving effect in central heating is only 60.04% of the theoretical energy- saving value (Lin and Lin 2019); (b) bad weather conditions, such as temperature inversions and low-powered air convec- tion in winter, may hinder the diffusion and dilution of atmo- sphericpollutants(Zhanetal. 2017);(c)the higheratmospher- ic mixed layer and increased precipitation in the summer fa- cilitated pollution dilution and deposition of atmospheric pol- lutants (Cui et al. 2019; Yao et al. 2019). However, the wash- out effect was affected by the precipitation threshold (Guo et al. 2016).And it is difficult to reach the precipitation thresh- old due to the decrease of precipitation in winter (Fan et al. 2020); (d) the reduction in combustion efficiency caused by the cold start of vehicle engines in winter will also lead to increased emissions (Kim and Kim 2020). Previous studies have found massive spatial differences in air quality and pollutant concentrations in China (Wang et al. 2017a; Ye et al. 2018), and similar differences were also found in this study. This difference may be related to the transformation of economic development models in these regions (Lin and Zhu 2020). Furthermore, it may also be related to the effectiveness of the implementation of environ- mental conservation and emission reduction policies in these regions (Song et al. 2020). The BTH and northwest regions have higher concentrations of PM2.5 and PM10. The BTH region is one of the most important economic centers in China. For the key industry in the BTH region, there were more than 6000 industrial boilers and a large number of metal basic industrial and nonmetal product sectors in 2017 (Qi et al. 2017). Moreover, there were over 5.5 million ve- hicles in Beijing (Qi et al. 2017; Wang et al. 2017c). High PM concentrations in northwest China were mainly from dust and aerosols in drylands (Chen et al. 2017). Sandstorms were also reported to have a major impact on the concentration of PM10 in the northwest (Zhang and Cao 2015; Guan et al. 2018). Furthermore, Miller-Schulze (Miller-Schulze et al. 2015) showed that sandstorms have no obvious effect on PM2.5. Therefore, PM10 pollution was considered more serious than PM2.5 in northwest China. Conversely, in spring and summer, the dust was transmitted to southwest through the Hexi Corridor by strong wind (Chen et al. 2017). As a result of the government’s affores- tation intervention measures, the conversion of farmland to forest, and reduction of desertification, air quality in north- The SO2, NO2, and CO concentrations were higher in the north, northeast, and east regions and Xinjiang province. Moreover, the concentration of pollutants in some interior provinces was consistently higher than those of many coastal intensive products, such as raw materials, from interior prov- inces to coastal areas. Furthermore, industries that produce pollutants tend to move to areas with less stringent pollution regulations and relatively low labor costs (Zhang et al. 2017; Sun et al. 2019). Even when producing the same products, interior provinces usually have higher emission intensities than those of coastal provinces. For example, the coal-fired electric power industry generates 58.4g SO2 per US$ of elec- tricity in Inner Mongolia, which is nearly twice that in Shanghai (Wang et al. 2017a). Early research suggests that the production of PM and SO2 from coal combustion in rural areas is higher than that in urban industrial areas (Zhi et al. 2017). Therefore, the government should give more attention to underdeveloped areas in the next stage of their attempts to improve air quality nationally. Additionally, pollutants can be transported from the north and central regions to the east re- gion through long-range meteorological transportation (Sun et al. 2019; Wang et al. 2019). Ozone is a secondary pollutant generated by the photochemical reaction of nitrogen oxides (NOx) and volatile organic compounds (VOCs). Vehicle ex- haust emissions and burning of biomass havebeen recognized as important sources of O3 (Fang et al. 2019). Areas with high NOx and VOC emissions, such as Shanghai and Guangzhou, or areas with high ultraviolet radiation, such as Tibet and Gansu, usually have higher O3 concentrations (Wang et al. 2017b). In a study on ozone sources and concentration varia- tion in China, Liu proposed that large reductions in PM and SO2 emissions also lead to increases in urban O3 due to the complex effects of aerosols on radiation and chemical reac- tions, while meteorological factors also increase O3 concen- trationsin the southwest (Liu and Wang2020a; Liu and Wang 2020b). Notably, some studies have found that simply reduc- ing the concentration of NOx will lead to the increase of O3 concentration. During the COVID-19 blockade, due to the shutdown of transportation industry, the reduction of NOx leads to a lower O3 titration by NO, which will lead to the increaseofO3concentration(Sicardetal.2020; Sicilianoetal. 2020). It should be noted that the O3 concentration in Hainan province is higher in the cold season, which is contrary to the seasonal characteristics of O3 concentration in other prov- inces. The extremely high precipitation in summer in Hainan province not only weakens the solar radiation and thus reduce The correlation coefficient of the different PM sizes is an important indicator for analyzing the source of pollutants. PM2.5 and PM10 are highly correlated in most areas, suggest- ing that these two particles come from the same or similar sources. In China, the main PM sources are combustion (such as coal-fired power plants or heaters, vehicle exhaust, biomass incineration) and dust (Yang et al. 2018; Huang et al. 2020; Yang et al. 2020). Therefore, the Chinese government should further promote clean energy policies aimed at reducing PM emissions from coal combustion and industrial production.",
    "pogenic sources with the latter estimated to account for more than 70% of SO2 global emissions (Sun et al. 2019). Fossil fuel combustion is the main anthropogenic source of SO2, and thus the strong correlation with PM suggests that the main source of these pollutants was the combustion of fossil fuels. The correlation between NO2 and PM was relatively high in the present study because of the effects of vehicle exhaust emissions, fossil fuel combustion, and agriculture production (Krotkov et al. 2016; Guo et al. 2019). The results are consis- tentwiththe findingsofthe previousresearch(Yu etal. 2019). The correlation between SO2 and CO or NO2 was mainly affected by coal-fired fossil fuels. The strong correlation indi- cates that combustion has a great influence on air quality, which is also consistent with Lu’s report (Lu et al. 2019). The correlation between PM (both PM2.5 and PM10) and other gaseous pollutants in Shenyang and Urumqi was different from that in other cities, which was due to the extreme pollut- ed weather record in these two cities. Taking Shenyang as an example, the concentration of PM2.5 was recorded as 848 μg/ m3 on November 8, 2015; however, other gaseous pollutants levels were low, so the unique correlation characteristics were generated. This study had several limitations. First, the construction of environmental monitoring stations was not fully completed in 2014, especially in the provinces of northwestern and south- western provinces. Therefore, the representativeness of the study in 2014 in these areas may lower than those in the follow-up study. Second, this study focused on air quality in a single city or region, and the influence of meteorological, long-distance transportation, and the transformation of pollut- ants have not been explored. Therefore, to further promote the improvement of China’s environmental conditions in the fu- ture, it is necessary to explore the influence of pollutant trans- mission in the atmospheric environment and to understand the influence of physical and chemical factors on air pollutant concentrations. Owing to strict control measures taken by the government, the air quality in all cities has improved significantly, but the O3 concentrations have increased gradually. Furthermore, the spatial distribution of pollutants was variable, and the air qual- ity of north, central, northeast, and east regions were worse than those of other regions. The central heating used in areas located in the north of the Qinling Mountains-Huaihe River Line has had a negative impact on air quality. Furthermore, the main sources of air pollutants in China were fossil fuel combustion, industrial production, and motor vehicle emissions. The air pollution in China is caused by multiple pollutants and thus shows great divergence among different regions. As a result, region-based management measures must be established. Furthermore, the influence of meteorological fac- tors on air quality, long-distance transportation, and the trans- formation of pollutants should be further explored in future research. Data availability statements The datasets generated during and/or ana- lyzed during the current study are available from the corresponding au- thor on reasonable request."
]