[
    "Yanqi Zhao”? - Fan Li! - Ying Yang! - Yue Zhang! - Rongkun Dai’ - Jianlin Li'?? - Mingshi Wang”? - Zhenhua Li!? The aim of this research is to analyze the main influencing factors and relationship between atmospheric environment and economic society. Using the panel data of 18 cities in Henan Province from 2006 to 2020, this paper employed some advanced econometric estimation included entropy method, extended environmental Kuznets curve (EKC) and STIRPAT model to conduct empirical estimations. The results show that most regions in Henan Province have verified the existence of the EKC hypothesis; and the peak of air pollution level in all cities of Henan Province generally occurred in around 2014. Multiple linear Ridge regression indicated that the positive driving forces of air pollution in most cities in Henan Province are industrial structure and population size; the negative driving forces are urbanization level, technical level and greening degree. Finally, we used the grey GM (1, 1) model to predict the atmospheric environment of Henan Province in 2025, 2030, 2035 and 2040. What should pay close attention to is that air pollution levels in northeastern and central Henan Province will continue to remain high. Keywords Atmospheric environment - Environmental Kuznets curve - STIRPAT model - GM (1 - 1) prediction model - Henan Province Air quality is closely linked to human well-being and sus- tainable development (Liu et al. 2022), and especially affects the climate and threatens human health. With population growth and rapid economic development, China’s haze and air pollution have become serious issues plaguing people in recent years (Zhu et al. 2019). In the past few years, the government has made great efforts to control air pollution (Song et al. 2020) (e.g. some Air Pollution Prevention and Control Action Plan (Zhang et al. 2021) released since 2013 and carbon peak target and carbon neutrality vision to fur- ther promote domestic low-carbon development ambitiously announced in September 2020). The crucially acute problem has also received substantial attention from the public (Liu et al. 2019) and academia. It is indispensable to system- atically analyze the causal relationship and internal mecha- nisms between air pollution and human social-economic activities, and to find out the main controlling factors for solving the dilemma of reducing environmental pollution whilst achieving economic growth (Feng and Yuan 2021). Air pollution is not only noteworthy affected by natural factors such as meteorological conditions (Bai et al. 2019) and atmospheric circulation (Du et al. 2022b), but also closely related to socioeconomic activities (Qin et al. 2020). Song et al. (2020) and Wang et al. (2020b) traced emission flows and evolution of air pollutants along supply chains to comprehensively grasp the source embodied in products from production sectors and the final destination. Castells- Quintana et al. (2021) studied the relationship between the evolution of air pollution emissions and the spatial distribu- tion of population through more than 1200 big cities around the world. Yuan et al. (2022) argued that energy transition could have disparate influences on emission reduction of dis- tinct air pollutants and sectors, which largely relies on their current terminal control levels. Zhou et al. (2022b) found that there are strong correlations between industrial capaci- ties (coal, pig iron, crude steel and rolled steel), mini-cars and heavy trucks and air pollution levels. Xu et al. (2021) and Yang et al. (2021) analyzed the impact of investment and construction of roads or railways on the economy and air pollution emissions. Qiang et al. (2020) show that the major contributors to PM2.5 are the economic growth, population density and spatial spillover effect of secondary industry, rather than vehicle emissions, through studying 285 prefec- ture-level cities in China. Zhao and Wang (2022) discussed the spatial effect, regional heterogeneity and transmission mechanism of new-type urbanization on air pollution from the five dimensions of society, economy, population, space and green. From the above-mentioned studies, it can be found that the factors affecting air pollution are complicated. In turn, air pollution also has undisputedly a huge impact on social economy and human health. It can affect economic through the channels of blocking foreign direct investment (Feng and Yuan 2021), reducing corporate productivity or performance (Cao et al. 2022), increasing the difficulty to firms’ motivate executives (Yu et al. 2022) and inhibiting the improvement of innovation capability (Ai et al. 2022), move- ment of the population toward those regions characterized by lower levels pollution (Germani et al. 2021). Air pollution worsens living conditions and has a negatively irreversible impact on human health (Wang et al. 2022), which eventu- ally reduces residents’ subjective welfare (Sun et al. 2022).",
    "In recent years, China has made great endeavours in controlling air pollution and achieved sustainable positive results. Since the implementation of the Three-Year Action Plan for Blue Skies in 2018, the total emissions of primary air pollutants were obviously reduced (Shu et al. 2022) through Central Environmental Protection Inspection (Lin et al. 2021), Joint Prevention and Control of Atmospheric Pollution Policies (Du and Sun 2022), and Promotion Incen- tives of Officials (Yin and Wu 2022). To this end, Zheng et al. (2021) have evaluated the effects and performances of environmental regulation or policies on air pollution treat- ment and control. Meanwhile, the natural resource man- agement, environmental taxes, green finance policy (Wan et al. 2022 and Zhang et al. 2022a) and trade have a positive impact on air pollution control and efficiency of resource use (Guan et al. 2022). From the consumer perspective, Wang et al. (2020a) and Du et al. (2022a) attempt to estimate the air pollution abatement costs and economic benefits caused by interregional trade for the responsibility apportionment through employing an input-output model. Scholars have made great contributions in studying the causes, impacts and treatment of air pollution from differ- ent aspects. As a major economic province, grain-producing area and energy-consuming province in China, Henan Prov- ince has relatively serious air pollution and is also a key region of the Beijing-Tianjin-Hebei air pollution transmis- sion channel (Qin et al. 2020). However, few studies dis- cussed the relationship and causes between air pollution and social economy in Henan Province. So, this study seeks to fill this gap and simultaneously try to identify the main control factors affecting the atmospheric environment for upgrading the economic structure and seeking sustainable development paths (Xu et al. 2020) of Henan Province. On the basis of the environmental Kuznets curve (EKC) hypothesis and entropy theory, we thus constructed a static and dynamic panel model based on the extended STIRPAT (Stochastic Impacts by Regression on Population, Affluence and Technology) analytical framework. By using improved econometric models to analyze the impacts of the population size, wealth level, green degree, urbanization rate, indus- trial structure and the level of science and technology on the atmospheric environment quality, it could enrich the theories of urban atmospheric environment assessment, promote the integration of economic theories into environmental science and promote the development of interdisciplinary theories, and provided scientific basis for urban development planning and governance decision-making. Henan Province (110°21'E-116°39'E, 31°23'N-36°22’N) is located in mid-eastern China, and the middle and down- stream of the Yellow River area. The terrain is high in the west and low in the east, with Huang-Huai-Hai plain in the mid-east and Nanyang basin in the southwest. The whole region is a continental monsoon climate from the warm tem- perate zone (most) to subtropical zone (southern) transition. It is an important channel in China’s economy, transporta- tion and climate, connecting Anhui and Shandong in the east, Hebei and Shanxi in the north, Shaanxi in the west and Hubei in the south (Fig. 1). According to the 2021 Statisti- cal Bulletin of Henan Province’s National Economic and Social Development, it has a total area of 167,000 km? and a permanent resident population of 98.83 million. Its GDP was 5,888.741 billion Yuan in 2021 with an annual growth rate of 6-15% since 1992, and the proportion of the three industrial structures is 9.5:41.3:49.1. In this study, we employ a panel dataset of 18 prefec- ture-level cities in Henan Province during 2006-2020 (Table 1). In terms of air pollutant emissions, combined with the Statistical Yearbook of Henan Province, the industrial waste gas, sulphur dioxide and smoke (dust) emission were selected as pollution indicators, and then synthetically calculated to obtain the comprehensive emis- sion indicator of air pollutants. Due to the complex factors influencing atmospheric environment, the selected indica- tors should not only be typical and representative, but also must ensure the authenticity and reliability. According to existing research results and the actual situation of Henan Province, the population scale, economic level, scien- tific and technological level, urbanization level, greening degree and industrial structure were selected as the indica- tor elements reflecting air environment quality. All calculation data are from the China City Statisti- cal Yearbook, China Urban Construction Statistical Year- book, the Statistical Yearbook of Henan Province and the Statistical Bulletin of National Economic and Social In order to remove the dimensional difference between dif- ferent indexes that make synthesize evaluation impossible, the original data of air pollution and economic indicators should be standardized. The normalization process is as follows: where y; is the standardized index value of the jth evaluation index in the ith year, 0 < y,; < 1; x, is its original value; x;,,.4, and 4;,,i, are separately the maximum and minimum initial value of the jth index in all years.",
    "The weight coefficient of industrial waste gas, sulphur dioxide and smoke (powder) emission is determined by the entropy weight method, and then the comprehensive air pol- lution level of each city in each year is obtained through the following procedure. Using SPSS software and entropy weight method, the weight coefficients of industrial waste gas, sulphur dioxide and industrial dust (powder) emissions were determined as 0.332, 0.299 and 0.369 respectively. where J; is the air pollution composite index in the ith year; j=1, 2, 3, 4 is the air pollution indexes; W; is the weight value of the jth pollutant emission; y,; is the stand- ardized value of the jth air pollution index in the ith year. Kuznets (1955) first put forward a hypothesis to describe the income inequality and economic growth in the 1950s (Meng and Zhou 2020), that is the relation between the two indicators emerges an (inverted) U-shape curve (Zhang et al. 2022b). In 1991, Grossman and Krueger (1991) verified that the aforementioned curve also consists in the association between economic growth and environmental degradation (Montero et al. 2021). The non-linear influence means that socio-economic activities firstly worsen environmental qual- ity in the early stages (Arshed et al. 2021); however, these activities instead become environment-friendly after a cer- tain threshold (Arshed et al. 2021). Panayotou (1993) first called this link as the environmental Kuznets curve (EKC). In fact, the relationship between the atmospheric environ- ment system and socio-economic activities is relatively com- plex and various, such as U-shape and inverted U-shape, N-shape and inverted N-shape (Jiang et al. 2022).This paper attempts to use the EKC model to explore the correlation between the two systems in cities of Henan Province. By means of SPSS software, along with the scatter plots of per capita GDP and municipal environmental pollution index, the linear, quadratic and cubic estimation models were respectively used to analyze the data of economic development and air pollution. Through comparative analy- sis, it is the best for the fitting effect estimated by the cubic model; thus, the following formula (8) is finally adopted for where / is the composite index of air pollution. A is the per capita GDP. a is a constant term. b;,b,,b; are the variable coefficients. € is the error term. On the basis of the above model (10), this study extends the influencing factors of atmospheric environment by intro- ducing three factors: urbanization level, greening degree and industrial structure. The expanded STIRPAT model is: In combination with the characteristics of cubic function image and production practice, there are several possible results as shown in Table 2: where J, P, A, T, c and e are the same independent variables in Eq. (10). U, G and IS respectively refer to the urbaniza- tion level, greening degree and industrial structure. d, f, g, h, k and | denote the elastic coefficient of each explanatory variable individually. Besides economic development, there are other factors that can have an effect on atmospheric environment system. We thus adopt the improved STIRPAT model to analyze the impacts of the population size, wealth level, green degree, urbanization rate, industrial structure and the level of sci- ence and technology on the atmospheric quality. The Sto- chastic Impacts Regression on Population, Affluence and Technology (STIRPAT) model is a non-linear regression equation extended by Dietz and Rosa (1994) based on the IPAT model. To study the environmental drivers, Enrlich and Hold- ren (1971) proposed the Impact, Population, Affluence and Technology (IPAT) method (Thio et al. 2022). The standard form of this method is: where J is the composite index of air pollution. P, A and T are severally total population, affluence or the level of economic development, scientific and technological level. The grey system with uncertain factors was firstly sug- gested by Deng (1989) (Cui et al. 2018). Grey prediction is a method to predict the development trend of things through processing the original data to find the rules of such system changes, and generating data series with strong regularity, and then establishing the corresponding differential equation model. The GM (1, 1) model mainly solves the generating sequence with exponential change law. The grey prediction steps for the comprehensive air pollution index in Henan Province using this model are as follows: In the IPAT model, the degree to which J is affected by each driving factor is treated equally, violating the reality (Cui et al. 2018). Therefore, the STIRPAT model adds the elastic coefficient to the IPAT model so as to make it more accurate. The standard form of this STIRPAT model is: Step 1: Data verification: Class ratio test of the known original data to judge the applicability of data series for model construction.",
    "where J, P, A and T are the identical meaning as that given in Eq. (9). c is the whole model coefficient; d, fand g denote where 2“) is the background value of GM (1, 1) model. a is the development coefficient, which mainly controls the development trend of the system; b is the grey action quan- tity, and its value reflects the relationship of data changes. Step 3: Establish the grey prediction model and solve the generated and restored values. The prediction model is as follow: Here, the model accuracy is high if C < 0.35; it is precise if C < 0.5; it is qualified if C < 0.65 and unqualified when C > 0.65. From the interannual variation of the calculated compre- hensive emission indicator of air pollutants (/) for each city (Fig. 2), the peak value of / in all cities of Henan Province generally occurred in around 2014. Throughout the study period, the J value of Zhengzhou, Kaifeng, Pingdingshan, Anyang, Hebi, Jiaozuo, Xuchang, Luohe and Jiyuan showed a trend of first decreasing, and then increasing, and decreas- ing again (inverted N type). Xinxiang and Zhumadian tend to decrease first and then increase, and decrease again and then increase (W type). Luoyang, Sanmenxia and Shangqiu all showed a continuous decreasing trend. Puyang, Nanyang, Xinyang and Zhoukou showed irregular fluctuations. Checking the portal website of the People’s Government of Henan Province (www.henan.gov.cn), on May 21, 2014, the government promulgated the “Implementation Plan for Total Emission Reduction of major pollutants in Henan Province in 2014”. This shows that the environmental pol- lution caused by economic development in previous years has attracted the attention of government departments, and the better management and optimization of production struc- ture in conformity with strict environmental rules (Mele and Magazzino 2020) was well implemented in most cities. But, some cities still have a dilemma in the development trans- formation and environmental governance. From the spatial distribution of the comprehensive indi- cator (/) (Fig. 2), the regions with significant changes were situated in the northeast of Henan Province. Among all 18 cities, Shangqiu had the largest J value in 2006, 2009 and 2010 whilst the smallest from 2011 to 2019; Xuchang was the smallest J value from 2008 to 2010 whilst the largest in 2012 and 2013; Puyang was the largest J value in 2015 and 2016 whilst the smallest in 2017. The J values of all cities in central Henan Province (Shangqiu, Kaifeng, Xuchang, Luohe, Zhengzhou, Pingdingshan, Luoyang, Sanmenxia), three northern cities (Hebi, Jiaozuo, Jiyuan) and one south- ern city (Xinyang) began to decline after reaching the peak around 2014. The / value of Xinxiang and Zhoukou showed a W-shape after the peak value around 2014, indicating a recurrence of air pollution. closely and Luohe has grown rapidly since 2017 and soon entered the second echelon. From the perspective of spatial distribution, the per capita GDP in northwest Henan Prov- ince is relatively high, mainly including Zhengzhou, Luoy- ang, Xuchang, Sanmenxia, Jiyuan, Luohe, Hebi and Jiaozuo. In recent years, Henan Province ranks fifth in total GDP and third in population in China. For per capita GDP (Fig. 3), all cities in Henan Province were in a steady upward trend before 2017, whilst some cities fluctuated after 2017. This may be related to the co-movement (Kirikkaleli and Sowah 2020) between the strict environmental governance policies implemented by these cities after 2014 and the industrial transformation and upgrading. Zhengzhou and Jiyuan have always been at the forefront in terms of development trend; Luoyang, Xuchang, Sanmenxia, Jiaozuo and Hebi followed Three regression fitting analysis between the per capita GDP and the comprehensive index of air pollution was carried out, and the results of various cities in Henan Province are shown in Table 3. Except for Xinxiang, Xuchang, Zhoukou and Zhumadian (R’ <0.5 and P>0.05), the fitting degree of other cities is better, and most of the significance (P) is less than 0.05 (passed the F-test). The results illustrated that the EKC hypothesis is valid (Kirikkaleli and Kalmaz 2020) besides the four cities. According to the EKC curve between the economic growth and air pollution from 2006 to 2020, the shape of the remaining 14 cities in Henan Province can be divided into the following four types: The EKC curves of Anyang, Puyang, Xinyang and Jiyuan show a standard inverted “N” shape, that is with the economic growth, the comprehensive index of air pollution goes through three stages: first decrease, then increase and then decrease. From 2006 to 2010 (China’s 11th Five-Year Plan period), whilst maintaining steady and rapid economic development, enterprises strived to improve their independent development capabilities, gradually eliminated the outdated production modes, and formed a complete industrial system. China became the world’s second-largest economy around 2010, followed by 5 years of rising energy demand and air pollution. Dur- ing the “13th Five-Year Plan”, China’s economic growth slowed down affected by Sino-US trade friction and the COVID-19. Meanwhile, the government introduced a series of environmental protection policies such as “Blue Sky Protection Campaign”, which significantly improved the ecological environment. The above-mentioned four cities coincide with the three stages of this inverted “N” type change, with little differences in turning point years.",
    "Most cities in Henan Province (Kaifeng, Hebi, San- menxia, Luoyang, Pingdingshan, Nanyang, etc.) present an inverted “U” shape, namely, with the economic advance, the comprehensive air pollution index experiences two stages of first rising and then falling. Their inflection points mostly occurred in 2010-2014, which was associ- ated to the level of economic development and the empha- sis on pollution control. The EKC curve of Luohe emerges the “N” type char- acteristic. The first peak of the comprehensive air pol- lution index growth was in 2010, and the lowest point appeared in 2019. In the next few years, Luohe needs to strengthen air pollution control whilst developing its economy. The EKC fitting curves of Zhengzhou, Jiaozuo and Shangqiu illustrated a declining trend in the past 15 years. This means that the three cities attach great importance to the concept of ecological environmental protection and green and sustainable development, so in return for eco- nomic growth whilst the level of air pollution has generally been declining. We employed multiple linear regression analysis to investi- gate how economic factors influence atmospheric environ- ment in Henan Province. Since independent variables are required in multiple regression (Li et al. 2017), according to the extended STIRPAT model and the indicators selected in Table 1, we first applied least squares to fit Eq. (12) based on the statistical data of each indicators in various cities of Henan Province from 2006 to 2020. As can be seen from the correlations among independent variables shown in Table 4, it is obvious that the average value of the variance inflation factor (VIF) exceeds | and that the maximum value exceeds 10. A severe multi-linear correlation lies among independent variables, rendering estimation by normal regression unsuit- able (Li et al. 2017). In order to eliminate the multi-collinearity, Ridge estima- tion method was used for regression analysis of the model by inserting a non-negative factor (K) to side with the coeffi- cient in the regression equation (Li et al. 2017). Since Ridge regression is a biased estimation, the value of K should be as small as possible to ensure that it is an unbiased esti- mate closer to the least squares method. From the regres- sion fitting results (Table 5), when Ridge regression tends to be stable, the model fitting results of all cities in Henan Province have passed the significance test; meanwhile, their K value and deviation are small. Table 5 indicates that the p-values in the F-test of other cities are less than 0.1 except for Anyang, Xinxiang, Puyang, Xinyang, Zhoukou and Zhu- madian, which have a remarkable correlation; except Xinxi- ang, Puyang, Xinyang and Zhoukou, R’ of the other cities is relatively small with the better fitting degree. In line with the regression analysis results (Table 5), the distribution of air pollution influencing factors in cit- ies of Henan Province was drawn (Fig. 4). For most cit- ies in Henan Province, the main positive driving forces for air pollution are industrial structure, population size and economic level. The influence of industrial structure on air pollution is mainly reflected in the proportion of secondary industry (Zhu et al. 2019; Ren and Matsumoto 2020). The most influential is Kaifeng in which compre- hensive air pollution index will increase by 0.214% when the proportion of secondary industry rises by 1%, fol- lowed by Pingdingshan (0.141%) and Luoyang (0.112%). Because the three cities are the foremost industrial cities in Henan Province, a lot of consumption of energy and raw materials could lead to emit a large amount of indus- trial sulphur dioxide, soot (dust) and waste gas. In other words, industrialization and accompanying population scale have a promoting impact on air pollution (Xu et al. 2019). As for the population size, the comprehensive air pollution index will increase by 14.35% for every 1% increase in the total population at the end of the year in Luoyang, then Xuchang (9.262%) and Xinxiang (8.321%). The effect of population size on air pollution is princi- pally reflected in the domestic waste gas emitted by the nonrenewable energy consumption (e.g. coal), which has a positive impact on environmental degradation (Sharif et al. 2019 and 2020). The economic level (affluence) has the greatest positive impact on air pollution in Anyang. For every 1% increase in GDP per capita, its compre- hensive air pollution index will increase by 0.393%, and Kaifeng (0.279%), Zhoukou (0.276%), Zhumadian (0.272%), Zhengzhou (0.268%). As one of the heavy industry bases in Henan Province, the rapid development Zhumadian grew rapidly occupying a large proportion in the total economy of Henan Province, which stimulated consumption and promoted the production expansion, and the corresponding air pollution emission also increased. The leading negative driving force for air pollution is technological investment and greening degree. The increase of scientific and technological input is condu- cive to the improvement of atmospheric environment quality. Luoyang is the most obvious whose compre- hensive air pollution index decreases by 1.886% for every 1% increase in its R&D internal expenditure. It is attributed to the approval of the Zheng-Luo New National Independent Innovation Demonstration Zone by the state in 2016. So Luoyang has increased invest- ment in scientific and technological R&D activities to promote the green and healthy development of the city, which has played a positive role in improving air qual- ity. However, for every 1% increase in R&D expenditure in Kaifeng, the comprehensive air pollution index will increase (0.851%) instead of decreasing. This may be related to the fact that the investment in R&D is focused on the upgrading of production technology to promote economic growth, whilst ignoring the improvement of environmental protection technology. As a result, the air pollution costs outweigh economic benefits. As the end treatment indicator, the urban green space can reduce air pollution trough greening of urban marginal areas and abandoned land. In Puyang, the comprehensive air pol- lution index will drop by 2.736% for every 1% increase in urban green space area, and 2.281% in Luoyang and 1.699% in Xuchang.",
    "Urbanization has both positive and negative effects on air quality, which is linked to the urbanization stages, improvement or time-lag effects and policies (Liu et al. 2022). Some research revealed that cities with higher urbanization rates and population density are prone to reduce air pollution with the improvement effect (Chen et al. 2020). Nonetheless, other research proved that it could play a significant negative role in air quality improvement due to the spillover effect (Liu et al. 2022). In this study, the regression results showed when the urbanization rate increases by 1%, the comprehensive index of air pollution in Jiyuan increased by 0.482%, whilst Kaifeng decreased by 5.628%. This may be related to Kaifeng’s low initial urbanization rate and relatively slow growth. On the basis of the inertial development, considering some factors such as population scale, affluence, technical level, urbanization rate, greening degree and industrial structure affecting the atmospheric environment, the GM (1, 1) model is used to predict the air pollution situation of Henan Prov- ince in 2025, 2030, 2035 and 2040. The forecasting results are displayed in Fig. 5. In general, the atmospheric environment quality in most areas of Henan Province will be improved to some extent in the next two decades. In 2025, the comprehensive air pollution emission index of Anyang, Puyang, Xinxiang, Xuchang, Zhumadian and Sanmenxia will be relatively high, mainly located in the northeast and the east-central Henan Province. From 2025 to 2040, the cities with persistent and serious air pollution will be Anyang, Xuchang and Jiyuan, whilst Zhengzhou, Pingdingshan, Hebi, Nanyang, Xinyang and Shangqiu will maintain good atmospheric environ- ment. Therefore, the development of the former according to the current economic model will be unsustainable, need to change the past development model and move toward green and sustainable development. Xinxiang, Sanmenxia, Puyang, Jiaozuo and Luoyang will have more serious pollu- tion in the early stage, but the improvement of atmospheric environment in the later stage will be more obvious. The atmospheric environment in Zhumadian, Zhoukou, Luohe and Kaifeng will also have gradually improved with rela- tively slow in the range of change. In this study, based on the entropy method, environmental Kuznets curve hypothesis and STIRPAT model, the eco- nomic development, atmospheric environment quality and relationship and influencing factors between the two for every city in Henan Province were analyzed deeply adopt- ing municipal panel data from 2006 to 2020. Meanwhile, we used the GM (1, 1) model to forecast the air pollution situation of Henan Province in 2025, 2030, 2035 and 2040. The results show that the nonlinear effect of economic growth (Xu et al. 2016) on air pollution in most cities of Henan Province conforms to the environmental Kuznets curve hypothesis. The peak of air pollutant emission in all cities occurred around 2014, and the region with signifi- cant change was located in the northeast of Henan Province. According to the EKC fitting results between the economic development and air pollution from 2006 to 2020, with the economic growth, the comprehensive air pollution index of Anyang, Puyang, Xinyang and Jiyuan showed three stages in the past 15 years: first declining, then rising and then falling, which conformed to the inverted “‘N” curve; Kaifeng, Hebi, Sanmenxia, Luoyang, Pingdingshan and Nanyang proved an inverted “U” shape; the EKC curve of Luohe was the “N” type; Zhengzhou, Jiaozuo and Shangqiu showed a continu- ous downward trend. The calculation results of STIRPAT model illustrated that the population scale and industrial structure are the main factors driving the deterioration of atmospheric environment quality in Henan Province, and the improvement of greening degree and scientific and technological level has a significant promoting effect on the enhancement of atmospheric environment quality. From the perspective of time series, the evolution trend and influence mechanism of air pollution composite index in different cities of Henan Province are obviously diverse in different periods affected by different combination factors. Popula- tion size and greening degree have the greatest influence on atmospheric environment quality of Luoyang; the level of science and technology has a negative driving force on the regional air pollution comprehensive index except Xinxi- ang, Jiaozuo and Puyang; the industrial structure produces a positive driving for the comprehensive index of air pollution in all regions except Zhumadian; the urbanization level has a negative impact on the air pollution composite index in all regions except Zhumadian and Jiyuan. The grey predic- tion model found that the atmospheric environment quality in most areas of Henan Province will improve to a certain extent during 2025-2040. However, the air pollution of Anyang and Xuchang will be relatively high, which needs to be attached with great importance by relevant departments.",
    "Due to the limitation of data, our research has only been analyzed for 15 years with certain limitations. In addition, air pollution has a regional linkage effect (Dong et al. 2022), and the cities at the border of Henan Province may have a correlation effect with the surrounding provinces. In the future, we will carry out large-scale relevant research on the Central Plains urban agglomeration. we put forward the following policy recommendations for the decision-makers or planners. (1) The improvement of atmospheric environment quality should be based on regional reality and coordinated regional joint governance (Zhou et al. 2022a). The areas with relatively poor air qual- ity appear in the northeast and central regions of Henan Province. Therefore, Anyang, Puyang, Xuchang, Xinxiang, Jiyuan, etc. should be taken as the key prevention areas for air pollution, timely pay attention to the dynamic changes of air quality and establish more stringent prevention and control mechanisms. At the same time, due to the strong spatial agglomeration (Jiang et al. 2022) and spillover (Liu et al. 2020) effect of air pollution, different cities in Henan Province should cooperate in the process of controlling air pollution, work together with neighbouring provinces and regions to actively explore the mechanism of regional cooperative prevention and control (Zhou et al. 2022a). (2) The atmospheric environment in most parts of Henan Prov- ince has experienced an inflection point since 2014, which is related to the corresponding environmental governance policies, but the task of reducing the emission of air pol- lutants is still a long way to go. There are significant differ- ences in the economic development level and environmental governance technology in various cities in Henan Province. All regions should focus on deepening the reform oriented by income distribution and environment-friendly technolo- gies (Kirikkaleli and Sowah 2020), promoting the benign interaction between economy and environment, and taking the green circular economy development mode. In particular, in such cities as Anyang, Puyang, Zhoukou and Xinyang, where the economic development is weak nevertheless, the atmospheric environment is still not optimistic. (3) It has great distinctions in the characteristics and development models, industry structure and scientific and technological level among different cities of Henan Province. The local government should understand the stages and rules of city development, consider the geographical characteristics and climate of different regions to carry out scientific planning and reasonably determine the direction of urban develop- ment. (4) It is necessary to strengthen cooperation and communication among region, enterprise and universities, research institutions, learn advanced development concepts and environmental management measures, increase invest- ment in science and technology, eliminate enterprises and industry technologies with high emissions and low produc- tion, cut down the consumption of raw materials and energy, strive to develop new energy industry, clean production and circular economy in order to achieve coordinated, friendly and sustainable development of economy and environment. Acknowledgements The paper was completed as part of the work con- ducted during the Key Scientific Research Projects of Colleges and Universities in Henan Province. At the same time, the authors would like to thank reviewers and editors for their helpful suggestions. Author contribution Conceptualization, formal analysis, funding acquisition, writing—review and editing: Yanqi Zhao. Data curation, methodology, validation, software, writing—original draft preparation: Fan Li. Investigation, resources: Ying Yang. Supervision: Yue Zhang. Visualization: Rongkun Dai. Project administration, funding acquisi- tion: Jianlin Li, Mingshi Wang and Zhenhua Li. Funding This work was supported by the Key Scientific Research Projects of Colleges and Universities in Henan Province (23A610002 and 22A170009) and National Natural Science Foundation of China (52174073). The authors are grateful to the Department of Education and Finance of Henan Province for the provision of research funding. Data availability The data that support the study are available from the China City Statistical Yearbook, the Statistical Yearbook of Henan Province and the Statistical Bulletin of National Economic and Social Development but restrictions apply to the availability of these data, which were used under licence for the current study, and so are not publicly available. Data are however available from the authors upon reasonable request and with permission of China Bureau of Statistics."
]