[
    "Objective：to promote the sustainable and efficient utilization of water resources in Henan Province, accelerate the optimization of the water resources management system, innovate the government administrative management mode, and provide new strategic countermeasures and path choices for the industrial upgrading and transformation in water resources related fields and the high-quality development of regional economy in Henan Province. Methods: by comb- ing the current situation and existing problems of water resources utilization in Henan Province, this study focuses on analyzing the strategic opportunities faced by the field of water resources in Henan Province and expounds on the in- novation and application of cutting-edge key technologies for water resources protection and utilization in Henan Prov- ince. Results: while the protection and utilization of water resources in Henan Province have achieved great results, it still faces great challenges: low water-saving results, imperfect advanced technology system, unstable water pollution control results, and imperfect water resource management mechanism. Conclusion: in the future, we must coordinate the relationship between water resources development and protection, establish the idea of harmonious development, give full play to the regional advantages of Henan Province, strengthen the research and development of cutting-edge key technologies, innovate the government management mechanism, and realize the efficient and sustainable utilization of water resources. Copyright © 2021 Weiqiang Zhang, et al. EnPress Publisher LLC. This work is li- censed under the Creative Commons At- tribution-NonCommercial 4.0 International License (CC BY-NC 4.0). https://creativecommons.org/licenses/by-nc/ 4.0/ Water is one of the indispensable resources for human survival and development. The protection and utilization of water resources have the dual characteristics of natural resources and economic resources[1]. He- nan, as an emerging industrial province, has witnessed active economic development in recent years, making a significant contribution to the national economic development and energy consumption growth. At the same time, it is also an important major grain-producing area in the main functional zoning of China along the nine provinces and regions of the Yellow River (Qinghai, Sichuan, Gansu, Ningxia, Mongolia, Shanxi, Shaanxi, Henan, Shandong)[2-4]. According to the announce- ment of the National Bureau of statistics on the grain production data in 2019, the national grain planting area in 2019 was 1.2 × 108 hm2; the total grain output is 663.84 million tons, of which the sown area in Hen- the total grain output is 66.95 million tons, exceed- ing 1/10 of the national total. However, the econo- my of Henan Province has been an “extensive” de- velopment for a long time, and the problems of wa- water resources waste and environmental pollution are serious. Economic development is increasingly restricted by the environment and resources. In or- der to support the national food security, provide the basic guarantee of agricultural water resources, strengthen engineering water conservation and ag- ronomic water conservation, enhance the efficiency of water resources utilization and management, and build a water-saving and efficient modern irri- gated agriculture and modern dry farming agricul- ture with rainwater harvesting efficiency, it has im- portant strategic significance for the regional economic and social development of Henan[1,5-7]. Although some scholars have conducted in-depth research on the carrying capacity, sustainable utili- zation, evaluation and prediction, development strategy, and other aspects of water resources in Henan Province, the in-depth exploration and Re- search on water resources protection, utilization efficiency, and key technologies are still relatively weak[8-11]. As the development of the Yellow River Basin has been identified as a major national strategy, Zhengzhou, Henan Province, as the strategic hub of the National Central City, is expected to continue to deepen the industrialization of the province, and the rise of the Central Plains will inevitably lead to the consumption of more water resources. On the other hand, the development concept of Xi Jinping’s thought on ecological civilization in the new era has its inherent requirements of keeping “lucid waters and lush mountains” and building a bridge from “lucid waters and lush mountains” to “golden mountains and silver mountains”, so that the lucid waters and lush mountains contain huge The eco- logical benefits, economic benefits and social bene- fits will continue to help the transformation of the Yellow River Basin to high-quality develop- ment[12-15]. On the whole, the above new develop- ment situation provides a new strategic opportunity for the protection and utilization of water resources and the transformation and upgrading of related reducing the waste of water resources and the emis- sion of environmental pollutants has a very im- portant impact on the high-quality economic de- velopment and transformation of Henan Province. By combing the current situation and existing prob- lems of water resources utilization in Henan Prov- ince, this study probes into the bottleneck of water resources protection and utilization, and based on the relevant cutting-edge key technologies and their application prospects, attempts to provide scientific reference and theoretical basis for the ecological protection and high-quality development of water resources in Henan section of the Yellow River Ba- sin.",
    "The annual average total water resources of Henan Province are 40.353 billion m3, less than 1.45% of the national total, of which the total available is 19.524 billion m3. At the same time, due to the large population base, the per capita water resources are only 376 m3, which is 1/5 of the na- tional per capita water resources and 1/16 of the world per capita water resources. It is a province with insufficient self-produced water resources carrying capacity and a serious water shortage area. The total water resources of the Haihe River, the Yellow River, the Huaihe River, and the Yangtze river basins under the jurisdiction of the province in 2018 were 2.31 billion, 4.54 billion, 21.19 billion, and 5.94 billion m3 respectively, a decrease of 16.2%, 22.5%, 13.9%, and 16.7% respectively compared with the multi-year average. The water resources in Henan Province vary greatly from year to year. In 2018, the total amount of water resources in Henan Province was 33.98 billion m³, 16.7% less than the multi-year average and 19.7% less than that in 2017. In addi- tion, the annual distribution of river runoff in Henan Province is uneven, and the runoff is mostly con- centrated from June to September. The annual av- erage maximum runoff for four consecutive months accounts for 45% to 90% of the annual runoff. The difference between the annual average monthly maximum and the monthly minimum is 9.5 times, which is very easy to cause drought and flood dis- asters. Spatially, the water and soil resources in Henan Province do not match, as shown in Table 1. In 2018, the total water resources in the northern and eastern plains of Henan province accounted for only 30.17% of the province, and the average water resources per mu and per capita were insufficient; the southern and western hilly areas account for 1/2. However, by the end of 2018, the population of the northern and eastern plains of Henan province ac- counted for 56.23% of the total population of the province, the GDP accounted for 59.76% of the province, and the grain output accounted for 57.52% of the province. Water and soil resources do not match, economic and social development does not adapt to the distribution of water resources, and water resource allocation is difficult, which restricts Table 1. Population, GDP, cultivated land area, grain yield, and total water resources proportion of Henan province in 2018 (%) Note: The data involved in this section are collected from the water resources bulletin, statistical yearbook, ecological envi- ronment status bulletin, and government documents of Henan Province. In recent years, the rapid economic develop- ment of Henan Province has also caused great damage to the ecological environment. According to the statistical data of Henan Province, the wastewater discharge in Henan Province increased from 2.507 billion tons to 4.113 billion tons from 2004 to 2017. Among the 141 monitoring sections in the province in 2018, 85 sections with water quality meeting the class I–III standards, accounting for only 60.4%, lower than the national average level; there are 5 sections whose water quality is inferior to class V, accounting for 3.5%. In 2019, of the 94 surface water national examination sections, 64 were class I–III water quality sections, account- ing for 68.1%, and there were no sections with infe- rior class V water quality; the standard rate of cen- tralized drinking water source is 97.7%. ince was 23.46 billion m³, among them, groundwa- ter supply accounts for 9.5% of the total water sup- ply, and unconventional water sources such as rainwater collection account for only 2.6%. Due to unreasonable water supply structure and overex- ploitation of groundwater, the total area of shallow groundwater funnel in the province was 9,756 km2 in 2018, an increase of 2,509 km2 compared with 2004. In 2018, the agricultural water consumption, industrial water consumption, and comprehensive water consumption of urban and rural living envi- ronments in Henan province accounted for 51.1%, 21.5%, and 27.4% of the total water consumption respectively. However, due to the differences in economic structure and water resource conditions among cities, there are certain differences in water use structure among regions. 2.2 Current situation of water resources protection and utilization in Henan Province 2.2.1 The utilization efficiency of water re- sources is improved, but the water-saving effect is low Henan province takes the strictest water re- sources management system as an important meas- ure to promote the construction of water ecological civilization, and constantly improves the efficiency of water resources utilization, as shown in Figure 1. The water consumption per 10,000 yuan of GDP in Henan Province decreased from 226 m3/10,000 yu- an in 2004 to 37 m3/10,000 yuan in 2018; the water consumption of 10,000 yuan industrial added value decreased from 103 m3/10,000 yuan to 26 m3/10,000 yuan in 2018, but the GDP output per cubic meter of water in the province is only 1/3 of the world average level, and the water consumption of 10,000 yuan industrial added value is still 3–4 times that of developed countries. In 2018, the utilization coeffi- cient of farmland irrigation water in Henan Prov- ince was 0.61, the reuse rate of industrial water above the designated size was 90%, and the utiliza- tion rate of urban renewable water was 24.4%, which was a certain gap with the advanced regions in China. Water deficient cities above the prefecture level have not yet reached the national water-saving city standard, and the construction and development of a water-saving society is unbalanced, which is still far from the requirements of all-around and whole process water conservation.",
    "As a major agricultural province, Henan Prov- ince has continuously accelerated the pilot work of agricultural water-saving technologies such as bor- der irrigation, furrow irrigation, sprinkler irrigation, and micro irrigation, so that the average water con- sumption per mu of farmland irrigation decreased from 176 m3 in 2004 to 155 m3 in 2018; strengthen the research and development of new technologies and equipment for domestic sewage and industrial wastewater treatment and resource utilization to realize the recycling of water resources; combining remote sensing and network monitoring technology, we will basically form an intelligent control super- vision system for the construction of ecological civ- ilization. However, in many areas of Henan Prov- ince, agricultural irrigation methods are still relatively extensive, and there are still phenomena of blindly building high water consumption and heavy pollution projects in water resource shortage and ecologically fragile areas[7-9]. The development, promotion, and application of advanced and practi- cal high-efficiency water-saving technologies are not enough, and the engineering technology system for high-efficiency utilization of water resources is not perfect. Henan Province has carried out in-depth battle for the protection of clean water, the water quality level of groundwater quality assess- ment points has remained stable, the black and odorous water bodies have been gradually elimi- nated in the built-up areas of cities under the pro- an jiangkou reservoir, the water source of the middle route of the South-to-North Water Transfer Project, has reached class II. In 2019, Henan Province new- ly revised its regulations of Henan Province on the prevention and control of water pollution, putting forward higher requirements for the prevention and control of water pollution. The Henan provincial government adheres to “governance” and “con- struction” at the same time. It plans to build Zhengzhou into a leading ecological construction area in the Yellow River Basin by 2020, with a wetland area of no less than 628,000 hm2 and a wetland protection rate of more than 50%. However, due to the backward treatment idea and the neglect of the harmonious relationship between man and nature, the discharge of urban domestic sewage and industrial wastewater increases year by year, the water quality fluctuates greatly, and the problem of water pollution has not been fundamentally treated. At the same time, the excessive use of pesticides, fertilizers, and so on has led to the continuous in- crease of point source pollution and the increasingly prominent non-point source pollution[20], which in- creases the difficulty of water resources system treatment and protection. Although Henan Province has implemented a series of water resources management measures in recent years, issued the “implementation plan for deepening the reform of comprehensive administra- tive law enforcement of ecological environmental protection in Henan Province”, promoted the pilot construction of water rights, ecological water vol- ume regulation, water ecological civilization, and improved the level of water resources management, there is a lack of coordination mechanism and management technology among departments, and the efficiency of water resources management sys- tem is low, including water intake licensing system, water rights trading system The water ecological compensation system and other systems are still not perfect, the market allocation mechanism is not perfect, citizens’ awareness of water resources pro- tection is weak, and the integration of water re- sources protection supervision is not high, which is not conducive to the comprehensive management, scientific planning and unified scheduling of water resources. Henan Province is located in the Central Plains, spanning the Huaihe River Basin, the Yangtze River Basin, the Yellow River Basin, and the Haihe River Basin (with drainage areas of 86,100, 27,700, 36,000, and 15,300 km2 respectively). It is a nation- al comprehensive transportation hub and logistics center, as well as an important area of national de- velopment strategies such as the “Belt and Road” and the Central Plains Economic Zone. Its geo- graphical advantages can strengthen the formulation of water resources policies, infrastructure construc- tion, and water disaster prevention and control Co- operation at different levels such as scientific, technological, and cultural exchanges[19] provides support for the protection and utilization of water resources in Henan Province and the research and development of advanced technologies. Henan Province involves the two national strategies of ecological protection and high-quality development of the Yangtze River economic belt and the Yellow River Basin. While building a well-off society in an all-around way and pursuing high-quality economic and social development, puts forward higher requirements for the protection and utilization of water resources in Henan Province. With the support of national strategies and national policies, it will help to give full play to the eco- nomic advantages of Henan Province, promote in- dustrial transformation, increase investment in wa- ter conservancy projects and environmental governance, and promote the construction progress of the “top ten water conservancy projects”, build a livable environment in the process of “seeking de- velopment in protection and promoting protection measures from the policy level to practice the idea of ecological civilization and the concept of high-quality development. In 2013, the opinions on the implementation of the strictest water resources management system was issued, which established the red line for the development and utilization of water resources, the red line for the control of water use efficiency, and the red line for the limitation of water function areas; in 2019, the “implementation plan of water saving action in Henan Province” was issued, which made it clear that the reuse rate of industrial water above Designated Size in the prov- ince should reach more than 91%, the effective uti- lization coefficient of farmland irrigation water should be increased to 0.616, the leakage rate of public water supply pipe network should be con- trolled within 10%, and the total water consumption should be controlled within 28.215 billion m3; in February, 2020, a series of policies and regulations were issued, such as the notice on printing and dis- tributing the implementation plan of the 2020 air, water and soil pollution prevention and control in Henan Province, which proposed that the surface water should eliminate the inferior class V water quality; the water quality compliance rate of cen- tralized drinking water sources in cities under the jurisdiction of the province has reached 10%; the water quality of Danjiangkou reservoir, the water source of the middle route of the South-to-North Water Transfer Project, is stable and reaches class II; the water quality level of the groundwater quality assessment points remains stable, and the black and odorous water bodies are completely eliminated in the built-up areas of the cities under the jurisdiction of the province.",
    "Although Henan Province is short of water re- sources, it is rich in transit water, with an average annual inflow of 41.364 billion m3 and an outflow water receiving area of the South-to-North Water Transfer Project, the water allocation of the South-to-North Water Transfer Project in Henan Province is 2.994 billion m3, which effectively solves the problems of water resources shortage, uneven spatial and temporal distribution and serious groundwater exploitation in Henan Province. The aforementioned series of water-saving policies and regulations, market mechanisms, and standard sys- tems are further improved, which plays a positive role in improving the utilization efficiency of water resources in Henan Province, increasing wa- ter-saving measures, and protecting water ecologi- cal security. 3.2 Challenges faced by water resources protection and utilization in Henan Province 3.2.1 Contradiction between economic and social development and water ecological protection Henan Province has developed rapidly. From 2005 to 2018, the per capita GDP of the province in- creased from 11,346 yuan/person to 52,114 yu- an/person. The industrial structure has been opti- mized and upgraded, but the traditional industries with high energy consumption and high pollution still account for a large proportion. Economic de- velopment is accompanied by changes in population structure. According to statistics, from 2005 to 2018, the urbanization rate of Henan Province increased from 30.65% to 51.72%. Population growth and industrial scale expansion make the resource and environmental carrying capacity of Henan province close to the limit. Although relevant governments have always emphasized the pursuit of green and sustainable development, how to balance the rela- tionship between economic and social development and water ecological protection, change the existing development model and achieve high-quality eco- nomic development is still an urgent problem to be asters are frequent. According to statistics, the an- nual average value of direct economic losses caused by natural disasters in the province from 2014 to 2018 was 8.38 billion yuan, and the affect- ed area of crops was 1.4% × 105 hm2. In order to realize the scientific development, rational alloca- tion, and efficient utilization of water resources in Henan Province, we must build water conservancy projects such as high-quality water supply, flood control, and waterlogging elimination, strengthen non-engineering measures such as disas- ter prediction. At the same time, it also needs a se- ries of advanced technologies to improve the effi- ciency of water resource utilization, improve the water environment, repair the water ecosystem, and reduce flood and drought disasters. How to combine water conservancy projects and technical systems to achieve drinking water safety, water supply safety, and flood control safety will be the focus of further research in the future. and strictest water resources management system, He- nan Province has strictly adhered to the “three red lines”, established and continuously improved the “four systems”, promoted the innovation of the system and mechanism of the same governance of the four rivers, formulated the river director system management system, and reorganized and reformed the relevant departments of water resources man- agement. At present, the government functions of Henan Province are still inconsistent with the re- quirements of ensuring the sustainable and efficient utilization of water resources. In order to ensure the water safety of Henan Province, strengthen the management of water demand and water use pro- cess, formulate a complete set of scientific and ef- fective administrative management systems, and ensure the implementation of various systems is urgent work to be carried out in the future. conservancy industry in Henan Province has expe- rienced a development stage from primary to ad- vanced, especially since the 21st century, with the rapid development of computer network technology, the continuous combination of modern technology and traditional water conservancy technology, so that the traditional water conservancy continues to transform to wisdom. However, “smart water con- servancy” is not only the construction of water conservancy informatization but also the full use of the existing water conservancy construction expe- rience. Based on traditional water conservancy, it organically combines big data, artificial intelligence, and other new generation technologies to intelli- gently handle all kinds of water affairs events and improve the efficiency of water resources manage- ment. At present, the “smart water conservancy” in Henan Province mainly focuses on discussion, re- search, technical preparation, etc., and only some areas rely on some basic network technologies such as 3S to realize real-time monitoring of water re- sources. Combining the existing experience and technology with advanced technology, it is still a great challenge to realize the intellectualization of water conservancy monitoring.",
    "With the deepening of the construction of eco- logical civilization and the marginal decline of the effect of administrative measures, technological innovation will play an increasingly important role in breaking the constraints of resources and the en- vironment and achieving sustainable development. It can be seen from Figure 2 that in order to strengthen the institutional reform of ecological civilization construction and strengthen the utiliza- tion and protection of water resources in Henan Province, it is necessary to treat ecological envi- ronmental protection from the perspective of the fundamental plan related to the sustainable devel- opment of the Chinese nation, combine the charac- teristics of water resources utilization in Henan Province, start from the current challenges, firmly grasp the new opportunities of water resources pro- tection and utilization in Henan Province, and con- The key problems existing in the protection and utilization of water resources in Henan Prov- ince, such as insufficient water resources carrying capacity, aggravated water ecosystem and ground- water pollution, the prominent contradiction be- tween supply and demand, frequent floods, and other disasters, are in the final analysis the contra- diction between water resources protection and economic and social development. Therefore, the Henan government needs to clarify the dialectical relationship between development and protection, determine the important strategic position of water resources protection, and analyze the balance point between water resource utilization and eco- nomic development. It should not only meet peo- ple’s needs for water resources development, but also ensure that it is within the bearing capacity of economy, resources, and natural environment, and ensure the benign evolution of economic society and natural environment. Based on this, the relevant governments must be based on the current and long-term, systematically consider the requirements of open source, throttling, protection, and other as- pects, and establish an economic structure and in- dustrial layout suitable for regional water resources on the basis of ensuring the harmonious relation- ship between resource utilization and long-term stable economic and social growth, so as to realize the determination of production and city by water. In addition, accelerate the construction of ecologi- cal civilization, improve the utilization efficiency of water resources, and lay the foundation for the high-quality economic and social development of Henan Province. At the same time, the rapid eco- nomic and social development also provides greater fund support for environmental protection and promotes the further deepening of environmental governance, so as to create a harmonious and vir- tuous cycle between development and protection[21]. Scientific and technological innovation driving high-quality development has gradually become the consensus of most scholars to solve the problems of water resources protection and utilization, and the promotion and application of these cutting-edge key technologies in social development is the focus and new opportunity to win the battle for clear water and realize the efficient utilization of water re- sources under the new situation. Aiming at the key problems existing in the protection and utilization of water resources in Henan Province, the newly released and updated technical guidance catalog for energy conservation, low carbon, and environmen- tal pollution prevention and control in Henan Prov- ince, as well as other more forward-looking tech- nology integration, can be used as a reference and priority for users such as various industrial enter- prises, industrial technology funds, funds in various green and low-carbon fields, and venture capital institutions in the upgrading and transformation of water resources protection technology. Combined with the actual situation of water resources in our province, some mature and promising cutting-edge key technologies are briefly introduced as follows: 1) Water resources protection. The integrated intercepting well and its control system reduce the pollution of black and odorous water, simulate the optimal operation scheme of the sewage treatment plant, and digital intelligent management system for the urban water environment. Five effectively ste- reo technology for the integrated treatment of hy- drology, the construction and application of digital intelligent management system for urban water en- vironment, the integration of lid (low impact de- velopment) and regulation and storage technology for rainwater purification and reuse, and the reduc- tion of black and odorous water pollution by inter- cepting wells and their control systems. 2) Water saving. Intelligent motors and control systems for the electrical equipment of wa- ter-related enterprises such as tap water, domestic sewage, and industrial wastewater, cascade utiliza- tion technology for industrial and agricultural pro- duction and domestic water for urban residents, new technology for water-saving transformation of the production process, manufacturing technology of high-efficiency water-saving sanitary ware, wa- ter-saving technology for urban rainwater collection, purification and recycling, etc.",
    "3) Resource utilization of industrial wastewater. High salt wastewater and miscellaneous salt re- source utilization technology, high concentration ammonia nitrogen wastewater resource treatment technology, starch sugar electrodialysis desalination technology, acid salt separation and reuse technol- ogy of acid containing high salt wastewater, aniline high color wastewater treatment, and resource ap- plication, new activated carbon adsorption regener- ation wastewater advanced treatment technology, coal mine drainage water preparation desalination technology, etc. 4) Technologies related to water resources in agriculture and aquaculture. High-efficiency micro drip irrigation new technology, livestock and poul- try sewage treatment and biogas residue biogas liq- uid comprehensive utilization technology, research on compound probiotics in reducing river pollution, farm waste gas, kitchen waste treatment, soil im- provement, sewage resource utilization technology, water-saving cloud and soil free plant intelligent cultivation technology, etc. 5) Groundwater. Real-time monitoring and evaluation technology of groundwater in major grain-producing areas, simulation technology of groundwater dynamics in watershed irrigation areas and administrative areas, dual control management technology of groundwater quality and quantity, calculation and post evaluation technology of pres- sure extraction capacity in groundwater overex- ploited areas, groundwater ecological restoration technology, and application, etc. 6) Hydrological environment effect and key technology of water security in Zhongyuan urban agglomeration. Research on the impact of Zhong- yuan Urban Agglomeration on the associated pro- cess of the water cycle, the impact of the social wa- ter cycle on regional water quality and quantity, and the application-oriented development of the com- prehensive regulation platform for hydrological en- vironmental effects of Zhongyuan urban agglomer- ation. 7) Water ecosystem protection and restoration technology. Water ecological restoration and sus- tainable guarantee technology, construction and ap- plication of water ecological civilization system, comprehensive treatment technology and demon- stration of mountains, rivers, and lakes, research, and application of river and lake dredging technol- ogy, river and lake wetland ecological restoration technology and application, water ecological as- sessment and monitoring research, etc. the actual situation of Henan Province, we should establish a water resources management system according to the idea of unified management of the four river basins and coordinated management of administrative regions, strengthen the management of water safety by the water administrative depart- ments of governments at all levels, strengthen the management of groundwater overexploitation and the operation of the South-to-North Water Diver- sion Project, so as to ensure the basic needs of eco- nomic and social development for water resources. At the same time, we should take planning as the starting point and strengthen the “four water simul- taneous governance”, Strictly implement the na- tional water-saving action plan, constantly promote the optimal allocation and scientific management of water resources, and achieve water-saving efficien- cy in agriculture, water-saving and emission reduc- tion in industry, water-saving and loss reduction in cities and towns, water-saving and open source in key areas, etc. In order to promote the construction of water ecological civilization, Henan Province also needs to continue to improve the laws and reg- ulations related to ecological protection, promote the construction of a law enforcement team, com- prehensively deepen the reform of water prices on the existing basis, promote the reform of water re- sources tax, strengthen the national awareness of water conservation, and give play to the supervisory role of the people in water resources management. partments and multiple dragons governing water” and poor coordination ability among departments, a cooperation mechanism should be established, a unified supervision and management organization should be established, and the functions of the management organization should be strengthened. At the same time, due to China’s unique political system, we cannot copy the western administrative management model. We should give full play to the unique advantages of the government, take gov- ernment planning as the command, and establish a water market system that combines administrative allocation and market regulation. In addition, it is also necessary to innovate the government assess- ment mechanism, link the implementation of vari- ous water management policies and water resource utilization efficiency with the government work assessment, strengthen the assessment support, and “force” the government to improve the construction of water resource monitoring capacity and water resource utilization efficiency, promote the devel- opment of water conservation work in the whole society, and speed up the construction process of ecological civilization.",
    "conservancy platform needs to cultivate high-level scientific and technological talents, and strengthen interdisciplinary exchanges in hydrology, water re- sources, water economics, ecology, computer net- works, and so on. In the future, it is necessary to build a complete water conservancy information monitoring system in combination with big data and system network, so as to realize the automation of real-time monitoring of water conservancy infor- mation and the digitization of water system data; combining modern technical means such as Internet of things and 5 g, comprehensively considering multiple factors such as economic and social de- velopment, coupling multiple modules such as wa- ter supply, water demand and flood control, realiz- ing real-time scheduling of water resources, flood control and disaster reduction based on cloud com- puting technology, and building an intelligent water conservancy “module integrated system”; combine smart water conservancy with smart city, build a “decision-making and service system” for smart water conservancy, realize information-based man- agement and intelligent decision-making, achieve refinement of water resources management, and provide platform support for water resources pro- tection, utilization and optimal allocation[22]. A series of documents of governments at all levels and relevant competent departments in Henan Province provide policy basis and cutting-edge key technical support for the protection and utilization of water resources; together, the two have created a foreseeable strategic opportunity for the protection and utilization of water resources in Henan Prov- ince, and these opportunities and challenges require more open thinking, innovative passion, and practi- cal efforts. Looking forward to the future, the con- tinuous innovative application of multidisciplinary cutting-edge technologies, management systems, and models in the field of water resources will per- meate every corner of social and economic devel- opment, help the industrial upgrading and transfor- mation of water resources protection and utilization industry, and open up a new situation of high-quality development of regional economy in Henan Province. I would like to thank the Department of water resources of Henan Province, the development and Reform Commission of Henan Province, and the Department of science and technology of Henan Province for providing relevant data and document support."
]