[
    "1 School of Economics and Management, BeijingInformation Science and Technology University, Beijing, China, 2 Fire Fighting Theory Laboratory, Shanghai Fire Science and Technology Research Institute of MEM, Shanghai,China, 3 Key Laboratoryof Non-coalMine Safety Risk Monitoring and Early Warning NationalMine Safety Administration, China Academy of Safety Science and Technology, Beijing, China Citation: ZhangL, Wang J, Wang X, WangW, Tian X (2024) Research on cross-regional emergency materials intelligent dispatchingmodelin major natural disasters. PLoS ONE 19(7): e0305349. https://doi.org/10.1371/journal.pone.0305349 Copyright:© 2024 Zhang et al. This is an open access article distributedunder the terms of the Creative CommonsAttribution License,which permits unrestricted use, distribution, and reproductionin any medium,provided the original author and source are credited. Data Availability Statement:The datasets used in this paper have been deposited in the public database GitHub at the followinglink https://github. com/jinyu2429/Major-Natural-Disasters.git. national stability and the safety of people’s lives, and cause serious economic losses. How to quickly and accurately dispatch emergency materials to all disaster areas across regions in post-disaster has attracted wide attention from the government and academia. In response to the characteristic of high uncertainty in emergency rescue for major natural disasters, and considering differentiated disaster severity levels in different disaster areas, the entropy weight method is used to determine the urgency coefficient of emergency mate- rial demand for disaster areas. This study aims to minimize the emergency materials dis- patching time and cost, also maximize the dispatching fairness for disaster areas. The triangular fuzzy number method is used to represent the uncertain variables mentioned above, so that a cross-regional emergency materials intelligent dispatching model in major natural disasters (CREMIDM-MND) is constructed. The extremely heavy rainstorm disaster in Henan Province of China in 2021 is selected as a typical case. Based on objective disas- ter data obtained from official websites, this study applies the constructed model to real disaster case and calculates the results by MATLAB. The ant colony algorithm is further used to optimize the transportation route based on the calculation results of the emergency material dispatching for disaster areas, and finally forms the intelligent emergency materials dispatching scheme that meets the multiple objectives. The research results indicate that compared to the actual situation, CREMIDM-MND can help decision-maker to develop a cross-regional emergency materials intelligent dispatching scheme in time, thereby effec- tively improving the government’s emergency rescue performance in major natural disas- ters. Moreover, some managerial insights related to cross-regional emergency materials Funding:This work was supported by the Humanities and Social Science Fundof Ministry of Educationof China [grant number23YJC630229]. Lin Zhang is the administration of this project. Major natural disasters occur frequently around the world, not only posing a threat to national stability and people’s safety, but also causing serious economic losses [1]. China is one of the countries with the most severe natural disasters in the world, characterized by a wide variety of disasters, wide distribution area, high frequency of occurrence, and heavy losses. Especially in recent years, the suddenness and destructiveness of natural disasters have become increasingly obvious [2]. How to effectively coordinate the emergency material demand of each disaster area and the emergency material reserves of each rescue area within the shortest time in major natural disasters. So that to make more effective, economic, and fair emergency material dis- patching schemes, timely complete the transportation of emergency materials, and ultimately improve the emergency response performance of government departments. This important issue needs for urgent discussion. gency materials dispatching, such as multi-objective optimization, fuzzy optimization, path optimization, etc. For example, Liu et al. [3] argued that balancing multiple objectives (such as risk, time, and cost) in emergency rescue is beneficial for improving the effectiveness of emer- gency schemes. Therefore, a hybrid method combining dynamic Bayesian network with graphical evaluation and review technique for evaluating and optimizing emergency schemes is proposed. Wan et al. [4] proposed that large-scale emergencies usually cause extensive dam- age to equipment and facilities, and even communication interruptions, which ineluctably results in the difficulty of obtaining relevant disaster information (e.g., the casualties, the demands of disaster areas, road destructions, etc.). Thus, it’s reasonable to concern more uncertain or fuzzy information for making decisions of emergency material dispatching. For this reason, a bi-objective trapezoidal fuzzy emergency distribution center location model which reflecting the urgency and uncertainty of major natural disasters is established. Since major natural disasters have considerable effects on transportation networks, transportation route optimization for emergency materials dispatching plays an important role in the process of emergency rescue. Nikoo et al. [5] presented a three-objective model to identify the optimal routes for emergency vehicles considering the length, the travel time and the number of routes.",
    "It is worth noting that due to the fact that the coverage of most major natural disasters usu- ally exceeds the jurisdiction of a single region, the emergency materials reserve within the region often results in the difficulty of meeting the demand in disaster area, which requires cross-regional coordination in response to disasters [6]. Although government departments have put this proposal into practice, this study finds that there are still challenges in cross- regional emergency materials dispatching in major natural disasters. 1) Time is life, particu- larly faced with a severe disaster. Successful emergency rescue should meet the requirements of effectiveness in the shortest time [7]. Compared to normal scenario, emergency material dispatching in major natural disasters often exhibits some unique challenges such as degraded transportation infrastructures, unoptimistic weather conditions, insufficient material reserves in disaster areas, and difficulty in obtaining emergency rescue information. All these chal- lenges will cause delays in emergency materials transporting [8]. Therefore, it’s more difficult to control the total dispatching time within the shortest possible range. 2) Scholars point out that the cost of emergency material dispatching should not be ignored while considering the consuming of dispatching time in major natural disasters, since the economic expenditure is tighter than usual [9]. However, cross-regional emergency rescue for major natural disasters often faces geographical dispersion. The increase in emergency materials dispatching distance and the use of a large number of fleets will lead to an enhance in dispatching cost [10]. Thus, it’s difficult to make a trade-off between time efficiency and economic cost. 3) As is known for all, there will be differences of disaster severity in different disaster areas follow a major natural disaster, which leads to different demand urgency of emergency materials in each disaster area. In order to achieve the fairness of emergency materials dispatching, reasonable coordi- nating and dispatching emergency materials according to the demand urgency of each disaster area, which plays an important role in improving the effectiveness of emergency rescue [11]. However, the “cost” and “response speed (i.e., urgency)” of post-disaster emergency rescue activities often arise the confliction in decision-making [12]. Therefore, how to balance the “cost”, “time”, and “urgency” of cross-regional emergency materials dispatching in major nat- ural disasters is a major challenge faced by post-disaster emergency rescue. Based on the above, this study attempts to answer the questions: “What is the appropriate method for cross- regional emergency material dispatching in major natural disasters? How to balance dispatch- ing time, cost, and fairness when facing multiple disaster area?” Although previous studies have their merits in improving the efficiency in terms of emer- gency material dispatching, there are still several limitations on cross-regional emergency material dispatching in major natural disasters. On the one hand, some studies aim to mini- mize the total transportation time and construct optimization models for emergency material dispatching, but less consideration is given to the impact of differentiated disaster severity lev- els on emergency material dispatching [13–15]. Some studies consider the demand urgency of disaster areas and established emergency logistics models, but they have not taken into account the fairness of emergency material dispatching while considering differentiated disaster sever- ity levels [16, 17]. On the other hand, some studies assume that the environment of emergency material dispatching is deterministic, and the parameters in the model are taken as certain numbers [18, 19]. In fact, a high degree of uncertainty usually exists in major natural disasters, which cannot help in making effective emergency decisions. To fill the above research gaps, this study comprehensively takes account into the challenges of emergency rescue in major natural disaster and explores the multi-objective optimization problem of cross-regional emer- gency materials dispatching. The primary contributions of this study are as follows: The remainder of this paper is organized as follows. Section 2 analyzes the literature on the aspects of emergency materials dispatching and transportation route optimization in major natural disasters, and identifies the research gap from existing studies. Section 3 constructs CREMIDM-MND with the objectives of minimizing dispatching time and cost, and maximiz- ing dispatching fairness to multiple disaster areas. In Section 4, this study applies the con- structed model to a typical case of major natural disaster which happened in China. By comparing and discussing the computational results through the model with real data, the fea- sibility of the adopted method and the effectiveness of the constructed model is verified. Sec- tion 5 concludes the paper with some remarks as well as limitations and future research directions.",
    "Emergency rescue is a very important process of emergency management in major natural disasters. Timely and on-demand dispatch of emergency materials to disaster areas is a key task of emergency rescue. Therefore, the academic community has conducted extensive research on this issue and obtained a large number of good research results. In recent years, research on cross- regional emergency materials dispatching in major natural disasters has mainly focus on two aspects: 1) research on emergency materials dispatching, 2) research on transportation route optimization. This section provides a review on these two issues. emergency materials dispatching has become an active research field in recent years [20]. In the face of major natural disasters, efficient emergency materials dispatching is a necessary and essential condition for saving lives and reducing losses [21]. However, as a type of emer- gencies, major natural disasters, due to the characteristics of the suddenness, urgency of time, and the combined effects of various subjective and objective factors, may result in decision- makers being uncertain, and insufficient access to disaster information. Failure to make timely and correct emergency responses can have a negative impact on emergency materials dis- patching, and even let the disasters develop into a more significant catastrophic event [22]. To address this issue, scholars have conducted in-depth research on three aspects, including emer- gency materials dispatching model construction, the uncertainty factors of emergency rescue, and the urgency of emergency materials demand in disaster areas. For example, Ahmadi et al. [23] presented a multi-depot location-routing model considering network failure, multiple uses of vehicles, and standard relief time, which significantly reduce the dispatching time of emergency materials. Ferrer et al. [24] built a multi-criteria optimization compromise pro- gramming model for humanitarian last mile emergency materials distribution in the aftermath of disasters. Sabouhi et al. [25] constructed an integrated routing and scheduling model for evacuation and commodity distribution in large-scale disaster. Dalal and Uster [26] developed an optimization model for determining centralized supply locations, and supply quantities under different transportation modes to respond timely for foreseen disasters. Khanchehzarrin et al. [27] proposed a bi-level multi-objective location-routing optimization model for disaster relief operations considering the dispatching cost, time, efficiency and the supply risk. The complex nature of real-world problems will generate a large number of uncertainty issues [28]. Thus, introducing an effective method to make reasonable estimation of the uncer- tain information is one of the key factors in improving the effectiveness for making emergency decision [29]. Triangular fuzzy number is often used to represent uncertain data in the process of emergency materials dispatching due to the characteristic of easy to express and the func- tion of handling random, fuzzy, insufficient, or imprecise data [30]. Fazayeli et al. [31] argued that due to vagueness of real-world data, triangular fuzzy numbers can better express require- ments. Therefore, emergency materials demand is represented by triangular fuzzy numbers. Wan et al. [4] proposed a multi-period dynamic emergency material distribution model, which uncertain demand and transportation time are described by triangular fuzzy numbers to better fit with the real situation. In addition, in response to the reality of differences in the urgency of emergency materials demand in different disaster areas, multiple criteria decision analysis methods such as entropy weight method, analytic hierarchy process (AHP) method, and the method of technique for order performance by similarity to ideal solution (TOPSIS) are commonly used to solve this problem. For example, Guan et al. [32] forecast the emergency materials demand in post-disas- ter, and the entropy weight-TOPSIS method is used to measure the urgency of affected areas, thereby constructing a multi-objective collaborative emergency material dispatching model. Geng et al. [33] comprehensively used the methods of fuzzy AHP, fuzzy TOPSIS, and multi- objective weighted optimization to optimize the location and quantity of emergency materials. Thereinto, the fuzzy TOPSIS method was used to evaluate the urgency of emergency materials demand in disaster areas. In view of this, it’s of great significance to use scientific methods to characterize the uncer- tainty factors in the process of emergency materials dispatching and accurately evaluate the urgency of emergency materials demand in disaster areas, which is crucial for constructing CREMIDM-MND. vehicles to accomplish transportation tasks in rigidly limited times and harsh environment conditions [34]. In emergency rescue, transportation route optimization is related to whether the emergency materials dispatching efficiency can be enhanced, so as to reduce the life and property losses caused by disasters [35]. Therefore, as an important module for emergency materials dispatching, research on transportation route optimization in disasters has received continuous attention from scholars for many years. For example, Chai et al. [36] proposed a route optimization model based on the relationship between the total routing length and queu- ing delays to reduce the decision time and improve the efficiency of rescue, which makes the transportation route more practical. Yi et al. [37] constructed an optimization model of trans- portation route problems with emergency materials in sudden disasters to reach the best solu- tion in the least amount of time. Xu et al. [38] proposed an efficient transportation route planning scheme based on the mobile cloud computing paradigm, which can be able to sup- port large-scale emergency-management scenarios. Liu et al. [39] construct a multi-objective model of emergency materials transportation routes optimization for large cities in case of an epidemic outbreak, which aimed to achieve the objectives of highest vehicle utilization rate and lowest transportation cost. These studies provide theoretical support and methodological inspiration for the transportation route optimization of emergency materials dispatching. On this basis, in-depth exploration is conducted on how to use advanced methods to solve the transportation route problems, in order to further improve the of transportation efficiency in the process of emergency materials dispatching.",
    "The existing studies show that high-performance algorithms can significantly enhance the likelihood of obtaining the optimal transportation route scheme for solving transportation route problems in emergency materials dispatching [40, 41]. Ant colony algorithm, as a heuris- tic global optimization algorithm in evolutionary algorithms, has the characteristics of distri- bution calculation, positive feedback of information, and heuristic search. Thus, it’s often used to solve transportation route optimization problems [42, 43]. Wang et al. [44] constructed an optimal transportation routing model intending to minimize the combined travel time of all emergency vehicles during post-disaster scenarios, and a hybrid ant colony optimization algo- rithm was used to solve the emergency transportation problems. Wan et al. [45] established a multi-objective multi-constraint emergency material dispatching model based on the principle of ordered arrival, which a hybrid ant colony optimization was proposed to solve transporta- tion route optimization problems. Ferrer et al. [46] developed an elaborated methodology based on ant colony optimization metaheuristic for solving multi-criteria last mile transporta- tion routing optimization problems to provide good quality solutions in a short time. Liu et al. [47] argued that the speed, cost and benefit of vehicle transportation were affected by the route to a certain extent. For this reason, they built an intelligent model based on improved ant col- ony algorithm to optimize the emergency materials transportation route. Based on the above, it can be seen that in the transportation route optimization problems, the ant colony algorithm can help to obtain the optimal transportation route scheme, so as to effectively improve the transportation efficiency, shorten the transportation time and reduce the transportation cost in within the process of emergency materials dispatching. Emergency materials dispatching and transportation route optimization problems are inter- disciplinary research fields involving operations research, logistics, and computer science. The final objectives are to quickly and effectively organize emergency materials dispatching activi- ties, optimize transportation route, and minimize losses caused by major natural disasters [48, 49]. Although scholars have conducted extensive research on these issues, there are still some research gaps: a) when major natural disasters occur, they are often accompanied by the sce- nario of unpredictable risks and information uncertainty. Further in-depth research is needed on how to make reasonable emergency materials dispatching decision in situations where information is incomplete and demand is uncertain [50]. b) Previous studies on emergency materials dispatching and transportation route optimization often focused on decision-mak- ing at a single scale (such as within cities or regions) or with a single objective (time efficiency or economical efficiency) [17]. However, disaster emergency response usually requires deci- sion-making integration of multiple scales (such as adjacent cities or across regions) and mul- tiple objectives (such as time, cost, and fairness). Therefore, research on this area needs to be further explored. Although research on emergency materials dispatching and transportation route optimiza- tion has shown a rapid growth trend in recent years, it’s still in the exploratory phase. Espe- cially in the case of major natural disasters, the issue of cross-regional emergency materials dispatching has not yet achieved a good organic coordination and integration of materials dis- patching and transportation route optimization. Considering uncertainty characteristic of emergency rescue in major natural disasters, this study seeks the optimal solution among mul- tiple conflicting objectives include of reducing dispatching time and dispatching cost, and ensure the dispatching fairness for all disaster areas. CREMIDM-MND based on the combina- tion of entropy weight method, triangular fuzzy number and ant colony algorithm is proposed, which aims to provide support for improving the government emergency rescue performance. Fig 1 depicts the framework for model and methods. Step1 determines the urgency coefficient of emergency materials demand in disaster areas. Step2 descripts the problem and defines the parameter symbols in the model. Step3 constructs CREMIDM-MND with the multiple objec- tives of minimum dispatching time, minimum dispatching cost and ensure maximum dis- patching fairness. Step 4 applies CREMIDM-MND to real disaster case and seeks the optimal transportation route based on the solution results to obtain the final dispatching scheme. Step5 evaluates the performance of the model by comparing the solution results with the real data. Due to the suddenness and uncertainty of major natural disasters, the disaster degree of each affected area will be different. Therefore, the urgency of emergency materials demand varies among different disaster areas. If emergency materials are only dispatched based on the princi- ple of proximity, it may lead to delay of emergency rescue in severely disaster areas, resulting in more serious consequences. For this reason, considering the differences in the urgency of emergency materials demand among disaster areas to reasonably arrange emergency rescue tasks is conducive to providing support for the formulation of emergency materials dispatch- ing scheme, so as to improve the effectiveness of emergency rescue.",
    "3.1.1 Selection of urgency coefficient evaluation index for emergency materials demand. On the basis of the previous studies and considering the availability of data, 5 accu- racy indexes are selected from the 28 basic indexes of disaster statistics in China’s national standard “GB-T/24438.1–2009” to evaluate the urgency coefficient of emergency materials demand for disaster areas in this study [51]. The 5 indexes are as follows: 3.1.2 Determination of evaluation index weight based on entropy weight method. The entropy weight method is originally developed from the information entropy theory which proposed by American scholar Shannon. Its basic idea is that when the probability of each event occurring is the same, the uncertainty of information is maximum, and this degree of uncertainty is called entropy. Conversely, when the probability of some events is higher than others, the uncertainty of the information will decrease, and the entropy will decrease accord- ingly. By calculating the entropy value of each index and converting it into weight coefficients, quantitative comparison and comprehensive evaluation between indexes can be achieved, which is a commonly used multi-index comprehensive evaluation method [52]. Set the set of m disaster areas as D = {D1, D2,���,Dm}, each disaster area in the set has an evaluation index. Let dif be the f-th (f = 1,2,���,a) impact factor index data of the i-th disaster area Di, then the index data matrix is Since the dimensions of all indexes are different, the data cannot be directly compared, so the data needs to be standardized, and the standardized value is In the formula, the constant k ¼ 1 ln m ; 0 � Ef � 1, that is, the maximum value of Ef is 1. 5. Calculation of index’s information entropy redundancy When ef = 0, the f-th evaluation index can be eliminated, and its weight is equal to 0. 6. Calculation of the index’s entropy weight The general weighted summation method is used to determine the urgency score of emer- gency materials demand in each disaster area. Based on the urgency score of each disaster area, the disaster area with the lowest score is used as the benchmark, and the scores of all disaster areas are compared to obtain the relative urgency coefficient of each disaster area, as shown follows. Among them, Qi is the urgency score of the demand for the disaster area i; λi is the urgency coefficient of the disaster area i; Qmin is the minimum urgency coefficient score of emer- gency materials demand for the disaster areas. Assumption Di(i = 1,2,���,m) is the disaster area, and Sj(j = 1,2,���,n) is the emergency materi- als rescue area. Among them, there are R(R>1) types of emergency materials that need to be dispatched to disaster area Di, and k(1�k�R) represents the k-th type of materials. It is known that the emergency materials storage capacity of rescue area Sj is sj. The actual supply quantity of k-th emergency material Rk from the rescue area Sj to the disaster area Di is xk ij. The demand quantity for the k-th emergency material in the disaster area Di is dk i ðdk i > 0Þ. The storage capacity of k-th emergency material in the rescue area Sj is sk dispatching unit cost is cij, and the dispatching time is tij. The decision variable yij2(0, 1) is used to represent the emergency materials dispatching situation from rescue area Sj to disas- ter area Di. When dispatching emergency materials from rescue area Sj to disaster area Di, set yij = 1, otherwise yij = 0. j. The There is usually a shortage of emergency materials in the early stages of emergency rescue. To achieve the objectives of minimizing dispatching time and dispatching cost, and maximiz- ing the dispatching fairness for all disaster areas, it’s necessary to develop the optimal emer- gency materials dispatching scheme. Therefore, it should be calculated the types and quantities of emergency materials supplied by each rescue area to the corresponding disaster areas as soon as possible. In early stage of emergency rescue in major natural disasters, due to the complex geographical environment as well as the fact that disaster information often has a series of characteristics such as uncertainty, complexity, and fuzz, the triangular fuzzy number method can help deci- sion-makers to make the effective decisions. Therefore, this study uses triangular fuzzy num- ber method to represent the uncertainty of the emergency materials demand in different disaster areas and the uncertainty of the dispatching time and dispatching cost. The triangular fuzzy number of emergency materials demand in the disaster area Di is represented as edk i ; edk i ¼ ðdk i1;dk i2;dk i3Þ; the triangular fuzzy number of dispatching time from rescue area Sj to disaster area Di is represented as etij; etij ¼ ðtij1;tij2;tij3Þ; the triangular fuzzy number of dispatch- ing cost from rescue area Sj to disaster area Di is represented as ecij; ecij ¼ ðcij1;cij2;cij3Þ. Accord- ing to the imported triangular fuzzy number of emergency materials demand, dispatching time and dispatching cost, the optimal emergency material dispatching scheme is developed to better achieve the objectives of the minimum dispatching time and dispatching cost, and the maximum dispatching fairness.",
    "3.3.1 Timeliness objective function (Minimum dispatching time). After a major natural disaster, the primary goal to be met is to minimize the emergency materials dispatching time, see Formula (10): Among them, etij represents the triangular fuzzy number of dispatching time from rescue area Sj to disaster area Di, in minutes, yij indicates whether the rescue area Sj provides emer- gency materials to the disaster area Di, if so, set yij = 1, otherwise yij = 0. 3.3.2 Economic objective function (Minimum dispatching cost). The primary goal of emergency material dispatching is to dispatch the emergency materials required by each disas- ter area from the rescue area in the shortest possible time. Under this premise, further realize Among them, xk ij represents the actual supply quantity of the k-th emergency material Rk from the rescue area Sj to the disaster area Di, yij indicates whether the rescue area Sj provides emergency materials to the disaster area Di, if so, set yij = 1, otherwise yij = 0. ecij represents the triangular fuzzy number of the dispatching cost of rescue area Sj to disaster area Di. 3.3.3 Fairness objective function (Maximum dispatching fairness). In order to avoid blindly pursuing the minimum dispatching time and dispatching cost, resulting in the situa- tion of uneven emergency materials dispatching in each disaster area, it’s necessary to ensure that the unsatisfied rate of emergency materials dispatching in each disaster area to be the low- est. That is, the dispatching fairness of all disaster areas is required to be the best [53], as shown in Formula (12): In the formula, f3(x) is the lowest unsatisfied rate of emergency material demand in each disaster area. edk i is the triangular fuzzy number of the disaster area Di’s demand for the k-th emergency material. λi is the urgency coefficient of emergency materials demand in the disas- ter area. 3.3.4 Constraints. The model constructed in this study includes three objective functions: the minimum dispatching time (10), the minimum dispatching cost (11) and the maximum dispatching fairness (12). The constraints are: Eq (13) indicates that the actual demand for emergency materials obtained by disaster area Di does not exceed its own fuzzy demand. Eq (14) indicates that the total quantity of all types of emergency materials provided by res- cue area Sj is not greater than its own reserves. Eq (15) indicates that the minimum satisfaction rate of actual emergency materials obtained by disaster area Di is not less than 80%. Eq (18) indicates whether emergency materials are dispatched from Sj to Di. If emergency materials are dispatched from Sj to Di, yij = 1, otherwise 0. From July 17 to 23, 2021, China’s Henan Province suffered from a rare extremely heavy rain- storm disaster in history, causing heavy casualties and property losses, and many regions in Henan Province were severely affected. Therefore, this disaster is selected as a typical case of major natural disasters in this study. The 6 most severely affected cities Zhengzhou, Gongyi, Xinmi, Xinzheng, Xingyang, and Dengfeng in Henan Province are selected as the disaster areas in this study, which are represented by D1, D2, D3, D4, D5 and D6 respectively. There are usually many uncertain factors in the case of sudden disasters. In order to be more realistic, the following assumptions are proposed in this study: Since the bottled water and instant noodles are usually the immediate necessities for daily life after disaster, while masks are the necessary material for prevention and control the epi- demic during COVID-19, these three kinds of emergency materials all belong to the general materials for disaster relief. Moreover, bottled water, masks, and instant noodles are the three types of emergency materials with the highest demand in this disaster. Therefore, these three kinds of emergency materials are selected as examples in this study, which are represented by R1, R2 and R3 respectively. Based on the above assumptions and according to the population size of each disaster area, this study sets the triangular fuzzy number of emergency materials demand in each disaster area, as shown in Table 1. Due to the extremely serious situation of this rainstorm disaster, emergency materials reserved in Henan Province could not meet the demand of each disaster area. Therefore, tem- porary disaster relief reserves in Changsha, Shenyang, Xi’an, Lanzhou, Wuhan, Tianjin, Jiangsu, Beijing, and Zhengzhou, as well as organizations such as Henan Red Cross Society and the Henan Charity Federation are selected as rescue areas in this study, denoted by S1, S2, S3, S4, S5, S6, S7, S8, S9, S10, S11 respectively. The reserve quantity of emergency materials (bot- tled water, masks, and instant noodles) in these 11 rescue areas is shown in Table 2.",
    "Due to the suddenness and urgency of rainstorm disasters in Henan, it’s necessary to con- sider the uncertainty of dispatching cost and dispatching time when dispatching emergency materials. In this regard, triangular fuzzy number is used to represent the above variables. According to the above assumptions, the triangular fuzzy number of emergency materials dis- patching cost from each rescue area to each disaster area is shown in Table 3, and the triangu- lar fuzzy number of emergency materials dispatching time of from each rescue area to each disaster area is shown in Table 4. In addition, the Amap App is used for distance measurement in this study, thus the distance from each rescue area to each disaster is shown in Table 5. 4.2.1 Fuzzy determination of emergency material dispatching time and dispatching cost. When converting fuzzy number μM(x) = (l, m, μ) into definite value, it’s necessary to comprehensively considerate the decision- maker’s preference and the eigenvalues of the trian- gular fuzzy number. Expected value, as another digital index to measure the size of fuzzy num- ber value, provides an effective method for ordering fuzzy number, so as to avoid errors caused by decision-makers’ preference. For this reason, this study sets l ¼ 1 2, and triangular fuzzy number of the overall expected value is E mMðxÞ ð Þ ¼ 1þ2mþm 4 . For the convenience of subse- quent model calculations, this study uses the defuzzification method of triangular fuzzy num- ber to convert the emergency materials demand, dispatching time and dispatching cost into definite value, which are respectively shown in Tables 6–8. The results of Table 6 show that, comparing to other disaster areas, D1 has the maximum demand for R1, R2 and R3. From the demand data of R1, R2 and R3, it can be seen that the emer- gency materials demand for each disaster area is directly proportional to the number of affected- population. That is to say, the more affected population at a certain disaster area, the relative increase in demand of emergency materials. Therefore, the emergency materials demand of these 6 disaster areas follows the order: D1>D3>D5>D6>D4>D2. Table 7 shows the overall expected value of dispatching cost from each rescue area to each disaster area calculated based on the data in Table 3. From the results of Table 7, it can be seen that among the 11 rescue areas, S1−S8 are located outside Henan Province. The overall expected value of dispatching cost from these 8 rescue areas to each disaster area is greater than the cost value of dispatching emergency materials from the 3 rescue areas within the province S9, S10 and S11 to each disaster area (the data processing in Table 7 is mainly used for subsequent model calculation). Similarly, Table 8 shows the overall expected value of dispatching time from each rescue area to each disaster area calculated based on the data in Table 4. From the results of Table 8, it can be seen that among the 11 rescue areas, S1−S8 are located outside Henan Province. The overall expected value of dispatching time from these 8 rescue areas to each disaster area also greater than the time of dispatching emergency materials from the 3 rescue areas within the province S9, S10 and S11 to each disaster area (the data processing in Table 8 is also used for subsequent model calculation). 4.2.2 Determination of urgency coefficient for emergency material demand. According to the description of the urgency coefficient calculation for emergency material demand in sub-section 3.1, this study collected data of 5 evaluation indexes in 6 disaster areas, including the number of disaster-affected population, dead and missing population, emergency transfer and resettle population, damaged houses and direct economic loss. These data all obtained from the official website of China’s National Natural Disaster Management System, the investi- gation report released by the disaster investigation team of China’s State Council, and official reports issued by various cities in Henan Province, China [54]. Python is used to calculate the emergency material demand urgency coefficient λi of each disaster area in this study, as shown in Table 9. 4.2.3 Model application. The emergency materials dispatching problem that considering the emergency material demand urgency belongs to a typical multi-objective optimization problem. Therefore, MATLAB is used to implementation the model which constructed in this study, and to calculate the dispatching quantity results of R1, R2 and R3, as respectively shown in Tables 10–12.",
    "The results of Table 10 show that, there is a high demand of R1 for D1. Except S11, the other 10 rescue areas dispatch R1 only to D1. S9 and S11 dispatch most of the demand of R1 to D1. In addition, due to the sufficient reserve of R1 in S11, S11 not only dispatches R1 to D1, but also dis- patches an appropriate amount of R1 to the other 5 disaster areas. The results of Table 11 show that, there is a high demand of R2 for D1. Except S9 and S11, the other 9 rescue areas dispatch R2 only to D1. S9 and S11 dispatch most of the demand of R2 for D1. In addition, due to the sufficient reserve of R2 in S9 and S11, these two rescue areas not only dispatch R2 to D1, but also dispatch an appropriate amount of R2 to other 5 disaster areas. The results of Table 12 show that, the demand of R3 by D1 is the highest, the demand of R3 for D3 comes second. All 11 rescue areas dispatch an appropriate amount of R3 to D1, while S3, S9 and S11 dispatch an appropriate amount of R3 to D3. Due to the sufficient reserve of R3 in S11, the demand of R3 for the other 4 disaster areas D2, D4, D5 and D6 are all met by S11. From the above calculation results, it can be seen that when the objectives are the minimum dispatching time and dispatching cost, and the maximum dispatching fairness, the optimal emergency materials dispatching scheme for each disaster area is shown in Table 13. The results in Table 13 shows that, the emergency materials required by D2, D3, D4, D5 and D6 are dispatched from S9 and S11. Due to the limited quantity of emergency materials avail- able in 8 rescue areas outside Henan province, and the distance from these 8 rescue areas to disaster areas is much greater than the distance from 3 rescue areas inside Henan province to disaster areas. For this reason, all emergency materials in rescue areas S1−S8 and S10 are dis- patched to D1. From the dispatching quantity results, it can be seen that the task of emergency materials dispatching for each disaster area will be completed by a certain rescue area, and dis- patching quantity of R1 is greater than the total demand of 6 disaster areas. That is, it can meet 100% of emergency materials demand of all disaster areas. The remaining two types of emer- gency materials (R2 and R3) can meet 80% of the demand for 6 disaster areas. The results also show that, under uncertain situations, when comprehensively considering the objectives of dispatching time, dispatching cost, and dispatch fairness: 1) S9 and S11 can spend minimum dispatching time and dispatching cost to meet the emergency material demand of the other 5 disaster areas except D1; 2) S9 and S11 dispatch the remaining emergency materials reserves to D1; 3) S1−S8 and S10 undertake the task of dispatching the remaining emergency materials for D1. That is to say, the unmet demand of D1 is dispatched in time to achieve the optimal overall dispatching result and the highest satisfaction rate of emergency material demand for each disaster area. In addition, the optimal emergency materials dispatching scheme shows that rescue areas S3, S9, and S11 involve emergency materials dispatching to multiple disaster areas. Therefore, this study uses ant colony algorithm to optimize transportation route based on MATLAB R2022a in the Win 11 operating system environment with 16GB (4800Mhz) of memory. Based on the calculation results of emergency materials dispatching, this study sets the parameters of the ant colony algorithm as shown in Table 14, so as to calculate the optimal scheme of emer- gency materials dispatching transportation route. Through multiple iterations of the program calculation, the optimal scheme of emergency materials dispatching transportation route from the three rescue areas S3, S9 and S11 to each disaster area are finally output, as shown in Table 15. The optimal transportation route dia- grams of S3, S9, and S11 are shown in Fig 2. To sum up, ant colony algorithm with good operability is applied in this study, the optimal solution of emergency materials dispatching quantity is obtained by MATLAB. Then, the ant colony algorithm is used for route optimization to develop the optimal dispatching scheme, so as to achieve the objectives of the minimum dispatching time and dispatching cost, and the maximum dispatching fairness. This will help emergency management decision-makers to for- mulate effective decisions, so that providing support for similar major natural disasters in the future.",
    "The actual data of emergency materials demand required by each disaster area in this rain- storm disaster is obtained from the official websites of relevant departments (Red Cross Society of China), as shown in Table 16. Visualize comparison between the calculation results of the disaster case through CREMIDM-MND and the actual demand quantities of emergency mate- rials required by each disaster area is conducted in this study, as shown in Figs 3–5. Through the comparison, it can be seen that the difference between the dispatching quantity results of R1 which calculated by CREMIDM-MND and the actual demand of R1 in each disaster area is very low, and it can basically achieve a 100% satisfaction rate for demand of R1. Although the actual demand of R2 and R3 is more than the emergency material dispatching calculation results by the model, in fact, the satisfaction rate of emergency materials demand for disaster areas has reached over 80%, as shown in Fig 6. Meanwhile, the results also show that the emer- gency materials demand satisfaction rate of each disaster area is balanced, which can ensure the maximum dispatching fairness of each disaster area while basically meeting the demand. Fig 3 shows that, for the emergency material R1, by comparing the actual emergency materi- als demand of disaster areas with the emergency materials dispatching scheme solved by the model constructed in this study, it can be seen that the actual emergency materials demand of disaster areas is basically the same as the dispatching results calculated by CREMIDM-MND, which can satisfy 100% of demand for disaster areas. In addition, the reserve of R1 in each res- cue area is sufficient, so that can effectively meet the demand of R1 for each disaster area in a short period of time. Fig 4 shows that, for the emergency material R2, by comparing the actual emergency materi- als demand of disaster areas with the emergency materials dispatching scheme solved by CRE- MIDM-MND, it can be seen that although the actual emergency materials demand of disaster areas is larger than the dispatching results calculated by CREMIDM-MND, which can satisfy 80% of the demand for disaster areas. It confirms that the results meet the model assumptions and can roughly satisfy the emergency material demand of all affected areas. Fig 5 shows that, for the emergency material R3, similar to the case of R2, although the actual emergency materials demand of disaster areas is larger than the dispatching results calculated by CREMIDM-MND, which can still satisfy 80% of the demand for disaster areas. It confirms that the results also meet the model assumptions and can roughly satisfy the emergency mate- rial demand of all disaster areas. Fig 6 shows a visual representation of the demand satisfaction rate for R1, R2 and R3 in each disaster area calculated by CREMIDM-MND. From Fig 6, it can be seen that the demand satis- faction rate of emergency materials in each disaster area reaches more than 80% and basically maintain balanced. Therefore, this result confirms that the dispatching scheme calculated through CREMIDM-MND can ensure the maximum dispatching fairness for all disaster areas while basically satisfying the emergency materials demand of all disaster areas. In addition, taking the rescue area S8 as an example, the actual data of emergency materials dispatching time and dispatching cost are compared with the calculation results obtained by the CREMIDM-MND applying to the case, as shown in Fig 7. The results confirm that the dispatching cost and dispatching time obtained by CREMIDM-MND are much lower than the actual dispatching cost and dispatching time in the dispatching process. The above results show that, compared with the actual dispatching data, the dispatching results calculated based on CREMIDM-MND can better meet the objectives of the minimum dispatching time and dispatching cost, and the maximum dispatching fairness for disaster area. The results also confirm that the model proposed in this study has high reliability, and the dispatching scheme based on this model has certain reference value for dealing with similar disasters in the future. Emergency materials dispatching is a very important job in emergency rescue in major natural disasters. As a complex multi-objective optimization problem, it brings challenges and difficul- ties to the government emergency rescue activities. In this study, we make efforts to construct CREMIDM-MND for solving the problem. The main work of this paper is summarized as fol- lows. Firstly, considering the disaster severity level varies among different disaster areas, the urgency of emergency material demand is also different. The entropy weight method is used to determine the urgency coefficient of emergency material demand for each disaster areas in this study. Secondly, comprehensively taking into account the challenges faced by cross- regional emergency materials dispatching and the highly uncertain characteristics of emer- gency rescue in major natural disasters, this study aims to minimize the dispatching time and dispatching cost, and maximize the dispatching fairness for all disaster areas. The triangular fuzzy number method is used to represent the above variables, so that CREMIDM-MND is constructed. Then, the extremely heavy rainstorm disaster in Henan Province of China in 2021 is selected as a typical case, and CREMIDM-MND is applied to the case. The objective disaster relief data is obtained through the official website, and MATLAB is used to calculate the model. Ant colony algorithm is further used to optimize the transportation route of emer- gency materials dispatching, so that the cross-regional emergency material dispatching scheme is developed. Finally, this study visualized and compared the research results with the actual quantity of emergency materials required in each disaster area. The results confirm that the emergency material dispatching scheme based on CREMIDM-MND can better meet the emergency materials demand of disaster areas within a shorter time and a lower cost as well as ensure the fairness, so as to achieve reasonable dispatching of emergency materials across regions.",
    "This study constructs CREMIDM-MND, which has significant management implications for the government to improve emergency rescue performance, so that to maximize the safety of people’s lives and reduce the economic losses caused by major natural disasters. On the one hand, for relevant government departments, when major natural disasters occur suddenly, they should quickly organize emergency rescue activities, obtain sufficient disaster data, and ensure timely and on-demand dispatching of emergency materials to the disaster areas in the shortest possible time. Therefore, the model constructed in this study can meet the emergency materials demand of disaster areas in the shortest time while minimizing dispatching costs, thus providing decision-making support for the government to formulate effective emergency material dispatching scheme. On the other hand, in order to successfully respond to large- scale disasters, it’s necessary to make the reasonable reserve of emergency materials within the region, built emergency logistics systems between adjacent regions, establish a scientific cross- regional emergency materials allocation system, and coordinate with surrounding areas to cope with disasters, which is the future development trend of emergency management. There- fore, the model constructed in this study provides emergency management support for cross- regional collaborative rescue to major natural disasters. Although CREMIDM-MND balances the issue of time, cost, and fairness, emergency mate- rial dispatching in major natural disasters is a very complex problem in reality. Therefore, in addition to the above three aspects, other relevant factors should also be included in the research on this problem. In future work, we will conduct more in-depth research based on the existing foundation. For example, to address the dynamic demand for emergency materi- als, a multi-stage emergency material dispatching model will be studied. When faced with lim- ited transportation capacity, the balance between demand and capacity will be taken into consideration in the research. In addition, the research object will be expanded, other types of natural disasters will be selected, in order to further improve the universality and stability of the constructed model."
]