[
    "Abstract. At present, air pollution has become a major environmental problem threatening human health. PM2.5 concentration is an important indicator to measure air pollution. Studying the distribution and interaction of PM2.5 concentration between cities can provide a scientific basis for air quality monitoring, air pollution control, and the formulation of collaborative strategy for economy and environment in Henan Province of China. According to the PM2.5 concentration data of each prefecture-level city in 2018, we analyze the correlation of PM2.5 concentration between cities in Henan Province of China. Further, we construct a directed complex network of PM2.5 interaction based on Granger causality to explore the directivity of the impact between cities in Henan Province of China. Then, we introduce the “trophic coherence” method in biology to infer the hierarchical structure and stability of the network. The research indicates: (1) there are the evident of seasonal differences in PM2.5 concentration in Henan Province of China. The mean of PM2.5 concentration in the four seasons shows different trends, and there is the relatively obvious holiday effect. (2) In different seasons, the cross-correlation of PM2.5 concentration between cities is different. The cross-correlation between cities in spring and summer shows obvious spatial heterogeneity, and PM2.5 concentration between cities in autumn and winter shows higher spatial embeddedness. (3) The impact of PM2.5 concentration between cities in Henan Province of China has obvious causal directivity. The trophic coherence of the PM2.5-directed network is the smallest in autumn, with the most stable structure, while is with the largest vulnerability in summer. With the development of industrialization level in China, energy consumption continues to accelerate, resulting in increasingly serious PM2.5 pollution problems. PM2.5 refers to fine particles with a diameter of less than or equal to 2.5 microns. The main sources are anthropogenic emissions, including pollution particles directly generated by the combustion of fuels such as coal and gasoline, and the gas pollutants emitted by the chemical industry which are converted into PM2.5 in the air. Other sources include road dust, industrial dust, kitchen fumes, etc. PM2.5 can penetrate into the human lungs and increase the risk of people suffering from various heart and respiratory diseases. Some have pointed out that PM2.5 causes more than 4 million deaths worldwide each year (Apte et al., 2015). Therefore, it is particularly urgent to carry out research on the spatial-temporal distribution, transmission and pollution prevention of PM2.5, which is of great significance for reducing respiratory and cardiovascular diseases and protecting human health. The existing researches on PM2.5 mainly focus on the spatial distribution analysis, temporal evolution characteristics and influencing factor exploration of PM2.5 concentration, and the quantitative calculation, prediction and simulation of PM2.5 concentration in specific spatial-temporal dimensions. The methods used mainly include two categories: one is traditional spatial-temporal statistics and GIS spatial analysis, the other is machine learning algorithm. The former includes autoregressive analysis, APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary Lin et al. (2015) proposed an observation-based algorithm which considers the effect of the main aerosol characteristics, and used this method to quantitatively analyze PM2.5 distribution in China. Ye et al. (2018) explored the distribution rule and the change in the standard-reaching rate of PM2.5 on different time scales, and analyzed its spatial hotspots. Song et al. (2018) conducted a quantitative research on the seasonal differences of NO2 and PM2.5 in Foshan City, and described the spatial variation for daily concentration of NO2 and PM2.5 by geographical semi-variogram function. Yang et al. (2018) studied the spatial distribution, temporal change and evolutionary relationships of PM2.5 based on PM2.5 concentration data. Ye et al. (2019) proposed a new multi-scalar framework based on spatial-temporal integration to better describe the evolving trajectories and characteristics of PM2.5 on different spatial-temporal scales. Yun et al. (2019) used spatial statistical analysis and geographic detector model to reveal the spatial distribution and the change characteristics of PM2.5 and analyze the main influencing factors in the Yangtze River Delta from 2005 to 2015. Hinojosa-Baliño et al. (2019) modeled the spatial distribution of PM2.5 air pollution caused by 37 personal exposures in Mexico City, and used GIS, spatial analysis, and Land Use Regression (LUR) to generate the final prediction model and the spatial distribution map. Guo et al. (2020) studied the spatial distribution of PM2.5 of the complex terrain in Jincheng of China using Weather Research and Forecast (WRF) model/California Puff Model (CALPUFF) modeling system. Wang et al. (2020) used exploratory spatial data analysis and geographically weighted method to analyze the spatial distribution characteristics of PM2.5 pollution and the spatial heterogeneity of its influencing factors. Wang et al. (2020) used spatiotemporal autoregressive (STAR) model to quantify the short-term dynamic change process of PM2.5. Tan et al. (2020) developed an eigenvector spatial filtering based spatially varying coefficient (ESF-SVC) model to estimate PM2.5 concentration of the ground. Wang et al. (2020) collected PM2.5 samples from three representative locations in Yantai City, and analyzed mass concentration and chemical composition characteristics of these samples. Then they used Chemical Mass Balance (CMB) model to perform the source apportionment on environmental air receptors, and analyzed the spatial distribution characteristics of PM2.5. Li et al. (2021) evaluated the sparse PM2.5 measurement values captured at decentralized monitoring sites using dynamically constrained interpolation methodology (DCIM) to simulate the nationwide PM2.5 spatial distribution. Wang et al. (2021) combined Kriging spatial interpolation technology, geographic detectors and other methods with GIS platform to analyze the characteristics of temporal change, spatial distribution and influencing factors of PM2.5 concentration in Changsha City. Wang et al. (2020) proposed a framework of joint prevention and collaborative governance of PM2.5 With the development of artificial intelligence (AI), methods related to machine learning are applied to the research of the distribution and prediction for PM2.5 concentration. Zhan et al. (2019) inferred and analyzed the two periods of the spatial- temporal distribution of PM2.5 in winter in Wuhan City using a machine learning method, Gradient Boost Decision Tree (GBDT). Wang et al. (2019) constructed a Random Forest (RF) model and estimated actual exposure level of the population to PM2.5. Wu et al. (2019) used optimized ensemble learning method to highlight the most important meteorological and surface variables related to PM2.5 concentration, and examined these variables through multiple linear regression models to provide physical mechanistic APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary insights into the morphology of the PM2.5 annual cycles. Lin et al. (2020) believed that comparing with other land use types, industrial land has a greater impact on PM2.5 concentration. Wang et al. (2021) developed a workflow to predict PM2.5 concentration by the long short-term memory (LSTM) model, predicted the PM2.5 concentration in the next year, and generated a high-resolution spatial distribution map of PM2.5 concentration.",
    "the long short-term memory (LSTM) model, predicted the PM2.5 concentration in the next year, and generated a high-resolution spatial distribution map of PM2.5 concentration. Since the small-world model proposed by Stogatz and Watss and the scale-free network model proposed by Barabasi and Albert (Watts et al., 1998; Barabasi et al., 1999), the complex network had become the focus of system science research and had been widely used in many fields, such as finance and trade (Liu et al., 2020; Zhang et al., 2020), population migration (Zhao et al., 2018; Shen et al., 2020) and transportation (Xu et al., 2020; Gao et al., 2018). However, in environmental science, especially in the research of PM2.5 pollution between cities, the complex network analysis method is in its infancy. A small number of scholars used the complex network analysis method to research the spatial-temporal distribution of PM2.5. Zhang et al. (2014) used the algorithm of the shortest augmenting chain to build a capacity network model of urban PM2.5 diffusion based on the complex network theory, which realized the exploration for the physical process of PM2.5 regional diffusion. Fan et al. (2016) used the correlation coefficient method to construct a complex network and analyzed the topological characteristics of air quality data. Xue et al. (2015) constructed a weighted network based on PM2.5 concentration between cities, and used the Girvan Newman (GN) algorithm for community division, aiming to obtain the regional spatial distribution of PM2.5. Ma et al. (2018) constructed an undirected weighted network based on PM2.5 concentration between cities, and used indicators such as node degree, clustering coefficient, network efficiency and vulnerability to measure the importance of nodes. Zhang et al. (2018) established a correlation model for complex network, and used long-term PM2.5 concentration data to divide highly relevant regions within China. Xiao et al. (2019) applied the complex network method to the research of air pollution index PM2.5, and the analysis showed that the method can effectively analyze the main polluted cities. Li et al. (2019) used discrete wavelet transform, GARCH-BEKK model and complex network to construct an overflow network of multi-time scale. Wang et al. (2019) built a directed weighted network model using the transfer entropy method based on complex network to study the interaction of smog between cities. Zhang et al. (2020) carried out the study of structure characteristic for smog pollution based on complex network analysis methods. Traditional methods, such as mathematical statistical analysis, geostatistical analysis and GIS interpolation (e.g. Kriging interpolation), are used to research the spatial- temporal distribution of PM2.5 concentration. Although these methods can excavate the spatial-temporal heterogeneity of PM2.5 in detail, they still consider the spatial-temporal distribution of PM2.5 concentration as a static characteristic to investigate, which lacks the exploration of the dynamic distribution and evolution of PM2.5 from the perspective of interaction. PM2.5 pollution presents the characteristics such as high frequency, wide spread, long duration and difficulty in governance (Ning et al., 2020), and has regional mobility. The PM2.5 concentration in a region are not only affected by the emission of local pollution sources, but also transmitted and exchanged with the pollutants around the regions. This is the basis for using the complex network method to research PM2.5. The concentration distributions of PM2.5 in different regions will affect each other, so as to form a complex network relationship. The existing researches on PM2.5 based on complex network mainly analyze the distribution characteristics of PM2.5 from the APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary perspective of complex network structure, such as analyzing the individual characteristics of node cities in the network and dividing local communities. There is a lack of relevant research on the interaction of PM2.5 distribution between cities from the perspective of the whole region, and a lack of exploration and explanation of the causal directivity of relevant impacts. Aiming at the above problems, based on the PM2.5 concentration data of 17 prefecture-level cities in Henan Province in 2018 from China National Environmental Monitoring Station, we use Cross-correlation analysis method to analyze the correlation of PM2.5 between prefecture-level cities, and adopt Granger causality test to determine the causal directivity of the interaction of PM2.5 between the cities. On this basis, we construct a PM2.5-directed network between prefecture-level cities in Henan Province, and analyze the PM2.5 interaction relationship between cities in Henan Province and the dynamic characteristics of each city node. Further, we introduce the trophic consistency index in biology to explore the hierarchical structure and stability of the PM2.5 network in Henan Province, and then excavate the spatial-temporal heterogeneity of the PM2.5 concentration distribution in Henan Province and the causal directivity of interaction between prefecture-level cities, which is expected to provide a scientific basis for air environment governance in Henan Province. This research analyzes the correlation of PM2.5 concentration between cities in Henan Province from the perspective of complex network, and then gives causal directivity of the PM2.5 network between the prefecture- level cities in Henan Province through the results of Granger causality test, which provides a new technical way for the dynamic characteristic analysis and interaction relationship of each city node. It is helpful to clarify the causal mechanism of the complex interaction relationship of PM2.5 between the prefecture-level cities in Henan Province, which can provide scientific basis for air quality monitoring, air pollution governance and even the formulation of collaborative strategy for economy and The research area is Henan Province in central China (E110°21’ ~ 116°39’, N31°23’ ~ 36°22’), and the terrain is high in the west and low in the east. It has 17 prefecture- level cities, with a total area of 16.7 × 104 km2. Henan Province is located at the junction of coastal open regions and the central and western regions and is the middle zone of Chinese economic development from east to west.",
    "The research data, the concentration data of PM2.5 in the 17 prefecture-level cities in Henan Province, comes from the real-time release platform of national urban air quality of CNEMC (China National Environmental Monitoring Centre). The timing interval of data is an hour, and the distribution of air monitoring stations is shown in Figure 1. In the research, the seasonal timescale is divided into 4 windows: the first window (spring) from March 1st to May 31st, 2018, the second window (summer) from June 1st to August 31st, 2018, the third window (autumn) from September 1st to November 30st, 2018, the fourth window (winter) from December 1st, 2018, to February 28st, 2019. We perform preprocessing such as integration, cleaning, etc. on the data to prepare for further research. APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary Cross-correlation analysis is a measure that examines the change of two or more sets of time series data relative to each other (Davis et al., 2002). For two time series x and y, the cross-correlation is: In the equation, m is the time lag coefficient. For positive lag, x is compared with y which has delayed m samples. Therefore, the high correlation value of positive lag means that the characteristic in y takes the lead, while the characteristic in x lags behind. For negative lag, the characteristic in x takes the lead. In the research, the two time series in the cross-correlation analysis are aligned, that is, the time lag coefficient is 0. The range of rm is [–1.0,1.0]. The closer the value of rm is to 1, the stronger the correlation between series data is. In order to compare the similarity of PM2.5 concentration time series of each pair of cities in the current research, the hourly based cross-correlation of PM2.5 concentration of all stations (136 pair of cities) in the four season windows of spring, summer, autumn and winter is calculated according to the above equation to examine the impact of seasons on the correlation of PM2.5 time series. Granger causality test is used to determine whether the historical information of one time series is helpful to predict the current value of another time series, which measures the ability for a prior value of one time series to predict the value of another time series. By testing the causality of city pairs, the research infers whether a city will have an impact on PM2.5 of the target cities, so as to mine the dynamic causality of PM2.5 APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary between cities. In order to test whether there is Granger causality between PM2.5 time series of the two city nodes X and Y in Henan Province, the following time series are constructed: In the equation, and are respectively PM2.5 time series of city nodes X and Y. and are respectively regression coefficients of and , and is the residual term. , , and are the maximum lag orders. If in the above equation (Eq. 2), the time series is the Granger cause of the , that is, PM2.5 concentration of city Y effects on city X. In Equation 3, if , the time series is the Granger cause of the , that is, the PM2.5 concentration of city X effects on city Y. If both equations (Eqs. 2 and 3) hold, it shows that there is two-way Granger causality between the and time series. It is worth noting that a precondition for Granger causality test is that the time series must be stationary, otherwise may arise the problem of false regression. Because the time series of PM2.5 are not stationary, it is necessary to detrend the data before using Granger causality test. After detrending, it is necessary to conduct Augmented Dickey Fuller (ADF) test for the time series. If ADF test concludes that contain a unit root in the time series, the series is not stable. Then it is necessary to make further difference for the time series data until the series is stable. To maintain the stability of the model, the research chooses the optimal lag coefficient to be 7 based on Akaike Information Criterion (AIC). It performs Granger causality test for each pair of cities in undirected correlation networks of different seasons, then, when the -value is below the level (5%), the original hypothesis is denied. The direction of Granger causality is determined by the side with the lower value of . For example, the -value of PM2.5 concentration in Xinxiang City affecting that in Luoyang City in autumn is in the research, while the -value of PM2.5 concentration of Luoyang City affecting that of Xinxiang City is . Since , it is believed that the PM2.5 concentration in Xinxiang City will have an impact on Luoyang City.",
    "The research calculates Granger causality of each city pair on the basis of the undirected network, and constructs the direction of the network link of city pairs according to Granger causality, then upgrades the PM2.5 network from undirected network to directed network. According to this, the causal directivity between city nodes in PM2.5 network of Henan Province can be analyzed. The research introduces trophic coherence (Moutsinas et al., 2019) of biology to reconstruct the grade structure of PM2.5-directed network and mark the grade levels. The trophic level comes from the food chain and predator level and it has been proved to be an index that infers the stability of large-scale directed network in the absence of clear definitions of input and output (Pagani et al., 2019). To define trophic coherence in a direct causality network, we should first define the basal nodes. We define the nodes APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary with a low trophic level as the basal nodes, that is, the pollution affects the cause node in relationship, and define the nodes with a high trophic level as the nodes affected by pollution. When basal nodes and affected nodes are difficult to determine due to the complicated directional relationship between nodes, the basal nodes are the nodes with more outward directional relationships. The trophic level (si) of node 𝑖 is defined as the average trophic level of adjacent nodes pointing to 𝑖 plus one: In the equation, is the adjacency matrix, is the number of nodes pointing to 𝑖, the nodes where are defined as the basal nodes, representing the cause nodes that affect other nodes in PM2.5 transmission. The trophic level is set to for the basal nodes. The trophic level of the non-basal nodes in the network is the average trophic level of all the monitoring stations from which it receives PM2.5 pollutants plus one. The trophic difference is the difference in trophic level between two nodes connected by an edge in the network, defined as: represents the distribution of network trophic difference, with a mean value of 1. The standard deviation of is called as the trophic non-coherence parameter, and the parameter is used to measure the trophic coherence of the network: In the equation, is the number of connected edges between nodes of the network. The smaller the -value, the stronger the trophic coherence of the network, the more unstable the network, and the greater the vulnerability. The mean of PM2.5 concentration of 4 seasons in various cities is counted, and the characteristics of time distribution for PM2.5 in Henan Province from March 2018 to February 2019 are examined on a seasonal scale, as shown in Figure 2. The mean of PM2.5 concentration of each prefecture-level city in Henan Province in winter is apparently higher than that in the other three seasons. The PM2.5 pollution of winter is the most serious, and the PM2.5 concentration is higher than the threshold of for the second-level air quality (good) specified in the national standard (GB3095- 2012). Among them, Anyang City has the highest mean of PM2.5 concentration in winter that reaches 132.3 and is higher than the threshold of for the third-level air quality (lightly polluted), so it is more polluted than the other cities. Thus, APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary it can be seen that Henan Province should place the focus on PM2.5 prevention in winter and strengthen the treatment measures for regions with high PM2.5 pollution in winter, such as Anyang City. In spring and autumn, the mean of PM2.5 in various cities is similar, between and , which is higher than the threshold for the first-level and lower than the threshold for the second-level specified in the national air quality standard. Among them, the concentration difference in Zhoukou City is the largest, reaching , indicating that the fluctuation of PM2.5 pollution in Zhoukou City is relatively large. The mean of PM2.5 concentration of all cities in summer is the lowest and fluctuates around . The air quality of most cities is within the range of the first-level threshold, which indicates that PM2.5 pollution is the least and air quality is the best in summer of all cities in Henan Province.",
    "The time scale is further subdivided on the seasonal scale, and the change in the mean of hourly PM2.5 concentration of each season in each prefecture-level city is calculated, as shown in Figure 3. It can be seen from the figure that the changing rule of PM2.5 concentration in various cities as follows: (1) In winter, the range of hourly mean concentrations of various cities in Henan Province is the highest, and the overall range is between and The pollution level is the third level, and the pollution degree is significantly higher than that in other three seasons. In spring and autumn, the range of hourly mean concentrations in various cities is basically the same, most of which are within 30- 80 , and the grade of air quality is good. The mean of hourly concentration of each city in summer is between and , and the grades of air quality are excellent and good. . (2) The trend in various cities in autumn is the same. Except for the obvious deviation of the mean of PM2.5 concentration between Anyang City and other cities from 7 o’clock to 17 o’clock, the overall deviation in autumn from 1 to 24 h in each city is small. It indicates that the fluctuation of air quality is small in autumn. The maximum APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary (3) The change of PM2.5 concentration in various prefecture-level cities in winter from 1 to 24 h is consistent with the trend in autumn. The PM2.5 concentration of them all develop in a steady state from 1 to 11 h. After 12 o’clock, the mean of PM2.5 concentration shows an obvious downward trend and reaches the lowest point from 17 to 19 o’clock. Then, PM2.5 concentration begin to show an upward trend after 19 o’clock. APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary (4) The concentration in spring generally presents a more obvious double-peaks trend. PM2.5 concentration in various prefecture-level cities shows a significant upward m 8 ’c ck 9 ’c ck p k v m 9 ’c ck 2 ’c ck. The mean of PM2.5 concentration decreases significantly after 12 ’c ck c p m 8 ’c ck 20 ’c ck. W m p 20 ’c ck v c m p k 2 ’c ck. (5) There is a big difference in the mean change of hourly PM2.5 concentration of various cities in summer. For example, the mean change of hourly PM2.5 concentration APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary is relatively small and basically tends to be flat in Nanyang City and other cities. While c “ ” p S q C c ies, the mean of hourly PM2.5 concentration has evident changes. The mean of monthly PM2.5 concentration in each city is calculated, as shown in Figure 4. In spring, the mean of PM2.5 concentration in each city is higher in March and is all lower from May to September. Compared with other months, the mean of PM2.5 concentration in January and February in various cities is significantly higher. Among them, the cumulative mean of PM2.5 concentration in Anyang City is the highest throughout the year and is the lowest in Xinyang City. It shows that even in the same season, there are still difference of different degrees between different months. In order to examine whether there is holiday effect in the change of PM2.5 concentration of holidays, three periods are respectively taken from September 25, 2018 to September 30, 2018, October 1, 2018 to October 7, 2018, and October 8, 2018 to October 12, 2018. These periods are regarded as three research intervals before, during and after National Day, excluding three non-working days of September 24, October 13 and 14. The mean of PM2.5 concentration of each city in Henan Province during these periods is counted, and the visualization analysis is carried out by combining the inverse distance interpolation method, as shown in Figure 5. The mean of PM2.5 concentration of each prefecture-level city in Henan Province before National Day is in a lower position in general, and the highest mean of PM2.5 concentration is no more than 20 in this period, that is, the air quality is the first-level (excellent). The mean of PM2.5 concentration during and after National Day is apparently higher than that before National Day. The air quality in almost all regions exceeds the threshold for the second- APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary During National Day, multi-factors such as the large population flow and large traffic volume cause the significant increase of PM2.5 concentration in each city. The regions with high PM2.5 concentration during National Day are mainly located in Kaifeng City, Luohe City and other regions in the east and Puyang City in the northeast. After National Day, the mean of PM2.5 concentration is still high in the whole province, and PM2.5 concentration in some cities is even higher than that during National Day. Combined with the weather conditions around National Day in Henan Province in 2018, the weather was relatively good. In addition to a few regions with sporadic light rain in some periods, the weather was mainly sunny, and the whole region was mainly breeze without strong wind weather. During this period, the atmosphere was stable and this situation did not effectively settle and dilute the PM2.5 particles generated during the National Day. Therefore, the PM2.5 concentration in all cities in Henan Province still remains high after the National Day.",
    "According to Equation 1 in “Methodology,” the cross-correlation degree of each city pair in Henan Province is calculated, among them, the results in winter are shown in Table 1. There are 17 prefecture-level cities in Henan Province. According to the PM2.5 time- series cross-correlation between the prefecture-level cities calculated above, it is judged whether there is a correlation between city pairs. The cross-correlation threshold of the city pair is set to 0.7 (Gehrig et al., 2003). When the cross-correlation value between the two cities is greater than the threshold, there is a correlation between the two cities and can establish an edge relationship. Taking the city pairs with correlation as nodes, we construct the undirected correlation network of each season in Henan Province. The four PM2.5-undirected correlation networks constructed according to different seasons are shown in Figure 6. APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary It can be seen that the 17 prefecture-level cities in Henan Province present a relatively obvious spatial characteristic of north-south division. Therefore, they are divided into two groups, the southern Henan and the northern Henan. The northern Henan group includes Anyang City, Hebi City, Xinxiang City, Sanmenxia City, Jiaozuo City, Puyang City, Kaifeng City, Zhengzhou City, Luoyang City and Shangqiu City. The southern Henan Group includes Xuchang City, Luohe City, Nanyang City, Zhoukou City, Pingdingshan City, Zhumadian City, and Xinyang City. The cross- correlation relationship of PM2.5 concentration for prefecture-level cities in Henan province is different in different seasons. Among them, the southern and northern Henan groups have obvious identification in spring and summer. In spring, compared with the southern Henan group, the cross-correlation between the cities in the northern Henan group is closer. In autumn and winter, the correlation between the cities is still very high within the two groups, but the number of city pairs, composed of two cities in different groups, with high correlation becomes larger. Since the influence of the spatial distance between cities on the change of PM2.5 concentration between regions cannot be ignored, the research studies the spatial embeddedness of the cross-correlation network of PM2.5 concentration between the APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary various cities in Henan Province. To quantify the level of spatial embedding, the pairs of cross-correlated cities are divided into three groups based on the linear distance between two cities (<100 km, <200 km and >200 km). Table 2 shows the relationship of the cross-correlation and the distance of each city pair (Table 2). Table 2. The relationship between cross-correlation (XCROSS) of the hourly value of PM2.5 and the city distance in Henan Province The spatial embedding degree of the network is very high in all seasons when the distance is smaller than 100 km, and it decreases when the distance increases to over 200 km. In spring, autumn and winter, the number of city pairs with a distance of 100 to 200 km is more than that of city pairs with a distance less than 100 km in the northern Henan group. The proportion of city pairs with a distance less than 100 km in the southern Henan group is respectively 60%, 100%, 38% and 50% in spring, summer, autumn and winter. In spring and summer, the number of city pairs with a distance more than 200 km in the southern and northern Henan groups is both 0. On the basis of the above undirected cross-correlation network of PM2.5. Equations 2 and 3 in “Methodology” is used to carried out Granger causality test for cross-correlated city pairs. It is found that -value of corresponding Granger causality of city pairs with high cross-correlation is low (less than 5%). According to the calculation results, in spring, the PM2.5 concentration in Zhengzhou City can affect that in Luoyang City, corresponding to , that is, the PM2.5 concentration time series in Zhengzhou City can predict that in Luoyang City, the PM2.5 concentration in Pingdingshan City can affect that in Luohe City, corresponding to . In APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary summer, the PM2.5 concentration in Luohe City can affect that in Zhumadian City, and the -value is . In winter, the PM2.5 concentration in Zhoukou City can affect that in Xuchang City, and the -value is . The PM2.5 concentration in the prefecture-level cities of Henan Province shows different interaction relationships in each season.",
    "Based on the Granger causality test results, we determine the causal directivity of the impact between city nodes. According to this, we construct a directed Granger causality network for PM2.5 in Henan Province and further excavate the causal relationship of PM2.5 concentration between cities. The specific method is to define the 17 prefecture- level cities as network nodes, if the PM2.5 concentration at city node i can impact the PM2.5 concentration at city node j, then a directed edge relationship is established between the two nodes, that is, the directed edge from node i to j. The constructed PM2.5-directed causal network in Henan Province is shown in Figure 7. As shown in Figure 7, there are more independent nodes in summer and the interaction relationship of PM2.5 between prefecture-level cities is weaker. The PM2.5 concentration values are generally lower in summer, and due to more precipitation, the scouring of rainwater further weakens the interaction of PM2.5 between regions. In the four seasons, Sanmenxia City exists as an independent node, which is neither affected APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary by the PM2.5 of other cities nor any effect on them. This is mainly due to the fact that Sanmenxia City is located in the junction of the eastern extension of the Qinling Mountains, the Funiu Mountains, Xionger Mountains and Xiao Mountains, with an average altitude of 300 to 1500 m. The landforms are mainly mountainous and mostly covered with vegetation, which is not conducive to the accumulation of PM2.5 particles, and makes the local PM2.5 pollution degree in Sanmenxia less obvious. At the same time, the straight-line distance between Sanmenxia City and the rest of the prefecture- level cities in Henan Province is more than 100 km, which is relatively far away, and makes it difficult for Sanmenxia City to have an interaction with the other cities on PM2.5. In order to further clarify the mechanism and hierarchical structure of PM2.5-directed network, we use the trophic coherence method in “Methodology” to divide the hierarchical structure of directed network. On the basis of Granger causality directed network in the four seasons, the nodes with the in-degree of 0 are defined as the basal nodes, and the trophic level is 1. The trophic levels of other nodes in the four seasons are calculated according to Equation 4, as shown in Table 3. According to the trophic coherence principle, in the PM2.5-directed network of Henan Province, the cities with low trophic level are the basal nodes, that is, the city nodes that have an impact on PM2.5 in other cities. While the cities with high trophic level are more affected by PM2.5 in other cities. In the PM2.5-directed network, the causal directivity is from the city nodes with low trophic level to that with high trophic level. As can be seen in Table 3 that the highest trophic level in spring is Nanyang City, reaching 5.58, far higher than the highest trophic level in the other three seasons. It shows that the PM2.5 distribution of Nanyang City is affected by many other cities. According to the directivity of the network, its PM2.5 is affected by cities such as Pingdingshan and Luohe. In spring, the trophic levels for city nodes of the southern Henan group is generally higher than that of the northern Henan group. It is thus clear that the source regions of PM2.5 pollution in spring are mainly concentrated in the cities of the northern Henan group, for which we should consider strengthening the prevention of PM2.5. In summer, the overall trophic level of Henan Province is the lowest, among them, Jiaozuo City has the highest trophic level of 4.5. In autumn, there are the most basal nodes, that APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary is, the cities that play the role of pollution source are the most. While the PM2.5 in Xinyang City is most affected by other cities, and its trophic level of 4.04 is the highest. In winter, there are 3 basal nodes, that is, there are 3 cause nodes that act as PM2.5 transmission sources. Xinyang City is still at the highest trophic level of 4.5 in winter, which indicates that PM2.5 in Xinyang City is more seriously affected by other cities. Its pollution control should not only control itself, but also control the output cities combining the causal directivity in the directed network.",
    "By calculating the trophic level, PM2.5-directed networks are further divided into different hierarchical structure, as shown in Figure 8. In the figure, based on the parameter definition, the basal nodes with low trophic level represent PM2.5 transmission source nodes, while the nodes with high trophic level are receptors in the causality network. It can be seen from Figure 8 that Anyang City and Puyang City with low trophic level are classified as PM2.5 transmission sources in spring, and Nanyang City and Shangqiu City are classified as PM2.5 transmission sources in winter. Among them, in addition to being at the second trophic level in summer, Anyang City is located in the basal nodes of the first trophic level in spring, autumn and winter. That is, its PM2.5 pollution is serious and affects the distribution of PM2.5 in other cities. Geographically, Anyang City borders the haze-prone Hebei province and is close to Handan City. As a APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary result, Anyang is highly susceptible to the impact of PM2.5 concentration in Hebei Province, which can then develop into a pollution source of in Henan Province. Further considering its industrial structure, Anyang is an important industrial production base in Henan Province and has initially formed an industrial system dominated by metallurgy, electronics, machinery, chemicals and others. The industrial structure dominated by industry is bound to increase PM2.5 pollution emissions. Anyang City is always located in the pollution source position of the first trophic level as a result of internal and external causes. In response to this situation, Anyang City should actively optimize the industrial structure and proactively accept high-tech industries to reduce PM2.5 emissions. Using Equation 6 in “Methodology,” the standard deviation of the network trophic difference distribution is calculated. Then, the consistency results of seasonal causality networks are obtained, as shown in Table 4. The larger the q, the weaker the trophic coherence of the network and the more stable the network. The results in Table 4 show that the season with the weakest trophic coherence in Henan Province is autumn, the q-value is 0.97, and the stability of the PM2.5 network is the strongest (Table 4). The season with the strongest trophic coherence is summer, the q-value is 0.23, and the vulnerability of the PM2.5 network is the largest. Precipitation in Henan Province is mainly in summer, and the scouring effect of rainwater can effectively reduce the PM2.5 concentration in the air, so the vulnerability of the PM2.5 network in summer of Henan Province is the largest. While because of the relatively small precipitation and the northeasterly and northerly winds in autumn, pollutants from north China and northwest China are hoarded over Henan Province. At the same time, rising temperature is likely to cause stable weather and gradually form the inversion layer, and the meteorological conditions are gradually stabilized, which is adverse to the deposition and diffusion of PM2.5, so the stability of the PM2.5 network in autumn of Henan Province is the strongest. It can provide decision support for the pollution prevention of PM2.5 in Henan Province through the above differences obtained in the stability and vulnerability of the network in different seasons by the trophic coherence of the PM2.5 network in Henan Province. According to the above research results, we discuss the spatial-temporal distribution of PM2.5 in Henan Province as follows, and put forward the suggestion on the pollution prevention of PM2.5. APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary (1) The results of cross-correlation and Granger causality test show that there is a certain causal relationship for the PM2.5 concentration between cities in Henan Province. Therefore, the problem for the pollution prevention of PM2.5 cannot be viewed in isolation. The idea of joint prevention and collaborative governance of PM2.5 pollution in the region should be established, so as to achieve the common governance and prevention of the air environment. (2) The trophic coherence analysis for the PM2.5-directed network of Henan Province shows that the pollution situation in different seasons within the province is different, and the vulnerability of the PM2.5 network is also different. Henan Province should focus on the strengthening the pollution prevention in autumn and winter, and carry out pollution prevention work of PM2.5 in a targeted manner based on the situation of trophic levels of each prefecture-level city in the four seasons.",
    "(3) The calculation results of trophic levels for the PM2.5-directed network of Henan Province show that the prefecture-level cities that are located at the transmission source of PM2.5 include Anyang, Puyang, Zhoukou, Kaifeng, Xuchang, Jiaozuo, Nanyang, and Shangqiu. In these cities, it is necessary to establish joint supervision departments for key regions to emphatically strengthen the pollution prevention work of PM2.5 in basic node cities. It should strengthen the intensity of supervision and actively optimize the industrial structure to reduce the probability of PM2.5 pollution emissions. According to PM2.5 concentration data from seventeen prefecture-level cities in Henan Province in 2018, the research analyzes the characteristics of the temporal distribution of PM2.5 concentration using descriptive statistics and inverse distance interpolation method. The result shows that there are significant seasonal differences in PM2.5 concentration in Henan Province, with the highest in winter and the lowest in summer, and the means in spring and autumn are similar. The hourly mean of PM2.5 concentration shows different trends for each season, and PM2.5 concentration between different months within the same season is not completely consistent. At the same time, by analyzing and visualizing the mean of PM2.5 concentration in three research periods around the National Day holiday, we find that the mean of PM2.5 concentration within the province during and after National Day is significantly higher than that before National Day, and there is a relatively significant holiday effect caused by human activities. We further analyze the correlation of PM2.5 concentration between prefecture-level cities in Henan Province using the methods such as cross-correlation and Granger causality test, and construct a directed network based on Granger causality to excavate the directivity of the interaction of PM2.5 concentration between cities. Meanwhile, we introduce the trophic coherence to explore the hierarchical structure and stability of the PM2.5 network in Henan Province. The research shows that the cross-correlation of PM2.5 concentration between the prefecture-level cities of Henan Province in each season is different. In spring and summer, the cross-correlation between the cities within the province has significantly spatial differentiation, showing two groups, namely, southern and northern Henan. In autumn and winter, the cross-correlation of PM2.5 of city pairs within the province is closer, with higher spatial embeddedness. In the four seasons, the impact of PM2.5 concentration between the cities within Henan province has significant causal directivity. The trophic coherence of the PM2.5-directed network is the smallest in autumn, with the most stable structure, while is with the largest vulnerability in summer. APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 20(4):3033-3056. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2004_30333056 © 2022, ALÖKI Kft., Budapest, Hungary The research uses the complex network analysis method to analyze the causal directivity relationship of PM2.5 interaction between the prefecture-level cities in Henan Province from the perspective of data, in order to provide a scientific basis for the air environment governance in Henan Province. In the future, combined with advanced technologies such as geographic information technology and remote sensing, the relevant departments can conduct real-time monitoring and forecasting for fixed and mobile emission sources, and build relevant cloud platforms to realize the sharing of air quality information and the timely warning, so as to provide a decision-making basis for regional policy making. Further research work can uses meteorological parameters to evaluate the prediction network based on the PM2.5 time series. Acknowledgements. This study was supported by the Natural Science Foundation of Shandong Province (NO.ZR2019MD034) and the Education Reform Project of Shandong Province (M2020266)."
]