[
    "2Henan Key Laboratory for Synergistic Prevention of Water and Soil Environmental Pollution, Xinyang Normal University, Xinyang 464000, China (phone: +86-187-3997-7091) 3National Demonstration Center for Environmental and Planning, College of Geography and Environmental Science, Henan University, Kaifeng 475004, China (phone: +86-135-6950-0833) Abstract. Rare earth elements (REES) in urban soils are attracting increasing attention due to their expanded usage in modern technology. However, there is limited information on the spatial patterns and influencing factors of REES in urban soil. This study aims to investigate the characteristics of REES (La, Ce, Pr, Nd, Sm, Eu, Gd, Tb, Dy, Er, Tm, Yb and Lu) in urban soil in Kaifeng, Henan province, China. A total of sixty-six representative soil samples were collected from different land use types and the concentrations of thirteen rare earth elements (La, Ce, Pr, Nd, Sm, Eu, Gd, Tb, Dy, Er, Tm, Yb and Lu) were analyzed. Results showed that the concentrations of REES in different land use types followed the order of Ce > La > Nd > Pr > Gd > Sm > Dy > Er > Yb > Eu > Tb > Tm > Lu. Light rare earth elements (LREE) are generally more concentrated than heavy rare earth elements (HREE). Total REE concentrations in the soils were the highest in transportation land, followed by industrial and mining land, residential land, public management and service land, commercial consumption land and control area land. The highest REE concentrations were observed in the middle and southeast of the study area, mainly in densely populated old urban and traditional industrial areas. Different land use types showed LREE enrichment, and Eu exhibited negative anomaly characteristics. The ΣL/ΣH ratio was generally higher than the upper crust at 9.54, indicating clear terrigenous signs. The overall depositional environment of the surface soil in the study area was reduced, and the degree of heterogeneity of the LREE within the surface soil was significantly different from that of HREE. The rare earth elements (REES) are a group of seventeen chemical elements, including fifteen lanthanides (lanthanum to lutetium), scandium (Sc) and yttrium (Y). Based on their atomic numbers and masses, REES are commonly classified as light APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(1):41-54. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2201_041054 © 2024, ALÖKI Kft., Budapest, Hungary REEs (LREES, including La to Eu) and heavy REES (HREES, including Gd and Lu) (Tyler et al., 2004). Due to the unique electronic structure of the REES, they are highly reactive and have significant advantages over other metal elements, such as improved properties in metals and alloys (Yan and Liu, 2001; Zhang et al., 2022). They also possess unique optical, magnetic and catalytic properties, making them widely used in various fields, including aluminum alloy, steel, metallurgy, catalysis, magnetism, hydrogen storage, medicine and agriculture (Li et al., 2013; Adeel et al., 2019; Han and Xu, 2021; Liu et al., 2023). The global annual demand for REES has increased exponentially from 136,000 tons in 2017 to 210,000 tons in 2019 (Shajib et al., 2020). The substantial amounts of REE extraction and subsequent product manufacturing in industries have increased the REE discharge into the environment (Li et al., 2020). As a result, the biogeochemical cycles of REES and their ecological and environmental effects have become crucial topics of study for many researchers (Martín et al., 2016; Shajib et al., 2020; Li et al., 2020; Lian et al., 2022). Long-term exposure to REES can be harmful to animals, plants and human health (Pagano et al., 2019). Numerous studies have demonstrated that REES can accumulate in the human body, such as the brain, bone and liver, and may have toxic effects on human health. For example, certain REES such as Gd, Yb, and Sc can increase the risk of carcinogenesis and cause respiratory diseases. Upon entering the human body, REES generally accumulate in the blood, brain, bone, hair and other parts, thus posing a potential hazard to human health (Li et al., 2013; Ruan et al., 2023). China, with the largest reserve of REES in the world, has become a hotspot for research on the ecological and environmental effects of these elements and persistent organic pollutants. Currently, research studies on REES mainly focuses on farmland soil, industrial and mining areas (Zhang and Shan, 2001; Li et al., 2011; Neves et al., 2018). However, with the rapid urbanization in China, REEs play an increasingly important role in urban development, and their impact on local environmental quality and human health is also increasing (Tripathee et al., 2016; Zhuang et al., 2016; Tao et al., 2022).",
    "Urban soil is a crucial component of the urban ecosystem and is closely related to the quality of life and human health in urban areas. Wang et al. also have revealed the considerable threat and exposure problems of REES caused by human factors in urban soils (Wang et al., 2022). Meanwhile, a few high value outliers of La, Ce, Nd and Y in soil have been reported in London city due to vehicular emission (Yuan et al., 2018). Numerous studies have shown (Yuan et al., 2018; Liu et al., 2021) that human activities, such as mining, waste storage, fertilizer, coal combustion and industrial activities, can increase REES in urban soil. Up to now, there is little information about the characteristic of REES and their influencing factors in urban soils. Such knowledge is quite essential to assess potential risks related to urban soil REES. Kaifeng, a historical and cultural city with a history of over 3,000 years and one of China’s eight ancient capitals, is chosen as the research area in this study to explore the geochemical and spatial distribution characteristics of REES in different land use types, to provide a foundation for pollution control of REES in urban soils. Kaifeng City, located in the eastern part of Henan Province on the Huanghuai Plain, is one of China’s ancient capital cities. Its geographic coordinates range from 34°11’N APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(1):41-54. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2201_041054 © 2024, ALÖKI Kft., Budapest, Hungary to 35°01’N and 113°52’E to 115°15’E. The city has an urban area of 546 km2 and a population of 898,900. Kaifeng has a temperate continental monsoon climate, with an average annual temperature of 14℃ and mean annual precipitation of 636 mm (Yang et al., 2022). The urban soil in Kaifeng is formed from alluvial deposits of the Yellow River and subsequent human activities. Kaifeng was the capital city of Henan Province and had a relatively developed industry in the 1950s and 1960s. In 2014, the urban area of Kaifeng expanded threefold due to administrative division adjustments. The soil in Kaifeng is predominantly sandy and silty, with yellow fluvo-aquic soil being the natural soil type (Ma et al., 2011). According to the author’s measurements, the average pH is 8.79, the average organic matter content is 26.29 g/kg, sand accounts for 52.53%, silt 40.17% and clay 6.78%. The soil texture level is distinct and the soil is alkaline with a strong lime reaction. The land use types in Kaifeng were classified according to the GB/T21010-2007 standard, which includes commercial service land, industrial and mining land, residential land, public management and service land, and transportation land. A total of 66 soil samples were collected from the upper soil layer at representative sites with different land uses from April to June 2016, as shown in Figure 1. The samples included 11 from industrial and mining land, 11 from commercial land, 15 from transportation land, 15 from public management and service land, 10 from residential land and 4 control samples. At each sample point, five subsamples of the soil surface layer (0-20 cm) were collected using a stainless steel shovel in a “quincunx” method within 25 m2 of each sample point and were thoroughly mixed to produce a representative soil sample for the site. APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(1):41-54. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2201_041054 © 2024, ALÖKI Kft., Budapest, Hungary In the laboratory, the soil samples were air-dried naturally at room temperature, crushed with wooden sticks, and passed through a 16-mesh nylon sieve. Random multipoint samples (approximately 30 points) were taken from each sample, with a mass of about 25 g. These samples were then ground using an agate ball mill, passed through a 100-mesh nylon sieve (aperture 0.145 mm), and stored for analysis (Jiang et al., 2020). The HNO3-HF-HClO4 system was used to digest the soil samples, and a fully automatic graphite digestion instrument was used to complete the process (HJ/T 166- 2004). The concentrations of REES were determined using an inductively coupled plasma mass spectrometry (ICP-MS, XSeries-2, Thermo Fisher USA). In the determination process, each batch of samples was analyzed with standard samples (GSS-2 for soil samples, purchased from the Center of National Standard Reference Material of China), parallel samples and blank samples for quality control. The recovery rates of each element were between 84.3% and 108.2%, and the relative errors of parallel samples were within 0.5%.",
    "The concentrations characteristics of REES in soil samples from different land use types in Kaifeng City were investigated (Table 1). The concentrations of REES are ranked as Ce > La > Nd > Pr > Gd > Sm > Dy > Er > Yb > Eu > Tb > Tm > Lu. The concentrations of LREE were generally higher than that of HREE, consistent with the order of REES abundance in the crust and following the Oddo-Harkins rule of natural element distribution (Chen and Yang, 2010). This finding suggests that the distribution of REE concentrations in the soil of Kaifeng is influenced by crustal abundance. The average concentrations of ΣREE ranged from 108.79 to 176.04 mg/kg, and the distribution order was transportation land > industrial and mining land > residential land > public management and service land > commercial land > control area land. The concentrations of REES in all land use types were obviously higher than those in the control area, indicating that human activities have influenced the concentrations of REES in urban soil to some extent. The concentrations of REES in transportation land and industrial and mining land in Kaifeng were the highest, which is consistent with the findings of Zhang (Zhang et al., 2016). APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(1):41-54. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2201_041054 © 2024, ALÖKI Kft., Budapest, Hungary Jiang et al.: Distribution characteristics of rare earth elements in urban soil of Kaifeng City, Henan Province, China - 45 - The concentrations of all rare earth elements in transportation land were significantly higher than those in other land use types, the concentrations of La, Ce, Nd and Pr were significantly higher. Many studies have reported that the consumption of REES in automotive catalysts in China is increasing (Zhan et al., 2014). La and Ce are often used to improve the heat and heat resistance of fuel tail gas purification catalysts, respectively. With the development of cities and the increase in the number of cars, the amount of REES in automobile tail gas purification catalysts has been rising, resulting in high REES concentration in transportation land. In addition, the concentrations of REES in residential land and public management and service land were also high, possibly due to the use of coal in schools, churches and homes. Several studies have shown that coal fly ash is a potential source of REES (Zulkifli et al., 2010; Liu et al., 2019), with a global average content of 445 parts per million (PPM) of REES. Seredin and Finkelman found that concentrations of REES in the ashes of some coals and in rocks near coal seams are equal to or even higher than those found in traditional types of rare metal minerals (Seredin and Finkelman, 2008). Therefore, the high levels of REES in residential land and public management and service land in Kaifeng may be attributed to the use of coal in these areas. The total concentrations of 13 REES in the surface soil of Kaifeng City ranged from 32.73 to 304.48 mg/kg, with an average of 143.52 mg/kg (Table 2). Compared with the REES concentrations in the soil of China, the REES concentrations in the soil of the world and the REES concentrations in the Earth crust, the concentrations of REES in the urban soil of Kaifeng were obviously lower, except for a few elements (Eu, Gd and Yb). The maximum concentrations of different elements were higher than the average concentrations in the soil of China, indicating that REES are enriched in some samples in the study area. APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(1):41-54. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2201_041054 © 2024, ALÖKI Kft., Budapest, Hungary Jiang et al.: Distribution characteristics of rare earth elements in urban soil of Kaifeng City, Henan Province, China - 46 - When compared to the concentrations of REES in the soil of other cities domestically and internationally (Table 2), the concentrations of REES in the surface soil of Kaifeng were similar to those in Beijing (Liu et al., 2017), but slightly lower than those in Baotou (Qing et al., 2011). This difference may be due to Baotou city’s rich mineral resources and status as an emerging industrial base in metallurgy, machinery, chemical industry and electric power industry, which includes the production of iron and steel, rare earth metals, non-ferrous metals, machinery manufacturing, heavy vehicles, coal and other industries. When compared to foreign cities, the concentrations of REES in the soil of Kaifeng were higher than those in London (Yuan et al., 2018) and Mexico (Mireles et al., 2012).",
    "The coefficient of variation can indicate the uniformity of the distribution of an element in the soil. The larger the coefficient of variation, the stronger the interference from human activities, and the larger the spatial distribution (Wu et al., 2003). In Kaifeng, the coefficients of variation of the REEs were ranked Ce > Sm > La > Pr > Nd > Yb > Dy > Lu > Tm > Er > Gd > Tb > Eu (Table 2). The variation coefficient of Ce (41.76%) was relatively high, while the remaining elements experienced a low degree of variation. This finding suggests that Ce has a high degree of dispersion and the largest difference in spatial distribution, while the change of Eu is relatively stable. as Chondrites, which exist in the original material of the earth, do not typically exhibit a significant difference between LREE and HREE. Normalizing REES with chondrites as a standard can reveal the degree of differentiation between a sample and the original material of the earth, and thus provide information about the source area (Liu et al., 2021). To explore the distribution differences of REES in different land use types in the study area (Fig. 2), the mean values of six Leedy chondrites proposed by Masuda were used to standardize the measured REES (Zhao, 2000). The distribution curve of REES after chondrite standardization generally showed a negative slope, with a steep change from La to Eu for LREES, and a gentler slope for HREES after Gd. The distribution patterns of REES in different land use types, control areas, and the entire surface of Kaifeng exhibit a similar overall trend, with relatively enriched LREES, and obvious negative Eu anomaly characteristics. These geochemical characteristics are consistent with the geochemical characteristics of REES in the continental crust (Yang et al., 2007) and highly mixed crust-derived materials. Previous research indicates that the geometry of the REES distribution pattern has important implications (Meryem et al., 2016). As shown in Figure 2, the REES distribution pattern across different land use types and the entire surface layer of Kaifeng is consistent, indicating a common source. Two potential explanations exist regarding the depletion of Eu observed in the surface soil of the study area. First, it may be due to the influence of the soil’s parent material. In general, various elements in weathered crust and soil originate from the parent material, which determines the initial content of chemical elements in the soil (China Environmental Monitoring Station, 1990; Xu, 1997; Bispo et al., 2021). If there is Eu loss in the soil parent rocks itself, it will lead to initial Eu loss in the soil of the study area. Secondly, the valence element Eu (Eu3+, Eu2+) may undergo a redox reaction under natural conditions in the study area. This process causes Eu3+ to leach to the lower layer, where it is then reduced to Eu2+ and leached, resulting in a loss of Eu in the upper APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(1):41-54. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2201_041054 © 2024, ALÖKI Kft., Budapest, Hungary part of the soil (Condie et al., 1995; Reindl et al., 2021). There are also two reasons for the distribution characteristics of LREE enrichment in the surface soil of the study area. The first reason is the parent material of the soil. The second reason is related to the geochemical characteristics of the REE and the natural geographical conditions in the study area (Durn et al., 2021). The REES share similar chemical behavior, but their relative abundance can change due to physical and chemical properties such as redox performance, hydrolysis reaction constants, stability constants of their complexes and adsorption capacity, as well as environmental factors like pH, temperature, humidity and salinity. These influencing factors cause changes in the relative abundance and result in the differentiation of REES. This differentiation effect makes REES effective geochemical tracers, which is an active research topic in geoscience and has significant implications for the distribution, migration, transformation and fate of REES in the environment (Meryem et al., 2016). The differentiation characteristics of REES across different land use types in the study area were analyzed (Table 3), indicating that the (La/Yb)N parameter ratio, reflecting the curve slope, ranged from 11.10 to 13.69, with an average of 11.69, surpassing 1 significantly. The REES distribution pattern demonstrated a rightward slope, with the ΣLREE/ΣHREE ratio varying from 9.89 to 11.12, and the average value (10.59) exceeding 1 considerably. This phenomenon is primarily because the elements undergo leaching during soil formation, with REES migrating in the form of soluble ion rare earth. HREE tends to migrate more easily than LREE, leading to the progressive enrichment of LREE and subsequent HREE depletion. Furthermore, weathering conditions like element leaching, chemical weathering and biological interaction also APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(1):41-54. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2201_041054 © 2024, ALÖKI Kft., Budapest, Hungary impact the degree of differentiation between LREE and HREE (Kharbish et al., 2019). Although the fractionation degree at each site reduced to varying extents compared to the control area, ΣL/ΣH ratios across all sites remained higher than the upper crust (9.54), highlighting obvious terrigenous signs (Taylor and Mclennan, 1984; Henderson, 1984).",
    "The (La/Sm)N and (Gd/Yb)N ranges, reflecting the fractionation degree of IREE and HREE, were 3.67 to 4.02 and 2.26 to 2.68, with an average of 3.75 and 2.36, respectively. These findings imply that the internal differentiation of IREE is more pronounced, with Ce being the most enriched and exhibiting the most difference was contrast. However, the internal differences of HREE are not significant. The degree of fractionation of IREE was found to be related to sediment particle size (Ding et al., 2006), whereas HREE fractionation showed no significant correlation with sediment particle size. This may be the main reason for the different degrees of fractionation of LREE and HREE observed in different land use types. The δCe and δEu anomalies, reflecting the abnormal element behavior, exceeding 1.05 denote positive anomalies while anomalies below 0.95 represent negative anomalies (Wang et al., 2018). The δCe ranged from 1.00 to 1.10, with an average of 1.06, and no negative anomalies were observed across different land use types. Positive anomalies were identified in public management and service land and transportation land, and positive Ce anomalies were observed in the surface soil of Kaifeng. It was observed that Ce oxidization into CeO2 in an oxidizing environment caused its precipitation or absorption by iron hydroxide minerals, thereby leading to its enrichment in oxidizing environment sediments and resulting in a negative Ce anomaly, indicating the reduction environment of the sedimentary environment in the study area. The δEu values ranged from 0.73 to 0.83, with an average of 0.77, showing negative anomalies for different land use types. On the one hand, the strong positive Eu anomaly may be due to the high content of feldspar and its weathering materials in park soil, since feldspars are known to be enriched in Eu (Vazquez-Ortega et al., 2015). On the other hand, Eu may be released to soil due to its wide use in phosphors, flat screen display and fiber optics (Gwenzi et al., 2018). Ce can be oxidized to positive tetravalent due to oxidation, and to complex with ligands like siderophore, which have contributed the stabilization of Ce (IV) and Ce anomaly (Wang In the formula, WCe and WEu represent the mass fractions of the REE Ce and Eu, respectively. W* Ce and and W* Eu represent the interpolated values of the corelier solutions of Ce and Eu, respectively. Moreover, NCe, NLa, NPr, NEu, NSm, NGd, represent the abundance values of La, Pr, Eu, Sm and Gd on the normalized curves. Additionally, (La/Yb)N, (La/Sm)N, (Gd/Yb)N represent the ratio of the abundance values of each REE on the standardized curve. APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(1):41-54. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2201_041054 © 2024, ALÖKI Kft., Budapest, Hungary Jiang et al.: Distribution characteristics of rare earth elements in urban soil of Kaifeng City, Henan Province, China - 49 - To better understand the spatial distribution of REES in the surface soil of the study area, ordinary Kriging interpolation analysis was performed for 13 REES using ArcGIS (Fig. 3). APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(1):41-54. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2201_041054 © 2024, ALÖKI Kft., Budapest, Hungary Jiang et al.: Distribution characteristics of rare earth elements in urban soil of Kaifeng City, Henan Province, China - 50 - although the abundances varied greatly. The spatial distribution characteristics of La, Pr, Nd, Eu and Tb are comparable, and a belt-like shape is formed in the northwest and southeast directions of the study area. The REE concentrations are generally high in this region, with the highest concentrations at both ends. It gradually diverges from the belt- like area towards the surrounding area, and the REE concentrations decrease, with the lowest concentration in the three small areas located in the north, west and south of the study area boundary. The spatial distributions of Ce, Sm, Gd, Dy, Er and Yb elements are generally similar. Their concentrations are highest in the central and southeast boundary, while the concentrations of REES are low in the southwest corner of the study area and the north and south of the boundary. Tm and Lu elements have higher concentrations in the middle and southeast corners, with the highest concentrations in the central area. Due to the spatial differences in the intensity and nature of human activities in cities, the spatial distribution of different REE contents varies. Based on the spatial interpolation diagrams of the elements, the concentrations of REES are higher in the middle and southeast of the study area, but the regional coverage area is different. Southeast Kaifeng, a traditional old industrial and shipping center, harbored thermal power plants, a chemical fertilizer plant, a boiler plant, an instrument and meter plant, a lead and zinc factory and a cargo storage station, whose industrial production of dust, especially thermal power of fly ash and freight car tail gas, is the primary external sources of REES in these areas that enriched the soil.",
    "The central part is the historical urban district with a dense population and long- standing history of coal usage for heating and as a primary fuel source. The area is also the core of Kaifeng’s tourism and business sectors, resulting in high levels of automobile activity and tourist traffic. Furthermore, this region produces a large amount of domestic waste. As a result of these factors, the soil in this area contains high levels of REES. The concentrations of REES in different land use types follow Ce > La > Nd > Pr > Gd > Sm > Dy > Er > Yb > Eu > Tb > Tm > Lu. The distribution of REES shows the highest concentration in transportation land, followed by industrial and mining land, residential land, public management and service land, commercial service land, and control area. The concentrations of ΣREE ranged from 120.55 to 176.04 mg/kg, which is lower than the REES concentration in the soil of China, the REES concentration in the soil of the world and the REES concentration in the earth crust. the total The REES on the different types of land use in the study area showed LREE enrichment, and Eu had a distinct negative anomaly characteristic. The degree of differentiation between LREE and HREE varied among the land use types, but overall, the ΣL/ΣH ratio was higher than the upper crust’s ratio of 9.54, indicating obvious terrigenous characteristics. The overall depositional environment of the surface soil in the study area is reducing, and the degree of heterogeneity of the LREE in the surface soil is obviously different from that of the HREE. The concentrations of REES were relatively high in the middle and southeast of the study area, mainly concentrated in the historic urban areas and traditional industrial areas with dense population activities. APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(1):41-54. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2201_041054 © 2024, ALÖKI Kft., Budapest, Hungary Jiang et al.: Distribution characteristics of rare earth elements in urban soil of Kaifeng City, Henan Province, China - 51 - Acknowledgements. This work was financially supported by the National Natural Science Foundation of China (Grant-number 41201211); Key scientific research project of colleges and universities in Henan Province (Grant-number 23A170005 and 24B170009); Soft science project of science and technology of Henan Province (Grant-number 232400410456); Xinyang academy of ecological research open foundation (Grant-number 2023XYQN26)."
]