[
    "Abstract. In order to understand the heavy metal contamination of soils around of Quandian coal mine, Henan province of China, soil samples around the coal mining area were collected and measured the concentration of heavy metal (Zn, Mn, Pb, Cr, Cu), the contamination levels and ecological risk were evaluated using the geo-accumulation index, enrich factor and potential ecological risk index. The results show that the Zn, Mn, Pb, Cr and Cu concentrations are 70.0~99.0 mg/kg, 352.0~451.0 mg/kg, 30.0~50.0 mg/kg, 34.5~68.0 mg/kg and 31.0~60.0 mg/kg, and the mean values of Zn, Pb and Cu exceed the background values. According to the results of Igeo and EF, Zn, Mn and Cr have uncontaminated to minor enrichment levels, and Pb and Cu have moderately contaminated to minor and moderate enrichment levels. The rank of potential ecological risk coefficient is Cu > Pb > Cr > Zn > Mn. The mean values of potential ecological risk index is 23.79, suggesting low comprehensive ecological risk in soil samples. Pb and Cu are account over 85% contribution to RI, suggesting Pb and Cu are the main polluting elements and special attention should be paid on Pb and Cu contamination in soils around Quandian coal mine. In the process of coal mining, a large amount of waste water, dust and coal gangue, etc. are generated. These waste water and solid wastes usually contain high concentration of heavy metal elements, which can enter the soil through leaching, runoff and sedimentation, and lead to the enrichment of heavy metal in soil around coal mining areas (Gulan et al., 2022; Dang er al., 2002; Okonkwo et al., 2021). Heavy metal pollution in soils may have various deleterious effects, for instance, heavy metal can directly jeopardize soil functions and the biosphere or indirectly harm human health through the food chain and bio-accumulation (Romic et al., 2003; Qi et al., 2020; Mor et al., 2022; Wang et al., 2011; Cheng et al., 2020; Akbar et al., 2024). In recent years, a number of studies carried out on heavy metal contamination and ecological risk assessment in soil around mining areas. Bhuiyan et al. (2010) found that heavy metals such as Mn, Zn, As and Pb were seriously polluted in farmland soil around coal mines in northern Bangladesh. Bhanu et al. (2016) found that heavy metals in a coal mine area of India have exceeded or enriched to different degrees. Halim et al. (2015) also found that the soil was seriously polluted by mining activities, and the average concentration of Pb, Mn, Ni, As, Zn, and Cr in the soil exceeded the mean content in another coal mine in Bangladesh. Yenilmez et al. (2011) studied the APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(3):2367-2376. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2203_23672376 © 2024, ALÖKI Kft., Budapest, Hungary Yan et al.: Heavy metal contamination and ecological risk assessment of soil around Quandian coal mine, Henan Province of China - 2368 - contaminated status and spatial distribution characteristics of heavy metals in an abandoned coal mine in Turkey, and found that Cr, Ni and Cu are highly polluting elements, and their spatial distribution characteristics are closely related to the surface runoff in the mining area. Tong et al. (2018) found that the content of Pb, Hg and Cu in typical coal mining areas in Guizhou province of China exceeded the background value. Due to the potential threat to human health, some studies have focused on heavy metals contaminated levels in agricultural production area soil and soil-crop systems around mining areas. Previous studies have found that the consumption of cereal crops grown on contaminated soil is one of the main sources of heavy metal intake by human, which may lead to a health risk (Pueyo et al., 2008; Sun et al., 2013; Rahim et al., 2022). Akbar et al. (2024) found that concentrations of heavy metals from coal mine soils decreased with increasing depth and distance from mining activities, and suggest crops from these soils may pose health risks for consumption. Zhang et al. (2019) found that there was a high health risk of heavy metals contamination in the seeds of crops in the Yuzhou coal mine, and this risk to children was significantly higher than that to adults. Therefore, it is very important to study the heavy metal contamination status and ecological risk assessment of soil around coal mines in agricultural production area.",
    "Quandian coal mine located at central part of Henan province, where soil quality is particularly important as Henan province is the major high-quality grain-producing area. However, coal mining activities in Quandian become a potential heavy metals enrich and contaminate source for soil and crops. The main goals of this study were to analyze the heavy metals concentrations (Zn, Mn, Pb, Cr, Cu) in soils around Quandian coal mine, and to assess the pollution levels by the geo-accumulation index, the enrichment factor and the potential ecological risk index. This study has important meaning for understanding the effects of coal mining activities on soil quality and providing helpful information for relevant pollution-control guidelines and regulations establishing. Sixteen topsoil samples were collected around Quandian coal mine on May 2018, Henan province of China (Fig. 1), each sample have three replicates. The collected samples were mixed and packed in plastic bags, bring back to laboratory and air-dried in the laboratory, then manually crushed by a wooded hammer, refuse and small stones were removed before measurement by passed samples through 1 mm sieve. Sieved samples were finely ground by agate mortar, passed through a 200-mesh sieve and preserved for analysis. Heavy metal concentrations of the soil samples were analyzed by an X-ray fluorescence (Thermo Scientific Niton XL3t XRF) analyzer. XRF has been widely used in soils and street dust samples for heavy metal analysis (Xie et al., 2001; Yeung et al., 2003; Yang et al., 2010; Wang et al., 2012; Zhang et al., 2024). The Zn, Mn, Pb, Cr and Cu concentrations were measured. The China national reference materials GBW07401~GBW07408 and blank samples were used for accuracy control, the analytical accuracy was better than 10%. The geo-accumulation index was used to evaluate the extent of heavy metals contamination. This method also be widely applied to assess the contamination degree of different environments (Muller, 1969). The geo-accumulation index considers both the effects of anthropogenic activities on the environment and diagenesis on the background. The following equation was used to calculate the index. APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(3):2367-2376. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2203_23672376 © 2024, ALÖKI Kft., Budapest, Hungary Yan et al.: Heavy metal contamination and ecological risk assessment of soil around Quandian coal mine, Henan Province of China - 2369 - where Cn and Bn are the analyzed concentration of metal n in soils and the background value, respectively. In the present study, Henan Province soils background values were used (State Bureau of Environmental Protection of China,1990). The Igeo index includes several grades and the classification is presented in Table 1. The enrichment factor (EF) is based on the standardization of a tested element against a low occurrence variability reference (Sutherland, 2000; Christophoridis et al., 2009; Esen et al., 2010; Ghrefat et al., 2011; Shafie et al., 2013). In this study, although the standard deviation of Mn seems quite high (SD = 50.3, in Table 2), while Mn show low content compared with the background, Mn was selected to use as the reference element. The EF was calculated as the following equation (Ergin et al., 1991): where (M/Me) sample and (M/Me) standard are the ratio of the metal and Mn content of the sample, and the ratio of the background. The classification of EF is shown in Table 1. The Potential ecological risk index is a method of evaluating heavy metal contamination and ecological risk (Hakanson, 1980). The evaluation method has been widely used in the assessment of the ecological hazard of heavy metals in different kind of samples, such as street dust, soil, lake sediment and urban sludge. The calculate equation of the potential ecological risk coefficient of heavy metal element present as below. APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(3):2367-2376. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2203_23672376 © 2024, ALÖKI Kft., Budapest, Hungary Yan et al.: Heavy metal contamination and ecological risk assessment of soil around Quandian coal mine, Henan Province of China - 2370 - where Cn and Bn represent the same meaning of the formula (1), is heavy metal element potential ecological risk coefficient, is the toxicity coefficient of heavy metal element, which reflects the toxicity level and the sensitivity of biological to heavy metal contamination. The values of toxicity coefficient are in the order of Zn = Mn = 1 < Cr = 2 < Pb = Cu = 5.",
    "The comprehensive potential ecological risk index (RI) of heavy metal elements is the sum of the potential ecological risk coefficient of all heavy metal elements. The results showed that the range of Zn, Mn, Pb, Cr and Cu concentrations are 70.0~99.0, 352.0~451.0, 30.0~50.0, 34.5~68.0 and 31.0~60.0 mg/kg, with an average of 79.8, 389.8, 35.1, 48.2 and 44.6 mg/kg, respectively. Comparison was made between the mean metal concentrations in the soil samples and the background values, and the results reveals that the mean values of Mn and Cr are under the background values, and Zn, Pb and Cu exceed the background values. Furthermore, 100% of the soil samples exceed the background values for Zn, Pb and Cu, suggesting that the soils around Quandian coal mine are polluted with Zn, Pb and Cu (Table 2). The results of Igeo, EF and potential ecological risk index are shown in Table 3. Based on the mean Igeo values, the levels of Zn, Mn and Cr are considered uncontaminated (Igeo < 0; the ranges and mean Igeo values are -0.37~0.13 and -0.18 for Zn, -1.30~-0.95 and -1.16 for Mn, -1.45~-0.49 and -1.02 for Cr, respectively). Two Igeo values of Zn (QD-15 and QD-16) are greater than 0, suggesting uncontaminated/moderately contaminated. Based on the mean Igeo values, the level of APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(3):2367-2376. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2203_23672376 © 2024, ALÖKI Kft., Budapest, Hungary Yan et al.: Heavy metal contamination and ecological risk assessment of soil around Quandian coal mine, Henan Province of China - 2371 - Pb and Cu belong to moderate contamination (Igeo > 0; the ranges and mean Igeo values are 0.10~0.48 and 0.24 for Pb, 0.07~1.02 and 0.57 for Cu). The variation in Igeo for Zn, Mn, Pb, Cr and Cu are also shown in Figure 2, which are very obvious to judge how many samples are below or exceed the contaminated zone according to the classification of Igeo that presented in Table 1. APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(3):2367-2376. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2203_23672376 © 2024, ALÖKI Kft., Budapest, Hungary Yan et al.: Heavy metal contamination and ecological risk assessment of soil around Quandian coal mine, Henan Province of China - 2372 - According to the average EF values, Zn showed minor enrichment (the mean EF values is 1.98 and range from 1.64 to 2.52). Pb also showed minor enrichment (the mean EF values is 2.68 and range from 2.16 to 4.20), three samples EF values of Pb APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(3):2367-2376. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2203_23672376 © 2024, ALÖKI Kft., Budapest, Hungary Yan et al.: Heavy metal contamination and ecological risk assessment of soil around Quandian coal mine, Henan Province of China - 2373 - (QD-07, QD-13 and QD-15) exceed 3, represents moderate enrichment. The mean EF values of Cr is 1.13 and range from 0.76 to 1.61, suggest minor enrichment, six EF values of Cr (QD-01, QD-05, QD-06, QD-10, QD-12 and QD-14) are lower than 1, demonstrate no enrichment (Fig. 2). Cu show moderate enrichment (the mean EF values is 3.38 and range from 2.38 to 5.01), one EF values of Cu (QD-15) exceed 5, suggesting moderately severe enrichment. The variations in potential ecological risk coefficient demonstrate low levels of heavy metal pollution in soils ( < 40; the ranges and mean values are 1.16~1.65 and 1.33 for Zn, 0.61~0.78 and 0.67 for Mn, 7.65~12.76 and 8.96 for Pb, 1.08~2.13 and 1.51 for Cr, 7.87~15.23 and 11.32 for Cr, respectively) (Fig. 2). The values of the comprehensive potential ecological risk index (RI) are 19.24~32.00, with an average value of 23.79 and much lower than 150, suggesting low comprehensive ecological risk. According to the spatial distribution, the comprehensive potential ecological risk in the north area of the coal mine is relatively higher than in the south, the highest value of RI appears in the north of QD-15 (RI = 32.00), while the lowest value in the south of QD-06 (RI = 19.24). There is a road run through the north of the coal mine. Many studies have confirmed that traffic factors, as an important heavy metals anthropogenic pollution source can increase the heavy metal content of soil and street dust, for example, Li et al. (2001) found that Pb could come mainly from vehicle exhaust emissions, Cu related to coal, fuel and motor vehicle wear, Cr mainly due to the combustion of crude oil and coal. Jiries et al. (2001) and Arslan (2001) reported that Zn mainly come from tire wear, mechanical wear and corrosion of railings. The increasing of heavy metals content then leads to a higher potential ecological risk in environment.",
    "From Table 3, the rank of potential ecological risk coefficient is Cu > Pb > Cr > Zn > Mn. Pb and Cu have the largest contribution to RI, the percentage is 31.16~42.36% and 37.77~56.29%, with an average value of 37.67% and 47.57% for Pb and Cu, respectively. The percentage of the sum of Pb and Cu is 79.40~87.45%, with an average value of 85.24%. That is due to the both high concentration and the high toxicity coefficient of Pb and Cu. Therefore, special attention should be paid to the pollution of Pb and Cu in soils around Quandian coal mine. The results show that the Zn, Mn, Pb, Cr and Cu concentrations in soil samples are 70.0~99.0, 352.0~451.0, 30.0~50.0, 34.5~68.0 and 31.0~60.0 mg/kg, and the average values of Zn, Pb and Cu exceed the background values, indicating that the soils around Quandian coal mine are polluted with Pb, Zn and Cu. According to the results of Igeo and EF, Zn, Mn and Cr have uncontaminated to minor enrichment levels, and Pb and Cu have moderately contaminated to minor and moderate enrichment levels. The rank of potential ecological risk coefficient is Cu > Pb > Cr > Zn > Mn. The mean values of RI are 23.79, suggesting low comprehensive ecological risk in soil samples. Pb and Cu are account for over 85% contribution to RI, which due to both the high content and the high toxicity coefficient, suggesting Pb and Cu are the crucial pollutants in soils around Quandian coal mine. As to the spatial distribution, the north area of the coal mine shown a higher comprehensive potential ecological risk than the south area because of the traffic factors. APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 22(3):2367-2376. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2203_23672376 © 2024, ALÖKI Kft., Budapest, Hungary Yan et al.: Heavy metal contamination and ecological risk assessment of soil around Quandian coal mine, Henan Province of China - 2374 -"
]