[
    "Abstract. Based on community vegetation survey data, the species composition, and important values of wild communities of Elaeagnus mollis in Jiaozuo and Sanmenxia were analyzed. The diversity of wild Elaeagnus mollis community in Henan Province was studied by using richness index, diversity index, evenness index and dominance index. The results showed that both sites exhibited the highest number of composite plant species, accounting for more than 14%, while herbaceous plant species were the most abundant, accounting for more than 50%. The important values of Elaeagnus mollis in the two communities are 45% and 39%, respectively. The richness indices of herbs and shrubs in the Jiaozuo sample plot were 3.87 and 3.25, respectively, indicating higher plant richness. The species evenness index of Sanmenxia community is low, while the dominance index is high. Based on the analysis results, suggestions for the protection of wild communities of Elaeagnus mollis were proposed. Keywords: biodiversity, Elaeagnus mollis, wild plant community, species diversity index, protection strategy Elaeagnus mollis Diels is a deciduous tree or shrub of the Elaeagnus family, belonging to the genus Elaeagnus. The young branches are grayish green, densely covered with grayish green stellate hairs and scales. The leaves are papery, ovoid, or ovoid elliptic, the top is blunt, dark green, with a few scattered stars shaped pubescence, the base is blunt or round, grayish green, and densely covered with grayish white star shaped villi. The flowers are grayish green, fragrant, and densely covered with gray white star shaped fluff. The fruit is circular or broadly elliptical, with obvious 8-sided ridges, winged, and cotton flesh; The fruit pit is spindle shaped (Chang, 1983). Samara oil has extremely high scientific research, economic, and ecological value. Tree seeds contain important nutrients, and the oil production rate of the kernels is close to 50%, making them suitable for high-end edible oil. Seed kernels are rich in vitamin E and various essential amino acids for the human body, among which vitamins and linoleic acid have important medicinal value (Yuan, 2022). In addition, the Elaeagnus mollis is drought resistant and has developed root systems, making it an important tree species for greening barren mountains, and maintaining water and soil. Its root system can fix nitrogen and can effectively improve soil (Li, 2022; Xu et al.,2020). However, due to the thin soil layer, poor fertility, and poor site conditions in the wild distribution area of Elaeagnus mollis, most of them grow as shrubs or large shrubs, which belong to the middle and lower layers of forest communities and are considered APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 23(1):839-849. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2301_839849 © 2025, ALÖKI Kft., Budapest, Hungary weak in natural succession (Xu, 2016). In the wild, the pollen dispersal rate and fruiting rate of Elaeagnus mollis are low (Yan, 2004; Shangguan and Zhang, 2001), the seed dispersal range is small (Fu, 1990), the seeds have a hard shell and a low germination rate (Shangguan and Zhang, 2001), the seed lifespan is short, and they lack strong competitiveness (Yan, 2004), which affects the growth and reproduction of Elaeagnus mollis. In addition, there is human destruction of species habitats and indiscriminate logging, resulting in scarce wild resources. Elaeagnus mollis is an endemic tree species in China (Yan, 2004; Xie et al., 1994), a Class II national key protected wild plant (Yu, 1999). Its distribution range is extremely narrow and has important economic and ecological value (Zhang et al., 2020), it is assessed as endangered (EN) by the International Union for Conservation of Nature (IUCN) (Ministry of Agriculture and Rural Affairs, 2021). Early literature records only existed in Shanxi and Shaanxi provinces, and in recent years, wild populations have also been discovered in the southern Taihang region, represented by Jiaozuo in Henan (Zhang et al., 2023a, b; Li et al., 2022). As an excellent woody oil plant, the Elaeagnus mollis has important economic value in edible, medicinal, and industrial oils (Zhang, 2012; Xie and Ling, 1997; Wang et al., 2002). At present, research on the relationship between geographical distribution and ecological environment (Zhang et al., 2001; Shangguan et al., 1992), population and community characteristics (Zhang and Zhang, 2012), inter species relationships in communities (Zhang and Shangguan, 2000a, 1999, 2004), distribution patterns of dominant populations in communities (Zhang and Shangguan, 2000b), utilization of spatial resources by endangered plants (Xu et al., 2016), physiological and biochemical characteristics (Miao et al., 2012), genetic diversity (Qin et al., 2010), and reasons for endangerment of Elaeagnus mollis mainly focuses on these aspects (Shangguan and Zhang, 2001). However, there have been no reports on comparative studies of community diversity in different regions of Elaeagnus mollis both domestically and internationally. Studying the biodiversity of this new population will undoubtedly improve the overall level of scientific research on Elaeagnus mollis and help with the better development and utilization of this tree There are two main distribution points for wild Elaeagnus mollis in Henan Province, namely Jiaozuo at the southern foot of the Taihang Mountains and Sanmenxia at the northern foot of the Funiu Mountains. The Jiaozuo distribution point is in the mountainous mixed forest below 700 meters on the east bank of the Qingtian River Reservoir in Boai County. The area belongs to a temperate continental monsoon climate with four distinct seasons, with an average annual temperature of 14.2℃ and an average annual precipitation of 574 mm. The annual frost-free period is 233 days. The forest coverage rate reaches 22.4%, and the bamboo forest within the territory is the largest artificially cultivated bamboo forest in North China. The research area is in the low mountain and hilly area at the southern foot of the Taihang Mountains, with significant terrain fluctuations. The bedrock is limestone, and the soil is yellow brown soil, loess, and rocky mountain soil. It has the characteristics of high rock exposure rate, shallow and discontinuous soil layer, alkaline soil, rich calcium, and low water content. The area is far away from cities and agriculture, and there is almost no human interference; The APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 23(1):839-849. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2301_839849 © 2025, ALÖKI Kft., Budapest, Hungary distribution point of Sanmenxia is in Shanzhou District, where the terrain is high in the south and low in the north, tilting from southeast to northwest. The climate in this area is dry and cold, with sparse rain and snow. The annual average temperature is 13.9℃, the annual precipitation is 650 millimeters, and the frost-free period is 219 days. The research area is in the Xiaoqinling Mountains, a rocky mountain area with most of it covered by loess and some parts of the bedrock exposed. The elevation is 600-1000 m, with a relative height difference of about 300 m. The mountain ridge is gentle, and the slope is steep. The terrain is cut and fragmented, with loess gullies developed, mostly in a “U” shape and some in a “V” shape. The slope is soil, and the structural type is single layered. In deep valleys, it is mostly distributed in a bedrock inheritance type. The soil is barren, with year-round drought and little rainfall. In recent years, there have been agricultural development activities in the distribution area, and human activities are frequent in the region. The distribution of sample plots is shown in Figure 1.",
    "From 2022 to 2023, Comprehensive inspection and based on the distribution, community type, structure, and other characteristics of Elaeagnus mollis, as well as the special terrain, a total of 6 sample plots of 20 m × 20 m were set up in the concentrated distribution area of Elaeagnus mollis in Qingtian River and Xiaoxipo of Sanmenxia in Boai County, Jiaozuo City, Shaanxi Province. Among them, the sample size of the tree layer is 20 m × 20 m. Based on this, three 5m × 5m shrub samples and five 1 m × 1 m herbaceous samples are set up in each sample using the diagonal method. Conduct a survey on all tree plants with DBH ≥ 1 cm in the tree layer survey sample, and record indicators such as species name, relative coordinates, diameter at breast height, height, APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 23(1):839-849. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2301_839849 © 2025, ALÖKI Kft., Budapest, Hungary height under branches, crown width, and growth status; The survey objects of shrub layer include shrub species and updated saplings that do not meet the measurement standards of tree layer, and record indicators such as species name, relative coordinates, height, basal diameter, and crown width; The herbaceous layer records indicators such as species name, number of plants, average height, and coverage. Simultaneously measure and record environmental factors such as longitude and latitude, altitude, aspect, position, slope, soil type, soil thickness, and degree of disturbance at the location of the sample plot. In the process of data analysis, considering the excessive number of species and computational needs, this study selected the main species that have a strong impact on the formation of community structure and community environment as the research objects. To objectively reflect the status and role of each species in the community, the importance value (IV) is used to represent the dominance of each species, and the importance value is calculated by dividing it into tree layer, shrub layer, and herbaceous layer (Fang et al., 2009). Tree importance value was calculated as: (relative density + relative frequency + relative significance)/3. Importance values of shrubs and herbs were given as: (relative density + relative frequency + relative coverage)/3. Community diversity is an important characteristic of plant communities, which not only reflects the characteristics of the community itself but also reflects its interrelationships with the environment (Fang et al., 2009). Using the Margalef index, Shannon Wiener index, Simpson index, and Pielou index to measure the species diversity of the survival communities of Elaeagnus mollis in the Qingtian River and Xiaoxi Slope (Ma and Liu, 2009). APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 23(1):839-849. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2301_839849 © 2025, ALÖKI Kft., Budapest, Hungary N is the total number of individuals in the species, Ni is the number of individuals in the i-th species. Pi is Ni/N, which is the proportion of the number of individuals in species i to the total number of individuals; S is the number of species. Different plant species in the community are the basic unit of community construction and one of the most basic characteristics of plant community. According to the survey results, there are a total of 32 families, 68 genera, and 83 species in the Qingtian River sample plot in Jiaozuo. Among them, there are 12 species in the Compositae family, 9 species in the Leguminosae family, 6 species in the Rosaceae and Euphorbiaceae families, and 5 species in the Gramineae family, accounting for 14.5%, 10.8%, 7.2%, 7.2%, and 6% respectively; The genera Euphorbia, Viola, and Lespedeza are all three species, accounting for 4.4% of the total. A total of 17 families, 30 genera, and 30 species were investigated in the Xiaoxipo sample plot. Among them, there are 5 species in the Compositae family, accounting for 16.7%; Leguminosae, Rosaceae, and Gramineae are all three species, accounting for 10.0% (as shown in Table 1). A total of 35 families, 71 genera, and 98 species of plants were investigated in both locations. The composite family has the most plant species, accounting for more than 14%, and the herbaceous plant species are the most abundant, accounting for more than 50%. However, there are significantly more plant species in the Qingtian River of Jiaozuo than in the Xiaoxi Slope of Sanmenxia, and the proportion of species, genera, and life forms is balanced. Based on the analysis of external factors through on-site investigation, the Jiaozuo distribution area is remote, with inconvenient transportation, less human activities, and light damage due to human care. The Sanmenxia distribution area has convenient transportation, more agricultural activities, and the core area has been contracted and developed by enterprises, causing heavy damage, and having a significant impact on plant species in the community.",
    "The importance value is a commonly used comprehensive indicator of the ecological adaptability of species in a community and their position in the community. It represents the relative importance of each species in the community and can to some extent reflect the status and role of each species in the community. The higher the importance value of a species, the more important its position and role in the APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 23(1):839-849. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2301_839849 © 2025, ALÖKI Kft., Budapest, Hungary community. The species with the highest importance value are the dominant and constructive species of the community (Su et al., 2002). Figure 2 shows the investigation and calculation results of the important values of common species in the Jiaozuo distribution point and Sanmenxia distribution point. The Elaeagnus mollis is scattered in mixed forests, mainly accompanied by species such as Forsythia suspensa, Lespedeza, Rosa xanthina, Viburnum, Vitex negundo var. heterophylla, Cotinus coggygria var. pubescens, Ostropsis davidiana, Bothriochloa ischaemia, etc. (Shangguan et al., 1992; Du et al., 1989). It can be seen from Figure 2 that the important values of Elaeagnus mollis in the two sample plots are 45% and 39% respectively, and there is no absolute advantage in both communities. There are few tree species in the Jiaozuo distribution point, and the upper layer is dominated by dominant shrubs such as Gleditsia (50%) and Elaeagnus mollis (45%), indicating that wild saponin pods and Elaeagnus mollis are co dominant species of shrubs in the upper layer of the Jiaozuo distribution point. The others are Vitex negundo, Shaanxi Viburnum, and Xiaoye Rhamnus, with important values of 30%, 28%, and 21%, respectively. Forsythia suspensa has the most obvious advantage in vine plants, with an important value of 29%, followed by Clematis. In the herbaceous layer, the most important value of Elymus lanceolatas is 26%, which is the dominant species in the herbaceous layer of the community. The other species in order are Youngia japonica (19%), Dicranostigma (16%), Potentilla chinensis (15%), and Ceratostigma (12%); The important value of Zelkova sinica species in Sanmenxia distribution points is 53%, which is the absolute advantage species. The shrub layer is composed of Vitex negundo (41%) and Elaeagnus mollis (39%) as co superior species, followed by Siranvis Vermeil (22%), Huangluo Rose (15%), and Shaanxi Viburnum (13%). Forsythia suspensa has an important value of 33% among vines, making it the dominant vine species, followed by Raspberry. The best species in the herbaceous layer is Brassica, with an important value of 32%. The others are Potentilla (20%) and Astragalus membranaceus (11.9%) in order. The dominant species of vines and herbs in the two distribution points are the same, both of which are Forsythia suspensa and Elymus nutans, while shrubs are a co dominant species composed of Elaeagnus mollis and two other shrubs. The distribution point of APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 23(1):839-849. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2301_839849 © 2025, ALÖKI Kft., Budapest, Hungary Jiaozuo is rocky soil, which is limited by ecological factors such as thin soil layer and poor soil quality, and has no dominant trees. The upper layer is composed of large shrubs. The distribution point of Sanmenxia is a loess hilly area with deep soil layer and obvious advantages of trees. The species diversity of the community was quantitatively analyzed and evaluated by four indicators: species richness index (Ma), species diversity index (H’), species evenness index (J) and species dominance index (D). Species richness refers to the number of species in a community, directly represented by the number of species. The Margalef richness index formula can be used to further analyze species richness; Species diversity index refers to the degree of species diversity within a community expressed by simple numerical values, which is used to judge the stability index of a community or ecosystem; Uniformity reflects the difference in the number of individual plant species in a community, and is a quantitative indicator that describes the distribution of individual numbers among all species in a community or habitat; Species dominance is the probability that two individuals randomly selected from the same community belong to the same species. Based on community survey data, the results of using various index calculation formulas are shown in Table 2.",
    "Different site conditions lead to significant differences in community composition, and community diversity is closely related to community type, species composition, spatial structure, as well as habitat conditions and environmental factors (Zhang and Zhang, 2012). From the results (Table 2). The overall plant richness of the Jiaozuo sample plot is high, with the richness indices of herbs and shrubs being 3.87 and 3.25, respectively. However, the richness of trees is low, which is related to the relatively remote area, less human activities, and relatively complete plant preservation. At the same time, because it is an arid rocky mountain, the soil fertility and water carrying capacity are low, limiting the growth of tall trees, so the tree richness index is only 0.13. And some tree species grow as shrubs, such as, C. turczaninowii and K. paniculata. The plant richness of the Sanmenxia sample plot is low, and the highest richness index of herbs is only 2.01, while the richness index of trees and shrubs is lower than 2.0. If only analyzed from environmental factors, this is an abnormal phenomenon. The water and fertilizer conditions of the Sanmenxia sample land are better, and the richness index should theoretically be higher than that of Jiaozuo. Intense human interference APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 23(1):839-849. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2301_839849 © 2025, ALÖKI Kft., Budapest, Hungary distribution location of Elaeagnus mollis in Sanmenxia is in agricultural reclamation areas, and the core area of distribution has been severely damaged, resulting in a decrease in species types; The species diversity index is determined by the species richness and the total number of individuals in the quadrat, reflecting the complexity of the community structure. From Table 2, the diversity index of trees in the Jiaozuo sample is lower than that in the Sanmenxia sample, while the herbaceous and shrub populations are 0.50 and 0.83 higher, respectively. This is because the number of trees in this area is small, the structure is simple, and the light and heat conditions in the middle and lower layers are good, promoting the development of the shrub and herb layers, thus forming shrubs and herbs as the dominant populations. This is also consistent with the actual investigation situation. In the Sanmenxia community, except for the Zelkova sinica and Diospyros Lotus Linn, which are wild, artificial planting of timber or economic tree species such as Eucommia ulmoides and Robinia pseudoacacia has improved the richness of the trees. Due to these being large crown trees, they block sunlight from entering the understory, thereby inhibiting the growth and development of middle- and lower-layer plants. In addition, artificial afforestation construction has also caused the disappearance of some plant resources. So, except for the slightly higher diversity index of trees, the diversity index of shrubs and herbs is lower; The higher the evenness index of species in the population, the lower the dominance index, reflecting the more uniform distribution of individuals in the population and the fewer single superior species, indicating the higher stability of the community. On the contrary, the stability is relatively low. It can be seen from Table 2. The species evenness index of Sanmenxia community is low, while the dominance index is high, of which the herb dominance index is the highest (0.88), which is due to the relatively poor light and heat conditions at the lowest layer, and only a few herbs with strong shade tolerance can survive, such as Elymus lanceolatas and Galium mongolicum. The overall evenness of the Jiaozuo community is high, with a maximum difference of only 0.06 among the three levels. The dominance index of herbaceous species is low. The dominance index of shrubs and trees is high, which is because the tree species in this area are relatively single, but limited by natural conditions, they will not pose a threat to the stability of the community. However, the co-superior species composed of wild Gleditsia sinensis and Elaeagnus mollis has obvious dominance in the arid and barren environment of Taihang Mountain. But this survey found that when these two species grow for too long or have too large specifications, they will wither and undergo natural regeneration. This is determined by its site carrying capacity, which also ensures the stability of the A total of 35 families, 71 genera, and 98 species of plants were investigated in two sample plots. The composite family has the most plant species, accounting for more than 14%, and the herbaceous plant species are the most abundant, accounting for more than 50%. The important values of Elaeagnus mollis in Jiaozuo and Sanmenxia plots are 45% and 39%, respectively, which are not top-level species.",
    "The overall plant richness of the Jiaozuo sample plot is high, with herbaceous and shrub richness indices of 3.87 and 3.25, respectively, while tree richness is relatively APPLIED ECOLOGY AND ENVIRONMENTAL RESEARCH 23(1):839-849. http://www.aloki.hu ● ISSN 1589 1623 (Print) ● ISSN 1785 0037 (Online) DOI: http://dx.doi.org/10.15666/aeer/2301_839849 © 2025, ALÖKI Kft., Budapest, Hungary low. The plant richness of the Menxia sample plot is low, and the highest richness index of herbs is only 2.01, while the richness index of trees and shrubs is lower than 2.0. The diversity index of trees in the Jiaozuo sample was lower than that in the Sanmenxia sample, while the herbaceous and shrub populations were 0.50 and 0.83 higher, respectively. The species evenness index of Sanmenxia community is low, while the dominance index is high. According to flora of China, Elaeagnus mollis are distributed in valleys and wet areas on sunny slopes and semi shady slopes at an altitude of 700-1300 m. The population of Elaeagnus mollis in the Qingtian River of Jiaozuo is concentrated between 400 and 500 meters above sea level. In recent years, their wild population has sharply shrunk due to poor self-reproduction ability and rare seeds in field investigations, consisting of root tillering seedlings. This study on the plant diversity of wild communities of Elaeagnus mollis in Henan region is of great significance for promoting the stable development of wild communities in this area and protecting rare plant resources. It provides a reference for the next step of biomimetic cultivation. Due to the short duration of research and insufficient data accumulation, this article did not further explore the functional diversity of communities. Conducting research on community functional diversity can better predict ecosystem functions. From the conclusion, the Elaeagnus mollis is not a top-level species in both community structures. If relying solely on natural succession, it is difficult to achieve the expected results in a brief period of time. So, it is necessary to increase auxiliary measures, such as manual nurturing in management to clean up the plants around the Elaeagnus mollis that affect its growth, to achieve the purpose of protection. This is consistent with Liu et al.’s proposal to restore a sufficient habitat area (Liu et al., 2019) and Feng et al.’s emphasis on achieving ecological sustainability of target tree species through human intervention (Feng et al., 2021). If only considering environmental factors, the small west slope of Sanmenxia is located on the north slope of Funiu Mountain, which belongs to loess hilly landform. The environmental factors are excellent, and the plant richness index, species diversity index and evenness index should be higher than those of Jiaozuo Qingtian River. But the actual investigation is exactly the opposite. This fully demonstrates that human activities are the biggest interfering factor in the process of natural succession. Therefore, strengthening wildlife protection and prohibiting the entry of humans and animals are key measures for in situ conservation. This is consistent with the conclusion of Lu Peng, Xu Yan, Bi Runcheng, and others that human indiscriminate logging is severe, the population has sharply decreased, and is in an endangered state (Lu et al., 2011)."
]