[
    "Abstract.Using the University of Notre Dame Global Climate Adaptation Index (ND-GAIN) assessment model for reference, the assessment system and model of agricultural disaster resistance in Henan Province are constructed.The spatial characteristics of agricultural disaster resistance subsystem (vulnerability and preparedness) of 18 cities in Henan Province in 2018 were studied by using GIS technology from six perspctives such as sensitivity, exposure, emergency, management, capacity to analyze. The results show that the agricultural disaster resistance ability of Henan Province is in the middle to lower level, showing the spatial difference pattern of high in the west, low in the southeast and weak in the north and south; the difference of vulnerability index is small, and the difference of preparedness index is large; the difference in the degree of preparedness is the main reason for the obvious difference in the level of agricultural disaster resistance; the development of agricultural disaster resistance in different regions is not balanced, and the disaster resistance in Zhengzhou is the strongest, followed by Luoyang and Sanmenxia, Zhoukou and Zhumadian are less resilient. Agricultural disasters have profoundly affected the social stability and healthy economic development of China for a long time. The core of disaster prevention and mitigation is to enhance the ability to resist risks, and the key is to build the ability to resist disasters. In May 2019, the United Nations convened the sixth Global Platform for Disaster Reduction conference on the theme \"Resilient Dividends: Towards Sustainable and Inclusive Societies \", which set out the goal of building resilient societies that are sustainable and inclusive. destructive outcomes that enable the organizational system to repair disasters and adaptive processes that improve the ability to respond to threats through the reorganization, transformation and learning of social organizational systems[4]. Resilience has also begun to gradually transition to resilience, research findings show that the two have basically converged. With the development of research, the ability to resist disasters has gone on Growing into a comprehensive concept that emphasizes both the intrinsic qualities of an organization or system and the ability to respond to and recover from disasters. The Disaster Resilience study began with the concept of \"resilience \". The American ecologist Holling creatively introduced resilience into ecosystem stability research in the 1970s, and ecosystem resilience research was more widely used in ecological environment restoration[1]; subsequently Timmerman and so on introduced resilience into the field of social and environmental change, linking resilience to vulnerability for the first time, believing resilience to be the system's ability to withstand and recover from external shocks[2]; joint national International Strategy for Disaster Reduction (UNISDR) introduced the concept of resilience into the field of disaster science as a measure of the ability of a system or community to resist or reduce the loss of natural disasters[3]. Based on a comprehensive consideration of the above scholars' views, Cutter points out that resilience includes both On the research of disaster resistance evaluation, scholars at home and abroad mainly focus on the following two aspects: first, qualitative evaluation. Qualitative evaluation pays more attention to the importance of resilience, influencing factors and intrinsic characteristics, and determines the resilience of society, organization or system through certain factor conditions. The National Research Council of the United States, in its report Resilience: A National Imperative, for example, in 2012, identified a unified framework of qualitative indicators for measuring resilience, namely,vulnerable populations, key environmental infrastructure, social factors and built infrastructure[5]; Bruneau identified resilience concept of necessity, and put forward that the evaluation of resilience to disasters is composed of four interrelated dimensional spaces: technical, organizational, social and economic[6]; Second, quantitative evaluation. © The Authors, published by EDP Sciences. This is an open access article distributed under the terms of the Creative Commons Attribution License 4.0 (http://creativecommons.org/licenses/by/4.0/). Han Jiannan introduced the disaster resistance ability of integrated prevention and control system into the evaluation model from the inherent attributes of the traditional disaster body and the passive attributes of the disaster bearing body for quantitative research [7]. Shaw proposed the Climate Disaster Resilience Index , which uses weighted combined averages to calculate targets from five aspects: natural environment, physical factors, social, economic and infrastructure regional resilience index[8]. Therefore, this study draws lessons from the global climate adaptation index (ND-GAIN) model of Notre Dame University in the United States, constructs the evaluation index system of agricultural resilience in Henan Province, and analyzes the agricultural resilience strength, spatial zoning characteristics and main influencing factors of 18 cities in Henan Province in 2018 in combination with GIS technology, so as to provide a reference basis for improving the agricultural resilience of Henan Province and reducing the difference of agricultural resilience among regions.",
    "The University of Notre Dame Global Climate Adaptability Index (referred to as ND-GAIN) is an emerging leading indicator at the national level for the prediction and prevention of climate change issues. It is an evaluation system developed by the University of Notre Dame to assess the resilience and adaptability of countries or regions to natural disasters[9]. It outlines a country's vulnerability to global challenges, such as climate change, and its willingness to increase resilience to natural disasters. ND-GAIN index model framework includes two aspects: one is the vulnerability of a country or region in the context of climate change, assessing the vulnerability of a country through six life support sectors, such as food supply, water safety and health; the other is the level of preparedness of a country or region to respond to natural disasters at the social level and in terms of economic capacity, measured mainly in terms of economic preparedness, management preparedness and social readiness, taking into account national development, social inequality and education. The index model aims to enhance the understanding of countries or regions around the world of climate change adaptation and resilience to disasters and to assist Decision makers make decisions. Agricultural resilience is a complex system, which requires a multi-faceted, multi-level and multi-angle scientific of regional agricultural resilience. There are many factors affecting agricultural resilience, both engineering and non-engineering. Based on ND-GAIN evaluation model, the regional agricultural disaster resilience evaluation model is divided into two the parts: agricultural disaster vulnerability index model and agricultural disaster preparedness index model. Vulnerability index is measured from three aspects: sensitivity, exposure and adaptability, and readiness index is measured from three aspects: socio-economic support ability, emergency management ability and agricultural engineering defense ability.Taking into account the actual situation of natural geography, hydrometeorology and agricultural environment Henan Province, and referring to the research results of Zhang Hao, Shi Peijun and Gu Hongbo[10-15], the evaluation system of agricultural resilience in Henan Province has been constructed through the replacement and screening of a series of indicators, as shown in Table 1. in Taking 2018 as the evaluation year and 18 cities in Henan Province as the basic evaluation unit, considering the availability and practicability of the data, the data collection is mainly derived from the data collection. The data issued by the official departments, such as Henan Statistical Yearbook, Henan Water Resources Bulletin, Henan Rural Statistical Yearbook, and 2018 Henan Municipal Statistical Bulletin for National Economic and Social Development, are all standard statistical data issued by government departments. Reference to the calculation formula of the global climate adaptability index of the university of mary, combined with the data characteristics of each evaluation index, this study used linear interpolation method to estimate and fill the missing data; in order to eliminate the impact of dimensional differences on the comprehensive evaluation, this standardized the original data.Set the study Min-Max as the original index data , as the index standardized data, the Reference to the index calculation method in the ND-GAIN model, the second level index value corresponds to the sum of the weight coefficients of the third level index, and the first level index is the average value of the corresponding second level index. where the vulnerability index optimal score is 0, the lower the better; the preparation degree index optimal score is 1, the higher the better. The is the corresponding number of secondary indicators, the is the third level index weight, the is the standardized value of the index, the is the readiness index, the is the vulnerability index, and the is the resilience index. The entropy weight method is used to determine the weight of the evaluation index. Entropy is a measure of the degree of information disorder, the smaller the information entropy of the index, the greater the uncertainty, the greater the amount of information explained by the index, the greater the role played in the comprehensive evaluation, and the greater the weight[16]. According to the disaster resilience evaluation model, the scores of disaster resilience index, vulnerability index and readiness index of Henan province in 2018 can be calculated, as shown in Table In general, the evaluation index of agricultural resilience in Henan Province is low, and it shows the characteristics of high in the west, low in the southeast and weak in the north and south. Due to the influence of monsoon climate and different north and south latitudes, the difference between east and west terrain is obvious. The eastern and southeast plains are vulnerable to drought, strong winds and other disasters; the western and northern regions are vulnerable to extreme meteorological disasters such as wind and waterlogging, frost and hail, and the agricultural disaster resistance ability in Henan Province has obvious spatial differences. From the spatial region, Zhengzhou, Luoyang, Sanmenxia have the strongest resilience, followed by Kaifeng, Jiaozuo, mainly its agricultural disaster preparedness index score is relatively high; The weakest areas are Zhoukou, Zhumadian, Shangqiu and other places, and the vulnerability of agricultural disasters is high, so it is urgent for local government organizations to effectively defend themselves and strengthen the building of agricultural resilience to disasters.",
    "Based on the ArcGis10.6 software, the paper presents a visual analysis of agricultural resilience in Henan province fromsixfactors: sensitivity, exposure, adaptability, socio-economic, support, emergency management and agricultural engineering defense. The natural breakpoint method is used to divide the influence factors of each subsystem in space, as shown in figure 1. Vulnerability assessment subsystem impact factors include sensitivity, exposure and adaptability. As shown in Figure 1 (a)、(b)、(c): the sensitivity and exposure of agricultural risk in the east and south of Henan Province are obviously higher than those in the west and north, except in Jiyuan City, while the adaptability is generally high in the west, low in the east and weak in the north and weak in the south, which is roughly consistent with the spatial distribution characteristics of sensitivity and exposure. On the whole, the vulnerability evaluation index of Henan Province is high and the difference is small. As far as the region is concerned, Zhoukou and Zhumadian are more sensitive and exposed to the risk of agricultural natural disasters, and respond to external pressure and self-regulation to recover the ability is insufficient, the vulnerability index is high, so the evaluation of the resilience of the two is at a low level; the sensitivity and exposure degree of Zhengzhou, Luoyang and Sanmenxia cities are all low, and the evaluation of adaptability is high, so the vulnerability index is low, and the level of agricultural resilience is relatively high. It shows that sensitivity and exposure under agricultural risk pressure are the short board to reduce agricultural vulnerability and improve agricultural resilience, and to improve local agricultural risk pressure according to the role of key impact factors of subsystem, which is also the preferred direction to enhance agricultural resilience in the future. But because the two are the inherent attributes of agricultural disaster resistance, it is difficult to measure accurately. Therefore, all regions should take active measures to improve agricultural adaptability, reduce vulnerability and achieve sustainable development of agricultural resources. The sub-system of preparation degree evaluation is mainly composed of three factors: social and economic support ability, emergency management ability and agricultural engineering defense ability. As shown in Figure 1 (d)、(e)、(f): spatially, the evaluation of preparedness in the central and western regions of Henan Province is significantly higher than that in the southeast region, and the overall distribution is uneven and the regional differentiation is more obvious, among which the emergency management ability is quite different from the north and south; from the regional point of view, Zhengzhou and Luoyang City are in the advantage in three aspects of social and economic support ability,emergency management ability, agricultural engineering defense ability, Kaifeng City has a large investment in agricultural disaster emergency management, Jiyuan City as a river. South province's only urban-rural integration demonstration area, agricultural scale, industrialization, in agricultural engineering defense capacity building is more prominent; but in the southeast of Zhumadian City, Xuchang City, Shangqiu City and Zhoukou City multi-plain, vulnerable to natural disasters such as drought, floods and other natural disasters, relatively low level of economic development, insufficient resources security, weak emergency management capacity, to a large extent affected the development of agricultural resilience. Therefore, it is necessary not only to speed up the development of agriculture's own economy, but also to attach importance to the construction of emergency management and other related systems, and to shift the agricultural disaster resistance from focusing only on the response and recovery after the outbreak of disasters to the extent possible.To prepare for the prediction, prevention and resilience of agricultural disaster risks, to implement disaster prevention and mitigation work in various sectors, to create a cultural atmosphere of public awareness of crisis prevention and to carry out public awareness campaigns on popular knowledge of emergency response, to scientifically and accurately assess agricultural risks and their own resilience to disasters, and to mobilize all sectors of society to actively support agriculture in disaster response and disaster relief, to strengthen the construction of Based on the global climate adaptation index (ND-GAIN) model of Notre Dame University in the United States, the agricultural resilience of 18 regions in Henan Province was evaluated by constructing the evaluation index system of agricultural resilience. The results show that: The overall agricultural resilience of Henan Province is in the middle and lower level, the development of agricultural resilience is not balanced, the vulnerability index of each region is small, and the degree of preparation is obviously different. Vulnerability assessment subsystem is the inherent characteristics of agriculture, is the main impact factors of agricultural vulnerability; readiness assessment subsystem includes economic, social, natural and other complex attributes, socio-economic support capacity is the most fundamental guarantee for agricultural disaster prevention and mitigation. Agriculture in various regions is affected by economic, hydrological, geomorphological, climatic, soil and other factors, and the path focus on the improvement of disaster resistance is also different.",
    "In space, the agricultural resilience of Henan Province presents the characteristics of high west, low southeast and weak north and south. Among them, the southeast region with high vulnerability and high preparation degree is mainly distributed in the central and western regions with relatively rapid economic development, such as Zhengzhou, Luoyang and Sanmenxia. The agricultural disaster resistance of 18 regions in Henan Province was ranked from strong to weak, and it was concluded that the areas with higher disaster resistance were Zhengzhou City, Luoyang City and Sanmenxia City, and the areas with lower disaster resistance were Zhoukou City, Xuchang City and Zhumadian City. The difference in the level of preparedness among regions is the main factor affecting the marked difference in the level of resilience of agriculture, and the level of preparedness in one region determines the region's efficient response capacity and resilience to disasters. Therefore, the high level of resilience should not only reduce the exposure and sensitivity of the disaster-bearing body, but also do a good job of preparing for agricultural disaster resistance, from passive \"impact\" response to active self-assessment, defense, economic logistics support, emergency response management, agricultural engineering construction is indispensable. Systematic and comprehensive evaluation index system and effective evaluation method are the basis and guarantee of agricultural resilience evaluation. agricultural production system is a complex system. In view of different agricultural situation, regional situation and disaster situation, different disaster prevention and mitigation management measures should be taken to construct a new effective prevention and adaptation mechanism. In addition, the comprehensive evaluation involves the discussion of weight value, evaluation value and distribution characteristic, this study only focuses on the analysis of evaluation value and distribution characteristic, and the weight of each influencing factor needs to be further explored."
]