[
    "Abstract. Henan Province is a major economic province of China with significant aggregate energy consump- tion. In the context of studying the problems of factors and elements of sustainable economic development, the author sets the task of researching the relationship between energy consumption and economic growth. Using data from 2001-2021 and Stata 15 software, it can be studied that the gross regional product (GRP) of Henan province has relatively low energy-intensive nature, since for each percentage point of increase in energy consumption, GRP increases by about 4.12 percentage points. However, electricity production is based on an expensive and limited resource, and environmental pollution occurs. Therefore, the challenge for manag- ing the sustainable development of Henan Province is to increase its GRP while reducing energy consumption. In the process of sustainable development of Henan Province, the author recommends stepping up research and development, developing new energy-saving technologies; increase the share of clean energy use, optimize the structure of energy consumption, increase public awareness of the need for energy saving. For citation: Xu Lulu. Research on energy consumption and economic growth in Henan Province (China) based on sustainable development. State and Municipal Management. Scholar Notes. 2023;(4):282–289. (In Russ.). https://doi.org/10.22394/2079-1690-2023-1-4-282-289. EDN XXPLHD Аннотация. Провинция Хэнань является крупной экономической провинцией Китая со значительным совокупным потреблением энергии. В контексте изучения проблем факторов и элементов устойчивого экономического развития автор ставит задачу изучения взаимосвязи между потреблением энергии и экономическим ростом. Основываясь на данных за 2001-2021 годы и программном обеспечении Stata 15, было установлено, что валовой региональный продукт (ВРП) провинции Хэнань имеет относи- тельно низкий энергоемкий характер, поскольку на каждый процентный пункт увеличения потребле- ния энергии ВРП увеличивается примерно на 4,12 процентных пункта. Тем не менее, производство электроэнергии основано на дорогостоящих и ограниченных ресурсах, кроме того, происходит загряз- нение окружающей среды. Следовательно, задача управления устойчивым развитием провинции Хэнань заключается в росте ее ВРП при снижении объема энергопотребления. В процессе достижения устойчивого развития провинции Хэнань автор рекомендует активизировать научные исследования и разработки, внедрять новые энергосберегающие технологии; увеличить долю использования эколо- гически чистой энергии, оптимизировать структуру энергопотребления, повысить осведомленность общественности о необходимости энергосбережения. Ключевые слова: потребление энергии, провинция Хэнань, устойчивое развитие, экономический рост Для цитирования: Сюй Лулу. Исследование потребления энергии и экономического роста в провинции Хэнань (Китай) на основе устойчивого развития // Государственное и муниципальное управление. Ученые записки. 2023. № 4. С. 282–289. https://doi.org/10.22394/2079-1690-2023-1-4-282-289. EDN XXPLHD In recent years, the economy of Henan Province has experienced rapid growth. As one of the factors promoting economic growth, energy consumption has also been increasing year by year. However, the continuous increase in total energy consumption will bring about the following crises. Firstly, the use of energy will bring about a crisis of resource shortage. Although Henan Province has relatively abundant energy, its energy production is limited, and most of the energy is nonrenewable. Therefore, if we consume energy without restraint in order to develop the economy of Henan Province, it will inevitably lead to energy shortages. Secondly, the use of energy can bring about a crisis of environmental pollution. The energy consumption in Henan Province is mainly coal, and the use of coal will emit a large amount of harmful substances, such as sulfur dioxide, carbon dioxide, etc., which will exacerbate environmental pollution. As early as September 2020, the Chinese government explicitly stated its goal of achieving peak CO2 emissions by 2030 and striving to achieve carbon neutrality by 2060. Therefore, based on the above crisis, this article focuses on energy consumption and economic growth of Henan Province. Amine L., Ramzi B., Anthony M. (2019) conducted an empirical analysis of the causal relationship between oil consumption and economic growth in the United States, and concluded that changes in oil consumption can cause changes in economic growth, which is also in line with practical economic significance [1]. Li J.J., Wang N. (2019) found that coal consumption has increased China's ecological and environmental burden, leading to enormous pressure on emissions reduction. Therefore, they proposed that the efficient use of coal energy and the improvement of technological level are important ways to promote China's green economic growth [2]. Hu X.Y. (2019) used statistical data of Chongqing from 1997 to 2016 to analyze the relationship between energy consumption and economic growth by the Granger causality test method. The author found that economic growth of Chongqing will not lead to an increase in energy consumption, but an increase in energy consumption will promote economic growth [3].",
    "Chandrasheekar R. and Krishna R.C. (2020) selected India's energy consumption and industrial structure data from 1998 to 2016. The analysis results showed that the primary industry has a much lower degree of depend- ence on energy consumption than the secondary and tertiary industries, and the secondary industry has the highest degree of dependence on energy consumption [4]. Lekana H.C (2020) studied the relationship between energy consumption and economic development from 20 countries in South Africa from 1996 to 2017 using methods such as generalized matrix and Granger test. The author found that the former is a one-way causal relationship with the latter, and the catalyst for this relation- ship is governance quality [5]. Magazzino C., Mele M., Schneider N. (2020) studied Germany and Japan and found that changes in natural gas consumption in Germany and Japan can lead to economic development, which can also lead to an increase in the amount of natural gas used, but Japan expects a longer transmission time [6]. Wang S. (2020) found an inverted U-shaped trend between green energy consumption and economic develop- ment based on Chinese data, with carbon emissions contributing significantly to green energy consumption and economic development [7]. Zhu H., Zheng J., Zhao Q.Y. (2020) used data of 67 global economies to empirically study the influence of eco- nomic growth on energy structure transformation and carbon dioxide emissions using a simultaneous equation model. The author found an inverted \"U\" shaped relationship between the two variables mentioned above [8]. Roger S., Lgnacio D.B., Perissi I. (2020) used the European Union scale MEDEAS model to evaluate how the uncertainty of major driving factors affects key socio-economic and environmental indicators, and found that energy efficiency and usage parameters have the most severe influence to the economy and environment [9]. Ma S.P., Liu Q.Q., Zhang W.Z. (2022) found that there are multiple causal hypotheses between energy use and economic development [10]. In recent years, the gross regional product (Hereinafter referred to as GRP) of Henan Province has shown a trend of increasing year by year. As shown in Figure 1, the gross regional product of Henan Province has grown rapidly from 553,3 billion yuan in 2001 to 5888,7 billion yuan in 2021. In 2021, Henan Province ranked 5th in China in terms of gross regional product. As a province with a large grain and population, this is a relatively good achievement. Industrial structure refers to the proportion of agriculture, industry, and service industries in a country's eco- nomic structure. The promotion and rationalization of industrial structure can promote regional economic development. Next, we will analyze the changes in the industrial structure of Henan Province based on the ratio of the first, second, and third output values to the gross regional product from 2001 to 2021, in order to further analyze the current economic development status of Henan Province. The composition of Henan Province's GRP by industry is shown in Figure 2. From Figure 2, it can be found that in the industrial structure of Henan Province from 2001 to 2021, the scale of the primary industry steadily decreased year by year, while the scale of the secondary industry showed a trend of first increasing and then decreasing. From 2001 to 2009, it rose to the highest point of 54,8% year by year, and then declined. By 2021, the proportion was only 41,3%, while the proportion of the tertiary industry showed a steady upward trend, rising from 33,3% in 2001 to 49,1% in 2021. From Figure 2, it can be clearly observed that the proportion of the secondary industry in the economy has always been high, but this position has gradually been replaced by the tertiary industry. The proportion of the tertiary industry surpassed that of the secondary industry for the first time in 2017 [11]. This is mainly because the secondary industry is dominated by industry, which is also an industry with high energy consumption. In recent years, with the constraints of energy shortages, the introduction of ecological construction policies in China, and the crisis of environmental pollution, the develop- ment speed of the secondary industry has slowed down; This phenomenon also marks the upgrading of the overall industrial structure in Henan Province, making the industrial structure more rational and advanced.",
    "Henan Province, as a province that has transformed from a major agricultural province to a province that em- phasizes both industry and agriculture, is not only a major economic province, but also a major energy consum- ing province. The total energy consumption increased from 83,67 million tons of standard coal in 2001 to 235,01 million tons of standard coal in 2021 [11], indicating a significant growth rate in energy consumption, as shown in Figure 3. In terms of energy consumption structure, coal is mainly used, but the total amount of coal is limited. Therefore, Henan Province must pay attention to energy consumption on the path of sustainable development. Based on the experience of selecting indicators in relevant literature and the availability of data, this article selects Henan Province's annual GRP as an alternative indicator for economic growth, with a unit of 100 million yuan; The total energy consumption (EC), as an alternative indicator of energy consumption in Henan Province, is measured in 10000 tons of standard coal [11]. The data sample length is 21 consecutive sets of data from Henan Province from 2001 to 2021. The required data comes from the Henan Provincial Statistical Yearbook, etc. Based on these data, empirical analysis was conducted using Stata software. If two-time series are non-stationary, there may be a phenomenon of \"pseudo regression\". Since the GRP and EC variables are non-stationary, natural logarithms are taken separately to make the two series closer to sta- tionarity. The logarithmic time series data is calculated as LnGRP and LnEC. This article uses the ADF method for stationarity testing, and uses Stata15 software to perform ADF stationarity testing on LnGRP and LnEC, as shown in Table 1. D1 and D2 in Table 1 represent first-order and second-order differences for time series data. Table 1 presents the results of the stationarity test values for time series data LnGDP and LnEC, as well as the stationarity test values after first-order and second-order differences between LnGDP and LnEC. From Table 1, it can be found that the stationarity test values of LnGDP and LnEC are both greater than the critical values of 1%, 5%, and 10% stationarity tests, confirming the original hypothesis and indicating that LnGDP and LnEC are not stationary time series; At the same time, the first-order difference stationarity test values of the time series data of LnGDP and LnEC are also greater than the critical values of the 1%, 5%, and 10% ADF tests, confirming the original hypothesis and indicating that LnGDP and LnEC after the first-order difference are still non-stationary; The ADF test values of the second order difference for the time series data of LnGDP and LnEC are all lower than the critical values of the stationarity tests of 1%, 5%, and 10%, rejecting the original hypothesis, indicating that the second order difference for LnGDP and LnEC is stationary [11]. Therefore, it is necessary to conduct further cointegration tests to determine the second-order single integration I (2) of LnGDP and LnEC variables in Henan Province from 2001 to 2021. Through the stationarity test mentioned above, we have learned that there may be a cointegration relationship between EC and GRP, so the next step is to conduct cointegration testing. The above stationarity test results show that both the time series LnEC and LnGRP are second-order single integer I (2), which meets the require- ments of cointegration testing. This article uses Johansen cointegration testing to conduct cointegration testing. Firstly, test the optimal lag order of the VAR corresponding to the time series. If the lagging order is not selected properly, the information contained in the lagging variable will be omitted, leading to significant estimation errors. To avoid losing a significant amount of freedom, this article sets the maximum lag order to 3, and uses six information criteria: LL, LR, FPE, AIC, HQIC, and SBIC to automatically select the lag order. The software Stata15 is run, and the results are shown in Table 2. From Table 2, it can be known that lagging third order (marked with *) should be chosen. According to Table 3, there is a cointegration relationship between LnEC and LnGDP, with * indicating that there is one cointegration relationship between the two variables mentioned above. Meanwhile, from Table 4, it can also be seen that there is a cointegration relationship between the two variables mentioned above.",
    "From an economic perspective, this relationship indicates that there is an equilibrium relationship between GRP and total energy consumption in Henan Province, and energy consumption will promote economic growth in Henan Province. Specifically, for every one percentage point increase in energy consumption in Henan Province, the gross regional product will increase by approximately 4,12 percentage points. This indicates that changes in energy consumption in Henan Province can affect economic growth. There are three types of claims about the causal relationship between economic growth and energy consump- tion, namely growth type, conservation type, and neutral type. Growth type refers to economic growth relying on energy consumption, and an increase or decrease in energy consumption will lead to a corresponding in- crease or decrease in economic growth rate. Economical type refers to economic growth that does not rely on energy consumption, and sustained economic growth or decline will lead to an increase or decrease in energy consumption. Neutral type refers to the fact that there is no relationship between the two, and changes in either aspect will not cause corresponding changes in the other. From the above analysis, it can only be concluded that there is a long-term stable equilibrium relationship be- tween GRP and EC, but the causal relationship between the two is not unknown. Therefore, a Granger causality test is required. This section conducts Granger causality tests on the cases of lag 1st order, lag 2nd order, and lag 3rd order, and the results are shown in Table 6. As shown in Table 6, it can be known that LnGRP is not the Granger cause of LnEC. The probabilities of lagging in the first, second, and third orders are 0,4980, 0,6895, and 0,0762, respectively, which are greater than 0,05. The test results accept the original assumption that 'LnGRP is not the Granger cause of LnEC', indicating that economic growth in Henan Province is not the Granger cause of energy consumption. Meanwhile, LnEC is not the Granger cause of LnGRP, and the probabilities of lagging behind the first, second, and third orders are 0,0000, 0,0109, and 0,0398, respectively, which are less than 0,05. The test results reject the original hypothesis that 'LnEC is not the Granger cause of LnGRP' [11], indicating that energy consumption in Henan Province is the Granger cause of economic growth. From this, it can be seen that the increase in energy consumption in Henan Province will promote economic growth, belonging to the growth type. This conclusion is consistent with the conclusion of the previous cointegration analysis, and also conforms to the reality of economic development in Henan Province. 1. According to stationarity testing, it can be seen that that the time series data of Henan Province's Gross Re- gional Product and Henan Province's energy consumption processed by second-order difference shows station- arity. Through the Granger causality test, it was found that the changes in energy consumption of Henan Prov- ince can cause changes in the GRP of Henan Province. 2. Through cointegration testing, there is a long-term equilibrium relationship between GRP and energy con- sumption of Henan Province. Through the model, it can be seen that 1% increase in energy consumption in Henan Province, the gross regional product will increase 4,12%. This indicates that energy consumption in He- nan Province contributes to promoting economic growth. However, with the shortage of total energy, whether the energy supply in Henan Province can support the rapidly growing economy in the future has become a focus of scholars' attention. Based on the above analysis, it can be seen that energy consumption contributes to economic development, but the total amount of energy is limited. Meanwhile, the process of consuming energy can release harmful gases and pollute the environment. So, for the sake of achieve sustainable economic development in Henan Province, this article proposes the following suggestions. First, there is a task to increase research and development efforts, and develop new energy-saving technologies. At present, the utilization rate of renewable energy in Henan Province is relatively low, and there is a shortage of coal resources due to excessive use. So, it is necessary to develop new technologies, eliminate old equipment with high energy consumption. Secondly, increase the development of clean energy and optimize the energy consumption structure. Henan Province should vigorously develop clean energy, such as solar and wind energy, based on its own resource conditions. These clean energy sources have the characteristics of abundant resources and low pollution. In- creasing the scale of clean energy in energy consumption is conducive to optimizing the energy consumption structure.",
    "Finally, strengthen residents' awareness of energy conservation. Henan Province is a populous province, and its residents have a relatively large amount of energy consumption. Therefore, energy conservation is not only the responsibility of the government and enterprises, but also the responsibility of residents to take on energy conservation. On the one hand, we need to increase the efforts of community energy-saving publicity, call for comprehensive participation in energy-saving training, cultivate residents' energy-saving awareness, and vol- untarily undertake energy-saving tasks. In summary, based on the above suggestions, we hope that Henan Prov- ince can achieve synchronous development of energy, economy, and environment systems."
]