[
    "ABSTRACT: The Managing agricultural water pollution is crucial for mitigating the water crisis and fostering sustainable regional development. Therefore, it is essential to understand the spatiotemporal characteristics of agricultural Grey Water Footprint (GWF) and its efficiency to formulate tailored regional management strategies. Building on this, the study first calculated the agricultural GWF and efficiency for 18 prefecture-level cities in Henan Province from 2001 to 2021, and then analyzed their spatiotemporal patterns using ArcGIS software. The findings reveal: (1) In Henan Province, the majority of agricultural grey water footprint stems from crop cultivation, particularly from phosphorus fertilizers. Over time, the agricultural grey water footprint in Henan Province initially increased and then decreased, with the southern areas generally exhibiting a higher footprint compared to the north. (2) Prior to 2012, the efficiency of agricultural grey water footprint in Henan Province remained relatively stable, but has since seen a sharp rise, with the central region consistently demonstrating higher efficiency. These results offer critical decision-making insights for managing agricultural water pollution and guiding industry rest. With the advancement of urbanization, rapid development of industrialization, and the increasing challenges of water scarcity, water pollution, and water ecological crisis, they have become bottlenecks for sustainable development(Zhai et al.,2014). How to coordinate the relationship between agricultural production, water resource utilization, and water environment protection is an important issue facing this region. Therefore, a comprehensive evaluation of regional agricultural non-point source pollution in Henan Province can provide effective theoretical basis and data support for the control of agricultural water pollution and the adjustment of agricultural production structure in the region, which is of great significance for the sustainable development of regional agriculture. Since (Hoekstra,2003) proposed the concept of \"water footprint\" in 2003, related research has developed rapidly. In (Hoekstra et al.,2008) further proposed the concept of \"grey water footprint\" , which is a pollution related indicator that represents the volume of freshwater required to absorb and assimilate a certain pollutant load based on natural background concentration and existing environmental water quality standards (Hoekstra et al.,2012). The proposal of grey water footprint enables the evaluation of water pollution from the perspective of water quantity, which can be compared with the amount of water consumption (CHapagain et al.,2006). The advantage of measuring water pollution based on the amount of water occupied is that different types of pollutants have a common starting point, which is the amount of water required to dilute the pollutants (Hoekstra et al.,2012). This provides a new method for water pollution assessment, which makes up for the shortcomings of traditional single factor index evaluation methods, fuzzy mathematics methods, comprehensive pollution index methods, and other evaluation methods (Zhang Xin et al.,2019). The agricultural field is one of the important application areas of water footprint research methods, and currently its research mainly focuses on the study of planting from different temporal and spatial dimensions The water footprint evaluation of the industry and its products mainly involves green water and blue water footprints, with less inclusion of grey water footprint in the analysis. On the other hand, research on grey water footprint mainly focuses on regional grey water footprint evaluation, spatial pattern changes, and analysis of driving factors. There is relatively little research on agricultural grey water footprint, and it is mostly limited to water pollution caused by pesticide and fertilizer application in agriculture, neglecting water pollution caused by livestock and poultry farming. (Mekonnen et al.,2015) revealed the spatiotemporal distribution of grey water footprint caused by global anthropogenic nitrogen and phosphorus emissions from 2002 to 2010, and evaluated the water pollution status of major rivers based on the ratio of specific grey water footprint of nitrogen and phosphorus pollutants to available water resources. However, many studies only consider TN and COD as evaluation factors in agricultural grey water footprint and ignore TP, such as (Song et al.,2023) who used TN and COD as evaluation factors in the calculation of agricultural grey water footprint in Henan Province. (Cui et al.,2020) conducted a study on the northwest region of China, which showed that in 2015, the contribution of agricultural grey water footprint accounted for 84.81%, with aquaculture being the main contributor. Due to the neglect of the two major elements of animal husbandry and grey water footprint, there has been a certain deviation in the evaluation of sustainable utilization of agricultural water resources. Therefore, this study adopts the grey water footprint theory and method, incorporating planting and livestock breeding industries into the analysis framework. It comprehensively examines the spatiotemporal distribution of agricultural grey water footprint and efficiency in 18 prefecture level cities in Henan Province from 2001 to 2021, and proposes corresponding treatment methods based on the pollution situation in each city.",
    "As shown in Figure 1, Henan Province is located in the central eastern part of China, in the middle and lower reaches of the Yellow River, between longitude 110 ° 21 ′ -116 ° 39 ′ E and latitude 31 ° 23 ′ -36 ° 22 ′ N, with a total area of approximately 167000 square kilometers. The terrain of Henan Province is complex, with high terrain in the west and low terrain in the east, flat terrain in the north and concave terrain in the south. There are four major water systems in the area: the Yellow River, Huai River, Yangtze River, and Haihe River. Henan Province belongs to the warm temperate subtropical and humid semi humid monsoon climate. The average annual temperature in the province is generally between 12 ℃ and 16 ℃. The crop maturity system is two harvests per year in the northern region, two harvests per year, and three harvests per year in the southern region. There are significant regional differences in land development and utilization in Henan Province, with the northwest being mountainous and hilly areas, the central and eastern being the Huang Huai Hai Plain area, and the southwest being the Nanyang Basin. Farmland is concentrated in the central eastern region, while forest land is concentrated in the higher altitude areas of northern, western, and southwestern Henan. Grassland is interspersed in the transitional zone between mountainous forest land and hilly plains. The planting area of grain in Henan has remained stable at over 160 million mu throughout the year, with wheat planting area remaining stable at over 85 million mu, ranking first in the country. However, there is a shortage of water resources and serious pollution caused by agricultural production. The fertilizer application rate, livestock and poultry quantity, and total agricultural output value per hectare of arable land are sourced from the Henan Statistical Yearbook, and some missing data in the yearbook are obtained using interpolation method; The feeding cycle t, daily fecal output, daily urine output, amount of Class I pollutants in feces, content of Class I pollutants in urine, loss rate of Class I pollutants in feces, and loss rate of Class I pollutants in urine are sourced from relevant data in the \"National Survey and Prevention Measures for Pollution in Large scale Livestock and Poultry Farming Industry\". The maximum allowable concentration of pollutants comes from the standard limit values for COD, nitrogen, and phosphorus pollutants in Class III water bodies in the \"Environmental Quality Standards for Surface Water\" (GB 3838-2002). The discharge standard concentrations for COD, nitrogen, and phosphorus pollutants are 20mg/L, 1mg/L, and 0.05mg/L, respectively. The loss rates of nitrogen fertilizer and phosphorus fertilizer are 86.7% and 36.0%, respectively. Animal husbandry, as an important component of agricultural production, is gradually increasing the amount of agricultural water pollution emissions. In recent years, the improvement of people's quality of life has led to a surge in demand for livestock and poultry products, and the livestock and poultry breeding industry has developed rapidly. However, the unreasonable treatment and arbitrary discharge of livestock and poultry manure have caused serious water pollution in the watershed. This article uses pigs, cows, sheep, and poultry as representative objects to calculate the amount of wastewater discharged from animal husbandry. The calculation of grey water footprint in animal husbandry selects chemical oxygen demand (COD) and total nitrogen as pollution factors, and the maximum value is the grey water footprint discharged from animal husbandry. The calculation formula is as follows: This article will calculate the regional agricultural grey water footprint (GWFagr) from the two agricultural production sectors of planting and animal husbandry. The measurement model is the agricultural grey water footprint (GWFagr), which is the sum of the planting grey water footprint and the animal husbandry grey water footprint The grey water footprint generated by crop cultivation mainly comes from the application of fertilizers and pesticides. Fertilizers and pesticides that are not absorbed by crops will enter surface water bodies through leaching under the action of rainfall and irrigation. Drawing on the accounting method of Hoekstra et al., this article uses the maximum grey water footprint generated by the loss of two pollution factors, nitrogen fertilizer (N) and phosphorus fertilizer (P), to represent the grey water footprint of agriculture. The calculation formula is obtained as follows: Lbre（i） = ∑ h=1 Nh × Dh × (fh × Phf × βfh + uh × Phu × βhu) In the above equation, GWFbre represents the grey water footprint of animal husbandry (m3), and GWFbre (i) represents the grey water footprint of pollutant i (i=COD/TN). Lbre (i) is the pollution load of i pollutants in livestock and poultry farming (kg), h is pigs, cows, sheep, and poultry, fh is the daily discharge of h, phf is the pollutant content per unit of h, βhf is the pollutant loss rate per unit of h, uh is the daily urine output of h,Phu is the pollutant content per unit of h, βhu is the pollutant loss rate per unit of h, Nh is the number of livestock raised in h (heads), Dh is the livestock raising cycle (d) of h.",
    "The efficiency of agricultural grey water footprint represents the economic benefits brought at the cost of unit water pollution. The larger the value, the more developed the agriculture in the region, while the smaller the value, the more backward the agriculture in the region. The specific calculation formula is as follows: Where GWFpla is grey water footprint of agriculture (m3), L is the i-th pollutant emission load (kg), Apple represents the mass of chemicals applied (kg), α represents the pollutant leaching rate, and Cmax is the highest concentration of pollutants under water quality and environmental standards (kg/m3); Cnat is the In the formula: g is the efficiency of agricultural grey water footprint, CNY/m3; GDP is the total agricultural output value, CNY. From 2001 to 2021, the grey water footprint of the planting industry in Henan Province mainly came from phosphorus fertilizers. The average annual grey water footprint of phosphorus fertilizers was 775.49×1010 m3, reaching its peak in 2012 at 876.23 ×1010 m3. The average annual grey water footprint of nitrogen fertilizers was only 189.93 ×1010 m, which is about a quarter of the grey water footprint of phosphorus fertilizers. From Figure 2, it can be seen that from 2001 to 2021, the average annual use of agricultural nitrogen fertilizer was 2.234 million tons, and the average annual use of phosphorus fertilizer was 1.077 million tons, which is about half of the nitrogen fertilizer use. However, the resulting grey water footprint is four times that of nitrogen fertilizer, indicating that the utilization rate of phosphorus fertilizer in Henan Province is low, the loss is large, and the pollution caused is also significant. As shown in Figure 2, since entering the 21st century, the regional agricultural grey water footprint in Henan Province has been basically divided into three stages, and the changes in these three stages are roughly the same. Each stage presents an inverted \"√\" shape of first increasing and then decreasing, but there are significant differences in the duration of the increase and decrease. The first stage was from 2001 to 2003, during which the grey water footprint began to increase and reached a small peak in 2002 before decreasing. The second stage was from 2004 to 2007, during which the grey water footprint continued to increase for three years before 2007 to 2021 is the third stage, which lasts for a long time. The boundary is set in 2012, reaching a peak of 899.31×1010 m in 2012, and reaching the lowest value of the entire stage in 2021, which is 596.69 ×1010 m. From 2001 to 2021, compared to the first two stages, the third stage had the longest duration and reached the highest peak. This was mainly due to the development of the economy in Henan Province, where a large amount of chemical fertilizers were used and the amount of livestock raised was also high. Environmental pollution became increasingly severe, and Henan Province paid more attention to the environmental problems caused by agricultural pollution, implementing a reduction in chemical fertilizers and gradually reducing livestock farming. Therefore, since 2012, the entire agricultural grey water footprint, including planting and livestock farming, has continued to decline. Overall, the efficiency of agricultural grey water footprint in Henan Province shows an upward trend, but upon closer observation, the efficiency of agricultural grey water footprint remained relatively stable from 2001 to 2012. Since 2012, Henan Province has paid more attention to environmental issues and reduced the use of fertilizers, resulting in a significant increase in efficiency from 2012 to 2021. Note: The bottom color in the figure represents the size of the greywater footprint, while the bar charts represent the size of the greywater footprint for agriculture and animal husbandry, respectively. Figures (a), (b), and (c) represent the years 2001, 2011, and 2021, respectively As shown in Figure 3 , the average agricultural grey water footprint in Henan Province in 2001 was 42.22 ×1010 m3, with the lowest value being 4.12 ×1010 m3 (Jiyuan City) and the highest value being 113.55 ×1010 m3 (Nanyang City). In 2011, the average agricultural grey water footprint in Henan Province was 49.68 ×1010 m3, with the lowest value being 4.00 ×1010 m3(Jiyuan City) and the highest value being 118.89 ×1010 m3(Nanyang City). In 2021, the average agricultural grey water footprint in Henan Province was 33.15×1010 m3, with the lowest value being 3.43×1010 m3 (Jiyuan City) and the highest value being 95.95 ×1010 m3(Nanyang City). Based on the highest and lowest values of these three years, the maximum value of 3.43 is taken. According to this limit, the agricultural grey water footprint in Henan Province can be divided into 5 areas, corresponding to severe, moderate, mild, and light pollution levels of agricultural non-point source pollution. According to Figure 3, in 2001, the heavily polluted areas were Nanyang City, Zhoukou City, and the moderately to heavily polluted areas were Zhumadian City, Xinyang City, Xinxiang City, and Shangqiu City. The moderately polluted areas were Anyang City, Puyang City, Jiaozuo City, Zhengzhou City, Kaifeng City, Xuchang City, Luoyang City, and Pingdingshan City. The moderately to mildly polluted areas were Sanmenxia City and Luohe City, and the mildly polluted areas were Jiyuan City and Hebi City. Compared to 2001, the average agricultural of heavily polluted areas increased from 2 to 5, while the number of moderately and severely polluted areas decreased from 8 to 5. The total number of moderately and mildly polluted areas decreased to 4. The level of agricultural non-point source pollution in Zhumadian City, Shangqiu City, Xinyang City, Pingdingshan City, and Anyang City significantly increased. Compared to 2011, the average agricultural grey water footprint in 2021 has decreased by 33.27%, with the number of heavily polluted areas decreasing from 5 to 2. The number of moderately to severely polluted areas remains unchanged, while the number of moderately to mildly polluted areas has increased from 4 to 7. Agricultural non-point source pollution has significantly decreased in Zhumadian City, Xinyang City, Shangqiu City, Pingdingshan City, Anyang City, and Xinxiang City. The bar charts of planting and animal husbandry in the three years show little difference, indicating that the overall grey water footprint of planting agriculture in Henan Province is much larger than that of animal husbandry. The grey water footprint of agriculture in the southern part of Henan Province is generally higher than that in the northern part. From 2001 to 2011, the grey water footprint increased from north to south, and from 2011 to 2021, the grey water footprint advanced from agricultural grey water footprint for 18 prefecture level cities in Henan Province from 2001 to 2021. Due to the significant changes in values, we used logarithmic normalization. The results are shown in Figure 5. From the distribution of time, the year 2011 can be divided into two stages: the first stage is from 2001 to 2010, and the second stage is from 2011 to 2021. The efficiency of agricultural grey water footprint in the first stage fluctuates greatly within the region compared to the entire time period, and the overall level is not very high, which needs to be improved. From 2003 to 2007, the overall efficiency of Henan Province decreased due to the underdeveloped agricultural economy at that time. However, after 2011, it entered the second stage of rapid economic development and the implementation of environmental protection work, resulting in a significant acceleration of the efficiency value of agricultural grey water footprint in Henan Province. This is closely related to the decrease in fertilizer application in Henan Province after 2011. As shown in Table 3, from the relative changes in agricultural grey water footprint efficiency in various cities, it can be seen that some regions have good agricultural development conditions, slow growth in grey water footprint efficiency, and large development space. Luoyang, Luohe, Sanmenxia, and Xinyang have experienced significant growth, with Sanmenxia City showing the largest growth rate. The grey water footprint efficiency increased from 0.03 CNY/m3 in 2001 to 0.42 CNY/m in 2021, a 14 fold increase. From the perspective of the average utilization efficiency of agricultural grey water footprint in different regions over the past four years, the four cities with the highest average grey water footprint efficiency values are Luoyang, Hebi, Luohe, and Sanmenxia. The average agricultural grey water footprint in these regions is higher than 0.10, with the highest efficiency value in Sanmenxia, where the grey water footprint efficiency reached 0.18 during these four years. The city with the lowest efficiency value is Zhoukou, with an efficiency value of 0.06. Based on Figure 6, the spatial distribution of agricultural grey water footprint efficiency in various cities shows that the grey water footprint efficiency is generally higher in the central region of Henan Province, such as Luohe City and Xuchang City. Compared with the southeastern region, the efficiency is lower. With the passage of time, the grey water footprint efficiency shows an increasing trend from the central and eastern regions to the central and southern regions. Overall, the efficiency of The utilization rate of phosphorus fertilizer in Henan Province is low, and the amount of loss is large. The regional agricultural grey water footprint in Henan Province from 2001 to 2021 can be divided into three stages, with each stage showing an inverted \"√\" shape of first increasing and then decreasing. It reached its peak in 2012 and continued to decline thereafter. As time goes by, the number of moderately and severely polluted areas in Henan Province first increases and then decreases, and the agricultural grey water footprint in the south is generally higher than that in the north.",
    "5.2 The efficiency of agricultural grey water footprint in Henan Province was relatively flat before 2012, but has sharply increased since 2012. The grey water footprint efficiency is generally higher in the central region of Henan Province, such as Luohe City and Xuchang City. Compared with the southeastern region, the efficiency is lower. With the passage of time, the grey water footprint efficiency shows an increasing trend from the central and eastern regions to the central and southern regions."
]