[
    "Carbon emission is further intensified as urbanization and industrialization continue to accelerate. China has maintained its rapid economic development and urbanization in the last 2 decades. The development of the construction industry has not only consumed a large number of energy sources but also resulted in significant carbon emissions, causing some environmental damage. Recognizing the major influencing factors of carbon emissions in the construction industry has become a research hotspot to alleviate environmental pollution caused by the construction industry and meet industrial demands for energy saving and emission reduction. In this study, the factors that influence annual carbon emissions of different building types in China from 2011 to 2018 were decomposed by Logarithmic Mean Divisia Index (LMDI) through a case study in Henan Province. The major influencing factors of carbon emissions have been identified. Results demonstrate that the per capita carbon emission in the construction industry in Henan Province remains high from 2011 to 2018, but it decreases year by year. Carbon emissions from the construction industry in Henan Province increase due to economic development and energy structure. Energy efficiency can inhibit carbon emissions from the construction industry in Henan Province. The obtained conclusions have a positive effect on analyzing annual variations in carbon emissions from the construction industry in a region, identifying influencing factors, and proposing specific countermeasures of energy saving and emission reduction. Greenhouse gases produced by human activities cause global climatic changes and threaten the survival environment of people in the world. With the acceleration of the urbaniza- tion process and improving the living standards of people, building energy consumption in China presents a rigid growth trend. The construction industry is characteristic of high energy consumption, high carbon emissions and low energy efficiency. The huge energy waste and CO2 emission problems become increasingly prominent with the rapid development of the construction industry. The construction industry accounts for a high proportion in Chinese industries with high energy consumption. Energy saving and emission reduction of the construction industry play an important role in the national economic operation and regional environmen- tal protection. China has assumed the top position around the world in terms of building material consumption and new building areas. CO2 emissions from the energy consumption for production activities in the construction industry and mass use of building materials have caused serious adverse impacts on the ecological environment. The Green and low-carbon development of the construction industry must be promoted. a great growth space. On one hand, industrial technologies continuously develop, and industrial efficiency consistently increases with the continuous progress in industrialization and urbanization in China. The carbon emission caused by industrial production gradually declines, which increases the proportion of consumptive carbon emissions indirectly, such as construction-induced carbon emissions. On the other hand, urban size continues to expand, and the consumption level of residents continuously increases in China, leading to the continuous growth in the energy consumption needs of residents. This situation can directly increase the proportion of construction-induced carbon emissions. The construction industry is the traditional dominant industry and pillar industry of richening and strengthening of Henan Province. Recently, the total output of the construc- tion industry and gross domestic product (GDP) in Henan Province have been increasing year by year (Fig. 1 ). The total output of the construction industry in Henan Province was 527.936 billion yuan (RMB) in 2011 and 1312.255 billion yuan (RMB) in 2020, showing an annual average growth rate of 16.51%. However, the construction industry in Henan Province encounters a development bottleneck. Given the highlighted problems of traditional backward construction structure, the necessity of industrial structural optimization, the inadequate activity of market subjects, and insufficient policy guarantee, comprehensive industrial transformation and updating based on the development philosophy of “innovation, coordination, green, opening, and sharing” must be promoted. It is suggested to change the production mode of the construction industry, renew the project organization, accelerate the transformation from scale expansion to quality benefit improvement, cross from low-middle ends to middle-high ends in the industrial chain, increase the overall competitiveness of the construction industry in Henan Province, decrease carbon emissions from the construction industry comprehensively, and realize the coordinated development of construction industry and regional economy in the province. Nevertheless, energy con- sumption and greenhouse gas emissions of the construction industry in Henan Province are continuously increasing with the construction economic development, which influences the energy saving and emission reduction to a certain extent. Accordingly, Henan Province must devote itself to the devel- opment of green buildings, promote sustainable development of the construction industry, and decrease carbon emissions from the construction industry. The key influencing factors of carbon emissions from the construction industry must be determined, and specific countermeasures of energy saving and emission reduction must be proposed.",
    "The threats of global warming to human beings are wide- ly known. Governments across the world have reached a consensus to build a low-carbon economy. The question of how can the construction industry realize low carbonization and recognize influencing factors of carbon emissions from the construction industry has become a research hotspot as carbon emission reduction attracts increasing attention. bon emissions from the construction industry are available. These studies mainly decompose influencing factors through econometric model, index decomposition analysis (IDA), structural decomposition analysis (SDA), and logarithmic mean Divisia index. With respect to estimation of carbon emissions from the construction industry and influencing factors, Zhang et al. decomposed the influences on carbon emissions from the construction industry in Beijing by LMDI. The results demonstrated that changes in economic activities, population size, and per capita energy consumption stimulated emissions, while energy intensity, urban–rural population distribution structure, and changes in production and household energy structures decrease emissions (Zhang et al. 2013). Jiang et al. introduced a development ETS monitoring framework in Shenzhen and several challenges and policy choices (Jiang et al. 2014). Kang et al. believed that buildings emit a large amount of CO2 within the service life, which is an important factor that causes the greenhouse effect (Kang et al. 2015). Sattary et al. demonstrated that construction-induced carbon emissions of the whole building system (floors, walls and roofs) can be decreased by 65% by using the principle of biological climate (Sattary et al. 2016). Jiang found that the energy intensity of residents, per capita housing area, and the total number of households are major driving factors that influence carbon emissions from the construction industry in China (Jiang 2016). Huang et al. developed the calculation method of urban building carbon footprints based on Xiamen City. Results demonstrate that urban building carbon footprints in Xiamen City increased from 8.95 million tons in 2005 to 13.57 million tons in 2009, showing an annual average growth rate of 12.87%. Produc- tion of building materials and carbon emission produced by building energy source account for 45% and 40% of building series and trans-regions. Therefore, a case study based on Henan Province was carried out. The influencing factors of carbon emissions from the construction industry in Henan Province from 2011 to 2018 were decomposed by classical LMDI to provide energy saving and emission reduction measures for the construction industry and decrease car- bon emissions from the construction industry in Henan Province. from 2004 to 2013. The results showed that the total emis- sions of China’s building industry presented an upward trend, and emissions in the building production stage were highest (Zhang et al. 2017). Huang et al. explored and compared the CO2 emission levels caused by global construction activities by using the world environmental input-output sheet in 2009 and found that CO2 emission of the global construction industry accounted for 23% of the total CO2 emissions of global economic activities. China is the biggest contributor Henan Province. to carbon emissions from the construction industry (Huang et al. 2018). Li et al. studied the annual carbon emissions of construction land in Shanghai and its disconnection degrees LMDI Model with economic growth driven by six factors (Li et al. 2019). Lai et al. discussed relations of carbon emission intensity with carbon emissions from the construction industry, energy consumption, and GDP growth rate in China and its trend by using the improved Kaya model. The results showed that carbon emissions from the construction industry were mainly influenced by the GDP growth of the construction scale. Energy consumption was the major driving source to carbon emission growth (Lai et al. 2019). Zhang et al. pro- posed the China building construction model based on the LCA and discussed energy consumption and carbon emission trends of China’s building construction industry from 2000 to 2016. He found that construction scale, building structural type, and material production efficiency are three important driving factors (Zhang et al. 2019). Han et al. pointed out that the urban employment rate influenced the carbon emission intensity of the construction industry in China the most, and per capita consumption influenced the least (Han et al. 2019). Hao et al. reported that BIM is an effective method to measure carbon emissions of new building construction and prefabrication decreases carbon emission compared with the traditional construction method (Hao et al. 2020). Zhang et al. further decomposed the CO2 emission connections of the global construction industry by using the multi-region input-output model and hypothesis extraction method. He C A found that the CO2 emissions of the global construction i P industry mainly come from the secondary industry and transportation industry (Zhang et al. 2020). Based on the literature review, we conclude that existing studies on the (A) mainly come from Si, Fi, I, and R. follows: influencing factors of carbon emissions from the construction The influencing factors of carbon emissions from the con- struction industry are decomposed into Eq. (1) based on the Kaya model: where C denotes carbon emissions from the construction industry, Ci represents the carbon emissions of the ith ener- gy source in the construction industry, E is the total energy consumption of the construction industry, Ei is the consump- tion of the ith energy source in the construction industry, Y is GDP, and P denotes the total population at the end of a year. According to existing research results, Si = Ei/E was defined as the energy structure, which refers to the proportion of the ith energy source in the total energy consumption of the construction industry. Fi = C/Ei is defined as the energy intensity, which refers to the carbon emissions from the con- struction industry by per unit consumption of the ith energy source. I = E/Y is defined as energy efficiency, which refers to the total energy consumption of the construction industry per unit GDP. R = Y/P is defined as economic development. Hence, Eq. (1) can be rewritten as Eq. (2).",
    "…(2) Eq. (2) shows that the changes of per capita carbon C S FIR A S FIR i i i , emissions from the construction industry (A) mainly come i i i (A) mainly come from Si, Fi, I, and R. P , A i i i S F I R rsd D D D D D D i i i i S F I R t i i i S F I R i energy intensities, ∆AI and DI are energy efficiencies, ∆AR t t t t 0 0 0 0 i i A i S F I R S F I R A A A A A S F I R rsd D D D D D D 0 A D D D D D D i i i i S F I R t t t t 0 0 0 0 S F I R rsd t 0 i t S F I R S F I R A A A A A A A t and DR are economic developments, and ∆Arsd and Drsd refer S F I R rsd 0 A A i i i i S F I R D D D D D D D D D D D D i i D D D D D D t A S F I R rsd S F I R rsd 0 0 to decomposition margins. In Eq. (3), ∆AS, ∆AF, ∆AI, and A S F I R rsd A 0 A t D D D D D D A S F I R rsd 0 D D D D D D A ∆AR express contributions of different factors to per capita S F I R 0 A D carbon emissions from the construction industry. In Eq. ∆AF, ∆AI, and ∆AR ∆AF, ∆AI, and ∆AR (4), DS, DF, DI, and DR are contribution rates of different ∆AF, ∆AI, and ∆AR Data Specification ∆AF, ∆AI, and ∆AR Data Specification ∆AF, ∆AI, and ∆AR factors to changes of per capita carbon emissions from the ∆AF, ∆AI, and ∆AR ∆AF, ∆AI, and ∆AR ∆AF, ∆AI, and ∆AR construction industry. This study continued to use the LMDI proposed by Ang et al. (1998) for residue-free decomposition in Eqs. (3) and (4). Hence, ∆Arsd = 0, and Drsd=1. According to this method, different factors can be further decomposed as follows: The estimation method of construction-induced carbon emissions in Henan Province is based on the method of construction-induced carbon emissions. In this study, the mature emission factor method, which is widely used and has a consensus in the industry, was applied to estimate carbon emissions in the building field. Construction-induced carbon emissions are the sum of CO2 emissions from different fossil energies that are consumed directly (coal, oil, and natural gas) and indirectly (power and thermal power) in the running process of buildings. The calculation formula is as follows: where BCE refers to carbon emissions from the construction industry in Henan Province, BE; refers to consumptions of the ith energy source in the operation of the construction industry in Henan Province, and EF; refers to the carbon emission factor of the i” energy source of the construction industry in Henan Province. Carbon emission factors of fossil energy sources are shown in the General Rules for Comprehensive Energy Consumption Calculation (GB/T2589-2008). Data of consumptions of various energy sources in the construction industry of Henan Province were collected from the Regional Energy Sheet of Henan Province in history, while the rest of the data were collected from China’s National Statistical Database (https://data.stats.gov.cn/). The investigation period was from 2011 to 2018. The carbon emission factor decompositions of the construc- tion industry in Henan Province from 2011 to 2018 are listed in Table 1, according to Eqs. (1)-(7). dustry in Henan Province maintained at a high level from 2011 to 2018. As a result of the policy adjustment for the construction industry in Henan Province, the financial subsidies facilitate green technological innovation and strengthen the green research and development vitality of construction enterprises. Consequently, many green innovation technologies are developed under environ- mental regulation stimuli, promoting green construction and applications of environmentally friendly materials. Henan Province advanced construction technologies, expedited the development of environmentally friendly building materials and exploration of new energy sourc- es, and decreased dependence on traditional high-carbon building materials and energy sources. These measures could optimize construction products from the design end and decrease the use of building materials, thus min- imizing carbon emissions from the construction industry and increasing carbon emission efficiency. Meanwhile, Henan Province strengthened its promotion of advanced assembly technologies, factorized line production, and safe intelligent equipment. The province strengthened resource integration in the construction industry, real- location of waste resources, and reproduction in the province, thus decreasing carbon emissions from the construction industry and increasing carbon emission efficiency. Accordingly, per capita carbon emissions in the construction industry decreased year by year, and the residential environment was improved.",
    "the residence demands in urban and rural areas; thus, Henan Province has the ability and motivation to build large infrastructures and promote the construction of public service projects, which will also release high CO2 contents. Carbon emissions from the construction industry will increase with the promotion of economic development. Hence, economic coordinated develop- ment must be achieved while decreasing the growth of carbon emissions from the construction industry. The basic idea lies in the high-quality economic development and driving energy-saving environmental protection needs of the construction industry. and relieving environmental pollution. Meanwhile, this notion proves that the energy saving and emission reduction have achieved a certain degree of success. High energy consumption and emission have become the most typical features of the construction industry. Given that the driving contribution of energy intensity effect with the decreased carbon emission intensity of the construction industry in Henan Province still accounts for a low propor- tion, high-efficiency inhibition of energy intensity effect of construction has become an effective solution to high energy consumption problems. Therefore, energy utilization must be effectively enhanced by using energy sources wisely, and energy wastes during the construction process must be reduced. Henan Province has to strengthen technological innovations of the construction industry. The current energy structure is mainly comprised of coal and petroleum. Coal is critical to the industrialization of the construction indus- try. Energy utilization and recycling (e.g., coals) must be practically enhanced to strengthen uses and innovations in the deculturation of coals, clean coals, and energy recycling technologies. Substitutive energy sources shall be developed because the combustion of fossil fuels is an important cause of high emissions. Accordingly, low-carbon technologies may be used to improve production equipment and processes. A new substitutive material must be developed while mini- Henan Province increased the proportion of low-carbon energy sources in the building field. Henan Province inves- tigated the potentials of renewable energy sources, such as photovoltaic, wind power, thermal pump, and biomass, by combining them with local features. This initiative supports building photovoltaic integrated building projects in qualified urban areas, such as Zhengzhou. Buildings have become a significant carrier for photovoltaic development, and photo- voltaic utilization on the external surfaces of buildings has emerged as an important index to evaluate green buildings. Henan Province supports the construction of zero-carbon buildings and zero-carbon community demonstration pro- jects to promote self-sufficiency of building energies. Some recommendations are as follows: 1) lower carbon emission from local power plants; 2) optimize heating energy structure, support innovations in electric heating technology, construct renewable energy coupling heating projects, and encourage buildings in qualified regions to replace electrification heat- ing; 3) fully use residual heat resources in industrial data center and improve intelligent heating level; 4) cooperate with renewable power use, optimize the intelligent power supply network, support energy storage technological de- velopment, and encourage qualified construction projects to build energy storage projects; and 5) change consumption mode positively, increase the low-carbon environmental protection consciousness, decrease use and purchase rate of high-carbon products, increase uses of energy-saving low-carbon products, such as high-efficiency energy-saving lights, new energy electric cars, and solar energy, and further optimize the market supply structure and energy consumption structure. Low-carbon transformation must be encouraged in the construction field, and the green building standards must continuously increase. Moreover, the energy-saving level of building envelopes must be increased, buildings with ultra-low energy consumptions must be constructed, and reduction of carbon emissions through energy saving must be promoted. Existing buildings must continue the imple- mentation of energy-saving reconstruction and effectively decrease carbon emission intensity per unit area. Qualified large public buildings must be investigated for inclusion in the carbon transaction market, and carbon emission reduc- tion must be promoted by market means. The power grid structure of buildings can be optimized by cooperating with relocation and old community reconstruction activities, and a foundation for electric heating and natural gas heating must be established. Heating measurement of buildings must be continually promoted, and units and families must be advised with regard to the reasonable and appropriate use of thermal power. Lastly, waste and lower carbon emissions from ultra-temperature heating must be effectively reduced. The government should strengthen education training of carbon emission reduction to residents to encourage all people to participate in carbon emission reduction in the building field, develop the green life habit of energy-saving and carbon-reduction, and promote the whole society to form a good atmosphere in which everyone is responsible for carbon emission reduction. In addition, the government can encourage building enterprises to use new energy-saving and recycling building materials and support building material manufacturers to implement green production and relevant application technological reconstruction. Meanwhile, the government shall strengthen the recycling of solid wastes in the building industry. The rapid development of engineering construction continuously increases construction waste pro- duction. Processing and recycling of construction wastes are also effective tasks in achieving energy saving and emission reduction. Hence, a construction waste recycling technology must be developed, production technologies and techniques of enterprises for renewable building materials must be strengthened, enterprises must be encouraged to develop green building material technologies, equipment with high energy efficiency in recycling construction solid waste must be created. Finally, and further promote green energy-saving development of the construction industry in Henan Province.",
    "emission reduction consciousness of building enterprises. Future studies can measure the influencing degrees of factors related to construction-induced carbon emissions, enrich the full-lifecycle carbon emission estimation models of the construction industry, and deepen scenario prediction and analysis on carbon emissions from the construction industry."
]