[
    "and a new carrier to promote the integrated development of the primary, secondary and tertiary industries. Specialized villages are a field that has received widespread attention in academic circles in recent years, and they play an important role in promoting the economic development of rural areas. This paper comprehensively uses buffer analysis, kernel density estimation, spatial autocorrelation analysis, Ripley's K function and other methods to describe the spatial distribution characteristics of specialized villages in Henan province, identify the influencing factors of the spatial differentiation of specialized villages, and reveal the spatial distribution of specialized villages. The results show that: (1) The distribution density of specialized villages in Henan province is 0.2784/km2, which shows the characteristics of \"more in the north and less in the south, gathering in the north and scattered in the south\". (2) The core density of specialized villages at the district and county scale in Henan province is worth the Moran index of 0.128, showing the characteristics of spatial agglomeration. With the progress of social economy, especially the rapid development of urban economy, agricultural areas are becoming increasingly marginalized [1]. This has attracted the attention and thinking of many scholars at home and abroad, and this tradition of attaching importance to agricultural areas is undergoing profound changes. The marginalization of rural life is also one of the keynotes of the current development of rural areas [2]. The research on the development of western agricultural geography shows that, along with the changes in the way of thinking of western human geography, the research perspective of agricultural geography has also changed accordingly. Agricultural area control and other perspectives [3]. has been transformed into the contradiction between the people's ever-growing needs for a better life and unbalanced and inadequate development, which is most prominently reflected in the countryside. The village areas has become an important micro-spatial unit of concern in the field of economic geography recently. It is not only a base for sustainable development, an ideal experimental field for implementing national policies, but also an important way to coordinate urban and rural development. The study of village areas has attracted the attention of many scholars. . In the study of village economy, specialized villages is an important development pattern. Taking the leading industry as the carrier, rural development can be divided into agriculture-led, industry-led, business and travel service, and balanced development [4] This paper takes 668 specialized villages in 2018 as the research object, integrating landforms, water systems, transportation, etc. Multi-source data, comprehensive use of buffer analysis, nuclear density analysis, spatial autocorrelation analysis, Riple's K function analysis and other research methods, to develop the distribution law and influencing factors of specialized villages in Henan province, and to comprehensively promote the implementation of the national strategy of rural revitalization, as well as the national land Spatial planning and rural governance provide theoretical reference and Regarding the concept of a specialized villages, Qiao Jiajun analyzed the concept of a specialized villages from three aspects: industry and product standards, income standards and organizational forms [5], and preliminarily concluded three theorems for the formation and development of specialized villages: (1) The entrepreneurial spirit of farmers has Whether there is a specialized villages or not determines whether it exists or not. It is those core peasant households with entrepreneurial spirit who, through the innovation of traditional agricultural activities, promote the emergence of new economic activities, and bring about the leading peasant households in the formation of specialized villages. (2)The location, resource endowment and historical tradition of the villages determine the type of specialized villages. In the formation and development of specialized villages, the village environment is directly or indirectly affected by geographical factors, and entrepreneurship is also the result of the long- term effect of geographical factors [6]. (3) The number and scale of specialized villages are determined by regional policies, markets and other environments [7]. Rural revitalization and affluent life are fundamental. Implementing the rural revitalization strategy, continuously expanding the channels for farmers to increase their income, comprehensively improving rural production and living conditions, and promoting social fairness and justice are conducive to improving farmers' well-being, enabling hundreds of millions of farmers to embark on the path of common prosperity, and bringing together the greatness of building a powerful modern socialist country. strength. The evolution of the village system usually goes through a \"life cycle\" process of formation, development, stabilization, decline, revitalization or decline. The formation and evolution of villages are jointly influenced by natural environment elements (topography, landform, soil, climate, hydrology, vegetation, etc.) and human, social and economic elements (population, economy, war, urbanization, etc.) [8].",
    "Hongxing [9], etc., and then it has been widely used in many fields such as geography, economy, society, ecology and so on. Interface refers to the interface between two different systems. Geographers regard different spatial systems as research objects, and then propose the spatial interface theory, which aims to reveal the exchange law of matter, energy and information in adjacent areas in geographic space. Qiao Jiajun et al. believed that there are often the following four effects at the spatial interface: edge effect, skin effect, additive effect and scale effect, which make the study of spatial interface have important theoretical and practical significance, and can not only enrich and develop related theories of geography , and can also guide local economic development. After a long period of development, the spatial interface theory has been applied in human geography such as rural community site selection [10], county economy [10], urban-rural differences [12], and specialized village agglomeration [13]. Henan province is a major agricultural province and an important grain-producing area in China. Most of the areas are located on the North China Plain. The area of arable land accounts for 48.92% of the total area of the provinces, which is much higher than the national average (17.28%). According to the seventh census data in 2021, the proportion of rural population in Henan province is 44.57%, which is higher than the national average (36.11%). Henan has abundant arable land resources and labor resources. Specialized villages and towns are hot spots in the country or in the Yellow River basin, and have always been one of the key areas that rural scholars have paid attention to. Buffer analysis is one of the most basic spatial analysis methods in geostatistical methods. Its basic principle is to build a certain number and width of buffer zones around it based on specific map elements such as points, lines, and areas, so that vector elements can be expanded in two- dimensional space, and combined with the overlay analysis of target elements to reveal The mechanism of action between different geographical elements [14]. In this study, the buffer analysis tool was used in ArcGIS software to set buffer distances for river and road elements to establish buffer zones with different buffer distances, and to form polygonal entities of different levels of river and road buffer zones. The degree of villages on the buffer belt under different buffer distances is obtained, and the spatial distribution law of Chinese villages under different river and road levels is quantitatively revealed. Kernel Density Estimation is a spatial analysis method for nonparametric estimation of unknown density functions based on the research object itself. Compared with traditional point density estimation methods, kernel density estimation results have higher continuity [15]. Calculated as follows: density at the evaluation point x; k represents the kernel function; x-xi represents the distance from the evaluation point to xi, h is the bandwidth, and n is the number of points within the bandwidth. In this paper, the kernel density estimation tool of the ArcGIS platform is used to measure the kernel density of specialized villages at the Henan provincial scale, and to describe the spatial distribution characteristics of specialized villages in Henan. Spatial autocorrelation analysis is a spatial statistical method that reflects the spatial correlation degree of natural or social elements through spatial autocorrelation index and reveals its spatial distribution law [16]. The calculation formula is: In the formula: n is the number of villages under different administrative division levels; S2 is the variance of the core density values of villages in different administrative division levels; xi and xj are the core density values of villages in administrative districts i and j, respectively wij is the spatial weight matrix, and the inverse distance weight standard is used in this paper. Moran's I value range is [-1, 1], greater than 0 is positive correlation, less than 0 is negative correlation, equal to 0 means random distribution. Ripley's K Function, also known as multi-distance spatial clustering analysis, is a tool used to analyze the spatial pattern of multi-scale point elements, and its statistics can reveal specific patterns of point element distribution at different spatial observation scales [17] ].Calculated as follows: Under the assumption of random distribution, the expected value of L(d) is equal to 0; when L(d)>0, it means that the village presents a clustered distribution trend; when L(d)<0, it means that the village presents a scattered distribution. In this paper, the Ripley's K function analysis is carried out on the point elements of specialized villages in Henan province, and the spatial distribution characteristics of villages at different spatial scales are obtained.",
    "The data used in this paper include vector data such as 668 specialized villages sites in Henan province, boundaries of administrative units in Henan province, river systems and traffic network. Among them, the location of specialized villages comes from the Rural Affairs Office of Henan province, the administrative boundary data of counties and districts in Henan province comes from the standard map service website of the National Bureau of Surveying, Mapping and Geographic Information, and the water system and traffic data come from the National Earth System Science Data Center. By constructing buffer zones of different scales and using statistical tools, the spatial distribution characteristics of point-like elements in specialized villages around rivers and roads are obtained. spatial distribution of specialized villages in Henan province shows a clear pattern of regional differentiation, and the distribution pattern of core-periphery equipment obvious.The density of specialized villages in the province is 0.2784/km2, of which Wenxian, Weidong District, Yima City and Suiyang District have the highest density, 2.6578/10,000 km2, 1.9398/10,000km2, 1.3632/km2, 1.2822/km2. The average density of specialized villages in Henan province is 0.3016/10,000 km2. Among the 668 specialized villages in the province, 60 exceed the average, accounting for 8.98% of the total. These villages are concentrated in eastern Henan, central Henan, Zhengluojiao and northern Henan. And southwestern Henan and other places. is The Moran index (Moran'sI) was used in the GeoDa software platform to conduct global spatial autocorrelation of the village core density values of the district and county administrative divisions in Henan province. Figure 2 shows the Moran scatter plot of the specialized villages core density values. The quadrant (high-high type clustering) and the third quadrant (low-low type clustering) indicate that the density values of specialized villages are positively correlated, the second quadrant (low-high type abnormality) and the fourth quadrant (low-high type abnormality) indicates that the core density values of specialized villages are negatively correlated. From the Moran index scatter plot, it can be seen that most of the scatter points are distributed in the first and third quadrants, and the density of specialized villages at the county scale in Henan province is worth Moran index of 0.128, P=0.009 < 0.01, Z=2.7340 > 2.58, the results are compared with the comparison scale, and the following results can be obtained: 1. The Moran index is a positive number, which means that the data has a positive spatial correlation. Rivers are a key element in the formation of settlements. In an agricultural society, dense villages can often form around large watersheds. In addition to being related to the production structure, the flow of population and materials in the region brought about by convenient shipping conditions is also an important factor affecting the formation and distribution of specialties. In this paper, 20-level buffer zones are analyzed at equal intervals of 500 m for rivers of different grades to form a buffer vector entity, and the distribution density of villages in buffers of different rivers is calculated accordingly. It can be seen from Figure 7 that as the buffer radius increases, the density of villages gradually decreases, and the villages change significantly within the 2km buffer zone. In order to analyze the distribution of villages around the river in more detail, this paper also established a buffer entity with 20 buffer zones of 100m and equal spacing of 2km in total, forming a village density curve.The agglomeration degree of villages is high within 100m-500m from the river, and then the density of villages decreases gradually with the increase of buffer distance. As the saying goes, “if you want to get rich, build roads first”. Roads are an important factor in determining a region's external relations, affecting population flow, material flow and information transmission. During the formation and development of villages, areas with superior transportation locations have gradually become the distribution centers of regional social resources, which are more conducive to population aggregation and villages redistribution [17]. In this paper, 20-level buffer zones with equal spacing of 500m and 100m were established respectively. Within the 500m equally spaced buffer zone, the density of villages around the main highways in Henan province is higher than that of the villages around the railways under the buffer radius of 0~6km. As the buffer zone increases, the density of surrounding villages is slowly increasing. Within the 100m equally spaced buffer zone, the density of villages is as follows: in the range of 0 to 500m, with the increase of buffer zone, the density of villages around main highways decreases, while the density of villages around main railways keeps increasing. In the range of 500~2000m, with the increase of the buffer zone, the density around the main road or the main railway tends to be stable.",
    "This paper comprehensively uses buffer analysis, kernel density estimation, spatial autocorrelation analysis, Ripley's K function and other model methods to quantitatively describe the spatial distribution law and agglomeration characteristics of specialized villages in Henan province, and deeply analyze the factors affecting the spatial distribution of specialized villages. The average density of specialized villages in Henan province is 0.2784/km2, and the spatial distribution characteristics of villages under different physical and geographical divisions are obvious. (1) The specialized villages in Henan province show the agglomeration of eastern Henan, western Henan and northern Henan. Among them, there are many specialized villages branches in the urban belt of Zhengluojiao in western Henan. The areas mentioned above are divided along the Beijing- Guangzhou and Longhai lines. department. The density of specialized villages in northern Henan is higher than that in southern Henan. (2) The Moran'sI of the core density value of specialized villages at the district and county scale in Henan province is 0.128, and the agglomeration characteristics are obvious. Riple's K function shows that specialized villages still maintain a high degree of agglomeration within a larger spatial observation scale. (3) The agglomeration degree of villages decreases with the increase of the distance from the river, and the agglomeration degree is the highest in the range of 0-500m from the river; the density of Huanye villages around different types of roads is as follows: in the range of 0-350m, main roads > main railways. Cities and villages are an organism and a community with a shared future [18]. As a social reality, the development of specialized villages is a multidisciplinary process involving geography, economics, management, sociology, etc. This discipline requires the participation, attention and discussion of many scholars and experts with different knowledge backgrounds. The agglomeration of specialized villages is a complex dynamic process, which involves farmers, villages, specialized organizations, enterprises, governments and other subjects, affected by natural resources, geographical location, government policies, institutional culture, economic foundation, technical conditions, etc. The formation and evolution mechanism are intricate due to the action of many factors [18]. The discussion of its mechanism is helpful to clarify the context of the development of specialized villages agglomeration, and guide it to develop in a healthy and sustainable direction, which has important theoretical significance and high practical value."
]