[
    "REVIEWED BY Ruochong Xu, Tsinghua University, China Sheng Yin Chen, Clemson University, United States Lulu Chen, George Washington University, United States 1School of Horticulture and Landscape Architecture, Henan Institute of Science and Technology, Xinxiang, China, 2Landscape Ecological Engineering Technology Research Center of Xinxiang, Xinxiang, China Zhou K, Wei X, Wang Y, Wang J, Wang Z and Zhang Y (2025) Spatiotemporal evolution and prediction of blue–green–grey-space carbon stocks in Henan Province, China. Front. Environ. Sci. 13:1545455. doi: 10.3389/fenvs.2025.1545455 © 2025 Zhou, Wei, Wang, Wang, Wang and Zhang. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. capabilities of ecosystems, which is crucial for maintaining the carbon balance of regional ecosystems.By combining the Integrated Valuation of Ecosystem Services and Trade-offs (InVEST) model with the Patch-generating Land Use Simulation (PLUS) model, this study evaluates the spatiotemporal evolution of blue–green–grey spatial carbon stocks in Henan Province, China, and predicts the relationship between blue–green–grey spatial changes and carbon stocks under four future scenarios. This total amount of carbon stocks decreased by 39.75 × 106 Mg from 2000 to 2020. The pattern of carbon-storage spatial distribution is characterised by ‘higher in the west and lower in the east’. The urbanisation process in Henan Province has been accelerating, and the area of grey space has increased rapidly, resulting in a substantial decline in carbon storage. Grey-space development will be severely constrained under the ecological protection (EP) scenario by 2050, where the grey-space area will decrease by 33.15% compared to that in 2020. Under the cultivated-land protection (CLP) scenario, the growth of the green space will increase considerably and carbon storage will reach the highest level. This paper offers a solid scientiﬁc foundationfor promoting low-carbon andgreen developmentas well as optimising the spatial arrangement of Henan Province, China. Increased greenhouse gas emissions cause global warming, leading to degradation of ecosystem services, which detrimentally affects human livelihood and terrestrial ecosystem health (Bellard et al., 2022; Li et al., 2022). A close relationship exists between carbon stocks in terrestrial ecosystems and the global climate crisis; in particular, terrestrial ecosystems can reduce warming and carbon climate feedbacks by absorbing and ﬁxing atmospheric carbon dioxide (Yang et al., 2022). An important factor contributing to changes in ecosystem carbon stocks is land use and cover change (LUCC). LUCC modiﬁes soil carbon stocks by reintroducing plant leftovers into soil and thereby modiﬁes the soil environment, which affects carbon stocks in regional vegetation. Thus, LUCC alters the structure and function of regional ecosystems, which can eventually lead to the enhancement of territorial carbon stocks capacity or trigger regional carbon exertion, thereby further affecting global climate change (Li et al., 2022; Zheng and Zheng, 2023). Terrestrial ecosystems, as the second largest reservoir of carbon in the global carbon-stock system, have attracted extensive research attention with respect to global carbon-related changes (Li et al., 2023a). China’s economy has improved rapidly in recent decades, which has indirectly resulted in an increase in urbanisation from 17.92% in 1978 to 65.22% in 2022 (Liu J. Y. et al., 2023). Rapid urbanisation has caused substantial LUCC, which has resulted in disappearance of a large amount of agricultural lands, wetlands and forests as well as rapid degradation of ecosystem functions (Wang et al., 2021a). In the process of rapid urbanisation in China, high-intensity land development and utilisation pose a major threat to the current territorial carbon stocks (Zhao et al., 2013; Han et al., 2021). Currently, more than 120 countries and regions have set carbon neutrality targets and formulated corresponding low-carbon development strategies (Chen et al., 2022). As one of the world’s largest developing countries and carbon emitters, China is under immense global pressure to reduce carbon emissions (Shi et al., 2023). The Chinese government has pledged to achieve an 85%–90% carbon-emission reduction target by 2060. Therefore, China’s high- quality development activities must comply with green and low- carbon development concepts, implement high-quality development concepts, promote the ‘dual-carbon’ strategy and increase carbon storage. In advocating the implementation of the ecological civilisation strategy, territorial spatial planning has continuously strengthened the strategy of constructing a pattern of ecological spatial development and protection (Zou et al., 2021a). This indicates that China’s planning focus has changed from urban expansion to co-evolution with ecological environment changes (Lei et al., 2024). The rationalisation of urban spatial layout, enhancement of carbon stocks in terrestrial ecosystems and reduction of carbon emissions have also become key issues for social development (Stankovic et al., 2021).",
    "relationship between LUCC and ecosystem carbon storage. Currently, the sample and inventory method (Robinson et al., 2023), ﬁeld investigations and model simulations (Sun et al., 2023) are used to appraise carbon stocks in terrestrial ecosystems. The 3S (remote sensing, geographical information system and global positioning system) technology is being increasingly perfected; moreover, remote sensing combined with correlation models is increasingly applied for carbon-storage estimation (Li et al., 2023b). Compared with other assessment methods, combining remote sensing technology is suitable for study areas of any size and can dynamically reﬂect changes in carbon storage. Researchers typically have used methods such as CASA, DNDC, FORCCHN and LPJ-GUESS (Yue et al., 2023). Compared with the above models, the Integrated Valuation of Ecosystem Services and Trade-offs (InVEST) model has lower data requirements, more convenient operation, higher ﬂexibility in parameter adjustment and higher accuracy; therefore, it is usually used to evaluate the quality of the ecological environment (Thompson, 2018). Simulated LUCC models include the CA- Mark model, Patch-generating Land Use Simulation (PLUS) model and Future Land-Use Simulation (FLUS) model, which can be used in combination with the InVEST model and are often used to simulate ecosystem carbon stocks in various scenarios. The combination of the CA-Mark and InVEST models has been used to simulate and predict LUCC from 1980 to 2050 and how this change will affect carbon storage in coastal areas (Zhu et al., 2022). Furthermore, the FLUS and InVEST models were used to forecast the pattern and change of ecosystem carbon stocks in Guilin in 2035 in natural development, economic priority, ecological priority and sustainable development scenarios (He et al., 2023). data blocks, which can effectively mine the drivers of all types of LUCCs and simulate variations in the number of patches for various land-use types (Liang et al., 2021). This model includes the Land Expansion Analysis Strategy (LEAS) module and the cellular automata module based on multi-type random patch seeds (CARS) module. The LEAS module extracts and samples the LUCC expansion between two LUCC phases. Subsequently, based on the random forest algorithm, the development probability of various land-use types and the contribution rate of driving elements are mined and obtained. The CARS module combines random seed generation with the threshold decreasing mechanism to simulate the automatic generation of land-use-type patches under the constraint of the expansion probability. The PLUS model simulates patch changes of various land categories, which can help reliably deal with the problem of the low accuracy of simulated land types in a large study area. The PLUS and InVEST models have been used to explore the relationship between LUCC and carbon stocks in Guizhou Province in multiple scenarios over the past 20 years and to analyse the vulnerability of these carbon stocks (Du et al., 2023). In related research, most scholars’ research on carbon storage focuses on the carbon density of LUCCbased on the ﬁrst level LUCC types divided by scientiﬁc schools. This classiﬁcation method simpliﬁes LUCC types, and only a few scholars have used more reﬁned classiﬁcations of LUCC types and carbon density for the study of such carbon storage (Wang et al., 2022; Gong et al., 2023). most populous provinces in China; moreover, with population growth, the construction land area in this province has expanded drastically, causing huge energy consumption. Moreover, the considerable land demand in this province has resulted in drastic LUCC, which has considerably affected the green and sustainable development and the carbon stocks in terrestrial ecosystems of the province. Henan Province plays a major role in the ecological protection (EP) of the Yellow River Basin (YRB). The important geographical location of Henan Province is critical for balancing regional carbon sources and sinks and promoting low-carbon land use management and development (Fan et al., 2023). Studying the carbon reduction path in Henan Province not only has practical signiﬁcance for ensuring national food and energy security, but also provides a theoretical paradigm for achieving high-quality development in resource-based regions in central and western China. Carbon emissions in Henan are projected to peak between 2031 and 2043 in several scenarios (Fang et al., 2019). Although the loss of carbon stock in Henan is large, only few studies have assessed carbon storage in this province. Moreover, for this province, most studies have mainly focused on typical and single ecosystems such as forests and few studies have investigated the changes in ecosystem carbon storage in large areas (Wang et al., 2017, Wang et al., 2018). Furthermore, the calculation of carbon storage is based on the area of land use and the carbon density of different land use types, and the carbon density of different land use types varies greatly. A more reﬁned division of land use type carbon density can more accurately estimate the carbon storage of the study area. Carbon stock studies have been conducted on the entire Henan Province and some areas of Henan Province. Previous studies have mainly considered six land-use types: cropland, woodland, grassland, watershed, construction land and unused land. Furthermore, Henan Province is vast and associated with a multitude of land-use types; summarising these land-use types into six types is not sufﬁciently accurate for carbon stock estimation (Fan et al., 2023; Wang et al., 2024). This study divides land types into 13 types based on the second level criteria, and calculates the carbon storage of the 13 land use types. Given the signiﬁcant value of constructing a blue-green grey spatial system in national spatial planning. Then summarize these 13 land use types into green, blue, and grey spaces, and calculate the carbon storage of green, blue, and grey spaces. Consequently, for Henan Province, a systematic analysis of the associated blue–green–grey spatial distribution changes and carbon stock response from 2000 to 2050 is crucial for revealing the spatial and temporal shifts in carbon stocks. The results of such analysis would allow planning the regional arrangement of Henan Province to increase carbon storage in terrestrial ecosystems.",
    "Henan Province is situated in the central and eastern parts of China in the middle and lower reaches of the Yellow River in the southern part of the North China Plain. Henan is also the only province in China that spans the Yangtze River, Huai River, Yellow River and Haihe River, with basin areas of 2.72, 8.83, 3.62 and 15,300 km2, respectively. The province occupies 1.67 × 105 km2, which is 1.73% of China’s total area. The province includes 17 prefectural-level cities; moreover, a county-level city falls under the authority of this province (Figure 1). The province is made up of plains, hills and mountains, which make up 55.7%, 26.6% and 17.7% of its total area, respectively. The majority of Henan Province experiences the warm temperate zone’s transition from the northern subtropics to the continental monsoon climate. The province’s average annual precipitation is 533.4–1,095.8 mm, with average temperature variations from north to south lying within 13.3°C–15.7°C. Henan Province is situated between the coastal open area and the central and western areas and in the middle region of China’s economic development from east to west. Henan Province is an important location for agricultural production (the cultivated-land area of this province is > 7.33 × 104 km2, ranking third in the country) and features crucial deposits of mineral resources. Henan Province is an important integrated transportation hub as well as a centre for people, logistics and information ﬂows in China. Henan Province is also the core area of the main national strategy of ‘Ecological Protection and High- quality Development of the YRB’. system of the CAS (6 ﬁrst-level classiﬁcations and 25 second- level classiﬁcations) and the speciﬁc needs of the present study, land-use types were classiﬁed into 13 types: paddy ﬁeld, dry land, woodland, shrub, open woodland, other woodland, high-coverage grassland, med-coverage grassland, low-coverage grassland, construction land, water and other unused land and marshland. Based on the LUCC classiﬁcation system reported by Suligowski et al. (2021), these 13 categories of land uses were classiﬁed into blue–green–grey spaces. Digital elevation model (DEM) data were provided by the Geospatial Data Cloud Platform, and aspect and slope data were processed from the DEM data using the ArcGIS 10.2 software. Population and GDP data were provided by the Resource and Environment Research Center of the CAS. Road data, government location data and water system data were obtained from Open-Street Map. The aforementioned data were uniﬁed into raster data with a spatial resolution of 300 m with the same projection and the same number of rows and columns using ArcGIS 10.2. This data uniﬁcation were performed for subsequent projection conversion, re-sampling and Euclidean distance calculations (Figure 2). Precipitation and temperature data were sourced from the National Tibetan Plateau Data Center platform. Data used herein are detailed in Table 1. The land use data for Henan Province for 2000, 2010 and 2020 were sourced from Landsat satellite images provided by the data platform of the Center for Resource and Environmental Studies of the Chinese Academy of The InVEST model includes the Carbon Storages and Sequestration module, which simpliﬁes the calculation and transfer of carbon storage (Xu et al., 2023). Equations 1, 2 are the formulas for calculating carbon stocks in the InVEST model. The carbon density data of different land use types were divided into aboveground, underground, soil organic and dead organic biomass. dead organic biomass, these data were not considered for the research region (Zhu et al., 2022). The total carbon storage in Henan Province was estimated by combining the LUCC data with the corresponding carbon pool density according to the following formula: respectively, and the corresponding average temperatures were 14.93°C and 14.15°C, respectively. The correction formula is as follows (Equations 3–9) (Giardina and Ryan, 2000; Litton et al., 2007; Alam et al., 2013): where Cm is the carbon density pertaining to the land use type m, Cm_above is the aboveground carbon density pertaining to the land use type m, Cm_below is the underground carbon density pertaining to the land use type m, Cm_soil is the soil organic carbon density pertaining to the land use type m, Cm_dead is the dead organic biomass pertaining to the land use type m, Ctotal is the total carbon storage; Si is the area of the ith land-use type, and n is the number of land-use types established in the study.",
    "Carbon density varies with many factors, such as climate, soil properties and land use, thus exhibiting notable regional differences. Only few relevant studies have been conducted on the blue–green–grey spaces in Henan Province based on the secondary land use types; therefore, this study uses research areas with similar climate and geographical locations as the calculation basis for selecting carbon density data (Chuai et al., 2011; He and Sun, 2016; Xue, 2017; Li, 2021; Zou et al., 2021b; Li et al., 2023c; Wu et al., 2023a; Xu et al., 2023; Yue et al., 2023; Zhang et al., 2023). Precipitation and air temperature considerably affect the carbon density in a region; therefore, the average annual precipitation and average annual air temperature were used to correct the carbon density to the conditions of Henan Province. The corrected carbon density values for all land-use types are listed in Table 2 (Raich and Nadelhoffer, 1989). The average precipitation in Henan Province and the entire country in 2000–2020 was 796.30 and 1,003.74 mm, where CSP is the density of soil organic carbon (Mg/hm2) adjusted using the precipitation factor; CBP and CBT are the biomass carbon densities (Mg/hm2) adjusted using the precipitation and temperature factors, respectively; MAP represents annual precipitation (mm); MAT stands for annual temperature (°C); KBP is corrected precipitation factor for biomass carbon density; KBT is corrected temperature factor for biomass carbon density; KB is the correction coefﬁcient for biomass carbon density; KS is the correction coefﬁcient for soil organic carbon density and C′ and C´´ are carbon densities in Henan Province and China, respectively. probability distribution of land suitability using the random forest technique, spatial allocation based on the adaptive inertia mechanism and accuracy validation (Wu and Wang, 2023b). used to classify the LUCC types and simulate changes in the blue–green–grey spaces. LUCC data for Henan Province for 2000 and 2010 were used to predict the province’s LUCC data for 2020 by combining 14 factors such as topography, socio- economy and spatial accessibility. The simulation ﬁndings were compared using the Kappa coefﬁcient and overall accuracy (OA) with the authentic LUCC data for 2020. With a Kappa precision of 82.39% and an OA of 88.62%, the PLUS model seemed to be able to simulate LUCC in the study area with reasonable precision. The LEAS module of the PLUS model was used to extract the land expansion data of Henan Province in 2010 and 2020. Subsequently, the random forest algorithm was employed to predict the probability of expansion for each land-use type and the contribution of each driving elements to the expansion of all land types. Markov chains were utilised to forecast the requirement of all land types of Henan Province. The CARS module wasused to simulate the land use status of Henan Province under four scenarios for 2030 and 2050 using water as a limiting factor. The scenarios set in this study were mainly based on the historical land-use patterns of Henan Province and the territorial spatial arrangement of Henan Province (2021–2035). This planning document clearly points out that it is necessary to stabilise the base amount of cultivated land, conserve diversiﬁed ecological space, optimise the spatial layout of cities and towns and promote the coordinated development of cities and towns. Based on this development perspectives, four scenarios were established. Land use in 2030 and 2050 was simulated considering the following scenarios: the transformation of farmland to other land types is restricted by designating areas that were cultivated land in 2000, 2010 and 2020 as restricted protection zones. The conversion of paddy ﬁelds and dry land to construction land is found to decrease by 20%. Furthermore, the conversion of construction land to paddy ﬁelds and dry land is found to increase by 10%. 2000–2020 was as follows: the overall area of green space decreased, while the areas of blue and grey spaces increased. The detailed area and proportions are speciﬁed in Table 3. In 2000–2020, Henan Province was dominated by green space, followed by grey space and blue space. In 2000–2020, the area of green space remained greater than 139.50 × 105 hm2, and its proportion remained above 84.00%. In the same period, the area of blue space was consistently below 5.00 × 105 hm2, which did not occupy more than 3.00% of the research region area. Over the last 2 decades, the area of green space in Henan Province has declined by 5.26 × 105 hm2, whereas the areas of blue and grey spaces have increased by 0.71 × 105 and 6.73 × 105 hm2, respectively. The blue–green–grey spatial distribution exhibits the highest variation (4.34%) in green space during this 20-year period.",
    "considerably changed from 2000 to 2020, particularly during 2000–2010 (Figure 3). With considerably high economic growth during this period, urbanisation advanced and the grey space area (of which construction land is the main component) increased; moreover, the growth of grey space area is primarily occurred in the central region. Zhengzhou city, the capital of Henan Province, is a relatively more developed economic region in the province. A development pattern is formed by Zhengzhou city as the centre and the grey space connected to it. From 2000 to2010, the grey space area considerably expanded, with the expansion slowing down in 2010–2020. Although overall the green space area decreased, it remained relatively stable in Sanmenxia, Luoyang and Nanyang. The mountainous areas of the Funiu Mountains, Tongbai Mountains and Dabie Mountains are connected; therefore, the development of grey space in these areas was limited. Although blue space steadily increased over time, the increase comprised only 0.40% over the 20-year period and was mainly concentrated in the Nanyang Basin. Considering the spatial carbon stocks in the province from 2000 to 2020 showed the distribution characteristics of ‘higher in the west and lower in the east’, as seen in Figure 4. Throughout the study phase, Henan Province’s high-carbon-stock areas were mostly concentrated in its mountainous northwest, western and southern regions, while its low-carbon-stock areas were mostly concentrated in its central area, which has comparatively ﬂat topography. The regions with relatively low-carbon stocks expanded in 2000–2020, with the expansion being most pronounced in the region connecting Xinxiang, Luoyang, Xuchang and other cities, with Zhengzhou as the axis. Carbon stocks in different types of spaces in Henan Province in the last 2 decades were assessed (Table 4). The amount of carbon stored in the province was 1,666.05 × 106 Mg, 1,666.69 × 106 Mg and 1,626.30 × 106 Mg in 2000, 2010 and 2020, respectively. In 2000–2020, carbon storage in Henan Province overall decreased by 2.39%. Green space, as the main contributor of carbon storage, continuously declined in area during 2000–2020, resulting in a loss of 74.22 × 106 Mg (a decrease of 4.82%) of green-space carbon storage. Simultaneously, carbon storage in the grey space increased during this period. Although its contribution to the total carbon storage ranks second (after the green space), the grey- space storage accounted for only 9.49% of the total carbon stocks of the province. The changes in carbon-storage patterns in Henan Province over the last 2 decades were investigated (Figure 5). Subtract the carbon storage data from two predetermined periods to obtain changes in carbon storage, which can be classiﬁed into three categories: signiﬁcantly reduced, basically unchanged or signiﬁcantly increased. In most areas in Henan Province, carbon storage remained basically unchanged, with considerable carbon-storage reduction mainly scattered in the core urban areas of Henan Province and its western region. The province’s western region has the majority of the zones with high carbon stock value; however, a large portion of the areas with considerably reduced carbon storage is also located in the western region. The areas with signiﬁcantly reduced carbon storage in 2000–2010 are mainly located in and around Zhengzhou city; the areas with remarkable increments in carbon stocks during this period are more dispersed but exhibit a higher concentration in the southern part of Xinyang. From 2010 to 2020, the zones with a signiﬁcant decrease in carbon stocks in the study area showed a remarkable increasing trend and these zones were mainly concentrated in parts such as Nanyang and southern Luoyang in the western region. Furthermore, the number of areas with substantially reduced carbon stocks decreased in the central zone compared with 2000–2010. Additionally, compared with the case of 2000–2010, in 2010–2020, areas with a signiﬁcant increase in carbon stocks in the entire study area showed a notable decreasing trend in quantity. Overall, the area where carbon stocks substantially decreased in the last 20 years was considerably larger than the area where carbon stocks substantially increased. The western region of Henan Province is home to most regions where carbon stocks have considerably decreased, while the zones where carbon stocks have considerably increased are primarily located in the central and eastern zones of the province. The statistics for each land use type were obtained from the data presented in Table 5 (according to the classiﬁcation criteria used in this study) and the blue–green–grey spatial distributions in Henan Province in all scenarios (Figure 6).",
    "In the ND scenario from 2030 to 2050, Henan Province’s green-space area increases and then decreases compared with its green-space area in 2020; moreover, the blue-space area increases, while the grey-space area initially decreases and subsequently increases. Under the EP scenario, the area of green space increases by 5.34%; the area of blue space ﬁrst decreases and then remains unchanged, while the area of grey space decreases by 33.15%. Under the CLP scenario, the area of green space increases to 148.40 × 105 hm2 (6.38%) while the areas of blue and grey spaces decrease, with the area of blue space decreasing by 48.96%. The reduction in the area of blue The sustained growth of green space area under CLP scenario may be related to policies such as rural construction land reclamation and Yellow River Basin farmland restoration. Furthermore, under the UD scenario, the area of green space decreases by 3.81%, while the areas of blue and grey spaces increase; moreover, the grey-space area decreases by 5.23 × 105 hm2 or 23.95%. In the 2030 ND scenario, the area of green space in Henan Province increases by 0.33 × 105 hm2 (0.02%), that of blue space increases by 0.04 × 105 hm2 (0.93%) and that of grey space decreases by 0.39 × 105 hm2 relative to those in 2020. Under the EP scenario, the areas of green space and grey space exhibit greater changes than under the ND scenario, with the green- space area increasing by 5.04% (7.03 × 105 hm2), the grey-space area decreasing by 31.23% (6.82 × 105 hm2) and the blue-space area decreasing by 5.57% (0.24 × 105 hm2). Under the CLP scenario, the change in the area of green space is the same as in the two aforementioned scenarios. Under this scenario, the green-space area increases by 5.68% (7.93 × 105 hm2), reaching a maximum of 89.01%; compared with the EP scenario, the reduction in the blue-space area is more considerable, by 37.35% (1.61 × 105 hm2), accounting for 1.63% of the area of Henan. Under the UD scenario, the area of green space decreases by 1.09 × 105 hm2 by 2030, which is greater than in the other scenarios. At the same time, the trend in the blue-space area is comparable to that under the ND scenario. The grey-space area exhibits a greater increase than under the EP and CLP scenarios; speciﬁcally, the grey-space area increases by 4.76% (1.04 × 105 hm2), reaching the maximum value among all scenarios, 13.81% of the area of Henan. Under the ND scenario in 2050, the area of green space in Henan Province decreases by 4.35 × 105 hm2 while the areas of blue and grey spaces increase by 0.47 × 105 and 3.84 × 105 hm2 (17.58%), respectively, relative to corresponding values in 2030. In the 2050-EP scenario, the area of green space in Henan Province increases by 5.34%; at the same time, the area of grey space in the EP scenario decreases by 33.15%. In the 2050 CLP scenario, the area of green space increases by 6.38%, exhibiting the largest area, 89.60% of the area of Henan; moreover, the area of blue space considerably decreases, accounting for only 1.33% of the area of Henan Province. Under the UD scenario, the decreasing trend of the area of green-space (5.32 × 105 hm2) is more pronounced and the proportion of the area of green-space to the area of the province reaches the minimum value of 81.02% compared with other scenarios; moreover, the grey-space area considerably increases, constituting 16.35% of the area of Henan Province. Thus, under this scenario, green space cannot be effectively protected. 2050 under ND, EP, CLP and UD scenarios are shown in Figure 7. Between 2030 and 2050, the changes in blue–green–grey spatial distribution in Henan Province under the ND and UD scenarios are similar to those under the EP and CLP scenarios, with the area of grey space considerably increasing. Additionally, the changes in blue–green–grey spatial layout in Henan Province are similar under the CLP and EP scenarios, with the growth of grey space being restricted and the expansion of green space being effectively protected. Henan Province under the ND, EP, CLP and UD scenarios between 2030 and 2050. Under the ND scenario, the blue–green–grey carbon storage in Henan Province increases by 42.24 × 106 Mg within the 20-year period, with the green-space carbon storage increasing by 70.68 × 106 Mg. However, the carbon storage in 2050 under this scenario is still lower by 1.34% than in 2020. Although the blue- and grey-space carbon storage both increase between 2020 and 2030, the green-space carbon storage considerably declines, resulting in a total decrease of 38.40 × 106 Mg by 2050. Under the EP scenario, the blue–green–grey carbon stock increases by 7.97 × 106 Mg in 2020–2050, with green-space carbon storage increasing by 42.26 × 106 Mg, grey-space carbon storage decreasing by 34.46 × 106Mg and blue-space carbon stock exhibiting considerable changes. Under the CLP scenario, carbon storage in green space increases, whereas carbon storage in blue and grey spaces considerably decreases. The total carbon stock reaches 1,641.39 × 106 Mg, the green-space carbon stock reaches 1,512.79 × 106 Mg. In 2020–2050, the total carbon storage increases by 15.09 × 106 Mg, green-space carbon storage increases by 48.49 × 106 Mg, blue-space carbon storage decreases by 32.37% (2.47 × 106 Mg) and grey-space carbon storage decreases by 20.04% (30.93 × 106 Mg). Under the UD scenario, the carbon stock values for blue, green and grey spaces in Henan considerably decline, particularly in 2030, with the total value of carbon storage becoming as low as 1,561.43 × 106 Mg. Under this scenario, by 2050, the total carbon storage decreases by 24.32 × 106 Mg, with green- space carbon storage decreasing by 3.43% (50.26 × 106 Mg) and grey-space carbon storage increasing by 16.42% (25.35 × 106 Mg).",
    "in blue–green–grey carbon stocks in the province, with the green- space carbon stocks decreasing by 109.08 × 106 and 118.59 × 106 Mg, respectively. At the same time, blue- and grey-space carbon storages increase in this period. Under the ND scenario, blue-space carbon storage reaches 9.00 × 106 Mg, which is higher than in the other scenarios. Under the ND and UD scenarios in 2020–2030, grey-space carbon storage increases by 28.11% (43.39 × 106 Mg) and 34.40% (53.11 × 106 Mg), respectively. The growth of grey-space carbon stock is the greatest under the UD scenario, with the value of carbon stock reaching 207.48 × 106 Mg. Under the EP scenario, the grey-space carbon stocks are the lowest (116.41 × 106 Mg), exhibiting an overall reduction of 24.59% (37.96 × 106 Mg). Under the CLP scenario, green- and blue-space carbon stocks are the highest, reaching 1,506.46 × 106 and 4.23 × 106 Mg in 2030, respectively. Under this scenario, the green-space carbon storage increases by 2.88% (42.16 × 106 Mg) and blue-space carbon storage decreases by 44.56% (3.40 × 106 Mg) in 2020–2030. remain consistent with those in 2020–2030, with the values of carbon storage reduced by 21.75 × 106 Mg (34.40 × 106 Mg in the green space) and 24.32 × 106 Mg (50.26 × 106 Mg in the green space), respectively, compared with those in 2020. Under the EP and CLP scenarios, variations in carbon stocks are similar, with the total carbon stock increasing by 7.97 × 106 and 15.09 × 106 Mg, respectively. Moreover, the decrease in carbon stock in grey space is more considerable under the EP scenario (34.46 × 106 Mg). Although the changes in total carbon storage are similar under these two scenarios, the blue-space carbon storage increases by 0.17 × 106 Mg under the EP scenario and decreases by 2.47 × 106 Mg in the CLP scenario. Overall, under the ND and UD scenarios, the total carbon stock decreases, whereas under the EP and CLP scenarios, carbon stock increases. In 2020–2050, carbon stock mostly decreases, with the UD scenario exhibiting a stronger decline than the ND scenario. The alterations in the spatial distribution of blue–green–grey- space carbon stocks in Henan Province between 2030 and 2050 for the four scenarios are shown in Figure 8. The spatial distributions of the blue, green and grey carbon stocks are generally consistent between 2030 and 2050. However, regions with high carbon stocks are primarily centralised in high-elevation mountainous regions, low value areas show little variation except for the blue space, are mainly distributed in high-urbanisation and low-elevation regions and expand outwards from Zhengzhou as the centre point. As the capital city of Henan Province, Zhengzhou has vigorously developed transportation such as aviation ports in recent years, leading to the fragmentation of arable land and forest land, weakening the continuity of carbon sinks, and reducing carbon storage. The spatial distribution of blue–green–grey-space carbon stocks in Henan Province under the ND and UD scenarios in 2030 and 2050 is similar. Under the EP and CLP scenarios, variations in the distribution of carbon stocks in the blue–green–grey space in the study area are also similar. Additionally, changes in grey space under the ND and UD scenarios are considerably greater than those under the EP and CLP scenarios. differ across the four scenarios, as shown in Figure 9. Common to the four scenarios, the signiﬁcant reduction in carbon storage will mainly be concentrated in high-altitude western mountainous areas such as Nanyang and Luoyang. Under the ND and UD scenarios, this apparent decrease in carbon stock shows a dense point-like distribution in the province, except for the concentration in areas such as Nanyang and Luoyang. Under the ND, EP and UD scenarios, a small number of considerable changes are observed in Xinyang and Kaifeng areas. In comparison with the other scenarios, the number of areas with considerably reduced carbon stocks in Henan Province under the EP scenario substantially decreased. Under the CLP scenario, regions with high carbon stocks considerably expand, particularly in the high-elevation southern and western areas such as Xinyang, Nanyang and Luoyang. Under the UD scenario, the quantity of areas with low Henan Province is dominated by green space, and the concentration of green space in high-altitude areas such as the western part of Henan Province is particularly high. The total carbon storage distribution of Henan Province presents a regional pattern of ‘high in the west and low in the east’. The blue–green–grey spatial distribution pattern of the province is consistent with its carbon-storage distribution pattern; moreover, Chang et al. (2022) has conﬁrmed that the regional carbon storage distribution pattern of this region is strongly inﬂuenced by land use. The blue–green–grey spatial distribution in Henan Province considerably changed from 2000 to 2020. The carbon-storage capacity is poor primarily in densely populated urban grey spaces. The construction of the Central Plains Urban Agglomeration, Central Plains Economic Zone and Zhengzhou Airport Economic Comprehensive Experimental Zone has driven substantial land use/cover changes in Henan Province, accelerating the transformation of green and grey spaces. The areas with considerable carbon storage reductions in Henan Province are mainly concentrated in cities and towns and other areas with high population density. The results of a study conducted by Fan et al. (2023) also indicate signiﬁcant carbon loss around urban centres, such as Zhengzhou, in Henan Province.",
    "Under the ND scenario, the trend of land transfer in Henan Province will remain for a long time, and the carbon storage in Henan Province will show an increasing trend from 2030 to 2050 (an increase of 42.24 × 106 Mg). However, overall carbon storage will decline from 2020 to 2050. Our ﬁndings differ from those of Fan et al. (2023), possibly owing to the reﬁnement of land-use carbon density in this study and differences in model simulation parameters. As urbanisation advances, grey space continues to expand while green space is compressed, leading to a decline in carbon storage. It is widely recognised that one factor contributing to this decline in regional carbon stocks is the increase in the area of land with weak carbon sequestration capacity (e.g., construction land) (Wang et al., 2021b). The results obtained in this study are consistent with these considerations, in which the increase in grey space with construction land as the main component leads to a decrease in the carbon storage value of Henan Province. The aforementioned conclusions reported by Zheng and Zheng (2023) are consistent with the conclusions of this study that the water area shrinks and the carbon sequestration loss rate decreases. Under the EP scenario, the water area shrank by 0.44% in 2050 compared with the ND scenario; moreover, carbon stocks will increase by 7.97 × 106 Mg in 2050 compared with those in 2020. The expansion of green space will leap forward, while the expansion of construction land, which is a major component of grey space, will be considerably limited. Moreover, the possibility of grey spaces being transformed into other space types will increase. This further conﬁrms that an increase in the proportion of LUCC types with high carbon storage capacity under the EP scenario reported by Li et al. (2024) will directly lead to an increase in total carbon stocks. Woodlands generally have a higher carbon sequestration capacity than arable land and store more carbon in areas with greater elevations and steeper slopes (Liu X. L. et al., 2023). In Henan Province, forests are mainly distributed in mountainous areas with high altitudes. However, future scenario simulations indicate that carbon storage under the CLP scenario surpasses that under the EP scenario. Under the CLP scenario, green space carbon storage reaches a maximum value of 1,515.70 × 106 Mg in 2050, reﬂecting an overall increase of 48.49 × 106 Mg. This may be owing to the dominance of cultivated land, accounting for 47.5% of Henan’s total area. Under cultivated land protection policies, the carbon storage of green space with paddy ﬁelds and dry land as the main components has expanded sharply, leading to decreased carbon storage under the EP scenario than under the CLP scenario. This further indicates that Henan is a province with rapid agricultural development and a strong ecosystem carbon sequestration capacity (Zhu et al., 2020). The expansion of construction land is closely linked to the social economy; the high rate of the encroachment of construction land in Shandong Province, where arable land is the dominant land type, has led to carbon consumption (Zheng and Zheng, 2023). A similar phenomenon is observed in this study. Under the UD scenario, the loss of carbon stocks in Henan Province will be higher than in other scenarios, reaching a peak, and the loss of carbon stocks is expected to decrease by 24.32 × 106 Mg between 2030 and 2050. The unprecedented expansion of grey space has severely encroached on green space, which is a major contributor to carbon storage. In particular, greenﬁeld carbon stocks decreased by 50.26 × 106 Mg. Advances in urbanisation have led to drastic changes in the land, reducing the carbon sequestration capacity of ecosystems while increasing carbon emissions. This further validates that areas with high urbanisation rates will lead to the loss of regional carbon stocks (Xiang et al., 2022). Henan Province, as a major agricultural region in China, has arable land that covers 47.5% of its area. This vast agricultural land has both socio-economic and natural attributes and serves as a crucial carbon pool. With increasing ecological awareness in China, the encroachment of grey space into green space has gradually decreased. Studying green space carbon storage can help establish a comprehensive and standardised development model, providing practical guidance for similar regions in China. For example, Shandong Province, another major agricultural region, shares a similar development pattern to that of Henan. In Shandong Province, cultivated land is the dominant land type and an important carbon sink. However, the large-scale encroachment of construction land on farmland and urbanisation has reduced regional ecological carbon storage services and led to carbon consumption (Zheng and Zheng, 2023).",
    "that the urbanisation rate should reach 72% by 2035, and the discrepancy between the supply and demand for construction land, basic farmland and ecological land will be considerably prominent by that time. The occupation of arable land, the massive shrinkage of blue–green space and the severe fragmentation of habitats have seriously affected food production and ecological security. Currently, the EP of blue and green space and the maintenance of ecological security are under increasing pressure. Thus, the development of a scientiﬁc and reasonable blue–green ecological spatial distribution pattern as well as the formulation of an active response strategy to the spatial demands of the economy, society, environment and other parties have become urgent problems in territorial planning. The vast population and low levels of urbanisation in Henan will likely continue to drive the transfer of land types in the future. To address this issue, Henan Province’s future LUCC growth and utilisation activities need to optimise the allocation of land resources and promote a harmonised growth of urbanisation, food security and ecological protection. Based on the above forecasts and the actual trends in the development of Henan Province, we suggest the following measures. areas should be implemented, emphasising the conversion of farmland to forestlands, restoration of degraded forestland areas and improvement of the stability of ecosystems. We analysed the land use changes in last 2 decades, simulated the LUCC patterns in all scenarios between 2030 and 2050 utilising the PLUS model and used the InVEST model to evaluate the blue–green–grey-space carbon stocks in Henan Province. The main conclusions are as follows."
]