[
    "1College of Water Resources, North China University of Water Resources and Electric Power, Zhengzhou, China, 2Yellow River Survey Planning and Design Institute Co., Ltd., Zhengzhou, China, 3Key Laboratory of Intensive Conservation of the Yellow River Basin, Zhengzhou, China Zhao M, Wei J, Han Y, Shi J and Wang S (2024), Water resource security evaluation and barrier analysis in Henan Province utilizing the DPSIR framework. Front. Environ. Sci. 12:1354175. doi: 10.3389/fenvs.2024.1354175 © 2024 Zhao, Wei, Han, Shi and Wang. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Water resource health is one of the necessary conditions for society to achieve sustainable development. Due to the predominant focus of most studies on relatively short time spans, with limited attention to long time series and spatial trends, this study, using various regions of Henan Province as a case study, constructs a water resource security assessment framework based on the DPSIR model encompassing Drivers (D), Pressures (P), State (S), Impact (I), and Response (R) dimensions, with a selection of 19 evaluation indicators. Based on this evaluation index system, the CRITIC-TOPSIS evaluation method is formulated by integrating the CRITIC (Criteria Importance Through Intercriteria Correlation) and TOPSIS (Technique for Order Preference by Similarity to Ideal Solution) models. This method is employed to assess the degree of water resource security in Henan Province from 2013 to 2022. And the Obstruction Degree Model is introduced to diagnose the water resource security levels in various regions of Henan Province. The assessment results indicate that over the past decade, the overall level of water resource security in various regions of Henan Province has shown an increasing trend. Irrigated area, per capita water resources, water consumption per unit of industrial value added, per acre water consumption for agricultural irrigation, the ratio of river length meeting water quality standards, groundwater supply proportion, and sewage treatment rate are identiﬁed as the primary obstacles inﬂuencing the water resource security levels in different regions of Henan Province. The research outcomes of this study can serve as theoretical foundations to enhance urban water resource security globally, In recent years, with the rapid advancement of global climate change and economic development, the issue of water resource security has drawn widespread attention. Water resources constitute the foundation for human societal survival and development, and ensuring the security of these resources is of paramount signiﬁcance for achieving sustainable development and environmental protection (Lei et al., 2021; Sun et al., 2022; Zhou et al., 2023). As the largest agricultural province in China, Henan Province plays a pivotal role in supporting grain production, ecological conservation, and the livelihoods of its people through its water resources. However, with the rapid growth of the economy and the continual increase in population, Henan Province’s water resources are facing severe challenges and pressures (Liu S. et al., 2023; Wang et al., 2023). The assessment of water resource security is a crucial step in identifying and addressing water resource issues, providing a basis for the formulation of scientiﬁcally effective management strategies and measures (Li et al., 2020). However, the majority of current research efforts are primarily focused on relatively short time spans, with limited attention given to long-term temporal sequences and spatial trends. For instance, Gong et al. (2023a) employed the entropy method to assess the water resource security in Shanxi Province for the year 2020. Chen et al (2023a) utilized the Analytic Hierarchy Process (AHP) to evaluate water resource security in Heilongjiang Province for the period from 2016 to 2020. Therefore, this study adopts the DPSIR (Driving forces-Pressures-State- Impacts-Responses) model (Shan et al., 2022; Margarita et al., 2023; Xi et al., 2023; Zhao et al., 2023), capable of reﬂecting causal relationships between indicators, to construct a comprehensive system of water security assessment indicators. The CRITIC-TOPSIS method is then employed to analyze the water resource security levels in Henan Province from 2013 to 2022. Furthermore, an obstacle degree model is introduced to identify the primary obstacles inﬂuencing the level of water resource security.",
    "When employing the DPSIR model as the analytical framework in this study, it necessitates a comprehensive consideration of the interactions among the natural environment, human activities, and policy measures (Zhao et al., 2022). Therefore, in assessing driving forces, the impacts of factors such as population growth, economic development, and urbanization on water resource security must be taken into account. When evaluating pressure factors, considerations should include the increase in water resource demand and the diffusion of water pollution, revealing the sources of pressure faced by the water resource system (Chen et al., 2022; Tesfaldet and Nideh, 2022). Assessing the state of water resources can involve aspects such as quantity, quality, and ecological functionality, aiming to gain a comprehensive understanding of the current status of water resources. In evaluating the impact of water resources on the environment, socio-economic aspects, etc., considerations should extend to ecological degradation, socio-economic losses, and other relevant factors, emphasizing the signiﬁcance of water resource security. Lastly, it is essential to consider response measures and By systematically assessing these factors, a more comprehensive understanding of the current status of water resource security in Henan Province can be achieved. Building upon this foundation, the application of the impediment degree model allows for the identiﬁcation of key obstacles inﬂuencing the level of water resource security (Yan et al., 2020; Yang and Dong, 2020; Chen and Yan, 2021). These obstacles may involve insufﬁcient water resource management, water pollution, over-extraction, ecosystem degradation, and climate change issues. For instance, the rapid economic development and urbanization processes in Henan Province have led to a substantial demand for water resources, thereby intensifying pressure on water resources (Hao et al., 2023; Li B. et al., 2023). Simultaneously, water pollution resulting from agricultural, industrial, and urbanization activities has signiﬁcantly impacted the quality and sustainable utilization of water resources (Zhang et al., 2023; Liu Y. et al., 2023). Additionally, excessive extraction of groundwater resources may lead to issues such as declining groundwater levels and reduced water volume, posing a threat to the sustainability of agricultural irrigation and people’s domestic water supply (Bera and mukhopadhyay, 2023). Through the study of the water resource security level in Henan Province, theresearch ﬁndings notonly serve as ascientiﬁc reference for the sustainable utilization and management of water resources in Henan Province but also offer effective decision support for relevant departments and policymakers. Furthermore, they provide valuable insights and guidance for other regions and countries in the assessment and management of water resource security. Water resource security is a global challenge that requires collaborative efforts from all parties to achieve sustainable utilization and protection. Through in-depth research and analysis, we can better comprehend the complexity of water resource security and implement targeted measures to address current and future water resource issues, contributing to the construction of a sustainable future. Research on water resources security assessment has made signiﬁcant progress in recent years. The following is a summary of the research progress in water resources security assessment: Firstly, researchers have widely applied various evaluation indicators and methods to comprehensively assess the status of water resources security. Zhang C. et al. (2021), for instance, conducted a comprehensive selection of indicators encompassing water quantity, water quality, water use efﬁciency, and water environmental conditions. The aim was to provide a comprehensive depiction of the water resources situation. At the same time, the use of remote sensing technology and geographic information systems has enhanced the monitoring and assessment capabilities of water resources (Chen et al., 2023). Secondly, water resources security assessment research has gradually focused on considering regional differences and spatiotemporal variations (Zhou et al., 2022). Researchers have realized that water resources security faces different challenges and issues in different regions and time scales. Zhang et al. (2021a), for instance, conducted an analysis of the water diversion area of the Yellow River in Henan Province across different time periods. Therefore, quantitative and qualitative analyses have been conducted for different regions and time periods, providing more targeted recommendations for water resources management (Lu et al., 2022). Thirdly, water resources security assessment research has been integrated with the goals of sustainable development. With the popularization of the concept of sustainable development, researchers have started to integrate water resources security assessment with factors such as ecological conservation, economic development, and social equity, proposing comprehensive water resources management schemes (Guo et al., 2023). These schemes aim to achieve sustainable utilization of water resources, ensure people’s basic water needs, and promote sustainable economic development (Cheng et al., 2023).",
    "Lastly, researchers have actively explored new research methods and techniques. For example, the application of artiﬁcial intelligence, big data analysis, and other technologies has improved the accuracy and efﬁciency of water resources security assessment (Zaghloul et al., 2023). Moreover, interdisciplinary collaboration has become an important trend in water resources security assessment research, integrating knowledge and methods from different ﬁelds to provide more comprehensive and holistic solutions for water resources management (Sinha et al., 2023). security assessment research in terms of indicators and methods, regional differences, sustainable development goals, and technological means. In the future, further research collaboration and exploration of the potential of water resources security assessment are needed to make greater contributions to achieving sustainable water resources management and ensuring water security for people. Research on water resources security optimization aims to improve the efﬁciency of water utilization and management strategies to ensure sustainable supply of water resources and maintain ecological environments. Signiﬁcant progress has been made in this ﬁeld in recent years. The following is a summary of the research progress in water resources security optimization: Firstly, researchers have actively explored methods and technologies to improve water resource utilization efﬁciency. Measures such as improving irrigation techniques, promoting water-saving devices, and optimizing water supply systems have been implemented to enhance water resource utilization efﬁciency (Castellini et al., 2022). Additionally, water resource scheduling research has been conducted using mathematical models and optimization algorithms to achieve rational allocation and distribution of water resources, improving the level of supply- demand matching (Tahiri et al., 2022). Secondly, research on water resources security optimization has increasingly emphasized the synergy between ecological environment protection and water resources management. Researchers have recognized the crucial importance of protecting and restoring aquatic ecosystems for water resources security. Jia (2017), for instance, optimized the distribution and security status assessment of water resources in Henan Province. Thirdly, research on water resources security optimization has strengthened social participation and collaboration with stakeholders. Researchers value public participation and the opinions and needs of stakeholders, introducing diverse interests in water resources management to achieve fair, just, and sustainable water resources management (Wang and Guo, 2021). Collaboration with governments, businesses, and social organizations has been fostered to jointly promote the implementation of water resources security optimization. Lastly, researchers have also focused on the impact of climate change on water resources security and actively researched response strategies. By analyzing the effects ofclimate change on water cycling and water supply, researchers have proposed adaptive regulation and risk management methods to mitigate the adverse impact of climate change on water resources security (Ren and Zhang, 2018). water resources security optimization in terms of improving water resource utilization efﬁciency, ecological environment protection, social participation, and climate change adaptation. In the future, further in-depth research and exploration of new methods and strategies are needed to achieve sustainable utilization of water resources and ensure harmonious development between human society and the ecological environment. Research on the analysis of obstacles to water resources security aims to identify and analyze various factors that affect water resources security, providing a scientiﬁc basis for effective water resources management strategies. Signiﬁcant progress has been made in this ﬁeld in recent years. The following is a summary of the research progress in the analysis of obstacles to water resources security: Firstly, researchers have extensively explored and identiﬁed various factors that inﬂuence water resources security (You et al., 2023). These factors include natural factors (such as climate change, rainfall pattern variations), human factors (such as water pollution, overexploitation), policy factors (such as water resources management policies, laws and regulations), and socio-economic factors (such as population growth, economic development). Through in-depth analysis of these factors, researchers can have a comprehensive understanding of the challenges and obstacles faced by water resources security (Chen et al., 2023). Secondly, research on the analysis of obstacles to water resources security has gradually emphasized the interrelationships and comprehensive impacts among different factors. Researchers have recognized that water resources security is a complex system with interactions and linkages among various factors (Guo and Hui, 2022). Therefore, researchers have conducted comprehensive assessments and model analyses to reveal the relationships Thirdly, research on the analysis of obstacles to water resources security pays attention to regional differences and considerations of sustainability. Water resources security faces different obstacle factors and challenges in different regions. Researchers have compared and analyzeddifferentregionstorevealtheimpactofregionaldifferenceson water resources security and provide targeted management measures and policy recommendations (Yuan et al., 2022). Furthermore, emphasis is placed on sustainability considerations, highlighting the long-term and sustainable nature of water resources management strategies to ensure the sustainable supply of water resources and the protection of the ecological environment.",
    "Lastly,researchershavealsoconductedresearchoncountermeasures, exploring methods and measures to address the obstacles to water resources security. Through the analysis of various obstacle factors, researchers have proposed corresponding countermeasures and management suggestions, such as improving water resources management policies, promoting environmental protection measures, and facilitating the application of water-saving technologies, to address and overcome obstacles to water resources security. the analysis of obstacles to water resources security in terms of factor identiﬁcation, analysis of interrelationships, regional differences, and research on countermeasures. In the future, further research and enhanced interdisciplinary collaboration are needed to provide more scientiﬁc and effective recommendations for water resources management decisions, in order to achieve sustainable water resources utilization and ensure water resources security. resources security. Firstly, researchers comprehensively understand the various factors affecting water resources security, encompassing natural, anthropogenic, policy-related, and socio-economic aspects, achieved through extensive exploration and analysis. Secondly, there is an increasing emphasis among researchers on exploring the interrelationships and integrated impacts of different factors, aiming for a better comprehension of the complexity surrounding water resources security. Furthermore, attention has been directed towards regional disparities and sustainability considerations, offering tailored management recommendations for different areas. Finally, by studying the barriers to water resources security, corresponding strategies and measures have been proposed to address and overcome the challenges faced by water resources security. In summary, these advancements in research provide crucial foundations and guidance for formulating scientiﬁcally effective strategies in water resources management. Henan Province is a province located in the central part of China, in the middle and lower reaches of the Yellow River. The province is renowned for its abundant water resources, prosperous In terms of water resources, Henan Province is situated in the Yellow River Basin, beneﬁting from rich water resources (Ma et al., 2023). The Yellow River, known as one of the mother rivers of China, provides crucial water sources for the province. Additionally, the province is home to numerous rivers and lakes, such as the Yellow River, Yangtze River, Qi River, Ying River, and the South-to-North Water Diversion Project in the southeast of Henan Province. These water sources play a vital role in supporting local agricultural irrigation, industrial water usage, and urban water supply. In terms of socio-economic development, Henan Province is one of the most populous provinces in China with a relatively high population density. The province has experienced rapid economic growth and possesses a diversiﬁed industrial structure. Agriculture serves as a signiﬁcant pillar industry in Henan Province, with major crops including rice, wheat, and cotton, as well as livestock farming. Furthermore, the province has witnessed signiﬁcant developments in sectors such as manufacturing, energy, construction materials, and logistics. Industries such as steel, automobile, electronics, and food processing demonstrate certain strengths. The provincial capital, Zhengzhou, serves as the political, economic, and transportation center, attracting substantial investments and talents. In terms of ecological environment, Henan Province boasts diverse ecological landscapes, including mountains, plains, lakes, and rivers. The province actively engages in environmental protection efforts and places emphasis on ecological restoration. Protection and governance of water resources, improvement of river water quality through enhanced monitoring and management, and promotion of energy conservation, emission reduction, and sustainable development concepts are prioritized. Additionally, the province actively promotes the development of green industries such as ecological agriculture and ecotourism. Henan Province is renowned for its abundant water resources, prosperous socio-economic development, and diverse ecological environment (An et al., 2023). Signiﬁcant progress has been made in the aspects of water resources, socio-economic development, and ecological environment, providing a solid foundation for sustainable development. In the future, Henan Province will continue to strive for a balance between economic development and environmental protection, aiming for a more sustainable development path. The regional map of Henan Province is Water resource security refers to the protection, management, and rational utilization of water resources to ensure a sustainable and reliable water supply for human society and ecosystems. The essence of water resource security encompasses several aspects: Firstly, water resource security includes the preservation of the functionality and quality of water sources. Safeguarding the ecological environment of water sources and maintaining the water quality of groundwater and surface water form the foundation for ensuring water resource security. By implementing rigorous soil and water conservation measures, environmental monitoring, and water pollution control, the health of the ecosystems in water source areas can be protected, resource security also involves balancing water supply and demand and ensuring equitable distribution. With population growth and economic development, the contradiction between water supply and demand is becoming increasingly prominent. Rational planning and management of water resources are necessary to ensure that water supply meets the basic needs of the people while balancing the requirements of economic development and ecological conservation. This requires the establishment of scientiﬁc water resource management systems, optimization of water resource allocation, and improvement of water resource utilization efﬁciency. Furthermore, water resource security also encompasses the capacity to cope with climate change and natural disasters. Climate change alters precipitation patterns and water cycles, posing new challenges to water resource security. To address extreme climate events and natural disasters, it is crucial to enhance monitoring and early warning capabilities, construct disaster prevention and control facilities, and improve emergency response and recovery capabilities. Lastly, water resource security requires strengthened international cooperation and sharing. Water resources are transboundary and shared resources, necessitating increased collaboration among countries to collectively address water resource security challenges. By promoting the establishment of international cooperation mechanisms and sharing technologies, experiences, and information, we can jointly resources, achieving global water resource security. In summary, the essence of water resource security includes the preservation of water sources, balancing supply and demand, addressing climate change and disasters, and enhancing international cooperation. Only through comprehensive management and cooperation can we ensure long-term access to safe and reliable water supplies for human society and ecosystems, enabling sustainable development.",
    "The DPSIR model framework is an analytical tool used to assess and understand the interactions between human activities and the environment (Li et al., 2012). DPSIR stands for Driving forces, Pressures, State, Impact, and Response, which are the key components of the framework. Each component represents a stage in the causal chain of environmental issues and serves as a basis for analysis and decision-making. Here’s an explanation of each component: and international cooperation aimed at mitigating or adapting to the impacts, addressing the driving forces, and reducing pressures on the environment. The DPSIR model provides a systematic framework for analyzing complex environmental issues, identifying cause-and- effect relationships, and informing decision-making processes. It helps policymakers, researchers, and stakeholders understand the interactions between human activities and the environment, enabling more effective environmental management and sustainable development. The evaluation system established in this paper is shown in Figure 2. Here is the translation of the steps for calculating weight values using the CRITIC (Criteria Importance Through Intercriteria Correlation) method: Step 1: Identify decision criteria. First, identify the set of criteria that are relevant to the decision. These criteria should be factors that can measure and evaluate the decision alternatives. Step 2: Construct the relative matrix of criteria. For the given set of criteria, construct a relative matrix of criteria. The relative matrix is used to compare the relative importance between each pair of criteria. In the relative matrix, compare each pair of criteria based on expert judgment or empirical data and assign them importance scores. Step 3: Calculate the correlation matrix of criteria. Based on the relative matrix, calculate the correlation matrix of criteria. The correlation matrix measures the relationships between criteria and reﬂects their degree of correlation. correlation matrix to compute the weight vector of criteria by solving for the eigenvector. The eigenvector represents the importance of each criterion in the overall criteria system. Step 5: Normalize the weight vector. Normalize the obtained weight vector to ensure that the weights sum up to 1. This yields the weight values for each criterion, indicating their relative importance in the decision-making process. It is important to note that the CRITIC method requires the construction of the relative matrix based on expert judgment or empirical data, and it relies on experts with domain knowledge and experience. In practical applications, various mathematical tools and techniques, such as matrix operations and eigenvalue decomposition, can be used to perform the steps of the CRITIC method. The speciﬁc calculation steps are as follows: value of some indicators may not be representative. In order to eliminate the effect of extreme value the contingency of extreme values was eliminated by a standardized transformation method. the normalization result of the index values of the nine provinces; Xj is the average value of the selected indicator; and Sj is the standard deviation of the selected index value. In the formula: rij is the correlation coefﬁcient between indicators i and j, the Pearson correlation coefﬁcient, and is the linear correlation coefﬁcient. The CRITIC-TOPSIS model is a decision analysis model based on the CRITIC and TOPSIS methods, which can be used to optimize the degree of water resource security in Henan Province. The following are the steps involved in using the CRITIC-TOPSIS model to optimize the degree of water resource security in Henan Province: By applying the CRITIC-TOPSIS model, a more comprehensive assessment of the degree of water resource security in different regions of Henan Province can be achieved. Furthermore, reasonable optimization solutions can be provided to promote sustainable utilization and management of water resources. The speciﬁc calculation formula is as follows: A group of data with sample number m and index number n are processed with the same trend, and then dimensionless data is processed according to the following formula, that is, dimensionless decision matrix Z = (Zij)nxp is obtained: the best scheme, that is, the object is relatively superior, and ﬁnally sorted according to the closeness of each object from the largest to the smallest. This paper aims to propose a scientiﬁcally sound classiﬁcation criteria for water resources security in order to assess and monitor the sustainable utilization and protection of water resources. The classiﬁcation criteria are based on three key aspects: water supply and demand, water quality issues, and water resources management systems. It employs ﬁve levels of classiﬁcation: Emergency, Critical, Alert, Monitoring, and Safe (Peng et al., 2021; Zhang et al., 2017). This classiﬁcation criteria can provide guidance for the development of targeted water resources management strategies at the national and regional levels and promote effective management and protection of water resources.",
    "These criteria can be used to guide the formulation of water resources management strategies, optimize resource allocation, and achieve sustainable utilization and protection of water resources. The classiﬁcation of safety levels is shown in Figure 3. The obstacle degree model is a model used to evaluate, quantify, and analyze the extent of the impact of obstacle factors on a speciﬁc objective or system (He et al., 2023). It is commonly used to identify and understand the degree to which various factors hinder the achievement of the objective, thereby aiding in the formulation of corresponding solutions and decisions. The model typically involves the following main steps: Through the application of the obstacle degree model, it can provide references for decision-making support and policy formulation, helping to address issues and improve effectiveness of achieving the objective. the In the equation, O; represents the obstacle degree of the i evaluation indicator. I; represents evaluation indicator. I; = 1 — X;;. The w; represents the weight of the skewness of the i the i evaluation indicator, which can be used to indicate the contribution of a single indicator to the overall objective. This study adopts the CRITIC method to calculate the weights of the criteria layer and the indicator layer in the index system. According to the calculation results, in the criteria layer, the highest weight value is assigned to “Pressure,” which is 0.302, while the lowest weight value is assigned to “Drive forces,” which is 0.124. In the indicator layer, the highest weight value is assigned to the indicator “Proportion of river length above class III water quality (I2)” in the “Impact” criteria layer, with a weight value of 0.0852. The lowest weight value is assigned to “Irrigated area (D3)” in the “Driving forces” criteria layer, with a weight value of 0.0224. In the “Pressures” criteria layer, the highest weight value is assigned to “Water use per 104 Yuan of GDP (P3),” with a weight value of 0.0743. In the “State” criteria layer, the indicator “Water consumption per mu for farmland irrigation (S3)” has the highest weight value of 0.0668, among all the indicators in this criteria layer. In the “Response” criteria layer, the indicator with the highest weight value is “Proportion of groundwater supply (R1),” with a speciﬁc weight value of 0.0721. The weight results are shown in Figure 4 and Figure 5. During the period of 2013–2014, the water resource security assessment values in various cities in Henan Province ranged from 0.164 to 0.2568, indicating a relatively low level of water resource security. This was mainly due to the weak water conservation awareness among residents during that period, and the development trend focused primarily on socio-economic construction, to some extent neglecting the security of water resources. In 2021, the water resource security assessment values in the province experienced a certain degree of decline. This was primarily due to an extremely rare heavy rainfall event in Zhengzhou City on 20 July 2021, which nearly caused a crisis at the Chang Zhuang Reservoir. The lives, property, and water resource conditions of residents in various areas suffered signiﬁcant damage, resulting in a decrease in water resource security across the region. In 2022, local governments implemented measures to improve responses to extreme weather conditions, and the damaged urban infrastructure caused by heavy rainfall was rebuilt. As a result, the water resource security level in the province greatly improved. From 2015 to 2019, the water resource security assessment values across the entire province of Henan increased to a peak of 0.567. The level of water resource security in various cities signiﬁcantly improved. This was mainly attributed to vigorous government promotion and a substantial increase in water conservation awareness among urban residents. Additionally, water resource protection measures were widely promoted. Moreover, with the rapid development of smart water management and advancements in water technology in China, the overall water resource security level in the province has been continuously enhanced. Furthermore, as China’s economy continues to improve, greater emphasis has been placed on the protection of the ecological environment, further enhancing the country’s water resource security. In summary, from 2013 to 2021, with the promotion of ecological environmental protection policies by local governments and the increased awareness of water conservation among residents, the water resource security level in Henan Province has signiﬁcantly improved. Furthermore, the experience gained from the “7·20\" heavy rainfall event has greatly enhanced China’s ability to respond to extreme weather conditions. Therefore, the overall water resource security situation in the province has gradually improved, and the disparities in water resource security among different areas have been gradually reduced. The temporal and spatial trend charts of water resource security level in Henan Province are shown in Figure 6 and Figure 7.",
    "Based on the analysis of obstacle factors, this study selected seven inﬂuential factors with higher obstacle degrees. As shown in Figure 8, the obstacle factor with the highest average degree is “The rate of reaching water quality standards for the length of river (I3)”, indicating that the water quality of rivers has several impacts on the level of water resource security. Therefore, in future development, local governments should strengthen the monitoring and management of river water quality. The obstacle degree of “Water consumption per mu for farmland irrigation (S3)” is second only to “The rate of reaching water quality standards for the length of river (I3)”, mainly because Henan Province is an agricultural province, andthe impact of the water quality ofrivers on water resource security is also signiﬁcant. The proportion of groundwater supply (R1) reﬂects the protection level of groundwater resources in different areas, so local governments should reduce the extraction and use of groundwater to improve water resource security. The indicators of GDP per capita (P1), irrigated area (D3), water use per 104 Yuan of industrial production (D2), and sewage treatment rate (R2) all indicate the impact of human activities on water resource conditions. In the process of increasing. While developing the economy, we should improve sewage treatment rates and maximize the use of water resources in ecological environmental protection. However, in previous research, Qian (2014) constructed a water resource security evaluation index system for Henan Province from three aspects: social security, economic security, and ecological security. Qian referenced the index systems used in national water resource security analyses and other water resource evaluation indices and standards, selecting seven indicators. Notably, Qian did not classify the indicators, and the number of selected indicators was relatively small. However, the chosen indicators are representative. In contrast, this study employs the DPSIR model, selecting evaluation indicators from the aspects of Drivers, Pressures, States, Impacts, and Responses. Nineteen indicators are chosen in order to comprehensively depict the water resource security evaluation index system for Henan Province. Zhang et al. (2021a) employed the Analytic Hierarchy Process to conduct a comprehensive assessment of water resource security in the Yellow River receiving area of Henan Province. In contrast, this study utilizes the CRITIC-TOPSIS method for water resource security evaluation, which is particularly suitable for addressing fuzzy problems. Additionally, the present research employs an Obstacle Degree model to diagnose primary hindering factors. The study identiﬁes sensitive indicators through a discriminant analysis of comprehensive weights, indicator values, and indicator grading criteria, aligning more closely with the actual conditions of the study area. In terms of the temporal scope, while Zhang focused solely on the water resource security situation in Henan Province for the year 2019, rendering its applicability limited, this study investigates the dynamic changes in Henan Province’s water resource security from 2013 to 2022. Furthermore, it spatially analyzes these variations, enhancing its overall applicability. In summary, comparing with the literature on the evaluation of water resource security in Henan Province, the results of this study are generally consistent with the conclusions drawn from the literature on this speciﬁc region. The evaluation ﬁndings are reasonable and reliable. In terms of sustainable management, the assessment results offer a comprehensive understanding of the water resource status, aiding in the formulation and optimization of water resource management policies. This ensures the sustainable utilization of water resources, fostering their long-term health and preservation. In addressing water crises, the assessment of water resource security enables society to gain a better understanding of the challenges and potential crises at hand. This aids in the early detection and response to issues such as water scarcity, water quality concerns, and other related environmental challenges. as guidance for infrastructure planning, ensuring the rational design and management of water resource supply in urban and rural areas. This is crucial, particularly during periods of urbanization and population growth. In terms of societal engagement, conveying the assessment results to the public enhances awareness of water resource issues, encouraging public participation and support for relevant conservation and management measures. This contributes to the establishment of a more water-conscious society. aid in identifying regions where water resources are under threat, thereby guiding environmental actions to protect aquatic ecosystems. This is crucial for the maintenance of biodiversity and ecological balance.",
    "Inthecontextofeconomicdevelopment,waterresourceassessment results play a guiding role in the sustainable development of related industries and investment decisions. Economic sectors can optimize resource utilization, reduce production costs, and enhance efﬁciency based on the assessment results. In summary, water resource security assessment research provides society with effective decision-making support, contributing to the maintenance of ecological balance, ensuring human drinking water safety, and fostering sustainable development. These functions are of paramount signiﬁcance for a healthy, stable, and sustainable society. In terms of the research can be delineated into two aspects. In the realm of advancing knowledge in water resource security diagnosis, the current study addresses previously existing gaps in the ﬁeld of water resource security assessment, offering a fresh perspective to the development of theoretical foundations. By delving into concepts associated with the sustainability of water resources, we propel the boundaries of knowledge in this domain. Concerning the optimization of the water resource security diagnosis model, researchers employed the DPSIR assessment model to construct an evaluation index system. Through the integration of diverse data sources and the application of advanced analytical techniques, the accuracy and predictability of water resource security assessment have been enhanced. promoting the judicious utilization of water resources within society. Concerning sustainable development, the synergy of theoretical exploration and practical experience in our work contributes to the advancement of sustainable utilization of water resources. This bears positive, tangible impacts on meeting the needs of current and future generations, as well as on preserving ecological equilibrium. In the domain of societal engagement, conveying assessment results to the public enhances societal awareness of water resource issues, prompting public involvement and support for pertinent conservation and management measures. This aids in cultivating a society more attuned to water resource consciousness. three key aspects. In the realm of policy formulation, the outcomes of the study furnish robust tools for governments and decision- makers, facilitating the improved crafting of water resource management policies. Our theoretical framework and models serve as guidance for the actual development of policies, One of the constraints of this study arises from limitations in the accessibility and quality of data. Water resource assessment typically When choosing evaluation indicators, it is essential that the selected indicators not only reﬂect the characteristics of various subsystems of water resources but also capture the relationship between regional economic development and the fundamental status of water resource security. The utilization of intricate evaluation models may result in an increased demand for computational resources, concurrently raising the technical requirements for users. This could potentially constrain the application of this method in resource-constrained environments. With the increasingly pronounced impact of climate change, incorporating it into water resource security assessments presents challenges. Uncertain climate change models and data may result in uncertainties in the assessment outcomes. The assessment may inadequately account for the impact of socio-economic factors on water resources, such as population growth, urbanization, and industrial development, potentially introducing biases in certain contexts. Future research efforts can focus on improving methods for data acquisition and processing, incorporating advanced technologies such as remote sensing and sensor networks. This aims to enhance the temporal and spatial resolution as well as the quality of the data. computationally efﬁcient to enhance practicality and applicability. This effort aims to ensure the adoption of the methods in a broader range of application scenarios. Future research should focus on enhancing adaptability to climate change, including better management of uncertainties and a more comprehensive consideration of changing scenarios. By comprehensively considering these limitations and future directions, advancements in the assessment methods for water resource security can be propelled. This will enable them to better serve societal needs and contribute to the objectives of sustainable development. Elevating the level of water resource security stands as a fundamental imperative for achieving societal sustainable development. This study employs the ﬁve criteria layers—Driving forces (D), Pressures (P), States (S), Impacts (I), and Responses (R)—as a point of entry to construct an assessment indicator system for the water resource security level in Henan Province. This system encompasses 5 criteria layers and 19 indicator layers. Subsequently, the CRITIC method is utilized to compute the weights of each indicator. In conjunction with the TOPSIS model, an evaluation of the water resource security level in Henan Province from 2013 to 2022 is undertaken. Introducing an obstacle degree model, the primary obstacle factors affecting the water resource security level in various regions of Henan Province in 2022 are diagnosed. This study serves as a theoretical foundation to realize world-class urban health in water resource security levels and sustainable development. The following conclusions are drawn: This study provides an indicator system and evaluation method for assessing the water resource health levels in various regions of Henan Province, offering a scientiﬁc basis for relevant decision- making and management. In future research, scholars may integrate water resource security with water quality and ecosystem health, investigating the potential threats of water body pollution to water resources and the regulatory role of ecosystems in water resources.",
    "The original contributions presented in the study are included in the article/Supplementary material, further inquiries can be directed to the corresponding author. MZ: Conceptualization, Data curation, Writing–original draft. JW: Methodology, Software, Writing–original draft. YH: Supervision, Validation, Visualization, Writing–original draft. JS: Formal Analysis, Project administration, Writing–original draft. SW: Funding acquisition, Validation, Writing–original draft. The author(s) declare ﬁnancial support was received for the research, authorship, and/or publication of this article. This research was funded by the National Natural Science Foundation of China (52009045) and Postdoctoral funding in Henan Province"
]