[
    "Abstract: This paper takes 108 counties in the county unit of Henan Province from 2005 to 2021 as the research object, selects per capita GDP data. The results show that: (1) the economic development of counties in Henan has the characteristic of \"phasing\" from 2005 to 2021, and the overall regional differences have been continuously shrinking. (2) Economic development among counties is spatially correlated. The local economic differentiation of counties forms an agglomeration hotspot area centered on the northwest and central counties of Zhengzhou-Jiyuan, and agglomeration cold-spot areas of Kaifeng-Xinyang east and south counties in Henan. (3) At the same time, it analyzes the differences of resource endowment, the improvement of transportation conditions and the regional development policy as one of the main factors causing spatial differences in the economic development of Henan counties in the study period. As a major global public health event, the COVID-19 epidemic has had a significant impact on the economic development of counties in Henan Province. The stable, sustainable and high-quality development of county economies is an important foundation for the steady construction of new urbanization[1] . In 2021, Henan Province issued the \"Outline of the Fourteenth Five-Year Plan for the National Economic and Social Development of Henan Province and the Visionary Targets for the 23rd Five-Year Plan\", which propose to thoroughly implement the \"three approaches\" of county governance, accelerate the reform and development of counties, promote the clustering of county industries, and lead the high-quality development of counties. In 2022, the People's Government of Henan Province pointed out in the document \"New Urbanization Plan of Henan Province (2021-2035)\" that promoting new urbanization construction with county towns as an important carrier and develop county economies. It can be seen that county economic development is conducive to promoting high-quality construction of new urbanization, improving the production and living convenience of urban and rural residents, and vigorously promoting rural revitalization. In the study of international regional economic development, economic development requires win-win cooperation between community governments[2]. Technological spillover is one of the most important reasons affecting the clustering of businesses[3] . Exploring innovative technology is an important factor to promote regional economic development and improve the living standard and quality of residents[4] . In different economic regions of China, by taking the per capita GDP of the Yellow River Basin, Fen River Basin, Northeast China, Beijing-Tianjin-Hebei region and Yangtze River Delta region as the object of study, the study shows that there are different degrees of spatial agglomeration, spatial autocorrelation and unbalanced economic development among counties[5-9] , the regional spatial agglomeration pattern is characterized by phases, and some of the counties with a higher level of regional economy have a certain degree of radiation-driven effect on the surrounding counties' economy. Some counties with higher regional economic level have a certain degree of radiation-driven effect on the surrounding county economies. In addition, through further detailed study and analysis of county economic development in the provinces, besides finding that the spatial agglomeration between counties in some provinces has gradually strengthened[10-11] and that there is a high degree of spatial autocorrelation[12-13] , the factors influencing the formation of spatial differences in the level and speed of county economic development and the characteristics of their manifestation are also very obvious in some individual provinces and regions[14-15] . Problems such as the impact of the COVID-19 epidemic on the economic development of counties and the destruction of the sustainability of economic development[16] need to be urgently dealt with. Henan is China's agricultural development province has the number of counties in the administrative region. It has backward agricultural production methods, rural population loss, higher agricultural production costs and farmers to increase income and other prominent problems. The \"three rural\" development advantages and disadvantages of the counties have a direct and significant impact. At the same time, the problems of low level of county industrial structure, low per capita financial income and lack of highly skilled personnel are also prominent[17], all of which to a certain extent restricts the development power of the county economy[18] , and the problems of homogeneous competition, bold expansion, and point-type fractured development that have emerged in the development of the county economy need to be solved urgently[19] . Combined with the above scholars' research, it is found that the economic development among counties faces problems such as insufficient and unbalanced, slow and inefficient development, unbalanced industrial structure, insufficient innovation, and the absence of characteristic advantageous industries. Therefore, taking 108 counties in Henan Province from 2005 to 2021 as an example, the paper uses the per capita GDP of Henan's counties as the basic data, uses CV and spatial autocorrelation models to reflect the overall characteristics of the county's economic development differentiation, and uses the hot spot analysis method to study the county Local spatial characteristics of economic development to recover from the impact of the COVID-19 epidemic as soon as possible, thereby providing certain inspiration for the sustainable and high-quality development of Henan's county economy in the future.",
    "The coefficient of variation(CV) is a statistical index that measures the degree of dispersion between values. If the CV is larger, it indicates that the relative gap between the sample values is larger, if the CV is smaller, it indicates that the sample values are converging to the average, and the relative gap becomes smaller[20] . Through the coefficient of variation of Henan county economic development to portray the trend of county economic changes, reflecting the degree of balance of county distribution characteristics, the specific formula is: In equation (1), CV is the coefficient of variation of county economic development; S is the standard deviation of county economy; X is the level of county economy; X is the mean value of county economy; n is the number of counties. The global and local spatial correlation characteristics of Henan county economies are measured by Moran's I, Getis-OrdG*i indices. The global spatial autocorrelation Moran's I index mainly describes the spatial characteristics of the attribute values of the research object in the whole region, and can measure the overall spatial correlation and difference degree characteristics of Henan county economy during the research period. The local autocorrelation Getis-OrdG*i index mainly analyzes and describes the characteristics of the local spatial heterogeneity, and identifies the \"hot zone\" and \"cold zone\" of different spatial locations of Henan county economy during the research period. The specific formula is as follows. In Eq. (1), Xi is the observation of i, Xj is the observation of j, Wij is the weight, and i and j are spatially adjacent to each other as 1 The research data are mainly in two major aspects: ① Economic data mainly obtain from the \"Henan Provincial Statistical Yearbook (2006-2022)\"; ② Spatial data mainly from the \"Atlas of Henan Province\" (2018) after scanning for high-precision alignment in ArcGIS10.2 tracking vectorization to obtain, and the administrative division adjustment of the region to merge accordingly to ensure that the data are comparable during the research period. The data were comparable during the study period. By calculating the CV of GDP per capita, it shows that the CV of Henan county economy from 2005 to 2021 is generally decreasing, the regional differences between counties are gradually narrowing, and the level of economic development and efficiency of counties are greatly and steadily improving. However, it also shows certain \"phased\" unstable characteristics, specifically manifested as follows: ①It is a period of first rise and then slow decline from 2008 to 2011. It suddenly rose in 2008, and the regional dispersion of county economic development became stronger. This was mainly due to the severe environmental impact of the world financial crisis and unstable economic development. After 2008, the coefficient began to decline, with a decline of 2.8%. The decline was relatively slow, mainly because of the Development emphasizes \"maintaining stability, protecting people's livelihood, and maintaining growth\", and some counties have also gained certain economic management authority through power expansion and reform, and economic development has gradually returned to normal. ② It is the rapid decline of period from 2012 to 2017, the coefficient value vary from 0.585 to 0.499 with the decline of 14.7% during the six-year period.It mainly because since the 18th National Congress, economic development has entered a new normal mode, the implementation of the strategy of \"Central Plains Economic Zone Planning\", accelerating the county's industrial agglomeration, and the development of economies of scale to promote the rapid development of the county's economy; ③It is the period of high-speed decline from 2018 to 2021, with the value of the coefficient changing from 0.488 to 0.398, and the decline during the four-year period reaches 18.5%, which is a shorter time span and a faster decline rate. The \"19th Party Congress\" pointed out that my country's economic development model needs to change from high-speed growth to high-quality development, and high-quality economic development has become the focus of Henan county economic development. It launched the \"Three Ups\" model of county governance to demonstrate county and city models, and based on the development of characteristic industries. Increased financial support, decentralization and empowerment have promoted the overall development of counties, and the economic differences between counties have been further narrowed , as shown in Figure 1.",
    "In order to analyze the overall agglomeration change trend of Henan county economic development, ArcGis10.2 software was used to calculate the global Moran's I index (Figure 2). The results show that the Moran'sI indexes are all greater than 0.5, and there are obvious spatial correlations in the level of county economic development in Henan Province, which indicates a strong spatial agglomeration distribution among similar counties (cities). The global Moran's I index has been changing between 0.50 and 0.61, the county economy shows significant spatial positive correlation and spatial dependence, the spatial polarization is stronger, the more economically developed counties have increased their radiation effect, and the surrounding counties have been developed, and the spatial clustering effect of county development has been strengthened. In the overall analysis, with the passage of time, broadly speaking, the fluctuations of the four time periods of change: ① From 2005 to 2008, the first stable at about 0.542 and then fell to 0.520 in 2008,it mainly due to the 2008 before, focus on accelerating the development of the Central Plains urban agglomeration and the county industry, increase financial investment, the county's economic development to maintain power Steady progress, to the outbreak of the international financial crisis in 2008, the county development momentum is reduced, the pace of economic development is reduced, the county development of slow and steady②From 2009 to 2011, in a downward trend, the impact of the international financial crisis continues to exist, the economy to \"stabilize growth, adjust the structure, maintain stability \" development, the county characteristic industry cluster is in the period of transformation and upgrading, and the economic development fluctuates greatly between counties. ③ From 2012 to 2018, the overall upward trend, since the 18th National People's Congress, accelerate the rise of the Central Plains and Henan revitalization of the \"Central Plains Economic Zone\" strategy process has accelerated significantly. During the \"Twelfth Five-Year Plan\" period, Henan actively pushed forward the reform of provincial management of counties (cities), gave more counties economic management authority, injected development momentum, increased government financial investment in medical care, transportation, education and county industrial development, enhanced the industrial support of counties and the population absorption capacity, constructed and improved the infrastructure facilities and public services in agricultural counties and impoverished counties, and encouraged the development of characteristic service industries in counties and central towns, so that the level of economic development of counties has risen step by step, and spatial aggregation between counties has been strengthened. ④From 2019 to 2021, there will be a sharp downturn and rapid decline. Since the 19th National People's Congress, it insisted on pursuing the guideline of \"quality first and efficiency first\", the pace of economic development has gradually slowed down, and county industries need to be restructured and adjusted, as well as the outbreak of the COVID-19 epidemic has severely inhibited economic development, forcing the speed and quality of economic development in counties to decrease, and the economic development between counties to speed and quality of economic development in the counties have been reduced, and the spatial agglomeration between counties has been reduced. 3.3 \"Northwest\" and \"Southeast\" split spatial distribution, the formation of the North and Central counties in the North and South of Yu, the hot spot in the cluster and the South and Southeast counties of the cold spot area In order to study the local spatial heterogeneity characteristics of Henan county economic development. The Getis-OrdG* i index was calculated on the county-level GDP data of Henan Province, and the GiZScore index of Henan's county-level GDP per capita was divided into four basic types by using the natural fracture method: hot area, sub-hot area, sub-cold area, and cold spot area (Figure 3) . The results show:from 2005 to 2021, the proportion of hotspots in Henan's county economy has been located at 11%~16% for a long time, and it is mainly concentrated in northwest Henan and central Henan counties, which is the \"center\" of Henan's county economic development, due to the remote location conditions, poor resources and weak economic foundation. The proportion of cold spot area is located in 22%~30%, mainly gathered in the \"surrounding\" counties of South Henan and East Henan. Overall, the county economic spatial pattern for a long time presents a \"center-around\" structure, the layout of the evolution process is relatively stable, with less fluctuation, fewer hot spots, lower cold spots, and a \"northwest\" and \"southeast\" split. The spatial distribution is split between \"northwest\" and \"southeast\", with fewer hotspots for county economic development, and the problem of regional imbalance exists but is gradually shrinking.",
    "In the specific stage analysis: ① From 2005 to 2010, the hot spot area in Henan decreased from 15.74% to 13.89%, the sub-hot spot area increased from 12.96 to 10.19%, the cold spot area decreased from 29.63% to 25.93%, and the sub-cold spot area increased from 22.22% to 30.56%. It can be seen that the Northwest Yu county economic development momentum is reduced by the international financial crisis environment and \"stabilization, protection, increase\" development strategy, economic development slowdown, the East and South Yu county economic development belongs to the agriculture and light industry industry model less affected by it, the economy at this time to get a better time to develop. ② From 2010 to 2015, Hotspots accounted for 16.67%, sub-hotspots accounted for 13.89%, and both performances increased. The cold spot area accounted for 21.3%, and the sub-cold spot area accounted for 28.7%, and the performance of both declined. It can be seen that the county is in an era of rapid economic growth, and the economic development momentum is sufficient. The construction of the Central Plains Economic Zone has advanced by leaps and bounds, and the development of county areas has been driven by urban radiation. The provincial government has given more support and investment to counties, which play a pillar role in carrying industry transfer and population transfer. The sub-hotspot areas in the central and northwest counties (such as Boai, Weishi, Changge) were converted into hot spots, and the cold-spot areas in the eastern counties (such as Lankao, Minquan, Changyuan) were converted into sub-cold-spot areas. The trend of counties developing toward the east is obvious. Light industry, modern agriculture, and new industries have been supported for development. Eastern counties have shown strong development momentum, and the imbalance between counties has been alleviated. ③From 2015 to 2021, the economic development of Henan Province has entered a period of cooling and deceleration. The county economy pursues high-quality development and implements the \"three ups\" county development model. The impact of public health and natural disasters such as the COVID-19 epidemic and floods on the economy has forced the county economy to develop in accordance with seeking progress while maintaining stability and steadily improving the direction of development, the number of hot spots in the central counties has decreased, the number of cold spots in the eastern counties has decreased, and the problem of unbalanced development between counties has been further reduced. The spatial difference of county economic development is the result of the combined effects of the natural environment and human conditions. Geographic resource endowment, location and transportation conditions, and regional development policies are the main factors that affect the differences in economic development among counties in Henan during the study period. In view of this, this paper mainly analyzes the causes of spatial differences and pattern evolution of Henan county economic development from 2005 to 2021 from three aspects: differences in resource endowments, improvement of transportation conditions, and regional development policies. Resource endowment is a prerequisite for county economic development. The total area of Henan Province is approximately 167,000 km2, accounting for approximately 1.74% of the country's total area. There are large differences in the distribution of resources in the counties. The coal resources in the northwest counties and the oil resources in the northeast counties are very rich, which are conducive to the development of the industrial industry in this area，the representative cities are Jiaozuo and Puyang. The western and eastern county areas have relatively developed cultural tourism resources, which are conducive to the development of the service industry, and representative cities are Luoyang and Kaifeng. The east and southwest are vast plains and basins, the land is suitable for people to live in, and the degree of land intensification is high. It is an important agricultural production base in Henan and the whole country, and the representative cities are Zhoukou and Nanyang. In addition, with the continuous development of informatization and globalization, and the advent of the era of technological innovation and information big data, the intelligent manufacturing and artificial intelligence industries in Zhengzhou county area are developing rapidly. Henan's talents and technologies gather in Zhengzhou, and its industrial manufacturing capabilities are particularly strong. It has many leading manufacturing companies in the country, such as Zhengzhou Coal Machinery's high-end hydraulic supports. These factors have led to more obvious spatial differences in Henan's county-level economic development.",
    "connecting different regions, and a major factor for the aggregation of production factors such as natural resources, human resources, and industrial resources. Various communication links inside and outside the region require a transportation network to operate, and the degree of transportation accessibility and convenience often determines the level of county economic development. The central county area with Zhengzhou as the center and radiating to the surrounding areas has the densest transportation network in Henan Province. Its transportation accessibility and convenience are in the leading position in the province. It is the railway and highway transportation hub of the province and even my country. In contrast, the geographical location of the eastern, southeastern and southwestern regions is relatively closed, the intensity of railway construction is relatively low, and the regional accessibility and convenience are relatively poor, which promotes the relatively low level of county economic development. In the future development, with the gradual improvement and completion of the \"meter-shaped\" high-speed railway centered on Zhengzhou, the convenience and advantages of transportation in northern Henan will be further highlighted, and it will also promote the continuous improvement of the economic development level of the central counties. Therefore, the degree of traffic conditions is one of the important factors affecting the spatial differences of Henan's county-level economic development. County economic development is carried out in the context of relevant national, provincial and municipal policies and strategies. Different regional development policies will bring different benefits and development opportunities to the region, which will lead to continuous changes in regional economic development differences. The \"Outline of Planning for the Comprehensive Construction of a Moderately Prosperous Society in Henan Province\" promulgated in 2003 divided the province into four economic zones: the Central Plains urban agglomeration, northern Henan, western Henan, southwestern Henan, and Huanghuai. The imbalance of development is becoming more and more obvious, and the gap between counties is becoming more and more obvious. The \"Notice on Implementing the Outline of the Overall Development Plan of the Central Plains Urban Agglomeration\" issued in 2005 provided for the urban agglomeration, including Zhengzhou, Luoyang and Kaifeng, the functional positioning, industrial layout, and major transportation infrastructure of the nine fast-growing cities near the main Zhengzhou area. Overall planning was carried out, further widening the economic gap between southern Henan and northern Henan. In 2014, the central government put forward the major requirements of \"three ups\" in county governance. In the same year, the Henan Provincial People's Government promulgated the \"Henan Province New Urbanization Plan (2014-2021)\", which is for Henan Province to become an economically strong province and various regional cities. The development of the county and the overall development layout of the province have made specific plans, and the \"2020 Henan Province New Urbanization Construction and Urban-Rural Integration Development Key Tasks\" will be issued in 2020 to give play to the county's role as a \"bridge\" hub in urban-rural integration. This paper takes the counties of Henan Province as the research object, selects the per capita GDP data of each county unit in Henan Province from 2005 to 2021, and comprehensively uses methods and models such as variation coefficients and spatial autocorrelation models to conduct a preliminary discussion on the differences in the county-level economic development of Henan Province. , and draw several basic conclusions. (1) From the analysis of time development, the differences in county-level economic development in Henan are becoming more and more significant, and the characteristics of \"phases\" are more obvious. The county-level economy has always had fluctuations in spatial autocorrelation and heterogeneity, with obvious spatial agglomeration effects and spatial dependence, and this tendency is still strengthening with the passage of time. (2) From the perspective of spatial differentiation, the level and growth rate of county-level economic development in Henan Province show obvious spatial differences, and the economy is unbalanced in space. The overall spatial difference shows a shrinking trend, and the local performance shows a trend of increasing spatial homogeneity and weakening heterogeneity. The role of spatial polarization is further enhanced, and the spatial interaction between counties is increasing. The county economy and surrounding areas are developing simultaneously. The local spatial differences between counties are constantly shrinking, and the spatial pattern of county economic development presents a \"center- around\" state. The hotspots centered on Zhengzhou-Jiyuan Henan and Northwest Henan counties radiate around Kaifeng-Xinyang, South Henan and in the cold spot areas of southeastern Henan counties, the spatial differentiation pattern of county economic development was relatively stable during the study period.",
    "(3) Among the causes of county-level economic differentiation in Henan, the utilization efficiency of reserves and natural resources, the convenience of transportation facilities, and the differences in preferential policies with regional development are one of the main factors affecting the development of county-level economic differentiation. The counties in central Henan and northwestern Henan have the above-mentioned high-quality conditions and their economic development has been steadily improving. The counties in eastern Henan and southern Henan lack advantageous conditions and develop relatively slowly. In the future, there is an urgent need to tilt the development elements required for balance. [1] Fan Y, Wang J X, Zhang X X. Ideas and Suggestions for Promoting High-Quality Development of County Economy[J]. Macroeconomic Management, 2021, (09):60-62+88. [3] Koo, J. Technology Spillovers, Agglomeration, and Regional Economic Development [J]. Journal of Planning Literature Incorporating the Cpl Journal of Planning Literature Incorporating the Cpl, Bibliographies, 2005, 20(2):99-115. [4] Yakovleva E A, Azarova N A, Titova E V. Innovation as a Vector of Regional Economic Development and a Necessary Condition for the Progress of the World Economy[J]. Asian Social Science, 2015, [5] Wu W H. Spatio-temporal evolution analysis of uneven economic development of counties in the Yellow River Basin [J]. Statistics and Decision Making, 2021, 37(21):132-135 [6] Shi L J, Liu M, Li Y P, et al. Evolution of spatio-temporal patterns and driving factors of economic disparities among counties in the Fen River Basin [J]. Geography Research, 2021, 39(10): 2361-2378. [7] Zhao D, Sun D Q, Chen Mingxing. Spatio-temporal differences and influencing factors of economic growth in Yangtze River Delta counties [J]. Economic Jingwei, 2021, 37(04):1-10. [8] Su G B, Hou M Y. Spatio-temporal characteristics and evolutionary trends of economic growth in Beijing-Tianjin-Hebei counties [J]. Statistics and Decision Making, 2021, 36(02):110-113. [9] Ren Y, Gu G F. Spatio-temporal characteristics and influencing factors of county economic differences in Northeast China [J]. Regional Research and Development, 2018, 37(04):25-31. [10] Wu W Y, Zhong K W, Xu J H. Study on the spatial and temporal evolution of economic disparities and influencing factors of counties in Guangdong Province[J]. Surveying and Mapping Science, 2021, 46(06):156-163. [11] Han Y, Zhang Y, Deng M L. Spatial and temporal jumps and influencing factors of economic disparities in Gansu province counties [J]. Regional Research and Development, 2021, 39(01):39-45. [12] Luo S S, Liu D J, Li H L. Analysis of spatio-temporal evolution of county economic efficiency in Fujian Province[J]. Jiangsu Agricultural Science, 2021, 49(17):242-247. [15] Li N, Li T B, Fang Y G, et al. Study on the evolution of spatio-temporal pattern of county economic efficiency in Jilin Province [J]. Geoscience, 2019, 39(08):1293-1301. [16] Jiang Z. Resilience of Jiangsu county economy under the impact of new crown epidemic[J]. Business and Exhibition Economics, 2022(24):119-121. [18] Guo X Y. Situation and Tasks of Henan County Economy[J]. Open Herald, 2014(02):92-95. [19] Zhou G L, Wang Q. Exploration of the path of Henan county economic development[J]. Study Forum, 2018(07):54-57. [20] Wang, G S. Coefficient of variation-a simple and useful statistical index to measure the degree of dispersion [J]. China Statistics, 2007(06):41-42."
]