[
    "How to cite this paper: Li, B. J., Li, W. Y., Ma, W. Y., & Zhang, Y. F. (2022). Analysis of Agricultural Eco-Efficiency and Influen- cing Factors in Henan Province. Journal of Geoscience and Environment Protection, 10, 78-93. Copyright © 2022 by author(s) and Scientific Research Publishing Inc. This work is licensed under the Creative Commons Attribution International License (CC BY 4.0). http://creativecommons.org/licenses/by/4.0/ Open Access In order to improve the agricultural eco-efficiency and promote the sustaina- ble development of agriculture in Henan Province, China, based on the foot- print theory, the super-efficiency SBM model is used to scientifically calculate and analyze the agricultural eco-efficiency in Henan Province. On this basis, the influencing factors of agricultural eco-efficiency in Henan Province are quantitatively analyzed by using the grey incidence analysis model. The re- sults show that unilaterally considering one of grey water footprints and carbon footprints will overestimate or underestimate the agricultural eco-efficiency of Henan Province in different degrees in different time periods, and the agricul- tural eco-efficiency obtained by comprehensively considering grey water foot- print and carbon footprint (GWCAEE) is more in line with the reality of agri- cultural development in Henan Province. In 2000-2004, GWCAEE in Henan Province was better. During 2005-2014, GWCAEE in Henan Province showed a fluctuating decline and continued to be in an inefficient state. From 2015 to 2019, GWCAEE of Henan Province gradually increased, and it became effec- tive in 2019. In recent years, GWCAEE has developed well. Through the grey incidence analysis between 12 influencing factors including endogenous fac- tors and exogenous factors and GWCAEE, it is found that the six leading factors of GWCAEE in Henan Province are agricultural structure, financial input for agriculture, number of agricultural employees, crop sown area, consumption of chemical pesticide, consumption of agricultural diesel oil. According to the above research conclusions, suggestions for improving In the past 40 years of reform and opening up, China’s agricultural economy has developed rapidly, but at the same time, it has caused a series of environmental problems. At present, 17% of greenhouse gases and 50% of CH4 in China come from the agricultural sector, and agricultural carbon emissions have become the main source of carbon emissions in China (Hu et al., 2018). Non-point source pollution caused by overuse of chemical pesticides and fertilizers has become an important source of water pollution (Ding et al., 2021). The situation of agricul- tural ecological development is very severe. Water pollution and the increase of greenhouse gas emission caused by agricultural production have become two key environmental problems. Under this background, from the perspective of win-win economic and environmental benefits, it is of great significance to im- prove agricultural eco-efficiency (AEE) in order to solve the social contradiction between agricultural production and ecological environment protection and realize the sustainable development of agriculture. Ecological efficiency (EE), also called environmental efficiency, was first pro- posed by Schaltergger & Sturm in 1990 (Desimore & Popoff, 1997), which means the ratio of increased value to increased environmental impact, and is an impor- tant indicator to measure sustainable development capability (Tian et al., 2014). Agricultural eco-efficiency is its expansion and extension in the field of agricul- ture (Wang & Zhang, 2018). At present, scholars have not unified the definition of agricultural eco-efficiency, but its connotation is to minimize the input of agricultural resources and environmental pollution on the premise of ensuring the development of agricultural economy, and advocate a development model of ecological agriculture with the concept of “high efficiency, saving resources and reducing pollution” (Cao & Zeng, 2019). At present, there are researches on agricultural eco-efficiency at home and abroad, mainly focusing on ecological ef- ficiency evaluation (Wang & Zhang, 2016; Khan & Ullah 2020; Expósito & Ve- lasco 2020), influencing factor analysis (Han, 2013; Tian & Wang, 2016; Liu & Song 2019), environmental regulation (Li et al., 2011; Chen et al., 2017) and emission reduction potential (Li et al., 2017; Zhu et al., 2018). In the existing research, when scholars use the unexpected output SBM (Slack-Based Measure ) model to evaluate agricultural eco-efficiency, there are great differences in the choice of unexpected output indicators. Among them, in the research of taking agricultural non-point source pollution as the unexpected output index, Pan and Ying (2013) measured the agricultural eco-efficiency in China from 1998 to 2009, and found that although the agricultural eco-efficiency in China showed an upward trend, the overall level was low, and the main rea- sons for the efficiency loss were excessive consumption of resources and exces- sive discharge of pollutants. Li (2014) calculated the agricultural eco-efficiency in China from 1978 to 2008, and thought that the agricultural eco-efficiency in- creased obviously during the transition period, so we should look for a break- through in the agricultural eco-efficiency revolution from the perspective of in- Wang and Lin (2021) made an empirical analysis on the spatial evolution cha- racteristics and driving factors of China’s agricultural eco-efficiency from 1990 to 2016, and found that China’s agricultural eco-efficiency obviously decreased and there were obvious regional characteristics. Fu et al. (2021) calculated the agricultural environmental efficiency of Dongting Lake, the main grain produc- ing area, and found that the agricultural environmental efficiency was relatively low under the constraint of water pollution from 1994 to 2014, and the overall growth trend was fluctuating, and the gray water footprint had high emission reduction potential. In the research of taking agricultural carbon emissions as the unexpected output, Liu et al. (2014) measured the agricultural eco-efficiency in China from 2000 to 2010, and found that the agricultural eco-efficiency has been greatly improved, while there are regional differences. Wang et al. (2020) calculated the carbon footprint of corn production by considering the carbon footprint model of straw burning in open air, and made an empirical study on the environmental efficiency of corn production in Heilongjiang Province from 2004 to 2017. It was found that the environmental efficiency of corn production after considering straw burning in open air decreased obviously, showing dif- ferent characteristics in different time periods, but the overall trend was fluctuating and declining. Tian et al., (2014) calculated the agricultural eco-efficiency in China from 2002 to 2012, and found that the agricultural eco-efficiency in the eastern region was generally higher, and the potential for carbon emission re- duction in the central region was stronger. Zhang et al. (2021) calculated the agricultural eco-efficiency of Shandong Province from 2000 to 2017 with agri- cultural carbon emissions and agricultural non-point source pollution as the unexpected output indicators, and found that the efficiency of Shandong Prov- On the whole, the existing research results are different because of the differ- ent index system and different emphasis. Some scholars have combined agricul- tural non-point source pollution with agricultural carbon emissions, and consi- dered the pollution degree caused by agricultural production relatively compre- hensively. However, there are relatively few studies on agricultural eco-efficiency from the perspective of water-carbon at present. In view of the current research situation of agricultural eco-efficiency, this paper will take narrow agriculture (planting industry) in Henan Province as the research object, from the angle of water environment and climate of agricultural production, and take the combi- nation of grey water footprint and carbon footprint as the undesired output of agricultural production, and comprehensively investigate the ecological envi- ronment efficiency of agricultural production based on the influence of agricul- tural production activities on water environment and climate warming. Then, look for the exogenous factors that affect the agricultural eco-efficiency of He- nan Province. Grey incidence models are used to explore the influence degree of each influencing factor on agricultural eco-efficiency.",
    "The rest of this paper is organized as follows: the research methods and data sources are introduced in Section 2. The agricultural eco-efficiency of Henan Province is systematically evaluated in Section 3. Grey incidence analysis of agricultural eco-efficiency and influencing factors in Henan Province is carried out in Section 4. And section 5 makes conclusions to the paper. Footprint research is one of the hot spots in the field of ecological economics and sustainable development (Fang, 2015). Footprint indicators provide a new idea and way to evaluate the resource consumption and waste discharge of agri- cultural production. According to the Water Footprint Evaluation Manual pub- lished by the International Water Footprint Network, the grey water footprint (GWF) is defined as the volume of fresh water needed to absorb and assimilate a certain pollutant load based on the natural background concentration and exist- ing water quality standards (Hoekstra et al., 2011). The footprint of agricultural grey water mainly refers to the chemical fertilizer and pesticides applied in the process of crop growth, and other elements such as nitrogen, phosphorus and potassium enter the water through runoff process, causing water pollution (Gai et al., 2010). Nitrogen fertilizer and phosphate fertilizer are mainly used in planting activi- ties in Henan Province, so nitrogen fertilizer and phosphate fertilizer are selected as water pollutants in this paper. The agricultural grey water footprint of Henan Province is the larger of grey water footprint of nitrogen fertilizer and grey water footprint of phosphate fertilizer. The calculation process mainly refers to the Water Footprint Evaluation Manual, and the specific calculation formula is as follows: In the above formulas, GWF is the footprint of agricultural grey water, pla GWF is the footprint of nitrogen fertilizer grey water, and ( )N GWF is the ( )P footprint of phosphate fertilizer grey water. ( )iL refers to the discharge load of the i pollutant (kg), Appl ( )i refers to the mass of the i chemical applied (kg), ( )iα refers to the leaching rate of pollutants, maxC refers to the highest con- centration of pollutants (mg/L) under the environmental standard of water qual- ity, and natC refers to the initial concentration of the receiving water body = (mg/L), (i N P ). In the calculation of grey water footprint, the discharge standard of various pollutants adopts the Class III water standard specified in the Environmental Quality Standard for Surface Water (GB3838-2002) (State Environmental Protection Administration and General Administration of Qual- ity Supervision, Inspection and Quarantine, 2002). The maximum discharge standard mass concentrations of nitrogen and phosphorus pollutants are 1 mg/L and 0.05 mg/L respectively, and the natural background mass concentration value is 0 mg/L. The loss rates of nitrogen fertilizer and phosphorus fertilizer are respectively 86.7% and 36% (Tong, 2019). Carbon Footprint (CF) refers to the direct and indirect greenhouse gas emissions produced by a product or a service in the whole life cycle (or geographical scope) (Liu et al., 2013), which is an index to measure the carbon emission level and can indicate the carbon emissions of different functional units. The calculation of carbon footprint plays an important role in evaluating the emission reduction potential of agricultural production and creating a low-carbon production model. According to the methods of IPCC (2007) sythesis report (IPCC, 2007) and the existing literature (Li & Zhang, 2012; Tian et al., 2015), the agricultural car- bon emissions mainly come from six aspects namely, chemical fertilizer, pesti- cide, plastic film for agriculture, diesel oil, ploughing and agricultural irrigation, which will produce carbon emissions during the use of them. The calculation formula of agricultural carbon emissions is as follows: In the above formula, E is the total amount of agricultural carbon emissions, iE is the carbon emissions of various agricultural carbon sources, iT is the consumption of agricultural energy, and i is the carbon emission coefficient of various agricultural carbon sources (Table 1). i respectively represent chemical fertilizer, chemical pesticide, plastic film for agriculture, diesel oil, ploughing and agricultural irrigation. SBM (Slack-Based Measure) model based on unexpected output was first pro- posed by Tone in 2001 (Tone, 2001). SBM model adds slack variables to the ob- jective function, which solves the slack problem of input and output in efficiency evaluation when there is unexpected output. However, for DMUs with efficiency of 1, SBM model is difficult to further distinguish the differences between effec- tive DMUs. On the basis of SBM model, Tone (2002) further defined that the super-efficiency SBM model could further compare and distinguish the efficient DMU at the front. Assuming that there are n DMUs in the super-efficiency SBM model of undesired output, each DMU has m inputs, outputs and undesired outputs, the super-efficient SBM-undesirable model is expressed as follows (Tone, 2002).",
    "In the above formula, ρ is the ecological efficiency value, j is each DMU, and jλ is the weight vector. is− , rs+ and ts − respectively represent the slack va- b riables of input, expected output and unexpected output, jx , jy and jb are the input, expected output and unexpected output variables of the j-th DMU, and ikx , iky and ikb respectively represent the input, expected output and unexpected output variables of the evaluation DMU . k 1ρ ≥ means that the DMU is completely effective, otherwise, it indicates that there is efficiency loss, and it is necessary to adjust the input and output. According to the existing research (Hou & Yao, 2018; Wang & Zhang, 2018), combined with the specific situation of agricultural production in Henan Prov- ince, the input of land, manpower, machinery, pesticides, fertilizers and other resources is taken as the input index, the gross value of agriculture, forestry, animal husbandry and fishery is taken as the expected output index, and the un- expected output index selects the agricultural grey water footprint and carbon footprint. The evaluation index system of agricultural eco-efficiency in Henan Province is shown in Table 2. Grey system theory is a systematic analysis method, first proposed by Professor Deng Julong, which can solve the problem of poor information and uncertainty. The basic idea of grey incidence analysis method is to judge whether there is a close relationship between different sequences according to the geometric simi- larity between the system behavior sequence and the system factor sequences. The more similar the geometric features of curve, the greater the correlation between the system behavior sequence and the factor sequence, and the greater the influence of the system behavior sequence by the system factor sequence, so the system factor is the main influencing factor, otherwise it is the secondary in- fluencing factor (Liu et al., 2018). In this paper, GWCAEE is set as the system behavior characteristic sequence X 0 = { x 0 ( ) 1 , x 0 ( ) 2 , , ( ) x n 0 } , and each influencing factor is set as the system factor sequence, which is denoted as, i = , where n is the length of time 1,2, , m series X i = { x i ( ) 1 , x i ( ) 2 , , ( ) x n i } and n = 20 . The specific steps are as fol- lows: 3) Finding out the absolute value sequence of the difference value between the components corresponding to the initial image of 0X and iX , and write: 4) Calculate the maximum and minimum value of ∆ i ( k ) = x ′ 0 ( k ) − ( ′ x k i ) , k = . Let 1,2, , m The basic data needed to calculate the grey water footprint, carbon footprint, and calculate the agricultural eco-efficiency by super-effiency SBM model come from Henan Statistical Yearbook and Qianzhan Network Database. The agricultural eco-efficiency of Henan Province with grey water footprint and as carbon footprint undesired output (GWAEE) , with carbon footprint as unde- sired output (CAEE) and with grey water footprint and carbon footprint as un- desired output (GWCAEE) are respectively calculated by super-efficiency SBM model. The calculation results are shown in Table 3. Vertically, there are obvious differences between agricultural eco-efficiency based on different perspectives, and the differences among them are different in different time periods. Except for the four years of 2000, 2001, 2003 and 2004, GWCAEE, GWAAEE and CAEE are all equal to 1.000, but in other years, they are different. During 2000-2019, GWAEE was less than GWCAEE, but it was greater than GWCAEE in 2019. In 2000-2009, CAEE was always less than GWCAEE, but in 2010-2019, CAEE was always greater than GWCAEE. Howev- er, in the process of agricultural production, the impacts on the environment are various, and the unexpected outputs are various. So the difference between them shows that if only a single footprint index is considered, the agricultural eco-efficiency will be underestimated or overestimated in different time periods, which will lead to the unscientific and inaccurate agricultural eco-efficiency. Horizontally, the trends of GWCAEE, GWAEE and CAEE in Henan Province in Figure 1 are basically the same. On the whole, the GWCAEE in Henan Prov- ince is generally low, except in the five years of 2000, 2001, 2003, 2004 and 2019, the GWCAEE in Henan Province is effective, and in the other 15 years, the agricultural input, output and environmental protection in Henan Province are in a non-dynamic equilibrium state. By stages, from 2000 to 2004, the agricul- tural eco-efficiency of Henan Province was good, but in 2002, due to the impact of SARS, the agricultural economy of Henan Province suffered a severe setback, and the agricultural eco-efficiency could not be effective. During 2005-2014, the agricultural eco-efficiency of Henan Province showed a fluctuating decline and remained in an inefficient state. The reason is that with the rapid development of economy and society, the opportunity cost of farmers’ farming is rising, so far- mers will inevitably choose to work in cities from a “rational” point of view, and the young and middle-aged rural labor force is constantly shifting, which leads to the continuous decline of crop planting area and the serious phenomenon of farmland abandonment and idleness. In addition, during the research period, agricultural production mostly relied on the extensive production mode of high resources and environment in exchange for agricultural economic growth, mak- ing agriculture. From 2015 to 2019, the agricultural eco-efficiency of Henan Province gradually increased, and it was effective in 2019. With the intensifica- tion of agricultural non-point source pollution, the Ministry of Agriculture and Rural Affairs launched a tough battle to control agricultural non-point source pollution in 2015, and put forward the target task of “one control, two reduc- tions and three basics” to achieve total agricultural water control, reduction of fertilizer and pesticide usage and basic resource utilization of livestock manure, straw and plastic film by 2020. During this period, various agricultural non-point source pollution control work in Henan Province achieved positive results, and in 2019, agricultural input, output and environmental protection reached a dy- namic balance.",
    "In the process of agricultural production, endogenous factors such as the sown area of crops, the application amount of pesticides and chemical fertilizers di- rectly determine the agricultural output value and ecological efficiency. Similar- ly, external social factors such as the degree of economic development and fi- nancial input will indirectly affect agricultural production and ecological effi- ciency. The specific exogenous factors are explained as follows: Take the input indicators in the evaluation system of agricultural eco-efficiency in Table 2 as endogenous factors. TPAM represents total power of agricultural machinery. CSA represents crop sown area. CCP is the consumption of chemical pesticide. CCF represents the consumption of chemical fertilizer. CADO is con- sumption of agricultural diesel oil. CAPF represents the consumption of agri- cultural plastic film. Agricultural structure (AAS): every region is constantly optimizing the agricul- tural industrial structure according to the changes of policies and overall plan- ning, thus affecting the agricultural eco-efficiency. Therefore, the ratio of output value of planting industry to output value of agriculture, forestry, animal hus- bandry and fishery is selected as the data of agricultural structure. Agricultural technological progress (ATP): Agricultural technological innova- tion can improve agricultural workers’ technical literacy, crops, soil and agricul- tural materials and other technical indicators, making agricultural production more efficient and consuming less materials. The ratio of research and develop- ment (R & D) expenditure to GDP of Henan is adopted as technological progress. Urbanization rate (UR): At present, Henan is in an accelerated period of ur- banization. The continuous improvement of urbanization will have an impact on agricultural land area, planting area and labor mobility direction. At the same time, with the improvement of urbanization rate, it will also have a positive im- pact on farmers’ awareness of green production and scientific application of chemical fertilizers and pesticides. Financial input for agriculture (FIA): To a certain extent, financial input will affect farmers’ enthusiasm for agricultural production activities, the perfection of agricultural infrastructure and the process of agricultural modernization. Be- cause there is no special financial input data, the financial support for agricul- ture is used instead, and the financial support for agriculture, forestry and water affairs expenditure accounts for the proportion of local financial expenditure. Industrialization level (IL): On the one hand, industrialization has laid the foundation for upgrading modern agriculture. On the other hand, industrializa- tion will occupy cultivated land, at the same time, it will promote the transfer of agricultural labor force, change the industrial structure, and have a certain im- pact on agricultural production. The industrialization level is expressed by the proportion of industrial added value to GDP of Henan. Taking GWCAEE in Henan Province from 2000 to 2019 as the behavioral se- quence and the influencing factors from 2000 to 2019 as the factor sequences, degree of grey incidence between GWCAEE and different influencing factors are calculated by the grey incidence model, and the results of grey incidence be- tween GWCAEE in Henan Province and 12 influencing factors under the indi- cators of endogenous factors and exogenous factors are obtained, as shown in Table 4. It can be seen from Table 4 that the results of grey incidence models between GWCAEE and various influencing factors. The rank of the degree of grey inci- dence between influencing factors and GWCAEE is as follows: agricultural structure > number of agricultural employees > crop sown area > consumption of chemical pesticide > consumption of agricultural diesel oil > financial input for agriculture > industrialization level > consumption of chemical fertilizer > consumption of agricultural plastic film > total power of agricultural machi- nery > urbanization rate > agricultural technological progress. In this paper, the influencing factors of endogenous factors and exogenous factors whose degree of grey incidence with GWCAEE is over 0.9000 are selected as the leading factors of GWCAEE in Henan province. According to the results of degree of grey incidence, endogenous factors include four dominant factors, namely number of agricultural employees, crop sown area, consumption of chemical pesticide, consumption of agricultural diesel oil. With the development of economy, young rural laborers go out to work or engage in other jobs. Old and weak laborers who stay in rural areas will replace the loss of young and strong laborers by using a large number of chemical ele- ments such as pesticides and fertilizers, thus increasing agricultural output and gaining more agricultural income. This aggravates non-point source pollution and agricultural carbon emissions, and has obvious influence on agricultural ecological benefits. Crop sown area not only determines the grain output, but also affects the agricultural eco-efficiency. On the one hand, land ploughing in agricultural production will also cause carbon emissions; on the other hand, the larger the planting area, the more inputs of chemical fertilizers, pesticides, agri- cultural films and other materials needed for agricultural production will also increase the environmental burden, which will have a greater impact on agricul- tural ecological benefits. Chemical fertilizer is the main source of agricultural carbon footprint, and the carbon emissions from chemical fertilizer account for 60% of the total agricultural carbon emissions. Meanwhile, the grey water foot- print in Henan Province mainly comes from the loss during the use of chemical fertilizer, so the double impact of chemical fertilizer on ecological environment leads to the long-term ineffectiveness of GWCAEE in Henan Province. The consumption of diesel oil can reflect the degree of agricultural mechanization. The improvement of mechanization degree can improve labor productivity and save labor cost, but the large-scale utilization of petrochemical resources will bring serious pollution to the soil and atmosphere, thus profoundly affecting the The exogenous factors include two dominant factors, namely agricultural structure and financial input for agriculture, but the agricultural structure has the most significant effect on GWCAEE, with the degree of grey incidence of 0.9727, ranking first. This shows that agricultural structure is the key to influ- ence GWCAEE in Henan Province.",
    "flects the economic development level of planting to a great extent. Economic benefit is the core purpose of agricultural production, and all agricultural pro- duction activities are carried out for this purpose. A developed agricultural economy can promote the progress of agricultural technology, promote the up- grading of mechanical power, improve the utilization efficiency of energy and machinery, renew and reduce the input of agricultural materials, and achieve the purpose of reducing pollution. Therefore, rationally adjusting the agricultural structure is the fundamental driving force to improve the efficiency of ecological agriculture. Financial support for agriculture also has a great influence on agri- cultural eco-efficiency. To a certain extent, the support of government funds will affect the enthusiasm of farmers in agricultural production activities, the im- provement of agricultural infrastructure and the process of agricultural moder- nization. After studying the agricultural eco-efficiency of Henan Province from 2000 to 2019, the following conclusions were found: unilaterally considering one of grey water footprints and carbon footprints (GWAEE or CAEE) will overestimate or underestimate the agricultural eco-efficiency of Henan Province in different time periods, and the ecological efficiency obtained by comprehensively consi- dering grey water footprint and carbon footprint (GWCAEE) is more in line with the reality of agricultural development in Henan Province. On the whole, during the research period, GWCAEE in Henan Province was not ideal, and in most years, it was in an inefficient state. From 2000 to 2004, the agricultural eco-efficiency of Henan Province was good. From 2005 to 2014, the agricultural eco-efficiency of Henan Province showed a fluctuating downward trend and was in a state of low efficiency. From 2015 to 2019, the agricultural eco-efficiency of Henan Province gradually improved, and it was effective in 2019. Through the grey incidence analysis of 12 influencing factors under endogenous and ex- ogenous indicators, it is found that the six leading factors of GWCAEE in Henan Province are agricultural structure, number of agricultural employees, crop sown area, consumption of chemical pesticide, consumption of agricultural diesel oil, financial input for agriculture. According to the above research conclusions, the countermeasures to improve the agricultural ecological efficiency in Henan 1) Adjust the agricultural structure rationally. According to the analysis re- sults of this paper, the agricultural structure has a great influence on the agri- cultural ecological efficiency. The government should make scientific and rea- sonable agricultural production plans, abandon the simple pursuit of economic benefits, and pursue the coordinated development of economy and ecology as the ultimate goal, and take the road of sustainable agricultural development. mers are the main body of agricultural production activities, it is necessary for farmers, especially older farmers, to receive multi-level and multi-form science and technology education, cultivate farmers’ awareness of ecological environ- ment protection and improve the technical level of using chemical fertilizers, pesticides and plastic films in agriculture, so as to reverse the disadvantage of low utilization rate of agricultural resources such as chemical fertilizers and pes- ticides in China. 3) Agricultural resources should be used reasonably, and environmental pro- tection supervision should be strengthened. Not only the use of agricultural chemical materials and mechanical power should be reasonably controlled, but also the investment in the treatment of agricultural pollutants and the compre- hensive treatment of rural ecological environment should be increased. At the same time, environmental safety supervision and management of pesticide and fertilizer use should be strengthened. Penalties for environmental violations should be increased, and the problems of “low illegal cost and high law-abiding cost” in the punishment of environmental violations need to be solved."
]