[
    "Abstract: A strong culture makes a strong nation. the equalization of basic public cultural services is the basis of realizing a strong culture and the key to promoting common prosperity. Based on the three dimensions of public cultural service investment, infrastructure construction and product benefit, 8 indexes were selected to evaluate the equalization level of basic public cultural services, and the time-series global principal component analysis was used to conduct a dynamic evaluation of the equalization level of basic public cultural services in 18 cities in Henan Province from 2017 to 2021. The results show that the level of equalization of basic public cultural services in Henan Province is generally on an upward trend, but varies widely among municipalities in the province. \"Common prosperity\" is the essential requirement of socialism with Chinese characteristics and the inevitable requirement of building a modern socialist country in an all- round way. In the 14th Five-Year Plan, the goal of \"achieving more obvious and substantial progress in the common prosperity of all people by 2035\" [1] is proposed, which requires accelerating the equalization of basic public services. Basic public cultural services are an important part of basic public services, an important channel for people to acquire cultural knowledge and spiritual life, and an important guarantee for the progress of social civilization and common prosperity. Therefore, evaluating and optimizing the degree of equalization of basic public cultural services is of great significance for promoting common prosperity and building a modern socialist country. In order to scientifically evaluate the degree of equalization of basic public cultural services, many scholars at home and abroad have proposed evaluation indicators of different dimensions and objectively evaluated the level of basic public cultural services by using evaluation models in a comprehensive manner. In terms of public cultural service evaluation research, most countries have studied how to evaluate the level of basic public cultural services in their own countries from their own conditions. Regarding the sources of evaluation indicators, George (2001) comprehensively assessed local cultural institutions from the perspectives of the public involved in cultural services, staff and experts in the industry field, and also applied this research method and experience to evaluate other basic public cultural services [5]. Johanson (2014) and other scholars took five local councils in the Australian region as surveyed, and found the elements of cultural evaluation from them by analyzing the contents of local meetings released about cultural planning [6]. In terms of evaluation index selection, many scholars selected two-dimensional indicators (Wang Luozhong et al. 2013 [7]; Gu Jinxi et al. 2010 [8]; Gao Weihua 2010 [9]), three-dimensional indicators (Cao Jialei et al. 2015 [10]; Yang Lin et al. 2020 [11]), and four-dimensional indicators (Shi Tao et al. 2014 [12]; Chen Xujia 2016 [2]; Peng Cheng et al. 2016 [3]) as the basis for evaluation. The main research methods selected after the establishment of the evaluation index system are principal component analysis (Zhan Guohui, 2017[4]), factor analysis (Yang Lin et al., 2020[13]; Huang Dunping et al., 2020[14]), data envelopment analysis (Zou Rong et al., 2021[15]; Zhang Canyuan et al., 2020[16]), approximating ideal solution ranking method (Liu Bei et al., 2016 [17]; Guo Yuhui et al.,2020[18]), etc. In summary, there are two main shortcomings in the existing studies. On the one hand, the construction of basic public cultural service evaluation indicators is not comprehensive. Scholars have mostly constructed the index system for the equalization of basic public cultural services from two perspectives: input and output. With the increasing improvement of public cultural service system, the construction of the index system should fully consider the relationship between supply and demand of public cultural services, and build an index system that accurately and comprehensively reflects the level of equalization of public cultural services. On the other hand, most of the existing literature uses cross-sectional data of a certain year for analysis, which cannot reflect the level of equalization of basic public cultural services in the study area dynamically. In this paper, we use panel data of basic public cultural services in 18 cities in Henan Province from 2017-2021, and apply global principal component analysis to dynamically analyze and evaluate the level of equalization of basic public cultural services in Henan Province, in order to provide a reference for improving the level of equalization of basic public cultural services in Henan Province.",
    "To evaluate the level of equalization of basic public cultural services, we need to establish a scientific and complete evaluation index system in order to analyze the degree of equalization of regional basic public cultural services. Based on the existing studies, this paper selects basic public cultural service financial investment, infrastructure construction investment, and the degree of product benefit as the three primary indicators according to the 14th Five-Year Plan for Public Services and the Implementation Standards for Basic Public Cultural Services in Henan Province, and follows the principles of feasibility, relevance, and scientificity. With reference to the definition of equalization, the financial investment in local culture per capita, the proportion of financial investment in local culture per capita to financial expenditure, the public book collection per capita, the number of libraries, cultural stations and library employees per capita, and the comprehensive population coverage rate of radio and TV were selected as eight secondary indicators. Puyang City, Hebi City, Nanyang City, Sanmenxia City, Zhumadian City, Shangqiu City, Xinyang City, and Zhoukou City), and one province-administered county-level city (Jiyuan City). The data of the constructed evaluation index system of equalization of basic public cultural services were obtained from the Henan Provincial Statistical Yearbook (20217-2021) [19], Henan Municipal Statistical Yearbooks, Henan Provincial Bureau of Statistics, Department of Culture, Henan Municipal Bureau of Statistics, and the official website of Culture, Radio, Film and Tourism Bureau. Global principal component analysis (GPCA), also known as time-series global principal component analysis, is a method that adds time series analysis to principal component analysis and uses panel data to analyze the spatio-temporal dynamics of each indicator so as to reflect the characteristic changes of the research object [20], which makes up for the defect that classical principal component analysis can only analyze cross-sectional data and adds a record of describing the global change trajectory of the system. The data of relevant indicators from 2017-2021 for 18 cities in Henan Province were arranged from smallest to largest by year to create a time-series global data table. KMO test and Bartlett's test were conducted using SPSS 26.0 to verify the validity of the data. In general, when the KMO value is less than 0.5, it is not appropriate to use the time- series global principal component analysis method. the original hypothesis of Bartlett's spherical test is that the correlation coefficient matrix is a unit matrix, i.e., the variables are independent of each other, so rejection of the original hypothesis indicates that the GPCA study can be conducted. The data results showed that the KMO sampling fitness was 0.569 (>0.5); the Bartlett's sphericity test was 0.000, therefore, this paper is valid for data analysis using time-series global principal component analysis. This paper uses 18 cities in Henan Province as the sample, including 17 prefecture-level cities (Zhengzhou City, Xinxiang City, Luoyang City, Anyang City, Jiaozuo City, Xuchang City, Pingdingshan City, Luohe City, Kaifeng City, First, SPSS software was used to calculate the initial eigenvalues of the indices and extract the sum of squares of the loadings, and the results showed that the initial eigenvalues of the first three principal components were greater than 1 and their cumulative variance contribution rate was 83.4%, indicating that the first three components were better for the interpretation of the indexes and could replace the eight data indicators. Therefore, the first three components can be selected as principal components, which are F1, F2, and F3 (see Table 3). Table 3 shows the loadings matrix of the three principal components, among which, the financial investment in local culture per capita (X1 ) and the proportion of financial investment in local culture per capita to financial expenditure (X2 ) have high loadings on the first principal component F1, reflecting the comprehensive situation of financial investment in basic public cultural services in Henan Province. The number of library employees per 10,000 people (X5 ), the number of public libraries per capita (X6 ), the comprehensive population coverage of broadcasting (X7 ), and the comprehensive population coverage of TV (X8 ) have higher loadings on the second principal component F2, reflecting the benefit of basic public cultural services to the public; the number of libraries per 10,000 people (X3 ), and the number of cultural centers and stations per 10,000 people (X4 ) have higher loadings on the third principal component F3, reflecting the supply of infrastructure in basic public cultural services.",
    "The weights were determined based on the proportion of the variance contribution of the three principal components to the total variance contribution of the principal components to obtain the comprehensive score of the evaluation of the The comprehensive scores of the eighteen cities in Henan Province for equalization of basic public cultural services and their rankings are calculated as detailed in Table 4. Overall, there is a wide gap in the evaluation scores of equalizations of basic public cultural services between regions, among which Hebi City ranks first as a comprehensive score. Sanmenxia City, Jiyuan City and Luoyang City have a high level of development of equalization of basic public cultural services. The scores of each principal component in these regions are in the middle to upper level, and the level of equalization of basic public cultural services is in the middle to upper level. Zhengzhou, Kaifeng, Xinxiang, Jiaozuo, Puyang, Xuchang, Luohe, Xinyang, Anyang, and Pingdingshan have low scores in the evaluation of equalization of basic public cultural services, and the level of equalization of basic public cultural services in these cities is relatively low. Nanyang, Shangqiu, Zhoukou and Zhumadian have the lowest scores in the evaluation of equalization of basic public cultural services. These four cities are in the eastern and southern parts of Henan Province, and the level of equalization of basic public cultural services is not high and has great room for improvement. This paper constructs an index system for the level of equalization of basic public cultural services from three dimensions: investment in public cultural services, public cultural infrastructure construction, and public cultural service products benefiting the public, and evaluates the level of equalization of basic public cultural services in 18 cities in Henan Province by using global principal component analysis. The results show that: from the global principal component composite score and dynamic ranking, the level of basic public cultural services in Henan Province shows a steady upward trend in general, but there are large differences in the level of equalization of basic public cultural services among municipalities in the province. To further enhance the current level of equalization of basic public cultural services in Henan Province, the following policy recommendations are proposed: first, give full play to the advantages of high equalization of basic public cultural services in areas such as Hebi and Sanmenxia, continue to increase financial investment and infrastructure construction, improve the beneficiary rate of basic public cultural services in Henan Province, and expand the coverage of basic public cultural service resources, while for areas such as Nanyang and Zhumadian where basic For regions with weaker public cultural services, the allocation of basic public cultural resources should be tilted to these regions, thus alleviating the uneven development of regional basic public cultural services. Second, establish a high-quality basic public cultural service system. In view of the large gap in the level of equalization of basic public cultural services among municipalities in Henan Province, a high-quality basic public cultural service system should be established at the provincial and municipal levels, allocated according to needs and measured according to quality, and for Nanyang and Zhumadian, where the level of equalization of basic public cultural services is low, it is more important to give full play to the rational deployment function of the basic public cultural service system so as to meet the people's For Nanyang and Zhumadian, where the level of equalization of basic public cultural services is low, it is more important to give full play to the function of reasonable deployment of the basic public cultural service system, so as to meet the cultural needs of the people and ensure the adequate and balanced development of basic public cultural services from the root. Finally, improve the supervision and evaluation mechanism of basic public cultural services. When the government conducts performance evaluation, some indicators can be included in the quantitative assessment category, and at the same time, the assessment indicators can be subdivided according to the specific situation of basic public cultural services in each city, so as to force each region to improve the level of basic public cultural services. Through regular surveys and analyses of people's satisfaction with the basic public cultural services in their places of residence, we can understand the real needs of the people, so as to achieve the goal of equalizing basic public cultural services in all regions of Henan Province."
]