[
    "Abstract: With the rapid development of China's economy, the problems of energy resource utilization and environmental quality deterioration have become increasingly prominent. As an important energy base in China, the energy consumption structure of Henan Province has an important impact on the energy and environment of the whole country and even the whole world. Therefore, in-depth study of the factors affecting the clean energy consumption structure in Henan Province is of great significance for promoting the sustainable development of Henan energy. This study empirically analyzed the factors affecting the structural changes of energy consumption in Henan Province from 2007 to 2021, used time series analysis to test the stationary and co-integration of the data, established a multiple linear regression model, conducted parameter estimation, hypothesis testing, diagnosis and correction, and finally determined the model. The results show that the level of economic development, energy price and scientific and technological level are the key factors affecting the change of clean energy in Henan Province, and the influence of energy price is the most significant. Based on the above conclusions, some suggestions are provided, hoping to bring enlightenment to the adjustment and optimization of energy structure in Henan Province. In the evolution process of human society, energy has always occupied a crucial position. It not only constitutes the cornerstone of economic development and provides strategic economic support for countries and regions, but also plays an indispensable role in people's daily lives. In the current era background of pursuing high-quality development, reducing the dependence of economic growth on energy, improving energy utilization efficiency, solving energy shortages and improving environmental quality have become extremely urgent. consumption in Henan Province is still nearly 10% higher. Therefore, in the \"14th Five-Year Plan\", Henan Province not only needs to control the total amount of energy consumption, but also needs to further optimize and improve the energy consumption structure system. Therefore, an in-depth analysis of the main influencing factors of the changes in the energy consumption structure in Henan Province is of crucial significance for promoting the optimization and upgrading of its energy consumption structure, mastering the characteristics of energy consumption and realizing the green transformation of the economy and society. Henan Province, as the hinterland of the Central Plains, is not only a densely populated area and an important agricultural town in China, but also an important area of energy consumption. In order to promote the transformation in the energy field, Henan Province has introduced relevant policies, such as the \"14th Five-Year Plan for Modern Energy System\". Under the principle of adhering to sustainable development, this plan is oriented towards the comprehensive green transformation of the economy and society, with reducing energy consumption intensity as the core, aiming to improve energy utilization efficiency and reduce the proportion of energy consumption, especially coal consumption. Through the in-depth implementation of carbon peaking actions, it promotes the conservation of resources and environmental protection in the industrial structure, production methods, lifestyles and spatial patterns, and ensures the achievement of the carbon peaking goal by 2030 and the comprehensive goals of energy conservation and emission reduction in Henan Province. During the \"13th Five-Year Plan\" period, Henan Province has achieved remarkable results in energy consumption, with the proportion of coal consumption reduced by 8.8%. However, compared with the national average level, the coal The optimization of the regional economic structure and ecological environment is an important goal and plan for the development of Henan Province. In order to ensure the stable growth of the economy and simultaneously reduce the negative impact on the environment, it is particularly important to control the consumption of traditional energy such as coal and oil and increase the proportion of the consumption structure of clean energy such as electricity and natural gas. In order to deeply understand and quantify the key factors affecting this transformation, it is crucial to conduct a quantitative analysis of the influencing factors of the energy consumption structure. The energy consumption structure mainly reflects the proportional relationship between the consumption amount of clean energy (natural gas, wind power, solar energy, geothermal energy, etc.) and the total amount of energy consumption and the proportional relationship between the total amount of non-clean energy consumption (coal, oil) and energy consumption. According to Table 1, this paper takes the ratio of the consumption of clean energy such as natural gas and electricity in Henan Province to the total amount of energy consumption in Henan This paper focuses on the research of key factors for optimizing the energy consumption structure in Henan Province, aiming to promote the optimization and upgrading of the energy consumption structure in Henan Province. Through a comprehensive analysis of existing literature and data, it is found that the four dimensions of economy, structure, technology and policy are the main factors affecting the changes in the energy consumption structure. Through in- depth analysis of these factors, strong support can be provided for the optimization of the energy consumption structure in Henan Province.",
    "(1) Economic factors: From a macro perspective, the continuous growth of the national economy has made it possible to discover and utilize new energy sources; from a micro perspective, consumption theory points out that the impact of energy prices on energy consumption is of crucial importance, and the changes in energy prices will also be reflected in the structural usage of energy resources. (2) Structural factors: The changes in the energy consumption structure are closely related to the development of the primary, secondary, and tertiary industries. (3) Technological factors: With the improvement of the scientific and technological level and the progress of production technology, the energy production efficiency gradually increases, thereby reducing energy consumption and further affecting the changes in the energy consumption structure. Based on the above analysis of the influencing factor dimensions and after consulting a large number of relevant literatures, the indicators of factors affecting the changes in the energy consumption structure are selected. Among them, economic factors include the level of economic development and energy prices; structural factors include the industrial structure, that is, the proportion of the primary, secondary, and tertiary industries; technological factors include the level of In summary, this study constructs an indicator system for factors affecting the changes in the energy consumption structure in Henan Province. This system includes 4 first- level indicators and 8 second-level indicators, as shown in Table 2. This study selects the ratio of the consumption of clean energy such as natural gas and hydropower in Henan Province from 2007 to 2021 to the total energy consumption in Henan Province as the data of the energy consumption structure in Henan Province; uses the GDP of Henan Province to represent the economic development level of Henan Province; since there is currently no unified energy price index, and the purchase price index of fuels and power in the industrial industry can reflect the energy price situation to a certain extent, the purchase price index of industrial producers in Henan Province is used to represent the energy price index; obtains the data of the proportion of the primary, secondary, and tertiary industries in Henan Province from the Henan Statistical Yearbook; uses the investment in scientific research funds to represent the scientific and technological level, that is, the proportion of R&D in GDP; uses the urbanization rate to represent the urbanization level. The specific data are shown in Table 3. The descriptive statistical characteristics of the main variables are shown in Table 2 - 4. The minimum value of the explained variable Y is 4.37, and the maximum value is 21.05, indicating that the proportion of clean energy consumption in Henan Province has increased significantly in recent years. Judging from the standard deviation and extreme values of X1 and X7, the economic development level and urbanization level in Henan Province have both increased significantly. In addition, it can be seen from the data of X4 and X5 that the secondary and tertiary industries have developed rapidly during this period. The correlation analysis results of the main variables are shown in Table 5. As can be seen from the results, there is an overall significant correlation between the explained variable and the explanatory variables, and the correlation coefficients between the variables are relatively large. Therefore, the validity of model regression may be affected by multicollinearity. Before the construction of the model, this paper sets certain assumptions: First, the influence relationship between the effectiveness of production and R & D investment and the energy consumption structure of Henan Province is not considered. Second, the restrictions of special production activities and emergencies are not considered. Third, the interaction effect of changes in energy composition elements is not considered. proportion of clean energy consumption (Y), economic development level (X1), and energy price (X2) in Henan Province, the ratio of the consumption of clean energy such as hydropower and natural gas in Henan Province from 2007 to 2021 to the total energy consumption in Henan Province is selected as the data of the energy consumption structure in Henan Province. The GDP of Henan Province is used to represent the economic development level. A regression model y = b1 + b2x2 + b3x3 + ei is established. Taking LnY as the explained variable y, LnX1 as the explanatory variable x2, LnX2 and as the explanatory variable x3. Using the statistical software Eviews, the regression analysis results are shown in Table 6.",
    "A regression model y = b1 + b2x2 + b3x3 + b4x4 + b5x5 + b6x6 + ei is established. Taking LnY as the explained variable y, LnX1 as the explanatory variable x2, LnX2 as the explanatory variable x3, LnX3 as the explained variable x4, LnX4 as the explanatory variable x5, LnX5 and as the explanatory variable x6. Using the statistical software Eviews, the regression analysis results are shown in Table 7. A regression model y = b1 + b2x2 + b3x3 + b4x4 + b5x5 + b6x6 + b7x7 + b8x8 + ei is established. Taking LnY as the explained variable y, LnX1 as the explanatory variable x2, LnX2 as the explanatory variable x3, LnX3 as the explained variable x4, LnX4 as the explanatory variable x5, LnX5 as the explanatory variable x6, LnX6as the explanatory variable x7, LnX7 as the explanatory variable x8. Using the statistical software Eviews, the results obtained from regression analysis are as follows Table 8. For the economic significance of this model: The explanatory variables (the proportion of the primary industry, the proportion of the secondary industry, the proportion of the tertiary industry, and the level of urbanization) have an insignificant impact on the proportion of clean energy consumption statistically. The economic development level, energy price, and technological level have a significant impact on the proportion of clean energy consumption. However, the explanatory variables in the model jointly have a significant impact on the proportion of clean energy consumption, and this model reflects 99.21% of the real level. proportion of the secondary industry and the proportion of the tertiary industry, are added, the adjusted coefficient of determination becomes smaller. This may be because the relationship between these two variables and the dependent variable is weak, or there is multicollinearity with other added explanatory variables. Therefore, these two variables may not make much contribution to the explanatory power of the model. (2) When adding the other five variables, the adjusted coefficient of determination becomes larger, indicating that the relationship between these variables and the dependent variable is strong and they contribute to the explanatory power of the model. Through comparison and contrast, it can be found that among these models, model three has the highest goodness of fit. However, due to possible collinearity problems among variables, the relationship between the explanatory variables and the explained variable is not significant. When there is multicollinearity, the variables in the model may not be able to independently explain the variability of the dependent variable, that is, there is a model specification error. Accordingly, we can see that the change of the adjusted coefficient of determination is observed in the process of gradually increasing the explanatory variables. It can be found that: (1) When the two explanatory variables, the The correlation coefficient can be used to analyze the pairwise correlation between explanatory variables. As shown in Table 9. It can be seen from the correlation coefficient matrix that many of the correlation coefficients between explanatory variables are above 0.93, that is, the explanatory variables are highly correlated. When there are more than two explanatory variables and there is a complex correlation between variables, multicollinearity can be tested by establishing an auxiliary regression model. As shown in Figure 1, the constructed auxiliary regression equation takes Lnx1 as the explained variable. However, the F-statistic of the regression equation is very significant in short, indicating that there multicollinearity among these variables. is This paper uses the stepwise regression method. In the Selection Method section, the default forward stepwise method (Stepwise-Forwards) is adopted. In the program termination criterion area, the significance level p-value is selected as 0.05, and the number of regression variables used is selected as 5. Finally, a ternary linear regression model including LNX1, LNX2, and LNX6 is obtained. According to the estimation results of the empirical model and relevant data analysis in this article, we can draw the following conclusions: Firstly, the sum of the output elasticity coefficients of the economic development level, energy price, and technological level is greater than 1, indicating that these three factors will significantly affect the proportion of clean energy consumption in Henan Province. Therefore, Henan Province should continue to intensify its efforts to develop and improve the economic development level, energy price, and technological level in the future. Strengthen economic construction, promote the optimization and upgrading of the industrial structure, and drive green, low-carbon, and circular development. Encourage and support the development of clean energy-related industries, such as solar energy, wind energy, and biomass energy, to improve the supply capacity of clean energy. Strengthen cooperation and exchanges with international and domestic regions with advanced clean energy technologies, and introduce advanced technologies and management experience.",
    "change in the proportion of clean energy consumption in Henan Province is the most significant. It shows that Henan Province still relies relatively on traditional energy. When the prices of these energy sources rise, the use of clean energy will increase. Therefore, in the next step, the government should still optimize the industrial structure, promote the optimization and upgrading of the industry, establish a reasonable energy price mechanism, reflect environmental value of clean energy, and encourage consumers and enterprises to use clean energy. Provide appropriate subsidies or tax incentives for the production and consumption of clean energy to reduce the use cost of clean energy. Strengthen energy market supervision to prevent energy price monopoly and unreasonable increases, and maintain market order. the In conclusion, Henan Province should continue to intensify its efforts to develop and improve the three factors of economic development level, energy price, and technological level to further increase the proportion of clean energy consumption. At the same time, comprehensive policies need to be formulated, publicity and education need to be strengthened, and other measures need to be taken to ensure the smooth development of clean energy."
]