[
    "Abstract: At present, the main sources of agricultural ecological compensation funds in China are central financial transfer payments and special funds, while local government funds are auxiliary sources. Compensation methods are mainly implemented by specific means such as government financial transfer payments and financial subsidies. Taking Henan Province as an example, based on the perspective of fiscal expenditure, this paper takes agricultural ecological compensation as the research object, and sets benchmark scenarios and development scenarios from near and far periods to predict the government's affordability. According to the GDP, population, fiscal revenue, general public budget expenditure and agricultural expenditure of the whole province, it is predicted that the fiscal expenditure pressure of agricultural ecological compensation will not increase greatly from 2023 to 2027, but with the development of social economy, the fiscal expenditure pressure of agricultural ecological compensation will be higher from 2028 to 2037. Facing this problem, this paper proposes a solution to the financial binding force. At present, the macro environment is complex and changeable, and there are many unbalanced problems in the fiscal revenue and expenditure of Henan Province. All kinds of fiscal income increase and expenditure reduction are concentrated, expenditure rigidity is strong, and the contradiction between fiscal revenue and expenditure is prominent. From the perspective of fiscal revenue, the foundation for stable and good economy is not firm, private investment and industrial investment are sluggish, and it takes a long time for stable economic recovery, so it is difficult to guarantee the payment of agricultural ecological compensation funds. According to the current situation, there is a certain pressure on the government's financial expenditure, so it is necessary to predict and analyze the government's financial bearing capacity. Scenario Analysis is also widely called environmental prospect description. It refers to a scheme that puts forward various key settings for the major possible evolution of a series of influencing factors such as economy, technology or industry, makes various key predictions and evaluations for possible future situations, and at the same time makes predictions combined with related individual predictions, providing a panoramic description of the environment and monitoring the changes of influencing factors in real time. In this process, the prediction scheme is revised accordingly, which can better serve the decision-making. The basic idea of this method is to describe a variety of possible scenarios for the future development direction of things, to fit with the future to the maximum extent, and to take corresponding measures according to the analysis of results, to fully mobilize positive factors and eliminate negative factors, so that a certain scenario in the future can be realized, and to some extent, it can also be said to be shaping the future[1]. Scenario analysis is a forecasting tool, which refers to a method used to analyze the influence of various unknown scenarios on research objectives in the future. Based on the complexity and uncertainty of future technology development, it makes a variety of alternative descriptions of future development. Mainly based on financial expenditure of agricultural ecological compensation, this article carries on the scenario analysis to the government's affordability in the near, far future periods. Based on the future trend of agricultural ecological compensation expenditure, this paper analyzes the influencing factors of government affordability, which can be divided into short-term and long-term, according to the time of prediction. The short-term projection time is 2023-2027, and the long-term projection time is 2028-2037. The analysis process is divided into three stages, namely, the selection of influencing factors, the setting stage of situational conditions and influencing factors, and the analysis of influencing results. This study mainly adopts the following methods to speculate on the law of factor change: Firstly, according to the relevant research results, we set the scenario of agricultural ecological compensation fiscal expenditure in the next ten years. Secondly, the plans and plans of government departments are taken as an important basis for setting macroeconomic development. According to the GDP, fiscal expenditure and agriculture-related expenditure in Henan Province in recent five years (see Table 1, Table 2 and Table 3), this paper designs two scenarios with different degrees, which are called Scenario A and Scenario B. Scenario A (Baseline Scenario): In the past five years, from 2017 to 2021, the average annual growth rate of general public budget expenditure was 5.6%, and the average annual expenditure on agriculture and other aspects accounted for 10.8%. Combined with my paper \"Research on Agricultural Ecological Compensation in Henan Province from the Perspective of Fiscal Expenditure\", the amount range of agricultural ecological compensation in Henan Province was ［558.79×108，1541.92×108］ yuan, and the upper limit accounted for 15% of the fiscal expenditure in 2021, and the lower limit accounts for 5%. Generally speaking, the amount of compensation accounts for 3%-5% of the fiscal expenditure of the current year, which is relatively feasible, otherwise the government pressure will be too great. From this data, the expenditure situation is relatively stable, and it is predicted that it will not increase significantly from 2028 to 2037, and the government's affordability will not increase significantly. Continuing the current development, the proportion of financial expenditure on agricultural ecological compensation remains unchanged, and the amount of compensation is stable[2].",
    "In terms of agricultural subsidies, such as subsidies for purchasing agricultural machinery and tools, subsidies for returning farmland to forests and grasslands, etc., there are specific subsidy objects and targets, but they are not GSP. The subsidies for ordinary farmers are mainly farmland protection subsidies. A field survey found that the subsidies for farmland fertility protection in Henan Province are about 100 yuan per mu. Combined with the compensation amount and compensation standard calculated above, the current agricultural ecological compensation amount is still limited. Among the existing compensation amount, the compensation amount for comprehensive capacity building of agricultural production is the largest, but the ecological compensation in other aspects is relatively small and the compensation standard is unbalanced. Scenario B (Development Scenario): According to the current data of Statistical Yearbook of Henan Province, the indicators of GDP, population, fiscal expenditure and fiscal revenue of the whole province have been on the rise. It is predicted that the proportion of fiscal expenditure on agricultural ecological compensation will increase from 2028 to 2037, and the amount of compensation will also increase, so the corresponding affordability of the government will be greater. The Proposal of Henan Provincial Committee of the Communist Party of China on Formulating the 14th Five-Year Plan and Long-term Goals for National Economic and Social Development in Henan Province points out that the land use structure and agricultural input structure should be adjusted in depth, the priority development of agriculture and rural areas should be adhered to, and the quality and efficiency of agriculture should be promoted. Optimize the modern agricultural industrial system, integrate the all-round development of primary, secondary and tertiary industries, continue to promote the construction of important agricultural product bases, and accelerate the high-quality development of agriculture. According to the population development plan of Henan Province, it is predicted that the population of Henan Province will reach a peak of about 115 million by 2030, when the economic, social and population pressure will further increase. Moreover, with the further development of urbanization, the migration of rural population to cities will also lead to the loss of rural labor force, young adults leaving the countryside, and the proportion of the elderly population will rise. All these will inevitably require the government to actively respond to the aging of the population, improve the policy of linking the urbanization of agricultural migrant population, and strengthen the guarantee of basic public services. According to the 14th Five-Year Plan and Long-term Goals of Henan Province and the Statistical Yearbook of Henan Province, the amount of general financial public expenditure on agriculture is still on the rise every year. From next to 2037, with the further development of agricultural ecological compensation policy, the financial pressure will increase, and the financial expenditure pressure for agricultural ecological compensation will also increase. According to the data in Table 1, the gross national product of Henan Province in the five years from 2017 to 2021, the average annual growth rate is about 6.38%, with an average annual increase of about 350 billion yuan. According to the current national economic development of Henan Province, the 14th Five-Year Plan for National Economic and Social Development of Henan Province and the long-term development goals, it is predicted that the next increase in GDP will still maintain steady growth every year. According to the statistics in Table 1 and Table 2, the general public budget expenditure of Henan Province in the five years from 2017 to 2021, the average annual growth rate is about 5.64%, with an average annual increase of about 40 billion yuan. Based on the current national economic development of Henan Province, the 14th Five-Year Plan for National Economic and Social Development of Henan Province and the long-term goals, it is predicted that the next increase in general public budget expenditure will still maintain steady growth every year. According to the table, the annual proportion of agriculture-related expenditure in the general public budget expenditure is about 10.8%. It is speculated that agriculture-related expenditure will still increase every year, but the growth rate is smaller than that of the public budget expenditure. Firstly, the factor of GDP. The level of government fiscal revenue is determined by the development degree of national economy. Only by making the cake bigger can the government have enough fiscal revenue in the initial distribution. Government budget funds are the main source of funds to establish and improve the social security system. Only by improving production efficiency, speeding up economic development and increasing GDP can the government's fiscal revenue be fully guaranteed, and thus the government can arrange more government budgets to support the capital expenditure on agricultural ecological compensation. According to the development goals of the \"14th Five-Year Plan\" period in the report of Henan provincial government in 2021, the average annual growth rate of main economic indicators is higher than the national average, and the GDP has reached two new big steps, with an average annual growth rate of about 6%[3]. According to the average GDP growth rate of 6.38% from 2017 to 2021 in Statistical Yearbook of Henan Province, taking this growth rate as the baseline, the GDP of 2023-2027 and 2028-2037 is predicted, and it can be seen that the gross national product of Henan Province continues to grow within the forecast period.",
    "Secondly, the factor of population. According to the Statistical Bulletin of National Economic and Social Development of Henan Province, the number of rural population decreased from 47.64 million to 43.04 million in 2017-2021, and then it is predicted that the rural population will decrease to 39 million in 2023-2027. By 2028-2037, the proportion of rural population decline should be even greater on this basis. The rural population is declining year by year, aging is serious, and the population structure has changed. The government will increase the rural public pension expenditure, the burden of public finance and the debt pressure of local economy, which makes the government's fiscal expenditure tested. With the further aggravation of aging, in order to maintain the basic living requirements of the elderly for the living environment, it is likely to reduce the expenditure on agricultural ecological compensation under the corresponding restrictions of the financial policy of supporting agriculture. At the same time, the aging of the population may also lead to the slow development of rural economy, lowering farmers' income, which requires the government to tilt the agricultural ecological policy, and then increase the pressure of government fiscal expenditure. Thirdly, the factors of changes in fiscal expenditure. According to the report of Henan provincial government in 2021, it is proposed to \"comprehensively promote rural revitalization and accelerate agricultural and rural modernization\". According to the Statistical Yearbook of Henan Province, the average annual growth rate of general public budget expenditure from 2017 to 2021 is 5.6%, and the average annual proportion of expenditure on agriculture is 10.8%. It is predicted that the general public budget expenditure and expenditure on agriculture will still keep growing in the next 2023-2027, and will increase greatly by 2028-2037. First of all, it is mainly because the expenditure of agricultural ecological compensation is relatively weak in the national financial compensation expenditure. At present, the expenditure in the field of agricultural production compensation in China mostly concentrates on the construction of comprehensive agricultural production capacity and the subsidy of non-inclusive system. For example, in providing compensation funds for other regions and building high and stable grain and high-standard cultivated land in major producing areas, it is necessary to increase investment in agricultural ecological compensation, and then increase financial expenditure, give full play to the macro-control role of society, raise project construction funds through multiple channels, and promote financial support for agriculture in the field of agricultural ecological compensation expenditure[4]. Secondly, the current way of subsidizing agriculture is unreasonable. Subsidies in agriculture are mainly price subsidies, such as subsidies in the purchase and sale of agricultural products and agricultural tools of production. Most of these benefits are agricultural production enterprises, and farmers get less subsidies directly. Finally, the financial expenditure on agricultural ecological compensation, in addition to increasing the expenditure on rural ecological environment protection, should also increase the inclination to green agriculture, which can solve the externalities of agricultural economy at the same time, and then promote the field of agricultural ecological compensation. From the current situation, the way to solve the financial binding force is mainly from taxation. In agricultural ecological compensation, the tax policy is mainly manifested in two points: Firstly, the corresponding tax should be collected for the destruction of ecological environment to make up for some ecological restoration and protection costs; the second is to encourage the behavior of protecting the ecological environment and reducing environmental pollution through tax incentives, and make up for some environmental protection investment funds[5]. For example, we can reform the land transfer system and the land tax system. It mainly collects real estate tax on local stock land to create public fiscal revenue, which is fair and can ensure the relative stability of local government fiscal revenue. Subjectively, it will also urge the government to restrain the land price and stabilize the land price within a reasonable range. By perfecting the local land tax system and gradually collecting real estate tax to increase local fiscal revenue, it can not only ensure the stability of local finance, but also promote the economical and intensive use of land resources. In addition, the main way to adjust the financial resources of governments at all levels is the transfer payment system. The main reason for the financial transfer payment system is the imbalance between the central and local governments, which is the fiscal policy adopted by the state in order to achieve regional coordinated development. At present, in the practice of ecological compensation in many countries, transfer payment is also one of the most frequently used compensation means.",
    "[1] An Wenhui. Scenario analysis in the application of the urban air pollutant total amount forecast- to xi 'an as an example [D]. Xi’an University of Architecture and Technology, 2016. [2] Liu Xianghua. Value Accounting Method of Agro-ecosystem Services in China [J]. Statistics & Decision, 2018, 34(03):24-30. [4] Lai Daoyuan. A Study on the correlation between finance and Social security expenditure and national economic growth in Anhui Province [J]. Modern Business, 2016, (29): 65-66. [5] Yang Jinfu. The financial policy Research of ecological compensation in our country [D].Chinese Academy of Fiscal Sciences, 2015."
]