[
    "Abstract: As an important industry connecting urban and rural areas and serving production and life, logistics enterprises, as the micro-foundation of the development of logistics industry, have a profound impact on the spatial reconstruction of regional economic and social development. National Development and Reform Commission issued the \"Fourteenth Five-Year Plan\" modern logistics development and \"Fourteenth Five-Year Plan\" modern circulation system construction planning \"put forward new requirements for the development of logistics industry, emphasizing the optimization of logistics spatial layout and speed up the construction of national logistics hub, especially pointed out that to make up for the shortcomings of the central and western regions. As an important base for the development of China's logistics industry, the spatial layout of logistics enterprises in Henan province not only affects the high-quality development of the logistics industry in the province, but also plays an important role in the improvement of the national logistics network. In this paper, based on POI data, the mean nearest neighbor method, local Moran scatter plot analysis and kernel density visualization technology are used to analyze the spatial agglomeration characteristics of logistics enterprises in 157 counties in Henan Province. It is found that the spatial distribution of logistics enterprises in Henan Province has gradually evolved from multi-point dispersion to a single-core and multi-core collaborative model with Zhengzhou as the core, and presents a significant spatial positive correlation and agglomeration trend. This change has improved the logistics efficiency and promoted the strengthening of regional economic ties. At the same time, the agglomeration trend of logistics enterprises in Henan Province continues to strengthen, from the initial agglomeration in the core area to the diversified diffusion pattern, showing the continuous optimization and reconstruction of logistics network in the province. and serving production and life, logistics industry is the key foundation for the integrated development of urban and rural areas. Logistics enterprises are the micro foundation of the development of logistics industry, the main body of logistics services, and the professional organizations that undertake logistics activities, supporting the efficient operation[1].The 14th Five-Year Plan for the Development of Modern Logistics and the 14th Five-Year Plan for the Construction of Modern Circulation System issued by the National Development and Reform Commission put forward new requirements for the development of the logistics industry, emphasizing the optimization of logistics spatial layout and the acceleration of the construction of national logistics hubs, especially pointing out that the shortcomings of the central and western regions should be made up. Henan Province, as one of the important bases for the development of China's logistics industry, connects the east to the west, connects the south to the north, and is an important hub for industrial transfer in the east and resource export in the west[2]. However, there are still significant gaps in the development of its logistics industry, especially at the moment when the demand for logistics is increasingly strong. Therefore, optimizing the spatial layout of logistics enterprises is of great significance for improving the development quality of the logistics industry in Henan Province and promoting the integrated development of urban and rural areas. and abroad have conducted multi-angle research on it. The existing researches mainly focus on the factors affecting the location, location selection and spatial layout of logistics enterprises. Most domestic researches discuss the spatial distribution of logistics enterprises from the macroscopic regional perspective, pointing out that their distribution is closely related to regional economic strength, transportation infrastructure and geographical location[3][4][5][6][7]. The study reveals that the spatial distribution of logistics enterprises is mainly agglomeration, but the agglomeration degree varies with the scale change, and the variation is different among different levels[8][9]. Logistics enterprises tend to cluster in areas with high economic vitality, such as the core areas of provincial capitals logistics[10][11][12][13],in addition, geographical change, population flow and industrial suburbanization[14][15][16]; The number of logistics enterprises, permanent population, total retail sales of social consumer goods[17]; traffic conditions, agglomeration factors and policy factorsare also considered to be important factors affecting the spatial distribution of logistics enterprises[13][18]. or Foreign studies focus on the micro level, exploring the factors affecting the location choice and location strategy of logistics enterprises, emphasizing the key factors such as accessibility[19][20][21][22].The spatial distribution pattern of logistics changes significantly with the growth of facilities and the improvement of service quality. The phenomenon of \"logistics diffusion\" is generally recognized, that is, the relocation of logistics facilities from urban centers to suburbs[23][24]. At the same time, logistics facilities show a trend of agglomeration in geographical space, and The existing research lacks the overall description of logistics spatial structure, and the research on Henan as the representative of the logistics province and the national logistics hub is weak. The spatial layout of regional logistics is restricted by national macro policies, regional development strategies, local resource endowments, industrial structure and traffic conditions, etc. Therefore, strengthening the research on the spatial structure of the overall logistics enterprises in Henan Province will help to deeply understand the complexity and diversity of the spatial layout of logistics, and provide support for scientific planning.",
    "Based on POI data and taking logistics enterprises in Henan Province as the research unit, this paper makes an in-depth analysis of the spatial agglomeration characteristics of logistics enterprises, aiming to reveal the spatial distribution law of logistics enterprises in Henan Province and study the spatial distribution pattern of logistics enterprises in Henan Province, with a view to providing references for the optimization of logistics spatial layout in Henan Province. To provide scientific basis and decision-making reference for optimizing logistics resource allocation, improving logistics efficiency and service level. Nuclear density analysis refers to the analysis method of calculating the unit density of points and line elements in the surrounding domain range, that is, by generating the continuous density surface to directly reflect the distribution of discrete measurement values in the continuous area, and at the same time, it can intuitively identify the situation of geographical things gathering or dispersing in space. This paper uses the kernel density analysis method to calculate the agglomeration degree of logistics enterprises in the spatial distribution. The calculation formula is as follows: Where n represents the number of logistics enterprises, K is the kernel density function, also known as the spatial weight function; h is the set search radius, and d (x, xi) represents the Euclidean distance between the logistics enterprise to the sample point to be observed. The average nearest neighbor method obtains five indicators: average observed distance, expected average distance, nearest neighbor index, Z-score and P-value. The mean observed distance is the mean of the distance between all points and their distance in its nearest neighbor. The expected mean distance is the mean of the distance between all points in a random distribution and their nearest neighbors. The nearest neighbor index can be used to judge the distribution pattern of the study subjects in space, which is the ratio of the average observed distance and the expected average distance. The Z-score was used to test the statistical significance of the mean nearest neighbor analysis. The P- values are used to test the authenticity of the study results. The fr, is the average observed distance and the rz expected average distance. We can determine three distribution patterns: when R> 1, the actual nearest distance between points is greater than the theoretical closest distance, indicating that the points are mutually exclusive and tend to be spatially evenly distributed; when R=1, the distribution of points comes from a completely random mode and belongs to the spatial random distribution; when R <1, the actual nearest distance between points is less than the theoretical nearest distance and tends to the spatial cluster distribution. Data of logistics enterprises are mainly obtained from the enterprise registration platform and poi data, and the number of logistics patents is mainly from the One patent search and analysis database. Other relevant data are mainly from China County Statistical Yearbook, China County Construction Statistical Yearbook, Henan Province and all cities and counties statistical yearbook, statistical bulletin, government work report and national economic and social development statistical bulletin, etc. In order to obtain comprehensive and accurate data, multiple data sources are considered. Firstly, the current POI data is obtained through the Amap open API platform and data acquisition technology. POI refers to points on the map with non-geographical significance except cities, mountains, rivers, etc., which can reflect their name, longitude, latitude and category four aspects of information. A large number of POI data is helpful for data analysis, data prediction and other work.Based on the Amap API platform and data collection technology, select \"post\", \"express\", \"storage\" and \"freight\" and other keywords to pick up the POI data of Henan logistics enterprises. Due to the limited access to POI data, it also combines the enterprise registration information of \"Tianyan Check\", \"Aiqi Check\", \"Qi check\" and other websites to supplement the data of previous years. Drawing on the relevant research results, the data of the logistics industry was replaced by data of the transportation, warehousing and postal industries. 63911 pieces of original data were obtained. According to the quality and consistency of original data, data pre-processing was carried out to remove duplicate data, null value and outlier value. The data pre-processing was divided into three key steps: One is to use Excel to screen the enterprise name and business scope contains \"freight\", \"warehousing\", \"loading and unloading\", \"logistics\", \"supply chain management\", \"express\", \"distribution\" and other keywords of the enterprise, and the first identified logistics activities in the scope of business defined as the logistics type of the enterprise; The second is to eliminate the registered capital of 10,000 yuan and below the logistics enterprises and service sites; The third is to combine the address of the logistics enterprise with Amap API and convert it into the WGS coordinate system to ensure the accuracy of the coordinates and eliminate the geographical location that cannot be located.",
    "This paper selects the POI data of logistics enterprises in Henan Province from 2003 to 2023, divides it into three-time nodes for research: 2009, 2016 and 2023. Finally, the enterprise attribute data of 38,569 enterprises with POI points were obtained. On the basis of the preliminary analysis of the development of logistics in Henan Province. By selecting the data of logistics enterprises in Henan Province from 2003 to 2023 and taking the data of three-time nodes in 2009, 2016 and 2023 as samples, the spatial pattern and evolution law characteristics of logistics enterprises in Henan Province are deeply analyzed from three aspects: time evolution characteristics of logistics enterprises, spatial correlation degree evolution characteristics and spatial pattern evolution characteristics. From the perspective of various periods of the overall development of logistics enterprises in Henan Province, a significant growth track has been shown from 2003 to 2023. At first, the number of logistics enterprises from 2003 to 2009 was limited, only 1,640, reflecting the initial development stage of the logistics industry. Then, by 2016, the number of logistics enterprises surged to 5,601, a 3.4-fold increase that marked a steady expansion of the industry. However, the most significant change occurred in the period from 2017 to 2023, when the number of logistics enterprises grew at an astonishing speed, finally reaching 29,155 in 2023, an increase of 5.21 times compared with 2016. This rapid development trend not only highlights the core position of the logistics industry in the economic system of Henan Province, It also indicates that the logistics industry will continue to maintain strong growth momentum in the future. status, gradually become the industry development leader, forming a single-core growth pole. Although Luoyang City, Nanyang City and Shangqiu City have not surpassed Zhengzhou City, they still maintain the position of important logistics nodes, forming a \"one pole and three nuclear\" diffusion pattern. On the whole, from 2003 to 2023, the geographical distribution of logistics enterprises in Henan Province has changed from multi-point dispersion to single-core leadership and multi-core collaboration, promoting rational allocation and efficient utilization of resources, strengthening regional economic ties and cooperation, and injecting new impetus into the economic development of Henan Province and the wider region. In terms of spatial distribution, logistics enterprises concentrated in Luoyang, Nanyang and Shangqiu in 2009, reflecting infrastructure construction, market demand and policy advantages. Subsequently, Zhengzhou, with its provincial capital and Central Plains Economic Zone core Through global spatial auto-correlation, it can reflect the correlation degree of the unit phenomenon or attribute value of the geographical area adjacent to or near the space. In order to understand the spatial distribution correlation of logistics enterprises in Henan Province, the distribution number of logistics enterprises in 157 counties in Henan Province was selected as the basic analysis unit to carry out global spatial auto-correlation analysis. Moran's I index, Z score and P value were calculated through the spatial auto-correlation analysis of ArcGIS10.6. The value of Moran's I index is between -1 and 1, and the index is greater than 0, showing a spatial positive correlation. When the Z score is >2.58 and P value <0.01, the spatial distribution is significantly clustered. The calculated results are shown in Table. It can be seen from the table that the Moran's I value of the dependent variable (the distribution number of logistics enterprises) are all within the range [0.2, 06], rising gradually from 0.235 to 0.532, all greater than 0.23, and all P values <0.01, rejecting the null hypothesis (there is no spatial correlation of the dependent variable). The Z scores of 2009, 2016 and 2023 are all >2.58. This indicates that the spatial distribution of logistics enterprises presents a relatively significant positive correlation, and the spatial distribution of logistics enterprises in different regions is not homogeneous, and there are more or less regions tend to cluster in space. The spatial correlation of spatial distribution of logistics enterprises among grid units is gradually enhanced, and the phenomenon of \"spatial club convergence\" is enhanced, and the agglomeration characteristics of spatial distribution is enhanced. As can be seen from the above section, the global spatial auto-correlation analysis found that the distribution of logistics enterprises in Henan Province has agglomeration characteristics, but it could not distinguish the agglomeration degree of logistics enterprises in various districts and counties and the agglomeration differences among local regions. In order to further explain the heterogeneity of the development agglomeration of logistics enterprises in different regions, Geoda software was applied. To draw the local Moran’s I scatter plot of the high quality development level of logistics enterprises in three time sections in 2009, 2016 and 2023. As shown in the figure, the scatter plot is divided into four quadrants, in which high-high clustering (the first quadrant) and low-low clustering types (the third quadrant) both show positive spatial auto-correlation, that is, the spatial aggregation of similar observations. On the other hand, the low-high cluster type (second quadrant) and the high-low cluster type (fourth quadrant) show a negative spatial auto- correlation, that is, the staggered distribution of different observations in space. The horizontal coordinate is the distribution quantity value of logistics enterprises' development, the vertical coordinate is its spatial lag value, the red represents the regression line, and the blue dot represents the research area.",
    "As can be seen from the figure, the local Moran’s I am mostly located in the third quadrant (low-low cluster) and the first quadrant (high-high cluster) in geographical distribution, showing a positive correlation in space, and there are also high-low cluster and low-high cluster phenomena. The spatial correlation of high-quality development of logistics enterprises in different regions changes with the passage of time, and the local Moran’s I show an upward trend, rising from 0.213 in 2009 to 0.496 and finally decreasing to 0.473. The spatial dependence of the development of logistics enterprises in neighboring regions is generally strengthened, but there is a weakening trend. The distribution and agglomeration effect of logistics enterprises in different regions and its evolution have the following 4 types: Diffusion effect zone (H-H cluster): located in the I quadrant of the Moran scatter diagram, it shows that logistics enterprises in the center and neighboring areas are highly clustered. In 2009, Jinshui District, Zhongyuan District and other seven districts in Zhengzhou formed the core agglomeration area, which became the key logistics town by virtue of consumption potential, labor resources, market advantages, geographical location and transportation network. By 2016, this effect extended to many places in Xuchang City, and further covered Weishi County of Kaifeng in 2023, showing a trend of radiation diffusion from Zhengzhou as the core to surrounding high-level areas. Excessive exhibition area (L-H cluster): located in Quadrant II, the characteristics are oligomeric in the center and high poly in the periphery. The number of such areas is small and the distribution is uneven, showing a shrinking trend. In 2009, it was concentrated in Shangshui County and Huaiyang District, in 2016, it moved north to Yuanyang County and Weishi County, and in 2023, it continued to move northeast, and stabilized around the HH cluster area near Yuanyang County. Low-speed development area (L-L cluster) : located in Quadrant III, it shows that logistics enterprises in the center and surrounding areas are clustered at a low level. The number of such areas was the largest, and they were widely distributed in Guangshan County and other places in 2009. In 2016, they migrated to the southwest and added Lingbao City and other places. Some of the original areas withdrew from oligopoly. In 2023, it will show a trend of aggregation in the middle of the country, and Song County and Lushan County will become new growth points. The polarization effect zone (H-L cluster) is located in the IV quadrant, showing a spatial negative correlation between high concentration in the center and low concentration in the periphery. The number of such regions is rare, mainly in Hualong District and other places in 2009, and significantly reduced to Yicheng district only by 2023, indicating the limitation and dynamic change of polarization phenomenon. When NNI<1, the state of agglomeration is present; When NNI>1, it presents a discrete state, and the smaller the NNI value, the higher the agglomeration degree of research objects. Combined with kernel density analysis, spatial visualization can be used to explore the agglomeration and diffusion degree of logistics enterprises as a whole. The average nearest neighbor is used to analyze the spatial distribution of logistics enterprises in Henan Province, and the results are shown in the table. From 2009 to 2023, the nearest neighbor index of the distribution of logistics enterprises in Henan Province is all less than 1, the Z-value test is negative, and the p-value is 0. The actual average observation distance is constantly reduced from 3.858km to 0.53km, and the nearest neighbor ratio is constantly declining, indicating that the spatial distribution of logistics enterprises in Henan Province is clustered, and it shows more and more obvious clustering characteristics. Specifically, from 2003 to 2009, the nearest neighbor index is greater than 0.6, and the actual nearest neighbor distance is greater than 3km, indicating that the degree of agglomeration of logistics enterprises is not high, showing a more obvious clustering trend, but the spatial distribution is still relatively dispersed; From 2017 to 2023, the nearest neighbor index is less than 0.4, and the actual nearest neighbor distance is less than 1km, and the distribution of logistics enterprises shows a significant clustering trend in 2023. It indicates that with the continuous expansion of logistics demand, the support of Internet technology and the continuous improvement of infrastructure and other factors, the rapid development of logistics industry is promoted, and the agglomeration degree of logistics enterprises in urban agglomerations is further strengthened.",
    "The kernel density analysis of ArcGIS software spatial analysis tool was used to measure the changing characteristics of spatial agglomeration degree of logistics enterprises in Henan Province in 2009, 2016 and 2023 respectively. As shown in the figure, in 2009, the distribution of logistics enterprises in Henan Province showed the coexistence characteristics of high dispersion and local high-density agglomeration. Jinshui District of Zhengzhou City and Chuanhui District of Zhoukou City formed a significant high- density agglomeration area. In nine regions, including the Old city of Luoyang City, Weidong District of Pingdingshan City, Hongqi District of Xinxiang City and Beiguan District of Anyang City, these core areas were surrounded. In the form of \"scattered\" weak agglomeration, the distribution of logistics enterprises shows the initial agglomeration and radiation effect. By 2016, the spatial distribution of logistics enterprises showed double characteristics of diffusion and strengthening. The concentration degree of core areas such as Jinshui District of Zhengzhou was significantly enhanced, forming a compact \"core cluster\" pattern, while the scope of the former weak agglomeration areas was reduced and moved closer to the core, showing a trend of unipolar development, and logistics resources were further concentrated in the economic center. In 2023, the number of logistics enterprises will grow rapidly and their spatial distribution will be diversified. The concentration of core areas in Zhengzhou continues to increase, and radiates outward to form a strong diffusion effect. At the same time, the \"scattered\" weak agglomeration trend reappears, but the form is different, reflecting the optimization and reconstruction of logistics network across the province. Through the comprehensive application of mean nearest neighbor method, local Moran scatter plot analysis and kernel density visualization technology, the spatial distribution pattern and dynamic change process of logistics enterprises in Henan Province are systematically revealed. It is found that the logistics enterprises in Henan Province have experienced a significant growth track from initial rise, steady expansion to rapid growth in time dimension, which not only reflects the vigorous vitality of the logistics industry, but also highlights the important position of Henan Province as a logistics hub. From the perspective of regional distribution pattern, the spatial distribution of logistics enterprises in Henan Province has gradually evolved from the initial multi-point scattered state to the single-core leading and multi-core collaborative mode with Zhengzhou as the core. This change reflects the efficient allocation and optimal integration of logistics resources in the process of regional economic integration, strengthens the radiating leading role of Zhengzhou as a logistics center city, and promotes the coordinated development of the surrounding areas. The agglomeration phenomenon of logistics enterprises not only improves the efficiency of logistics, but also promotes the strengthening of regional economic relations, and injects new impetus into the economic growth of Henan Province and even the whole country. In terms of spatial correlation evolution characteristics, it reveals that the distribution of logistics enterprises in Henan Province has a significant spatial positive correlation, indicating that the spatial distribution of logistics enterprises is not random, but has an obvious agglomeration trend. With the passage of time, this clustering trend is gradually enhanced, which is manifested as the significant improvement of spatial correlation. By drawing the local Moran scatter plot, the heterogeneity of logistics enterprise agglomeration is further refined, and the spatial distribution and dynamic changes of four agglomeration types, high-high, low-low, low-high and high-low, are revealed. The high-high agglomeration area is mainly concentrated in Zhengzhou and its surrounding areas. These areas become the main gathering place of logistics enterprises by virtue of their superior geographical location, developed comprehensive transportation network and huge market demand, and show strong diffusion effect, gradually radiating to the neighboring Xuchang City and Kaifeng City. Low-low agglomeration areas are widely distributed in areas with relatively backward logistics development. These areas are faced with challenges such as imperfect logistics infrastructure and insufficient market demand, resulting in sparse distribution and slow development of logistics enterprises. In addition, low-high and high-low are transitional agglomeration types. The low- high agglomeration area shows that the distribution of logistics enterprises is less in the central area, but more in the peripheral area, which reflects the spatial dislocation in the development of logistics industry. On the contrary, in the high-low agglomeration area, the logistics enterprises in the central area develop better, but the neighboring areas lag behind, showing a polarization effect. The existence of these two types of agglomeration reveals the imbalance and complexity of logistics industry in regional development.",
    "From 2009 to 2023, the agglomeration trend of logistics enterprises in Henan Province continues to strengthen, the NNI value continues to decline, and the actual observation distance is significantly shortened, indicating that the spatial distribution of logistics enterprises tends to be more closely clustered. Kernel density analysis intuitively shows the evolution process of logistics enterprises' spatial distribution: From the initial agglomeration in Jinshui District and other core areas in 2009, to the significant enhancement of the agglomeration effect in the core area in 2016, accompanied by the unipolar trend of the surrounding areas moving toward the center, to the surge in the number of logistics enterprises in 2023, the expansion of the radiation scope of the core area, and the diversification and diffusion pattern of new and weak agglomeration areas emerging in the old city, source and sink areas, etc. Fully demonstrates the continuous optimization and reconstruction of the logistics network throughout the province. To sum up, the spatial distribution of logistics enterprises in Henan Province has undergone a profound transformation from decentralization to agglomeration and then diversification and diffusion. This process not only reflects the rapid development track of the logistics industry, but also profoundly reveals the dynamic adjustment and optimization mechanism of the regional economic core in the spatial allocation of logistics resources. The continuous change of the spatial structure of the logistics industry, as a positive response to the urban-rural integration development strategy, has immeasurable value in promoting the urban-rural economic integration process and optimizing the resource allocation pattern. to"
]