[
    "1 Major in electronic information, North China University of Water Resources and Hydropower, Zhengzhou, Henan, CO, China 2 China University of Geosciences, majoring in Earth Exploration and Information Technology, Wuhan, Hubei, CO, China Abstract: Based on the data dataset of precipitation, surface water resources and underground water resources in the water resources bulletin of Henan Province from 1999 to 2022 by Henan Provincial Water Resources Department. Based on the spatial and temporal correlation rules, the distribution characteristics of water resources in urban agglomerations in Henan Province in time and space were analyzed using the weighted precipitation temperature homogenization index. The results show that the water resources supply and demand balance indexes are strongly correlated among cities in central, east, west, south and north Henan Province, and the spatial distribution of water demand has obvious geographical correlation and uneven distribution, with water resources in the central region mainly coming from the Yellow River and groundwater. The western region is relatively rich in water resources, mainly relying on local water bodies and groundwater. The southern region is close to the Yangtze River Basin and receives more precipitation, making water resources generally more abundant. The northern part of Henan Province is an important industrial base and the main grain-producing area, and one of the most water-scarce areas in Henan Province, with water resources forming the province's largest groundwater leakage area, and with the increase in population and the expansion of cities, the problem of water resources shortage in the northern part of Henan Province is becoming more and more serious. Water resources in the eastern part of the region mainly come from the Yellow River tributaries and groundwater, and water resources are generally stable, but tensions can still occur during peak water use periods. Henan Water Resources The contradiction between supply and demand is prominent and the spatial distribution is uneven. With the rapid economic development and continuous population growth, the pressure on water resources has become more and more prominent. At the same time, the uncertainty brought by climate change and the frequent occurrence of extreme weather events have also brought new challenges to water resources management. Therefore, there is an urgent need to adopt a comprehensive water resources management strategy, to provide strong support for the scientific management and scheduling of water resources, and to improve the efficiency of water resources allocation, so as to cope with the more severe water resources crises that may be faced in the future. Regarding water resources dispatching scholars at home and abroad have conducted a lot of research: Hou Xiangdong et al.[1]selected the South Blossom River Basin as the study area, and constructed a one-dimensional water quality and quantity coupling model based on the MIKE11 software to analyze the dynamic changes of the capacity of the aquatic environment in flood season and non-flood season as well as the changes in the water quality of South Blossom River under different scheduling schemes, and the proposed scheduling scheme can effectively improve the water quality of the South Blossom River and guarantee the health of water ecosystems. The proposed dispatching scheme can effectively improve the water quality of the South Blossom River and protect the health of the water ecosystem. Xiao Hongyu et al. [2] realized the water resources scheduling preview and decision-making of digital twin irrigation districts, and designed the water resources scheduling management platform of digital twin irrigation districts. By digitally mapping and intelligently simulating the whole elements of the irrigation district physical basin and water resources management activities. Ma Zhuangzhuang et al. [3] Use GIS technology, modern database technology, and compute visualization technology to carry out research from the aspects of demand analysis, data collection and monitoring, data storage and processing, model construction and optimization, to achieve accurate prediction of future water resources change trends. S. Cristini et al.[4]used the Hydrological Basin Sustainability Index (HBSI) to consider the hydrological, environmental, social, and water resource management status of the Moju River Basin and proposed a payment model for the use of its water resources. A. Rezgar et al.[5]presented the application of R packages for large- scale water resource operations and the variety of functions and methods that are provided to R users by the WRSS package for the building water and energy models, manipulating their components, creating scenarios, and publishing and visualizing results. Hui-Yu Zhou et al.[6] proposed a new spatio-temporal association rule-based traffic congestion conduction prediction model. The model uses a spatio-temporal association rule mining algorithm based on genetic network planning (GNP) to identify the co-occurrence rules of traffic congestion at different times and locations, revealing the spatio-temporal conduction patterns of traffic congestion. Wang Hao et al. [7] used association rules for spatio-temporal mining of accident features, constructed association rule network graphs, and mined potential risk factors of accidents in specific navigational environments in Yangshan waters based on the Apriori algorithm. S Sridhar et al. [8] introduced a new framework called spatio-temporal association rule-based deep unannotated clustering (STAR- DAC), which is based on visual features for incremental clustering of unlabeled person re-identification images and fine-tuning of clusters by mined spatio-temporal association rules. Despite the availability of many theoretical models and methods, the application of spatio-temporal correlation analysis in practical formulation and water resources management and allocation programs is still limited. Many decisions rely on traditional experience and single-factor analysis and lack systematic spatio-temporal analysis support.",
    "The purpose of this thesis is to reveal the spatial and temporal relationship between water resources supply and demand in Henan Province through data analysis, and to explore in depth the contradictions and changing trends of different regions in terms of water resources supply and demand. It will reveal the characteristics of the spatial and temporal distribution of water resources in Henan Province, analyze the temporal and spatial differences in the demand for water resources in different regions, and propose countermeasures to optimize the management of water resources, so as to help Henan Province achieve the sustainable development of water resources. Based on the data of total water supply and water demand of 18 cities and municipalities involved in the 1999-2022 Water Resources Bulletin of Henan Province by the Henan Provincial Water Resources Department, the spatial and temporal spatial and temporal distribution of water resources of urban agglomerations of Henan Province was studied by using correlation rules. Firstly, the water resources data of Henan Province from are pre-processed and according to 1999 to 2022 categorized the criteria of regional water resources supply and demand balance, including water resources surplus, water resources balance and water resources shortage, and then based on the above water resources categorization statistics, the spatial and temporal characteristics and water resources scheduling is carried out by applying the correlation rulestudy of. Temporal-Spatial Association Rules (TSARs) is a discovering association patterns in temporal and spatial datadata mining method for. Its main involves four topics: mining algorithms, rule evaluation and representation, mining tools and applications, and spatio-temporal predicates. Similar to classical association rules, to discover patterns shaped like \"A → B \", X is the antecedent, i.e., the premise part of the rule, and Y is the consequent, i.e., the conclusion part of the rule. However, in spatio-temporal association rules, these predicates have significant spatio-temporal meaning. It is used to represent the relationship between spatial location and temporal evolution. The method is used in the analysis of the balance between supply and demand of water resources to better reveal the dynamics of water resources, demand trends and supply patterns. Support measures the frequency of occurrence of a rule in a dataset. In spatio-temporal correlation rules, the degree of support usually indicates how often different urban water resources are in the same state at the same time under a certain spatio-temporal condition. It is calculated as: where, |{D|DϵData, D contains X}| is the number of records containing event X and |Data| is the total number of records. The degree of support allows us to identify which temporal and spatial conditions are more frequent for water supply and demand imbalances, thus providing a basis for predicting and responding to water supply and demand imbalances. In water supply and demand analysis, the confidence level indicates the likelihood that the supply of water will be able to meet the demand under a particular spatial and temporal condition. It is calculated by the formula: Confidence helps to identify strongly correlated spatial and temporal patterns, clarifying how probable the supply- demand imbalance is under certain specific spatial and temporal conditions, and providing reliable decision support for water resource managers. The degree of elevation is used to measure the usefulness of a spatio-temporal correlation rule, reflecting the actual impact of the rule's conclusions. In the context of water supply and demand analysis, the degree of elevation can be used to assess the extent to which the risk of an imbalance between water supply and demand increases under certain spatial and temporal conditions relative to normal conditions. It is calculated using the formula: The degree of upgrading helps to highlight those factors that have a greater impact on the balance between water supply and demand under specific spatial and temporal conditions. To improve the quality and usefulness of the rules, add constraints or conditions on the spatio-temporal data. These constraints can be used in water supply and demand balance analyses to filter the rules to correlate application needs in specific geographic and temporal contexts. For example, consider the time period and spatial location of an event. This can be expressed as: Quantitative calculations of the supply and demand of water resources in a region can help formulate effective water resources policies, improve water use efficiency, and promote sustainable economic and social development, and provide a scientific basis for regional water resources management and planning. Based on the assessment of the water supply and demand situation of urban agglomerations in Henan Province, drawing on the ecological carrying capacity supply and demand balance index, this paper proposes the Regional Water Resources Supply and Demand Balance Index (RWRI) . The RWRI is the ratio of regional water demand to regional water supply, which reflects the relationship between water supply and demand, and its calculation formula is: Where: WD is the regional water demand (m?_); WS is the regional water supply (m3 ). When WD< WS, the regional demand for water resources is less than the supply of water resources, and the region shows a surplus of water resources; when WD> WS, the regional demand for water resources is greater than the supply of water resources, and the region shows a shortage of water resources; when WD= WS, the regional demand for water resources is equal to the supply of water resources, and the region shows a balance of water resources supply and demand. Therefore, based on the magnitude relationship of RWRI, it is possible to clearly understand the balance of water resources supply and demand in the study area state type.",
    "economic and social development of the 18 administrative units in Henan Province, generally divided into five regions: central Henan, northern Henan, southern Henan, western Henan and eastern Henan. Among them, central Henan includes Zhengzhou, Xuchang, Pingdingshan , Luohe , northern Henan includes Anyang , Hebi , Puyang , Xinxiang , Jiaozuo , southern Henan includes Zhumadian , Nanyang and Xinyang , western Henan includes Sanmenxia , Luoyang , Jiyuan , and eastern Henan includes Kaifeng , Shangqiu , Zhoukou .Based on RWRI Equation (6) the water surplus shortage of each city in different years is calculated . RWRI- based regional water supply and demand balance classification (level) evaluation criteria [9] (see Table 1) , cities in the interval (0,0.9] are in the state of water resources surplus, cities in the interval (0.9,1.2) are in the state of water resources balance, and cities in the interval [1.2, +∞ ) are in the state of water resources shortage, and the specific results are shown in Table (2) of . According to the research question, selected relevant data from 1999-2022 \"Water Resources Bulletin of Henan Province\", which summarizes water resources utilization and, in the province, detailed information on management, including precipitation, surface water resources, underground water resources, total water resources, and duplication of surface water and underground water. Checking the China Meteorological Administration and related statistics, Henan Province experienced several severe droughts between 19 99 and 202 2. Mining temporal correlation rules between drought and water-abundant years is an analytical task that combines time series and event patterns, with the goal of mining temporal patterns between drought and water-abundant years from historical climate data. Specifically, we wish to analyze the temporal sequence and interval between drought and water-abundant years for certain years. Next, the time interval between a drought year and a water- abundant year needs to be calculated and a rule created. Define a rule that will only be generated if a water-abundant year occurs within X years of a drought year. Generate a rule for drought and water-abundant years (with a time interval of no more than 5 years) The following output is obtained after running the code: As can be seen, the time lag between a drought year and a water-abundant year is 1-5 years. In other words, after a drought year water-abundant years are likely to occur within five years. This suggests that there may be some cyclical climate patterns, such as drought years being quickly followed by water-abundant years under certain climatic conditions. In the process of association rule mining experiments, each region as a separate database for rule mining, and each type of spatio-temporal rules need to set the minimum confidence and support degree in order to get a certain meaning of spatio- temporal association rule expressions. The two regions of central and western Henan have a more balanced distribution of water resources, moderate climate, more diversified industrial structure, and stronger water resources management capacity, which can better balance the supply and demand of water resources, so a lower threshold can be set when analyzing them, and 42% and 58% are selected as the minimum for these two regions support degree. The urban agglomerations in northern and southern Henan, on the other hand, are affected by the differences in geography, climate and water resources distribution, and the fluctuation of water resources surplus/deficit relationship is larger, which leads to a stronger correlation of water resources surplus/deficit in them, so the threshold can be set higher, and 81% and 83% can be selected as the minimum support degree of these two regions. Table 4 is the minimum threshold of support and confidence obtained after many experiments, and the results of spatial association rule mining are shown in Table 5- 13. From Table 5 it can be seen that Zhengzhou is in a state of water scarcity all year round in several cities in the middle of Henan , while the rest of the three cities are in a state of water balance in a small part of the year round, most of them are in a state of water resources surplus, and the correlation rule between the cities is supported by 42% or 73%, which shows that the three cities of Pingdingshan, Luohe and Xuchang are in water surpluses and the correlation between the three cities is relatively strong. From Table 6 and Table 7 , it can be seen that the three cities in North Henan are in the state of water shortage all the year round, and the correlation between the cities is high, with the support degree as high as 81% and 90%, which shows that the cities in North Henan are not only in serious water shortage but also in high correlation; from Table 8, it can be seen that the three cities in South Henan are in the state of water surplus all the year round and have strong correlation rules, and the correlation rule between the cities has a high support degree as high as 84% and 95%, which shows that the areas in South Henan are not only rich in water resources but also have strong correlation rules. The region in the south is not only abundant in water resources, but also has high correlation between neighboring cities; from Table 9 , it can be seen that the three cities in west Henan are in the state of water resources surplus all the year round, and the correlation between cities is also high, with the support degree of 58%, 66%, and 75%; from Table 10, it can be seen that the cities in the east Henan are Kaifeng, which has a permanent shortage of water resources, and the cities with permanent surplus are Shangqiu and Zhoukou, with the support degree of 66%, of which the correlation rule is 66%, with the support degree of 66%. The support degree of 66%, which also has a small number of years are in the state of water resources balance.",
    "We then analyze the spatial correlation rules for the cities passing through the two rivers, the Yellow River Basin and From Table 11 it can be seen that among the cities located in the Yellow River Basin, only Sanmenxia City and Luoyang City are in the condition of water resources surplus all the year round, and their correlation rule is supported by 75%, mainly because they are located in the Yellow River Basin, benefiting from the water supply from the Yellow River, as well as the water resources regulating facilities of the Yellow River Basin (e.g., the reservoirs) and seasonal variations of the precipitation amount. In addition, the scientific allocation and rational use of water resources management also guarantees that the water resources of these two cities are in surplus. From Table 12 it can be seen that the support degree of the association rule between the four cities of Zhengzhou, Kaifeng, Puyang and Jiaozuo in the year of water shortage is above 68%, which indicates that their water shortage situation has a strong linkage, even though these cities are located in the Yellow River Basin, due to seasonal fluctuations in the amount of water from the Yellow River, climatic droughts and unequal precipitation, over-exploitation of groundwater resources, improper water resource management, and the water pollution problems and other multiple factors, these cities are facing perennial water shortages. Solving these problems requires more effective water management measures, improved water use efficiency, and increased efforts to protect and rehabilitate water resources. As shown in Table 13, the three cities of Zhoukou, Shangqiu and Zhumadian, which are in the Huaihe River Basin, have a high yearly correlation when it comes to water resources surplus, with a degree of support of more than 47%, which is mainly due to the combined effects of relatively high precipitation, abundant water sources (especially the Huaihe River system and other local rivers), flat topography conducive to the pooling of water resources, and effective water resources management in these regions. These factors have made it possible to maintain a relatively adequate supply of water resources in these areas to meet the needs of agriculture, industry and urban water use, resulting in a surplus of water resources. Figure 1 shows the statistics of 18 cities in Henan Province according to the number of years occupied by corresponding eight indicators in ArcGIS Map 10.8 software, from left to right, from top to bottom are the number of high surplus, medium surplus, mild surplus, balanced surplus, critical shortage, mild shortage, high shortage and extreme shortage, the darker the color means the number of years is higher, the number behind the color swatch represents that the the city The darker the color, the greater the number of years, and the number behind the color bar indicates that the city is in the range corresponding to the number of years of water resources surplus and shortage. 1) Sanmenxia City, Xinyang City, Zhumadian City, and Nanyang City are in high surplus in more years, representing that these cities basically have sufficient water resources all year round. 2) Kaifeng City, Jiaozuo City, Hebi City and Anyang City are in a high degree of shortage in more years, representing the perennial water shortage of these cities. It can be concluded that the distribution of water resources in Henan Province shows obvious regional differences, with relatively scarce water resources in the north and west of Henan Province, especially in the northern part of the Yellow River Basin, such as north of Zhengzhou and Kaifeng, Luoyang, etc.; and relatively abundant water resources in the south, such as Xinyang, Nanyang and Zhumadian. In this paper, based on the water resources data of Henan Province from 1999 to 2022, spatio-temporal association rules mining research was carried out, and the geographical distribution of each indicator in specific cities was visualized and analyzed using GIS, and the main conclusions through the analysis are: In terms of temporal correlation, Henan Province faces the problem of drought and uneven distribution of water resources. Some areas have perennial droughts due to climate, precipitation distribution and other factors, while other areas may have a surplus of water resources, especially during the flood season. In the face of this situation, it is necessary for the relevant government departments to strengthen the regional water resources dispatching, strengthen the storage capacity of reservoirs and the dispatching system, adjust water resources allocation based on precipitation changes, implement dynamic management of water resources, improve the linkage of water conservancy facilities and cross-basin transmission capacity, and strengthen the capacity of early warning and adaptation to climate change, so as to alleviate the problem of water resources tensions and to provide sufficient water security for the whole province.",
    "sufficient water security for the whole province. In terms of spatial correlation, the northern part of Henan Province has a high demand for water resources, which is in short supply, while the opposite is true in the south. The basic reasons for the different degrees of water resources surplus and shortage in cities are all related to topography, climate, and precipitation. Most of the cities in the same region have a strong correlation between the correlation of the water resources supply and demand balance index with a support level of more than 40% and a confidence level of more than 66%. Moreover, the correlation between water resources surplus and deficit in the urban agglomerations of central and western Henan is relatively weak, mainly because of the balanced distribution of water resources in these two regions, the stronger geographical conditions and water resources deployment capacity, the more diversified industrial structure of central and western Henan, the balanced distribution of water resources demand, and the fluctuation of water resources surplus and deficit is not as dramatic as that of the north and south of Henanwater supply and demand balance indexes than 40% with a confidence level of more than 66%, which is a strong correlation., coupled with the mild climate of the central and western regions of Henan, the precipitation in the inter-annual variability of is more In addition, the climate in central and western Henan is mild, and the precipitation is relatively stable in the inter-annual change, so the fluctuation of water resources surplus and deficit is small. On the contrary, the northern part of Henan has an arid climate and insufficient precipitation, and the cycle of water resources shortage is longer, while the southern part of Henan has abundant precipitation, and the cycle of water resources surplus is longer, so the correlation between their water resources surpluses and deficits will be stronger. Several cities in the Yellow River Basin have both perennial drought and perennial water resources surplus, and several cities in the Huaihe River Basin are basically in the situation of water resources surplus. From these conclusions, we can make corresponding measures to adjust the status quo of drought in Henan Province, such as constructing large-scale water conservancy projects (e.g., reservoirs, water transfer projects, etc.) between upstream and downstream of some cities in the same river basin with strong linkage, deploying water-rich areas to water-scarce areas, optimizing the efficiency of water resources utilization, strengthening ecological protection and soil and water conservation, scientifically allocating water rights, regulating the relationship between supply and demand through water pricing reform, strengthening scientific research and data support, and so on. The government will also strengthen scientific research and data support, etc. This paper analyzes the spatial and temporal correlation rules of the water resources supply and demand balance index, but due to the limitations of the data, the correlation of specific seasons or months cannot be analyzed, and there is still room for further research and improvement, on the one hand, the comprehensiveness and precision of the data sampling itself affects the effect of the excavation, and on the other hand, not enough factors have been considered, such as the size and distribution of the population, the number and distribution of water infrastructure, water management policies and other influencing factors need to be further studied. On the other hand, not enough factors have been taken into account, such as population size and distribution, the number and distribution of water infrastructure, and water management policies, which need to be studied further. These spatio-temporal correlation rules allow water managers to identify which times (e.g., a certain drought period) and spaces (e.g., certain regions) are subject to imbalances between supply and demand, so that effective water allocation measures can be taken, contingency measures can be planned in advance, and water supply stability can be ensured. Spatio-temporal association rules combine temporal and spatial dimensions and provide richer contextual information, thus enabling the mining of complex data patterns. In practical applications, the temporal and spatial correlation rules need to consider the timeliness and spatial distribution characteristics of the data to ensure the validity and reliability of the mining results."
]