[
    "Abstract. Based on the panel data of different cities in Henan Province from 2010 to 2016, DEA model with variable scale compensation and Malmquist index model are used to measure environmental efficiency from static and dynamic perspectives. The results show that the overall environmental efficiency of Henan Province is at a high level, the technical efficiency is slightly improved, the allocation of input factors tends to be reasonable; the environmental efficiency is rising in dynamic change, among which the influence of technological progress on the environmental efficiency of Henan Province is more critical. China is the world's second largest economy and the world's largest energy consumer [1]. At the same time of rapid economic growth, the problem of environmental pollution has brought great challenges to the Chinese government. The concept of \"environmental efficiency\" was put forward by the world sustainable development organization in 1992, which is used to evaluate the environmental cost of economic growth. It has become an effective index to coordinate economic and environmental development. The level of environmental efficiency is closely related to the implementation effect of government management activities. With the implementation of the strategy of the rise of central China and the regional strategy of the Central Plains urban agglomeration and the Central Plains Economic Zone, the economy of Henan Province develops rapidly. With the acceleration of urbanization, the ecological environment damage problem is becoming increasingly serious. Therefore, how about the environmental efficiency of cities in Henan Province, the internal differences among cities and the factors affecting the environmental efficiency need to be further explored. In recent years, with the deepening of the research on environmental protection, DEA method is welcomed by most scholars, it only needs input and output data, is a more objective non parametric method. At present, the DEA method has been widely used. For example, Yang et al. calculated the environmental efficiency of China's provinces from 2000 to 2010 based on the DEA model, and found that the regional difference of environmental efficiency is obvious, and the environmental efficiency of the eastern region is higher [2]. Carboni and Russu applied DEA model to investigate the economic and environmental efficiency of 20 regions in Italy from 2004 to 2011 [3]. The results show that the efficiency of the northern region is higher than that of the southern region, and there are strong regional differences between the two regions. Based on the SBM model, Yang and Wang believes that it is necessary to further explore its influencing factors on the basis of environmental efficiency analysis [4]. Li et al. explored the factors influencing environmental efficiency through regression analysis [5]. The results show that the industrial structure of Beijing has the greatest impact on urban environmental efficiency. Through the literature review, we can find that although the research on urban environmental efficiency has been relatively rich, there are still some deficiencies. Firstly, scholars used to evaluate the urban environmental efficiency on the scale of provinces or regions, which is difficult to reflect the internal heterogeneity in the process of regional development. For example, there may be great differences in the environmental efficiency of different regions in an administrative region, and there is still a lack of comparative research on cities in the same administrative region. Secondly, DEA is used alone. Therefore, how to evaluate the urban environmental efficiency from the perspective of time dynamics has become the focus of research. Based on this, on the basis of previous studies, this paper selects 17 prefecture level cities in Henan Province as the research object, calculates the environmental efficiency of each prefecture level city in Henan Province from the static and dynamic perspectives by using DEA model and Malmquist index, in order to provide the basis for the formulation and adjustment of urban environmental management policies in Henan Province. Data envelopment analysis (DEA) was first proposed by Charnes et al [6]. It is a nonparametric method for evaluating multiple input and multiple output decision making units (DMUs) with the same type. The mathematical expression of BCC (variable returns to scale) model is shown in equation (1): Where X is the input, y is the output, n is the number of decision-making units, ε is the efficiency of DMU, λ is the index combination coefficient of DMU, slack variable s- and surplus variable s+ reflect the insufficient output and redundant input. Where, ε = 1 means that DEA is valid, otherwise, DEA is invalid. According to the comprehensive efficiency (TE) and pure technical efficiency (PTE), the scale efficiency (SE) can be obtained, and the relationship between them is SE = TE / PTE.",
    "In the process of evaluating the urban environmental efficiency, the comprehensive efficiency reflects the maximum output of environmental governance effect under the input condition of given environmental factors, or the minimum input of environmental factors at a given output level. It is a comprehensive evaluation of capital, technology, human resources and other aspects. The technical efficiency reflects the influence of scientific management decision-making method on environmental efficiency in application. Scale efficiency reflects whether the investment in the process of environmental management is reasonable, whether there is redundancy or insufficient investment scale, which is the gap between the actual scale and the optimal scale. DEA model reflects the static efficiency of urban environmental management, but cannot reflect the dynamic change of environmental efficiency over time. Therefore, Caves [7] put Malmquist index into the calculation of TFP. Malmquist index well reflects the structural motivation of efficiency change, thus forming a DEA Malmquist based static and dynamic efficiency evaluation analysis method. Malmquist index measures the change of productivity in the two periods before and after. The results are expressed by total factor productivity (TFP). This value shows the comprehensive productivity of each factor in the production system, which can be divided into two parts: technical progress efficiency (techch) and technical efficiency (effch), and technical efficiency (effch) can be further divided into pure technical efficiency (Pech) and scale efficiency (sech). As shown in equation (2) When TFP > 1, TFP has improved; when TFP < 1, TFP has deteriorated. In the context of urban environmental efficiency measurement, technical efficiency reflects the advantages and disadvantages of each city's management methods and structure, and whether the decisions made are correct. Technical progress efficiency reflects the process of continuous development and improvement of technology and the replacement of old technology by new technology. This paper takes 17 prefecture level cities in Henan Province as the empirical research object, and the time span of data is 7 years (2010-2016). According to the principles of scientificity, accessibility and representativeness of the data, the input index adopts the index system selected by Yang and Min (2019), that is, the input of capital, labour and energy elements. In the selection of output indicators, with the continuous improvement of global awareness of environmental protection, the research focus of scholars in related fields is not only on the expected output, but more and more focused on the adverse output related to the production process. Therefore, the selection of output indicators in this paper includes two aspects: expected output and unexpected output. In this paper, the real GDP converted from 2007 is selected as the expected output, and the emissions of industrial sulfur dioxide and industrial wastewater are selected as the unexpected output. In the selection of input factors, the total amount of fixed assets investment of each city represents the capital input, the number of employees at the end of the period represents the labor input, and the total social electricity consumption of each city represents the energy input. The index system is shown in Table 1. Input indicators the total fixed assets investment, the number of employees at the end of the period, the total social electricity consumption and the output index regional GDP, industrial sulfur dioxide emissions and industrial wastewater emissions are all derived from 2011-2017 In the Yearbook of China Urban Statistics, Henan statistical yearbook and the annual statistical bulletin of different cities, the missing values of individual cities are filled by interpolation. for 44.44%. Compared with 2010, Kaifeng and Pingdingshan have become DEA invalid, Luoyang and Sanmenxia become DEA effective States, indicating that the environmental governance of Luoyang and Sanmenxia has been improved to a certain extent. The comprehensive efficiency of Xinyang is the lowest, which is 0.758. Based on the BCC model with variable scale compensation in DEA model, the comprehensive efficiency, pure technical efficiency and scale efficiency of 18 prefecture level cities in Henan Province in 2010, 2013 and 2016 are calculated by deasorverpro5 software, as shown in Table 2. According to table 2, from the perspective of comprehensive efficiency, the average comprehensive efficiency of Henan Province in 2010 is 0.864, with a high efficiency level, but it does not reach DEA effective state (the efficiency value is 1.000, which is effective). There are 4 prefecture level cities with comprehensive efficiency reaching the effective state (Kaifeng, Pingdingshan, Xuchang and Zhoukou), accounting for 23.53% of all prefecture level cities, and the technical efficiency and scale efficiency of these cities are effective; the rest 76.47% of the prefecture level cities are DEA invalid, among which the efficiency value of Xinxiang with the lowest environmental efficiency is only 0.609, and the distance to the effective state is relatively large.",
    "In 2013, the average comprehensive efficiency of Henan Province was 0.9, slightly higher than that in 2007, indicating that the improvement of environmental governance was not strong. Among them, 4 prefecture level cities (Luoyang, Xuchang, Sanmenxia and Zhoukou) have achieved DEA effectiveness, accounting In 2016, the average comprehensive efficiency of Henan Province was 0.905, which was slightly higher than that in 2012. There are 6 prefecture level cities (Zhengzhou, Kaifeng, Luoyang, Xuchang, Sanmenxia and Zhoukou) are DEA effective, accounting for 35.29%. Compared with 2010 and 2013, Zhengzhou is an effective city for DEA. The comprehensive efficiency of Shangqiu is the lowest, which is 0.778. By comparing the comprehensive efficiency values of 2010, 2013 and 2016, it can be seen that the comprehensive efficiency of all levels of Henan Province is above 0.600, among which, the environmental efficiency of two prefecture level cities (Xuchang and Zhoukou) has reached DEA effectiveness in three years, which are located in the central region of Henan Province. Therefore, compared with other regions of Henan Province, the central region of Henan Province has achieved more effective economic development and coordinated development of environmental protection. From the perspective of technical efficiency, the number of cities with the best technical efficiency is more than the number of cities with the best comprehensive efficiency and scale efficiency. It shows that the technical elements of most cities have higher efficiency in use, that is, the management level is higher and the management structure is more reasonable. The technical efficiency of 5 prefecture level cities has been effective for three years, which are Zhengzhou, Luoyang, Hebi, Xuchang and Zhoukou, most of them are located in the central region of Henan Province, which has also become the reason why the comprehensive efficiency of central and western regions is at a high level. From the perspective of scale efficiency, the average scale efficiency gradually increased from 0.944 in 2010 to 0.966 in 2016, indicating that the allocation of input factors in Henan Province is becoming reasonable, basically reaching the best combination. The current configuration structure is in a reasonable state It needs to be maintained. From the current situation of scale efficiency, Nanyang and Shangqiu were in a state of decreasing scale efficiency in 2016. If they do not change their configuration structure, the investment needed for environmental governance should be reduced appropriately. Malmquist index can reflect the dynamic trend of environmental efficiency in different periods. The environmental technology efficiency changes (effch), technology progress changes (techs), pure technology efficiency changes (Pech), model efficiency changes (sech) and TFP of different levels of cities in Henan Province are calculated by using deap2.1 software.Table 3 shows the annual total factor productivity and its decomposition of environmental efficiency in Henan Province from 2010 to 2016. From the perspective of technology progress change (techh), only the technological progress change in 2014- 2016 is greater than 1, and the rest is less than 1 per year. The average technological progress efficiency is 0.991, which is in a declining state, which indicates that Henan Province needs to improve the application of new technology and the development of new products. At the same time, it can be seen that the change trend of technological progress is generally consistent with that of TFP. It can be seen that technological progress is the main factor affecting the change of TFP. Therefore, Henan Province should pay attention to the technological progress, and introduce new technologies to improve the ability of independent innovation. Based on panel data of 17 prefecture level cities in Henan Province from 2010 to 2016, DEA with variable scale compensation is used in this paper The model and Malmquist index measure and study the environmental efficiency of different cities in Henan Province from the static and dynamic perspectives, and draw the following conclusions: First, the results of static evaluation of environmental efficiency show that the overall environmental efficiency of Henan Province is higher, the technical efficiency is slightly reduced, and the scale efficiency is steadily improved. From the comprehensive efficiency perspective, the comprehensive efficiency values of 2010, 2013 and 2016 are at a high level. From the perspective of technical efficiency, the level of technical efficiency has been improved slightly with time. Henan Province needs to keep and steadily improve the efficiency of technology to an effective state. From the perspective of scale efficiency, the average scale efficiency in 2010-2016 has gradually increased to 0.966, indicating that the allocation of input factors in Henan Province tends to be reasonable.",
    "Second, the results of dynamic evaluation of environmental efficiency show that the total factor productivity of Henan Province increases, and the technological progress has a great influence on the TFP. In the 7 years from 2010 to 2016, the overall efficiency of Henan Province has been on the rise. The trend of technological progress is consistent with that of TFP in general. Improving the level of technological progress is key to the improvement of overall environmental efficiency in Henan Province. Therefore, Henan Province should not only maintain the steady improvement of management level, but also actively introduce new technology, improve the ability of independent innovation, and pay attention to the scientific and reasonable digestion of new technology. At the same time, Henan Province should take measures to improve the environmental efficiency according to the different types of cities."
]