[
    "This study utilized census data from Henan Province for the years 2000, 2010, and 2020 to investigate the spa- tiotemporal evolution of population aging, deﬁned by the proportion of the population aged 65 and above. Employing spatial analysis techniques such as spatial autocorrelation and the standard deviation ellipse, the research mapped out the progression and distribution of aging demographics. Furthermore, the study delved into the inﬂuencing factors of aging using an optimal parameters-based geographical detector. Results indicate a deepening degree of population aging in Henan Province, transitioning from an adult type to an old type structure. There is a marked positive spatial correlation among counties, with high-value aging areas initially decreasing, then increasing, and notably spreading from the central to the central and southern regions of the province. The center of gravity for population aging, speciﬁcally around Changge City and Xuchang City, exhibits a trajectory moving southeast before shifting northwest. Factor detection reveals that in 2000, 2010, and 2020, the elderlydependencyratiopredominantlyinﬂuencestheagingtrend,withexplanatorypowersof88.4%,87.9%,and 90.9%, respectively. Interaction analysis indicates that the interaction between the old-child ratio and the elderly dependencyratio has a strong explanatory power for the aging patterns in Henan Province, reaching 97.3%, 97.0%, and 97.4%, respectively. Citation: LIU Dingming, DU Jiusheng, WANG Yu, et al. Study on the Spatiotemporal Pattern Evolution and Inﬂuencing Factors of Population Aging in Henan Province[J]. Journal of Geodesy and Geoinformation Science, 2024, 7(2): 80-94. DOI: 10.11947/j.JGGS. 2024. 0206. aging society in 1999, marked by a swiftly grow- ing elderly population and deepening levels of ag- ing[1-3]. The Seventh National Census revealed that by the end of 2020, China’s population stood at 1.411 billion, with 13.50% aged 65 and above. Ex- cluding Tibet, all 30 provinces in Chinese mainland have entered an aging phase. Forecasts by the Na- tional Health Commission anticipate that during the “14th Five-Year Plan” period, the elderly pop- ulation aged 60 and above will surpass 300 million, constituting more than 20% of the total popula- tion, signifying a shift to moderate aging. By ap- proximately 2035, this demographic is expected to According to the “World Social Report 2023” by the United Nations, the global elderly population aged 65 years and above is projected to reach 1.6 billion by 2050, highlighting population aging as a significant challenge of the 21st century. As the world’s most populous nation, China became an ∗ Foundation support: Humanities and Social Science Project of the Ministry of Education (NO. 17YJCZH041) First author: LIU Dingming(2000— ), male, majors in geographic information technology and application. exceed 400 million, or more than 30% of the popu- lation, indicating severe aging. Given these trends, addressing the challenges of an aging population is imperative. from the sixth national census, with few incorpo- rating the seventh census. Additionally, the spatial scope of these studies is generally restricted to city- level or higher, with minimal focus on county-level details. Particularly in Henan Province—a major hub for population and labor export—issues such as population decline, aging, and low birth rates vary markedly across different areas. Given the re- cent relaxation of China’s fertility policy and the introduction of local governmental measures, the demographic landscape in Henan is evolving. Con- sequently, it is crucial to investigate the spatiotem- poral dynamics and determinants of population ag- ing in Henan at the county level to understand these changes comprehensively. To address and proactively tackle the challenges posed by an aging population, the Fifth Plenary Ses- sionofthe19thCPCCentralCommitteeexplicitlyad- vanced the implementation of a national strategy to activelyrespondtopopulationaging,elevatingittoan unprecedentedlevelofnationalstrategicimportance. Subsequently, the “Fourteenth Five-Year Plan” un- veiled in 2021, suggested the formulation of a long- termstrategicplanforpopulationdevelopment.This planincludeskeymeasuressuchasoptimizingfertility policies, enhancing population service systems, and fostering the long-term balanced development of the population. Addressing the aforementioned challenges, this study adheres to established standards and com- bines insights from prior research to categorize the types of population age structures. Utilizing ag- ing data from three temporal benchmarks—2000, 2010, and 2020—across various districts and coun- ties of Henan Province, this study examines the spatiotemporal distribution and evolutionary pat- terns of population aging. Furthermore, it employs an optimal parameters-based geographical detector model to quantitatively assess the drivers behind the spatial differentiation of aging across the region. The findings aim to furnish precise recommenda- tions to mitigate the impacts of population aging and promote the development of aging policies.",
    "In light of an aging population, researchers pre- dominantly investigate the spatial distribution, in- fluencing mechanisms, and evolutionary trends of the aging population. Utilizing diverse analytical methods like cloud models, population centers of gravity, and exploratory spatial data analysis, re- searchers have clarified the spatiotemporal char- acteristics of population aging across provincial, urban, and county levels[4-6]. To further explore the spatial patterns of aging, various mathemati- cal methods including spatial econometric models, classical regression, geographically weighted regres- sion, and ordinary least squares have been employed to analyze the causes behind regional aging dispari- ties, focusing on demographic, economic, social, and environmental dimensions[7-9]. Additionally, stud- ies integrating population forecasting, grey mod- els, econometric approaches, and the Wolfson index model have shed light on regional aging variations and trends[10-12]. Moreover, researchers in gerontol- ogy and related fields provide strategic recommen- dations for managing aging populations and allocat- ing pension resources by exploring pension security issues, including pension modes and services[13-15]. Henan Province, situated in the central and east- ern regions of China, spans from 31◦23′ to 36◦22′ N latitude and 110◦21′ to 116◦39′ E longitude. As a significant hub for economic activities, agri- culture, and population, Henan covers an area of 167 000 square kilometers and supports a resident population exceeding 99.36 million. The adminis- trative structure includes 17 prefecture-level cities, 21 county-level cities, 82 counties, and 54 municipal districts (Fig. 1). The province has a substantial Despite extensive research on population aging across various regions in China, significant gaps re- main. Predominantly, studies have relied on data These alterations were meticulously recorded. Uti- lizing the administrative division map from the National Catalogue Service for Geographic Infor- mation (2021), we accurately updated the aging population data and associated influencing factors to align with the current administrative bound- aries. For instance, Yanshi City in Luoyang was re-designated as Yanshi District without altering its administrative boundaries. Similarly, Mengjin County and Jili District in Luoyang were consol- idated into Mengjin County. Due to substantial re- gional variations post-adjustment in some county- level divisions, certain data points were missing; hence, the data presented corresponds only to the current names of the zones. elderly population base with a rapidly increasing growth rate. By the end of 2022, the proportion of residents aged 65 and older surpassed 14%, indicat- ing Henan’s transition into a deep aging society. To address regional variations in the definition of the elderly population, this study adheres to the age threshold of 65 and above as specified by the World Health Organization and applicable regional laws. For a more intuitive representation of population aging across each district and county, this study utilizes the classification criteria established by the United Nations in 1956 and related research[16-19]. Accordingly, the aging population is segmented into six categories based on the proportion of the el- derly: young, adult type I, adult type II, old type I, old type II, and old type III (see Tab. 1). These clas- sifications enable a detailed analysis of demographic Thisstudyutilizedpopulationagingdatafromeach county in Henan Province for the years 2000, 2010, and 2020, sourced from the fifth, sixth, and seventh national census data, respectively, as documented in “China Population Census By County”. Additional datawasobtainedfromthestatisticalbureausofeach districtandcounty.Influencingfactorsrelatedtopop- ulation, economy,and society were primarily derived from the statistical yearbooks of the respective cities and counties for each period, national economic de- velopment bulletins, and the “China County Statis- tical Yearbook”. Where data gaps existed, interpola- tion methods were employed to estimate missing val- ues,ensuringcomprehensivecoverageandcontinuity inthedataset. From 2000 to 2020, several administrative changes occurred within certain districts and coun- ties, including renaming of counties to districts, city to district transitions, and the merger or reor- ganization of county-level administrative divisions. lation trend. Population migration, defined as the long-term or permanent movement of individuals between regions, also significantly affects demo- graphic composition and aging. The migration rate is calculated by the difference between the end- of-year permanent population change rate and the natural growth rate, due to limitations in data availability. Furthermore, a higher proportion of the population aged 55∼64 in the previous census indicates a greater number of potential elderly in- dividuals, which can significantly impact the rate of population aging over the subsequent decade. Therefore, factors such as birth rate, mortality rate, migration rate, and the proportion of the popula- tion aged 55∼64 in the previous census are likely correlated with the spatial distribution of popula- tion aging.",
    "Population aging, a social phenomenon driven by changes in demographic structures, is influenced by various factors including demographic, economic, social, and environmental elements. To determine its impact on the age structure, this study reviews the literatures to identify factors previously used and assesses their data availability and relevance. Consequently, the factors influencing aging in each district and county of Henan Province are catego- rized into two main groups[20-23]: direct and indi- rect factors. Demographic factors comprise birth rate, death rate, migration rate, and the percent- age of the population aged 55∼64 in the previous census. Economic factors include Gross Domestic Product (GDP) and general public budget expen- diture. Social factors encompass the percentage of women of childbearing age (15∼49), number of beds in health institutions, aged-child ratio, and elderly dependency ratio. In total, 10 influencing factors are analyzed (see Tab. 2). Economic factors. The regional GDP serves as an indicator of both the overall economic strength and the development speed of a region. General pub- lic budget expenditure, on the other hand, reflects the government’s financial commitment to public services. Higher levels of regional GDP and public budget expenditure enable local governments to en- hance social security systems more effectively. This, in turn, allows the elderly population to access im- Demographic factors. The relative changes in birth and mortality rates directly influence the de- gree of population aging within a region. An in- creased birth rate results in a higher proportion of the younger population, which consequently re- duces the aging rate. Conversely, a decrease in proved life and medical care services, pensions, and other support systems, which may indirectly reduce mortality rates, boost birth rates, and attract mi- grants. Consequently, there may be a correlation between regional GDP and public budget expen- diture and the spatial differentiation observed in population aging. Social factors. The aged-child ratio, which com- pares the number of elderly individuals aged 65 and above to the number of young individuals aged 0∼14, provides insights into the age structure of the regional population. A higher aged-child ratio sug- gests a smaller incoming population and potentially deeper aging. The elderly dependency ratio, which is the proportion of the elderly population aged 65 and above relative to the working-age population aged 15∼64, indicates the level of support available for the elderly in the region. Regions with a lower old-age dependency ratio may offer better care for the elderly, possibly leading to increased life ex- pectancy and impacting the region’s aging dynam- ics. Additionally, the proportion of women of child- bearing age (15∼49) can influence regional birth rates, thus affecting aging trends; while the number of beds in health institutions reflects the availability of medical resources. In regions with adequate med- ical resources, the elderly are more likely to have access to suﬀicient medical care, potentially extend- ing life expectancy. Therefore, factors such as the aged-child ratio, elderly dependency ratio, the pro- portion of women of childbearing age (15∼49), and the number of beds in health institutions are likely to exhibit spatial correlations with population ag- ing patterns. Where IG and IL represent the global Moran’s index and local Moran’s index, respectively; N denotes the total number of counties in Henan Province; xi and xj are the aging degrees of re- gions i and j, respectively; ¯x is the average value; and wij is the spatial weight matrix of regions i and j. The global Moran’s index, which varies from -1 to 1, is a measure of spatial correlation among data points. A score of -1 indicates a high negative corre- lation, suggesting that nearby locations are dissim- ilar, whereas a score of 1 denotes a high positive autocorrelation, indicating similarity among neigh- boring areas. Local spatial autocorrelation can be categorized into five types: not significant, high- high cluster, high-low cluster, low-high cluster, and low-low cluster. The standard deviational is a classical method used to analyze the directional characteristics of spatial distributions. This tech- nique involves plotting the standard deviation ellipse for the aging population across various districts and counties of Henan Province. By doing so, it allows for the calculation and analysis of several key indicators such as the distribution range of the ellipse, the lengths of the long and short half-axes, the azimuth angle, and the center of gravity. These measurements provide a quanti- tative explanation of the distribution orientation, the positional shifts of the center of gravity, and the overall dynamics of population aging within the region. The main parameters of the ellipse are computed using the following equations Moran’s index is a widely utilized method in spatial autocorrelation statistics that evaluates the spatial correlation and heterogeneity of spatial el- ements. By calculating the global Moran’s I and local Moran’s I, this method quantifies the degree Where q is the factor explanatory power, with a range of [0,1]. The larger the q value, the greater the explanatory power of the influencing factor on the spatial distribution of population aging; h de- notes the stratification of explanatory variables or explained variables; Nh and N represent the num- ber of units in the layer h and the entire region, respectively; σh and σ2 denote the variance within layer h and the Y value of the entire region, respec- tively; SSW and SST are the intra-layer variance and the total variance of the entire region, respec- tively.",
    "Where (xi,yi) represent the spatial location co- ordinates of the population aging ellipse; wi is the weight; (Xw,Yw) are the weighted average barycen- tric coordinates; θ is the azimuth angle of the el- lipse; and σx and σy are the standard deviations of the x-axis and y-axis of the ellipse, respectively. Geodetector[29-31] is a spatial analysis tool used to detect spatial heterogeneity and identify the un- derlying driving forces. Traditional applications of Geodetector often rely on the manual selection or comparison of multiple classification methods to discretize continuous variables, a process that can be highly subjective and potentially yield subopti- mal discretization results, thus affecting the relia- bility of the detection results. To address these lim- itations, this study employs an optimal parameters- based geographical detector[32-34]. Utilizing the GD package in R, this approach incorporates five clas- sification methods—equal interval, natural break- point, quantile, geometric interval, and standard deviation—to discretize spatial data. The config- uration yielding the highest q value is selected to ensure the most effective spatial discretization. Additionally, interaction detection was employed to assess the combined influence of two indepen- dent variables on population aging. By comparing the q values from the interaction of different in- fluencing factors with the results from single-factor detections, it is possible to determine the presence and extent of interaction between the two factors. This includes identifying five types of interactions: nonlinear weakening, single-factor nonlinear weak- ening, bivariate enhancement, independence, and nonlinear enhancement. Utilizing the optimal parameters, the factor de- tector within the geographic detector is employed to investigate the explanatory power of various influ- From 2000 to 2020, the age structure of the popu- lation in each district and county of Henan Province showed a progressive change, and the degree of ag- ing gradually deepened. To visually represent the types of population ag- ing at the county level in Henan Province, ArcGIS software was employed for graphical processing, as illustrated in Fig. 2. the evolution of population age structure types at the county level across three temporal milestones: 2000, 2010, and 2020. The types of population age structures observed during these years are system- atically summarized in Tab. 3. In 2000, adult type II and old type I were the predominant age structures in Henan Province. Adult type II was primarily found in border ar- eas including Anyang, Hebi, Sanmenxia, Nanyang, and Xinyang. Conversely, old type I was concen- trated in central regions such as Kaifeng, Xuchang, Pingdingshan, and Luohe, with Luohe Wuyang County uniquely reaching old type II. In 2000, the population age structures within Henan Province predominantly fell into adult type II and old type I categories, accounting for 38.6% and 49.4% of the population respectively across var- ious regions. Meanwhile, adult type I comprised 10.1% of the population. By 2010, the geographic extent of adult type II had narrowed, focusing mainly in northern ar- eas like Jiyuan, Anyang, and Hebi. The presence of old type I expanded significantly to cover most of the province. Old type II counties were dis- persed in southern locales including Xinyang, Zhu- madian, Shangqiu, Luohe, and Pingdingshan. The adult type I nearly disappeared, indicating a deep- ening of aging across the province. In 2010, the number of old type I counties in- creased significantly, accounting for 74.1 %, and the number of adult type I and II counties decreased significantly, accounting for only 0.6 % and 13.9 %, and there were no young counties. By 2020, the types of old type II and old type III in the county are dominant, accounting for 48.1 % and 46.8 %, respectively. The number of adult type II and old type I counties is significantly reduced, reduced, remaining only in districts such as Erqi, Guancheng Hui, and Jinshui. Old types II and III became dominant, covering the vast majority of the province. Specifically, old type II was mostly in the western and northern parts, while old type III was concentrated in the southeastern region. From 2000 to 2020, the aging process in Henan Province’s districts and counties spread from the southeast across the entire province, with the northwest areas exhibiting relatively slower changes in aging intensity. Using global autocorrelation, the study assesses the degree of spatial autocorrelation in population aging across various regions of Henan Province, with the results detailed in Tab. 4. Furthermore, lo- cal autocorrelation analysis is employed to examine the spatial clustering characteristics of population aging at the county level. This detailed analysis is visually represented in Fig. 3.",
    "According to Tab. 4, the P values for the pop- ulation aging in the counties of Henan Province for the years 2000, 2010, and 2020 were all less than 0.01, and the corresponding Z values exceeded 2.58. These results indicate that the P values pass the 99.9% confidence level test, demonstrating sta- tistical significance. Furthermore, Moran’s I values were positive and showed an increasing trend over these years, indicating a significant and strengthen- ing spatial positive correlation in aging among the county populations of Henan Province. This trend suggests that the spatial aggregation of aging pop- ulations has been intensifying from 2000 to 2020. According to Fig. 3, in 2000, the areas with high levels of population aging were primarily located in the central region of Henan Province, whereas the low-value areas were concentrated around Anyang City in the north and Sanmenxia City in the west. Baofeng County in Pingdingshan City exhibited an abnormal high-low (H-L) value, with low-high (L- H) abnormalities noted in Weidu District, Yuanhui District, and Yicheng District. Zhumadian, and Xinyang, located in the central and southern parts of the province. Low aging val- ues were prevalent in Sanmenxia, Luoyang in the west, and in northern regions such as Anyang, Hebi, Xinxiang, and Zhengzhou. H-L abnormalities were identified in Beiguan District of Anyang City, with L-H abnormalities scattered in Xiangfu District, Zhumadian Yicheng District, and Xinyang Xixian County. To delve deeper into the spatial distribution di- rection and the changing characteristics of popula- tion aging across various regions of Henan Province, standard deviation ellipses were constructed for the years 2000, 2010, and 2020 using ArcGIS software. The ellipses were weighted according to the degree of population aging in each district and county. Rel- evant parameters were then calculated and are pre- sented in Tab. 5 and illustrated in Fig. 4. In 2020, the high-value areas of aging remained concentrated in the central and southern regions but expanded in number compared to 2010. Low- value areas were mainly observed in the eastern parts of Zhengzhou City. Notably, there were no H- L abnormalities, and the only L-H abnormal area was in Zhumadian Yicheng District. Over the period from 2000 to 2020, the stan- dard deviation ellipse, indicating the distribution of population aging, consistently covered the cen- tral region of Henan Province. During these years, the ellipse exhibited a counterclockwise rotation from a “northeast-northwest” orientation. Notably, the area of the ellipse expanded from 75 188 km2 in 2 000 to 79 893 km2 in 2020. This expansion suggests that the rate of population aging within the inner counties encapsulated by the ellipse was slower compared to those on the periphery. From 2000 to 2020, the number of high-value ag- ing areas initially decreased but later increased, con- solidating significantly in the central cities of Henan Province, particularly by 2020 in the central and southern regions. Conversely, the number of low- value areas initially increased then decreased, with their spatial aggregation intensifying over time. To explore the driving forces behind the spatial distribution of population aging in Henan Province from 2000 to 2020, data from ten influencing fac- tors across demographic, economic, and social di- mensions for 2010 and 2020 were analyzed. These factors were treated as independent variables, with the aging status of each district and county serv- ing as the dependent variable. However, due to the absence of previous census data on the proportion of the population aged 55∼64 in 2000, only nine influencing factors were utilized for this period. Us- ing an optimal parameters-based geographical de- tector, each continuous variable was classified us- ing five methods: equal interval, natural breakpoint, quantile, geometric, and standard deviation classi- fication. The number of categories was set between four and nine to identify the parameter combina- tion yielding the highest q value, as detailed in Tab. 6. Furthermore, the oblateness of the ellipse in- creased, with the most significant change occur- ring between 2000 and 2010. This adjustment is attributed to an accelerated aging process in south- eastern Henan, which influenced the directional shift of the ellipse. Between 2010 and 2020, the change in ellipse oblateness markedly decreased, in- dicating a stabilization in the rate of aging across the various regions during this decade.",
    "Between 2000 and 2020, the center of gravity for population aging in Henan Province has continu- ally shifted within the boundaries of Changge City, Xuchang City. The trajectory of the ellipse’s cen- ter of gravity initially moved towards the southeast and subsequently shifted towards the northwest. the influence of various factors on the spatial dif- ferentiation of aging. In this analysis, a higher q value indicates greater explanatory power of the in- fluencing factors. Factors that yielded a p value less than 0.05 were considered significant in terms of their explanatory power. These significant factors are detailed in Tab. 7. tion of the population aged 55∼64 in the previ- ous census (0.361), the migration rate (0.359), the proportion of women of childbearing age (15∼49) (0.253), the number of beds in health institutions (0.216), GDP (0.214), and general public budget ex- penditure (0.188). Conversely, the birth rate, mor- tality rate, and aged-child ratio were found to have no significant explanatory power for the degree of aging, each showing a p value close to 1. Dur- ing this period, both direct and indirect factors played substantial roles in influencing the spatial distribution of population aging. Among the di- rect factors, the proportion of the population aged 55∼64 in the previous census and the migration rate demonstrated considerable impact, explaining nearly 36% of the spatial distribution of aging. The elderly dependency ratio, an indirect factor, pro- vided the strongest explanatory power, accounting for 87.9% of the spatial variability in aging. The in- fluences of other factors were comparatively minor. The reason for this may be that with economic de- velopment during this decade, cities in the south of Henan, such as Xinyang and Zhumadian, and the eastern city of Shangqiu, have experienced a signif- In 2000, the factor detection analysis, ordered by decreasing q values, identified the elderly depen- dency ratio (0.884), the aged-child ratio (0.428), the mortality rate (0.349), and general public budget expenditure (0.294) as having significant impacts on the spatial distribution of aging. Specifically, the elderly dependency ratio and the aged-child ratio had the most prominent explanatory power. The explanatory power of other factors was com- paratively low, with a small number of overall sig- nificant influencing factors identified. This may be attributed to the central region’s developed econ- omy, concentrated population, and relatively well- established social security system, which are more attractive for the elderly to settle. In 2010, seven influencing factors from the fac- tor detection analysis were identified as statisti- cally significant. Ranked from the highest to the lowest based on their q values, these factors were: ing to significant population migration and changes in the age structure of the population in these ar- eas. Meanwhile, the central region, due to its prox- imity to Zhengzhou, is experiencing rapid economic development, with a large elderly population base, and the degree of aging remains severe. These fac- tors spatially lead to a widening of the standard deviation ellipse of population ageing and a shift to the southeast direction. For 2010, the interaction detection results mostly indicated nonlinear enhancement and two-factor enhancement, with a few instances of nonlinear weakening observed. These interactions notably in- crease the explanatory power of the factors affecting population aging. This analysis reveals that popu- lation aging in Henan Province is influenced not by a single factor, but by the complex interplay of multiple factors. In 2020, all examined factors demonstrated sig- nificant influence on the spatial differentiation of aging in Henan Province’s counties. Notably, the elderly dependency ratio had the highest explana- tory power with a q value of 0.909. This was fol- lowed by the proportion of women of childbearing age (15∼49) with a q value of 0.607. The general public budget expenditure had the lowest signifi- cant q value at 0.343. Among direct factors, the proportion of the population aged 55∼64 in the pre- vious census exhibited the most substantial impact, explaining 51.5% of the spatial distribution of popu- lation aging. Among indirect factors, the elderly de- pendency ratio continued to provide the strongest explanatory power for aging distribution. During this period, the degree of aging has gradually deep- ened across all regions due to factors such as ag- ing, low birth rates, and non-marriage. Although each factor significantly affects the degree of ag- ing, the elderly dependency ratio has the highest explanatory power for the spatial distribution of aging. Consequently, the standard deviation ellipse of population aging continues to expand, yet it re- mains concentrated in the central region of Henan Province, with its center of gravity tending to be stable.",
    "The interaction results for all three periods, 2000, 2010, and 2020, are most significantly and con- sistently explained by the interaction between the elderly dependency and aged-child ratio, reaching 97.3%, 97%, and 97.4%, respectively. Notably, the elderly dependency ratio exhibited strong explana- tory power when interacting with other factors. This indicates a robust correlation between the de- gree of aging and variables such as the proportion of juveniles, the working population, and support capabilities. In 2000, interactions involving the birth rate and mortality rate among the direct factors were more pronounced when compared with other fac- tors. However, from 2010 to 2020, the only direct factor that consistently showed significant interac- tion with others was the proportion of the popu- lation aged 55∼64 in the previous census. Inter- actions involving other direct factors during these years were relatively moderate. By 2010, some in- teraction results even indicated a nonlinear weaken- ing. This trend suggests that the influence of these direct factors on aging has become less significant over time compared to other more impactful fac- tors. The interaction of influence factors for the years 2000, 2010, and 2020 was analyzed using interaction detection methods (Fig. 5). The results for 2000 and 2020 indicate that the interactions between two fac- tors generally show nonlinear enhancement or two- factor enhancement, without any weakening effects. This suggests that the interaction between factors This study utilized data from the fifth, sixth, and seventh national population censuses to investi- gate the spatial patterns of population aging across Henan Province’s various districts and counties. By incorporating different age types and employing various spatial analysis techniques, the research provided a detailed understanding of these pat- terns. Additionally, the study utilized an optimal parameters-based geographical detector model to quantitatively assess the factors influencing the spa- tial differentiation of aging within the region. ing trends compared to other factors. However, re- garding social factors, the aged-child ratio and the elderly dependency ratio stand out for their signifi- cant and consistent impact across both factor detec- tion and interaction analyses."
]