[
    "Abstract. The growth of modern service sectors is of great theoretical and practical significance for promoting the sound and rapid growth of national economy, all-round social progress, and realizing national strategies such as building an innovative country and a harmonious society. The modern service sectors in the world is playing an increasingly important role and showing a new development trend. Under the background of international service sectors transfer, there is great potential for China to develop modern service sectors. Based on SWOT, this article analyzes the development strategy of modern service enterprises. Taking Henan Province as an example, based on the analysis of the present situation and existing problems of modern service sectors in Henan Province, this article systematically analyzes the environment in which modern service sectors in Henan Province develops. This article mainly discusses the advantages and disadvantages of internal resources, opportunities and threats of external environment in Henan Province. And put forward a set of operational and strategic industry consolidation scheme of modern service sectors. It is hoped that the research in this article can play a certain reference role in the optimization and upgrading of modern service sectors in China. The concept of modern service sectors is relative to the traditional service sectors, and it has been highly concerned in China in recent years [1]. According to the current popular classification method, the modern service sectors generally include three parts: (1) The modern service sectors formed by the traditional service sectors through technological transformation and upgrading and business model reengineering [2]. (2) With the rapid growth of information network technology, the emerging service sectors. (3) With the process of international industrial transfer and division of labor, the new service format emerged from the differentiation and fission of the primary and secondary industries. With the rapid growth of economy, the service sectors, especially the modern service sectors, has gradually become the pillar force to speed up the adjustment of economic structure, and to a great extent, it supports the growth of regional GDP [3-4]. As far as the region is concerned, developing modern service sectors is not only an important way to break through the bottleneck of resource constraints, reduce environmental pressure and promote the transformation of economic growth mode, but also conducive to attracting employment, improving people's quality of life and speeding up the construction of a harmonious society, which is of great significance to the rise of service sectors in China. Modern service sectors are a sunrise industry in the new era, a new impetus for the sustainable growth of modern economy and society, and an important standard to measure the level of local economic growth [5]. With the rise of the new scientific and technological revolution, knowledge, technology and information contribute more and more too economic growth, and the service sectors, which is produced by IT and modern management, is becoming the main growth point of the world economy. Modern service sectors are playing an increasingly important role and showing a new development trend [6]. The capital competitiveness of service sectors is to make use of and give full play to its advantages, gather external capital, revitalize internal capital, expand the scale effect and scope effect of superior enterprises and management technologies, and realize the overall structure optimization and benefit maximization of social capital through the functions of movement, attraction and encouragement of service sectors capital [7]. Therefore, it is an inevitable choice for upgrading and optimizing the economic structure, seizing the competitive advantage and establishing the regional leading position to adopt the development strategy suitable for the provincial conditions to vigorously promote the growth of modern service sectors [8]. Based on this, this article analyzes the development strategy of modern service enterprises based on SWOT. Taking Henan Province as an example, this article discusses the advantages and disadvantages of internal resources, opportunities and threats of external environment in Henan Province. And put forward a set of operational and strategic industry consolidation scheme of modern service sectors. It is hoped that the research in this article can play a certain reference role in the optimization and upgrading of modern service sectors in China. Driven by economic globalization, the global industrial structure has changed from \"industrial economy\" to \"service economy\". The overall scale of the global service sectors has reached more than 30 trillion dollars, and the world has entered the era of service economy [9]. The service sectors have become an important engine of worldwide economic growth, the main motive force of the sustained and rapid growth of modern times, and its prosperity has become an important symbol of economic modernization. At present, the economic focus of major developed countries in the world has begun to shift to service sectors, and the proportion of service sectors in employment and China's gross domestic product has been increasing. The research on the global development law shows that the service sectors is changing from labor-intensive to knowledge-intensive, and the modern service sectors with high knowledge and technology gradually occupies the leading position of the service sectors, and is gradually becoming the leading industry and pillar of economic growth [10]. The new economy represented by IT provides tool support and development power for modern service sectors, and plays a core supporting role in the process of the emergence and growth of modern service sectors. At the same time, the growth of modern service sectors has also promoted the further extensive application of IT in China. Modern service sectors and IT have formed a close interactive relationship. The core of modern service sectors industry consolidation is knowledge integration. Figure 1 shows the knowledge flow of modern service sectors chain.",
    "At present, with the rapid growth of the world's urban economy, the dominant position of cities in a country's socio-economic and political fields has become more and more obvious, and the comprehensive strength of cities has gradually become the concentrated embodiment of a country's comprehensive strength. The construction and growth of the city cannot be separated from the promotion of modern service sectors. Modern service sectors are the main growth point of sustained economic growth, the main channel to relieve employment pressure, the strategic measure to enhance international competitiveness and the only way to build a well-off society in an all-round way. Therefore, the growth of modern service sectors has important practical and far-reaching historical significance for promoting the sound and rapid growth of the national economy, all-round social progress, and realizing the national strategies of building an innovative country and a harmonious society. Under the modern environment, it is an inevitable choice for upgrading and optimizing the economic structure, seizing the competitive advantage and establishing the regional leading position to adopt the development strategy suitable for the provincial conditions to vigorously promote the growth of modern service sectors. This section will mainly use SWOT analysis to analyze the development trend of modern service sectors in Henan Province. SWOT analysis model is shown in Figure 2. Advantages: (1) Unique spatial location advantages. Located in the heart of the whole country, Henan is an important transportation hub connecting the east with the west, connecting the south with the north, and its location advantage is very obvious. (2) Henan is rich in tourism resources. This area has a profound historical and cultural heritage, numerous places of interest, magnificent natural landscape and rich tourism resources. Some tourism resources are international famous brands. (3) The cause of science and education has developed rapidly. In recent years, the investment in science and technology in Henan Province has increased by a large margin, and the ability of development and innovation has been further improved, providing necessary intellectual support for the growth of modern service sectors. Generally speaking, the capital competitiveness advantage of modern service sectors in Henan Province is highlighted in its scale management ability. From the empirical results, its scale management ability ranks second among the central provinces, indicating that the capital scale of modern service sectors in Henan Province is in a relatively leading position in the central region. Disadvantages: (1) The proportion of modern service sectors is low and its development is slow. The added value of modern service sectors accounts for a low proportion of the province's GDP, the growth of modern service sectors is insufficient, and the industrial level needs to be improved urgently. (2) The urbanization rate is low, and the development space of modern services is limited. Modern service sectors need the lowest agglomeration effect. Only when the population reaches a certain scale can it achieve profitability. The low level of urbanization in Henan Province hinders the rapid growth of modern service sectors. (3) The supply of talents is insufficient, especially in the high-end modern service sectors. The shortage and outflow of high-level service talents is serious, which restricts the growth of modern service sectors. Opportunities: (1) Henan Province has successively issued a series of policies and supporting measures to support the growth of modern service sectors. Government policies have provided a guarantee for the growth of modern service sectors. (2) Accelerate the adjustment of industrial structure and vigorously promote the rapid growth of modern service sectors. The acceleration of globalization of service sectors creates conditions for Henan Province to undertake the transfer of modern service sectors. (3) The global financial crisis is conducive to the growth of modern service sectors, and it is also the requirement of sustainable development and low-carbon economic growth. In the 21st century, the international transfer of service sectors has become an important feature of economic globalization. Located in the middle of Henan Province, with the gradient transfer of China's economy from east to west, it has the best geographical location to connect the east with the west and accept the gradient transfer of economy. Therefore, it has become the first choice for foreign investors and eastern merchants to invest, and attracting investment in modern service sectors is an important part of Henan's overall investment.",
    "Threats: (1) Low-income level and insufficient service consumption potential. The income of consumers is the main driving force to support the growth of modern consumer service sectors. The income level of residents in Henan Province is low and the growth rate is slow. The low income level of residents will inevitably restrict the consumption demand of the service sectors and affect the rapid growth of the service sectors, especially the modern service sectors. (2) Facing strong competition from other provinces. In the process of developing modern service sectors, Henan province will inevitably compete fiercely with other provinces in obtaining industrial resources, seizing market opportunities and expanding market space. However, this article holds that the capital competitiveness of modern service sectors in Henan Province will have great room for improvement in the future. This is also consistent with the current situation that many international and domestic well-known modern service enterprises have invested in Henan and are optimistic about Henan. Although China's modern service sectors has made rapid development in recent years, compared with its proportion in the national economy, the growth of modern service sectors still lags behind the growth of the national economy, with imperfect service support system and lack of international competitiveness. Based on the above research and discussion on the growth of modern service enterprises, this article puts forward the following development strategies: (1) The industrial chain of modern service sectors has to face not only policy barriers caused by industry regulation, but also regional entry barriers caused by local protection. Therefore, in the process of carrying out industry consolidation, it is necessary to perfect the regulation of industry entry and relax industry access. Reduce the requirements for foreign businesses' business scale and registered capital, relax the restrictions on their business varieties, business objects and business areas, and implement the principle of national treatment in relevant policies. Encouraging the establishment of new modern service sectors can better optimize the industrial structure of service sectors, enhance the industrial connotation of modern service sectors and continuously increase the proportion of modern service sectors in the national economy. (2) Give appropriate policy guidance from changing ideas, standardizing industries and supporting them properly, and actively adjust the industrial structure. Vigorously develop emerging service industries, foster and develop a number of large service enterprises with strong strength, competitiveness and influence, and comprehensively enhance the competitiveness of service industries. Speed up the formulation and implementation of industry technical standards and specifications, advocate standardization and honest service, gradually introduce foreign advanced service technologies and standards in some industries, and speed up the construction of credit evaluation system, thus driving the improvement of the overall level of service sectors. (3) The sum of the core competitiveness of different node enterprises constitutes the core competitiveness of the industrial chain. Therefore, node enterprises should continuously consolidate their position in the industrial chain, so that industry consolidation can be continuously optimized. At the same time, the government should provide a good policy environment for the application of IT, encourage fair competition, and establish and improve a series of competitive policies and regulations. (4) The growth of modern service sectors with high technology content and knowledge-intensive needs a large number of specialized talents. At present, the shortage of talents is an important factor that restricts the growth of modern service sectors in China. Therefore, it is necessary to vigorously cultivate talents needed by modern service sectors and introduce experienced senior management talents from home and abroad. At the same time, we will strengthen the ability of independent innovation and form a technological innovation system with enterprises as the main body. This is the key to improve the core competitiveness of China's IT industry. In addition, it is necessary to strengthen the risk education of modern service to industry consolidation, and improve the awareness and ability of predicting and preventing integration risks, so as to avoid and reduce integration risks to the greatest extent and ensure the maximization of integration utility. Modern service sectors are of great significance for China to enhance its sustainable development ability and speed up its economic growth. With the growth of economic globalization, modern service sectors have become the leading industry to promote economic growth. Promoting industry consolidation is the cornerstone of the modern service sectors to complete the structural optimization and upgrading, so as to enhance the development space. Therefore, China must vigorously develop the service sectors as the main direction to promote sustained economic growth and structural optimization; According to the problems existing in the growth of service sectors, find out the restrictive factors, and take various measures to promote the development level of service sectors and promote the coordinated and stable growth of China economy. Based on SWOT, this article analyzes the development strategy of modern service enterprises. Taking Henan Province as an example, based on the analysis of the present situation and existing problems of modern service sectors in Henan Province, this article systematically analyzes the environment in which modern service sectors in Henan Province develops. This article mainly discusses the advantages and disadvantages of internal resources, opportunities and threats of external environment in Henan Province. And put forward a set of operational and strategic industry consolidation scheme of modern service sectors. Through the organic combination of government, industry, learning and research and the optimal allocation of social resources, cultivating a number of leading enterprises in modern service technology and services with international competitiveness can promote the formation of national innovative service system, the establishment of business chain of modern service sectors and the promotion of traditional service sectors. In addition, the integration of modern service sectors chain not only promotes the theoretical research of modern service sectors, but also provides theoretical guidance for the transformation and upgrading of China's modern service sectors, thus enhancing its development space. It is hoped that the research in this article can play a certain reference role in the optimization and upgrading of modern service sectors in China."
]