[
    "Huali Chang1, Hai-Lu You2,3,4, Li Xu1, Waisum Ma5, Diansong Gao1, Songhai Jia1, Mengli Xia1, Jiming Zhang1, Yu Li1, Xirui Wang1, Di Liu1, Jie Li1, Jianhua Zhang1, Lili Yang1 and Xuefang Wei6 Tooth replacement rate is an important feature related to feeding mechanics and food choices for dinosaurs. However, only a few data points are available for sauropod dinosaurs, partially due to rarity of relevant fossil material. Four somphospondylan sauropod species have been recovered from the Lower Cretaceous Aptian–Albian Haoling Formation in the Ruyang Basin, Henan Province of central China, but no cranial material has been reported except for a single crown. Here we report the discovery of the rostral portion of a left dentary with replacement teeth in its first five alveoli. Comparative anatomical study shows the partial dentary can be assigned to a memberofearlydivergingsomphospondylans.Thenon-destructivetoothlength-based approach to estimating tooth formation time and replacement rate is adopted here. The estimated tooth replacement rate is 76 days, faster than that of Brachiosaurus (83 days) and much lower than typical late diverging lithostrotian titanosaurians (20 days). Thus, this discovery adds an intermediate tooth replacement rate in the evolution of titanosauriform sauropods and supports the idea that evolution of tooth replacement rate is clade-specific. This discovery also provides more information to understand the Ruyang sauropod assemblage, which includes one of the most giant dinosaurs to have walked our Earth (Ruyangosaurus giganteus). Tooth replacement rate is an important feature related to feeding mechanics and food choices for polyphyodonty animals, including dinosaurs. For example, Camarasaurus and Diplodocus have tooth replacement rates of about one tooth every 62 days versus 35 days, How to cite this article Chang H, You H-L, Xu L, Ma W, Gao D, Jia S, Xia M, Zhang J, Li Y, Wang X, Liu D, Li J, Zhang J, Yang L, Wei X. 2021. Relatively low tooth replacement rate in a sauropod dinosaur from the Early Cretaceous Ruyang Basin of central China. PeerJ 9:e12361 http://doi.org/10.7717/peerj.12361 respectively, and this difference could help understand the coexistence of these gigantic herbivorous in the Upper Jurassic Morrison Formation land ecosystem (D’Emic et al., 2013). Tooth replacement rate is defined as the time required to replace one tooth in a given alveolus, and can be calculated by subtracting tooth formation times for successive teeth within one tooth family (D’Emic et al., 2013; Erickson, 1996). The non-destructive tooth length-based approach to estimating tooth formation time and replacement rate developed by D’Emic et al. (2013) has proven useful to estimate two different types of sauropod teeth, the broad-crowned and narrow-crowned, and this method is adopted Within dinosaurs, tooth replacement rates have been shown to be clade-specific, with elevated rates in abelisaurid theropods, hadrosaurid ornithischians, and diplodocoid and late diverging titanosauriform sauropods (D’Emic et al., 2019). Among titanosauriforms, tooth replacement data are only available for three taxa: two for its earliest-diverging clade, the Brachiosauridae (92 and 83 days for Giraffatitan and Brachiosaurus, respectively), and one (20 days) for a Late Cretaceous titanosaur (D’Emic & Carrano, 2020; D’Emic et al., 2013; Kosch et al., 2014). Here, based on the discovery of one rostral portion of a left dentary and associated replacement teeth, a 76 days tooth replacement rate is estimated for a somphospondylan titanosauriform sauropod from the late Early Cretaceous of Ruyang Basin,HenanProvince,centralChina. Therefore,thisdiscoveryprovidesmoreinformation to understand the evolution of tooth replacement rate in titanosauriform sauropods and enrich our knowledge on the Ruyang gigantic sauropod assemblage. Henan Natural History Museum 41HIII-0016 (Field number: KLR08-1): rostral portion of a left dentary with replacement teeth in the first five alveoli, discovered from Shaping Village,LiudianTown,RuyangCounty,HenanProvince.LowerCretaceousAptian–Albian, Haoling Formation (Xu et al., 2010) (Fig. 1). The partial dentary was computed tomography (CT) scanned at the Institute of Geology, Chinese Academy of Geological Sciences, Beijing, China, using a Nikon XTH225ST scanner. The specimen was scanned at 170 kV and 115 uA. The final data set contains 1,743 image slices (1,743 × 2,007 pixels). The CT data was imported into digital visualization software Avizo (version 9.1) for image processing. Dental elements were segmented using segmentation editor in Avizo, and 3D surface models were then imported to Blender (version 2.79) for optimization. The raw CT scan and reconstructed 3D models of 41HIII-0016 are available on MorphoSource at the following DOIs: 10.17602/M2/M369117, 10.17602/M2/M365661, The non-destructive tooth length-based approach to estimating tooth formation time and replacement rate developed by D’Emic et al. (2013) is adopted here. The incremental line thickness is assumed to be similar to those of Camarasaurus and Diplodocus. Tooth formation time (days) is calculated according to the algorithm derived for Camarasaurus, y =−0.0078x2 + 2.6771x + 109.44, where x = tooth length, and tooth replacement rate is Figure 1 Geographical and geological maps showing the location of 41HIII-0016 and four sauropod species in the Lower Cretaceous Haoling Formation of Ruyang Basin, Henan Province, central China. Full-size DOI: 10.7717/peerj.12361/fig-1 The 123 mm long partial left dentary includes the first five alveoli and the symphysis (Figs. 2 and 3). The preserved portion slightly increases in height rostrally, from 84 to 95 to 101 mm across the fifth, third and first alveoli, respectively, and its thickness does not change generally, approximately 2.6 times taller than broad. In dorsal view, it arches outwardly slightly, and judging from the orientation of the symphysis, it would direct around 45 degrees caudolaterally. The vertically oriented symphyseal surface is oblong, 101 mm height, and narrows slightly ventrally, from 31 mm at its dorsal edge to 21 mm at the ventral end. The symphysis protrudes slightly more ventrally than the remainder of the dentary, and bears a rostrodorsal-caudoventrally oriented groove, which can be see clearly in medial view.",
    "In lateral view, a row of six large foramina is roughly aligned at the level of the ventral margin of the lateral plate, two associated with the first alveolus and the other four each with the following four alveoli, respectively. The lateral plate is about 15 mm high above the level of the dorsal edge of the paradental plates on the medial surface. Caudal to the first alveolus, a shallow horizontal depression extends at the level just ventral to the md-height. On the medial surface three foramina can be seen along the paradental groove, which is positioned higher than the mid-height of the medial surface and parallel to the dorsal edge. This groove does not extend onto the first alveolus. Below the paradental groove, the Meckelian groove is evident on the ventral end, starting from the second alveolus and increasing in height caudally. Figure 2 Photograph of 41HIII-0016, the rostral portion of a left dentary. (A) Lateral. (B) Medial. (C) Caudal. (D) Rostral. (E) Dorsal. (F) Ventral views. Note fragment tooth in alveolus 5 has lost after the CT scanning. No fully erupted teeth are preserved. Replacement teeth can be seen medially on alveoli 1, 3, 4 and 5, respectively. In dorsal view, the boundary of alveolus 1 is as long as wide, but in subsequent alveoli, their widths decrease slightly. CT scanning reveals the typical alternating pattern of tooth replacement, and two replacement teeth can be seen in alveoli 1, 2, and 3, respectively. Based on their lengths, four developmental stages can be cataloged, and stages 1 and 3 can been seen in alveoli 1 and 3, while stages 2 and 4 can been seen in alveoli 2 and 4 (Table 1). Based on the longest replacement teeth in alveoli 1 and 3, the crown is not expanded mesiodistally, and about the same width at its junction to the root. The crown keeps its width for its basal half and tapers apically. The cross section around the mid-height crown is D-shaped, with a strongly convex labial side and roughly flat lingual side. Apicobasally extended ridges can be seen along the midlines on both the labial and lingual surfaces, and the lingual one is more developed than the labial one. Figure 3 Reconstruction 3D mode of the replacement teeth in 41HIII-0016. (A) Medial with bones in shadow. (B) Medial. (C) Lateral. (D) Dorsal views. Scale bar equals 1 cm. Abbreviations: Alv, alveolus; Sta, developmental stages based on tooth lengths; L, tooth length; TFT, tooth formation times; TRR, tooth replacement; W, tooth maximal width. Tooth formation time (days) is calculated according to the algorithm derived for Camarasaurus. (y = −0.0078x2 +2.6771x+ 109.44; x = tooth length). The tooth shape, the broadly arched, more U - than V -shaped rostral portion of the mandible in dorsal view, and the large size show this rostral portion of the dentary belongs to a sauropod dinosaur (Rauhut, 2003; Upchurch, Barrett & Dodson, 2004; Barrett & Upchurch, 2007). Among sauropods, the lack of ‘‘chin’’ at the rostroventral corner of the dentary, non-transversely oriented rostral portion of the dentary, and less than three replacement teeth per alveolus indicate it does not belong to Diplodocoidea (Upchurch, Barrett & Dodson, 2004; Whitlock, 2011; D’Emic & Carrano, 2020). The mesiodistally narrow and D-shaped cross section of the crown, lack of denticles along the mesial and distal margins, and closeup of the rostral end of the Meckelian groove to the symphysis show the specimen probably belongs to a member of titanosauriforms (Upchurch, Barrett & Dodson, 2004; D’Emic & Carrano, 2020). Titanosauriformes includes Brachiosauridae and Somphospondyli, and the latter includes some early diverging taxa and Titanosauria, with Lithostrotia as the well-known latest diverging clade (Carballido et al., 2017; Mannion et al., 2019). The lack of the typical pencil-like narrow teeth with cylindrical crown cross section indicate the Ruyang dentary probably belongs to an early diverging non-lithostrotian titanosauriform. ThelowerjawanddentaryteethofBrachiosaurusaltithorax (USNM5730)weredescribed (D’Emic & Carrano, 2020). The height and width of its right symphysis is 109 mm and 38 mm, respectively, similar to that of the Ruyang dentary (101 mm and 31 mm). Their general morphology and tooth shape are similar, but measurements of the dentary teeth show interesting differences. Among the comparable teeth in the first three alveoli, the Brachiosaurus teeth are more robust than the corresponding ones in the Ruyang specimen. For example, the length/width of the first stage in alveoli 1, 2, and 3 of Brachiosaurus are 64/16, 39+/21, and 60/20, while those of the Ruyang specimen are 82.9/16.3, 60.4/16.2, and 81.1/16.0 (mm). Therefore, the Ruyang teeth are more slender and closer morphologically to the teeth of late diverging titanosauriforms than the Brachiosaurus-clade. Moreover, the tooth replacement rates of the Ruyang teeth (see below) are faster than that of the Brachiosaurus but slower than the late diverging titanosauriforms, such as the Rio Negro specimen (D’Emic et al., 2013).",
    "Euhelopus is a relatively small sauropod, and the height of its symphysis is about half that of the Ruyang symphysis (Poropat & Kear, 2013; Wilson & Upchurch, 2009; Wiman, 1929).The symphysealsurfaceistiltedapproximately10degreesfromvertical inEuhelopus, while it is about vertically oriented in the Ruyang specimen. No replacement dentary teeth are known in Euhelopus, and their erupted teeth contact each other slightly. Although no erupted teeth are preserved in the Ruyang dentary, they would have not contacted to each other as suggested by the narrow replacement teeth. The Euhelopus crown expands slightly mesiodistally immediately adjacent to the root then tapering apically, while the Ruyang crown is almost parallel-sided around the crown-root junction in labial view. The Ruyang crown also lacks the rounded boss-like structure on the lingual part of each mesial and distal margin close to the base of the crown, a distinctive feature of Euhelopus. Figure 4 Tooth length increasing a step by ∼20 mm in successive four developmental stages while their width keeping roughly the same in 41HIII-0016. (in mm). LiaoningotitansinensisfromtheEarlyCretaceousYixianFormationofLiaoningProvince is represented by a well-preserved skeleton including low jaw (Zhou et al., 2018). Based on its preliminary description, the downturned rostral portion of the dentary strongly curves medially, forming an almost vertical angle to the rest of the dentary in dorsal view, and the symphyseal surface is not vertically oriented. The dentary teeth do not contact to each other but with a large spacing about one tooth wide, and the cross section of the narrowed crown are elliptical. Phylogenetic analysis posits Liaoningotitan between Euhelopus and Lithostrotia (Zhou et al., 2018). The Ruyang taxon seems to be in a position latter diverging than Euhelopus but earlier diverging than Liaoningotitan based on its tooth morphology and not strongly curved rostral portion of dentary in dorsal view. Tooth lengths have been used to estimate their formation times with two algorithms derived from Camarasaurus and Diplodocus, respectively (D’Emic et al., 2013). Because the Ruyang taxon does not belong to a diplodocoid, the algorithm for Camarasaurus is used here. Interestingly, lengths increase by a step of around 20 mm, from an average of 20.7 to 39.3 to 60.6 to 82.0 mm from stages 1 to 4 in 41HIII-0016 (Fig. 4). Accordingly, the tooth formation times increase from 161.5 to 202.6 to 243.0 to 276.6 days (Table 1). This implies a speedup of daily tooth length increase with growth. Another aspect is that the widths of the teeth increase slightly with growth, and in the last two stages, their widths are about the same (around 16.2 mm), although their lengths increased 21.4 mm. The average tooth replacement rate of the Ruyang taxon is 76 days. This is much slower than that of the unnamed late diverging titanosauriform (20 days) and Diplodocus (34 days), slower than that of Camarasaurus (62 days), faster than that of Brachiosaurus (83 days) and Giraffatitan (92 days), and much faster than that of Mamenchisaurus (98 days) (D’Emic & Carrano, 2020; D’Emic et al., 2013). This is in consistent with our suggestion that the Ruyang taxon is mostly likely to be a member of early diverging Somphospondyli, but not a member of brachiosaurid. Foursauropodspecies,Huanghetitan ruyangensis(Lü et al., 2007),Ruyangosaurus giganteus Lü et al., 2009a, Lü et al., 2009b Xianshanosaurus shijiagouensis Lü et al., 2009a, Lü et al., 2009b, and Yunmenglong ruyangensis (Lü et al., 2013), have been recovered from the Lower Cretaceous Aptian-Albian Haoling Formation in the Ruyang Basin, Henan Province of central China. They include some of the most giant sauropods known worldwide so far. For examples, the width of the dorsosacral centrum of Ruyangosaurus giganteus reaches 68 cm, a single rib of the holotype of Huanghetitan ruyangensis reaches 2.93 meter long, and the femoral length of Yunmenglong ruyangensis is 192 cm. Xianshanosaurus shijiagouensis is a medium-sized sauropod, with a femoral length of 126 cm. All have been considered as early diverging somphospondylans (Lü et al., 2014). Except for a partial tooth crown found in the same quarry of Xianshanosaurus, no other cranial and dental material has been reported for the Ruyang giant sauropod assemblage (Lü et al., 2009a, Lü et al., 2009b). The worn crown of Xianshanosaurus does show some similarity with 41HIII0016 described here. For example, both are narrow and have a lingual ridge. Phylogenetic analysis has recovered Xianshanosaurus as a relatively late diverging titanosauriform, close to Titanosauria (Mannion et al., 2019). If 41HIII-0016 has a close relationship with Xianshanosaurus, their features of dentary and dentition, such as narrowedcrownandrelativefastertoothreplacementratethanthatofBrachiosaurus,would represent an intermediate stage in the evolution of titanosauriforms. This partial dentary could represent the latest diverging sauropod among the Ruyang sauropod assemblage.",
    "This is the first discovery of cranial material with teeth for the late Early Cretaceous Ruyang giant sauropod assemblage. Comparative anatomical study suggests the partial dentary as a member of early diverging titanosauriforms. CT scan-based 3D model of its replacement teeth allowed an estimation of 76 days for its replacement rate, which is intermediate between those of Brachiosauridae and late diverging titanosauriforms; therefore, tooth replacement rate increases in the evolution of titanosauriform sauropods. This work was supported by the National Natural Science Foundation of China (No. 41688103, 41872021, 41702021), the Strategic Priority Research Program of Chinese Academy of Sciences (No. XDB26000000). Waisum Ma’s participation in this study was supported by UCCL Grant, Universities’ China Committee in London. The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript. The following grant information was disclosed by the authors: The National Natural Science Foundation of China: 41688103, 41872021, 41702021. The Strategic Priority Research Program of Chinese Academy of Sciences: XDB26000000. UCCL Grant, Universities’ China Committee in London."
]