[
    "Research on wilderness area identiﬁcation and distribution of spatial characteristics based on Boolean-multi-indicator evaluation approach —a case study of wilderness areas in Henan Province, China Ren Y, Wang S, Cui B, Ding Y and Cao R (2025) Research on wilderness area identiﬁcation and distribution of spatial characteristics based on Boolean-multi-indicator evaluation approach —a case study of wilderness areas in Henan Province, China. Front. Environ. Sci. 13:1650454. doi: 10.3389/fenvs.2025.1650454 © 2025 Ren, Wang, Cui, Ding and Cao. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. 1School of Architecture and Urban Planning, Henan University of Urban Construction, Pingdingshan, China, 2School of Architecture, Chang’an University, Xian, China, 3School of Water Resources, North China University of Water Resources and Electric Power, Zhengzhou, China Under the background of global anthropocene and climate change, as a key spatial unit to maintain the function of native ecosystems, the study of precise identiﬁcation and spatial distribution of wilderness is of great scientiﬁc value to enhance the effectiveness of rewilding practice. Taking the wilderness in Henan Province as a case study area, the thesis constructs the evaluation index system of wilderness in Henan Province by using the Boolean identiﬁcation and multi- objective evaluation methods based on the analysis of the concept and connotation of wilderness, identiﬁes the spatial distribution of wilderness in Henan Province, and analyzes the current status of protection and the vacancy of protection in Henan Province. The results of the study show that 1) in horizontal space, high-quality wilderness in Henan Province is mainly concentrated in the high-elevation and water-system peripheral areas in the north, west and south, while low-quality wilderness is dominant in the central plains and the periphery of the major transportation arteries. 2) In terms of vertical spatial distribution, the quality of wilderness increases with elevation, with a high proportion of low- and medium-quality wilderness in low-elevation areas, while high-quality wilderness is most distributed in high-elevation (800–1200 m) areas. 3) The area of wilderness in Henan Province is 20,052.60 km2, and the area of wilderness covered by nature reserves is only 3,017.40 km2, i.e., 84.95% of the existing wilderness is not included in the scope of protection, and there is a large area of protection gaps in the wilderness area, which urgently needs to be strengthened in terms of planning, reasonable protection and management. The results of this study can provide a theoretical basis for the development of scientiﬁc and reasonable wilderness protection policies in nature reserves, and are of signiﬁcance in promoting the in-depth development of wilderness protection in Henan Province. Under the dual pressures of the global Anthropocene and climate change, the protection and management of wilderness areas, as the core spatial unit for maintaining native ecosystem functions, has become a key issue in global biodiversity conservation (Carver et al., 2012; Ye et al., 2024). Wilderness land not only carries key ecosystem services such as carbon sequestration and water conservation, but also is an important habitat for endangered species and a key node of ecological corridors (Ceauşu et al., 2015; Watson et al., 2016). However, along with urbanization and infrastructure expansion, the global wilderness area has sharply decreased by 10% in the last 3 decades, with the disappearance rate particularly signiﬁcant in East Asia (Strus and Carver, 2024). As the most populous province in China and the core agricultural area of the Yellow-Huaihai Plain, Henan Province is characterized by a signiﬁcant ecological gradient between the western mountains and the eastern plains, which is not only an important safeguard area for national food security, but also a key transition zone for ecological protection in the Yellow River Basin (Radford et al., 2019). However, the high density of human activities has led to serious degradation of the wilderness in the province, and the existing protected area system has insufﬁcient coverage of the wilderness, which urgently needs to provide a basis for decision- making for the optimization of the regional ecological security pattern through scientiﬁc mapping and analysis of protection vacancies.",
    "Wilderness mapping, as a fundamental work of wilderness protection, has evolved from the Boolean identiﬁcation method to the multi-indicator comprehensive evaluation (MCE) method (Martin and Watson, 2016). Early studies were based on the dichotomous logic of “no human interference”, which delineated wilderness boundaries by excluding elements such as settlements, roads, and agricultural land (Carver et al., 2013), and Zhu et al. (2024) used GIS overlay analysis to generate discrete wilderness patches. However, these methods ignore the continuity and dynamic characteristics of wilderness attributes, and it is difﬁcult to quantify the differences in gradients of human activities (Barrick and Beazley, 1990). At the beginning of the 21st century, the theory of “wilderness continuum” (MCE) emerged, emphasizing that the quality of wilderness is a multidimensional continuum of remoteness (distance from settlements and roads) and naturalness (land use and impacts of man-made facilities) (Xu T et al., 2024), which pushed MCE to become the mainstream method. Promoting MCE as a mainstream approach. Zoderer et al. (2024a) integrated land use, road density and other indicators to construct a national wilderness quality atlas, Cao et al. (2019) introduced vegetation cover to reveal the value of local ecological services, and the hierarchical analysis method (AHP) and entropy weighting optimized the allocation of indicator weights (Leroux and Rayﬁeld, 2014). Xu Z. et al. (2024) quantiﬁed the interference intensity of artiﬁcial facilities in China’s terrestrial wilderness areas by fusing nighttime light intensity with road network density (Luyssaert et al., 2008); at the model level, machine learning algorithms and spatial statistical methods were used to optimize the indicator weight assignments and outlier corrections (Zoderer et al., 2020). Recent advancements in remote sensing and machine learning have signiﬁcantly enhanced the precision and scalability of wilderness mapping. Deep learning models, particularly convolutional neural networks (CNNs), have demonstrated remarkable capabilities in automating land cover classiﬁcation and detecting subtle anthropogenic disturbances from high- resolution satellite imagery. Moreover, the integration of multi- source satellite data (e.g., Sentinel-2, Landsat, and Gaofen series) with machine learning algorithms has enabled the continuous monitoring of ecological indicators such as vegetation health, habitat fragmentation, and ecosystem service dynamics (Din and Mak, 2021; Almeida et al., 2024). These technologies offer promising avenues for improving the accuracy and efﬁciency of wilderness assessment, especially in heterogeneous landscapes like Henan Province. Currently, global and national scale wilderness mapping is relatively mature, but provincial scale studies are still insufﬁcient, especially in regions with prominent ecological-economic conﬂicts (densely populated agricultural provinces), lacking a comprehensive evaluation framework that takes into account the intensity of human activities and the characteristics of the natural background (Zoderer et al., 2024b). Existing studies mostly focus on the static analysis of a single indicator (road density or land use type), and there is insufﬁcient integration of dynamic disturbance factors such as nighttime lighting data and population density, which makes it difﬁcult to accurately reveal the spatial heterogeneity of wilderness in high human disturbance areas (Wang et al., 2024). Therefore, to address the weakness of provincial-scale wilderness mapping, this study takes Henan Province as a typical case study area, and proposes an innovative framework of coupled Boolean-Multi- Indicator Evaluation Method (MIME), This methodology not only enriches the theoretical paradigm of wilderness mapping at provincial scale, but also provides technical support for ecological protection and rewilding practice in high human interference areas. Henan Province (Geographic coordinates: latitude 31°23′- 36°22′N, longitude 110°21′-116°39′E) is located in the core economic zone of central China, belonging to the conﬂuence of the Yellow River Basin and the Huaihe River Basin, with a total area of 167,000 square kilometers. As a national important transportation hub and grain production base, its geomorphological pattern shows a stepped distribution of high in the west and low in the east, with the Taihang Mountains and the Funiu Mountains in the west constituting a mountainous barrier with an elevation of 1,000 to 2,000 m, while the central part of the city is transitioned into a hilly terrace with an elevation of 200–500 m, and the eastern part of the city is extended into the Huanghuai-Huaihai alluvial plain, which accounts for 55.7% of the total area of the province. The land use structure is characterized by “three mountains, one plain and ﬁve ﬁelds,” of which 26.6% are mountains, 17.7% are hills, 55.7% are plains, and water and wetlands account for 3.2%. The unique geomorphological combination has formed a spatial pattern of the “ecological barrier of West Henan Province, urban agglomeration of the Central Plains, and the Yellow-Huaihai Farming Belt” (Figure 1). By the end of 2023, the province’s resident population will be 98.72 million, with an urbanization rate of 57.1%. In the region, the South-to-North Water Diversion Project runs north-south and the ecological corridor along the Yellow River spans east-west, and its land resources carry the dual missions of national food security strategy and ecological civilization construction.",
    "The spatial distribution of wilderness in Henan Province is driven by both natural geography and human activities, showing signiﬁcant heterogeneity. The study shows that the total area of wilderness in the province is 20,052.60 km2, accounting for 12.0% of the provincial area, of which high-quality wilderness (grades 8–10) accounts for only 20.83%, concentrating in the high-elevation area of the western Furniu Mountain system (800–1,200 m), with natural forests, thickets, and undeveloped valleys dominating the area. The biophysical naturalness and landscape connectivity are relatively high; medium-quality wilderness (Grade 4–7) accounts for 68.65%, mostly distributed in hilly transition zones and river corridor buffer zones, and mildly interfered with by agricultural reclamation and road networks; low-quality wilderness (Grade 1–3) accounts for 10.51%, concentrated in the central plain and around urban agglomerations such as Zhengzhou and Luoyang, and subject to urbanization expansion; and the wilderness is also subject to urbanization expansion. Around the urban agglomerations, they are signiﬁcantly affected by the expansion of urbanization and the cutting of trafﬁc arteries, showing fragmentation characteristics. The coverage of wilderness in the existing nature reserve system is seriously insufﬁcient, with only 15.05% of wilderness included in the scope of protection, and there are large protection gaps in key areas such as cross-border ecological corridors in the west and wetlands in the eastern Yellow River ﬂoodplain, which poses a serious challenge to ecological security. The Boolean Identiﬁcation Method (BRM) was employed for the initial screening of wilderness areas due to its established efﬁcacy in delineating wilderness boundaries based on the presence or absence of key human disturbance factors. Its core principle of logical exclusion aligns perfectly with the foundational deﬁnition of wilderness as “areas free from signiﬁcant human modiﬁcation.” The BRM offers distinct advantages of computational efﬁciency, intuitive logic, and transparent decision-making, making it particularly suitable for generating a preliminary “wilderness/non-wilderness” dichotomy at large scales. This step is crucial for deﬁning the spatial domain within which a more nuanced assessment of wilderness quality can be conducted, thereby streamlining subsequent analysis and avoiding unnecessary computations in heavily human- dominated landscapes. However, recognizing the limitation of BRM in capturing the continuum of wilderness quality, it was used primarily for boundary delineation, setting the stage for the multi-criteria evaluation that follows. The speciﬁc methods are as follows: land surface, cultivated land, and composite disturbed areas are sequentially erased with the administrative boundary of Henan Province as the datum, and the potential wilderness patches that are not directly encroached upon by human activities are retained. The core mathematical principle of BRM is based on set theory. The study area (S) is conceptually divided into a set of wilderness (W) (Formula 2) and non-wilderness (N) (Formula 1) areas through a series of spatial exclusion operations: where: A is the set of artiﬁcial surfaces. C is the set of agricultural reclamation areas, Bs is the set of settlement buffer zones, Br is the set of road buffer zones. The buffer generation, a key step, was mathematically implemented using Euclidean distance transformation. For a set of points or lines representing disturbance sources D,the buffer zone B with a radius r (here, r = 1000 m) is deﬁned as (Formula 3): Remote sensing image comparison: Random sampling of initial screening patches (n = 200) was conducted using Google Earth historical high-resolution images (spatial resolution 0.5–1 m)for manual interpretation.The consistency between the interpreted land use type and the initial wilderness classiﬁcation result was recorded, with a preliminary consistency rate of 89.2%. Protected area boundary checking: Nature reserve vector data were overlaid with the initial wilderness patches. Wilderness areas that had been legally designated as core zones or buffer zones of naturereserves (area= 3,017.40 km2) wereexcluded toavoiddouble- counting, and the spatial alignment between the identiﬁed wilderness and existing protected areas was veriﬁed (spatial overlap rate = 15.05%). Field-based ground-truthing:Sampling design: A stratiﬁed random sampling method was adopted to ensure coverage of all wilderness quality grades (low/medium/high) and heterogeneous transitional zones. A total of 300 veriﬁcation plots (1 km × 1 km,consistent with the raster resolution of the MCE evaluation) were set,with 100 plots in each quality grade and 80 plots key speciﬁcally located in transitional zones (accounting for 26.7% of total plots). Based on the International Union for Conservation of Nature (IUCN) deﬁnition of wilderness area (Cao et al., 2019) and the classical literature methodology (Leroux and Rayﬁeld, 2014), the following four types of elements are considered as key human disturbance sources (Table 1): Survey protocol: A 3-person ﬁeld team was organized, equipped with Trimble R10 GNSS (positioning accuracy ±2 cm)for plot boundary positioning,and a digital vegetation surveyor (PlantDoc Pro) for data recording. For each plot, indicators such as land use type, human disturbance intensity, and ecological integrity are measured to validate the accuracy of wilderness classiﬁcation.",
    "Based on the ArcGIS 10.6 platform, the initial screening of wilderness land is realized by a multi-level spatial exclusion method: Exclusion of man-made land surface and cultivated land: using the tool of “select by attribute” to extract the layers of construction (MCE) method was adopted to quantify the continuous gradient of wilderness quality. This approach is motivated by the “wilderness continuum” concept, which recognizes that wilderness quality is not a simple yes/no attribute but a multi-dimensional spectrum inﬂuenced by varying degrees of human inﬂuence and ecological integrity. The MCE framework allows for the integration of multiple indicators representing different dimensions of wilderness (e.g., remoteness, naturalness, ecological integrity), providing a more holistic and nuanced assessment than binary methods. This is especially critical in a province like Henan with signiﬁcant human-nature gradients, where vast areas exist in intermediate state. The MCE enables the identiﬁcation of these an transitional zones and prioritizes high-quality cores for conservation. The speciﬁc methods are: To comprehensively characterize the spatial heterogeneity of wilderness areas, a multi-dimensional evaluation system comprising seven core indicators was constructed. These indicators were organized into three conceptual dimensions:Spatial Remoteness, Physical Naturalness, and Ecological Integrity. Detailed deﬁnitions, conceptual explanations, and computational methodologies for each indicator are summarized in Table 2. This integrated framework allows for a holistic assessment of wilderness quality by capturing both anthropogenic pressure and intrinsic ecological value. Let the study area contain n raster cells, each cell corresponds to m indicators, and construct the raw data matrix, See Formula 4: Hierarchical analysis was validated, a judgment matrix was constructed, a consistency test (CR < 0.1) was passed, and weight assignment was corrected. Recognizing the complementary strengths and weaknesses of the Boolean and MCE methods, a two-stage coupling framework was developed. The motivation for this integration is to leverage the computational efﬁciency and clear boundary delineation of the Boolean method for initial screening, while utilizing the nuanced grading capability of the MCE method to evaluate the quality within those pre-screened areas. This integrated approach (Boolean-MCE) ensures that the wilderness quality assessment is performed only on areas withwilderness potential, enhancingmethodological efﬁciency and accuracy. It effectively bridges the gap between identifying where wilderness is (Boolean) and assessing how wild it is (MCE). The speciﬁc technical workﬂow and logical connection are as follows: The Boolean method was ﬁrst used to exclude non-wilderness areas with signiﬁcant human interference, generating a “potential wilderness pool” that deﬁnes the spatial scope for subsequent MCE evaluation. Convert the vector-based wilderness patches to raster format (1 km × 1 km spatial resolution) using the “Feature to Raster” tool in ArcGIS 10.6, where raster cells are assigned values of 1 (potential wilderness) and 0 (non-wilderness); Apply the raster as a mask to crop all MCE indicator datasets, retaining only cells with value = 1 for subsequent analysis. This step avoids invalid computation of non-wilderness areas and ensures spatial consistency between the two methods. The natural breakpoint method was used to categorize Ci into 10 classes, which were combined into three categories (Table 3). Using the wilderness quality index to draw the wilderness quality map, combined with the multi-indicator evaluation method of wilderness indicator standard values for the comprehensive superposition, and ﬁnally get the wilderness quality index (WQI) of Henan Province, the wilderness quality index calculation method is as follows, See Formula 16: Where: WQI is the Wilderness Quality Index (WQI), the value of which reﬂects the degree of wilderness of any grid unit in the region, and the higher the value, the higher the quality of the grid wilderness; ei is the standard value of the ith indicator after normalization, wi is the corresponding weight of the indicator, and n is the number of wilderness indicators. For the masked potential wilderness raster, the MCE method was applied to quantify wilderness quality using seven core indicators. All MCE indicators were resampled to 1 km × 1 km resolution and projected to GCS_WGS_1984, matching the Boolean-derived raster to eliminate spatial mismatch errors; The fused weights were only applied to the masked indicator rasters, and the Wilderness Quality Index (WQI) was calculated using Formula to avoid bias from non-wilderness interference. Cross-Validation for Integration Consistency. To verify the rationality of the coupling framework, a spatial consistency check was conducted. Overlay high-quality wilderness areas (WQI > 0.7 from MCE) with core wilderness patches (area > 10 km2 from Boolean identiﬁcation). The spatial overlap rate was 83.7%, exceeding the minimum threshold of 80%, conﬁrming that MCE- derived high-quality areas are consistent with Boolean-identiﬁed low-disturbance areas. Error correction: For 15 raster cells with low data were used to reclassify WQI values. To verify the rationality of the coupling framework, a spatial consistency check was conducted. The core wilderness patches from the Boolean method were deﬁned as patches with an area greater than 10 km2. The high-quality wilderness areas from the MCE method were deﬁned as cells with WQI > 0.7.",
    "deviation normalization, wherein lower values correspond to reduced human disturbance. Finally, the integrated wilderness quality index (Ci) was classiﬁed into three standardized tiers using the natural breakpoint method, with thresholds empirically calibrated and veriﬁed through 300 ﬁeld survey plots: regions with Ci ≤ 0.35 were classiﬁed as low-quality wilderness, exhibiting severe human disturbance (ﬁeld-veriﬁed disturbance level 4–5 on a 5-point scale); areas with 0.35 < Ci < 0.70 were categorized as medium- quality, indicating moderate disturbance (level 2–3); and zones with Ci > 0.70 were designated high-quality wilderness, characterized by minimal anthropogenic impact (level 1), as summarized in Table 5. This section provides a detailed elaboration on the standardized operational deﬁnitions and thresholds applied in the Boolean and MCE methods, ensuring reproducibility and transparency. The rationale for selecting these speciﬁc thresholds and standardization procedures is grounded in existing literature and preliminary sensitivity analyses, aiming to maximize the methodological consistency and comparability of results within the speciﬁc context of Henan Province. To ensure the reliability of the wilderness identiﬁcation and classiﬁcation results, a comprehensive accuracy assessment was conducted using a combination of remote sensing interpretation, ﬁeld surveys, and statistical validation methods. The accuracy assessment focused on both the Boolean-derived wilderness patches and the MCE-based wilderness quality grades. Based on IUCN wilderness deﬁnitions (Lin et al., 2016) and regional adaptation (Parisien et al., 2009), key disturbance elements and their standardized thresholds are deﬁned as follows (Table 4): A stratiﬁed random sampling strategy was adopted to ensure representation across all wilderness quality grades (low, medium, high) and geographic regions. A total of 300 sample plots (each 1 km × 1 km, consistent with the MCE raster resolution) were selected, including 100 plots from each quality category and an additional 80 plots located in ecotonal or transitional zones to capture edge effects. To ensure methodological consistency and comparability across all indicators, a standardized computational workﬂow was rigorously implemented. First, all spatial datasets were uniformly preprocessed: they were resampled to a consistent resolution of 1 km × 1 km within the geographic coordinate system GCS_WGS_ 1984 and cropped to the administrative boundary of Henan Province. Subsequently, each indicator underwent a normalization procedure tailored to its ecological implication: positive indicators were processed using extreme deviation normalization, constraining values to a uniﬁed [0, 1] range where higher values denote stronger wilderness attributes; conversely, negative indicators were transformed via reverse extreme Field surveys were conducted between June and October 2023. Each plot was visited by a team equipped with a Trimble R10 GNSS receiver (positioning accuracy ±2 cm) for precise location marking. Land cover type, human disturbance intensity, and ecological integrity were recorded using a standardized protocol. Photographic evidence and GPS tracks were archived for each plot. The accuracy of the wilderness classiﬁcation was evaluated using a confusion matrix, from which the following metrics were derived: Overall Accuracy (OA), Kappa coefﬁcient, Producer’s Accuracy (PA), User’s Accuracy (UA). These metrics were calculated separately for non-transitional and transitional zones to assess spatial heterogeneity in classiﬁcation performance. Discrepancies between model outputs and ﬁeld observations were analyzed to identify systematic errors. Minor adjustments were made to the MCE weightings for transitional zones based on ﬁeld feedback. Local community engagement was conducted to align wilderness protection strategies with regional social needs, avoiding conﬂicts between ecological conservation and livelihood development (Brockington and Schmidt-Soltau, 2004). The consultation process followed the Guidelines for Public Participation in Environmental Impact Assessment (MEP, 2019) and involved three key stakeholder groups: The EIA was implemented in accordance with China’s Environmental Impact Assessment Law (2018 revision) and the Technical Guidelines for Environmental Impact Assessment of Ecological Impact Projects (HJ 19–2022), focusing on mitigating potential environmental disturbances caused by data collection and ﬁeldwork.Key measures included: The 2020 land use/cover change (LUCC) data (30 m × 30 m spatial resolution) of Henan Province was used as the basis, combined with the historical remote-sensing images from the Google Earth Engine platform for data validation and supplementation. Data processing applies the Deﬁne Projection tool of the ArcGIS 10.6 platform to unify the coordinate system of the LUCC dataset, the settlement vector data, and the road trafﬁc network data, and establishes the GCS_WGS_1984 geographic coordinate system datum. Based on the theoretical framework of ecological interference, we focused on extracting two types of interference elements of cultivated land (including paddy land and dry land) and construction land (including urban land, rural settlements, industrial and mining land, and other artiﬁcial surfaces) in the LUCC classiﬁcation system, and at the same time, we integrated the settlement distribution data and the vector data of the main transportation road network.",
    "The spatial analysis technique was used to construct a composite disturbance evaluation model to analyze the 1 km radius circular buffer zones for urban and rural settlements, linear element buffer zones for transportation arteries, and surface element buffer zones for intensive farming areas. After realizing the spatial alignment of multi-source data through raster-vector conversion, the Boolean Overlay algorithm was used to perform spatial joint operations on the three types of disturbance buffers, and non-disturbed areas were extracted through the reverse mask to generate the wilderness patch atlas of Henan Province (Figure 2). It can be seen that the wilderness areas in Henan Province are mainly concentrated in the western and southern parts of Henan, while the area of wilderness areas in the northern and eastern parts of Henan is signiﬁcantly smaller. In this paper, we select the data of urban and rural construction land in China in 2020, ﬁrst convert the surface data to point data, calculate the distance using the Euclidean distance analysis tool and carry out the normalization process, and use the obtained result as the remoteness from the agglomeration. Degree indicator. The higher the value of the raster, the farther the raster is from the core area of human settlement, the intensity of direct interference by human activities is relatively weakened, and the greater the possibility of becoming a natural wilderness area. The osm road dataset in Henan Province was selected, calculated, and normalized using the Euclidean distance analysis tool, and the result was used as an indicator of remoteness from roads. The higher the value, the more distant the raster is from the road and the less likely it is to be affected by human transportation activities. The 2020 land use data were selected and subdivided into six primary types of arable land, forest land, grassland, water bodies, construction land and unutilized land, as well as 22 secondary types based on the standards of Classiﬁcation of Land Use Status (GB/ T21010-2017) and the actual situation of the study area (Figure 3). To quantitatively assess the anthropogenic infrastructure on wilderness areas, we incorporated spatially explicit proxy variables that capture the presence and intensity of artiﬁcial facilities. Key sources of human disturbance were represented using Nighttime Light Data and Population Density raster datasets, in addition to base layers of roads and residential areas. These datasets effectively serve as proxies for anthropogenic pressure, enhancing the sensitivity of our evaluation to human impacts. The spatial distribution of these disturbance factors was analyzed using the Kernel Density tool in ArcGIS, which calculates the magnitude of point or line features per unit area within a neighborhood. After generating kernel density surfaces for each variable, all layers were normalized to a consistent scale [0, 1] using the extreme deviation method. The resulting normalized rasters were then integrated using equal-weighted overlay to produce a composite measure of Naturalness in Appearance. Lower values in this composite indicate minimal inﬂuence from artiﬁcial facilities, corresponding to higher naturalness in visual and structural landscape attributes, and thus better reﬂect the authentic qualities of wilderness. through a multi-dimensional framework. These indicators include: (1) remoteness from settlements, (2) distance from roads, (3) biophysical naturalness, (4) naturalness in appearance, (5) species richness index, (6) ecosystem service index, (7) habitat connectivity index (Martin and Watson, 2016; Carver et al., 2013). The inclusion of ecological integrity metrics—species richness, ecosystem services, and habitat connectivity—extends the conventional evaluation framework beyond spatial remoteness and physical naturalness, thereby providing a more holistic assessment of wilderness value. To mitigate the inﬂuence of varying units and scales across indicators, a logarithmic normalization procedure was applied to the raw data. The weights of these indicators were determined through an integrated weighting approach that combined the Analytic Hierarchy Process (AHP) and the Coefﬁcient of Variation (CoV) method. The AHP weights were derived from expert-based pairwise comparisons structured through a judgment matrix, while CoV weights were calculated statistically based on the variability of each indicator’s values across the study area. the AHP and CoV weights using an arithmetic mean method, resulting in a balanced weighting scheme that incorporates both subjective expert judgment and objective data variability (Table 6). The consistency ratio (CR) of the AHP judgment matrix was 0.0116, which is well below the thresholdvalueof0.10,conﬁrmingacceptableconsistencyandreliability of the pairwise comparisons. The fused weights for each indicator are as follows: Remoteness from settlements (0.1735), Distance from roads (0.1015), Biophysical naturalness (0.311), Naturalness in appearance (0.07), Species richness index (0.1615), Ecosystem service index (0.1565), and Habitat connectivity index (0.09). These weights were subsequently used to compute the Wilderness Quality Index (WQI) for assessing the spatial distribution and conservation priority of wilderness areas in Henan Province.",
    "The spatial distribution of different wilderness qualities in Henan Province can be seen in the wilderness map of Henan Province drawn according to the multi-indicator evaluation method (Figure 4), and the wilderness continuum mapping is drawn through ArcGIS raster computation to visualize the wilderness quality of Henan Province. Among them, the wilderness indicators of distance from the settlement, distance from the road and biophysical naturalness in the wilderness continuum map are signiﬁcantly larger in the western Henan region than in the rest of Henan Province, while in the wilderness continuum map of the road buffer zone, the wilderness indicators in the central Henan region are larger. Referring to the previous research results, the classiﬁcation scheme of 10-level gradient was found to have the best performance, so in this paper, the index data were normalized and the wilderness map of Henan Province was classiﬁed into 10 levels using the natural breakpoint method, and the 10th level represented the highest level of wilderness quality (Radford et al., 2019). In order to deeply analyze the spatial distribution characteristics of the wilderness quality in Henan Province, this paper further subdivided these ten levels into three categories: low-quality wilderness land (Level 1–3), medium-quality wilderness land (Level 4–7), and high-quality wilderness land (Level 8–10) (Carver et al., 2013), so as to achieve a more systematic and detailed analysis. The analysis of the composition structure of each wilderness shows that there are signiﬁcant differences in the areas of low- quality, medium-quality and high-quality wilderness in Henan Province. The grade of medium-quality wilderness is signiﬁcantly larger than that of low-quality and high-quality wilderness, and the area of low-quality wilderness is the smallest. The areas of low- quality, medium-quality and high-quality wilderness were 17,443.99 km2, 113,918.24 km2 and 34,570.95 km2 respectively (Table 7). As can be seen from the classiﬁcation of each wilderness grade (Figure 5A), the wilderness area of wilderness grade 5 is signiﬁcantly higher and much larger than that of the other wilderness grades, with a wilderness area of 41,239.85 square kilometers. The wilderness area of wilderness grade 1 is the lowest, with a wilderness area of only 24.39 square kilometers. The proportions in the total area of wilderness were 10.51%, 68.65%, and 20.83% respectively (Figure 5B), indicating that Henan Province is mainly composed of medium-quality wilderness. The proportion of wilderness natural areas with larger area, higher biophysical naturalness and better integrity within the provincial administrative region of Henan is relatively small. The overall accuracy (OA) of the wilderness classiﬁcation was 91.3%, and the Kappa coefﬁcient was 0.87, which indicates a “substantial agreement” between the model-classiﬁed results and ﬁeld observations. This conﬁrms that the Boolean-MCE method can effectively identify wilderness in Henan Province. The detailed confusion matrix is shown in Table 8. There were signiﬁcant differences in classiﬁcation accuracy between non-transitional zones and transitional zones (Table 9): Non-transitional zones (n = 220 plots): OA = 95.4%, Kappa = 0.92. High-quality wilderness in the western Funiu Mountain area had the highest PA (97.2%) and UA (96.8%), as the natural landscape is less disturbed and consistent with model predictions. Transitional zones (n = 80 plots): OA = 82.5%,Kappa = 0.75, which was lower thannon- transitional zones. high-quality wilderness to low-quality wilderness, is mainly located in the eastern part of Henan Province and the buffer zones of various road networks, which not only retain a relatively good natural ecological base, but also suffer from a certain degree of human activities, and display a unique style between primitive wildness and slight disturbance. wilderness in Henan Province shows signiﬁcant geographical differences, which is manifested in the fact that the quality of wilderness in the northern, western and southern regions is signiﬁcantly better than that in the eastern and central regions, and that the western part of Henan Province - the junction of Sanmenxia City, Luoyang City, and Nanyang City - has a high elevation, complex terrain,andhighvegetationcover.ThewesternpartofHenanProvince- the junction of Sanmenxia City, Luoyang City and Nanyang City - has higher elevation, complex terrain, and high vegetation cover, thus forming wilderness natural areas that are larger in size, with relatively low intensity of human interference, and with well-maintained natural ecology;whilethewilderness areas inthenorthern and southern parts of Henan Province show a “fragmented” and “strip-like” pattern. Low- quality wilderness is mainly distributed in the central plains and the annexes of major transportation routes, showing the distribution characteristics of “continuous” distribution, especially in Zhengzhou City, Xinxiang City and Luoyang City and other economically more developed urban agglomerations, which, due to the concentration of the population, the huge scale of urban construction and the high intensity of human activities, constitute a far-reaching impact on the surrounding natural environment. These cities, due to population concentration, large-scale urban construction, and intense interference from human activities, have had a profound impact on the surrounding natural environment, which has led to a general decline in the quality of natural wilderness. Medium-quality wilderness, as a transition zone from elevation zones (Table 10), low-quality wilderness and medium- quality wilderness in Henan Province are mainly concentrated below 300 m above sea level, accounting for 94.08% and 87.63% of the total area of wilderness of each level, respectively, and high- quality wilderness is mainly concentrated at an elevation of more than 300 m above sea level, accounting for 72.86% of the total area of wilderness, which suggests that the distribution elevation of high- quality wilderness in Henan Province is higher than that of low- and medium-quality wilderness. This indicates that the distribution elevation of high-quality wilderness in Henan Province is higher than that of low-quality wilderness and medium-quality wilderness. From the overall vertical distribution pattern of wilderness (Figure 7), it can be seen that the quality of wilderness increases with the elevation, the distribution rate of low-quality wilderness is the highest in the elevation ≤100 m, which accounts for 67.29% of the area of wilderness at this level; the distribution rate of medium- quality wilderness is the highest in the elevation ≤100 m, which accounts for 62.38% of the area of wilderness at this level; the distribution rate of high-quality wilderness is the highest in the elevation range of 800–1200 m, which accounts for 22.86% of the area of wilderness at this level. The highest distribution rate of high- quality wilderness was found in the 800–1200 m elevation range, which accounted for 22.86% of the wilderness area at this level.",
    "Distribution of wilderness quality classes in Henan Province, based on natural breakpoint classiﬁcation of Ci values. Note: Wilderness quality levels in the ﬁgure: Low wilderness quality (Levels 1–3, Ci ≤ 0.35) is shown in light blue, concentrated in the Central Plains (Zhengzhou-Xinxiang); Medium wilderness quality (Levels 4–7, 0.35 < Ci < 0.70) is shown in green, distributed in the hilly transition zone (Pingdingshan-Nanyang); High wilderness quality (Levels 8–10, Ci > 0.70) is shown in dark red, primarily along the western Niu’ao Mountains (Sanmenxia-Luoyang) and the southern edge of the Nanyang water system; Henan’s provincial boundary is indicated by a solid black line; major urban agglomerations (labeled: Zhengzhou, Luoyang, Xinxiang); nature reserves are shown by dashed black lines, overlapping 15.05% with wilderness areas. into 10 levels using the natural breakpoint method, and the 10th level represents the part of wilderness with the highest quality. In order to deeply analyze the spatial distribution characteristics of wilderness quality in Henan Province, this paper further subdivided these ten grades into three categories: low-quality wilderness (Grades 1–3), medium-quality wilderness (Grades 4–7), and high-quality wilderness (Grades 8–10) (Carver et al.,. 2013). Among them, the area occupied by 8–10 high-quality wilderness in the western part of Henan Province is signiﬁcantly larger, while the quality of wilderness in the other regions is signiﬁcantly smaller. Based on the comparative analysis of the spatial distribution of wilderness and nature reserves in Henan Province, combined with the results of wilderness protection coverage calculation (Table 11), it can be seen that there are 7.20 km2 of low-quality wilderness, 474.42 km2ofmedium-quality wilderness, and2,535.78 km2ofhigh- quality wilderness in the nature reserves; at the same time, 13.89% of the low-quality wildernessis within the protectedarea, and86.11%is outside the protected area. Meanwhile, 13.89% of the low-quality wilderness is within the protected area and 86.11% is outside the protected area; 12.47% of the medium-quality wilderness is within the protected area and 87.53% is outside the protected area, and the protected areas are mainly located in the Danjiang Wetland and the Lushi Giant Salamander; and only 15.66% of the high-quality wilderness is within the protected area, which is located in the Henan Founou Mountain, the Nanyang Dinosaur Eggs Fossil Complex National Nature Reserve, and the Xixia Giant Salamander, which fails to form a complete coverage of high- quality wilderness. Overall, the area of wilderness in Henan Province is 20,052.60 km2, and the area of wilderness covered by nature reserves is only 3,017.40 km2, i.e., 84.95% of the existing wilderness has not been included in the scope of protection, and there is a large area of protection gaps in the wilderness area, which requires urgent enhancement of the planning, reasonable protection and management. This section analyzes the spatiotemporal changes in wilderness area and its quality classiﬁcation from 2000 to 2020, based on the data presented in the accompanying table. Overall, a consistent declining trend in total wilderness area is observed over the two- decade period. Speciﬁcally, the total wilderness area decreased from 24,895.32 km2 in 2000 to 20,052.60 km2 in 2020, representing a net reduction of 4,842.72 km2 and an average annual decline rate of 0.98%. Notably, high-quality wilderness exhibited the most pronounced decrease, both in absolute and relative terms. It declined from 5,218.76 km2 to 3,457.09 km2, with a total loss of 1,761.67 km2 and an annual rate of −2.11%, indicating heightened vulnerability or anthropogenic pressure on the most pristine regions. Medium-quality wilderness also experienced a substantial reduction, falling from 13,689.45 km2 to 11,391.82 km2, a total decrease of 2,297.63 km2, corresponding to an average annual rate of −0.91%. This suggests ongoing degradation or conversion of moderately intact ecosystems. In contrast, low-quality wilderness showed a relatively moderate decline over the entire period, decreasing from 5,987.11 km2 to 5,203.69 km2, with a net loss of 783.42 km2 and an annual rate of −0.66%. Interestingly, between 2010 and 2020, this category registered a slight increase (+0.15% per year), which may indicate regrowth, reclassiﬁcation, or recovery in some degraded areas, though further investigation is needed to conﬁrm the underlying causes. In summary, all wilderness quality classes experienced net losses between 2000 and 2020, with high-quality wilderness undergoing the most rapid decline. These trends highlight the ongoing contraction and qualitative degradation of wilderness areas, underscoring the urgency for enhanced conservation measures (Table 12).",
    "From 2000 to 2020,wilderness change hotspots in Henan Province exhibited spatiotemporal differentiation characterized by “western retreat and eastern expansion. “Degradation and restoration processes dynamically adjusted in response to evolving human activity intensity and policy intervention paradigms (Figure 9). Regarding degradation hotspots: In 2000, moderate degradation (95%conﬁdence level, average annual degradation rate of 1%–2%) centered on Nanyang City in southwestern Henan, forming fragmented patches driven by traditional slope cultivation and early urban sprawl; By 2010, the hotspot shifted to the Luoyang–Sanmenxia belt in western Henan, with Luoyang and Sanmenxia upgrading to moderate degradation (95% conﬁdence level), while Nanyang downgraded to mild degradation (90% conﬁdence level, 0.5%–1%).During this phase, wilderness compression was primarily driven by the westward expansion of the Luoyang metropolitan area and mineral development in Sanmenxia. By 2020, Sanmenxia emerged as a hotspot of severe degradation (99% conﬁdence level, annual degradation rate>2%). The mountain-plain continuum spanning Sanmenxia–Luoyang–Jiyuan suffered complete disruption of wilderness habitat connectivity due to the expansion of the Lianhuo Expressway and the clustering of energy industries. The evolution of restoration hotspots was deeply linked to policy responses:In 2000, southern Henan’s Zhumadian achieved signiﬁcant restoration (99% conﬁdence level, annual growth rate>1%) through the Grain-for-Green Program, enabling wilderness to expand rapidly via natural recovery.By 2010, project effects plateaued, causing it to decline to a non-signiﬁcant zone, while eastern Henan’s Zhoukou–Luohe region retained only scattered mild recovery (90%conﬁdence level, <0.5%); By 2020, Zhoukou in eastern Henan upgraded to a moderate restoration hotspot (95% conﬁdence level, 0.5%–1%) due to the Yellow River Basin’s“reclamation-to-wetland”initiative, South-to- North Water Diversion source area restoration,and agricultural structure optimization. Restoration patterns in eastern and southern Henan shifted from scattered distribution to concentrated contiguous areas. characteristics of wilderness land directly reﬂect the health of the regional ecological security pattern (Ma and Pan, 2024; Tang et al., 2024). In this study, we found that the wilderness in Henan Province is mainly of low to medium quality, accounting for 79.16%, and high quality wilderness only accounts for 20.83%, and shows signiﬁcant geographic differentiation characteristics, and the high quality wilderness (Grade 8–10) is centrally distributed in the western Furniu Mountain system and cross-border river corridors, and this distribution characteristic is signiﬁcantly positively correlated with the altitudinal gradient and the degree of vegetation cover. This distribution feature is signiﬁcantly positively correlated with the elevation gradient and vegetation cover. The high altitude area effectively avoids agricultural reclamation and urban expansion due to the topographic barrier effect and low transportation accessibility, which is consistent with the ﬁndings of the study by Zoderer et al. (2020) in the biodiversity hotspot area. In contrast, the high proportion of arable land and dense road network in the central plains led to the continuous distribution of low-quality wilderness, verifying the assertion of Brockington and Schmidt-Soltau (2004) and Leopold (1921) that “agricultural intensiﬁcation drives wilderness degradation”. It is worth noting that the medium- quality wilderness (Class 4–7) in the eastern Yellow-Huaihuai Plain is mildly disturbed, but its patch shape index suggests that the landscape is severely fragmented, which may become a key transition zone for ecological corridor restoration. This spatial pattern is consistent with the law of “Chinese wilderness quality increases with topographic gradient” proposed by Lesslie (2016), conﬁrming the synergistic mechanism of topographic barriers and human activity intensity on wilderness quality. Vertically, wilderness quality increased with elevation in a stepwise manner. The 72.86% of high quality wilderness was distributed above 300 m above sea level, of which 22.86% was in the 800–1200 m range, which is consistent with the “mountain sheltering effect” found in the Minjiang River Basin (Lesslie and Taylor, 1985), where the topographic complexity limits the extension of mechanized agriculture and infrastructure. The wilderness connectivity index was signiﬁcantly lower in the low elevation area than in other areas due to the cutting of irrigation canals and roads, suggesting that habitat fragmentation needs to be mitigated through ecological The coverage of wilderness in the nature reserve system of Henan Province is seriously inefﬁcient, with only 15.05% of wilderness included in the protection scope, and the protection rate of high-quality wilderness is less than 16%, which is far below the 30% threshold recommended by the IUCN (Mudalige and Carver, 2024; Schwartz et al., 2016). The protection of vacant areas is concentrated in the northern foothills of the western Furniu Mountains and the eastern yellow ﬂoodplain wetlands, which have high naturalness and biodiversity potential, but face the risk of habitat insularity due to the fragmentation of administrative boundaries and the sparse network of protected areas. Compared with the “landscape prioritization model” proposed by Shen et al. (2025), the current conservation strategy in Henan Province fails to effectively identify the importance of transboundary ecological corridors, resulting in a connectivity index of high-quality wilderness patches that is lower than that of similar areas in neighboring provinces. In order to achieve a sustainable balance between ecological security and regional development, wilderness protection in Henan Province needs to break through the traditional “static boundary delimitation” thinking and build an integrated framework of “quality classiﬁcation, dynamic monitoring, and cross-border synergy”.",
    "agricultural intensiﬁcation and urban expansion, exert profound and spatially heterogeneous impacts on wilderness degradation in Henan Province. Agricultural intensiﬁcation—manifested as the consolidation of smallholder farms into large-scale, high-standard farmland—is the primary driver of mild wilderness degradation (annual degradation rate of 0.5%–2%) on the Huang-Huai Plain in eastern Henan. This process not only replaces natural vegetation with monocultures but also introduces high levels of chemical inputs (such as fertilizers and pesticides), irrigation infrastructure, and ﬁeld roads, collectively reducing biophysical naturalness and landscape connectivity. The expansion of agricultural peripheries gradually erodes transitional semi-natural areas, leading to homogenization of land cover and weakened ecosystem functions like water conservation and soil retention. Urbanization and transportation infrastructure expansion have triggered more severe degradation (annual degradation rate >2%), particularly within the Zhengzhou- Luoyang-Xinxiang metropolitan area. Rapid urban sprawl directly consumes vast tracts of natural land, while associated highway networks (such as the expanded Beijing-Hong Kong-Macau Expressway) fragment once-continuous wilderness patches into isolated islands. This fragmentation hinders species migration and gene exchange, undermining complex population dynamics and long-term ecological resilience. Nighttime light data and road density metrics further conﬁrm that areas with high anthropogenic radiation and accessibility correlate closely with wilderness quality loss. Equally noteworthy is that the combined impacts of urban and agricultural expansion often exhibit synergistic effects: urban demand for agricultural products accelerates farmland expansion, while improved rural roads enhance market accessibility, further stimulating land conversion. However, policy interventions have demonstrated potential to curb these trends. Ecological restoration projects—such as the Yellow River Basin Ecological Protection Initiative and the South-to-North Water Diversion Source Area Restoration Project—have facilitated wilderness recovery in the Yellow River ﬂoodplains of eastern Henan and around the Danjiangkou Reservoir. These initiatives typically involve returning farmland to wetlands and forests, establishing ecological corridors, and restricting industrial development. Collectively, they help reverse habitat fragmentation and enhance ecosystem integrity. This demonstrates that integrating wilderness conservation into regional land-use planning and ecological redline policies can slow further degradation, even in highly While the coupled Boolean-MCE framework proposed in this study has shown strong effectiveness in Henan Province—a region characterized by a clear west-east topographic gradient and moderate human disturbance intensity—its direct applicability to regions with more complex topography, heterogeneous climates, or diverse socio-economic conditions is limited, primarily due to the speciﬁc natural and anthropogenic characteristics. For regions with complex topography, the 1 km uniform buffer overestimates human disturbance in areas with intense terrain undulation due to topographic barriers, and the existing elevation grading fails to capture high-altitude features, requiring the introduction of a terrain undulation index to modify buffer distances and revision of elevation intervals to align with regional topographic traits. In climate-heterogeneous regions, the current biophysical naturalness index—biased toward vegetation cover—underestimates wilderness quality in arid areas where sparse desert steppe is a natural feature, and ignores climate-speciﬁc disturbances; thus, it is necessary to adjust biophysical naturalness grading for arid ecosystems and add climate disturbance indicators to the MCE system. For regions with complex socio-economic conditions, the framework’s reliance on nighttime light and road density fails to capture ﬁne-scale urban disturbances, and its classiﬁcation of all agricultural reclamation as “high interference” over-excludes low-impact traditional farming, calling for the integration of POI density and public transit ﬂow into urban disturbance indicators and the addition of a “farming intensity index” to distinguish low-impact agricultural activities. To enhance generalizability, a modular and dynamic optimization path is proposed: retain 4 core indicators as a “ﬁxed module” while adding “regional adaptation modules” based on speciﬁc scenarios, replace ﬁxed AHP-CoV fusion weights with a machine learning- based dynamic weight model trained on regional characteristic variables, and conduct cross-regional veriﬁcation in representative complex regions to establish a scalability adaptation guide—an approach that aligns with the global trend of “regionally adaptive wilderness mapping” and provides a reference for wilderness identiﬁcation beyond Henan Province. While the Boolean-MCE framework provided a robust baseline for wilderness assessment, emerging machine learning techniques offer opportunities for further reﬁnement. For instance, deep learning models can automatically learn hierarchical features from raw satellite imagery, reducing reliance on manually designed indicators and threshold-based rules (Vali et al., 2020). Such approaches are particularly advantageous in capturing non- linear relationships between human disturbance and ecological responses, which are often overlooked in traditional MCE methods (Ha et al., 2020). Moreover, the integration of recurrent neural networks (RNNs) with time-series satellite data could enable dynamic monitoring of wilderness quality, capturing seasonal and inter-annual variations in ecological integrity—a limitation of our plains and the periphery of the main transportation routes are low-quality wildernesses, and medium-quality wildernesses are distributed as transition zone, distributed in the east and the buffer zone of the road network, showing the coexistence of nature and slight disturbance.",
    "The original contributions presented in the study are included in the article/supplementary material, further inquiries can be directed to the corresponding author. YR: Methodology, Writing original draft. SW: Writing – original draft, Software. BC: Software, Writing – review and editing. YD: Data curation, Writing – review and editing. RC: Funding acquisition, Writing – review and editing. The author(s) declare that ﬁnancial support was received for the research and/or publication of this article. The study was supported by the National Natural Science Foundation of China (NSFC) (52309018); Key R & D projects in Henan Province (241111112600) Research and development of key technologies and intelligent devices for real-time and efﬁcient water- fertilizer-drug green coordinated regulation in farmland; Technical Assistance Project (TA-6883): Accelerating Gender Equality in East Asia for an Inclusive and Green Recovery-Water resources management and gender mainstreaming construction in the Yellow River Basin; This project is supported by special fund of Henan Key Laboratory of Water Pollution Control and Rehabilitation Technology (CJSZ2024008) The mechanism of soil"
]