[
    "Abstract. Based on the scientific calculation of agricultural carbon emissions in Henan Province, the Tapio decoupling model is used to analyze its relationship with economic development, and its driving factors are analyzed in combination with the LMDI model. The results show that the total amount of agricultural carbon emissions in Henan Province from 2010 to 2019 is on the rise, of which chemical fertilizers are the largest source of carbon emissions. The decoupling analysis shows that before 2019, the weak decoupling between agricultural carbon emissions and the total output value of the planting industry was mainly weak, and a strong decoupling state appeared for the first time in 2019. This means that the level of agricultural economic development is the main force driving the growth of carbon emissions. In recent years, environmental problems caused by the greenhouse effect have gradually attracted widespread attention from scholars all over the world. Related reports pointed out that greenhouse gases produced by agricultural production accounted for 1/5 of the total global emissions [1]. China is the country with the most agricultural carbon emissions in the world. China’s agricultural greenhouse gas emissions have accounted for 17.00% of the country’s total emissions [2]. In response to the increasingly prominent problems of ecological environment and agricultural economic development, the Chinese government has pledged to strive to reach the peak of carbon emissions by 2030 and to achieve carbon neutrality by 2060. Therefore, strengthening the research on agricultural carbon emissions is not only helpful to promote the development of low-carbon agriculture, but also to the realization of national carbon emission reduction targets. The issue of agricultural carbon emissions has always been closely related to the ecological environment and has always been the focus of research by domestic and foreign scholars. Among them, the foreign scholar Ismael studied the relationship between agricultural technological progress and agricultural carbon emissions based on the data from 1970 to 2014 in Jordan. It is believed that the impact of fertilizers, grain production land, and agricultural added value on carbon emissions is gradually increasing [3]; Lubowski et al. measured agricultural carbon emissions in many countries and found that due to differences in agricultural production methods, the impact of agricultural carbon emissions on the economy is also heterogeneous [4]; Through research, Verge et al. found that the carbon footprint in the Canadian agricultural production process accounts for about 90% of its total carbon emissions [5]. Chinese scholars have carried out many studies on the issue of agricultural carbon emissions. Most of them are carried out from several aspects such as the calculation of agricultural carbon emissions, temporal and spatial differences, influencing factors and the relationship with economic development. For example, Tian Chengshi and others have measured the total amount of my country's inter-provincial agricultural carbon emissions, and the results showed that the agricultural carbon emissions during the study period showed a \"V-shaped\" structure that first decreased and then increased [6]; Li Hui et al. used the GWR model to analyze the temporal and spatial analysis of my country's inter-provincial agricultural carbon emissions, and the results showed that the inter-provincial agricultural carbon emissions have significant spatial positive correlation characteristics [7]; Wei Qin et al. analyzed the influencing factors of agricultural carbon emissions in 31 provinces from 1999 to 2014,and pointed out that the development of agricultural economy was the main reason for the increase in agricultural carbon emissions in the region, while the optimization of agricultural industry structure and the reduction of agricultural population were the main reasons for the growth of agricultural carbon emissions in the region. The leading force to suppress the increase in carbon emissions [8]; Taking the Yangtze River Economic Belt as an example, Tian Yun and others studied the total relationship between agricultural carbon emissions and economic growth from 1993 to 2017 and found that there is a strong coupling and coordinated development relationship between the two [9]. The above-mentioned scholars' analysis of agricultural carbon emissions focuses on a single study, but there are still few comprehensive studies on the calculation of agricultural carbon emissions, the driving factors, and the relationship with economic development. At the same time, after the Central Plains Economic Zone was upgraded to a national strategy, its primary task was to establish a national food production base and a modern agricultural base. Henan Province, as one of the important cities in the Central Plains Economic Zone, the research on its agricultural carbon emission issues not only involves the realization of the national carbon neutral goal, but also has a significant impact on the development of its modern agriculture.",
    "In view of this, this article uses the basic data of six types of carbon sources invested in the agricultural production process of Henan Province from 2010 to 2019 to calculate and analyze the province's agricultural carbon emissions. This paper also studies the decoupling effect between carbon emissions and agricultural economic growth and uses the LMDI model to decompose its driving factors to provide a scientific basis for formulating regional carbon emission reduction policies and promoting the development of low-carbon agriculture. The basic data of the 6 types of carbon sources involved in this article, including the total output value of planting industry, the total output value of agriculture, forestry, animal husbandry and fishery, and the number of agricultural laborers all from the \"China Rural Statistical Yearbook\" and \"Henan Provincial Statistical Yearbook\". Among them, the agricultural irrigated area is the actual irrigated value in each year; the ploughed area is the mechanically sown area of crops in each year; the number of agricultural laborers is based on the number of employees in the primary industry. Combined with the focus of this research, six indicators including agricultural machinery, pesticides, chemical fertilizers, agricultural film, agricultural irrigation and plowing were selected as carbon emission sources for agricultural production. The specific calculation method refers to the previous research results [2], as shown below: In formula (1), Car is the total carbon emissions from agricultural production; Cari is the carbon emissions of the i type of carbon source; Quani is the amount of the i type of carbon source used; and Coefi is the emission coefficient of the i type of carbon source. The details are shown in Table 1: This paper chooses Tapio model to analyze the decoupling relationship between agricultural carbon emissions and economic growth in Henan Province, the decoupling model built is as follows: In formula (2), elas is the coefficient of decoupling elasticity, and ΔCar is the change in total agricultural carbon emissions; ΔTotov is the change in the total output value of the planting industry; Car is the carbon emissions in the base period; Totov is the total output value of the planting industry in the base period. According to the difference of elastic coefficient, the decoupling state is divided into 8 different types [3], see Table 2 for details. In formula (3). Totov is the total output value of planting industry; Tonfa is the total output value of agriculture, forestry, animal husbandry and fishery; Agrl is the number of agricultural labor force; EI, CI and SI represent factors of agricultural production efficiency, agricultural production structure and agricultural economic development, respectively. According to the formula (1), the carbon emission of agricultural production in Henan Province from 2010 to 2019 is calculated, see Table 3 for details. Table 3 Accounting results of carbon emissions from agricultural production in Henan Province in odd years from 2010 to 2019 / 10000 tons From the above table, it can be seen that the carbon emissions of chemical fertilizers accounted for more than 2/3 of the total carbon emissions of the province from 2010 to 2019. It is the largest source of carbon emissions from agriculture in the province, accounting for an average of 73.28%. The average proportion of other carbon sources is less than 10%, which are 9.60% for agricultural film, 7.93% for diesel and 7.64% for pesticides. Tillage and irrigation are the least, and the average proportion during the study period is still less than 2.00%. In terms of evolution trends, the average proportion of chemical fertilizer, agricultural film and plowing shows a certain increase, of which chemical fertilizer increased by 1.20%, and agricultural film increased by 0.40%. Plowing increased by 0.09%, while the carbon emissions of pesticides, diesel and irrigation showed a downward trend. Among them, the carbon emissions of pesticides decreased by 1.06%, the carbon emissions of diesel decreased by 0.45% and the carbon emissions of irrigation decreased by 0.18%. According to formula (2), the decoupling elasticity of agricultural carbon emissions in Henan Province is calculated, and the results are shown in Table 4. It can be seen from the above table that during 2010- 2019, the weak decoupling between agricultural carbon emissions and the gross production value of crop production in Henan Province occurred 7 times, accounting for 77.78% of the statistical period. This shows that Henan Province has made great progress in low- carbon agriculture. Specifically: From 2010 to 2012, Henan Province increased the promotion and utilization of agricultural technology, improved agricultural production efficiency, and made the total output of the planting industry worthy of rapid growth. However, after the release of the second land survey data, the area of arable land increased by 13.74% compared with the previous year, leading to an increase in the input of agricultural materials. Therefore, the expansion connection appeared in 2012; during 2013-2018, the application of agricultural science and technology in Henan Province continued to deepen. Promote the total output value of the planting industry to continue to maintain a relatively high growth rate. At the same time, the Chinese government has gradually increased its emphasis on the ecological environment, and the growth rate of agricultural carbon emissions in Henan Province has also been declining. During this period, the decoupling state between the total output value of the planting industry and the agricultural carbon emissions is weak; in 2019, the agricultural carbon emissions of Henan Province and the total output value of the planting industry reached a strong decoupling state, indicating that the development of the agricultural economy in Henan Province has an impact on the environment. The impact has dropped to the lowest level in history.",
    "According to formula (3), combined with the above calculation results, the driving factors of carbon emissions from agricultural production in Henan Province are decomposed with the help of LMDI model, and the decomposition results are shown in Table 5. Table 5 Decomposition results of carbon emission driving factors of agricultural production in Henan Province in odd number years 2010-2019 / 10000 tons It can be seen from Table 5 that the development of the agricultural economy is the primary factor that promotes the rapid growth of agricultural carbon emissions. Compared with the base period, it achieved a cumulative carbon increase of 6.570 million tons. With the growth of the years, the carbon emissions caused by it continue to decrease, indicating that the development of low-carbon agriculture has achieved great results; the improvement of agricultural production efficiency has achieved a cumulative carbon emission reduction of 3,726,300 tons, and its role is constantly weakening. It shows that the inhibitory effect of this factor on carbon emissions is decreasing, and the efficiency of agricultural production needs to be further improved; the agricultural labor factor has achieved a total of 1.0565 million tons of carbon emissions reduction. During the study period, the continuous reduction of the number of agricultural labors in Henan Province created conditions for the large-scale agricultural production. Large-scale operations can improve the efficiency of agricultural production, thereby reducing carbon emissions; the structural factors of agricultural production have achieved a total of 135,800 tons of carbon emissions reduction, and the inhibitory effect has been continuously strengthened. This means that perfecting the structure of agricultural production is one of the development directions of Henan Province to promote agricultural carbon emission reduction in the future. (1) On the whole: From 2010 to 2019, the total carbon emissions from agricultural production in Henan Province are on the rise, with an average annual growth rate of 2.35%, which will increase to 8,685,100 tons in 2019, of which chemical fertilizers are the largest source of carbon emissions. (2) In terms of decoupling analysis: the elasticity index of decoupling between agricultural carbon emissions and the total output value of the planting industry in the province in 10 years is -0.1520~1.1588. Before 2019, it was mainly manifested as weak decoupling accounting for 75.00%, and strong decoupling in 2019. (3) In terms of driving factors: the development of the agricultural economy is the primary factor that promotes the rapid growth of carbon emissions. Compared with the base period, it has achieved a cumulative increase of 6.570 million tons of carbon. Agricultural production efficiency factors, labor factors and production structure factors have an inhibitory effect on carbon emissions. Economic factors are the main reason to promote the growth of agricultural carbon emissions in the province. Therefore, on the premise of ensuring farmers’ income, raise their low-carbon awareness and environmental protection awareness, increase the promotion of low- carbon agriculture and ecological agriculture, and promote the transformation of agricultural economic development mode; secondly, it is necessary to further improve agricultural production efficiency and increase the research and development, promotion and utilization of agricultural technology. Improve the utilization efficiency of chemical fertilizers, pesticides and other production materials through the adoption of new technologies; thirdly, adjust the agricultural production structure, and rationally adjust the planting area of cash crops and feed crops in combination with the actual characteristics of the region on the basis of ensuring food security. Finally, it is necessary to accelerate the rate of regional cultivated land circulation, realize large-scale operation, carry out large- scale mechanized production, improve production efficiency and reduce carbon emissions."
]