[
    "Abstract: First, based on panel data from 17 prefecture-level cities in Henan Province from 2009 to 2021, the SBM-GML method was used to measure the agricultural green TFP and its decomposition indicators, analyzing the distribution and regional differences of the agricultural green TFP in Henan Province. The following conclusions were drawn: (1) During the sample period, the agricultural green TFP levels among the 17 prefecture-level cities in Henan Province were not significantly different, showing a relatively even distribution. In terms of annual average growth rates, although seven prefecture-level cities had an annual average growth rate exceeding 3%, ten prefecture-level cities had an annual average growth rate of only 1%, indicating a low annual growth rate that needs further improvement. (2) Agricultural green development is uneven across regions in Henan Province, with stable growth trends observed in the southern and eastern regions, while the northern region saw its agricultural green TFP consistently below 1 from 2009 to 2019. (3) According to the index decomposition values, in terms of technical efficiency, the increases in technical efficiency were all less than 0 in the northern, eastern, and central regions of Henan. In terms of technological progress, all regions—eastern, western, and central—showed growth in technological progress, indicating that technological progress is the primary driver of green agricultural development in various regions of Henan Province. Finally, recommendations for promoting agricultural green development in Henan Province are proposed based on the results. In 2022, the report to the 20th National Congress of the Communist Party of China pointed out that \"to promote Chinas modernization and build an agricultural power, we must adhere to high-quality agricultural development.\"[1]Agriculture, as the foundation of the national economy, not only plays a crucial role in ensuring food security but is also key to achieving sustainable economic development and environmental protection. As resource and environmental constraints intensify and agricultural production methods evolve, the Total Factor Productivity (Green Total Factor Productivity, TFP) in agriculture has gradually become an important indicator for measuring high-quality agricultural development. Henans comprehensive green TFP takes into account multiple factors such as economic growth, resource utilization efficiency, and environmental protection, providing a full picture of the green transformation process in agricultural production. As a major agricultural and populous province, Henan uses one-sixteenth of the countrys arable land to produce one-quarter of the nations wheat and one-tenth of its grain, solving the food problem for over 100 million people. Its total grain output has ranked second in the country for eight consecutive years. This clearly demonstrates that Henans agricultural development is of great significance to the national strategy of building a strong agricultural nation. Henan should seize the strategic opportunity of \"agricultural power\" to promote high-quality agricultural development. The 14th Five-Year Plan points out that green development should drive agriculture towards higher quality. As an important grain-producing province in China, Henans level of agricultural green development not only concerns the sustainable development of its own agriculture but also has significant implications for national food security and agricultural green development. In recent years, Henan has made certain achievements in advancing agricultural modernization, improving agricultural production efficiency, and protecting the agricultural ecological environment. However, it still faces issues such as low resource utilization efficiency and significant environmental pollution pressure. Therefore, scientifically evaluating Henans agricultural green TFP is crucial for clarifying the current status, problems, and potential of agricultural green development, and for formulating targeted policies to promote high-quality agricultural development Agricultural Green TFP is an indicator used to measure the transformation of economic development patterns. Based on traditional accounting methods that consider agricultural resources as input factors and total agricultural output as expected output, agricultural carbon emissions are treated as non-expected outputs and incorporated into the system for calculating total factor productivity, which is referred to as Agricultural Green TFP. Currently, models focusing on Agricultural Green TFP mainly include the DEA model, SBM model, and GML index. Among these, the DEA model[2]The main purpose is to measure the agricultural green TFP from the perspective of space. However, this model is mostly limited to the use of radial and angular methods, which cannot effectively overcome the measurement deviation caused by radial or angular selection. For this reason, Fukuyama[3]、Tone [4]On the basis of non-radiant and non-angle, a more general SBM directional distance function is proposed. Since the SBM directional distance function cannot achieve the global comparability of the production frontier, scholars combine SBM with ML index method, such as Chen Yanling[5]The SBM-ML index method was used to analyze the influencing factors of agricultural green TFP. However, due to the disadvantages of ML index such as linear programming without solution and non-transitivity, Oh[6]A global production possibility set was constructed, and the GML index was proposed. Since then, scholars have begun to use the GML index to analyze the dynamic evolution process of agricultural green TFP growth. Due to the inability of the GML index to effectively address both radial and angular issues and achieve global comparability of the production frontier, scholars[7]The two are effectively combined to measure the agricultural green TFP by using the GML index based on the SBM directional distance function.",
    "In this study, the GML index method based on SBM directional distance function is mainly used to measure agricultural green TFP. This method is more convenient for calculation, which can effectively deal with the radial and angular problems, and can also realize the global comparability of production frontier. Learn from Fukuyama[3]With Oh et al[6]The research idea is to construct GML index based on SBM directional distance function, as follows: Among them, the distance function represents the SBM direction of the whole region; the GML index represents the change from period t+1 to period t, and the GML index is greater than 1, less than 1 and equal to 1 respectively, which represent that the agricultural green TFP is in a growing state, the agricultural green TFP is in a declining state, and the agricultural green TFP is in a stable state. The indicators are selected as shown in Table 1. The expected output variable for agriculture is the total output value of agriculture (referring to narrow agriculture, i.e., crop farming), with 2009 used as the base year for deflation. Fertilizers, pesticides, agricultural films, diesel, crop planting area, and agricultural irrigation are chosen as indicators for calculating carbon emissions. Total carbon emissions, where E i. The above carbon source emissions are δｉCarbon emission factor. Carbon emission factor is from Table 2. Based on the above input-output indicators and measurement methods, this paper uses MATLAB2021a software to measure the agricultural green TFP of all prefecture-level cities in Henan Province from 2009 to 2021 respectively, and the results are shown in Table 3. From the perspective of the entire sample period, Xinxiang City has the lowest agricultural green TFP at 0.742, while Kaifeng City in Henan Province has the highest agricultural green TFP at 1.178, with an extreme low of only 0.654. This indicates that the average agricultural green TFP across all prefecture-level cities in Henan Province from 2009 to 2021 was relatively close. In terms of annual growth rates, seven prefecture-level cities had an average annual growth rate exceeding 3%, while ten prefecture-level cities had an average annual growth rate just over 1%. This suggests that since China entered an aging society, the agricultural green TFP in Henan Province has been growing steadily, but at a relatively slow pace. Figure 1 (a) shows the agricultural green TFP and its decomposition indices for the entire province, where the line graph represents the agricultural green TFP for different years, and the bar chart sequentially represents the technical efficiency change index and the technical progress change index for different years. From Figure 1(a), a comprehensive view of the entire province of Henan shows that the agricultural green TFP in Henan Province has been greater than 1 since 2015 and has maintained a steady growth trend. Between 2020 and 2021, the technical efficiency change index and the technological progress change index in Henan Province increased by-0.058 and 0.017, respectively. This indicates that the growth of the agricultural green TFP in Henan Province mainly relies on technological progress. In contrast, the growth trend of agricultural technical efficiency is not significant and remains at a low level, even showing a downward trend in multiple years, indicating that agricultural technical efficiency has always been a weak point in the development of green agriculture in Henan Province. The possible reasons include the widespread outflow of rural talent and the increasingly severe aging of the rural population, which leads to a shortage of agricultural production talent. The elderly group engaged in agricultural production, due to their relatively backward professional knowledge, have poor acceptance and ability to adopt new agricultural technologies, thereby inhibiting the improvement of agricultural technical efficiency. Overall, although the aging of the rural population in Henan Province has suppressed the improvement of agricultural technical efficiency, it also exerts a strong reverse push on technological progress. Currently, this force is causing a much higher improvement in agricultural green TFP compared to the improvement in technical efficiency. The agricultural green Total Factor Productivity (TFP) and its decomposition indices for northern, southern, eastern, western, and central Henan are shown in Figure 1(b), (c), (d), (e), (f), respectively. The line graph represents the agricultural green TFP for different years, and the bar charts sequentially show the technical efficiency change index and the technical progress change index for different years. From the figures, it can be seen that the agricultural green TFP in southern and eastern Henan both exhibit a stable growth trend. In contrast, northern, western, and central Henan show fluctuating trends from 2009 to 2013. Notably, the fluctuations in northern Henan are relatively larger, with its agricultural green TFP consistently below 1 between 2009 and 2019. This is due to the higher degree of industrialization and more severe pollution in northern Henan, which hinders the development of green agriculture. In terms of technical efficiency, the increases in technical efficiency in northern, eastern, and central Henan were all less than 0. The technical efficiency values in 2021 decreased by 0.007, 0.024, and 0.013 compared to 2009, respectively. Additionally, the technical efficiency values in eastern regions remained below 1 for most years, indicating that technological progress has a restraining effect on the growth of agricultural green TFP in these areas. Regarding technological progress, compared to 2010-2011, the eastern, western, and central regions all saw increases in technological progress, with growth rates of 0.070, 0.137, and 0.135, respectively. Moreover, the technological progress index was mostly above 1, suggesting that all regions in Henan Province rely on technological progress as the primary driver of green agricultural development.",
    "The article is based on panel data from 17 prefecture-level cities in Henan Province between 2009 and 2021, using SBM-GML to measure the agricultural green TFP and its decomposition indicators. It analyzes the distribution and regional differences of the agricultural green TFP level in Henan Province. The following conclusions are drawn: (1) During the sample period, the differences in total factor productivity of agriculture among the 17 prefecture-level cities in Henan Province were not significant, showing a relatively even distribution. In terms of annual average growth rates, although seven of these cities had an annual average growth rate exceeding 3%, ten cities had an annual average growth rate of only 1%, indicating a low annual growth rate that needs further improvement. (2) Agricultural green development is uneven across regions in Henan Province. The agricultural green TFP in southern and eastern Henan shows a stable growth trend, while northern Henans agricultural green TFP was less than 1 throughout 2009-2019. (3) According to the index decomposition values, in terms of technical efficiency, the increases in technical efficiency were all less than 0 in northern, eastern, and central Henan. In terms of technological progress, the increases in technological progress were observed in eastern, western, and central Henan, indicating that all regions in Henan Province rely on technological progress as the primary driver of green agricultural development. Based on these research conclusions, to achieve Chinas 14th Five-Year Plan and promote green agricultural development in Henan Province, improving the agricultural green TFP in Henan Province, the following policy recommendations are proposed: First, promote modern agricultural planting technology and improve the overall quality of agricultural practitioners. Due to the characteristics of gentle terrain, mild climate, sufficient sunshine and abundant precipitation in Henan Province, it is more suitable for the development of agriculture, forestry, animal husbandry and fishery, while farmland is the foundation of agricultural production in Henan Province Planting techniques. In the management of farmland, it plays a crucial role. The modern agricultural technology industry has become increasingly mature, capable of achieving efficient and green production. However, its promotion is slow, the quality of agricultural practitioners is low, and the rural population is severely aging. To achieve green agricultural production in Henan Province, it is necessary to increase investment in innovation for the agricultural industry in Henan, significantly improve the overall quality of agricultural practitioners, and overcome the challenges posed by an aging rural population. Second, effectively and orderly promote the transfer of rural land to accelerate the transformation of modern agriculture. Henan Province is both a major agricultural province and a populous province. In 2022, Henans total grain production was 67.89 million tons, accounting for about 10% of the national total. Therefore, ensuring grain production in Henan is crucial. However, due to the increasingly severe aging of the rural population, low agricultural income, an increase in migrant workers, and a decrease in young and middle-aged farmers, Henans total grain production decreased by 5.632 billion pounds compared to 2020. To prevent the abandonment of rural land resources in Henan and ensure Chinas food security, it is necessary to guide farmers to transfer their land in an orderly manner. At the same time, it is essential to strengthen the role of new agricultural business entities in Henan in supporting elderly farmers. This not only aims to improve their employment income but also to innovate modern agricultural management methods, enhancing their property income and improving the sustainable livelihood capabilities of elderly farmers after transferring their land. Third, encourage rural college graduates to return home for employment or entrepreneurship. As the aging of the rural population in Henan Province intensifies, the issue of agricultural population aging has become increasingly severe, adversely affecting the green production and industrialization of agriculture in Henan. Encouraging college graduates to return home after graduation to seek employment is a viable approach. For instance, Henan can recruit college graduate village officials to gain practical experience at the grassroots level. College graduates can also start businesses based on the characteristics of rural areas, such as live-streaming sales, which can increase job opportunities in Henan and improve income levels for farmers within the province, promoting the green development of agriculture in Henan. Fourth, accurately locate according to the actual situation. Henan province has rich natural resources, so it should accurately grasp the advantages of agricultural development in each city, and adopt differentiated strategies according to the natural conditions and resource advantages of different regions."
]