[
    "Abstract: Based on the relevant data of Henan Province in 2019-2023, this paper constructs the green development and digital economy index system, uses the entropy value method to measure the development level of its green development and digital economy, and adopts the coupling degree of coordination model to measure the coupling degree of coordination of Henan Province's green development and digital economy, and the results of the study show that: the level of Henan Province's green development as a whole presents a zigzagging upward trend, and the digital economy development level as a whole shows a significant upward trend. At the same time, the coupling and coordination level of green development and digital economy is gradually rising and developing in the direction of coordination. Resources and the environment are the necessary material conditions for human survival and development, and economic development cannot be separated from the support of resources and the environment. General Secretary State leaders has emphasized that the close link between the environment and the economy directly affects the potential and strength of economic and social development. The Fifth Plenary Session of the 18th CPC Central Committee put forward the concept of green development, the 19th CPC National Congress reinforced the strategic deployment of a green and circular economic system, and the report of the 20th CPC National Congress emphasized China's determination to implement green development policies, and explicitly proposed \"to promote green development, and to promote the harmonious coexistence of human beings and the nature,\" which fully reflects China's sustained concern and resolute practice of the long-term strategy of green development. This fully reflects China's continuous concern for and firm practice of the long-term strategy of green development. At the same time, at the 20th Congress, General Secretary State leaders further emphasized the need to build a digital China, and the digital economy, as a new economic form with intensive resources and high output efficiency, can effectively promote the formation of a green mode of production and way of life in the society, and drive the economic change, and the information technology revolution triggered by the digital economy matches the concept of green development, which indicates that there is a relationship of mutual promotion and influence between green development and the digital economy. . As an important economic development region in central China, Henan Province actively promotes economic transformation and upgrading, and takes the road of green development. This paper takes Henan Province as the research object, constructs the evaluation index system of green development and digital economy, measures the level of its green development and the level of digital economy development, and applies the coupling coordination degree model to study the coupling coordination level, aiming to provide suggestions for the benign interaction between the green development and digital economy in Henan Province, to enhance the core competitiveness of Henan Province, and at the same time, to provide reference value for other provinces. Regarding the research on green development, British economist David W. Pearce first proposed the concept of \"green economy\" in his book \"Blueprint for a Green Economy\" [1]; Wang Lingling and Zhang Yanguo regard green development as the interaction of four subsystems, namely, green environment, green economy, green politics, and green culture, based on the systemic view [2]. In terms of quantitative assessment of green development, some scholars measure the level of green development through Dagum's Gini coefficient [3], the DPSIR model and the Improved Barrier Degree Model [4], while some scholars construct comprehensive indicators from multiple dimensions to measure green development [5-6]. In terms of the influencing factors and realization path of green development, Jianping Liu and other scholars empirically proved that the construction of national-level city clusters has a significant effect on the promotion of urban green development through a multi-period double-difference model [7]; and Minggui Zheng and other scholars found that the green development of resource cities is the result of the synergistic development of multi-conditions and has a close relationship with the rationalization of industrial development [8]; Regarding the research on digital economy, Xu Xianchun et al. believe that digital economy is an economic activity based on the development of digital technology and supported by digital platforms, which mainly includes three parts: infrastructure, digital transactions and transaction products [9]. Sun Xiaoqiang et al. measured the level of digital economy development from the national level [10], and Wang Kaili et al. measured the level of digital economy development from the regional level [11]; Yan Xiaoqi et al. based on the connotation of digital economy indicators, constructed an indicator system to measure the level of digital economy development in the Yellow River Basin from the four aspects of digital economy infrastructure, industry scale, development environment, and digital financial inclusion index [12].",
    "Regarding the research on the relationship between green development and digital economy, some scholars believe that the digital economy significantly promotes the green development of Chinese cities [13]; some scholars further focus on the nonlinear impact and spatial spillover effect of the digital economy on green development [14-15]; and some scholars explore the impact of the development of the digital economy on green development in terms of high-quality development [16], etc. In summary, academic research on green development and digital economy is increasingly rich, but from the research scope, there are fewer studies on the coupled development of green development and digital economy and its spatial pattern in Henan Province, based on which, this paper takes Henan Province as the research object, constructs the evaluation index system of green development and digital economy, measures the level of green development and digital economy in Henan Province, and applies the coupling coordination degree model to study the coupling coordination level, aiming to provide suggestions for the benign interaction of green development and digital economy in Henan Province, with a view to improving the integration level of Henan Province and enhancing its core competitiveness. Based on the Green Development Indicator System issued by the National Development and Reform Commission, combined with the actual situation of Henan Province, and with reference to the research of Shi Lijiang [17], Xiong Xi [18] and other scholars, we construct a green development evaluation index system with three first-level indexes and 20 second-level indexes of green production, green life, and green governance, so as to provide a scientific basis for the formulation and implementation of the green development policy, and to promote the progress of Henan Province in the direction of green, sustainable development. It will provide a scientific basis for the formulation and implementation of green development policies and promote Henan Province to move forward in the direction of green and sustainable development. Based on the Statistical Classification of the Digital Economy and Its Core Industries (2021) issued by the National Bureau of Statistics (NBS), the indicator system is constructed by combining the actual situation of Henan Province, while drawing on the research results of Zhao Tao et al. [19] and Guo Feng [20]. The data used in this paper are compiled from Henan Provincial Statistical Yearbook, Statistical Bulletin, and Henan Provincial Ecological Environment Bulletin. Entropy value method refers to the evaluation process of indicators, according to the degree of difference of each indicator objectively reflects its importance in the indicator system, to a certain extent, can overcome the problem of subjectivity. Since the statistical caliber of each indicator is different and the direction of the indicators is different, the standardization of the polar deviation is used for the dimensionless processing: Whereğ‘ğ‘–ğ‘— represents the value of theğ‘– indicator in theğ‘— region after forward or reverse processing,ğ‘¥ğ‘–ğ‘— represents the original value of theğ‘– indicator in theğ‘— region,max(ğ‘¥ğ‘—) represents the maximum value of the indicator, andmin(ğ‘¥ğ‘—) represents the minimum value of theğ‘– indicator. Before calculating the composite score, it is necessary to assign weights to the indicators after the standardization process, the steps are as follows: Whereğ‘˜ = ğ‘™ğ‘›ğ‘š ,ğ‘ƒğ‘–ğ‘— = âˆ‘ ğ‘› ğ‘–=1 ğ‘ğ‘–ğ‘— ,ğ‘ƒğ‘–ğ‘— denote the weight ofğ‘— under theğ‘– indicator. Then calculate the information entropy redundancy and indicator weights, the process is as follows: The coupling coordination degree model is used to measure the level of coupling coordination between green development and digital economy. The coupling coordination degree is calculated by the formula: Among them,ğ¶ is the coupling degree,ğ‘‡ is the comprehensive coordination index,ğ· is the coupling coordination degree, the value range is from 0 to 1, the closer the value is to 1, the higher the level of coupling coordination;ğ‘“(ğ‘¥) andğ‘”(ğ‘¦) represent the level of development of green development and digital economy, respectively, and the bigger the value is, the higher the corresponding level of development;ğ›¼,ğ›½ is the weights to be determined,ğ›¼ + ğ›½ = 1, green development is usually regarded as equal to the importance of the digital economy, and therefore ğ›¼ = ğ›½ = 0.5 is ordered. The green development and digital economy indices of Henan Province were calculated by entropy method, see Figures 1 and 2. As can be seen from Figure 1, from 2019 to 2023, the green development index of Henan Province rises from 0.21 to 0.67, with an overall zigzag upward trend, which indicates that the construction of ecological civilization and green transformation in Henan Province has achieved certain results. Among them, the green development index increases significantly from 2019 to 2021, from 0.21 to 0.73, with a rise of up to 248%, the green development index declines slightly from 2021 to 2022, and the green development index rebounds again from 2022 to 2023, reaching 0.67. This shows that the government of Henan Province attaches great importance to environmental protection, and actively practises the policy of \"both gold and silver mountains and green water and green mountains\".",
    "As can be seen from Figure 2, the level of digital economy development from 2019 to 2023 shows a significant upward trend, and the digital economy index has increased significantly from 0.04 to 0.92, and the development of the digital economy has been effective. Henan Province attaches great importance to the development of the digital economy, and has introduced a number of policies to support the development of the digital economy industry, such as the Three-Year Action Plan for the Development of Big Data Industry in Henan Province (2018-2020), etc. In 2021, Henan listed the implementation of the digital transformation as one of the province's \"ten major strategies\". In 2021, Henan listed the implementation of digital transformation as one of the province's \"Ten Major Strategies\".2023, the Henan Provincial Committee made the decision of \"Four Highs and Four Priorities\", and vigorously developed the digital economy as an important content.2023, Henan Province issued the \"2023 Work Program for the Development of Digital Economy in Henan Province\", which clarified the annual development goals and key work. Based on the coupling coordination degree model to measure the coupling coordination value of green development and digital economy in Henan Province from 2019 to 2023, the results are shown in Figure 3. As can be seen in Figure 3, the coupling coordination degree of green development and digital economy in Henan Province is generally on the rise, but the growth rate varies at different stages. In 2019-2021, the coupling coordination degree grows faster, mainly because Henan Province attaches great importance to green development and digital economy in strategic planning and policy support, and the digital economy has a significant role in promoting green development. In 2021-2022, the coupling coordination degree decreases slightly and is basically flat. In 2022-2023, the coupling coordination degree increases further, indicating that the level of coupling coordination between green development and digital economy in Henan Province continues to improve. Based on the relevant research of previous scholars, combined with the actual situation in Henan Province, and also taking into account the availability of data, this paper selects the relevant indicators of green development and digital economy, constructs the index system, and uses the entropy value method and the coupling coordination degree model to measure the coupling coordination degree of green development and digital economy in Henan Province from 2019 to 2023, and the results of the study show that the level of green development in Henan Province as a whole presents a zigzagging upward trend, and the overall level of digital economy development shows a significant upward trend. At the same time, the coupling and coordination level of green development and digital economy gradually rises and develops in the direction of coordination. First, strengthen environmental monitoring and law enforcement. Strengthen environmental monitoring and assessment by establishing a robust system that enables real-time environmental quality surveillance. This will facilitate the timely identification and resolution of environmental issues. Additionally, it is essential to enhance environmental law enforcement, conducting thorough investigations and imposing strict penalties for violations of environmental laws and regulations. Responsible parties must be held accountable to ensure the effective implementation of various environmental policies and measures. Secondly, strengthening digital infrastructure. Increase investment in digital infrastructure and enhance Internet penetration and network speed to provide a solid foundation for the development of the digital economy. In particular, it is necessary to increase support for the construction of digital infrastructure in less economically developed regions, so as to narrow the regional digital divide. Third, promote the deep integration of the digital economy and green development. Encourage enterprises to boost their investment in the research and development of digital technology, promote the application of digital technology within the green industry, and enhance the digitization level of the green industry. At the same time, it guides digital economy enterprises to transform in the direction of green development, realizing the benign interaction between the digital economy and green development. This paper was supported by General Project of Educational Reform at the School Level of Zhengzhou Sias University: Research on the Spatio-Temporal Characteristics of the Coupling of Green Development and the Digital Economy in Henan Province. (Grant NO.: 2024XKD106)."
]