[
    "1School of Resources and Environment, Henan Polytechnic University, Jiaozuo, Henan, China 2Defeat Software Technology Co. Ltd, Suzhou, Jiangsu, China *Corresponding author Abstract: This paper is based on economic development data of per capita GDP and industrial composition of Henan Province from 1991 to 2021, as well as industrial pollution data of industrial wastewater discharge, industrial waste gas discharge and industrial solid waste production. SPSS was used to analyze the relationship between industrial pollution and economic development in Henan Province, and the environmental Kuznets curve (EKC) relationship between them was analyzed. The main conclusions were as follows:① Since 1991 to 2021, the per capita GDP of Henan Province has an obvious increasing trend, and the industrial structure has been gradually transformed to \"three, two, one\", but mainly to develop the secondary industry;② The industrial pollution index of Henan Province showed a trend of decreasing first and then increasing. The industrial pollution standard value reached a peak in 2014, and then the industrial pollution index showed a trend of decreasing. ③ In the past 30 years, the fitting curve of industrial pollution and economic development in Henan Province generally presents an inverted \"U\" shape. At present, it is at the right end of the inflection point. The economic growth index and industrial pollution index of Henan Province have entered the stage of coordinated development as a whole. A large number of studies show that there is a close and complex relationship between economic development and environmental pollution[1-4]. Among them, environmental Kuznets curve (EKC) is a universal law. Kuznet Curve was originally proposed by American economist Kuznetsl [5] in 1955 to analyze the relationship between per capita income and distribution equity. Later, American economists Grossman and Krueger confirmed that environmental quality also has an inverted \"U\" shaped relationship with per capita income [6-7]. The nonlinear effect of economic activities on environment means that social economic activities first cause environmental damage in the initial stage; However, after a certain threshold is reached, these activities become environmentally friendly [8]. Since the EKC theory was proposed, it has attracted wide attention from the academic circle, and many empirical studies have been carried out using the timing, cross-section or panel data of different sample areas [9-11]. In fact, it takes various forms, such as \"U\" type and inverted \"U\" type, \"N\" type and inverted \"N\" type [12]. deterioration caused by it cannot be ignored. Economic development is the primary task, and environment is closely related to people's lives. The coordinated development of economy and environment is the key to achieve sustainable development. The rapid development of urban economy needs a good ecological environment as the foundation support, but it may also bring negative impacts on ecological environment [13]. Henan Province is located in the central region of China, which is a large area and the most populous province in China. It is also a key development area to promote the rise of central China. The development situation of Henan Province represents the general situation of the development of the Central Plains Economic zone. At present, Henan Province is in the development stage of industrialization. In the process of industrialization, a large number of industrial pollutants will be produced, resulting in a variety of environmental pollution problems [14]. Environment is closely related to people's lives, and environmental pollution will not only cause cardiovascular and respiratory diseases [15], but also one of the main causes of cancer [16]. Environmental pollution not only aggravates the contradiction between environmental protection and economic development, but also damages human health, thus hindering the sustainable development of Henan Province. Understanding the relationship between economic development and industrial pollution in Henan Province is related to the realization of the strategic positioning of sustainable and healthy development of Henan Province and the economic and social development of the Central Plains of China, which has certain theoretical and practical significance. Therefore, this paper adopts the EKC model to discuss the correlation between economic development and industrial pollution in Henan Province, in order to understand the relationship between the two, so as to provide reference for the sustainable development of Henan Province in the future. Henan Province is located in central China and consists of 17 prefectures (Figure 1), the middle and lower reaches of the Yellow River. It is a key development area for promoting the rise of central China and a key functional area for national development. From 1991 to 2013, the GDP growth rate of Henan Province was lower than that of the whole country. After 2014, the GDP growth rate of Henan Province was higher than that of the whole country. The economy of Henan province maintained steady development and moved steadily toward a good development trend. Good location advantage makes it a large agricultural province and an important comprehensive transportation hub in the whole country. For a long time, agriculture occupies an important position in the economic structure of Henan Province. However, in recent years, the level of industrialization in Henan Province has been continuously improved, and the proportion of the secondary industry in the GDP of the region is higher than the national level. The industrial structure categories are becoming more and more perfect. The industrial sectors such as building materials, light textile and food have gradually developed and expanded, and some emerging industrial sectors such as car and electronics have also developed rapidly from scratch. The proportion of heavy industry has increased significantly, and capital-intensive and technology-intensive enterprises have developed rapidly, laying the foundation for a strong industrial economy. The province's industrial structure has changed accordingly. Henan Province is not only a large agricultural province in China, but also a large emerging economy and industry province in China.",
    "The original economic data used in this paper, such as industrial wastewater discharge, industrial waste gas discharge and industrial solid waste production during 1991-2021, per capita GDP of Henan Province and the proportion of the three industries during 1991-2021, are all from Henan Provincial Statistical Yearbook, China Environmental Statistical Yearbook and Statistical Bulletin of National Economic and Social Development. In terms of economy, this paper aims to reflect the relationship between industrial pollution and economy more comprehensively. The per capita GDP of Henan Province and each city from 1991 to 2021 is selected as the economic development situation of the province, and the ratio of the primary industry, the proportion of the secondary industry and the proportion of the tertiary industry are selected as three economic indicators to analyze the economic development situation and industrial structure of Henan Province. In terms of industrial pollution, industrial wastewater discharge, industrial waste gas discharge and industrial solid waste production in Henan Province from 1991 to 2021 are selected as pollution indicators. The economic indicators and industrial pollution indicators are dimensionless (Formula 1). The weight of the four indexes is determined by AHP method, and the comprehensive industrial pollution level of each city in each year is obtained (Formula 2). Since environmental pollution usually exists in a compound state, it is more objective to add industrial comprehensive pollution index for analysis [17]. The weight of industrial wastewater discharge, industrial waste gas discharge and industrial solid waste production is determined by entropy weight method [18] (Equation 2 - Equation 5), and then the comprehensive air pollution level of each city in each year is obtained (Equation 6). The calculation steps are as follows: Using SPSS and entropy method, the weights of industrial wastewater discharge, industrial waste gas discharge and industrial solid waste production are 0.190, 0.372 and 0.438, respectively. where Y_i is the comprehensive industrial pollution index for the first year; j is different types of pollution indicators; W_j is the weight value of the jth pollutant emission. The correlation between economic development and industrial environment system is complicated. This paper mainly uses the EKC model to analyze and study the indicators of economic and industrial environment in Henan Province. Based on previous research results [19-20] and SPSS software combined with scatter plots of per capita GDP and various environmental pollution indicators, this study respectively adopted linear estimation model, quadratic estimation model and cubic estimation model to analyze the index data of economic development and industrial pollution, and found that the cubic fitting effect was the best. Therefore, the industrial pollution and economic growth model as shown in Formula (3) is finally adopted: Y is an environmental pollution index ; a is a constant term ; b1、b2、b3 are variable coefficients ; ε is the error term. In recent years, the per capita GDP of Henan Province has been increasing year by year, and the economy has been in a state of sustainable development. After 2014, the GDP growth rate of Henan Province is higher than the national growth rate. In order to further analyze the economic development and changes of Henan Province, the per capita GDP of Henan Province from 1991 to 2021 and the ratio data of the three industries are used to get the results as shown in Figure 2. As can be seen from the results of Figure 2, per capita GDP has an obvious increasing trend from 1141 yuan to 59,410 yuan during 1991-2021, with an average annual growth rate of 14.1%. Economic development has been showing a steady rising trend. In terms of industrial structure, the ratio of industrial structure developed from 32:37.1:30.9 to 9.5:41.3:49.1, and the industrial structure gradually transformed from \"two, three, one\" to \"three, two, one\". However, the trend of the primary industry and the tertiary industry losing each other still exists, and the secondary industry is still the main industry dependent on the economic growth of Henan Province. In recent years, under the correct leadership of the provincial Party Committee and the provincial government, the economy of Henan Province continues to develop in a good direction, the overall social harmony and stability, and people's living standards have been greatly improved. But with the continuous development of economy, there are also some industrial pollution problems. As shown in Figure 3, from 1991 to 2010, the discharge of industrial wastewater continued to rise, from 9,564.8 billion tons to 15,040 billion tons, with an average annual growth rate of 2.4%. With the implementation of environmental protection measures and the improvement of production technology, the discharge of industrial wastewater has been declining year by year since 2010. In 2021, industrial wastewater emissions will be reduced by about 71 percent to 439 billion tons. From 1991 to 2012, industrial emissions rose year by year from 418.5 billion cubic meters to 4,079 billion cubic meters, an increase of 7.8 times. Industrial emissions have declined since 2012, but they are still a major source of pollution in Henan. The production of industrial solid waste showed an increasing trend, from 22.9 million tons in 1991 to 166.47 million tons in 2021, with an average annual growth rate of 6.8%. The industrial pollution index of Henan Province showed a floating trend, and the industrial pollution standard value reached a peak in 2011. Overall, the industrial pollution index in Henan grew at an average annual rate of 5.7%. In the past ten years, industrial pollution emissions have been reduced in Henan Province, which is closely related to effective environmental protection measures and the improvement of production technology. However, in general, industrial pollution is still worth attention, and the contradiction between economic growth and ecological environment in Henan Province is still prominent.",
    "SPSS software was used to conduct regression analysis between per capita GDP of Henan Province and industrial wastewater discharge, industrial waste gas discharge, industrial solid waste production and comprehensive industrial pollution indicators, and it was found that the three times fitting effect was the best, and the results were shown in Table 1. As can be seen from the table, the fitting degree coefficient between per capita GDP and industrial pollution is greater than 0.85, which is good, and the significance P value is less than 0.01, which passes the F test. This regression model can better reflect the relationship between per capita GDP and industrial pollution in all urban areas of Henan Province. According to the fitting results, the fitting curves of per capita GDP and various industrial pollution indicators are further obtained, as shown in Figure 4. According to Table 1 and Figure 4, the EKC curve of per capita GDP and industrial wastewater discharge presents an inverted \"U\" shape, that is, when the economic development level is low, the industrial wastewater discharge gradually increases with the economic development, and when the economic development reaches a certain level, the industrial wastewater discharge gradually decreases with the economic development. After further calculation, it can be seen that the industrial wastewater discharge reached a turning point in 2009-2010, when the per capita GDP was 21,503 yuan, and the industrial wastewater discharge was 14, 6454 billion tons. After that, the treatment of industrial wastewater has achieved initial results and can develop in harmony with the economy. As can be seen from Table 1 and Figure 4, the fitting graph of per capita GDP and industrial waste gas emissions presents an inverted \"U\" shape, with a relatively gentle curve, and Henan Province is currently in the second half of the inverted \"U\" shape. Further calculation shows that the turning point occurs when the per capita GDP reaches 37,285 yuan, that is, during 2014-2015, when the industrial waste gas emission is 3,223.3 billion cubic meters. Since then, with the development of economy, the industrial waste gas emission begins to decline, and the treatment effect of industrial waste gas in Henan Province is good, which has been able to coordinate development with economic development. Combined with Table 1 and Figure 4, the first half of the inverted U shape is the fitting line of per capita GDP and industrial solid waste production. After calculation, the per capita GDP of the turning point is 57,007 yuan, that is, it will appear in 2020-2021. As industrial solid waste and economic development have just entered the coordination stage, the management of industrial solid waste, environmental investment and related supervision and management still need to be strengthened. On the basis of the above analysis, dimensionless standardized treatment is carried out on the \"three wastes\" index to obtain the industrial pollution composite index, which is fitted with the per capita GDP to obtain the fitting curve as shown in Figure 4. It can be seen from the figure that the fitting curve is an inverted \"U\" shape, and the inflection point occurs when the per capita GDP is 34,778 yuan. The turning point was from 2013 to 2014, that is, when the economic development level of Henan Province was low from 1991 to 2013, industrial pollution increased with the economic development, and from 2014 to 2021, the environmental quality improved with the economic development. However, in 2016, the curve fluctuated, indicating that industrial pollution in Henan Province still needs to be paid attention to in the future, and environmental protection should still be placed in an important position while developing the economy. (1) Since 1991 to 2021, the per capita GDP of Henan Province has shown an obvious increasing trend, and its economic development has been showing a steady rising trend. For a long time, it mainly focuses on industrial development; In terms of industrial structure, since 2010, the proportion of tertiary industry in Henan Province has gradually increased, and the industrial structure has gradually transformed to \"three, two and one\", but the secondary industry is still the main development. (2) From 1991 to 2021, the discharge of \"three wastes\" in Henan Province showed a trend of increasing and then decreasing, among which only the discharge of industrial wastewater decreased compared with 1991 at the present stage, while the other indicators all increased. The comprehensive index of industrial pollution showed a trend of first increasing and then decreasing fluctuation. In 2014, the industrial pollution standard value reached a peak, and after 2014, the industrial pollution index showed a trend of decreasing fluctuation, and in 2017, the decrease was relatively large.",
    "(3) Since 1991, per capita GDP, industrial \"three wastes\" and industrial comprehensive pollution index in Henan Province all conform to the EKC theory. According to the fitting results of EKC model, per capita GDP, industrial waste gas emissions, industrial waste water emissions, and industrial solid waste production all show an \"inverted U-shaped\" relationship, but the inflection points are different. On the whole, the inflection point of per capita GDP and industrial pollution composite index appeared in 2013-2014, and then with the development of economy, the degree of industrial pollution showed a trend of fluctuation and decline, entering a new stage of coordinated development of the two. (1) In the process of economic development, accelerate the optimization of industrial structure, while developing the secondary industry, gradually develop the tertiary industry, and promote the integrated development of the primary, secondary and tertiary industries. At the same time, enterprises with high emission and low output should be eliminated, energy consumption and emission of enterprises should be strictly controlled, new energy industry should be developed, and strong economic and policy support should be provided to these industries, so as to make Henan Province a highly industrial and competitive province, so as to realize the coordinated development of economy and environment. (2) Although Henan Province has made a lot of improvements in industrial pollution, in order to further realize sustainable development, it also needs to optimize the energy structure and improve the means of energy development. In the process of developing energy and promoting economic development, attention should be paid to the means of development, constantly improve technical means, increase efficiency, and reasonably discharge pollutants, so as to reduce the waste of resources. Achieve green and sustainable economic development. (3) We will improve environmental governance technologies and strengthen environmental protection measures. While developing the economy, we should pay special attention to environmental protection, increase investment in environmental governance and strengthen the management of pollutants discharged by industry. All urban areas in the province should strengthen the cooperation and exchanges between cities, actively learn some advanced development technology and environmental management measures, such as the introduction of differentiated management methods of Zhengzhou City, the implementation of different management measures for different enterprises, not only promote the development of the economy, but also protect the atmosphere environment to a certain extent, to achieve sustainable development."
]