[
    "Abstract: To analyze the spatiotemporal variation characteristics of NPP in Henan Province, this paper uses the MODIS Remote Sensing Data combined with segmented linear regression, Theil-Sen Median trend analysis, Mann-Kendall test, and coefficient of variation methods, resulting in the following conclusions:(1) From 2001 to 2023, the annual average NPP in Henan Province increased at a rate of 3.87 g C·m-2·a-1. The year 2004 was a mutation year, with the rates of increase before and after the mutation being 47.34 g C·m-2·a-1 and 2.89 g C·m-2·a-1, respectively. (2) The NPP in Henan Province shows a spatial distribution pattern declining from the southwest to the northeast. The area proportions of regions with multi- year average NPP below 200 g C·m-2·a-1, between 200-400 g C·m-2·a-1, 400-600 g C·m-2·a- 1, and above 600 g C·m-2·a-1 are 0.5%, 37.7%, 58.9%, and 2.9%, respectively. (3) From 2001 to 2023, 94.2% of Henan Province's regions exhibited an increasing trend in NPP, with the significance of the trend decreasing from west to east. The area proportions of regions with significant decrease, non-significant decrease, stable, non-significant increase, and significant increase NPP are 0.9%, 2.4%, 2.5%, 44.6%, and 49.6%, respectively. (4) From 2001 to 2023, the NPP change trend in Henan Province displayed a spatial distribution pattern of stability decreasing from southwest to northeast, overall showing moderate stability. The area proportions of regions with low stability, medium-low stability, moderate stability, medium-high stability, and high stability are 4.9%, 25.8%, 62.4%, 6.5%, and 0.4%, respectively. Net primary productivity (NPP) is the amount of organic matter captured by plants through photosynthesis, after deducting the portion required for their growth and development. It reflects the vegetation status of a region and is fundamental for evaluating the carbon balance of ecosystems [1]. Quantitative analysis of net primary productivity are widely applied in fields such as ecological conservation, resource utilization, and climate change. Methods for estimating NPP mainly include direct measurement and model estimation. For studies of large-scale and long-term NPP, direct measurement is difficult and costly to implement, so model estimation is commonly employed. The widely utilized models for estimating vegetation NPP include the CASA model [2], GLOPEM model [3], and BIOME-BGC model [4]. Satellite remote sensing technology, with its advantages of convenient data acquisition, extensive observation range, and high spatiotemporal continuity, makes model-based methods integrating remote sensing data the predominant approach for estimating large- scale and long-term vegetation NPP. The MOD17A3 dataset is a vegetation NPP dataset estimated based on MODIS satellite remote sensing information and the BIOME-BGC model. It has been widely applied and validated in studies of NPP [5]. Based on MOD17A3 data, this study applied linear regression models, the Theil-Median-Sen trend analysis, and the coefficient of variation method to examine the spatiotemporal characteristics of vegetation NPP in Henan Province from 2001 to 2023, offering scientific insights for regional vegetation protection and ecological restoration. Henan is located in central China, spanning 31°23′-36°22′N and 110°21′-116°39′E, with a total area of approximately 167,000 km2. The topography of Henan descends from west to east, consisting of mountains, plains, hills, and water bodies. The west is primarily mountainous, while the central and eastern areas feature plains, with elevations ranging from 23 to 2,414 m (see Figure 1)[6]. Henan serves as a key grain production region in China, with cropland covering more than 40% of its total area. Henan has abundant plant resources, with a forest coverage rate exceeding 20%. Forest coverage and agricultural cultivation are key contributors to Henan's NPP[7]. MODIS, developed by NASA, is a remote sensing system providing global dynamic observations via sensors on Terra and Aqua satellites. MODIS provides a variety of data products, including global net primary productivity and gross primary productivity datasets. The MODIS product used in this study is the MOD17A3HGF annual NPP dataset, derived from MODIS observations and the BIOME- BGC estimation model, with a spatial resolution of 500m. The preprocessing and downloading of 23 images over the 23-year study period were completed using the Google Earth Engine platform The MODIS data applied in this study require preprocessing steps such as time series filtering, vector clipping of the study area, quality control, and outlier handling before they can be downloaded and utilized. Google Earth Engine provides many application programming interfaces (APIs) for users to write data processing programs.",
    "In the Google Earth Engine platform, MODIS data is stored as ImageCollections, with each ImageCollection usually containing a series of remote sensing images from different time periods and spatial ranges. Hence, images that match the required time series and spatial extent for the study must be selected. The first step is time series filtering. In Google Earth Engine, the Filter.calendarRange interface can filter all images between two dates. Since annual data is required for this study, images between January 1 and December 31 of each year from 2001 to 2023 are selected. The next step is spatial range filtering and vector clipping for the study area. Using the Filter.filterBounds interface based on the study area vector boundary, all images containing the study area can be selected. Then, the clip function is applied to crop the data within the study area vector boundary. The last step is quality control and outlier handling. Due to unfavorable conditions such as poor climate during MODIS satellite imaging, the MODIS products may contain low-quality outliers, which need to be removed. MODIS products typically include a quality control band for outlier handling, and the quality control band for the MOD17 net primary productivity data is the NPP_QC band. In cases of poor climate conditions or incomplete imaging, the MOD17 product adjusts net primary productivity by injecting the Leaf Area Index (LAI). The value of the NPP_QC band corresponds to the percentage of days during the entire growing season when LAI was injected, with a range from 0 to 100. It is commonly assumed that pixels with NPP_QC values less than or equal to 60 are valid. The updateMask function is used to mask pixels with NPP_QC values greater than 60 to filter out anomalies. Once the above preprocessing steps are completed, the required images can be downloaded as GeoTiff files, with a total of 23 scenes. Piecewise linear regression models explain the relationship between two variables by segmenting them into value intervals, applying linear regression within each segment, and selecting breakpoints to minimize regression residuals. In this study, segmented linear regression is performed on the annual mean NPP and corresponding years for the study area from 2001 to 2023, aiming to examine the temporal trends of NPP. Theil-Sen Median trend analysis is a non-parametric method for trend estimation, featuring high efficiency and robustness against noise, widely applied in long-term trend studies. In this study, pixel- level Theil-Sen Median trend tests were applied to analyze the spatial variation of NPP in Henan Province. The Theil-Sen Median trend analysis formula is as follows: The Mann-Kendall test is a non-parametric statistical method with advantages such as low susceptibility to outliers and no requirement for the sample to follow a specific distribution. The Mann-Kendall test assesses trend significance, where a test statistic Z with an absolute value greater than or equal to 1.96 signifies passing the 0.05 confidence level significance test. This study combines the results of the Theil-Sen Median trend test (β) and the Mann-Kendall test (Z) to classify the study area into the following categories: significant decrease (β<-0.5, |Z|≥1.96), non-significant decrease (β<-0.5, |Z|<1.96), stable (−0.5≤β≤0.5), non-significant increase (β>0.5, Z<1.96), and significant increase (β>0.5, |Z|≥1.96). This study employs the coefficient of variation to assess the stability of NPP changes in Henan Province from 2001 to 2023. The formula for calculation is: Where Cv represents the coefficient of variation, X is the mean value, andσis the standard deviation. According to the coefficient of variation Cv, the research area is classified as high stability (Cv<0.05), medium-high stability (0.05≤Cv<0.1), moderate stability (0.1≤Cv<0.15), medium-low stability (0.15≤Cv<0.2), and low stability (Cv≥0.2). to 2004, the NPP in Henan Province increased rapidly at a rate of 47.34-3.87 g C m-2 a⁻¹, but after 2004, the rate of increase slowed to 2.89 g C m-2 a⁻¹. The rapid rise in NPP between 2001 and 2004 was likely driven by climate change, as historical climate data shows an upward trend in total annual precipitation during this period, reflecting a clear process of climate humidification. The increase in precipitation facilitated vegetation growth and development, while after 2004, the process of climate humidification came to an end, resulting in a slowdown of NPP growth. To explore the spatial distribution characteristics of NPP in Henan Province, this study mapped the spatial distribution of the average NPP from 2001 to 2023. From 2001 to 2023, the multi-year average NPP across Henan Province ranges from 92.26 to 884.58 g C m⁻² a⁻¹, with an overall spatial distribution pattern that decreases from southwest to northeast (see Figure 3). The western regions, such as the Funiu Mountains and Xiong’er Mountains, are the areas with the highest NPP levels, where the forest coverage is high, and the multi-year average NPP exceeds 600 g C m⁻² a⁻¹. In the southwestern region, the multi-year average NPP is between 400 and 600 g C m⁻² a⁻¹. The NPP in the eastern plains follows a distribution pattern decreasing from south to north. The southeastern region has a multi-year average NPP ranging from 400 to 600 g C m⁻² a⁻¹, while the northeastern region falls between 200 and 400 g C m⁻² a⁻¹. Areas in the northeastern part with a multi-year average NPP below 200 g C m⁻² a⁻¹ are sparsely distributed. If the multi-year average NPP values of the study area are divided into intervals with a gradient of 200 g C m⁻² a⁻¹, the area proportions of each interval are as follows: NPP below 200 g C m⁻² a⁻¹ accounts for 0.5%, between 200-400 g C m⁻² a⁻¹ accounts for 37.7%, between 400-600 g C m⁻² a⁻¹ accounts for 58.9%, and above 600 g C m⁻² a⁻¹ accounts for This study conducted a pixel-level Theil-Sen Median trend analysis and Mann-Kendall test on Henan Province's NPP from 2001 to 2023 to explore the spatial distribution characteristics of NPP variation trends. The trend value β of NPP changes in Henan Province ranges from -15.34 to 15.16, with an average of 3.87, indicating an overall increasing trend in Henan's NPP from 2001 to 2023. The trend value β, combined with the Mann-Kendall test result Z, reveals the significance of the changes. In Henan Province, most regions exhibit an upward trend in NPP, with significant increases primarily in the western part of the province and non-significant increases predominantly in the east(see Figure 4). Regions with stable or declining NPP trends are sporadically distributed, mainly near urban areas or large water bodies, where human activities may drive the stability or decline in NPP. From the perspective of area percentage for each trend type, the regions with significant decrease, non-significant decrease, stable, non-significant increase, and significant increase account for 0.9%, 2.4%, 2.5%, 44.6%, and 49.6% of the study area, respectively.",
    "The spatial distribution characteristics of NPP trend stability can be further explored based on the coefficient of variation. The coefficient of variation of NPP change in Henan Province ranges from 0.04 to 0.71, with an average of 0.14, indicating that the NPP variation in Henan Province from 2001 to 2023 is generally at a moderate stability level. From a spatial distribution perspective, the stability of NPP variation trends in Henan Province generally shows a decreasing pattern from southwest to northeast (see Figure 5). This distribution pattern is likely due to the higher vegetation coverage and more stable ecosystems in the western and southern regions. From the perspective of the area distribution of different stability types, regions with high and medium-high stability account for 0.4% and 6.5% of the study area, respectively, mainly located in the mountainous areas of the western part of the province. The area with moderate stability occupies the largest proportion, accounting for 62.4% of the study area. Regions with medium-low stability account for 25.8%, mainly located in the northeastern part of the province. Low stability areas are scattered at the edges of large bodies of water or cities, occupying 4.9% of the study area. Henan is a renowned resource-rich area in China, with a wealth of diverse plant resources. Research on Henan's vegetation generally suggests that the vegetation has improved over the last few decades [7-8], aligning with the results of this study. This study focused on Henan Province, utilizing MOD17 A3 NPP data and employing methods such as segmented linear regression, Theil-Sen median trend analysis, Mann-Kendall test, and coefficient of variation to analyze the spatiotemporal characteristics of NPP from 2001 to 2023, aiming to provide scientific reference for regional plant conservation and ecological management. The conclusions are as follows: (1) In terms of the temporal variation characteristics of NPP, Henan Province's vegetation NPP exhibited a rapid increase from 2001 to 2004, with a rate of 47.34 g C·m-2·a-1. The year 2004 was a turning point in the trend, after which the growth rate decreased to 2.89 g C·m-2·a-1. Overall, from 2001 to 2023, the annual average NPP in Henan Province increased at a rate of 3.87 g C·m-2·a-1, reflecting an improvement in the vegetation condition over time. (2) In terms of the spatial distribution of NPP, from 2001 to 2023, the multi-year average NPP across Henan Province ranged from 92.26 to 884.58 g C·m-2·a-1, generally showing a decreasing trend from southwest to northeast. The multi-year average NPP in the western and southern regions was mostly above 400 g C·m-2·a-1, while in the eastern and northern regions, it was mostly below 400 g C·m-2·a-1. The area proportions for NPP below 200 g C·m-2·a-1, between 200-400 g C·m-2·a-1, 400- 600 g C·m-2·a-1, and above 600 g C·m-2·a-1 were 0.5%, 37.7%, 58.9%, and 2.9%, respectively. (3) In terms of the spatial distribution of NPP change trends, 94.2% of Henan Province exhibited an increasing NPP trend from 2001 to 2023, with a notable spatial differentiation in trend significance, showing a decreasing pattern from west to east; the proportions of areas with significant decrease, non-significant decrease, stable, non-significant increase, and significant increase were 0.9%, 2.4%, 2.5%, 44.6%, and 49.6%, respectively. (4) In terms of the stability of NPP variation trends, the average coefficient of variation of NPP in Henan Province from 2001 to 2023 was 0.14, indicating an overall moderate stability level. The spatial distribution of stability showed a decreasing pattern from southwest to northeast; the proportions of areas with low stability, medium-low stability, moderate stability, medium-high stability, and high stability were 4.9%, 25.8%, 62.4%, 6.5%, and 0.4%, respectively."
]