[
    "Crop stalk is the first largest renewable biomass resource on the earth, and its utilization ways are extensive. Nevertheless, China still remains in a low-level of comprehensive utilization for a long time due to traditional ideas and limited conditions, reflecting with large volume of stalk being abandoned or burnt in the fields thus raise huge wastes of resource and environmental pollutions. In this paper, we identify the Henan is a big agricultural province, one of China’s major grain producing areas, with its grain output among the top in the nation for a long time. Meanwhile, Henan is also a big province of stalk resource, for it produces a large volume of stalk every year. Statistics show that the total yield of crop stalk reached 82.4 million tonnes (or 41 million tonnes of coal equivalent) in 2017. Nevertheless, with the changes in industrial and agricultural production methods and rural residents’ lifestyles in recent years, the narrow utilization ways and the relatively backward comprehensive technology, a fairly large amount of stalk was abandoned or burnt in the fields thus raised huge wastes of resource and environmental pollutions. Therefore, studying the current utilization status of crop stalk resource in Henan province means great practical significance to resource conservation, environment protection and sustainable development of rural and agricultural economy. Based on the stalk production potential and its utilization state in Henan province, this paper analyzes the Renewable energy is an obvious choice for sustainable economic growth and the harmonious coexistence of humans and the environment [1]. As a consequence, sustainable biomass energy has attracted considerable attention from both domestic and international energy economists and agricultural economists. There are complete reviews of work on China’s renewable energy economy before 2010 [2,3]. Recently, Zhang et al. [4] discussed present the situation and future prospect of renewable energy in China, while Wu et al. [5] also addressed current status and future prospective of bio-ethanol industry in China. The following section energy economy. The first group of studies considered general biomass energy issues and their policy implications. Kim & Dale [6] investigated the global potential for bioethanol production globally which had the potential to produce 49.1 GL of bioethanol. Furthermore, approximately 1.5 Pg of dry lignocellulosic biomass from seven kinds of crops were available that could produce up to 442 GL of bioethanol each year. Their results show that the total potential bioethanol production from such sources would be around 491 GL, which is 16 times more than the current world ethanol production each year. Bhattacharya et al. [7] and Li, Hu [8] investigated sustainable biomass production for energy in several selected Asian countries, and Bhattacharya et al. [9] assessed the potential for non-plantation biomass resources. They estimated that the sustainable biomass resources for primary residues, secondary and processing residues, animal manure, municipal solid wastes, and fuelwood could be 8.9 EJ annually. They project that the potential for biomass energy could be 17% of total energy consumption in China. Recently, Sun et al. [10] assessed the potential biomethane production from crop residues and its Contributions to carbon neutrality in China, while Cui et al. [11] replacing chemical fertilizers in China. There are many studies on biomass resources for renewable energy. For example, Zhou et al. [12] also assessed sustainable biomass resources for energy use in China and they concluded that the potential biomass energy from agricultural residues, forest residues, and municipal solid waste could be 25.2 EJ, or 30.2% of total energy consumption for China in 2008. Liu et al. [13] evaluated the potential of China’s renewable energy systems more generally and Zhang et al. [1] discussed the opportunities and challenges for China’s renewable energy and argue that government support is the key for developing renewable energy. Recently, Kang et al. [14] evaluated domestic biomass resources and the associated greenhouse gas mitigation potentials, while Yan et al. [15] have made insights of biomass energy into the nation’s sustainable energy supply in China’s terrestrial ecosystems. Huang Wang et al. [24], Bi et al. [25] and Wang et al. [26]. Recently, Fang et al. [27] crop residue utilizations and potential for bioethanol production in China, while Zhang et al. [28] conducted a spatially explicit analysis of sustainable agricultural residue potential for bioenergy in China under various soil and land management production of agricultural and livestock sector’s residues in China. The third group of papers focused on either specific regions or specific biomass resources. For example, Cai, Liu & Deng [30] investigated biomass resource availability in Shanghai, while Liu et al. [31] quantitatively evaluated the potential of bioenergy from crop resources in Inner Mongolia. Elmore et al. [32] investigated the spatial distribution of rice residues for China’s potential biomass energy production; Zhang et al. (2010) surveyed the productive potential of sweet sorghum ethanol in China. Jansson et al. [33] introduced cassava as a potential biofuel crop, while Yang et al. [34] conducted an energy analysis of cassava-based fuel ethanol in China. Tian et al. (2009) estimated unused land potential for biofuels development in China, while Li et al. [35] assess the sustainable energy potential of non-plantation based biomass resources in China. Yuan & Zhao [36] estimated the supply capacity of crop residue as energy in rural areas of Heilongjiang province, which is the largest grain producing area, while Gao et production and its potential of bagasse in Chinese perspective. The second group of papers concentrated on investigating the potential for, and distribution of, biomass resources, especially crop stalk. Liao et al. [17] studied the distribution and quantity of China’s biomass residues resource, and their results show that the unused agricultural residues account for 51.9% of total residues. Zeng Ma & Ma [18] found that more than half (53.6%) of biomass resources are currently used for rural energy consumption. Liu et al. [19] consider the distribution, utilization structure and potential of crop stalk biomass resources across China and they found that crop stalk from wheat, corn and rice accounts for 80% of the total agricultural biomass resources. Of this, approximately 15% was lost during collection and 20.5% was discarded or directly burnt in the field. Schweers et al. [20] identified the potential regions of China where agricultural biomass could be located and they found that between 1.2% and 6.0% of the national territory is potentially suitable for sustainable bioenergy crop production. Other studies iii. agricultural residues, for example, crop stalk; There are even few studies on how and how much farmer households actually used agricultural residues or crop stalk. To fill The field survey covers the crop stalks from Autumn (corn, rice, soybean, cotton, etc.) in 2017 and Spring (wheat, rape, etc.) in 2018 cross Henan province, which is the second largest of grain producing province in Mainland China. The surveyed area is divided into three types, which are central and eastern plain area, western mountainous and hilly area and southern rice producing area. In plain area, we choose six cities (Zhengzhou, Anyang, Xinxiang, Xuchang, Shangqiu and Zhoukou) as the key region for wheat, corn, rape, soybean, cotton and other crops. In mountainous and hilly area, Luoyang, Sanmenxia and Nanyang are How to cite this article: Lei Ma, Xinyi Zhang, Hengyun Ma, Ruifeng Liu. Investigation and Thinking on the Comprehensive Utilization of Crop Stalk Resource in Henan Province of Mainland China. Ann Soc Sci Manage Stud. 2022; 7(4): 555717. DOI: 10.19080/ASM.2022.07.555717 other crops. We employ a randomly sampling method, and the details are as follows: choose two counties in each selected city, then two towns in each county, two villages in each town and a hundred The main data of the survey are population, farmland, major crops, stalk output, the magnitude of utilized stalk and the using ways. We demonstrated the utilization of biomass resources by Henan is rich in stalk resource, and the movements of stalk differ due to Henan’s various crop types and the diversity in terrain and climate. According to the results of the survey (Table 1), the movement of returning stalk into soil takes the largest share of the total, approximately 62.6%; next is using stalk as fodder, accounting for 11.5%; proportions of using stalk as fuel, raw materials of industry, biogas and edible fungus are 8.9%, The movements of stalk are different specific to each type of area. In plain area, the proportion of stalk returned into soil is as high as 80.0%, and others are generally very low. But in mountainous and hilly area, just 20.4% is returned into soil, meanwhile, 25.9% is used as fodder, 23.6% is used as fuel, 15.6% is abandoned and 9.2% is burnt. The stalk returned into soil is even low in rice producing area (Xinyang), about 10.0% of the total, conversely, more than half is burnt, besides 11.5% is abandoned, fuel and fodder take up 7.1% and How to cite this article: Lei Ma, Xinyi Zhang, Hengyun Ma, Ruifeng Liu. Investigation and Thinking on the Comprehensive Utilization of Crop Stalk Resource in Henan Province of Mainland China. Ann Soc Sci Manage Stud. 2022; 7(4): 555717. DOI: 10.19080/ASM.2022.07.555717 From the sample survey of the ten cities in Henan province, the total stalk output is 40766 tonnes, of which 25532 tonnes (62.6% of the total) is returned into soil. Details are provided in Table 2. It is found in the survey that only two methods are used to return matter which type of area, the stalk returned into soil using the former way is larger than those using the latter way, which is even more obvious in the plain area. From the view of crops, the stalk returned into soil is mainly from wheat and corn in plain area and For the direct way, plain area is flat and open, which is convenient for large agricultural machinery to work jointly. Using combine harvesters at harvest time to break up the stalk and throw it into soil directly not only increase the fertility of the land, but also save physical and financial resources. As a result, the rate of stalk directly returned into soil is very high (about 79%), especially in Xuchang and Xinxiang, it is high to more than 98%. Since the terrain in mountainous and hilly area is complex, harvesting is usually operated by human power instead of large agricultural machinery, thus the rate of stalk directly returned into soil is very low. In rice producing area (Xinyang), it is not be threshed in the fields, so the rate is also very low. For the composting way, most stalk in plain area is directly returned into soil, animals’ wastes are needed for fermentation but the livestock is relatively less and scattered, so the proportion of stalk composted is relatively small. By contrast, farmers compost more stalk in mountainous and hilly area because it is not easy to According to the survey (Table 3), ways of using stalk as fodder are as follows: The first is direct feed. Feeding livestock with stalk is a traditional way in China, which is simple and easy to practice absorption and the input-output ratio is low. From the results of the investigation in the ten cities of Henan province, the proportions are small, about 5.5% in plain area, 24.0% in mountainous and hilly area and 18.9% in rice producing area. For most counties, the proportions are below 20%; only Shanxian, Fangcheng and Huangchuan are more than 30%. It is the differences of terrain, area that results in the remarkable feeding difference. The second is ammoniation, which can improve the digestibility of crude fibers, increase the nitrogen contents of the fodder. The effect on fodder’s palatability improvement and feed intake increment is evident, so it’s easy for animals to digest and absorb. Although there’re many advantages of using ammoniated stalk to feed livestock, it costs much and the process is complicated, along with the decreasing livestock raised by households, fewer farmers which city. The third is ensiling, which can preserve the nutrients contained in the plant, improve the palatability and digestibility. General ensiling technology applies to corn stalk, so the implementation is closely linked to the crop structure. According to the survey, the ensiled stalk accounts for 1.2% of the total and the type is mainly corn stalk. In Henan, plain area is the major corn producing area, part of the mountainous and hilly area also grows corn, but corn is rarely grown in rice producing area. As a result, How to cite this article: Lei Ma, Xinyi Zhang, Hengyun Ma, Ruifeng Liu. Investigation and Thinking on the Comprehensive Utilization of Crop Stalk Resource in Henan Province of Mainland China. Ann Soc Sci Manage Stud. 2022; 7(4): 555717. DOI: 10.19080/ASM.2022.07.555717 usually suit to ruminant animals such as cattle and sheep. In most area of Henan, harvest is done by large machinery and the rate of stalk returned into soil is high, but silage needs fresh corn stalk, With the development of science and technology, crop stalk can be converted into bioenergy directly or indirectly and serve farmers’ production and life. Our survey shows that three methods are used to convert stalk into energy, they are: 1) direct burn; 2) present in Table 4. From the survey, proportions of these three ways in Henan are 8.6%, 0.1% and 1.9%, respectively. In the three types of area, direct burn has low proportions in plain area and rice producing area, about 5.1% and 6.9%; but in mountainous and hilly area it is higher, about 23.6%, of which Nanyang is particularly outstanding with the proportion as high as 47.9%. This is closely Crop stalk is widely used in industry. For example, it can be the materials of paper making, construction and decoration also, it can be used in weaving industry. It can be seen from the survey that the ways of stalk being used as industrial raw materials are concentrated in Henan. The proportions in the three area are 2.3% in plain area, 1.9% in mountainous and hilly area and nearly aero in rice producing area. In the cities of Anyang, Xuchang, Shangqiu, Zhoukou, Luoyang and Nanyang, crop stalk is used for paper making, but the proportions in most regions are small, no more than 1%, except for Nanyang, Shangqiu, Zhoukou and Xuchang with each proportion is 3.3%, 4.3%, 4.9% and 1.3%. Apart from paper making, other industrial How to cite this article: Lei Ma, Xinyi Zhang, Hengyun Ma, Ruifeng Liu. Investigation and Thinking on the Comprehensive Utilization of Crop Stalk Resource in Henan Province of Mainland China. Ann Soc Sci Manage Stud. 2022; 7(4): 555717. DOI: 10.19080/ASM.2022.07.555717 Crop stalk contains nutrients such as carbon, nitrogen and minerals required in edible fungi’s growth. So it can be used to cultivated edible fungi after being chopped by machinery, mainly pleurotus ostreatus, mushrooms, needle mushroom, white fungi, ganoderma, etc. The stalk used to produce edible fungi in Henan (Table 6) in the survey is small and limited in extent, mainly centered in Shangqiu and Luoyang and less in Zhoukou. In terms of absolute number, the largest is Yucheng county of Shangqiu city, about 326 tonnes; next is Luanchuan county of Luoyang city, about 30 The Agricultural Department of Henan Province and the relevant departments have released documents continuously to prohibit stalk burning since 2000. However, in the vast rural areas, it still happens from time to time and is fairly common in some cities. The abandonment of stalk exists in all surveyed cities in different degrees, and 60% of the cities have the burning problem. This phenomenon is even prominent in Luoyang and Xinyang, 48.9% of stalk in Luoyang city is abandoned and 55.8% in Xinyang is burnt. Burning stalk emits large amounts of pollutants such as carbon monoxide, dust and smoke, which has a bad effect How to cite this article: Lei Ma, Xinyi Zhang, Hengyun Ma, Ruifeng Liu. Investigation and Thinking on the Comprehensive Utilization of Crop Stalk Resource in Henan Province of Mainland China. Ann Soc Sci Manage Stud. 2022; 7(4): 555717. DOI: 10.19080/ASM.2022.07.555717 even become a fire hazard. So, the problem of stalk burning and abandoning is still serious in some cities of Henan province.",
    "Being the first largest renewable biomass resource on the earth, crop stalk is important production materials in industry and agriculture, for example, it can be used as fertilizer, fodder, fuel and materials of paper, charcoal, building and fungi. So, stalk has a variety of utilization ways, but it seems restricted according to the survey. The proportion of stalk returned into soil increases year by year attribute to the improving level of agricultural mechanization, approximately 62.6% at present. Traditional utilization ways like direct burn and direct feed still dominate in most areas, while the advancer utilization technology rarely applies. In Sanmenxia and Nanyang, the stalk being fed directly each takes up 20% of their surveyed total, meanwhile nearly 61.1% is burnt directly in Nanyang. The two ways also exist in different levels in other cities. These traditional ways have low resource efficiency: direct feed is not beneficial to animals’ digestion and absorption and has a low input-output ratio; direct burn generates less available heat as It can be seen from the survey that new stalk utilization technology still has some obstacles in popularization in rural areas. Since 2005, Henan has constructed pilot projects of biogas digesters in some cities of the province, and rural biogas has been rapidly popularized. However, very few farmers are found in the survey use stalk to make biogas, instead, human and animal wastes are in the majority. As we learned from the biogas users, it is inefficient to use stalk as material, for it takes time and labor to cut up stalk which is easy to crust and difficult to discharge. Human and animal wastes are more efficient and cheaper, but it needs to raise 3-5 pigs and increase the risk of environmental pollution and zoonosis. Even though it saves famers’ time and energy spent on stalk collection, transportation and stack, is contributive to organic matter increase in soil and keeps farmyards tidy, returning stalk into soil still confronts some problems. For example, if too much stalk were returned, or not being cut up finely, or being ploughed into shallow ground, it would affect the sowing or planting quality, which is harmful to seed germination, emergence, seeding stage Presently, only a small scale of land is operated by rural household in China, approximately 7.5 mu (0.5 ha) in 2006, and in most area the per capita arable land is less than 1 mu. Besides, the land is distributed with several pieces, resulting in a low level of specialization and regionalization, and the types of crop stalk are plentiful and various. Crop stalk in practice is large in volume and with high content of water, which make the collection, bundle and transportation costly. However, according to the demonstration projects such as solidification or gasification and briquetting, low level of water content and large one-time investment are required, which restrict the popularization of these technologies because of their expensive running cost and relatively low economic benefits. Household gasifier demands little investment but has many disadvantages: 1) inconvenient to handle and difficult to fire; 2) tar will ooze from the cooker connector and the gasifier if biomass gas isn’t purely treated, so it is easy to block the connector and the cooker and make the housekeeping practice very poor; 3) the quality of the gas is usually unstable and discontinuous as the gasifier is small and the gasification conditions are hard to control, therefore a security problem may lie; 4)it costs more time with As the first largest renewable resource on the earth, crop stalk has high utilization value and various utilization ways. Henan is a big agricultural province and is fairly rich in crop stalk resource. Thereby enhancing its comprehensive utilization is of great practical significance to the development of “high-yield, high- quality and high-efficiency” agriculture, to the building of “resource How to cite this article: Lei Ma, Xinyi Zhang, Hengyun Ma, Ruifeng Liu. Investigation and Thinking on the Comprehensive Utilization of Crop Stalk Resource in Henan Province of Mainland China. Ann Soc Sci Manage Stud. 2022; 7(4): 555717. DOI: 10.19080/ASM.2022.07.555717 makes the phenomenon of stalk burning and abandoning very popular. It is necessary to publicize the utilization value, technologies, successful utilization experiences of stalk and the harm to local agriculture and environment brought by its burning and abandoning through effective ways, so as to provide a solid In accordance with the general plan and direction of the comprehensive utilization programs such as returning stalk into soil through animals, mechanized return and national countryside energy construction. Based on the actual conditions of Henan, it’s necessary to make middle and long term development plans, especially on ensiling, biofertilizer, biogas and mushroom cultivation to ensure that the organic fertilizer use increase thus raise soil organic matter and improve land capability, and to promote agricultural sustainable development. At the same time, it’s needed to increase the funding for scientific research on biofertilizer, biogas, bioethanol, direct return and compress briquette projects, develop new technologies and equipment which are simple to use, easy to implement, and can sharply cut cost and improve efficiency. For example, stalk-based cellulosic ethanol in Tianguan Group of Henan province has passed the technology assessment and is now the leading non-grain ethanol producing method both at home and abroad. One ton ethanol can be made out of every six tonnes stalk. Given the stalk output in summer and autumn of a town, more than 100 thousand tonnes, a 10-thousand-scale ethanol factory can consumes about 50% of it, with a semidiameter range of 10km, besides, approximate ¥60 million annual income and 100 thousand tonnes logistics can be produced, which not only push the development of rural three to demonstrate and popularize in specific area. For example, promote technologies of ensiling, returning through animals and biogas in the areas with developed livestock and poultry industry; popularize direct return in vast but scarcely populated area; introduce advanced technologies and equipment to produce biofertilizer or biogas in the areas with well-developed green or organic or facilities agriculture, using stalk or dregs and slurry, so that on one hand, reduce the investment of chemical fertilizer and pesticide and lower the non-point and point source pollution, on the other hand, increase the quality of agricultural products The comprehensive utilization of stalk makes contributions to farmers’ income growth and agricultural sustainable development, additionally it is a new industry and the government should emphasize on guidance and support. Apart from the necessary legal restriction or administrative penalty imposed on the burning or abandoning behaviors, the central and local governments should make and perfect the financial subsidies and supporting policies focusing on stalk comprehensive utilization, notably those contribute to famers’ income growth, soil organic matter increase and rural energy and environment solution. For example, ¥10/ m3 is rewarded by municipal finance in Kaifeng when a new silo granary, which is 100 cubic meters or above be constructed; Qi county (in Kaifeng) offers a subsidy range from ¥300 to ¥500 for a 50-m3 silo granary and ¥500 for every stalk cutter of 4 tonnes or above. In Anyang, municipal finance subsidies ¥50 for every new household biogas digester and give a reward of ¥15,000 for new How to cite this article: Lei Ma, Xinyi Zhang, Hengyun Ma, Ruifeng Liu. Investigation and Thinking on the Comprehensive Utilization of Crop Stalk Resource in Henan Province of Mainland China. Ann Soc Sci Manage Stud. 2022; 7(4): 555717. DOI: 10.19080/ASM.2022.07.555717 How to cite this article: Lei Ma, Xinyi Zhang, Hengyun Ma, Ruifeng Liu. Investigation and Thinking on the Comprehensive Utilization of Crop Stalk Resource in Henan Province of Mainland China. Ann Soc Sci Manage Stud. 2022; 7(4): 555717. DOI: 10.19080/ASM.2022.07.555717 How to cite this article: Lei Ma, Xinyi Zhang, Hengyun Ma, Ruifeng Liu. Investigation and Thinking on the Comprehensive Utilization of Crop Stalk Resource in Henan Province of Mainland China. Ann Soc Sci Manage Stud. 2022; 7(4): 555717. DOI: 10.19080/ASM.2022.07.555717 How to cite this article: Lei Ma, Xinyi Zhang, Hengyun Ma, Ruifeng Liu. Investigation and Thinking on the Comprehensive Utilization of Crop Stalk Resource in Henan Province of Mainland China. Ann Soc Sci Manage Stud. 2022; 7(4): 555717. DOI: 10.19080/ASM.2022.07.555717 How to cite this article: Lei Ma, Xinyi Zhang, Hengyun Ma, Ruifeng Liu. Investigation and Thinking on the Comprehensive Utilization of Crop Stalk Resource in Henan Province of Mainland China. Ann Soc Sci Manage Stud. 2022; 7(4): 555717. DOI: 10.19080/ASM.2022.07.555717"
]