[
    "Zhijia Gu 1,2,*, Yuemei Li 1,2, Mengchen Qin 1, Keke Ji 1,2, Qiang Yi 2,3, Panying Li 2,3 and Detai Feng 4 Citation: Gu, Z.; Li, Y.; Qin, M.; Ji, K.; Yi, Q.; Li, P.; Feng, D. Spatiotemporal Variation Characteristics of Extreme Precipitation in Henan Province Based on RClimDex Model. Atmosphere 2024, 15, 1399. https://doi.org/10.3390/ atmos15111399 Abstract: Global warming has led to an increasing frequency and intensity of extreme precipitation events worldwide. The extreme precipitation of Henan Province in central China usually occurs in summer, with the climate transition from the northern subtropical to the warm temperate climate. Compared with the study of extreme precipitation events in other regions, the study of Henan Province pays less attention. In order to systematically understand the spatial and temporal charac- teristics of extreme precipitation in Henan Province, this study applied RClimDex model to obtain nine extreme precipitation indices based on daily precipitation data from 90 meteorological stations from 1981 to 2020. Linear propensity estimation, M-K mutation test, Morlet wavelet analysis, and geostatistical analysis were used to investigate the spatial and temporal variation characteristics of the extreme precipitation indices in the region. The results indicated that continuous dry days (CDD), number of heavy rain days (R20mm), maximum daily precipitation (Rx1day), maximum precipitation for 5 consecutive days (Rx5day), and precipitation intensity (SDII) showed an overall increasing trend, but none passed the significance test (p > 0.01). Extremely strong precipitation (R99p) and Rx5day changed abruptly in 1994, and Rx1day and SDII changed abruptly in 2004. The seven extreme precipitation indices, except CDD and continuous wet days (CWD), had a 30-year cyclical pattern. The multi-year average of extreme precipitation indices showed that the CDD gradually decreased from north to south, CWD and R20mm gradually increased from north to south. Rx1day and Rx5day gradually increased from northwest to southeast, and SDII increased from west to east. The results can contribute valuable insights to extreme precipitation trends and future climate predictions in Henan Province and provide scientific support for coping with extreme precipitation changes and disaster prevention. Copyright: © 2024 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). Managing the Risks of Extreme Events and Disasters to Advance Climate Change Adaptation (SREX) reported by Intergovernmental Panel on Climate Change (IPCC) empha- sizes that since the 20th century, the frequency and intensity of extreme precipitation events have generally increased in most parts of the world [1,2]. In the northern hemisphere, espe- cially in the middle and high latitudes, the extreme precipitation index showed an obvious increasing trend [3,4]. According to climate simulations, extreme precipitation events in the northern hemisphere are expected to continue to intensify over the 21st century [5,6]. The heightened frequency of extreme precipitation poses significant risks to socio-economic well-being and human lives, hindering the region’s sustainable development [7]. Events of extreme precipitation, characterized by suddenness and hazardousness, are the primary contributors to regional natural disasters and ecological and environmental problems [8]. The analysis of extreme precipitation events is becoming increasingly important due to their significant impacts on regions worldwide. Studies have indicated a notable increase in extreme precipitation indices globally, demonstrating a growing frequency of extreme precipitation events [9–11]. A study by Li et al. [12] highlighted a significant upward trend in extreme precipitation in most countries and regions. Furthermore, Wei et al. [11] observed an expanding precipitation range in the northern hemisphere, with a concurrent rise in the frequency and intensity of heavy rainfall and extreme precipitation events. Many researchers have quantitatively calculated the extreme precipitation indices and its spatial and temporal distribution based on the RClimDex model [13–16]. The RClimDex is a model developed by Zhang et al. [17] of the Canadian Meteorological Research Center based on R language to calculate multiple extreme climate indices. It is recommended by the Climate Committee of the World Meteorological Organization for climate change detection, monitoring, and extreme climate index analysis and has been used worldwide. Based on the RClimDex model, extreme precipitation indices were widely selected in North America [18], South America [19], Asia [20], Europe [21], and Africa [22] to detect climatological trends. In China, the frequency and intensity of extreme precipitation events have increased significantly in recent decades, and the extreme precipitation index has obvious spatial differentiation [23]. As a transition area from subtropical climate to warm temperate climate, Henan Province has significant variations in precipitation patterns, which often lead to drought and flood disasters. Studies of Henan Province have indicated an overall upward trend in extreme precipitation events, with higher occurrences observed in the southeast region compared to the northwest [24,25] Given the limitations of previous studies, particularly in terms of station selection and data coverage, there is identifiable significance in conducting a more comprehensive analysis of extreme precipitation changes within the context of climate change.",
    "The purpose of the present study is to systematically explore the spatial and temporal characteristics of extreme precipitation in Henan Province based on long time series (from 1981 to 2020) and high-density meteorological stations (90 meteorological stations). The RClimDex 1.0 model was applied to extract extreme precipitation indices. Linear tendency estimation, M-K mutation testing, wavelet analysis, and geostatistical analysis were used to investigate the temporal and spatial evolution patterns of extreme precipitation in Henan Province. The results of this study were anticipated to provide valuable insights into the changing patterns of extreme precipitation over the past four decades in Henan Province. Moreover, the findings can provide essential references for evaluating the ecological impact of extreme precipitation in the region. Henan Province (38◦42′–53◦36′ N, 115◦24′–135◦12′ E) is located in the central eastern part of China in the middle and lower reaches of the Yellow River. The terrain is high in the west and low in the east. The Taihang Mountains, Funiu Mountains, Tongbai Mountains, and Dabie Mountains are distributed in a semi-circular pattern along the provincial boundary in the north, west, and south, with the Huang-Huai-Hai Plain in the central and eastern parts and the Nanyang Basin in the southwest. Henan belongs to the warm temperate subtropical and humid semi humid monsoon climate, which is a continental monsoon climate transitioning from the northern subtropical zone to the warm temperate zone. The spatial and temporal distribution of precipitation is uneven, with May to August accounting for over 70% of the annual precipitation [26]. This study compiled daily precipitation data from 119 meteorological stations in Henan Province. However, 29 stations were found to have incomplete data and did not pass the data consistency test. A double mass curve was used to check the consistency of precipitation data by comparing data for a single station with that of a pattern composed of the data from several other stations in the area. To ensure a standardized and reliable dataset, daily precipitation data of 90 meteorological stations ultimately were selected in Henan Province from 1981 to 2020. The spatial distribution of these stations is shown in Figure 1. The defined and calculated extreme precipitation indices from the index system were determined by the World Meteorological Organization’s Climate Committee, Climate Variabil- ity and Predictability Program, and Expert Team for Climate Change Detection Monitoring and Indices (ETCCDMIs) [27]. Based on the definition and calculation criteria of extreme precipitation indices, nine extreme precipitation indices were finalized to describe and assess the extreme precipitation in Henan Province (Table 1). The extreme precipitation indices were obtained in software R (R version 4.3.0) (see http://www.r-project.org accessed on 8 November 2024) using the source code RClimDex package, which is developed by ETCCDMI. Ordinary Kriging was applied to evaluate the spatial distribution of extreme precipita- tion indices. The theory was derived from that of regionalized variables [28] and can be briefly described by considering an intrinsic random function denoted by z(si), where si represents all sample location, i = 1, 2, . . ., n. An estimate of the weighted average given by the ordinary Kriging predictor at an unsampled site z(s0) is defined by the following: where λ refers to the weights assigned to each of the observed samples. These weights sum to unity so that the predictor provides an unbiased estimation: b = A vector of estimated semi-variances between the data points and the points at which the variable z is to be predicted. In the context of trend analysis for the extreme precipitation index, linear propensity estimation involves the application of linear regression to determine the linear trend within a dataset. This method is commonly employed for the analysis of temporal trends and cyclical variations in time series data. Specifically, the linear propensity estimation captures the general linear patterns exhibited by the data. In the context of this study, the analysis applied linear trend estimation to examine the trend patterns of extreme precipitation index [29]. The extreme precipitation index variable is denoted as xi, where i represents the sample size n, and ti represents the corresponding time. A univariate linear regression model is established between xi and ti as expressed by the Equation. This Equation represents a special case of simple linear regression, which entails representing the relationship between the precipitation index x and time t using a linear model.",
    "The Mann–Kendall test, also referred to as the M-K or nonparametric test, is a method recommended by the World Meteorological Organization (WMO) and serves as a valuable tool for effectively distinguishing natural fluctuations from definite variation trends. This non- parametric statistical test is utilized to analyze the variation trends in climate and hydrological series over time, as well as for the detection of precipitation trends and drought frequency under the influence of climate change. It can be applied to samples that may or may not conform to a normal distribution and is robust in the presence of outliers. For this reason, the M-K test excels in detecting abrupt climate change [30]. The main steps of the M-K test involve constructing a rank sequence for a time series X comprising n samples [31,32]. For time series X comprising n samples, a rank sequence is constructed as follows: where k is the sample size; ri is used to determine whether the value at time i is larger than the value at time j; the rank sequence Sk represents the cumulative number when values are larger at time j than those at time i. In the context of this study, it is important to note the following relationship: UF1 = 0, where E(Sk)and Var(Sk)representthemean andvarianceof theranksequenceSk. Itisworth mentioning that UFi follows a normal distribution. By using Equation (6), a positive UF trend was observed. The same approach was employed to derive the corresponding UB curve from the inverted series, i.e., UBk = −UFk. When visualizing the curves, it is noted that if the UF test statistics result exceeds 0, the variable demonstrates an increasing trend. Conversely, if the UF test statistics result falls below 0, it indicates a decreasing trend for the variable. Furthermore, the occurrence of an intersection point between the UF and UB statistics, situated between the critical lines, serves to determine the onset of climate alteration, specifically the year in which climate change begins. To investigate the inter-annual and decadal variability of extreme precipitation, our study employed wavelet transform to analyze the predominant frequency modes and their temporal evolution. Wavelet analysis, which is commonly performed using a single mother wavelet, encompasses two main types: discrete and continuous wavelet analysis [33]. The Morlet wavelet is calculated as follows [34,35]: where c is a dimensionless constant, i is an imaginary unit, and t is a time variable. The relationship between the wavelet period T and the scaling scale a is as follows: Wavelet analysis can be employed for decomposing the time series of the extreme precipi- tation index, acquiring its wavelet coefficients, and computing the variance associated with each wavelet coefficient. This enables the determination of the variance distribution at various scales, which then facilitates the identification of principal cycles influencing the extreme precipitation index by identifying variance peaks and their respective time scales or main cycles. The flowchart of the study to detect spatial and temporal variation of extreme precipi- tation indices is shown in Figure 2. The multi-year average extreme precipitation indices for each meteorological station were obtained based on the RClimDex model from 1981 to 2020. The spatial distribution of extreme precipitation in Henan Province from 1981 to 2020 was determined using the Kriging method. Analysis of the sustained dry period, as indicated by the consecutive dry days index, revealed a higher occurrence in the northern part and a lower occurrence in the southern part of the province (Figure 3a). On average, the CDD index was approximately 57 days. In the northern part of Henan Province, the number of sustained dry days generally exceeded 60, reaching 86 days at the Mianchi station and a low of 30 days in the southern part. Moreover, the southern part of Henan Province exhibited the highest number of CDDs (86 days), while the southern part experienced about 45 days, with a low of 30 days at the Nianyushan station. In contrast to the spatial distribution of the mean CDD value during the persistently dry period, the mean value of the CWD index during the persistently wet period (Figure 3b) was approximately 5 days, exhibiting an overall spatial pattern of lower values in the northern region and higher values in the southern region. The station of Nanle in the northern region of Henan presented the lowest number of persistently wet days (4 days), while the station of Tongbai in the southern region of Henan recorded the highest number of persistently wet days (7 days).",
    "The spatial distribution of the mean annual total precipitation PRCPTOT (Figure 3c) primarily demonstrated a gradual increase from northern to southern regions. The lowest annual precipitation (504.6 mm) was observed at the meteorological station in Xinxiang City, located in the northern region of Henan Province. Conversely, the highest annual total precipitation (1224.91 mm) was recorded at Xinxian in the southern part of Henan Province. The spatial distribution of the multi-year average number of heavy rainy days R20mm (Figure 3d) exhibited a consistent trend with that of the persistent wet days CWD, indicating a gradual decrease in precipitation from south to north. The multi-year average value of the number of heavy rainy days R20mm was observed to be 10 days. Additionally, the multi-year means of R95p (Figure 3e), R99p (Figure 3f), Rx1day (Figure 3g), and Rx5day (Figure 3h) demonstrated an increasing trend from northwest to southeast. Notably, the highest values of R95p and R99p were both recorded at the Nianyushan station, while the maximum precipitation values for Rx1day and Rx5day were observed at the Tongbai station. Based on the analysis, it was found that the Mianchi station recorded the lowest values of the multi-year averages of strong precipitation R95p, exceptionally strong precipitation R99p, Rx1day, and Rx5day. Additionally, the east–west distribution of precipitation intensity SDII (Figure 3i) exhibited significant variation, with high-value areas predominantly distributed in Shangqiu City, Xinyang City, and parts of Zhumadian City in eastern Henan, and low-value areas were mainly concentrated in Sanmenxia City, Luoyang City, and Jiyuan City in western Henan. The analysis of the interannual trend in the extreme precipitation indices in Henan Province from 1981 to 2020 revealed that R20mm, Rx1day, Rx5day, and SDII collectively showed a slight upward trend. Notably, the upward trend in SDII was more pronounced. However, none of these trends demonstrate statistical significance at the α = 0.01 level. The interannual trend in CDD did not display a clear trend. Specifically, the positive CDD value reached its peak in 2011, while the negative distance level was the highest in 2019. In addition, since the beginning of the 21st century, CDD has shown a pattern of first decreasing and then increasing (Figure 4a). The highest CWD index values were recorded in 1989 and 2003, with the lowest value occurring in 1986. The interannual trend in change was not readily apparent (Figure 4b). While the overall trend in PRCPTOT displayed little interannual variability, there was a decreasing trend in precipitation during the study period (Figure 4c). The interannual variability of R20mm exhibited a continuously increasing trend after 2011 (Figure 4d). Heavy precipitation demonstrated an increasing trend after 2011 (Figure 4e), whereas exceptionally heavy precipitation showed a general decreasing trend (Figure 4f). At the study period, there is a discernible upward trend in both the Rx1day and the Rx5day, with Rx1day exhibiting an even more pronounced trend (refer to Figure 4g,h). Additionally, the peak of the mean daily precipitation intensity was recorded in 2000 and 2020, displaying an increasing trend over the study period, particularly pronounced after 2011 (Figure 4i). M-K mutation test and sliding t-test were used to detect the abrupt analysis from 1981 to 2020. At the study period, the CDD exhibited an increasing trend during the persistently dry period and a decreasing trend during the persistently wet period (Figure 5a,b). The trend in PRCPTOT was relatively indistinct before 2005, with a significantly increasing trend after 2005. However, the increasing trend weakened after 2011 (Figure 5c). The mutation of PRCPTOT occurred in 2004–2005. In the analysis of the number of rainstorm days (Figure 5d), most years after 1989 had the decreasing trend, which was consistent with the increase in the UF curve above 0. However, the decreasing trend was not found to be statistically significant, except for a few years. Except for 1988, 1991–1996, and 2011–2020, the heavy precipitation (Figure 5e) remained at a scale of 0. In 1984, the UF curve exceeded the significant level of 0.05 while intersecting with the UB multiple times and featuring multiple pseudo-mutant points. The UF curve (Figure 5f) representing the significant heavy precipitation event showed a downward trend after 1985. This trend was evident particularly in the years between 1999 and 2001, following an upward trend in 1998 after a mutation. The curves for 1993, 2015, and 2019 all exceeded the significance level of 0.05, indicating a significant downward trend during this period. Additionally, the sliding t-test results indicated that the values exceeded the confidence interval in 1994 and the years between 2003 and 2005.",
    "The difference between the maximum daily precipitation (Figure 5g) and the maxi- mum 5-day precipitation (Figure 5h) was generally not significant. However, noteworthy deviations were observed in the UF curves after the mutation events in 1985 and 1994. The UF curves demonstrated a declining trend after these mutation points while displaying an increasing trend in subsequent years. The 5-day maximum precipitation surpassed the 0.05 significance line in 2004. Furthermore, the sliding t-test for the 1-day maximum precipitation exceeded the confidence interval in 2004–2005. The sliding t-test for the 5-day maximum precipitation exceeded the confidence interval during 1993–1995. The UF delineating precipitation intensity (Figure 5i) indicated values above the 0 scale throughout the period 1981–1987, demonstrating an ascending trend. Subsequently, the UF exhibited values below the 0 scale during the period 1987–1996, indicating a declining trend. A series of abrupt change points intersected the UB curve circa 1998. Following this, the UF displayed values above the 0 scale with an ascending trend, except for the interval 2013–2016. Furthermore, the SDII sliding t-test for precipitation intensity surpassed the confidence interval in 1993–1999, 2004–2005, and 2007. According to the results of M-K test and sliding t test, mutations of R99p and Rx5day occurred in 1994, and mutations of Rx1day and SDII occurred in 2004. There were no significant changes in other extreme precipitation indices during the study period. A total of nine extreme precipitation indices were chosen for Morlet complex wavelet analysis from 1981 to 2020. The research involved the creation of contour plots illustrating the real part of the wavelet coefficients, as well as the generation of wavelet variance plots for further analysis. In the context of the contour plot, each contour line is a representation of the real part of a wavelet coefficient. These coefficients reflect the periodic changes in the annual extreme precipitation index at different time scales. It also provides insights into the potential future trends in annual precipitation at varying time scales. A positive contour line indicates a higher extreme precipitation index, while a negative line signifies a lower index. The peaks of the wavelet variance are conventionally regarded as the primary cycles in which the extreme precipitation index manifests. The highest values of the wavelet variance correspond to the primary cycle, while the subsequent lower values pertain to the secondary cycle. The real part of the complex wavelet coefficients representing the extreme precipitation index in Henan Province was observed, as shown in Figure 6. The results revealed that a majority of these coefficients were present for 1 to 3 cycles during the study period from 1981 to 2020. The continuous dry period exhibited strong oscillations on a time scale of 20–26 years. The highest peak was observed in 2013, while low values were recorded in 2005 and 2020, with a periodicity of 20–26 years. Analysis through wavelet variance plots indicates the presence of two distinct cycles of change in the CDD. The first main cycle of the CDD was characterized by a maximum variance value occurring at a 23-year interval, while the second cycle spans 42 years and displays 5 alternating changes. CWD showed dominance of 9–12- and 38–42-year scale variations in cycles, with an oscillation center of approximately 11 years (Figures 6b and 7b). In addition, cyclic variations are evident during the 38–42-year period, with a center scale of about 40 years and a primary cycle of 11 years, characterized by five alternating variations. PRCPTOT appeared a notable cyclic oscillation on the 22–30-year time scale, with a central frequency of approximately 29 years. Additionally, cyclic variations in the 8–12-year period are evident, with a central scale of approximately 10 years. This can be observed from the small wavelet variance plots, revealing a primary cycle of 29 years and a secondary cycle of about 10 years, both displaying five alternating changes. The analysis revealed that heavy rainfall days (Figures 6d and 7d), heavy precipitation (Figures 6e and 7e), exceptionally heavy precipitation (Figures 6f and 7f), and 1-day maximum precipitation(Figures 6g and 7g)exhibitednotablecyclicoscillationsonatimescaleof28–33years, with the center of oscillation occurring approximately every 30 years. Moreover, cyclic patterns were also observable within the 7–9-year period, with a center of oscillation at approximately 8 years. The primary cycle had a periodicity of 30 years, while the secondary cycle displayed a periodicity of 8 years, manifesting 5 alternating phases.",
    "Rx5day and SDII showed the significant cyclic oscillations on a 28–32-year time scale, with the central point of the oscillation occurring approximately every 30 years. Additionally, there existed noticeable cyclic variations on the 6–8 and 54–60-year time scales, with central points occurring approximately every 8 and 56 years, respectively. The primary 30-year cycle has undergone five alternating changes. The increasing frequency of climate extremes globally can be attributed to the El Niño phenomenon [36,37]. This has resulted in various extreme weather events such as heavy rainfall and flooding in the coastal countries of South America, drought in Indonesia, eastern Australia, and southeastern Africa, as well as warm winters in North America [38,39]. Notably, there has been a decrease in the number of hurricanes in the Atlantic Ocean, coupled with an increase in the number of hurricanes in the eastern Pacific Ocean in the Northern Hemisphere. In China, the period after the mid-1990s witnessed a more pronounced inter-annual variation in the frequency of extreme heat events, leading to record-breaking temperatures that surpassed historical extremes [40,41]. The impact of climate change has particularly contributed to heavy precipitation in most areas of the Yangtze River Basin and its northward regions [42–44]. The Yangtze River Basin experiences heavy precipitation during the rainy season, while the northern part of Southwest China to North China encounters heavy precipitation in the summer months [45–49]. The trend in extreme precipitation events varied in different regions of China. The frequency of annual extreme precipitation in the middle and lower reaches of the Yangtze River, the northern part of the northwest China, and the western part of the southwest China showed a significant increasing trend, while the north China showed a decreasing trend [50]. The precipitation and precipitation days in north China continue to decrease, with a clear tendency towards aridification, which is consistent with the results of this study. However, the Rx1day, Rx5day, and SDII in Henan Province presented an increasing trend, which means that both droughts and floods will tend to increase at the same time. The influence of La Niña on China’s climate patterns results in the northward movement of the summer rain belt, leading to the phenomenon of “drought in the south and flood in the north”. It is important to note that extreme climate events have lagging effects, affecting not only the present but also exerting a series of delayed impacts in the future [51]. Studies have been conducted on the lagging effects of climate, employing hysteresis modeling to predict the environmental impact of sudden climate changes [52]. As the global atmosphere warms, evapotranspiration increases atmospheric moisture, con- sequently amplifying the frequency of extreme precipitation events. Additionally, changes in precipitation patterns have been influenced by the moderating effect of the atmospheric circulation North Atlantic Oscillation (NAO) at high, middle, and low latitudes [53]. Apart from atmospheric warming, other factors such as sunspots, topography, and dimensionality also wield some influence over changes in extreme precipitation [54]. Research on extreme precipitation events and their influences on various aspects, such as hydraulic engineering, the ecological environment, and the local economy, has been a focus of recent studies [55]. While many of the existing studies concentrated on the relationship between extreme rainfall and thermodynamics, there has been relatively little investigation into the connection between extreme precipitation events and climate change. A comprehensive analysis of the nonlinear response of runoff coefficients to runoff mechanisms was conducted. The study revealed a significant mutation in global extreme surface runoff at 24 ◦C, indicating the complex nature of extreme runoff response [56,57]. Furthermore, the analysis also identified several anthropogenic factors such as carbon emissions, deforestation, agricultural irrigation, land-use changes, and urbanization as influencing the surface runoff mechanism. These findings emphasize the need for a more holistic understanding of the various factors contributing to extreme runoff events and their potential implications for the environment and human activities [58]. The regular incidence of precipitation events has led to significant economic and human repercussions on a global scale [59–61]. Henan Province, characterized by a large population and predominantly agricultural land-use, is particularly susceptible to sudden extreme precipitation events, which can have severe adverse effects on agricultural production and social well-being. The results showed that R20mm, Rx1day, Rx5day, and SDII showed an overall increasing trend. These indices contribute a lot to total precipitation. Studies indicated that Rx1day, Rx5day, and SDII index had significant correlation with longitude and altitude in Henan Province [62]. The increase in these indices will increase the risk of flooding and soil erosion in the western part of Henan. Six ninths extreme precipitation indices all showed the increasing trend. This indicates that there will be more precipitation in Henan Province and greater intensity of precipitation. The continuous increase in CDD also indirectly explains the uneven distribution of precipitation over time scales. Henan Province is likely to face continuous drought or extreme heavy rainfall weather phenomena.",
    "Based on the daily precipitation observation data of meteorological stations, this study detected the temporal and spatial distribution characteristics of extreme precipitation in Henan Province in the past 40 years, and provided reference for ecological environmental protection and disaster prevention and reduction in Henan Province. It is important to note that due to stringent criteria for the selection of precipitation data, certain meteorological stations may have been excluded from the analysis. High density and long time series rainfall data are more conducive to the study of regional extreme precipitation events. Therefore, future studies should strive to obtain more complete precipitation series data, so as to expand the study time range as much as possible, so as to capture longer-term trends. In addition, utilizing multiple data sources and analysis methods is crucial for revealing more comprehensive and accurate trends and patterns of change. In the context of global warming, extreme weather events such as extreme precipitation occurred more frequently and have more significant impacts [63]. It is great significance for the study of extreme precipitation processes and physical mechanisms. It is worth noting that current research has limited exploration of the driving factors behind extreme precipitation changes in Henan Province, which means that further research is needed to investigate the mechanisms of extreme precipitation formation. This study presented a comprehensive analysis of 90 daily precipitation series from meteorological stations in Henan Province from 1981 to 2020. Nine extreme precipitation in- dices in Henan Province were calculated using the RClimDex 1.0 model. The study focused on conducting a multi-model analysis to explore the spatial and temporal characteristics of these extreme precipitation indices. The main findings of the study are as follows: Author Contributions: Conceptualization, Z.G. and K.J.; methodology, Z.G.; software, M.Q.; vali- dation, Q.Y., Y.L. and P.L.; formal analysis, D.F.; investigation, K.J.; resources, Q.Y.; data curation, P.L.; writing—original draft preparation, M.Q.; writing—review and editing, Z.G.; visualization, Q.Y.; supervision, Y.L.; project administration, D.F.; funding acquisition, D.F. All authors have read and agreed to the published version of the manuscript. Funding: This research was funded by Key Research Projects of Higher Education Institutions in Henan Province, grant number 25A170004 and Nanhu Scholars Program for Young Scholars of XYNU, grant number 2019046. Data Availability Statement: The data that support the findings of this study are available on request from the corresponding author, [Z.G.], upon reasonable request."
]