[
    "Abstract: With the rapid development of the economy and continuous urban expansion, the sharp increase in land demand under the existing land scale and the limited supply of land resources have led to a serious intensification of contradictions. Improving land use efficiency, especially construction land use efficiency, has become an inevitable direction for future development. This is also a challenge faced by the comprehensive and sustainable development of China’s urban economy and society. Among other benefits, evaluating the efficiency of urban construction land use can maximize the distribution of land resources, improve the overall advantages of construction land, and encourage land management. This paper establishes and illustrates the evaluation based on three aspects: economic benefits, social benefits, and ecological benefits, to establish an index system for the evaluation of urban construction land use efficiency in Henan Province. In this paper, the coordination trend and efficiency of land use in urban construction in Henan Province are analyzed, discussed, and evaluated. From the 1980s to the present, the rate of urban construction has increased worldwide, and in just 40 years, several well-known megacities and large cities have emerged. This rapid urbanization process has increased the demand for land for construction, which has resulted in the occupation of a vast amount of land and exacerbated the conflict between humans and land[1]. Therefore, maximizing the value of land resources per unit area, meeting the demand for land resources in urban development, and maximizing the effectiveness of land resource utilization per unit area have emerged as popular subjects for analysis and research among academics both domestically and internationally. socioeconomic development, and how it is used has a direct impact on how quickly socioeconomic development advances[2]. The uncontrolled growth of construction land for urban areas is a prominent feature of China's urbanization process, posing a significant risk to the country's arable land and food security. To mitigate the risks associated with this occurrence and accomplish sustainable resource management, the government has initiated stringent management of the construction land supply area. When the supply of land for urban construction declines, the emphasis switches from “expansion-oriented development” to “intensive development”, which entails modifying how land is used for urban construction, boosting the amount of land that is available, and enhancing the effectiveness with which land resources are used. In the process of urbanization, this shift is a pressing issue that needs to be addressed by government at all levels. The study of urban construction land use efficiency in the corresponding provinces can provide a more thorough analysis of the current state of urban construction land resource allocation in China[3]. Unreasonable phenomena in the resource allocation process have been exposed by research on the variables affecting the effectiveness of urban construction land use. These studies have thoroughly examined the rational and scientific use of available land for urban construction, which has positively aided in the development of the area. First theoretical studies of land use efficiency in urban construction abroad were mostly carried out by the ecological school, primarily through descriptive methods. They provided an organized and transparent spatial distribution and evolution of land types used for urban construction. Urban construction land patterns, such as axial patterns, multi-core patterns, sector patterns, and concentric circle patterns, were grouped and summarized. These patterns were not the same as the historical form school's descriptive and inductive methods. Theoretical research on the efficiency of urban construction land use, the early descriptive approach dominated by the ecological school of thought, the spatial distribution and evolution of urban construction land use types are clearly shown, and urban construction land use patterns are organized and summarized, such as the axial pattern, the concentric circle pattern, the fan pattern, and the multi-core pattern, etc., which are differentiated from the historical forms of the school of thought in the descriptive and inductive approaches. The three main characteristics of urban construction land use are as follows: bidding rent is inversely proportional to the distance from the city center; tends to naturally differentiate into spatial elements of various land- use types; and the intensity of urban use is characterized by a gradual decrease from the center outwards. The economic location theory is based on the market equilibrium theory and is derived through the application of spatial economics theory and systematic mathematical analysis. Urban boundary delineation and efficient land use patterns are unaffected by the emergence of a competitive land market. Guidance for optimizing the distribution of urban land resources and enhancing land use efficiency is provided by the advancement of theories on urban construction land efficiency[4]. Furthermore, the behavioral school of urban land use research emphasizes the importance of studying people to foster their incentives. This is done with the aid of political economy theory and methodology, which is used to present the intrinsic incentives associated with urban land use[5].",
    "Although China has done extensive research on the effectiveness of using land for urban construction, there are variations in the benefits of the land at different phases as well[6]. The fundamental theories of urban construction and utilization efficiency, the evaluation index system for urban construction land use efficiency, urban construction land use patterns, and practical strategies for improving land use efficiency and creating logical planning are the main topics of research on land use efficiency in urban construction in China. The evolution of land planning concepts and the reform and enhancement of land systems have caused a gradual shift in research on urban construction land toward rationalization and efficiency. Studies on the use of urban land for sustainable development are carried out in practically all Chinese cities[7]. Urban construction land is a vital conduit for daily urban activities and production, and the growth of a city is directly correlated with the efficiency of its use. Using construction land in the province of Henan as the research object, a new, scientifically sound land use model can be built by assessing the efficiency of construction land use[8]. This can tightly regulate growth, raise the standard of construction land management in Henan province, and maximize development potential on already-existing construction land. Establishing and enhancing the evaluation system and long-term mechanisms for the efficient and intensive use of construction land in the province of Henan is crucial. Furthermore, based on the current use of construction land, suggestions and plans can be made for the supply of construction land in Henan province in the future. The spatial position, arrangement, distribution, and diverse location relationships of human production and everyday activities are all included in the broad definition of location. It encompasses the locations of transportation, industry, and nature. Resources for construction land are located differently as a result of the different types of locations' organic integration and effects within regional space. The goal of location theory is to rationalize production layout by examining the locational phenomena of human activities or behaviors, with an emphasis on economic location. It necessitates a thorough examination and justification of the factors that led to the different economic entities' geographic placement on the map. It entails carrying out an in-depth investigation into the elements and validity of their existence. Systems theory has a long history and first appeared in ancient Greece. In 1945, Bertalanffy formally put forward the concept of systems theory in his book about general systems theory, which became an important theoretical foundation for the discipline of systems theory. The integration of several elements into a whole with a specific function through a specific structural form is the main idea conveyed in systems theory. As a result, each element is combined with units to create a particular structure rather than just being added. Its constituent parts and the whole will be greatly impacted by the various functions and effects that different structural combinations will produce. Urban built-up land is a system of complete core elements that work together to form a specific structure and serve both the socioeconomic and individual functions of the land. The goal of sustainable development goes beyond development and emphasizes sustainability, the integration of short and long-term objectives and interests—that is, the comprehensive, coordinated, and sustainable development of society, the economy, population, and resources—must be the primary focus of sustainable development. The efficient and sustainable use of natural resources, particularly land resources, is essential to ensuring sustainable socioeconomic development[9]. Future use in the long run is the primary goal of sustainable development, and the integration of social, economic, and environmental benefits must be recognized and investigated holistically. The supply and demand for urban construction land are increasingly at odds, and as cities continue to grow, so does their limitation. This trend will only intensify and deepen as urban construction land becomes more and more in demand. Consequently, sustainable development must be the primary consideration when using land for urban construction. Intensive land use is a type of land use that involves increasing investment in limited land to obtain high returns. According to the law of diminishing returns on land, under specific circumstances, land returns will rise as long as the initial investment keeps rising and will fall as long as the investment goes over a predetermined threshold. To effectively utilize construction land resources, rational development and utilization of construction land must be combined with the theory of diminishing returns on land. This will allow for the planning and adjustment of the city's scale, the strict control of the disorderly growth of urban construction land, and the promotion of rational development and utilization of construction land[10].",
    "The Urban Land Use Classification and Planning Land Use Construction Standard GB50137-2011 categorizes residential land, industrial land, public facility land, green space, and square land as urban construction land. It can be obtained from the classification definition: urban construction land is somewhat different from rural construction land and non- construction land. It is the bearer of urban economic development and is an important place for citizens to produce and live in with urban economic production, public service, and ecological protection functions. Land is the basic pillar of construction, construction land is more inclined to choose land with non-ecological attachments, so the construction land does not need to be too much affected by land fertility and other ecological factors, but more attention is paid to the geographical location and other non- ecological factors. Therefore, when there is a conflict between construction land and agricultural land, the quality of Location is one of the key factors in the availability of land for urban construction. For example, most of the commercial sites in busy urban areas are located in the center of the commercial circle, which is very convenient for transportation, living, and entertainment, and will not be unduly affected by the relevant ecological factors. The advantages and disadvantages of location are relative. For example, the location of a busy commercial street is excellent, but not very suitable for living. Compared with agricultural land, construction land covers a small area, but the labor force and capital invested in the unit area are much higher than that of agricultural land, and the direct economic output per unit area is much higher than that of agricultural land, so its land use is highly intensive. Compared with agricultural land, construction land can accommodate more labor and capital per unit area. Investing a certain amount of labor and capital in a replacement of land resources is relatively more economical and value-added[8]. Therefore, land can be intensively utilized to ameliorate the problems and conflicts of insufficient land supply and demand. Construction land makes use of the land's carrying capacity and allows for the long-term use of buildings and other structures once they are built. As a result, land use is comparatively stable. It is challenging to return agricultural land to its original agricultural use once it has been transformed into construction land. As such, repeated demonstration and scientific analysis are required when performing a feasibility study for the conversion of agricultural land into construction land. If there is more work involved in converting one type of land than the other, then that should be taken into account in this analysis. Henan Province's total area under urban construction grew from 1,727.92 km in 2009 to 2,785.03 km in 2019, with a per capita amount exceeding 130 m. This per capita amount surpasses the levels of 82.4 m in developed countries and 83.3 m² in developing countries. In addition to the impact of the population as a factor, statistics show that China's land use form is wild, the specific expression of its wild form of development zones in various regions without standardized qualification restrictions, and even engages in \"garden factories\" to engage in the use of industrial land in the form of a low price to attract businessmen to attract the development of the stream. In 2009, the total scale of urban construction land in Henan Province reached 1,727.92km. 16.91km² of land was used for residential purposes, accounting for 30% of the total construction land; 8.78km² of land was used for public administration and services, accounting for 16% of the total scale of the construction land; and 12.58km² of land was used for commercial service facilities, accounting for 23% of the total construction land. Industrial land is 2.56km², accounting for 5% of the total scale of construction land; logistics and warehousing land is 3.36km², accounting for 6% of the total scale of construction land; land for road transportation facilities is 5.23km², accounting for 9% of the total scale of construction land; land for public facilities is 1.05km², accounting for 2% of the total scale of construction land; and the land for green areas and squares occupies 5.07km², accounting for 9% of the total land area. While China is currently in the transition stage of new urbanization, with the national urbanization level having reached 42.43% in 2012, the aforementioned data demonstrate that larger-scale land occupation results in residential land. China's land structure for urban and rural construction is currently not keeping up with the rate of urbanization. The land structure for urban construction is relatively irrational; it still needs to be optimized constantly, and in the future, residential land should be guided to gradually shrink while the scale of other land for urban construction is growing steadily.",
    "The layout of urban construction land is irrational, because of the high cost of demolition and resettlement, and driven by short-term interests, urban outreach deliberately avoids existing rural settlements, and thus undertakes planning reforms, which leads to a mixed arrangement of urban construction land and rural settlement land, forming a chaotic situation of \"townships surrounding cities, cities surrounding cities\". One of the more prominent phenomena is the proliferation of \"villages within cities\". Based on the results of the study, it is concluded that the comprehensive efficiency of construction land in Henan Province shows a trend of decreasing and then increasing year by year. The contribution value of ecological benefits to comprehensive benefits is significantly higher than that of social and economic benefits. The coordination of economic, social, and ecological benefits of urban construction land use in Henan Province has entered a stage of stable development after 2012. According to the characteristics of construction land use, to solve the existing problems related to the utilization of construction land, the focus of urban construction land management in Henan Province should be on saving and intensive use of land. On the one hand, try to compress the new construction land to avoid rough expansion, on the other hand, carry out in-depth excavation of the potential of the stock of construction land, make full use of idle and vacant construction land, and improve the degree of construction land intensification."
]