[
    "Abstract: This paper takes the 18 cities in Henan Province as the research object, combining their relevant data in 2022, and conducts a comparative study on the comprehensive competitiveness indicators of logistics industry in Henan Province through factor analysis method. Starting from the three dimensions of infrastructure level, economic benefits, and development scale, this paper explores the level of comprehensive competitiveness of logistics industry in Henan Province and explores the spatial distribution characteristics of comprehensive competitiveness through spatial trend analysis and natural breakpoint method. And it puts forward corresponding improvement strategies. The logistics industry, as a pillar industry of the national economy, serves as a significant source for stimulating national economic growth, expanding domestic demand, and facilitating trade growth. In recent years, along with economic growth, the expansion of industrial scales, and the application of modern information technology, the logistics industry has witnessed burgeoning new opportunities for development. The Central Plains region is situated in the central zone of our country, and its economic development constitutes a crucial component of China's economic development regions. Henan Province, as an important part of the economic belt construction in the Central Plains region, enjoys unique transportation geographical and location advantages in the construction and development of the logistics industry, forming a comprehensive transportation system integrating railways, highways, and aviation. The well-established logistics infrastructure has laid a solid foundation for the further development of the logistics industry. Logistics competitiveness refers to the ability of enterprises to obtain, allocate, and utilize resources effectively in the market economy environment to form and maintain sustainable competitive advantages, earn stable supernormal profits, and includes six aspects from the perspectives of logistics infrastructure construction, marketization, informatization, logistics industry human resources, urbanization, and industrial structure[1]. As a key link in regional logistics development planning[2], logistics industry comprehensive competitiveness is of great significance to regional economic development. There have been rich research results in the domestic academic community on logistics industry comprehensive competitiveness: Jia Xianmin and Li Shaonan studied the temporal and spatial evolution characteristics of trade and logistics competitiveness along the Western Land and Sea New Channel from the perspectives of basic competitiveness and high-quality development[3]. Tang Jianrong and Qi Mengyuan used the Dagum Gini coefficient to measure the level of regional logistics industry competitiveness and sources[4]. Li Yonghui, Bai Lipeng et al. believed that economic factors were important factors affecting logistics performance and competitiveness, and discussed the regional disparities in logistics competitiveness by selecting cities such as Zhengzhou and Shanghai as research objects[5]. Li Lihua and Wang Xuan used the GEM model to study the role mechanism of provincial logistics cluster competitiveness, identified key factors through the entropy weighted PCA method, and explored the evolutionary laws and development characteristics[6]. Some scholars have also explored the path of enhancing logistics competitiveness from the perspective of the Internet[7]. However, foreign scholars have relatively fewer discussions on the concept of logistics competitiveness: Chul W A conducted an investigation on the importance and performance level of logistics competitiveness factors at airports, analyzed the actual factors affecting the revitalization of the logistics industry in Gangwon Province, and proposed measures to enhance competitiveness[8]. Cho H and Lee J discussed the impact of transport expansion on the competitiveness of the logistics industry based on the RBV, transaction cost analysis (TCA), and institutional theory[9]. In addition, the evaluation methods of logistics competitiveness mainly involve SAE-SOFM model[10], factor analysis[11], principal component analysis [12], TOPSIS[13], etc. Based on this, this paper will use factor analysis to measure the comprehensive competitiveness level of logistics industry in Henan Province, analyze the influence factors, and combine ArcGIS software's trend analysis and natural breakpoint method to explore the spatial distribution characteristics of the comprehensive competitiveness level of logistics industry in Henan Province. Finally, it will propose strategies to enhance the comprehensive competitiveness level of logistics industry in Henan Province, with the aim of optimizing the spatial layout of logistics industry in Henan Province, promoting the structural transformation and upgrading of logistics industry, and facilitating the sustainable and healthy development of logistics industry in Henan Province. This article employs the factor analysis method and, via the maximum variance orthogonal rotation approach, rotates the factors to obtain the rotated factor loading matrix along with the eigenvalues and cumulative contribution rates corresponding to each factor. Based on the scores of each factor, the comprehensive scores of the comprehensive competitiveness level of the logistics industry in 18 cities of Henan Province are derived, and the key factors influencing the comprehensive competitiveness level of the logistics industry in Henan Province are determined. Simultaneously, the spatial distribution characteristics of the comprehensive competitiveness level of the logistics industry in Henan Province are explored through ArcGIS software.",
    "Incorporating the research achievements of scholars both domestically and internationally, this paper comprehensively considers the infrastructure level, economic income level and development scale level of logistics industry. Eventually, an indicator system for measuring the comprehensive competitiveness level of the logistics industry in Henan Province is constructed. This indicator system encompasses three aspects: infrastructure level, economic benefit level, and development scale level, and includes 12 indicators. These are employed to analyze the factors influencing the comprehensive competitiveness of the logistics industry in Henan Province. The specific details are presented in Table 1. In this study, we constructed a comprehensive competitiveness index system for the logistics industry in Henan Province, and collected relevant data in 2022. The primary source of the original data used in this study was the <Statistical Yearbook of Henan 2023> and the statistical yearbooks of each city, as well as the Social Development Statistical Bulletin. Some data that could not be obtained directly through querying were calculated using relevant formulas. Due to the particularity of the logistics industry, the current definition of the scope of the logistics industry in China is not very clear, but in the process of searching relevant information, scholars generally believe that the transportation industry, warehousing and postal industry is an important part of China's modern logistics industry, and most of the data calculation will be taken as a whole to reflect the relevant development of the logistics industry. Therefore, in this study, the indicators of logistics fiscal input and the number of employees were selected from the transportation, warehousing and postal services industries as the measurement object, and relevant data were obtained. conduct KMO value and Bartlett sphericity test on the standardized data. The test results are shown in Table 2: In the factor analysis of the comprehensive competitiveness level of logistics industry in Henan Province, KMO=0.682, greater than 0.6, Bartlett sphericity test approximate chi-square value =436.835, freedom =66, significance probability of the test =0.000, greater than 0.01, the above data meet the requirements of factor analysis. Therefore, it is feasible to use the 12 indicators selected in this paper to reflect the comprehensive competitiveness level of logistics industry in Henan province. The principal component analysis method was used to extract the common factors. Since the eigenvalues of the first two public factors in the factor analysis and variance contribution table (Table 3) were all greater than 1, their cumulative variance contribution rate was 90.807%, which could reflect most of the information of the original data and had good representation. At the same time, from the perspective of the gravel chart (Fig. 1), the curve slope of the first two principal components in the gravel chart is steep, and it gradually tends to be flat from the second one, indicating that these two common factors selected in this paper are more suitable for factor analysis. In addition, in the process of factor analysis of the comprehensive competitiveness of the logistics industry in Henan Province, in order to maximize the differences among the public factors, the maximum variance method is selected to rotate the factor load matrix (Table 4). By rotating the factor load matrix, the appropriate rotation factor is obtained and the factor rotation component matrix is formed (Table 5). According to the Table 5 factor rotation component matrix and Table 6 component score coefficient matrix, the expressions of the two principal components can be listed: Z1 = - 0.196X1 - 0.003X2 - 0.095X3 + 0.166X4 + 0.197 X5 + 0.18X6 + 0.12X7 + 0.163X8 + 0.07X9 - 0.06X10 + 0.0 86X11 + 0.154X12. (1) Z2 = 0.434X1 + 0.199X2 + 0.328X3 - 0.076X4 - 0.138X5 - 0.108X6 + 0.007X7 - 0.071X8 + 0.082X9 + 0.235X10 + 0. 068X11 - 0.063X12. (2) In particular, in the above formula, X1, X2, ..., X12 are the standardized variable data of the original variables in factor analysis, and Zi is the i-th principal component, where i = 1, 2. components, and the expression of the comprehensive competitiveness of the logistics industry in Henan Province is obtained: Z = 0.6638Z1 + 0.3362Z2, thereby obtaining the comprehensive score of the comprehensive competitiveness level of the logistics industry in Henan Province. The results are shown in Table 7. Combined with the factor rotation component matrix in Table 5, it can be seen that the first factor has a large load coefficient in the indicators of express business income, total postal business, express business volume, gross output value of the tertiary industry, added value of the logistics industry, total retail sales of consumer goods, the number of logistics employees, and financial investment in logistics. They were 0.984, 0.955, 0.953, 0.948, etc. Among them, express business income, total postal business, express business volume, total retail sales of social consumer goods and total output value of the tertiary industry are related to the operating conditions and social and economic benefits of the logistics industry in the development process, and mainly reflect the benefit ability of the logistics industry in the operation process. The added value of logistics industry, the number of logistics employees and the intensity of logistics financial investment are the basic factors affecting the stable operation of the logistics industry and the important indicators evaluating the sustainable development ability of the logistics industry. These eight indicators all affect the stable operation and sustainable development of the logistics industry, so the first factor is named the industrial development factor. From the perspective of industrial development factors, Zhengzhou has a high score and a certain gap between it and the second place, showing strong development momentum. At the same time, combined with relevant statistics, it can be seen that its economic benefits and industrial scale are relatively strong, and it has a competitive advantage of sustainable development and considerable development prospects.",
    "The second factor has a large load coefficient in the four indicators of highway mileage, express business outlets, truck ownership and cargo turnover, which are 0.960, 0.897, 0.719 and 0.668, respectively. As a traditional indicator, when measuring the comprehensive competitiveness of the logistics industry, these four indicators all reflect the level and ability of infrastructure construction in the logistics industry. It is the foundation of the development of logistics industry, so it is named as the industrial foundation factor. As can be seen from the industrial base factor, Nanyang City and Zhoukou City are in the top two in the ranking, with relatively perfect infrastructure and good logistics industry foundation, followed by Shangqiu City, Xinyang City, Zhumadian City and Luoyang City, most of which are in plain areas with flat terrain and perfect logistics industry infrastructure construction. So as to lay a solid foundation for the further development of logistics industry. Based on the comprehensive competitiveness of logistics industry in Henan Province, 7 cities in Henan Province scored positive and 11 cities scored negative, indicating that the overall level of comprehensive competitiveness of logistics industry in Henan Province is weak, and the level of comprehensive competitiveness of logistics industry needs to be improved. Combined with the ranking results, it can be seen that the comprehensive competitiveness of the logistics industry in Zhengzhou is far ahead, with the comprehensive competitiveness score reaching 2.57, which is characterized income and strong development scale. It can be seen from the statistical data that the number of truck ownership, express delivery business volume and income, and the added value of the logistics industry are far ahead of other cities. Secondly, the comprehensive competitiveness level of logistics industry of Nanyang City, Shangqiu City, Luoyang City and Zhoukou City is in the range of 0.23~0.63, which is mainly manifested by perfect logistics infrastructure, large logistics industry scale, especially perfect highway traffic network construction and large cargo turnover, which provides convenient conditions for logistics freight. The comprehensive competitiveness scores of Xinxiang City, Zhumadian City and Xinyang City are 0.06, 0.01 and -0.07, respectively. Compared with the first two intervals, there is a certain gap. The level of infrastructure is strong, but the economic income is weak, and the development scale of logistics industry needs to be improved. The comprehensive competitiveness index of 7 cities, such as Jiaozuo City, Anyang city and Pingdingshan City, is negative. Their logistics industry development mode is more traditional, lacking of innovation and development power; The competitiveness level of logistics industry of Sanmenxia, Hebi and Jiyuan is at the bottom of Henan Province, among which Jiyuan's comprehensive score is only -0.84, which is mainly reflected in the imperfect logistics industry foundation and limited logistics development scale By visualizing the data results through ArcGIS software, the differences between regions in the development level of logistics industry in Henan Province can be more visually observed from the space, so as to conduct targeted research. The comprehensive score of the comprehensive competitiveness level of the logistics industry in Henan Province obtained by the factor analysis method and combined with the three-dimensional trend analysis, the spatial trend analysis chart of the comprehensive competitiveness of the logistics industry in Henan Province was obtained (Figure 2). As can be seen from Figure 2, there is a relatively gentle change curve on the XZ plane, which firstly declines from west to east and then slowly rises. Due to the small change range of the curve, the comprehensive competitiveness level of the logistics industry in Henan Province has a relatively small change in the east-west cross section. From the perspective of YZ plane, there is a declining curve, which gradually decreases from south to north, and the decline slope of the change curve is large, indicating that the comprehensive competitiveness of Henan Province's logistics industry differs greatly in the north-south longitudinal cross- In order to study the spatial characteristics of the comprehensive competitiveness of the logistics industry in Henan Province in more detail, the comprehensive score of the comprehensive competitiveness of the logistics industry of various cities in Henan Province was presented on the map by ArcGIS natural breakpoint method, and the spatial distribution diagram of the comprehensive competitiveness of the logistics industry in Henan Province was obtained, as shown in Figure 3: First, the comprehensive competitiveness of the logistics industry has a radiation driving effect. Among them, the comprehensive competitiveness level of the logistics industry in Zhengzhou is far ahead, forming a ring belt with high competitiveness level based on \"Zhengzhou - Luoyang - Nanyang\" and \"Zhoukou - Shangqiu\". As a direct factor affecting the development level of the logistics industry, the transportation elements occupy an important position in the comprehensive competitiveness of the logistics industry. Zhengzhou, as an important traffic artery in Henan Province, has a sound traffic network, among which many roads and railways run through the city, and the traffic advantage is extremely superior. Due to the mutual circulation and mutual influence of inter-regional logistics industry elements, the surrounding cities are also affected to a certain extent, and the correlation is strong, showing a diffusion and spillover effect, driving the improvement of the comprehensive competitiveness of the logistics industry in the surrounding cities.",
    "Second, the comprehensive competitiveness of the logistics industry in the central region lacks development momentum. From a broader perspective, the comprehensive competitiveness level of logistics industry in Henan province is unevenly distributed among regions, and the difference between regions is large. Compared with the high- competitiveness echelons dominated by Zhengzhou City, the comprehensive competitiveness of logistics industry in central Henan Province is weak, and the gap is relatively large. The central region of Henan Province has not yet got rid of the traditional logistics mode, the logistics industry chain lacks scientific and technological innovation, the strong and weak transformation is not obvious, and the lack of development power source. However, with the increasingly close economic ties between regions, as well as the formulation and implementation of relevant industrial development policies, the operational efficiency of the logistics industry will be greatly improved and has considerable development prospects. Third, terrain factors affect the level of comprehensive competitiveness of logistics industry. As can be seen from the spatial distribution map, the comprehensive competitiveness of logistics industry in the northwest of Henan Province has a certain gap compared with other regions, and comprehensive competitiveness level is low. From the the perspective of terrain, the terrain of Henan Province is high in the west and low in the east. The plain area accounts for more than half of the province's total area, while the mountains are concentrated in the northwest of Henan Province, among which most areas of Sanmenxia and Jiyuan are mountainous and hilly areas. Affected by terrain factors, the transportation in mountainous areas is inconvenient, the location is remote, and the infrastructure construction of logistics industry is difficult. The development scale of logistics industry is limited, and the competitiveness level of logistics industry is in the bottom echelon of Henan Province. With the continuous expansion of social logistics needs, the scale of the logistics industry has grown steadily, and the development mode of the logistics industry is also constantly adjusted and optimized, which promotes the development of the logistics industry in the direction of more specialization and scale. By building a characteristic logistics cluster, strengthening the linkage construction of regional logistics industry, improving the integration of regional resources, realizing the division of labor and cooperation of inter- regional logistics industry through complementary advantages, forming a positive interaction, promoting the construction of a sound logistics network system, improving the problem of slow business operation caused by distance of logistics enterprises, reducing complicated links and reducing costs. Improve the operation efficiency of the logistics industry chain, enhance the development vitality of the logistics industry, promote the new advantages of the innovative logistics industry, create a new engine for economic growth, expand the scale of the logistics industry, and promote the logistics industry to achieve considerable progress. The construction of logistics facilities is the basic factor affecting the development of logistics industry. Compared with other regions with strong competitiveness, the development of logistics industry in Sanmenxia City, Jiyuan City and Hebi City is restricted by infrastructure factors. Due to the backward construction of basic logistics facilities such as urban transportation and railway stations, some old facilities have not been updated all year long, resulting in low operating efficiency of logistics industry and inadequate utilization of transportation and storage facilities. It affects the operational efficiency of logistics business. We should pay attention to improving the infrastructure construction of the logistics industry, encourage innovation in the logistics operation mode, update the old facilities through the investment of modern science and technology, avoid the drawbacks of the traditional logistics industry, improve the operation efficiency of the logistics industry, improve the comprehensive control and rectification of materials, science and technology, information and other aspects, and gradually form a new logistics ecosystem. At the same time, the government will strengthen its support, actively exert its organizational and coordination functions, formulate relevant policies to encourage and guide the development of the logistics industry, actively learn from the experience of other regions, make full use of its own advantages to formulate strategic measures suitable for the development of the city, rationally plan the layout of the logistics industry, and explore the efficient development mode of the logistics industry. Compared with the single transport and storage function of the traditional logistics industry, the core of the modern logistics industry is information. In recent years, with the development of modern logistics industry and the progress of modern information technology, the application level of technology and equipment automation in logistics industry has also been greatly improved. Modern information technology can track the whole process of goods from sorting and distribution to transportation and distribution, ensure the punctuality of distribution, improve the quality of logistics services, improve the operating efficiency of logistics enterprises, and meet the needs of customers' sense of experience. In the past, the production and assembly of the traditional logistics industry mainly relied on the traditional labor force. Due to the late start of the development of China's logistics industry, logistics talents with high knowledge level are relatively scarce, so we should pay attention to the cultivation of high-quality talents. At the same time, through the talent introduction policy to attract high-quality logistics talents, meet the needs of the development of modern logistics industry, and promote the development of logistics industry towards a more professional and intelligent direction."
]