[
    "Abstract. This study calculated the green development level of energy, economy and environment (3E) systems in Henan Province from 2005 to 2017 through the model, and studied and analyzed the coordinated development level among various systems by using the coordination degree model.2005-2017, according to the results of green energy, economy and environment system development level is the development trend of general rise, coordinated development between system state can be divided into two stages, one is 2005-2011 is not coordinated development phase, the second is the basic coordinated development stage of the 2012-2017 with the passage of time, the rising degree of coordination between system, gradually improve green development trend of Henan province. \"How to achieve sustainable development\" is the focus of attention in today's world. Its core is how to deal with the relationship among energy, economy and environment well, and realize the coordinated development of the three. For a long time, many scholars have studied and done a lot of work on the internal relationship of 3E system and the measurement of coordination degree. Mou Yong et al. used SDM model to analyze the synergistic relationship between energy, economy and environment, and found that economy and energy are the cause of environment, environment is the effect, and energy and economy are mutually causal. Li Xiaofei et al. constructed the VAR model of 3E system in Henan Province, and studied the dynamic relationship among 3E systems by using impulse response function and variance decomposition method, showing that there is a dynamic and long-term stable co-integration relationship between the three systems. Zhang Liming used entropy method and coupling coordination model to comprehensively evaluate the coordinated development level of 3E system in Henan Province, and concluded that the coordination degree between the two subsystems of 3E system showed an upward trend from 2005 to 2014. Principal component analysis method and entropy method are often used to evaluate the coordinated development level of 3E system. Principal component analysis method can reduce the dimensionality of large quantities of indicators, but the weight calculation is not objective and reasonable. Although entropy method cannot reduce the dimension of indicators, it has more advantages in index weighting. To avoid the limitation of the two methods, this study adopts the principal component analysis and entropy value method combination analysis, to select the related data during 2005-2017 in Henan province, the level of 3 e system of green development in henan, the introduction of coordination degree model to simulate the 3 e system coordination degree of the empirical analysis, and thus improve the comprehensive and scientific analysis results, to promote the 3 e system in Henan province to provide theoretical basis to realize the coordinated development of the green. For better analysis under the background of green development level of 3 e system development in Henan province, this study combined with the current situation of the development of energy, economy and environment in Henan province, the comprehensive research achievements of domestic scholars, in the process of build index system from the energy structure, energy efficiency, environmental pollution and the industrial structure, economic, scientific and technological innovation, economic investment and foreign trade, etc., may affect selection of green development, and can reflect the current situation of the development of energy, economy and environment in henan province of the relevant indicators, there are 29 indexes respectively is A1 ~ A5 energy system, The index systems constructed by economic system B1 ~ B6 and environmental system C1 ~ C5 are shown in Table 1 (where the positive index, the greater the index value, the better; Inverse index, the smaller the index value, the better). Assuming that there are m evaluation objects in the evaluation system and n evaluation indicators corresponding to each evaluation object, the matrix Xij is constituted (where I =1,2... ,m; J = 1, 2,... , n). In the principal component analysis, the formula Xij= Max (Xij) -xij is used to carry out the forward conversion of the inverse index, and then Z-score method is used to carry out the standardization processing. In the analysis process of entropy value method, range method is used to carry out the homogenization and standardization processing. 2.1.1. Dimensionality reduction by principal component analysis. (1) Condition test: KMO test and Bartlett test of sphericity were carried out on all index data to determine whether it was suitable for principal component analysis.",
    "(2) Calculate the characteristic root and the cumulative contribution rate. Select the first k principal components of the characteristic root >1 or the cumulative contribution rate BBB>%, and calculate the unit eigenvector matrix corresponding to the characteristic root according to the following formula: Where, Ekj is the unit eigenvector; Fkj is the variable corresponding to the JTH index of the KTH ğ¸ğ¸ğ‘˜ğ‘˜ğ‘˜ğ‘˜ = ğ‘“ğ‘“ğ‘˜ğ‘˜ğ‘˜ğ‘˜/ï¿½ğœ†ğœ†ğ‘˜ğ‘˜ principal component in the factor loading matrix; Î»k is the initial eigenroot corresponding to the KTH principal component. Where, Fik is the KTH principal component score in the ith year, and ZXij is the standardized value ğ‘ğ‘ğ‘ğ‘ğ‘–ğ‘–ğ‘˜ğ‘˜ âˆ‘ ğ¸ğ¸ğ‘˜ğ‘˜ğ‘˜ğ‘˜ ğ‘–ğ‘–=1 ğ¹ğ¹ğ‘–ğ‘–ğ‘˜ğ‘˜ of the JTH index in the ith year. 2.1.2. Entropy value method is used to determine the weight of indicators. (1) Calculate the proportion Pij of the JTH index in the ith year: (4) Build a comprehensive evaluation function to calculate the comprehensive evaluation score of ğ‘‘ğ‘‘ğ‘˜ğ‘˜ ğ‘Šğ‘Šğ‘˜ğ‘˜ ğ‘‘ğ‘‘ğ‘˜ğ‘˜ ğ‘˜ğ‘˜=1 âˆ‘ the PCA-entropy method evaluation model. The formula is as follows: In the formula, Qi is the green development level value of the principal component analysis-entropy ğ¹ğ¹ğ‘–ğ‘–ğ‘˜ğ‘˜ âˆ‘ ğ‘Šğ‘Šğ‘˜ğ‘˜ ğ‘˜ğ‘˜=1 ğ‘„ğ‘„ğ‘–ğ‘– method model in the ith year. The coordination level reflects the mutually restrictive and mutually supportive relationship between two or more systems. However, the coordinated development status between systems cannot be directly seen through the green development level of each system. Therefore, the coordination degree model and relevant evaluation criteria are introduced in this study: 2 2 X and Y respectively represent the respective green development level of any two systems in the 3E ğ¶ğ¶ = âˆšğ‘‹ğ‘‹ +ğ‘Œğ‘Œ system; The coordination degree C is the coordination degree between X and Y systems, where the value of C between -1.414 and 1.414 is basically positively correlated with the coordination degree between X and Y systems. According to the calculated coordination degree, the coordination level can be divided into 6 types, and the corresponding characteristics are shown in Table 2: Due to the delayed statistical data, this study selected 2005-2017 in Henan province as the analysis time, from the statistical yearbook of Henan province China environment statistical yearbook and China statistical yearbook and yearbook within the indicators data obtained from the data calculation, based on the construction of the principal component analysis, entropy value method statistical computing model and coordination degree model, finally the results are studied. 3.1.1. Calculation of energy subsystems. According to the indicators selected in Table 1, statistical data were first standardized, and then principal component analysis was conducted on the data of each system to obtain the principal component expression of each system. Taking the energy system of Henan Province as an example, the principal component expression of the energy system is obtained as follows: According to the entropy value method, the formula is used to calculate the weight of the principal component matrix, and the weight and principal component score matrix are substituted into the formula to obtain the green development level value of the energy subsystem. The expression is as follows: Q energy=0.575F1+0.425F2 3.1.2. Calculation of economic subsystem. According to the calculation steps of the energy system, the principal component expression of the economic system can be obtained as follows: According to the principle of entropy value method, the weight of principal component F1 and F2 matrices was calculated, and the expression of green development level of economic subsystem was obtained as follows: Q economic= 0.461F1+0.539F2 3.1.3. Calculation of environmental subsystem. In the same way, the calculation method of green development level value of environmental system is obtained. Principal component expression of environmental system is as follows: According to the principle of entropy value method, the weight of principal component matrix was calculated, and the expression of green development level of environmental subsystem was obtained as follows: Q environment=0.588F1+0.412F2 The level of green development of energy, economy and environment in Henan Province from 2005 to 2017 was summarized as follows: It can be seen that the green development level of energy, economy and environment systems in Henan Province fluctuates in a few years, but generally presents an upward trend. From 2011 to 2014, the unreasonable economic structure and growth mode in Henan Province resulted in the level of green economic development below the level of energy and environment. The proportion of traditional industries and high-energy industries is too high, the proportion of strategic emerging industries and high-tech industries is too low, the quality of development of the tertiary industry is not high, and its service capacity is insufficient.",
    "From 2014 to 2017, the level of green development has changed from quantitative to qualitative. Compared with 2014, the contribution rate of the secondary industry decreased by 12.7% and 30.6% respectively in 2015 and 2016, while the contribution rate of the tertiary industry increased by 22.7% and 58.3% respectively, among which the added value of the high-energy consuming industry and traditional industry decreased gradually. In addition, technological innovation is the fundamental driving force of the development of the green and the important support, scientific research and innovation investment increases, the sustainable development of green economy for the future provides a powerful support, green energy system development level rising steadily, and environment system development level in 2014-2016 in stagnation, but getting quicker recovery in 2017, the overall development situation is good. According to the coordination degree model, the coordination degree among the energy-economy, energy-environment and economy-environment systems is calculated, from which the coordinated development status of the systems can be seen. The results are shown in Table 4. In general, the coordinated development of various systems can be basically divided into two stages. The first stage is the uncoordinated development stage from 2005 to 2011, and the coordination degree is negative. Second, the basic stage of coordinated development from 2012 to 2017, the degree of coordination is positive. Development in 2005-2011, the first analysis of energy - economy system coordination degree for Vclass not coordinated development status, the energy of the predatory development and unreasonable consumption holds up the development of economy in Henan province in vulgar, and backward in technology in the process of development and consumption, the low use efficiency, caused the waste of resources, unable to meet the green, sustainable development, resulting in the discordant phenomenon between the two systems. Two systems also are in a state of V type of energy and environment, even in the presence of 2006 and 2008, â…¥ class imbalance development condition, development situation is not optimistic. Due to the limitation of natural resource endowment in Henan Province, the energy consumption is mainly based on coal resources, and the imperfect energy utilization and environmental governance technology leads to unreasonable pollutant discharge and low prevention and control ability, which finally leads to the uncoordinated development between the two systems. Two of the economy and environment system is in a state of disorder â…¥ class 2005, 2006-2011 in the V class not coordinated development state. Energy - economic, energy - 2012 respectively belong to the development of environment and economy and environment type â…¢ basic coordination and weak coordination, â…¡ â…£ class owe coordination. 2013-2017 years between the two reached â…¡ classes each system basic coordination, finally in 2017 all reached â…  coordination development level. This is because the energy consumption structure and industrial structure change, one is to clean energy consumption structure, vigorously develop clean energy, green energy industry development laid a solid foundation for the future, the second is the energy industry structure can reduce the high load, the proportion of high pollution industries, increase the proportion of high growth and high technical industry, make an important contribution to energy conservation and emissions reduction. In this study, relevant indicators that have an impact on green development in energy, economy and environment were selected. Based on the principal component analysis-entropy method model and coordination degree model, the green development level of 3E system and the coordinated development among systems in Henan Province from 2005 to 2017 are analyzed. The results are as follows: (1) From 2005 to 2017, the green development level of energy, economy and environment in Henan Province showed an overall upward trend. Among them, the overall green development level of energy showed a steady upward trend, and the overall green development level of environment showed a good development trend. (2) The coordinated development of energy-economy, energy-environment and economy- environment systems in Henan Province from 2005 to 2017 can be divided into two stages. The first stage is the uncoordinated development stage from 2005 to 2011. Second, the basic stage of coordinated development from 2012 to 2017; The coordinated development level of economy-environment system lags behind that of energy-economy and energy-environment system, which should be paid close attention to. With the passage of time, the coordination degree between energy - economy, energy - environment and economy - environment system keeps rising, and the trend of green development level in Henan Province has been improving year after year."
]