[
    "Research on atmospheric temperature change and its adaptive strategies in winter wheat and summer maize dual-cropping region of North China Plain during 1961—2021—A case study of Jiaozuo City in Henan Province 1 School of Surveying and Land Information Engineering, Henan Polytechnic University, Jiaozuo, Henan, China, 2 School of Resources and Environment, Henan Polytechnic University, Jiaozuo, Henan, China Citation: Hao C, He S (2025) Research on atmospheric temperature change and its adaptive strategies in winter wheat and summer maize dual-cropping region of North China Plain during 1961—2021—A case study of Jiaozuo City in Henan Province. PLoS One 20(6): e0325781. https://doi.org/10.1371/ journal.pone.0325781 Copyright: © 2025 Hao, He. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. Data availability statement: The daily tem- perature data consist of three types, i.e., the daily mean temperature, the daily minimum temperature and the daily maximum tem- perature, all being obtained from the National Global warming has caused the frequency and intensity of extreme weather events in agriculture. Therefore, research on temperature changes in major grain-producing areas is essential for formulating adaptation strategy. This article takes Jiaozuo City, Henan Province, China as the research area. Based on daily maximum, minimum and mean temperatures from seven meteorological stations for the period 1961— 2021, the comprehensive indications of temperature changes were analyzed using the linear tendency estimation, Mann-Kendall test, and levels fluctuation. Fourteen climate indices in four classes, including the mean temperature index, absolute extreme temperature index, relative extreme temperature index, and disaster tem- perature index, were applied. The results indicated four aspects. Firstly, the average regional warming speed was 0.259°C/10a—slightly lower than the national average, and the years of the highest and lowest values were 2021 and 1984, respectively. Secondly, the daily minimum and maximum temperatures increased significantly, which were 0.395°C/10a and 0.200°C/10a respectively—less than the national mean. The relevant low temperature index showed proper decreasing trend while the diurnal range of annual extreme temperature showed fluctuating—decreasing first and then increasing. Thirdly, the relevant e high temperature indices of plain urban area were larger while the relevant low temperature indices of mountain hilly area were smaller. The relative high temperature indices showed an increasing trend while the relevant low temperature indices tended to decrease. Fourthly, high temperature disasters generally declined before the 1980s and increased thereafter; low temperature disas- ters showed a decreasing trend overall. This study suggests that in the two-cropping regions of winter wheat and summer maize, attention should be paid to the increas- ing trend of high-temperature days. Additionally, heat-tolerant varieties should be cultivated to expand the planting area of maize for adapting to increasing drought disasters induced by high temperature, as well as to establish an agricultural disaster-risk mechanism for addressing high temperature meteorological disasters. The global risks report 2022 released by the World Economic Forum (2022) indicated that climate change and extreme weather are the paramount current global risks, and multiple climatological events have evidenced climate change—mainly charac- terized by rising temperatures [1,2]. Reports 3” to 6\" of the Intergovernmental Panel on Climate Change (IPCC for short) have all indicated progressively stronger warm- ing trends [3,4]. In other words, each assessment shows warmer temperatures than recorded the previous year, indicating an increasingly global warming trend in recent years [5]. However, temperature increase is not uniform. A basic consensus has been reached that this regional heterogeneity warming is not only reflected in the increase of the daily mean temperature, but also in the increase of the relative temperature index represented by the numbers of summer days and hot nights [6]. Specifically, disaster temperature events are becoming increasingly frequent and concentrated [7,8], espe- cially in the winter wheat and summer maize dual-cropping region of China [9,10]. This region is characterized by high cropping intensity, water-sensitive growth periods, and frequent exposure to climatic extremes. It is especially vulnerable to high-temperature events due to the overlap between key crop developmental stages (e.g., wheat grain filling and maize seedling stages) and the occurrence of extreme heat in late spring and summer. Prolonged high temperatures during these periods can severely impact crop yields, disrupt phenological development, and increase the risk of drought stress. Therefore, ascertaining temperature trends and extreme events in this region is critical for ensuring food security and developing targeted adaptation strategies.",
    "Currently, research on regional response to global warming is at the forefront of integrated physical geography [11,12]. Extreme temperature events adversely impact food production, human settlements, and human health [13-15]. Therefore, numer- ous studies—domestic as well as foreign—have explored this issue from multiple research perspectives and expression modes. The variation trend and distribution pattern of temperature—especially, extreme temperature—are impacted by natural conditions and human activities, and therefore, differ across regions. However, China has a vast territory with immense regional differences in both natural and cultural conditions—for example, there are sparsely populated regions as well as densely populated ones, such as the North China Plain [16,17]. Particularly, research on long- term temperature change in the North China Plain has been mostly conducted on a provincial scale—in the Hebei, Shandong, Henan, Jiangsu, and Anhui Provinces. Generally, cogent city-scale research has been rather rare while the spatial distri- bution of meteorological stations used in provincial scale research has been mostly scattered [18,19]. For example, Yin et al. [20] had selected the daily temperature data of 13 meteorological stations from 1951 to 2013 to study the trend and probability characteristics of extreme temperature in 1.07 x 10° km? of the Jiangsu Province, including minimum and maximum temperatures. Hao et al. [21] utilized the climate changing tendency rate to express the temporal and spatial variation characteristics of both extreme minimum and maximum temperatures in 1.89 x 10° km? of the Hebei Province, but no mean temperature, based on the daily extreme data of 50 meteorological stations from 1961 to 2008. Detailed research exists in this area. For instance, Yu et al. [22] calculated six relative temperature indices based on the daily temperature data of 14 meteorological stations from 1971 to 2013, and conducted the characteristics analysis of the spatio-temporal variation on extreme temperature in 1.56 x 10° km? of the Shandong Province. Liu et al. [23] compre- hensively applied a variety of mathematical techniques such as the climate tendency rate, sliding T-test, and cross wave- let to explore the characteristics of temperature change under multiple time-scales in 1.40 x 10° km? of the Anhui Province, based on the climate data of 17 meteorological stations from 1960 to 2015. More notably, for 1.67 x 10° km? of the Henan Province, Wang [24] applied the linear tendency estimation and M-K test to investigate the spatio-temporal variation of extreme temperature based on the daily temperature data of 32 meteorological stations for the period 1961—2011. Zhao et al. [25] analyzed the changing process of the cold and warm temperature indices based on the basic data of 17 national basic/benchmark meteorological stations. Nevertheless, research has typically focused on either a limited number of extreme temperature indices or emphasized general climatic trends; a comprehensive analysis of multiple types of tem- perature indices using an integrated framework remains scarce. Moreover, few studies have explicitly linked temperature dynamics to agricultural relevance, particularly in terms of identifying adaptive strategies at the local level to cope with climate-induced risks. To address these gaps, this study focuses on Jiaozuo City in the Henan Province, a representative zone of the North China Plain and one of China’s key grain-producing regiones. Unlike previous provincial-scale analyses, this study utilizes daily temperature data from seven densely distributed meteorological stations spanning the period 1961-2021 to investigate the long-term spatiotemporal patterns of temperature change at the city scale. Fourteen temperature indices across four categories—mean, extreme, relative, and disaster-related—are analyzed based on linear trend estimation and anomaly analysis. Moreover, this study not only identifies regional temperature change patterns but also explicitly links them to agricultural impacts, proposing targeted adaptive strategies for crop produc- tion under climate warming. The present research not only addresses the knowledge gap in the analysis of tempera- ture trends at the urban scale in the Huang-Huai-Hai Plain, but also applies multiple indicators to conduct a more comprehensive and integrated evaluation of temperature changes. By proposing agricultural adaptation measures with regional characteristics, the practical relevance of climate research has been enhanced. This academic endeavor enhances the practical relevance of climate research by proposing region-specific agricultural adaptation measures. The research results can not only provide data support for the rational utilization of climate resource to vigorously develop sustainable agriculture, but also offer theoretical evidence for local governments to make decisions regarding agricultural disaster reduction and relief [26].",
    "Jiaozuo City is located in the north of the Henan Province, between the Taihangshan Mountains in the north and the Yel- low River in the south, with the longitude and latitude range of 112°35'31”E to 113°38'35\"E and 34°49'03’N to 35°29'45’N, respectively, and total area of 4071 km? (Fig 1). In terms of regional topography or geomorphology, the northern part of the research region is mountainous, with the highest elevation of 1308 m, accounting for 25.17% of the total area. The south- ern part comprises alluvial plain, with the lowest elevation of 90 m, accounting for 74.83%. In terms of regional climate, Jiaozuo City belongs to the warm temperate continental semi-humid monsoon climate type. It has distinct four seasons: spring is warm and rainy, summer is hot and rainy, autumn is cool and dry, and winter is cold with a little snow. The aver- age annual precipitation is 586.7 mm, and the summer rainfall from June to August accounts for approximately 60% of the total annual rainfall. The annual daily temperature is 14.839 °C while the annual accumulated temperature of 210 °C is 4874.8 °C. In terms of regional vegetation and soil, zonal vegetation type is warm temperate deciduous broad-leaved forest while zonal soil is tidal soil and brown soil. Tidal soil is mainly distributed in the southern alluvial plain or valley zone with an altitude of less than 1000 m, while brown soil is primarily distributed in the northern mountainous region and pied- mont inclined plain. Jiaozuo City consists of seven administrative units. Therefore, the research region includes seven meteorological stations: the Qinyang, Boai, Shanyang, Xiuwu, Wuzhi, Mengzhou, and Wenxian Stations (hereinafter referred to as Qinyang, Boai, Shanyang, Xiuwu, Wuzhi, Mengzhou, and Wenxian). The daily temperature data consist of three types: the daily mean temperature, daily minimum temperature, and the daily maximum temperature, all obtained from the National Meteorological Information Center of the China Meteorological Administration. The time period is 61 years, from January 1, 1961 to December 31, 2021. It is noteworthy that in late July in 2021, a once-in-a- century severe flood occurred in the research region. Based on preliminary statistical analysis, precipitation and temperature during 2021 and multi-year for the period 1961-2021, and the basic data of the seven stations are presented in Table 1. Based on Climate Variability and Predictability—one of the six research projects in the World Climate Research Program, and authoritative like the World Meteorological Organization and |PCC—domestic and foreign researchers have variously indicated the temperature changing situation [27—29]. This study, mainly referring to You et al. [30], selected 14 tempera- ture indices in four categories to characterize the comprehensive indicators of temperature change in Jiaozuo City, after conducting a preliminary study of the daily mean, daily minimum, and daily maximum temperature trends of seven stations over 61 years. Particularly, both extreme low temperature < -10 °C and extreme high temperature 240 °C are not con- ducive to agriculture in northern China, including the research region [31]. The specific meanings of temperature indices mentioned above are presented in Table 2. After rigorous quality control and homogenization correction of daily temperature data, this research obtained 14 indi- ces in the four categories mentioned above. When analyzing the time series variation trend of the seven stations in Jiao- zuo City, the linear trend method is applied to fit the variation trend of each index, and the Mann-Kendall non-parameter test is conducted to assess the significance of the variation trend, including the temporal-spatial features and the changing or variation conditions of the four indices mentioned above. The data in this article are averaged over all stations, unless specified otherwise, and the study period is January 1, 1961—December 31, 2021, if no specific time period is restricted. 3.1.1 Temporal-spatial features. The average values of TMm, TMx, and TMn were 14.84 °C, 31.96 °C, and -5.32 respectively. Correspondingly, TMm showed the most obvious increasing trend with an overall growth rate of 0.259 °C/10a while both TMx and TMn had strong volatility and poor trend (Fig 2). In terms of TMm between the seven stations, the annual average of Shanyang was the highest, reaching 15.59 °C, while that of Mengzhou was the lowest—merely 14.56 °C; there was a difference of more than 1 °C between them. For almost all stations, with the exception of Shanyang, the year of the lowest value was 1984. The maximum TMm of all stations was in 2021, which was from 7.72% to 12.94%— higher than the average annual temperature (Table 1); that is, the annual regional average temperature in 2021 was 10% higher than the average annual temperature. The annual precipitation of all stations in 2021 ranged from 101.22% to 156.26% higher than the average annual precipitation—that is, the regional average precipitation in 2021 was 2.25 times the regional annual precipitation. Briefly put, the year 2021 was not only a once-in-a-century flood year in this research region, but also the year of the highest average temperature during the period studied.",
    "3.1.2 Changing or variation conditions. Combined with Fig 3, there are mainly two points of analysis for the fluctuated conditions of the mean temperature index. First, being bounded by 1994, the TMm value of the front part was basically higher while that of the rear part was lower. So, the multi-year trend of TMm was the most regular, with a fluctuation state of first decreasing and then increasing. At the 10-year scale, the average temperature of each decade was 14.47 °C, 14.36 °C, 14.31 °C, 14.98 °C, 15.21 °C, and 15.54 °C, respectively, with a significant increasing trend in the last 40 years, that is, since the 1980s (Fig 4a). Second, divided into three periods based on 1973 and 2002, the TMx values of the two periods both before 1973 and after 2002 were basically higher, while that in the intermediate period basically lower (Fig 4b); TMx was the most volatile. Although the index of TMn was not as significant as that of TMm, it also indicated a certain increasing trend (Fig 4c); no obvious mutations occurred in TMm, TMx, and TMn. 3.2.1 Temporal-spatial features. In terms of multi-year daily maximum temperature, the average of TXm was 20.62 °C with an increasing rate of 0.200 °C/10a (Fig 5a), while the average of TXx was 39.61 °C and the variation tendency was not distinct (Fig 5b). In terms of multi-year daily minimum temperature, the average of TNm was 9.90 °C with an increasing rate of 0.395 °C/10a (Fig 5c), while there was an increasing tendency of TNn but poor trend, which failed to pass the significance test, and the average of TNns was -10.36 °C (Fig 5d). Regarding DTR, there was only a decreasing tendency, but it did not pass the significance test, either (Fig 5e). However, it was noteworthy that the average of 61 years had reached 49.97 °C, and the extreme in 1969 was 56.53 °C. At Mengzhou in 1969, the annual minimum and maximum temperatures were -17.9 °C and 41.1 °C, respectively, with the DTR of 59 °C. The highest DTR of 60.4 °C was in Wuzhi in 1990, with the minimum temperature of -22.4 °C and maximum temperature of 38.0 °C, respectively. 3.2.2 Changing or variation conditions. Regarding the changing condition of TXm for many years, combined with Fig 6, we identified that 1994 was the line of demarcation, roughly: lower before, and then higher (Fig 7a), and there are no obvious mutations. The annual average daily maximum temperatures from 1960s to 2010s were 40.38 °C, 39.41 °C, 38.44 °C, 39.07 °C, 40.02 °C, and 40.23 °C respectively, which decreased first and then increased. Moreover, the fluctuation state of TNm was roughly close to the changing process of TXm mentioned above (Fig 7b), and there are no obvious mutations. The annual average daily minimum temperatures from the 1960s to the 2010s were -12.34 °C, -11.30 °C, -10.77 °C, -9.09 °C, -8.96 °C, and -9.47 °C, respectively, with a generally warming trend, but with a slight fluctuation in the 2000s. Meanwhile, an obvious mutation occurred in 1972; we identified that the growth rate was slower and the fluctuation was smaller than the previous year’s, and later on, the growth rate accelerated and the fluctuation increased. From the 1960s to the 2010s, the DTRs were 52.72 °C, 50.71 °C, 49.22 °C, 48.16 °C, 48.98 °C, and 49.70 °C, respectively, with the fluctuation first decreasing and then increasing (Fig 7c). In conclusion, regarding the changing process of TXm, TNn, and DTR, there exists a certain law of time sequence reg- ularity. According to that law, the fluctuation state of TXm and DTR first decreased and then increased, while TNm showed an obvious increase. However, neither TXx nor TNn showed a temporal trend. 3.3.1 Temporal-spatial features. On the one hand, the regional differentiations of both SU25 and IDO are relatively minor, based on the daily maximum temperatures. First, for SU25, the multi-year average of the whole research region was 148.91d, with 169.14d being the highest value in 2006, and 123.7d being the lowest value in 1964; so, the difference was merely 20.38% (Fig 8a). In terms of the extreme values comparison among the seven stations, the highest SU25 was 174d at Shanyang in 2006, and the lowest value being 120d at Boai in 1964, with a difference of merely 45.00%. In terms of the multi-year mean values comparison among the seven stations, 152.66d at Shanyang was the largest while 146.38d at Boai was the smallest, and the difference between them was merely 4.29%. As depicted in Fig 8b, for IDO, the mean value of seven stations was 4.56d, and the largest value was 22.71d in 1969—especially, the values of both Qinyang and Boai had reached 24d. The lowest value was 0, and there were eight years: 1962, 1963, 1965, 1992, 1995, 1999, 2017, and 2020. The regional comparison of the multi-year mean value among all the stations showed that 4.77d at Wenxian was the largest and the 4.29d at Wuzhi was the smallest; their difference was merely 11.20%.",
    "On the other hand, the regional differentiations of both TR20 and FDO were relatively large, based on the daily mini- mum temperatures. First, the multi-year mean of TR20 was 76.05d, with 96.29d in 2018 being the highest, and 57.71d in 1976 being the lowest; so, the difference was 66.85% (Fig 8c). Among the seven stations, the highest was 121d at Sha- nyang in 2020, and the lowest was 47d at Mengzhou in 1989, with a difference of 157.00%. The regional comparison of multi-year mean value showed that 88.46d at Shanyang was the largest while 70.66d at Mengzhou was the smallest, and their difference was 25.19%. Second, the mean FDO of all seven stations was 79.39d, with the largest of 105.71d in 1969 and the smallest of 49.00d in 2002; their difference was 116.00% (Fig 8d). In terms of the FDO extreme values comparison among the seven stations, the highest was 111d at both Qinyang and Boai in 1969 while the lowest was 32d at Shanyang in 2021, with a difference of 247.00%. In terms of the FDO multi-year mean values comparison, 85.10d at Xiuwu was the largest while 66.89d at Shanyang was the smallest, with a difference of 27.22%. More importantly, as the largest population agglomeration region in the research region correspondingly, the Shanyang administrative region had the highest SU25 and TR20 values, regardless of the multi-annual mean and annual statistical extreme values. Additionally, the FDO and IDO of both Boai County and Qinyang City were the highest, which could be representatives of the northern mountainous region as they were ranked the first and the second, respectively, in altitude. All in all, there were two main conclusions about the relative temperature indices based on the above analysis. First, the regional differentiation of both SU25 and IDO was smaller while that of both TR20 and FDO was larger. Second, the rela- tive indices of high temperature in plain urban area were increasing while those of low temperature in mountainous hilly area were decreasing. 3.3.2 Changing or variation conditions. Combined with Fig 9, irrespective of SU25 and IDO based on the daily maximum temperature, or TR20 and FDO based on the daily minimum temperature, the fluctuation trend states were similar, and the fluctuation pattern during the time period before and after 1994 were relatively distinct (Fig 10). However, there were two noteworthy points regarding the changing process or trend characteristics. First, the fluctuation patterns both SU25 and TR20 indicating high temperature were extremely similar. The values before 1994 were mostly lower while the values after 1994 were mostly higher, showing an increasing trend (Fig 10a and 10c). There is a definite increase of TR20 by degrees, and the average values of intergeneration during the studied period were 70.41d/a, 68.16d/a, 69.00d/a, 80.05d/a, 80.34d/a, 86.04d/a, especially during the last 40a since the 1980s. Second, the fluctuation state of both IDO and FDO indicating low temperature was basically the same, and the variation tendency was declining (Fig 10b and 10d). The fluctuation regularity of FDO was more significant, and the average values of intergeneration in the studied period were 70.41d/a, 68.16d/a, 69.00d/a, 80.05d/a, 80.34d/a, and 86.04d/a, respectively, with a rather decreasing trend. Briefly, two relative high temperature indices including SU25 and TR20 had a definite increasing trend while two relative low temperature indices including IDO and FDO tended to decrease. Compared with both SU25 and IDO based on daily maximum temperature, the trend of both TR20 and FDO based on daily minimum temperature was more regular, indicat- ing a definite increase and decrease, respectively (Fig 10c and 10d). 3.4.1 Temporal-spatial features. The frequency of HTD40 was relatively high with the mean of 1.65d/a, and the regional differentiation was larger than that of LTD-10. The total frequency of seven stations during the studied period was 106d, 114d, 65d, 137d, 97, 127d, and 71d, respectively. The HTD40 of Qinyang, Boai, Xiuwu, and Mengzhou were higher—all exceeding 100d; those of the other three stations: Shanyang, Wuzhi, and Wenxian, were relatively lower. Furthermore, the average frequency of the former four stations was 55.79% higher than that of the latter three stations. More significantly, the frequency of Xiuwu (the highest) was 92.96% higher than that of Wenxian (the lowest). Correspondingly, the frequency of LTD-10 was relatively low with the mean of 0.70d/a, and the regional differentiation was smaller than that of HTD40. The total frequency of seven stations during the studied period was 43d, 36d, 53d, 36d, 39d, 55d, and 51d, respectively. The LTD-10 of Mengzhou, Shanyang, and Wenxian were higher—all exceeding 50d; that of Boai, Xiuwu, Qinyang, and Wuzhi were relatively lower. The average frequency of the former three stations was 37.66% higher than that of the latter four stations. Rather strikingly, the frequency of Mengzhou (the highest) was 52.78% higher than that of Xiuwu (the lowest).",
    "3.4.2 Changing or variation conditions. Combined with Fig 11, there were two analysis-worthy points regarding the changing process of two disaster temperature indices in this article. At first, HTD40 fluctuated significantly while no obvious mutation occurred. There are two high values in the 1960s and the 2000s (Fig 12a). During the studied period for HTD40> 10d, there were 11 years in the whole research region, and eight years during the 1960s and the 2000s—from 1964 to 1967, 2002, 2005, 2006, and 2009. From the 1960s to the 2010s for HTD40, the annual mean was 1.44d/a, 0.49d/a, 0.16d/a, 0.33d/a, 0.94d/a, and 0.74d/a, respectively. Generally speaking, the 1980s being the boundary, there was a decrease first, and then an increase. Furthermore, there was a high-value period of the 1960s regarding LTD-10 and a low-value period of the 1990s with characteristics in sharp contrast to the fluctuating state regarding HTD40 (Fig 12b). Among them, the frequency of LTD-10 during 1969, 1964, and 1967 ranked the top three for the studied period, which were 81d, and double 41d, respectively. There were eight years during which the frequency of LTD-10 was 0, and four of them were during the 1990s: 1992, 1994, 1995, and 1997. From the 1960s to the 2010s, the annual mean of LTD-10 was 4.51d/a, 2.13d/a, 1.37d/a, 0.49d/a, 0.46d/a, and 0.97d/a, respectively, with an overall decreasing trend. Allin all, the frequency of HTD40 was high and the regional differentiation was large, while that of LTD-10 was low and the regional differentiation was small. Both the 1960s and the 2000s were the higher-value periods of HTD40, while 1960s was the higher-value period for LTD-10 and 1990s was the lower-value period for LTD-10. Based on the basic data of daily minimum, maximum, and mean temperatures for the period 1961—2021 in Jiaozuo City, Henan Province, China, both the temporal-spatial features and the changing or variation processes of 14 temperature indices in four categories, including the mean temperature index, the extreme temperature index, the relative temperature index, and the disaster temperature index, were expressed by means of linear tendency estimation and anomaly fluctua- tion. Thereafter, this article presents the corresponding adaptive strategies on climate resource utilization to the main culti- vated crops, according to regional temperature change trend. There are four main conclusions about regional temperature change: The observed temperature changes in Jiaozuo City—particularly the increase in annual mean temperature, higher fre- quency of extreme high-temperature events (HTD40), and shifting seasonal temperature patterns—have direct and profound implications for the growth, yield, and management of major crops, particularly winter wheat and summer maize, which are dominant in this dual-cropping region. These climatic shifts are likely to curtail the growing periods, intensify heat stress during critical phenological stages, increase evapotranspiration demands, and alter pest and disease dynam- ics, thereby posing challenges to traditional cultivation systems. To effectively respond to these impacts and enhance the resilience of local agriculture, several adaptive strategies are proposed: Although this study provides a comprehensive analysis of temperature trends and related climatic indices in Jiaozuo City, several limitations should be acknowledged. First, the research is geographically limited to a single representa- tive area, which may not fully reflect the broader characteristics of other winter wheat and summer maize dual-cropping regions in China. Second, this study mainly focuses on temperature-related indices and does not incorporate other import- ant climatic factors such as precipitation, humidity, solar radiation, and wind speed, which also have significant effects on crop growth and climate-induced agricultural risks. Third, socio-economic variables, technological progress, and changes in agricultural management practices were not considered; these factors can play critical roles in the effectiveness of adaptive strategies. Future research should aim to extend the spatial scale of analysis to include multiple dual-cropping regions with varying geographic and climatic conditions. Integrating temperature data with other climatic variables and using crop simulation or climate impact models would facilitate a more holistic understanding of agricultural vulnerability. Furthermore, interdis- ciplinary approaches that combine climate science with socio-economic assessments and stakeholder input would help formulate more targeted and feasible adaptation strategies. These efforts will be valuable for enhancing the resilience of agricultural systems to climate change in China and beyond. We would like to express our sincere gratitude to Henan Polytechnic University for their invaluable support and guidance throughout the course of this research. In particular, we are deeply thankful to the editors and reviewers, who provided insightful comments and encouragement throughout the project."
]