[
    "Abstract: As a big province in central China, the improvement of technological innovation capacity in Henan Province plays an important role in the improvement of technological innovation capacity in the central region and even in the whole country. The article constructs a comprehensive evaluation index system from three dimensions of technological innovation: input, output, and environment, including four important subjects: government, enterprises, higher education institutions and research and development institutions. Three common factors, enterprise innovation factor, learning and research innovation factor and higher education environment factor, are extracted by factor analysis method to evaluate the technological innovation capacity of Henan Province. The results show that the comprehensive score of technological innovation capacity in Henan Province lies in the national average level, among which the environmental factor of higher education ranks highest, but the enterprise innovation factor and the learning and research innovation factor rank behind. Therefore, Henan Province needs to rely on the relevant strategies of regional integration, accelerate the construction of collaborative innovation industrial system, actively establish docking cooperation with higher education institutions and research and development institutions, optimize the allocation of higher education resources, and further improve the technological innovation capacity of enterprises and the technological innovation results transformation capacity of higher education institutions and research and development institutions. Innovation is the source of vitality for the organization to keep its vitality and develop constantly. At present, China has entered a new stage of development. In the face of the new characteristics of the new stage of development and the new changes in the environment at home and abroad, it is urgent to continue to implement the strategy of innovation-driven development and enhance the capacity of innovation. At present, there is a gap in the development of regional technological innovation capacity in China, which is an important reason for the imbalance of regional economic development in China and the difficulty of achieving high quality development. As a big province in the middle of China, Henan Province has been improving its technological innovation capacity since the reform and opening up, but it still has a big gap with the coastal developed provinces. This paper evaluates the technological innovation capacity of Henan Province based on factor analysis, which is helpful to fully understand the advantages and shortcomings of Henan Province in technological innovation, and to fully grasp the gap between Henan Province and other provinces in China in terms of regional technological innovation capacity and the reasons for the gap. Therefore, according to the evaluation results, we can provide constructive suggestions for the improvement of regional technological innovation capacity and even the improvement and balanced development of national technological innovation capacity in Henan Province. Since Schumpeter first put forward the concept of innovation in 1912, the related research on innovation has been in full swing. In the 1960s, the second industrial revolution flourished, a variety of new technologies and inventions emerged in endlessly, and technological innovation was raised to the dominant position of innovation. Enos is the first clear definition of technological innovation. He believes that technological innovation is the result of many kinds of behaviors, such as choosing invention, ensuring capital investment, establishing organization, making plan and so on[1]. Lynn considered that technological innovation is the whole process from understanding the commercial potential of technology to transforming technological innovation into commercialized products[2]. Freeman believes that technological innovation is the whole process of technology, process and commercialization, and the first commercial transformation of new products, new processes, new systems and new services. Freeman also put forward the concept of national innovation system[3]. And then Cooke put forward the concept of regional innovation system is put forward[4]. The research related to technological innovation in China began in the 1980s, and Fu pointed out that technological innovation is a process in which entrepreneurs can gain benefit, gain insight into and grasp the potential opportunities of the market, reorganize the factors and conditions of production, and launch new products and processes with better efficiency[5]. On the regional innovation system, Yin and Liang considered that it is an organic network system composed of all available human, technical and capital resources in certain administrative, economic or geographical areas, guided by regional governments, with enterprises within the region as the main body, and universities, scientific research institutions and intermediary institutions in the region, which is the basis and important part of the national innovation system. This study highlights that enterprises, universities and scientific research institutions are the real producers of technological innovation. Regional innovation capacity is an important research content of regional innovation system, which refers to the capacity of the main body in a certain region to make use of its own unique resources to carry out technological innovation, output new technology, new technology or new products, and promote regional economic development according to the local characteristics and development needs[6].",
    "The domestic research on regional technological innovation capacity mainly focuses on two aspects. The first is the research on the evaluation index system of regional technological innovation capacity. Yin and Liang's research on regional technological innovation capacity was earlier, and the scholar established a comprehensive evaluation index system from three aspects: technological base indexes, economic base indexes and environmental base indexes of technological innovation. Shao and Tan studied the process of regional technological innovation and constructed a three- level evaluation index system from four dimensions: potential, input, output and environment of technological innovation[7]. Zhang and Xia pointed out that the connotation of regional technological innovation capacity includes four aspects: input to scientific and technological innovation, output of scientific and technological innovation results, contribution of technological innovation to social economy, and technology diffusion, and established a regional technological innovation capacity evaluation index system by selecting 20 indicators from scientific and technological input, scientific and technological output and technology diffusion dimensions according to its connotation[8]. Hu and Xie organically combined the synergistic capacity with the regional technological innovation capacity evaluation index system, and constructed the evaluation index system from five aspects: regional innovation environment support, regional knowledge creation and acquisition capacity, regional enterprise technological innovation capacity, regional technological innovation synergistic capacity, and regional technological innovation economic performance[9]. Focusing on the evaluation of county innovation capacity, Zhou et al. constructed an evaluation index system from three dimensions of innovation input, environment and performance[10]. Zhang, on the other hand, established a comprehensive evaluation index system to evaluate the regional technological innovation capacity of Shaanxi Province from three dimensions reflecting regional technological innovation input, support and output capacity: technological innovation resources, enterprise technological The second is the research on the evaluation methods of regional technological innovation capacity, in terms of evaluation methods, the common methods mainly include factor analysis, cluster analysis, principal component analysis, etc. Wang and Fang established an index system around five dimensions of knowledge creation, flow, enterprise technology innovation capacity and innovation environment, and economic performance, and used principal component analysis to comprehensively evaluate the regional innovation capacity of three northeastern provinces[12]. Liu et al. used the TOPSIS method of entropy optimization to measure the development level of technological innovation capacity of 29 provinces and cities and 3 major economic belts in China, and further explored the development gap of technological innovation capacity among regions based on this by applying the coefficient of variation method[13]. Wang and Han evaluated the regional technological innovation capacity of Henan Province using an improved fuzzy comprehensive evaluation model[14]. Jin used Deng's gray correlation model, an argumentative and analytical method, on the basis of establishing the regional technological innovation capacity evaluation index system[15]. Yin et al. improved the relevant evaluation index system and measured the innovation capacity index of Zhejiang Province during 2010-2016 using the comprehensive index method[16]. Bei used the factor analysis method and extracted three public factors to evaluate the technological innovation capacity of Jiangsu Province[17]. Combined with the existing research, in the construction of the evaluation index system of regional technological innovation capacity, different scholars have different dimensions of establishing the evaluation index system, and there are also differences in the specific indicators selected. Generally speaking, most of the studies pay attention to the input, output and environment of innovation, but fail to effectively highlight the main role of innovation in enterprises, higher education institutions, research and development institutions and the role of the government in guiding innovation. In the aspect of evaluation methods, the common methods are factor analysis, cluster analysis, principal component analysis and so on. Based on this, this paper constructs the evaluation index system of regional technological innovation capacity from the three dimensions of technological innovation input, technological innovation output and technological innovation environment, including four important subjects: government, enterprises, higher education institutions and research and development institutions, and evaluates the regional technological innovation capacity of Henan Province by factor analysis, so as to further understand the technological innovation capacity of Henan Province and even all regions of China. The principle of scientificity is reflected in the scientific rationality of both the connotation of individual indicators and the overall indicator system. On the one hand, the concept reflected by the indexes should be able to objectively and truly reflect the development status of Henan Province's technological innovation capacity, and be able to measure and calculate; on the other hand, the indexes should cover three dimensions of technological innovation input, output and development environment, and also reflect the role played by four main bodies, namely, government, enterprises, higher education institutions and research and development institutions in technological innovation.",
    "The construction of the index system for evaluating the technological innovation capacity of Henan Province should follow the principle of operability, the selection of the selected index should be simple and clear, the data corresponding to the index should be highly available, and the index calculation process should have strong operability. for evaluating the technological innovation capacity of Henan Province should be representative and can accurately and comprehensively reflect the input, output and development environment of technological innovation as well as the factors of government, enterprises, higher education institutions and research and development institutions. In view of the fact that technological innovation in Henan Province involves many subjects, the whole process of technological innovation is complex, and there are many relevant evaluation indicators, which need to be evaluated from different perspectives, the systemic principle should be fully considered when establishing the index system, so that the index system can accurately reflect the development of Henan Province's technological innovation capacity and the contribution of different subjects' relevant indicators in different dimensions in a complete and distinct manner. Combined with the previous review, this paper constructs the evaluation index system from the three dimensions of input, output and environment of technological innovation. Considering the availability and credibility of the data, the article refers to the research of Bei, the article selects 21 indicators including four subjects: government, enterprises, higher education institutions and research and development institutions. Table 1 shows the evaluation index system of technological innovation capacity of Henan Province. In addition, in order to understand the development of technological innovation capacity in Henan Province in China and the advantages and shortcomings compared with other provinces, cities and autonomous regions, 31 provinces and autonomous regions, including Henan Province, are selected as evaluation objects for horizontal comparison. The data of each index in the article comes from the China Science and Technology Statistical Yearbook 2020 and the China Statistical Yearbook 2020. Factor analysis is a classical method in comprehensive evaluation, which can group the indicators with high correlation into different groups, and then use the common factor to portray this group, so as to achieve dimensionality reduction. In this study, technological innovation capacity is comprehensive, which cannot be described by a single indicator, and can only be judged by establishing a comprehensive evaluation index system containing multiple indicators. However, these indicators have different values, units and dimensions, and there are complex relationships among them, which make it difficult to compare them directly. In such a context, this study selects factor analysis to extract common factors, and uses these common factors to reflect all the information of the index system, which not only avoids the duplication among indicators, but also overcomes the disadvantages of subjective assignment, so as to objectively and scientifically evaluate the technological innovation capability. analysis, KMO test and Bartlett's sphericity test were conducted on the standardized data using SPSS 26.0 software. The results of the tests are shown in Table 2. The results show that the KMO sampling aptitude is 0.786 (greater than 0.6), which is suitable and effective for factor analysis, and the significance level of Bartlett's sphericity test is 0.000, which indicates that there is a strong correlation between the indicators. The results of both items indicate that the evaluation index system constructed in this study is suitable for factor analysis. Table 2. Results of KMO test and Bartlett's spherical test for evaluation index of technological innovation capacity in Henan Province In this study, principal component analysis was used to extract the common factor variance of variables, and the results were shown in Table 3, in which only the indicator X19 has a low extraction degree of 0.774. The amount of information lost by the other 20 indexes is less than 20%, and the amount of information loss is small, which indicates that the extracted common factor can well reflect all the indexes, and the effect of factor analysis is better. The article extracted 3 common factors with eigenvalues greater than 1 as the extraction principle, as shown in Table 4, and their variance contribution rates were 71.322%, 16.496%, and 6.315%, and the cumulative variance contribution rate reached 94.133%, which could cover more than 90% of the information of all indicators with little information loss.",
    "Figure 1 shows the scree plot, and further analysis of the scree plot shows intuitively that the first 3 factors have eigenvalues greater than 1, and the eigenvalues are significantly smaller from the 4th factor, so it is a more accurate approach to extract the 3 common factors. In order to explain the common factor more intuitively, the maximum variance method is used to rotate the factor, and the component matrix after rotation is obtained, as shown in Table 5. Of which, common factor F1 has larger loadings on indicators reflecting the overall level of regional technological innovation, such as R&D personnel full time equivalent, external expenditure on R&D expenses, number of domestic patent applications received, number of domestic patent applications granted, gross domestic product, local general public budget expenditure on science and technology and local general public budget expenditure on education.At the same time, common factor F1 also has larger loadings on indicators reflecting the level of enterprise technological innovation, such as internal expenditure on R&D expenses of industrial enterprises above the scale, new product development expenditure of industrial enterprises above the scale, new product sales revenue of industrial enterprises above the scale, high-tech industry profit amount, number of enterprises above the scale with R&D activities and number of enterprises in high-tech industry. Therefore, in summary, the common factor F1 is named as enterprise innovation factor. Common factor F2 has a larger loading value on the total internal expenditure of R&D funds in higher education institutions, number of scientific and technical papers published in higher education institutions, internal expenditure on R&D expenses of research and development institutions, number of scientific and technical papers published by research and development institutions, number of research and development institutions and gross domestic product per capita, which reflect the technological innovation level of higher education institutions and research and development institutions, so this common factor is named as The public factor F3 has a large loading value on two indicators reflecting the regional higher education level, namely number of higher education institutions and number of full-time teachers in higher education institutions. Therefore, this factor is named as higher education environment factor. The article uses SPSS26.0 to calculate the component score matrix of technological innovation capability evaluation indexes corresponding to the standardized data, and the results are shown in Table 6. The component score coefficients of the three common factors are ai, bi, ci, where i represents different indicators, with values ranging from 1 to 21. Xij represents the standardized value corresponding to each index, where j represents different areas, and the value range is 1-31, then the score of each common factor in each region can be expressed as F1=∑aiXij, F2=∑biXij, F3=∑ciXij. In calculating the comprehensive score of this area, the proportion of the variance contribution rate of the common factor after rotation to the cumulative variance contribution rate should be taken into account, then the formula for calculating the final comprehensive score should be F=(0.53063F1+0.24870F2+0.16200F3)/0.94133. The final calculation results and ranking of each score are shown in Table 7. The evaluation index system of technological innovation capacity constructed in this paper includes three public factors: enterprise innovation factor, academic and research innovation factor and higher education environment factor. The weight of enterprise innovation factor is 0.564, the weight of academic and research innovation factor is 0.264, and the weight of higher education environment factor is 0.172. It can be concluded that the innovation capacity of enterprises has the greatest influence on regional technological innovation capacity. Secondly, higher education institutions and research and development institutions, the environment of higher education has little impact on it. capacity, Henan Province is located in the 12th place in the country, and its technological innovation capacity is at the national average level, with a large gap with the higher-ranked provinces. Among them, Guangdong Province has the highest score, and the comprehensive score of technological innovation capacity is located in the first place in China, which is consistent with the relevant research results of other scholars, and it can be seen that the score of Guangdong Province is significantly higher than other provinces. In terms of the enterprise innovation factor scores, there are large disparities among different regions of the country, among which only three provinces, Guangdong, Jiangsu and Zhejiang, have enterprise innovation factor scores above 1, with 4.05679, 2.25576 and 1.94635, respectively, which can be seen to be located in the Guangdong-Hong Kong-Marco Greater Bay Area and the Yangtze River Delta region. Among them, the implementation of regional integration strategy has provided a boost to improve the technological innovation capability of these provinces. The innovation factor score of enterprises in Henan Province is -0.43036, ranking 21, with a great gap with Guangdong Province, which indicates that enterprises in Henan Province need to improve their technological innovation capacity and their ability transform technological innovation into market value. to From the viewpoint of the academic and research innovation factor, the differences between different regions remain significant, with Beijing, Shanghai and Sichuan ranking in the top three provinces and cities, of which Beijing has an academic and research innovation factor score of 4.87663. Beijing is the political center and cultural center in China, with a collection of famous universities and various research and development institutions, and has good academic and research innovation capacity. Shanghai, second only to Beijing, is the largest port city and an important economic, scientific and technological, financial and cultural center in China, with 4 985 universities, and has excellent academic and research innovation capacity. Sichuan, Shaanxi and Jiangsu also have excellent academic and research innovation capacity. Henan Province's academic and research innovation capacity score is only -0.43689, ranking 24th, which shows that the technological innovation capacity of higher education institutions and research and development institutions in Henan Province needs to be further improved to be able to bring technological innovation to fruition.",
    "In terms of higher education environment factor, Henan Province ranks first with a score of 2.07324, which reflects its status as a large education province with 141 higher education institutions and more than 120,000 full-time teachers in Henan Province. Other provinces with higher education environment factor scores are Shandong Province, Sichuan Province, Hebei Province and Jiangsu Province. However, the overall score of Henan Province is not high because the weight of higher education environment factor is only 0.172. In addition, among 141 higher education institutions in Henan Province, only one university, Zhengzhou University, is a national key universities. Therefore, although the higher education environment factor is ranked first, its academic research innovation factor is ranked 24, which reflects the backwardness of Henan higher education institutions in terms of technological innovation capacity. Based on the previous research on the evaluation of regional technological innovation capacity , this paper constructs a set of comprehensive evaluation index system from the three dimensions of input, output and environment of technological innovation, including the four main bodies of government, enterprises, higher education institutions and research and development institutions, and uses factor analysis to extract three common factors: enterprise innovation factor, academic and research innovation factor and higher education environment factor. The regional technological innovation capacity of 31 provinces, cities and autonomous regions, including Henan Province, is evaluated. According to the evaluation results, it can be found that the comprehensive technological innovation capacity of Henan Province is at the national average level, with a large gap with the provinces and cities in Guangdong-Hong Kong-Marco Greater Bay Area and Yangtze River Delta. Specifically, although Henan Province has the highest score in higher education environment factor, the weight of this factor is small and the technological innovation output capacity of Henan higher education institutions is backward, and the ability of collaboration between industry, academia and research is backward, which leads to the low score of enterprise innovation factor and academic and research innovation factor, two factors with more important weight, and Henan Province is at the backward level in the country. In the next step, Henan Province should actively grasp the opportunity of the national strategy of high-quality development in the central region, integrate and dovetail with major national strategies, strengthen strategic cooperation with Beijing, Tianjin, Hebei, Yangtze River Delta and Guangdong-Hong Kong-Macao Greater Bay Area, promote the construction of Zhengzhou-Luoyang-Xi'an High Quality Development Cooperation Belt, and strive to obtain assistance from regional integration strategies. To accelerate the construction of a collaborative innovation industrial system, based on the characteristics and advantages of local industries, actively cooperate with other regions to improve the innovation capacity of enterprises. It should actively establish docking cooperation with large institutions, promote the landing and transformation of scientific and technological innovation results, and improve the technological innovation capacity of regional higher education institutions and research and development institutions. It should also further optimize the allocation of higher education resources and increase the incentive for talents and technological innovation, so that the good higher education environment in Henan Province can really become the soil for cultivating and improving the technological innovation capacity of Henan Province. Restricted by the availability of indicator data, the article only studied the technological innovation capacity of Henan Province and other provinces, cities and autonomous regions in China in 2019, and comparisons for several years can be included in future studies so as to have a better grasp of the technological innovation capacity of each region and the gap between different regions over time."
]