[
    "Abstract: With the acceleration of urbanization, the problem of urban risk becomes more and more serious, so it is imperative to build a resilient city. Vulnerability and toughness are interrelated. Vulnerability analysis and evaluation is the way to realize the resilience city. Taking Henan province as an example, this study from the resource, ecological environment, economy, social four aspects to build the urban vulnerability evaluation index system, using the comprehensive index method of the vulnerability of various municipalities nearly 10 years of Henan province to measure and study the dynamic evolution process, so as to provide theoretical reference for toughness of city construction and the practice application. Domestic and foreign scholars mainly focus on the connotation of vulnerability, the conceptual model of vulnerability, vulnerability assessment, vulnerability avoidance measures and the logical context of the recommendations to carry out research. The connotation and analysis framework of vulnerability constitute the theoretical basis of vulnerability research context, and its quantitative evaluation is the technical method of vulnerability research and also the key point in vulnerability research context [1]. In most studies, the static spatial perspective is used to evaluate the research unit [2]. The formation of vulnerability is not an overnight process, but a dynamic process. Therefore, scholars begin to turn the research perspective to the dynamic study of vulnerability. For example, Li and Zhang (2011) took mining cities in three northeastern provinces as examples and studied the evolution process of economic system vulnerability of mining cities with the help of the vulnerability analysis framework development, and concluded that of sustainable the economic vulnerability of mining cities presented an inverted u-shaped curve [3]. Li et al. (2017) took different resource-based cities including Tongling, Jiaozuo, Baishan and Daqing as research objects, evaluated and predicted their vulnerability by using trend extrapolation method and set pair analysis method, in order to explore the change law of vulnerability of different resource-based cities [4]. From the perspective of vulnerability, Lu et al. (2017) used coefficient of variation method and fuzzy analytic hierarchy process to construct the vulnerability evaluation model and spatio-temporal dynamic change process of human-earth coupling system in northwest China [5]. mining has been a lot of research, and achieved fruitful results, but still exist the following problems: (1) the dynamic evolution of case much empirical research for mining resources, tourism and other special type of city, to the complex terrain of underdeveloped economy, the Midwest attention is limited; For the key brittle factors of the study is mostly static analysis, the lack of key brittle factors of the longitudinal dynamic evolution law. According to the above analysis, this study with eastern economic depressions in Henan province as an example, its various cities nearly a decade of vulnerability in measure, analysis of dynamic evolution, introducing key embrittlement factors hinder the concept of degree of mining, kinds and intensity analysis to extract the embrittlement factor, inductive short board system of urban planning, as the basis of toughness of city construction. Through the intervention regulation to improve the resilience of the city, the city to the benign direction of development. As can be seen from Fig. 1, the overall vulnerability index of Henan province dropped from 0.5956 to 0.3891 from 2007 to 2016, with a decline rate of 34.67%. The vulnerability experienced three stages of “slight rebound – rapid decline – slow and steady decline”. In addition to a slight increase in vulnerability in 2008, the overall vulnerability has been decreasing, with the largest decline from 2013 to 2014, and the vulnerability of cities under the jurisdiction of various provinces has also shown a declining trend since 2008.This shows that the cities in Henan province are developing well, the urban carrying capacity is increasing, the chronic diseases in cities are getting better, and the systemic risks in cities are decreasing In this study, urban vulnerability was analyzed in five stages: 2007-2008, 2008-2010, 2010-2012, 2014-2014, and 2014-2016. The average vulnerability of adjacent two years was calculated. According to geographical location, Henan province was divided into Northern, Central and Southern Henan. industrial economy of Zhengzhou to recover and the vulnerability to change from a high level to a medium level. Luoyang increased the proportion of R&D in GDP to enhance the economic innovation capacity. At the same time, under the support of the municipal party committee government, it carried out peony cultural industry and cultural tourism industry, achieving a total tourism revenue of 9.336 billion yuan at the end of the year, which greatly promoted the economic development of Luoyang.",
    "(1) 2007-2008. The comprehensive vulnerability of Henan province was 0.5981. Geographically, the average vulnerability of cities in northern Henan is the highest, followed by that in central Henan, and the average vulnerability of cities in southern Henan is the lowest. According to the statistics of the number of cities with different degrees of vulnerability in the province, it is concluded that the proportion of cities with moderate and relatively high levels of vulnerability is 27.88% and 72.22%, respectively. The whole city is in a relatively high level of vulnerability. The relatively backward level of economic development, limited government policy support and low efficiency of agricultural production make Shangqiu in a highly vulnerable state. Due to the need of the state to protect ancient buildings, Kaifeng's infrastructure is relatively backward. Based on the perspective of economic development, the founder pattern left by history in Kaifeng city encircled the downtown prosperity and restrained the urban development to some extent. Due to the lack of long-term planning for the development and utilization of cultural resources and the unreasonable industrial layout, the zonal economy has not yet been formed in the whole city. The vulnerability indexes of Anyang, Hebi, Puyang and other cities are similar. The high asset-liability ratio of industrial enterprises, the low efficiency of resource utilization and the proportion of R&D investment in GDP make the northern cities of Henan in a relatively (2) 2009-2010. The overall vulnerability of Henan was 0.55. The vulnerability of the whole province is high in the south and low in the north. The proportion of cities with moderate and high vulnerability levels was 55.56% and 44.44%. Under the pressure of economic crisis, the Zhengzhou municipal government actively implemented supporting policies and vigorously implemented supporting the superior and the strong, which enabled the (3) 2011-2012. The overall vulnerability of Henan province was 0.484 and 7, and the vulnerability pattern of the whole province was north > middle > south. The proportion of cities with low, medium and high vulnerability levels was 22.22%, 16.17% and 61.11%. The overall pattern of vulnerability changed greatly from 2009 to 2010, with Zhengzhou, the provincial capital, as the core of each city, forming a moderately vulnerable circle. Zhengzhou city firmly seized the historic opportunity that the construction of the comprehensive pilot airport zone was mentioned as a national strategic level, and vigorously developed the industrial economy. The per capita GDP increased from 49 949 yuan in 2010 to 75 200 yuan in 2012, an increase of about 50%. The policy of “Zheng-Bian Integration” aimed at realizing “Zheng-Bian” city has achieved initial results. The vulnerability of Kaifeng city has decreased significantly than that of surrounding cities. The number of universities per 10,000 people in Luoyang city increased by 19.32% annually, becoming the backbone of economic innovation in Luoyang city. The positive adjustment of economic structure in Puyang city reduced the debt ratio of enterprises above the scale from 48% in 2010 to 34.8%. (4) 2013-2014. The overall vulnerability of Henan province was 0.4325. The proportion of cities with low and moderate vulnerability was 44.44% and 55.56%. Focusing on “growth, structural adjustment, livelihood” development ideas, a series of policy implemented in Zhengzhou city, the improvement of the medical and health care especially with the popularity of communication equipment, ten thousand people with data from 66 to 92 in 2011, ten thousand people have the Internet number increased nearly four times in 2011, Zhengzhou city overall low vulnerable status; Kaifeng responded positively to the call of “promoting ecological civilization and building a beautiful Kaifeng”. The harmless disposal rate of household garbage increased from 69.23% to 100%. At the beginning of 2014, Jiaozuo city made full efforts to promote the introduction of foreign investment through comprehensive investment promotion measures including professional investment promotion, agent investment promotion, commercial investment promotion, and domestic and foreign publicity promotion meeting. The actual utilization rate of foreign investment increased from 106% in 2013 to 251%, up by 137%. (5) 2015-2016. The overall vulnerability of Henan province was 0.3801, and the vulnerability of the whole province was still high in the south and low in the north. The proportion of cities with low and moderate vulnerability was 61.11% and 38.89%. In this period, except Shangqiu, Nanyang, Luohe, Sanmenxia and Hebi, all other cities in Henan province were at a low level of vulnerability. With the provincial capital Zhengzhou as the core, the low-vulnerability circle has been further expanded, and the urban areas are interrelated and influenced to form a relatively large area with low vulnerability. With the gradual advancement of the integration process, the infrastructure of Zheng-Kai new area is increasingly improved, and the trend of differentiated and complementary industrial development cluster is preliminarily presented.",
    "This study measures the vulnerability of cities in Henan province in recent ten years, analyzes the temporal and spatial evolution of vulnerability of cities, excavates the key causes of vulnerability, reveals the planning demands of cities, and lays a foundation for the construction of resilient cities. The results show that: (1) in recent ten years, the overall vulnerability of Henan province has experienced three stages of \"slight rebound - rapid decline - slow and steady decline\", which indicates that henan province has developed well with the efforts of all parties. The vulnerability of cities in the whole province shows the characteristics of “gradient” differentiation, and the overall vulnerability level is high in the north and low in the south. The evolution of the vulnerability of cities in Henan province shows the characteristics of spatial differentiation, which is closely related to the location. During the period from 2007 to 2016, the provincial capital Zhengzhou had a significant influence on the surrounding cities, gradually forming a lower vulnerable circle with itself as the core, and the urban areas were interrelated to form a wide range of lower vulnerable areas. (3) the analysis of key factors causing brittle indicates that the asset-liability ratio of industrial enterprises above the scale, the penetration rate of water use and the harmless disposal rate of household waste are the leading factors restricting the healthy development of cities. The embrittlement factors appear to be stable, and the key embrittlement factors in most cities do not change much except in order. In this study, the whole city is taken as the research unit to characterize the spatio-temporal dynamic differentiation law of urban vulnerability. In the future, the research direction should be narrowed down from cities to county areas and even street units, so as to fill the deficiency of vulnerability in spatial heterogeneity within cities, so as to adopt more targeted resilience planning intervention for small scale spatial units with different vulnerability characteristics."
]