[
    "School of Water Conservancy, North China University of Water Resources and Electric Power, Henan, Zhengzhou 450046, China © College of Agricultural Science and Engineering, Hohai University, Jiangsu, Nanjing 210024, China *Corresponding author. E-mail: yellowstar0106@163.com The distribution of water resources determines the pattern of economic development, making the strategic layout of China’s water resources crucial. This study focuses on the water-receiving area of the South-to-North Water Diversion Project in Henan Province, addressing issues related to water resource scheduling and allocation. This paper constructs an evaluation model using the Gini coefficient and the multi-cor- relation coefficient method to analyse the development levels of three types of water resource matching relationships. It then employs kernel density estimation, centroid, and standard deviation ellipse models to study the spatial impact of water resources, revealing the microstruc- ture, central tendency, and dispersion characteristics of water resource distribution. The results indicate: (1) There is a correlation between the algorithms of the Gini coefficient and relational degree. The overall spatial equilibrium of the three matching relationships differs. (2) The spatial equilibrium within the same subregion varies across different matching relationships. (3) The total water resources in the South-to- North Water Diversion area of Henan Province have steadily increased, with rapid development across regions and narrowing disparities among cities. The centroid is located in Xuchang City, and the directional characteristics of total water resources are becoming less pronounced. This is an Open Access article distributed under the terms of the Creative Commons Attribution Licence (CC BY 4.0), which permits copying, adaptation and redistribution, provided the original work is properly cited (http://creativecommons.org/licenses/by/4.0/). Water is the source of life, essential for production, and fundamental to the ecosystem (Kumar et al. 2024); water resources are vital for maintaining ecological balance and ensuring human survival and development. The current distribution of water resources in China is marked by significant disparities, with northern regions experiencing relative water shortages while southern regions enjoy abundant water resources. China has introduced a water management principle of ‘prioritizing water conservation, ensuring spatial balance, adopting systematic governance, and exerting dual efforts’ to address both new and existing water challenges (Dengtao 2022). This (Dengtao 2022) principle emphasizes the following points: (1) the importance of improving water resource utilization efficiency, preventing the simultaneous increase in water management efforts and arbitrary water waste; (2) coordinating the allocation of water resources to promote balanced transfers between northern and southern regions; (3) leveraging both government and market roles in addressing water resource issues, ensur- ing fairness in water events while fully utilizing market efficiency in water resource allocation. Accordingly, China has proposed a national water network plan, which is a comprehensive system based on natural rivers and lakes, using diversion and drainage engineering as conduits, storage and regulation works as nodes, and intelligent control as a method, integrating functions such as the optimization of water resource allocation, flood disaster reduction in river basins, and the protection of water ecosystems. The South-to-North Water Diversion Project, as a major strategic water network initiative in China, adjusts the spatial distribution of water resources through inter-basin and inter-regional transfers, alleviating water scarcity in north- ern regions and contributing significantly to balanced regional economic and social development as well as national water security (Mengqin & Qingtao 2023). Henan Province, as an essential water-receiving area of the project’s central route, relies on the effective allocation and rational use of water resources, directly impacting ecological improvement, agricultural stability, and sustainable socioeconomic development within the province and the broader Central Plains region. Therefore, in-depth research into the spatial equilibrium of water resources in Henan’s water-receiving areas, along with the exploration of scientific allocation solutions, holds considerable practical significance and strategic importance for optimizing water man- agement, improving allocation efficiency, and safeguarding regional water security. Research on the spatial equilibrium of water resources focuses on exploring the relationship between water allocation and human activities. In the study of water resource allocation, various planning theories and methods have been employed, 2023). Ruggerio and Carlos Alberto provided a thorough analysis of the key factors affecting sustainable development and offered insights into how human-water interactions influence sustainability (Ruggerio 2021). Wu, Fan and other scholars have investigated the diverse impacts of climate change and human activities on water ecosystems, successfully uncovering how these elements affect the balanced distribution of water resources (Wu et al. 2024). Ghaith et al. utilized a specific CGE model to analyze the effects of water allocation strategies on optimizing management, tripartite water usage, and socioeco- nomic aspects, simulating the entire dynamic process (Ghaith et al. 2021). Davies created the IANEMI model to simulate the intricate interactions and dynamic relationships between societal production activities, daily human life, and the functioning of the natural environment (Davies & Simonovic 2011). Guided by the concept of ‘spatial equilibrium,’ Li et al. proposed an innovative evaluation and allocation method for water resources by integrating traditional assessment approaches (Li ef al. 2022). Feng developed a spatial optimization model to investigate the mechanisms of independent water supply allocation in regional water resource management (Feng 2021). Naghdi et al. constructed a multi-objective linear programming optimiz- ation model to effectively manage watershed water resources while considering supply and groundwater extraction constraints for planning water allocation (Naghdi et al. 2021). Ingrao et al. achieved a rational distribution of water quantity and agricultural resources in the watershed by developing a coupled model of surface water and groundwater, enhancing the comprehensive benefits of crops (Ingrao et al. 2023). To ensure equitable water resource allocation, Ren et al. designed a bi- level programming model with fuzzy randomness and employed a genetic algorithm based on the entropy-Boltzmann mech- anism to solve this nonlinear issue (Ren et al. 2023). Dai et al. merged hydrological models, water balance models, Gini coefficients, and chance-constrained programming (CCP) to create a multi-objective stochastic optimization model based on the Gini coefficient (Dai et al. 2018). Mousavi Janbehsarayi et al. proposed a multi-objective decision-making method to address the balance between economic and environmental aspects in water resource allocation under uncertain conditions (Mousavi Janbehsarayi et al. 2023). Wang Zhanhai and colleagues applied the Dagum Gini coefficient decomposition method to study the spatial equilibrium of water resources across different regions in Guangdong Province (Zhanhai et al. 2023). Chen Yanping et al. constructed a spatial equilibrium diagnostic model to evaluate the spatial equilibrium of neighboring ‘pro- vince pairs’ in the Yellow River basin, tracing the causes of any imbalances (Yanping et al. 2024). Wang Mengzhi and colleagues coupled status and quantity into a spatial equilibrium index, establishing a framework for evaluating spatial equili- brium in water resources (Mengzhi et al. 2023). Scholars like Chen Liang noted that concepts from economics, such as location entropy, the Lorenz curve, the Gini coefficient, and the Lorenz asymmetry coefficient, have gained new value and significance in the research of spatial equilibrium in water resources, offering new perspectives and methodologies (Liang et al. 2021). Regarding water resource allocation, Ma and colleagues developed an optimization model for water resource allocation in the South-to-North Water Diversion Project Area of Hebei Province (Suying et al. 2018). Fang Guohua and others focused on the water-receiving area in the Jiangsu section of the South-to-North Water Diversion project to construct a specific water resource allocation model (Guohua ef al. 2023). Ma Ruixin integrated multiple evaluation methods, including cloud models, improved TOPSIS, and matter-element extension models, to evaluate the effectiveness of water resource allocation in Henan Province (Ruixin 2023). Additionally, correlation coefficients and subtractive collec- tion principles have found extensive application in evaluating water resource carrying capacity. Yuan Kang and colleagues studied the Huai Bei Plain, employing partial correlation coefficients and subtractive collection principles to develop a twice semi-partial subtractive collection method (Kang et al. 2023). Zhou Tiejun and others utilized triangular fuzzy number random simulation techniques to assess the water resource carrying capacity in the Jianghuai hilly region (Tiejun et al. 2023). Jin Juliang et al. developed a four-dimensional subtractive collection calculation model to evaluate the water In summary, current research by scholars both domestically and internationally primarily focuses on the rational allocation of water resources and the evaluation of water resource carrying capacity. Studies on the spatial equilibrium of water resources are relatively limited, particularly regarding the regional impacts of large-scale water transfer projects, which remain unexplored. Regarding research subjects, few studies have specifically examined the impact of the South-to-North Water Diversion Project on Henan Province. From a methodological perspective, while the Gini coefficient and Theil index are commonly used, the application of relational degree and subtractive set pair potential in water resource equilibrium analysis is relatively less frequent. To bridge these research gaps, this study selects the Henan section of the South-to-North Water Diversion Project as a case study. By constructing evaluation models based on the Gini coefficient and multivariate relational degree, it examines the development levels of three matching relationships for water resources. Moreover, using kernel density estimation, centroid, and standard deviation ellipse models, it investigates the spatial impacts of water resources. This research aims to comprehensively reveal the spatial equilibrium of water resources in the water-receiving areas of Henan Province’s South-to-North Water Diversion Project from macro and micro perspectives, offering theoretical guidance.",
    "Currently, research by scholars both domestically and internationally primarily focuses on the rational allocation of water resources and the assessment of water resource carrying capacity, employing methods such as linear or non-linear program- ming, multi-objective optimisation, and coupled models. While these methods can optimise resource allocation efficiency, they overly emphasise engineering scheduling itself, lack a systematic analysis of the multi-dimensional implications of ‘spatial equity, and cannot dynamically capture the spatial evolution triggered by water diversion projects. Additionally, research on large-scale water diversion projects often focuses on optimising allocation models, neglecting systematic inte- grated analysis of the three-dimensional challenges of spatial equity - resource distribution dispersion, centre migration, and weakened directionality - and insufficiently addressing key regions such as the water-receiving areas in Henan Province. Research on the spatial equilibrium of water resources is scarce, particularly empirical studies on the regional impacts of large-scale water diversion projects. Specifically, there are few case studies on the Henan section of the South-to-North Water Diversion Project, and the application of connection numbers and subtraction sets for potential analysis is insufficient, with their advantages in handling uncertainty not fully utilised. This study addresses these gaps by establishing a framework combining the Gini coefficient, multi-dimensional connectivity analysis, kernel density estimation, and the centre-of-gravity- standard deviation ellipse model. By integrating static assessment with dynamic evolution and analysing sub-regional differ- ences through connectivity analysis, the study aims to comprehensively address the spatial equity challenges of water diversion projects and provide a new paradigm for optimising water resources in Henan Province. To address these gaps, this paper focuses on the Henan section of the South-to-North Water Diversion Project. First, the Gini coefficient is selected to analyse the spatial balance of water resources in the water-receiving areas. A multi-correlation coefficient method is employed to construct an evaluation model, which examines the development levels of the three types of water resource matching relationships. Finally, kernel density estimation reveals the distribution dynamics, centre of grav- ity, and standard deviation of the development levels in the Henan water-receiving areas of the South-to-North Water Diversion Project. An elliptical model is used to explore the global characteristics of the geographical distribution of total water resources. The aim is to comprehensively investigate the spatial balance of water resources in the water-receiving areas of the South-to-North Water Diversion Project in Henan Province from macro and micro perspectives, providing theor- etical references. This study focuses on the water-receiving areas of the South-to-North Water Diversion Project in Henan Province, conduct- ing an analysis of spatial equilibrium in water resources. The primary research contributions are as follows: (1) Spatial equilibrium analysis of water resources serves as the foundation and guarantee for regional water resource management. The study examines the spatial equilibrium of water resources in the water-receiving areas from the perspective of major water diversion projects. (2) A comprehensive research framework is established by integrating the Gini coefficient, multi- variate relational degree method, kernel density estimation, centroid, and standard deviation ellipse model, thereby innovating the methodological system for evaluating water resource spatial equilibrium. (3) The methods employed in this study can be practically applied to the water-receiving areas of the South-to-North Water Diversion Project in Henan Pro- vince, providing direction for optimizing water resource allocation and proposing scientifically sound allocation schemes to effectively mitigate the existing spatial imbalances in water resource distribution within the region. The remainder of this paper is structured as follows: Section 2 outlines the general characteristics of the study area, describes the methods applied, and identifies the data sources. Section 3 assesses and analyzes the spatial equilibrium of water resources in the Henan Province water-receiving areas of the South-to-North Water Diversion Project. Section 4 exam- ines the findings of the evaluation. Section 5 concludes with a summary of the research outcomes, provides recommendations, and proposes future research directions. The South-to-North Water Diversion project is a critically important strategic initiative in China. The receiving area of the South-to-North Water Diversion Middle Route in Henan Province is located in the southern part of the North China Plain and is distributed in a strip along the main canal. The total area of the receiving area reaches 167,000 km?, intersected by over 400 rivers of various sizes with the main canal, forming a complex river network. Henan Province ranks third among all provinces in China in terms of population, resulting in substantial water demand. With economic development and rising living standards, ensuring a stable water supply is especially crucial. Henan is a major grain-producing province in the country, playing an important role in national grain output. Approximately one-tenth of the country total grain production comes from Henan, which is known as the ‘Granary of the Central Plains.’ In 2023, the total grain output was 132.49 billion jin, ranking second in the nation. In terms of industry, Henan has a comprehensive industrial sector with a complete system, consistently ranking fifth nationally and first in the central and western regions in terms of total manufacturing output (Xiuyu & Ruigiang 2024).",
    "Henan Province serves as the main beneficiary of the South-to-North Water Diversion Middle Route project, featuring a canal length of 731 km. This project traverses eight cities in Henan - Nanyang, Pingdingshan, Xuchang, Zhengzhou, Jiaozuo, Xinxiang, Hebi, and Anyang - along with 34 counties (including cities and districts), encompassing a total of 50 cities within 11 prefecture-level municipalities. By the end of 2018, in accordance with the new administrative divisions, the receiving area of the South-to-North Water Diversion project in our province consisted of 11 prefecture-level cities and two provincially managed counties (Dengzhou and Huaxian), with a designated water supply goal of 50 cities. The current scope of the receiv- ing area for the South-to-North Water Diversion project in Henan Province is illustrated in Figure 1. This research focuses on four key indicators: total water resources, population size, gross regional product, and the area planted with food crops. Total water resources serve as an essential measure of the availability of water within a region, directly indicating the amount of water resources that can be utilized. Population size is a significant factor influencing water demand; as the population increases, so does the corresponding demand for water. A higher gross regional product generally signifies more active economic engagement, leading to greater water consumption, thereby establishing a direct correlation between GDP and water resource usage. Agriculture is a major consumer of water; thus, incorporating the area of land planted with food crops as an indicator is beneficial for evaluating the impact of agricultural water usage on overall water resources. The data needed for this study comprises total water resources, population size, gross regional product, and area planted with food crops for the 11 prefecture-level cities between 2008 and 2022. Consequently, all data referenced in this paper are derived from the ‘Henan Statistical Yearbook’ (2009-2023) and the ‘Henan Provincial Water Resources Bul- letin’ (2009-2023). The Lorenz curve was proposed by the American statistician Max Lorenz to study the distribution of national income. This curve is a graphical method widely used to analyze whether income distribution within a country is equitable (Zhongyu et al. 2024). The degree of curvature of the Lorenz curve visually reflects the level of inequality in income distribution; a smaller curvature indicates a more equal distribution of income, while a larger curvature signifies greater inequality. As illustrated in Figure 2: The curve f(x) in the figure represents the actual income distribution curve, while the diagonal line indicates the line of absolute average income distribution. The straight lines OH and HL denote the lines of absolute unequal income distribution. The horizontal axis represents the cumulative percentage of the population, and the vertical axis represents the cumulative percentage of income. The Gini coefficient, as a derived metric of the Lorenz curve, serves as a critical tool for evaluating the equality of income distribution among residents within a country or region. This coefficient quantifies the extent of wealth disparities among indi- viduals, thus offering a framework for examining the issue of income distribution inequality in the economic field (Yuegui & Guangping 2024). The integration of the Lorenz curve with the Gini coefficient has become a prevalent method for analyzing income distribution inequities. Since the study focus of this paper is on the water supply region in Henan Province affected by the South-to-North Water Diversion Project, which also experiences resource distribution imbalances, this paper will apply the Lorenz curve and Gini coefficient to analyze the spatial equilibrium of water resources in this area. The formula for the Gini coefficient is defined as follows: In the equation, S4 represents the area enclosed by the line of absolute average income distribution and the actual income distribution curve, while Sg denotes the area between the actual income distribution curve and the line of absolute unequal income distribution. G is the Gini coefficient, which ranges from 0 to 1 and can reflect the degree of water resource equili- brium. Table 1 presents the classification criteria for the Gini coefficient. Based on the schematic representation of the Lorenz curve in Figure 2, areas S, = 1/2 — Sg and Sg can be computed as the integral of the Lorenz curve f(x) over the interval [0, 1], denoted as Sg = Se f(x)dx. By substituting S, = 1/2 — Sg and SB= fo f(x)dx into Equation (1), the calculation formula for the Gini coefficient is derived as follows: In the Lorenz curve depicted in this paper, the horizontal axis represents the cumulative percentages of population, regional GDP, and the area sown with food crops, while the vertical axis denotes the cumulative percentage of total water resources. Consequently, the utilization of the Gini coefficient in this study is realized through the following steps: (1) Calculation of Pj; and Wj. The eleven prefecture-level cities in the Henan section of the South-to-North Water Diversion Project are grouped into 11 categories. The percentages of population, regional GDP, and area sown with food crops relative to their corresponding totals are calculated and denoted as Pj, where i represents the matching relationship index (i = 1, 2, 3 indicating population, GDP, and sown area respectively); j represents the sub-region index (j= 1, 2, ..., 11 for the 11 groups). Additionally, the percentage of total water resources for each group relative to the total water volume is calculated and denoted as Wj. Subsequently, the calculated values of Wj and Pj are divided to obtain Wj/Pj, which is then rearranged in ascending order.",
    "(2) Compute the cumulative percentages for each matching relationship group. Following the rearrangement, calculate the cumulative percentages of population, regional GDP, and area planted with food crops, denoted as Xjja. Subsequently, cal- culate the cumulative percentage of total water resources, denoted as Yj. (3) Determine the area Sz of region B in Figure 2. Segment region B into 11 trapezoids according to the 11 groups, compute the area of each trapezoid, and then sum the areas of the 11 trapezoids to derive Sg. The detailed calculation method is out- lined as follows: The correlation coefficient functions as a structural entity that can deeply illustrate the interaction between determinism and uncertainty in the subject under study. It is not only the central mathematical representation in set pair analysis but also effec- tively elucidates the relationship between the internal deterministic and uncertain factors of the subject, thus offering a more holistic perspective for analysis (Changjiang 2017). The correlation coefficient is characterized by systematicity, hierarchical structure, extensibility, and uncertainty. The general expression of the correlation coefficient is: In this equation, wu denotes the correlation coefficient of set pair H; a, b, and c refer to the degrees of similarity, difference, and opposition, respectively. a+b +c =1 and J represent the opposition coefficients, with J = —1 assigned to the positive and negative opposition relationships. J indicates the difference coefficient, based on reference J, and for positive and negative opposition relationships, the value of [—1, 1] is typically adopted. Table 2 outlines the classification standards for the corre- lation coefficient. The application of the correlation coefficient in this study is primarily implemented through several calculation steps: (1) Calculation of the sample value dj. dj is defined as the absolute value of the difference between the vertical coordinates of the sample points on the previously mentioned Lorenz curve and the corresponding points on the absolute mean distribution line at the same horizontal coordinate. dj represents the gap between the actual distribution of water resources and the ideal equilibrium state. The larger the value, the poorer the equilibrium. Thus, the sample value dj can be expressed as: In this formula, X;; denotes the horizontal coordinates of the sample points on the Lorenz curve, specifically the cumulative percentages of population, regional GDP, and sown area of food crops; Yj indicates the vertical coordinates of the sample points on the Lorenz curve, representing the cumulative percentage of total water resources. Here, i is the matching relation- ship index (i= 1, 2, 3, indicating population number, regional GDP, and sown area of food crops, respectively); j is the sub- region index (j= 1, .., 11, corresponding to the 11 provincial cities in the water receiving area of the South-to-North Water Diversion Project). (2) Classification of evaluation index levels. A vertical line segment is established by connecting points on the horizontal axis corresponding to the horizontal coordinates of the sample points on the Lorenz curve with points on the absolute mean distribution line. This vertical segment is then divided into five equal sections, labeled as levels I, I, II, IV, and V (as illus- trated in Figure 3), which are used as the classification criteria for dj. The equity of the study subject progressively diminishes from Level I to Level V. (3) Calculation of the correlation coefficients for each sample value. In this paper, set pair analysis is utilized to compute the quintuple correlation coefficient uj between each matching relationship sample value dj and the grading standard sx, where the matching index i = 1, 2, 3, the sub-region indexj = 1, 2, ..., 11, and the grade k = 1, 2, 3, 4, 5. This can be specifically expressed as: where Ujj1, Ujj2, Uij3, Vij4, Vis Aenotes the normalized components of the quintuple correlation coefficient - probability representing five levels of balance; J), Iz, I; are difference coefficients, taking values between —1 and 1. J, and J are adjustment coefficients (J = —1 represents the opposite state), used to handle uncertainty. In this context, sjjo — sjj5 denotes the grading standard threshold values for the sample values of each matching relationship (corresponding to the values obtained by dividing the lengths of the vertical segments between each point on the absolute average distribution line and the horizontal axis into five equal parts); uj, refers to the correlation coefficient between the sample value dj of matching relationship i in sub-region j and each grade k (k= 1, 2, 3, 4, 5). Consequently, the sample value diz of the matching relationship is affiliated with the fuzzy set ‘water resource spatial balance grade k,’ indicating a relative membership degree (¥};,).",
    "Subsequently, the obtained value v,, is substituted into Equation (7) to derive the correlation coefficient uj. The calculated sample values of the correlation coefficient are then summed and divided by the total number of samples to compute the (4) Calculation of the correlation coefficient value. By substituting the uw, obtained from the above calculation method into Equation (7), a new expression is obtained. Utilizing the special value method, I; = 0.5, I2 = 0, J; = —0.5 and J = —1 are sub- stituted into this new expression to determine the value of the correlation coefficient. The above formula means comparing dj with five preset levels (five equal divisions of the vertical line segment in Figure 3) and calculating the connection component uj for each level using Equations (8)-(12). Then, normalise the score using Equation (13), substitute jz into Equation (7), and obtain the final score uj. (5) Calculation of the subtractive pair potential value of the correlation coefficient. The subtractive pair potential is pro- posed based on the theoretical study of pair analysis. Based on the five-dimensional correlation coefficient uj obtained above, the subtractive pair potential value for each group (i.e., the 11 provincial cities traversed by the South-to-North Water Diversion project in Henan Province) is calculated, denoted as s;(u,). The value range of the subtractive pair potential generally lies within [—1, 1], with the expression given by: Si(Uyj) = (Wij. — Vijs)(1 + Vio + Vis + Via) + 0.5(Oij2 — Via) (Wij2 + Vis + Via) A larger subtractive pair potential value indicates better spatial equilibrium of water resources; conversely, a smaller sub- tractive pair potential value suggests poorer spatial equilibrium of water resources. Therefore, the subtractive pair potential grading evaluation standard can be used to analyze the spatial equilibrium of water resources in each sub-region of the study area. The closer the evaluation level of the subtractive pair potential is to a neutral state, the better the spatial equilibrium matching condition of the water resources in that sub-region. Conversely, the closer the evaluation level approaches an oppos- ing state, the worse the spatial equilibrium matching condition becomes. Table 3 presents the evaluation standards for subtractive pair potential grades. This paper utilizes Kernel density estimation to elucidate the dynamic evolutionary trend of development level distribution in the water-receiving area of the South-to-North Water Diversion project in Henan (Mengyang & Xiaobin 2023). Building on the evaluation of regional disparities using the Gini coefficient, the development levels are dynamically assessed according to temporal evolution trends to describe their distribution characteristics during the observation period. The detailed model is as follows: In the formula: f(x) signifies the kernel density value; K(.) is the equation for the kernel function; M indicates the number of points within the search radius; h refers to the search radius; and x — x; represents the distance from the estimation point to the sample point. Migration of the center of gravity. The center of gravity is a concept from physics that has found extensive application in socioeconomic studies in recent years (Na & Yimin 2023). It has been incorporated into spatial evolution analysis to 6; = \"5\" + arctan [(E — &)/(ma — 1»)] Diy = Cx) (Er — &)° + (ma - Wo)’, In this equation, y; and é; correspond to the longitude and latitude of a specific city, while n* and é indicate the longitude and latitude after the migration of that city. A; refers to the total water resources in each city region; 6j_; represents the angle of the movement of the water resource center of gravity in the region; D;_; is the distance that the center of gravity of total water resources has moved; C signifies the rate of coordinate transformation. Standard deviation ellipses are a spatial statistical method for multidimensional analysis of center of gravity, direction, dis- tance, and shape, which can explore the global characteristics of the distribution of total water resources in geographic space. This study employs the standard deviation ellipse method to analyze the spatial distribution range of total water resources, represented by the area of the ellipse, the dispersion of total water resources in terms of direction, indicated by the lengths of the major and minor axes of the ellipse, and the primary distribution direction across the entire area, represented by the azimuth angle of the ellipse (Figure 4).",
    "(1) Evaluation Results of the Spatial Balance between Total Water Resources and Regional GDP in the Henan Section of the South-to-North Water Diversion Project. Analysis of Figure 5 indicates that the average Gini coefficient for total water resources and regional GDP in the Henan section from 2008 to 2022 is 0.448. According to the classification standards in Table 1, this spatial equilibrium status is categorized as relatively unbalanced. Notably, the years 2010, 2017, 2018, and 2020 were in an unbalanced state, while 2013, 2016, and 2019 were in a critical equilibrium state; the remaining years were classified as relatively unbalanced. Figure 5 highlights that the spatial imbalance between water resources and regional GDP in the Henan section of the South-to-North Water Diversion Project over the past 15 years requires sig- nificant attention. As shown in Figure 6, between 2009 and 2023, the regional GDP has consistently risen. Nevertheless, this growth has not enhanced its alignment with the total water resources, and there have been notable fluctuations in some years. For example, the Gini coefficient in 2019 was 0.388, which stands in stark contrast to the coefficients of 0.512 in 2018 and 0.511 in 2020. Consequently, we can ascertain that the disparity between water resources and regional GDP in the Henan section of the South-to-North Water Diversion Project is quite serious, with a notably poor spatial equilibrium that has not improved over the last 15 years. (2) Evaluation of the spatial equilibrium between total water resources and the area planted with food crops in the Henan section of the South-to-North Water Diversion Project. As shown in Figure 7, the average Gini coefficient for total water resources and food crop area in the Henan section from 2008 to 2022 is 0.232. According to the Gini coefficient classification criteria in Table 1, this indicates a relatively balanced spatial equilibrium state. From 2011 to 2016, the Gini coefficient showed a consistent decline, leading to a transition in spatial equilibrium from a relatively balanced state to a balanced state. Additionally, Figure 7 indicates a notable change in the Gini coefficient in 2017, which differed significantly from that of 2016 by 0.153, moving from a balanced state in 2016 to a critical equilibrium state in 2017. Following this transition in 2017, the years 2018-2022, with the exception of 2019, which exhibited a balanced state, experienced a shift from a balanced state to a relatively balanced state. From the above analysis, it is evident that the Gini coefficient relating to total water resources and food crop area in the Henan section of the South-to-North Water Diversion Project shows a trend of rising, followed by falling, and then rising again. This indicates an overall change in its spatial equilibrium status, transitioning from a relatively balanced state to a balanced state, and ultimately reverting to a relatively balanced state. In conclusion, given the stable and modest growth in the area of food crops planted, the spatial equilibrium between water resources and food crop area in the Henan section of the South-to-North Water Diversion Project is steadily improving. The Lorenz curves for total water resources and arable crop area from even years between 2008 and 2022 are shown in Figure 8. From this figure, it is evident that in the even years from 2008 to 2022, the Lorenz curves for 2014 and 2016 are closer to the line of absolute average distribution, indicating excellent spatial equilibrium between water resources and arable crop area during these two years. Conversely, the Lorenz curve for 2010 shows a significantly high degree of curvature, suggesting poor spatial equilibrium between water resources and arable crop area that year. Overall, among the even years from 2008 to 2022, except for 2010, the curvature of the Lorenz curves in the remaining even years is relatively low, indicating better spatial equilibrium in those years. (3) Analysis of the Spatial Equilibrium of Water Resources Total and Population in the Henan Section of the South-to- North Water Diversion Project. According to Figure 9, the average Gini coefficient for water resources total and population from 2008 to 2022 is 0.297, which corresponds to a relatively balanced state based on the Gini coefficient classification in Table 1. As seen in Figure 22, the Gini coefficient in 2009 rose from 0.288 to 0.444, and similarly, the coefficient for 2016 increased from 0.226 to 0.403, indicating a substantial range of spatial equilibrium, shifting directly from a relatively balanced to a relatively unbalanced state. Furthermore, Figure 9 indicates that the Gini coefficients were relatively high and spatial equilibrium was poor during 2010-2012. However, from 2013 to 2016, there was an improvement in spatial equilibrium with lower Gini coefficients. The Gini coefficients for 2020-2022 are also gradually decreasing. This trend in spatial equili- brium improvement reflects the positive impact of the South-to-North Water Diversion Project, which officially commenced operations in 2014, effectively alleviating severe water shortages in some northern cities, benefiting over 100 million people, and significantly enhancing the spatial equilibrium between water resources total and population in the Henan section.",
    "The analysis indicates that from 2008 to 2022, the spatial equilibrium between the total water resources and population in the Henan section of the South-to-North Water Diversion Project is extremely unstable. In certain years, there is a significant fluctuation in the Gini coefficient, with several years exhibiting coefficients that differ markedly from others, along with evi- dent dynamic changes in overall spatial equilibrium. Nevertheless, aside from the relatively unbalanced states observed in 2010 and 2017, the overall spatial equilibrium level in the Henan section from 2008 to 2022 is relatively balanced. Addition- ally, beginning in 2020, the Gini coefficient has shown a gradual decline, indicating a potential future improvement in the spatial equilibrium between water resources and population. The Lorenz curves for total water resources and population during the even years from 2008 to 2022 are presented in Figure 10. As shown in Figure 10, in the even years from 2008 to 2022, the Lorenz curves for 2008, 2014, and 2016 exhibit low curvature, reflecting favorable spatial equilibrium between water resources and population during these years. In con- trast, the Lorenz curve for 2010 demonstrates high curvature, indicating poor spatial equilibrium between water resources and population in that year. Overall, for the even years from 2008 to 2022, with the exception of 2010, the Lorenz curves for the remaining years display smaller curvature, suggesting better spatial equilibrium between water resources and popu- lation in those years. (1) Spatial Equilibrium Evaluation of Total Water Resources and Regional GDP in the Henan Section of the South-to-North Water Diversion Project. According to Figure 11, the average correlation coefficient between total water resources and regional GDP in the Henan section from 2008 to 2022 is —0.06, indicating an uneven spatial equilibrium state based on the classification standards presented in Table 2. Moreover, Figure 11 reveals that from 2008 to 2022, the spatial equilibrium state is classified as either uneven or comparatively uneven, with the years 2009-2012 consistently being uneven, while 2013- 2016 are comparatively uneven. A higher correlation coefficient reflects greater spatial equilibrium, with the year 2013 show- ing the highest correlation coefficient, although the corresponding spatial equilibrium level is only comparatively uneven. Additionally, during the fifteen years from 2008 to 2022, the comparatively uneven state was observed eight times, consistent with the frequency of the uneven state, which emphasizes the severity of the imbalance between water resources and regional GDP. A comparison with the earlier Gini coefficient evaluation results for total water resources and regional GDP reveals a few instances where both methods yield different spatial equilibrium states; however, the overall results are aligned, underscoring the critical need for attention to the poor spatial equilibrium between water resources and regional GDP. Accordingly, we can analyze the factors contributing to the poor spatial equilibrium between water resources and regional GDP in the Henan section of the South-to-North Water Diversion Project. For example, the total water resources over the past fifteen years have been limited, with some years showing a reduction rather than an increase in water resources; addition- ally, the growth of regional GDP has been sluggish. The above method provides an overall evaluation of the correlation coefficient concerning the total water resources in the Henan section of the South-to-North Water Diversion Project. Below, we will analyze each sub-region of the water diversion area using the correlation coefficient and the method of subtractive set potentials, as detailed below: The years 2012 and 2022 were selected for detailed analysis. According to Figure 12, in 2012, out of the 11 provincial-level cities in the Henan section of the South-to-North Water Diversion Project, seven cities were classified as unbalanced, with only Nanyang maintaining a balanced state. By 2022, six cities remained unbalanced, while Nanyang and Anyang were balanced. A comparison of the two tables indicates that Zhengzhou consistently remained in an unbalanced state during both years, whereas Nanyang was in a balanced state. This disparity may stem from Zhengzhou’s higher regional GDP along- side a lower total water resource availability, whereas Nanyang enjoys relatively abundant water resources. Analysis of Figure 12 indicates that Zhengzhou and Xuchang were in an unbalanced state in both 2012 and 2022, with their respective cooperative potential levels categorized as adverse. Zhoukou maintained a relatively balanced spatial equilibrium status. In contrast, the spatial equilibrium between water resources and GDP in Anyang and Jiaozuo improved; Anyang tran- sitioned from an unbalanced state in 2012 to a balanced state in 2022, while Jiaozuo’s correlation coefficient shifted from negative to positive during 2012-2022, moving from an unbalanced state to a critical equilibrium state. Overall, the evaluation results of the subtractive cooperative potential in 2022 were closer to the correlation coefficient evaluation than those in 2012. Although there were some discrepancies between the 2012 subtractive cooperative potential and correlation coefficient evaluation results, the overall impact was minimal, suggesting that the standards for evaluating subtractive cooperative poten- tial are more stringent than those for the correlation coefficient.",
    "Based on the correlation values for each sub-region, spatial equilibrium distribution maps of total water resources and GDP for even years from 2008 to 2022 are presented in Figure 13. The deeper the color of a sub-region in the figure, the better its spatial balance. Based on Figure 13, in the even years from 2008 to 2022, there were more sub-regions with darker colors in 2014 and 2016, which suggests that the spatial equilibrium between water resources and GDP was better during these years. Conversely, we can intuitively observe that in 2010, there were more sub-regions with lighter colors, indicating poorer spatial equilibrium between water resources and GDP in the South-to-North Water Diversion Area of Henan province. (2) Spatial equilibrium evaluation of the total water resources and grain crop planting area in the Henan section of the South-to-North Water Diversion Project. As shown in Figure 14, the average contact number for the period 2008-2022 between wat the spatial eq er resources and grain crop planting area is 0.394. According to the contact number classification in Table 2, juilibrium state is classified as relatively balanced, which is consistent with the results derived from the Gini coef- ficient, indicating that the spatial equilibrium between water resources and grain crop planting area was generally good from 2008 to 2022. However, there is a slight discrepancy between the contact number evaluation and the Gini coefficient evalu- ation in certain years, although the overall trends align. Analysis 0: equilibrium, Figure 14 shows that from 2018 to 2022, the spatial equilibrium status shifted from relatively balanced to critical with a trend toward returning to a more balanced state. This may be due to the impact of the COVID-19 pan- demic in 2020, and by 2022, as the socio-economic situation stabilized and China made persistent efforts in fighting the pandemic, the spatial equilibrium moved in a positive direction. Based on Figure 14, it is evident that the year with the highest contact num! relatively ba ber was 2013, and the spatial equilibrium state in that year was balanced, while most other years remained in a anced state. Analysis of Figure 15 shows that in 2012, four provincial-level cities were in a critical equilibrium and relatively balanced state; in 2022, there were no cities in an unbalanced state. Three cities were in a relatively unbalanced and a relatively balanced state, while four cities were in a balanced state. This represents an increase in the number of cities in a balanced state compared to 2012. Overall, the spatial equilibrium of the cities has improved. For individual sub-regions, Nanyang remained in a balanced spatial equilibrium state between water resources and grain crop planting area in both 2012 and 2022. Xuchang remained in a relatively unbalanced state. The spatial equilibrium states of Puyang, Zhengzhou, Jiaozuo, Hebi, and Anyang improved between 2012 and 2022. Puyang transitioned from an unbalanced state to a relatively unba- lanced state; Zhengzhou and Jiaozuo transitioned from a relatively balanced state to a balanced state; Hebi transitioned from a critical equilibrium state to a relatively balanced state; Anyang transitioned from a critical equilibrium state to a balanced state, significantly improving its spatial equilibrium. Analysis of the subtraction-based contact potential values in Figure 15 indicates that in 2012, most cities were in a state of partial potential similarity, whereas in 2022, more cities were in a state of complete potential similarity. The closer the contact potential level is to complete similarity, the closer the spatial equilibrium tends toward balance. Thus, it can be con- cluded that the spatial equilibrium of the Henan section of the South-to-North Water Diversion Project in 2022 was higher than in 2012. The spatial equilibrium distribution of water resources and grain crop planting area for each sub-region in even years from 2008 to 2022 is shown in Figure 16. According to Figure 16, it can be seen that in even years from 2008 to 2022, the number of sub-regions with a lighter color intensity is higher in 2010. This indicates that in 2010, more sub-regions were approaching an unbalanced spatial equilibrium state, which also reflects that the spatial equilibrium of the entire study area in 2010 was poorer compared to other years. (2) Spatial Equilibrium Evaluation of Total Water Resources and Population in the Henan Section of the South-to-North Water Diversion Project. According to Figure 17, the long-term average contact coefficient between water resources and population from 2008 to 2022 is 0.214. Based on the classification standards from Table 2, this corresponds to a critical equi- librium state. A comparison with the corresponding Gini coefficient results reveals that the contact coefficient standard is stricter. However, both evaluation methods show a consistent trend: moving from equilibrium to imbalance, then from imbal- ance back towards equilibrium, and ultimately tending toward equilibrium. This clearly indicates that the spatial equilibrium between water resources and population is unstable, fluctuating near the critical equilibrium state. An analysis of Figure 17 also shows that the year with the smallest contact coefficient value is 2010, indicating that in 2010, the spatial equilibrium between water resources and population in the Henan section of the South-to-North Water Diversion Project was the poorest between 2008 and 2022.",
    "Analyzing Figure 18, in 2012, there were three municipal districts in an imbalanced state and three in a relatively imbal- anced state, with 2 districts each in a critical equilibrium and equilibrium state. In 2022, there were three municipal districts each in an imbalanced, relatively balanced, and balanced state. Overall, the balance state of cities from 2012 to 2022 remained stable, with no significant changes. Analyzing individual cities, it is evident that Zhengzhou and Xuchang remained in an imbalanced state in both years, while Nanyang consistently maintained a balanced state. Several cities saw improvements in their spatial equilibrium state, such as Anyang and Pingdingshan, which transitioned from a relatively imbalanced state in 2012 to a balanced state in 2022. Hebi shifted from a relatively imbalanced state to a relatively balanced state, and Jiaozuo moved from a critical equilibrium state to a balanced state. However, some cities experienced worsening spatial imbalance, such as Luohe, which was in a relatively imbalanced state in 2012 but shifted to an imbalanced state in 2022. Analyzing the subtractive set potential values in Figure 18, it can be seen that Zhengzhou had the smallest subtractive set potential values in both years, suggesting that the spatial equilibrium between water resources and population in Zhengzhou is relatively poor. This reflects the low per capita water resources in Zhengzhou, which calls for significant attention. By com- paring the two tables below, it can be concluded that in 2022, the subtractive set potential evaluation results were closer to the contact coefficient evaluation results than in 2012. In 2012, the majority of cities had a balanced potential level, whereas in 2022, most cities were at a similar potential level. This suggests that the spatial equilibrium between water resources and population in the South-to-North Water Diversion receiving areas of Henan in 2022 was better than that in 2012. The spatial equilibrium distribution of water resources and population across sub-regions in the even years from 2008 to 2022 is illustrated in Figure 19. According to Figure 19, it is apparent that in the even years between 2008 and 2022, 2010 had a notably higher number of sub-regions with lighter color intensity. As a result, the spatial equilibrium between water resources and population in the entire study area in 2010 was relatively poorer compared to other years. The use of contact number in the analysis of water resource spatial equilibrium is limited, as there are no well-defined criteria for its evaluation. In contrast, the Gini coefficient is extensively applied in water resource spatial equilibrium studies and has well-established evaluation standards. The trends of the Gini coefficient and contact number for each matching relationship are shown in Figures 20-22. Accord- ing to the evaluation criteria for the Gini coefficient and contact number, a larger Gini coefficient indicates a lower spatial equilibrium, while a larger contact number indicates a higher spatial equilibrium. Therefore, as shown in Figures 20-22, although the trends in the values of the two are opposite, this indicates that the overall spatial equilibrium trend reflected is consistent. This study uses the kernel density estimation model to illustrate the distribution dynamics of the total water resources Henan’s South-to-North Water Diversion area. As shown in Figure 23, first, regarding the location of the distribution, the center of the South-to-North Water Diversion area’s water resources in Henan has clearly shifted to the right, indicating continual increase in the total water resources across regions, with a fast rate of change. Second, in terms of peak character- istics, the peak value of total water resources in the Henan section of the South-to-North Water Diversion area has shown an upward trend during the sample period, with the peak shape narrowing from a broad peak to a sharp peak, suggesting that the disparity in water resources among regions is diminishing. Third, considering the number of peaks, the kernel density curve for Henan’s South-to-North Water Diversion area demonstrates a consistent pattern, showing a unimodal distribution, which indicates a reduction in the polarization phenomenon of water resources in the area, with a certain degree of mitigation in the overall water resource polarization across Henan. In conclusion, the total water resources in Henan’s South-to-North Water Diversion area are continuously increasing, with rapid development in various regions and a decreas- ing gap between cities.",
    "This study employs the centroid and standard deviation ellipse model to reveal the directional trend of water resource distri- bution in the South-to-North Water Diversion Area of Henan Province. As shown in Figure 24, first, changes in the centroid migration. The centroid of the South-to-North Water Diversion Area is located within Xuchang City, with a longitude range of 113.08°E to 113.61°E and latitude range of 33.72°N to 34.24°N. The centroid moved a distance of 43.2 km at a rate of 2.8 km/ year, generally shifting from the northeast to the southwest, indicating a faster increase in the water resource level in the southwest region. From 2008 to 2013, the centroid changed slowly, shifting from east to west; from 2013 to 2016, the centroid shifted significantly southward; and from 2017 to 2022, the centroid showed a general northward fluctuating trend. Second, changes in the distribution range of the standard deviation ellipse. From 2008 to 2022, the area of the standard deviation ellipse for total water resources increased. The short semi-axis of the ellipse grew continuously, indicating an increase in the dispersion of water resources. Meanwhile, the long semi-axis decreased, implying that the directional characteristics of the water resources became less clear. Third, changes in the directional distribution of water resources. During the study period, the azimuth angle of the standard deviation ellipse gradually increased. The growth rate of water resources in the northwest region was higher than that in the southeast, with an expansion trend in the northwest and a contraction trend in the southeast. From the shape index of the standard deviation ellipse, the flattening trend weakened between 2008 and 2022, indicating that the directionality of the total water resources became less apparent. As an important water receiving area of the South-to-North Water Diversion Project, Henan Province’s water resource bal- ance analysis is of significant importance for ensuring regional water security. This study focuses on the Henan section of the South-to-North Water Diversion area, employing a combination of Lorenz curves, Gini coefficient method, multi-dimen- sional correlation method, kernel density estimation, centroid, and standard deviation ellipse models. It examines the three pairs of matching relationships - water resource total-population size, water resource total-crop planting area, and water resource total-regional GDP - to reflect the spatial balance of water resources in the study area. This multi-dimensional assessment framework helps to more clearly understand the current spatial imbalance of water resources. In this study, we conduct an in-depth analysis of the spatial balance of water resources in Henan’s South-to-North Water Diversion area. First, the results of the Gini coefficient and correlation coefficient algorithms illustrate the complex interactions between water resources, economy, population, and food production. Notably, during the 2008-2022 period, the spatial imbalance between water resources and regional GDP was pronounced. This indicates that, in the context of rapid economic growth, the distribution of water resources has not kept up with the pace of economic development. This could lead to problems such as excessive exploitation of water resources and increased environmental pressure. The good alignment between total water resources and the area of food crop planting suggests that the government has implemented a series of effective measures to ensure food security, such as the improvement of irrigation techniques and the rational allocation of water resources. This shows that, in the agricultural sector, water resource management has been relatively successful in meeting the needs of food production, thereby safeguarding basic food security. Second, the differences in spatial equilibrium across different matching relationships of sub-regions are noteworthy. Taking Zhengzhou as an example, the matching relationships between total water resources, regional GDP, and population show an imbalance, reflecting the water resource pressure brought by urbanization. This imbalance may lead to the discoordination of socio-economic development, which in turn affects the sustainable development of the city. Therefore, it is recommended that the government take into account the actual needs and development potential of each region when conducting urban plan- ning and water resource management, in order to promote coordinated development across regions. The analysis of kernel density estimation and centroid and standard deviation ellipses reveals that the total water resources in the South-to-North Water Diversion project’s service area in Henan Province have steadily increased, with rapid develop- ment across various regions and a gradual narrowing of the disparities between cities. This trend suggests that the South-to-North Water Diversion project has, to a certain extent, facilitated economic and social development in the regions and fostered greater awareness of inter-regional water resource sharing. However, the shifts in the water resource centroid are becoming less significant, highlighting the need for greater focus on long-term sustainability in water resource management The Gini coefficient method is primarily used to assess the inequality of a specific variable (e.g., income or resource allo- cation), while the multivariate correlation method allows for the analysis of imbalanced relationships between multiple variables. Using both approaches enables a more comprehensive evaluation of imbalances, extending beyond single indi- cators to explore the interrelationships between different variables. The Gini coefficient is generally applied to continuous data, measuring the balance of a single variable’s distribution, while the multivariate correlation method excels in handling multidimensional data and evaluating complex variable relationships. Thus, the combination of these methods offers increased flexibility and comprehensiveness when dealing with varied data structures. In terms of spatial distribution, stan- dard deviation ellipses and kernel density estimation are essential for providing a thorough analysis of data characteristics across multiple dimensions. Standard deviation ellipses emphasize the directional distribution and dispersion of the data, while kernel density estimation highlights spatially dense and sparse regions. The integration of these two methods offers a more profound understanding of the spatial distribution at both macro and micro levels. Consequently, these two methods were selected for the spatial equilibrium analysis.",
    "This study reveals the deep connection between the spatial balance dynamics of water resources in the water-receiving areas of the South-to-North Water Diversion Project in Henan Province and policy interventions and climate change. The core driving mechanisms behind changes in spatial balance are as follows: The direct regulatory effects of major engineering projects: The commissioning of the Central Route of the South-to-North Water Diversion Project in 2014 significantly improved the water resources-population matching relationship, reducing the Gini coefficient from 0.388 in 2013 to 0.226 in 2016, thereby validating the effectiveness of the ‘priority for domestic water use’ principle outlined in the Henan Province Water Resources Allocation Regulations; Following the commencement of water supply from the South-to-North Water Diversion Project, the nuclear density curve shifted to the right and its peak rose sharply, visually reflecting the narrowing of regional disparities and highlighting the project’s supportive role in achieving clean drinking water and sanitation facility targets. In 2020, the water resources-economic Gini coefficient surged to 0.511, driven by dual disturbances: the COVID-19 pandemic caused a sharp decline in industrial water demand; and drought during the flood season led to a reduction in total water resources in areas like Pingdingshan and Nanyang, exacerbating the mismatch between economically dense regions and agricultural belts, exposing the vulnerability of current policies to climate shocks. The 2017 heatwave triggered a surge in irrigation water use, causing the water resources-grain planting Gini coefficient to jump to 0.153, with the centre of gravity shifting northward, confirming the urgent need for drought-affected areas to respond with emergency water allo- cation measures. Policy implications suggest combining climate models with the ‘single-peak convergence trend’ from kernel density estimation to develop a ‘Drought Risk Zoning Contingency Plan.’ This study conducts a short-term analysis of the spatial equilibrium of water resources from 2008 to 2022 using 15 years of time-series data. However, to address the issue of unequal water resource distribution in the Henan section of the South-to- North Water Diversion Project, it is essential to analyze the long-term trends. The correlation coefficient method is mostly used in safety risk assessment and is still in the early stages of application in water resource spatial equilibrium analysis. Therefore, further research and improvement of the correlation coefficient method in water resource spatial equilibrium analysis are necessary. The South-to-North Water Diversion Project continues to have a positive impact, benefiting over a hundred million people, and the spatial equilibrium of water resources in the Henan section will inevitably continue to improve. The study investigates the 11 provincial cities in the Henan section of the South-to-North Water Diversion Project, utilizing five research methods: the Gini coefficient, correlation coefficient, subtractive set potential, kernel density estimation, and centroid and standard deviation ellipses. A spatial equilibrium evaluation model is constructed, and data from 2008 to 2022 on population, grain crop planting area, GDP, and total water resources for these 11 cities are collected and analyzed. The spatial equilibrium of the three matching relationships - total water resources versus GDP, total water resources versus grain crop planting area, and total water resources versus population - was computed. The specific conclusions are as follows: 2022 is poor, and this imbalance reflects the connection between water resources and socio-economic development. This issue needs to be given high attention, and targeted measures should be taken if necessary. The spatial equilibrium between total water resources and population from 2008 to 2022 is generally at a critical equilibrium state, indicating that the relationship between water resources and population is unstable. Water resources should benefit the people, and the people should cherish and protect these resources. The spatial equilibrium between water resources and population reflects the relationship between humans and water, and even between humans and nature. Therefore, dynamic monitoring of the spatial equilibrium between water resources and population should be carried out to ensure harmonious coexistence. The spatial equilibrium between total water resources and the area of grain crops sown from 2008 to 2022 is good and should be maintained. Based on the above conclusions, the following recommendations are proposed according to different regions. To address the severe imbalance between water resources and the economy, differentiated industrial regulation should be implemented. In industrial-intensive areas such as Zhengzhou, Xuchang, and Jiaozuo, the use of recycled water and a tiered resource tax for water-intensive industries should be promoted, and monitoring should be carried out using the ‘water resource economic elas- ticity coefficient.’ In agro-industrial composite zones such as Puyang and Zhoukou, the scale of high-water-consuming agriculture should be restricted, and the development of water-saving processing industries should be promoted. To address the critical imbalance between water resources and population, a dynamic stabilisation mechanism must be established: in population-dense areas such as Zhengzhou and Anyang, a dual water source{K}ii and smart water supply network should be constructed; in water quality risk areas such as Puyang and Pingdingshan, heavy metal control and advanced water treat- ment should be strengthened; simultaneously, a real-time early warning system for ‘per capita water resources-population mobility’ should be developed to automatically trigger water diversion responses in case of abnormal growth. Given the favourable equilibrium between water resources and grain production, prioritise the promotion of smart irrigation systems integrating water and fertiliser in grain-producing regions like Nanyang and Zhoukou, develop slope rainwater harvesting agriculture in Hebi and Jiaozuo, and strictly enforce the requirement that urbanisation-driven land conversion in areas like Zhengzhou and Xuchang must be accompanied by the simultaneous construction of efficient water-saving facilities. Pre- cise interventions should be implemented in key cities: Zhengzhou must address dual imbalances through a ‘virtual water strategy’ and expanded use of recycled water; Nanyang can establish a national water conservation demonstration zone and explore inter-city water rights trading; Puyang must coordinate the Yellow River diversion via the Jin Di River with recycled water substitution; and Anyang and Hebi should prioritise curbing excessive groundwater extraction. At the institutional level, a smart water dispatch hub should be established based on Xuchang’s water resource spatial core location, and a water ecological compensation mechanism should be implemented. Through smart upgrades, the effectiveness of exist- ing water diversion projects should be consolidated.",
    "This study has its limitations. The research period did not cover the long-term effects of the South-to-North Water Diversion Project, and the selected time frame could only provide a short-term analysis of the spatial balance of water resources in the water-receiving areas of Henan Province. However, issues such as the uneven distribution of water resources in the Henan section of the water-receiving areas require analysis based on their long-term trends. The spatial scale is limited to 11 water- receiving cities, excluding non-water-receiving areas, which weakens the analytical power of the water diversion project’s marginal effects. In the methodology, the Gini coefficient cannot capture the instantaneous impact of extreme events (such as the 2020 pandemic), necessitating the integration of a system dynamics model for enhancement. The difference coef- ficient in the connectivity method may amplify the uncertainty in sub-regional evaluations. Additionally, the water-receiving area of the Central Route Project in Henan Province will expand in the future, meaning the number of water-receiving cities will increase. Therefore, future research should dynamically monitor the spatial equity of water resources in the water-receiv- ing areas of the South-to-North Water Diversion Project, extend the research period, integrate multi-source data and new models, and establish a long-term mechanism based on the analysis results to improve the spatial equity of water resources."
]