[
    "1,2Faculty of Sports Science and Technology, Bangkokthonburi University, Thailand 1E-mail: 475664942@qq.com, ORCID ID: https://orcid.org/0009-0005-0612-4762 2E-mail: Dr.perm.ntsu@gmail.com, ORCID ID: https://orcid.org/0009-0004-6125-0692 Received 21/08/2024 Revised 09/09/2024 Accepted 09/10/2024 Background and Aim: After winning three gold medals at the Seventh National Games, Henan Province's canoeing project has been at a low point in previous National Games. Although the results and strength have improved in recent years, compared with the domestic advantage projects, the inter-provincial gap in canoeing projects is still large. It is urgent to identify the problems, update the concepts, seek breakthroughs, and achieve the sustainable development of Henan Province's canoeing projects. Based on the investigation of the current status of canoeing training in my country, this paper aims to formulate a guide for the development of canoeing sports in Pingdingshan City, Henan Province, and combines the specific actual training situation of canoeing projects in Pingdingshan City, Henan Province. The purpose is to investigate and study the current status of canoeing training in the city, aiming to sort out the shortcomings and deficiencies of canoeing training in Pingdingshan City, Henan Province in the emerging stage, and strive to explore solutions and development guidelines, to achieve corresponding results, and provide theoretical references for the comprehensive, rapid and healthy development of canoeing projects in Pingdingshan City, Henan Province. Materials and Methods: This study took the Pingdingshan City Canoeing Team in Henan Province as the research object, with a total of 200 people as the sample group, including 15 canoeing team leaders, 25 canoeing coaches, and 160 canoeing athletes. Three experts were selected through purposive sampling to check the interview form and questionnaire quality (IOC), including 1 national canoeing coach and 2 senior canoeing coaches. Seven experts were selected through purposive sampling, including 4 Pingdingshan City Team Water Sports Team Coaches and 3 Henan Provincial Team Water Sports Team Coaches, and they were invited to conduct expert interviews to collect relevant suggestions. Nine experts were invited as focus groups through purposive sampling, including 3 Henan Provincial Water Sports Team Coaches, 4 Pingdingshan City Water Sports Team Coaches, and 2 Zhoukou City Water Sports Team Coaches, and improvement suggestions were put forward through focus groups. Results: The analysis points out current problems in infrastructure, funding, training programs, and recruitment. Infrastructure needs to be improved, and funding mainly depends on external sponsorship. It is recommended to increase in-kind assistance to make up for the lack of equipment. Training programs lack consistency and standardization, and modern scientific methods need to be adopted, and coaches need to be professionalized. In addition, challenges in resources and staff retention need to be addressed through raising public awareness. Suggested development methods include upgrading facilities, diversifying funding sources, standardizing training programs, enhancing public awareness, and calling on the government to formulate supportive policies. Conclusion: This study aims to develop guidelines to promote the development of canoeing in Pingdingshan City, Henan Province, and comprehensively analyze infrastructure, funding, training programs, various recruitment methods, and policy support. Research tools such as structured questionnaires and expert interviews were used to collect quantitative and qualitative data. Keywords: Canoeing; Developing Guidelines; Promoting the Development of Canoeing Pingdingshan City, in Henan Province, China, is a natural resource-rich region with historical significance. It is well-known for its mountainous terrain and numerous water bodies, including vast expanses Wang, H., & Buppawong, P. (2025). Development Guidelines to Promote Canoeing in Pingdingshan City, Henan Province, People’s Republic of China. International Journal of Sociologies and Anthropologies Science Reviews, 5 (3), 29-38; DOI: https://doi.org/10.60027/ijsasr.2025.5504 of rivers and lakes, making it an ideal location for water sports such as canoeing. The region's history of water management and utilization for agriculture and transportation, which dates back to ancient times, has laid a solid foundation for its current involvement in recreational water sports. Pingdingshan has made significant strides in recent years to promote outdoor activities, particularly canoeing, as part of its efforts to boost tourism and foster a connection between its residents and the environment (Liu et al., 2022). The promotion of canoeing in Pingdingshan is part of a larger economic strategy to attract tourists and diversify the city's revenue sources. Henan Province, which is best known for its historical and cultural tourism due to its ancient sites, has recognized the potential of eco-tourism as a growing market. Canoeing, along with other water-based activities, is a popular attraction for both domestic and international tourists. This shift not only boosts local economic growth but also creates job opportunities in industries like hospitality, tourism management, and outdoor adventure services. Furthermore, it is consistent with China's national goals of promoting green tourism and sustainable development (Wu and Zhang, 2021).",
    "Canoeing, as an eco-friendly activity, encourages environmental awareness and sustainable use of natural resources in Pingdingshan. The city has taken steps to protect its water bodies and surrounding ecosystems by regulating and promoting responsible tourism. Canoeing encourages participants to interact directly with the environment, developing an appreciation for the conservation of water resources. Furthermore, the promotion of such activities is consistent with the larger global and national trend toward sustainability and environmental protection, allowing Pingdingshan to contribute to ecological balance while reducing the negative environmental impacts of mass tourism (Chen & Li, 2020). The development of canoeing in Pingdingshan has important socio-cultural implications. Because it emphasizes teamwork, physical fitness, and outdoor engagement, it promotes community participation and a healthy lifestyle among locals. Canoeing events frequently bring together diverse groups, promoting cultural exchange and social cohesion in the region. Furthermore, the popularity of canoeing as a recreational activity has helped to reconnect younger generations with the region's natural landscape and traditional relationship with its water resources. It serves as a link between contemporary recreational activities and the historical significance of water in Chinese culture (Zhao & Huang, 2023). After Henan Province won three gold medals at the 7th National Games, the canoeing project has improved, but it still faces huge challenges, and there is a clear gap with the domestic advantage projects. The root of the problem lies in the imperfect training system, insufficient improvement of coaching ability, and lack of scientific methods for the selection and training of outstanding athletes. The existence of these problems not only hinders the development of the canoeing project in Henan Province but also limits the competitiveness of Pingdingshan City nationwide. The reason for conducting this study is to solve these fundamental problems and improve the overall level of the canoeing project in Pingdingshan City, to narrow the gap with other advantageous provinces in future national competitions. This study is crucial to the sports development of Pingdingshan City and even the entire Henan Province, because the success of the canoeing project can increase the city's visibility, drive local economic development, and provide more sports development opportunities for young people. To solve these problems, this study adopted scientific research methods, including questionnaires, expert interviews, and mathematical statistics, and conducted an in-depth analysis of the current status of canoeing training in Pingdingshan City. By combing through the current training system, the study found deficiencies in the early stage of training, especially in the professional level of coaches, the scientific nature of training plans, and the selection and training of athletes. Based on these findings, this study proposes specific suggestions for improvement. The ultimate goal of the study is to provide theoretical support and practical reference for the development of Pingdingshan canoeing by improving the professional ability of coaches, scientifically selecting and training athletes, and providing high- quality education and training methods to improve training results and athletes' competitiveness. In particular, by strengthening coach training, optimizing training facilities, and formulating long-term development plans, we strive to achieve comprehensive, rapid, and healthy development of canoeing. This study not only has a direct driving effect on the development of Pingdingshan canoeing but also provides valuable experience and guidance to sports management departments in Henan Province and even the Wang, H., & Buppawong, P. (2025). Development Guidelines to Promote Canoeing in Pingdingshan City, Henan Province, People’s Republic of China. International Journal of Sociologies and Anthropologies Science Reviews, 5 (3), 29-38; DOI: https://doi.org/10.60027/ijsasr.2025.5504 whole country. Through the strategies and suggestions proposed in this study, sports authorities, training bases, and educational institutions can better coordinate and cooperate to promote the sustainable development of canoeing projects, thereby achieving a higher level of sports competitive achievements. Canoeing originated from the hunting tools of the Inuit and Aleut peoples. After being promoted in Europe in the 19th century, it gradually developed into an organized competitive sport. In the early 20th century, canoeing was widely developed in Europe and other parts of the world, and became an official Olympic event in 1936. As time went on, countries such as the Soviet Union and Hungary gradually became strong countries in canoeing, and canoeing also became a popular competitive and leisure sport worldwide. Canoeing was introduced to China in the early 20th century. With the founding of New China and the support of national policies, the project gradually became standardized and achieved certain results in international competitions. However, although Henan Province has made some progress in canoeing in recent years, especially winning three gold medals in the Seventh National Games, Pingdingshan City's canoeing project still has a large gap compared with other domestic advantageous projects, facing problems such as imperfect training system, insufficient improvement of coaching ability, and unscientific selection and training of athletes.",
    "This study aims to investigate the current status of canoeing training in my country, combined with the actual situation of Pingdingshan City, explore solutions to problems in the training system, and formulate scientific guidelines for the development of the city's canoeing project. The core issue of the study is how to improve the existing training methods, optimize infrastructure construction, strengthen the professional training of coaches, and improve the management and allocation efficiency of resources. The results of the study will provide a theoretical basis for Pingdingshan City to narrow the gap with other provinces in future national competitions and promote the sustainable development of local canoeing. To achieve the research objectives, this study used scientific methods such as questionnaire surveys, expert interviews, and mathematical statistics to comprehensively analyze the current status of canoeing training in Pingdingshan City. The study found that the current training system has deficiencies in many aspects, including the scientific nature of the training cycle, the modernization level of infrastructure, and the professional ability of coaches. Based on the research results, this study puts forward specific improvement suggestions, which will be directly applied to the development of Pingdingshan City's canoeing project, aiming to improve the competitiveness of athletes by improving the professional ability of coaches, optimizing resource allocation, and strengthening infrastructure construction. These improvement measures will not only help to enhance Pingdingshan City's position in the national canoeing project, but also provide valuable experience and reference for the development of sports in Henan Province and even the whole country. This study has important theoretical and practical significance for the development of Pingdingshan City's canoeing project. Through research and analysis of training methods, facility construction, funding models, resource management, and policy implementation, this study has developed a set of comprehensive guidelines for Pingdingshan City to improve athlete performance and project competitiveness and promote the sustainable development of canoeing. These guidelines will not only have a direct guiding role for Pingdingshan City, but will also provide useful reference for other similar regions. Wang, H., & Buppawong, P. (2025). Development Guidelines to Promote Canoeing in Pingdingshan City, Henan Province, People’s Republic of China. International Journal of Sociologies and Anthropologies Science Reviews, 5 (3), 29-38; DOI: https://doi.org/10.60027/ijsasr.2025.5504 This study adopted a mixed research method, including a questionnaire survey, expert interviews, and literature analysis, to obtain a multifaceted perspective on the development of canoeing. The goal of the study is to deeply explore the training status of the canoeing team in Pingdingshan City, Henan Province, through these methods, and put forward practical suggestions and guidelines for improvement. From the perspective of the research cycle, the entire data collection process will last for 2 months from the end of April to June. The research subjects of this study are related personnel of the canoeing team in Pingdingshan City, Henan Province. The sample group includes canoeing leaders, coaches, and athletes, totaling 200 people. Among them, there are 15 canoeing leaders, 25 canoeing coaches, and 160 canoeing athletes. The selection of the sample group is based on their key roles in the canoeing project to ensure the comprehensiveness and representativeness of the data. 1) An online or paper questionnaire was made and sent to 200 people of the canoeing team of Pingdingshan City, Henan Province, including 15 canoeing leaders, 25 canoeing coaches, and 160 canoeers, respectively. Combined with the final response rate of the questionnaire, the questionnaire investigated the status and existing problems in Pingdingshan City, Henan Province. 1) Invite 7 experts to interview to understand their opinions and suggestions on the development of the canoeing guide in Pingdingshan City. Wang, H., & Buppawong, P. (2025). Development Guidelines to Promote Canoeing in Pingdingshan City, Henan Province, People’s Republic of China. International Journal of Sociologies and Anthropologies Science Reviews, 5 (3), 29-38; DOI: https://doi.org/10.60027/ijsasr.2025.5504 2) Through the analysis of this literature, understand the current formulation and implementation of policies, find out the existing problems, and room for improvement. 2. The data used were processed using Excel software, and mathematical statistics and descriptive analysis of the collected questionnaires according to different elements and factors. The obtained results provide an objective basis and data reference for the study in this paper. Investigate the current status and problems of canoeing development in Pingdingshan City, Henan Province Questionnaire survey of participants After sending the questionnaire to 200 people in the canoeing team of Pingdingshan City, Henan Province, including 15 canoeing leaders, 25 canoeing team coaches, and 160 canoeing team athletes, the questionnaire was collected and the final collection rate was determined for analysis.",
    "Designing questionnaires is a key step in obtaining accurate and relevant data from the study. Therefore, the opinions collected from the literature review and expert consultation, as well as the book of Sports Management in China: Theory and Practice, edited by Professor Li Changchun (2016), are an important reference and guidance basis, which constitute the comprehensive and targeted basis of the questionnaire. To maximize the collection of reliable and relevant quantitative and qualitative data, the questionnaire was refined by inviting focus groups, and 3 experts were invited to conduct IOC testing on the questionnaire to ensure the validity of the questionnaire. The questionnaire was administered to obtain data on the current status of canoeing in Pingdingshan City, including infrastructure support and financial support, as well as training programs and recruitment and retention of athletes. The areas covered included demographics, infrastructure and facilities, funding and resources, training programs, recruitment and retention, and policy support; these covered several question formats to constitute a comprehensive data collection. Wang, H., & Buppawong, P. (2025). Development Guidelines to Promote Canoeing in Pingdingshan City, Henan Province, People’s Republic of China. International Journal of Sociologies and Anthropologies Science Reviews, 5 (3), 29-38; DOI: https://doi.org/10.60027/ijsasr.2025.5504 Wang, H., & Buppawong, P. (2025). Development Guidelines to Promote Canoeing in Pingdingshan City, Henan Province, People’s Republic of China. International Journal of Sociologies and Anthropologies Science Reviews, 5 (3), 29-38; DOI: https://doi.org/10.60027/ijsasr.2025.5504 The overall response rate was high, with questionnaires sent to 15 canoeing leaders, 25 canoeing coaches, and 160 canoeing athletes. Paper questionnaires were also distributed during training and competition to improve coverage. Online survey sites and email mainly publish questionnaires to facilitate access and speed up response rates. Of the 200 questionnaires distributed, a total of 15 did not receive responses, with an overall response rate of 92.5%; of 15 questionnaires distributed to leaders, 14 received responses and 1 received a response rate of 93.3%; 23 received no responses with a response rate of 92%; of 160 questionnaires distributed to athletes, 148 received responses and 12 received no responses, with a response rate of 92.5%. The high response rates suggest full commitment from the participants, proving that the data collected is very rich and representative of the canoeing community of Pingdingshan City. After determining the final response rate of the questionnaire, the data collected from the questionnaire were analyzed, and the guidelines for the development of canoeing in Pingdingshan City, Henan Province, were determined as follows: Wang, H., & Buppawong, P. (2025). Development Guidelines to Promote Canoeing in Pingdingshan City, Henan Province, People’s Republic of China. International Journal of Sociologies and Anthropologies Science Reviews, 5 (3), 29-38; DOI: https://doi.org/10.60027/ijsasr.2025.5504 1. Equipment update: Evaluate the status of existing equipment, gradually eliminate obsolete equipment, purchase high-quality canoes and related training equipment, and ensure that athletes use advanced equipment for training. 2. Facility maintenance: Establish a regular maintenance and upkeep system, conduct regular inspections and repairs on various facilities at the training base, and ensure a safe and stable training environment. 3. Training water area optimization: Renovate and optimize existing training waters to ensure that the water quality is clean, the area and depth of the waters are suitable for training needs, and establish a dedicated management team to be responsible for daily maintenance and management. 1. Raise funds through multiple channels: Raise funds needed to develop canoeing projects through government grants, corporate sponsorship, and social donations. 2. Establish a special fund: Establish a special fund for canoeing development to support various expenses such as athlete training, event organization, and infrastructure construction. 3. Reasonable allocation of resources: Reasonably allocate funds and resources according to the needs 1. Formulate a systematic training plan: According to the different levels and development stages of athletes, formulate a scientific and systematic training plan, including technical training, physical training, and psychological training, to improve sports performance. 2. Introduce advanced training methods: Learn from advanced training methods and concepts at home and abroad, continuously optimize training content, and improve training effects. 3. Conduct regular evaluation: Regularly evaluate the training effects of athletes, adjust the training plan according to the evaluation results, and ensure the scientificity and effectiveness of training. 1. Attract excellent coaches: attract excellent canoeing coaches to join through generous treatment and career development prospects to improve the training level.",
    "2. Cultivate local talents: establish a coach and athlete training program, and cultivate a group of excellent local coaches and athletes through training, further study, and exchange. 3. Provide career security: provide comprehensive career security for coaches and athletes, including medical insurance, vocational training, and retirement security, to enhance their sense of belonging and stability. 1. Formulate support policies: The government will introduce special policies to support the development of canoeing projects, including tax incentives, venue support, and financial subsidies. 2. Strengthen publicity and promotion: Through various media channels, strengthen the publicity and promotion of canoeing projects to increase social attention and participation. 3. Encourage social participation: Encourage enterprises, schools, and social groups to actively participate in the development of canoeing projects, and form a good situation in which the government, enterprises, and society jointly promote it. This planning model will allow the City of Pingdingshan to overcome challenges in developing canoeing into an extreme and viable community sport while maximizing available opportunities. The means Wang, H., & Buppawong, P. (2025). Development Guidelines to Promote Canoeing in Pingdingshan City, Henan Province, People’s Republic of China. International Journal of Sociologies and Anthropologies Science Reviews, 5 (3), 29-38; DOI: https://doi.org/10.60027/ijsasr.2025.5504 of consolidating infrastructure, securing funds, standardizing training programs, popularizing the sport, and advocating policy are available in this model. It guarantees the long-term growth and success of canoeing in Pingdingshan City, Henan Province. This study aims to develop guidelines to promote the development of canoeing in Pingdingshan City, Henan Province. The research results show that the current facilities are in poor condition and need to be heavily invested in upgrading and renovation; funds are insufficient and it is necessary to expand funding sources through government support and social financing; training plans are inconsistent, and the professional level of coaches needs to be standardized and improved; in There are significant challenges in recruiting and retaining athletes, which need to be improved through strengthened publicity and incentive measures; policy support is insufficient, and local governments and sports departments need to develop stronger supporting policies. These research results are consistent with the initial hypotheses of this study and verify the key issues faced by Pingdingshan City in the development of canoeing projects. Compared with assumptions, this study further reveals the underlying causes and actual impacts of these problems, providing more detailed data support for formulating practical guidelines. Infrastructure: Consistent with past studies, modern facilities are crucial, but this study emphasizes the need for significant investment rather than incremental improvements due to severe infrastructure deficits. It enhances understanding by providing specific examples of how infrastructure impacts canoeing development. Funding and Resources: Aligns with literature noting inadequate funding as a major obstacle, but contrasts with studies suggesting that innovative funding methods like community fundraising are underutilized in Pingdingshan City. It advocates for diversifying funding sources through public-private partnerships and community initiatives. Training Programs: Confirms the importance of standardized, scientifically informed training, as supported by Li (2020), but challenges the centralized approach suggested by Garcia and Johnson (2018), proposing a decentralized, context-based approach instead. It underscores the need for modernization and standardization in training protocols. Recruitment and Retention: Affirms the importance of public campaigns and incentives for athlete recruitment and retention, as noted by Chen (2018), while suggesting a broader approach focusing on recognition and career development rather than solely on remuneration. It advocates for improved public awareness and comprehensive incentive programs. Policy Support: Supports the view that supportive policies are essential for sports development, aligning with Wang (2020), but contrasts with literature advocating for policy alone, suggesting a combination of policy and practical initiatives (Kay & Bradbury, 2009). It provides practical recommendations for policy support, including infrastructure development and effective fund allocation, and emphasizes the need for active engagement with policymakers. Overall, the research offers context-specific insights and practical recommendations that enhance the understanding and development of canoeing in Pingdingshan City. Based on the results of this study, a series of policies and recommendations for the development of canoeing in Pingdingshan, Henan Province, were proposed to ensure the development of canoeing in the city. These policies included the infrastructure development policy, funding allocation policy, training program standardization policy, and athlete support policy. The infrastructure development policy aims to build and maintain modern canoeing facilities through government funding support and private sector cooperation to improve the training environment, enhance athlete performance, increase participation, and attract sponsors and partners. The funding allocation policy aims to achieve sustainability of financial Wang, H., & Buppawong, P. (2025). Development Guidelines to Promote Canoeing in Pingdingshan City, Henan Province, People’s Republic of China. International Journal of Sociologies and Anthropologies Science Reviews, 5 (3), 29-38; DOI: https://doi.org/10.60027/ijsasr.2025.5504 support by establishing grants, providing tax breaks, and holding public fundraising events to acquire new equipment, fund athlete training, and cover operating expenses. The training program standardization policy ensures consistency and high quality of training programs by developing standardized training protocols combined with the latest sports science and continuous professional development for coaches, thereby improving athlete performance and coach skills and knowledge. The athlete support policy aims to enhance athlete retention and motivation, increase participation, and enhance the overall welfare and success of athletes by providing scholarships, career counseling, job placement, and health and welfare programs. The implementation of these policies and recommendations is expected to have a positive impact on the development of canoeing in Pingdingshan City. A series of recommendations for the development of canoeing is proposed for coaches, athletes, and sports administrators. Coaches should standardize training and use the best sports science to improve athlete performance and reduce the risk of injury; continue professional development, participate in workshops and certification programs, and work with peers and sports scientists to optimize the training environment; and pay attention to athlete well-being, integrating health, nutrition counseling, mental health support and physical therapy to promote the overall well-being of athletes. Athletes should participate in continuous learning, take advantage of training plans and educational opportunities, maintain health and fitness, set goals, and stay motivated to improve competition success. Sports administrators should create universally accessible support programs, increase public awareness, and work with policymakers to ensure the continued development and community participation of canoeing. These recommendations aim to jointly promote the development and community participation of canoeing through standardized training, professional development, athlete well-being, continuous learning, health maintenance, goal setting, public awareness, and policy advocacy.",
    "Current research lacks data on the long-term effects of infrastructure investment on sports performance and athlete participation, so longitudinal research is recommended to evaluate the sustained effects of infrastructure improvements. At the same time, there is a lack of evaluation of the effectiveness of diversified financing, and future research should investigate best practices in public-private partnerships, community fundraising, and corporate sponsorship. In addition, the specific impact of standardized training programs on athlete performance has not been quantified, so controlled experiments are needed to measure their effectiveness. In terms of human resource management, the effectiveness of recruitment and retention strategies needs to be evaluated, and future research should explore the impact of public awareness campaigns, school programs, and incentives on athlete recruitment and retention. Finally, there is a lack of in-depth analysis of the effectiveness of policy implementation, and future research should explore how policy implementation affects the development of canoeing and propose necessary adjustments. These recommendations are intended to address gaps in existing research and provide directions for future research to improve the development strategies of canoeing."
]