[
    "Abstract- With the continuous development of the macro-economy and the Internet of transportation and trade worldwide, the status of trade in tourism services is getting higher and higher. Henan has a long history and rich and colorful culture. As the birthplace of Central Plains Civilization, Henan has rich tourism resources. This paper analyzes the export status of the tourism service trade in Henan Province by using relevant data and analyzes the factors influencing the competitiveness of the tourism service trade in Henan Province by using the diamond model; this paper puts forward some suggestions to improve the export competitiveness of tourism service trade in Henan Province. © 2021. Lin Zhu, Yuqing Geng & Heshun Zhang. This research/review article is distributed under the terms of the Attribution- NonCommercial-NoDerivatives 4.0 International (CC BY-NC-ND 4.0). You must give appropriate credit to authors and reference this article if parts of the article are reproduced in any manner. Applicable licensing terms are at https://creativecommons.org/ licenses/by-nc-nd/ 4.0/. Abstract- With the continuous development of the macro- economy and the Internet of transportation and trade worldwide, the status of trade in tourism services is getting higher and higher. Henan has a long history and rich and colorful culture. As the birthplace of Central Plains Civilization, Henan has rich tourism resources. This paper analyzes the export status of the tourism service trade in Henan Province by using relevant data and analyzes the factors influencing the competitiveness of the tourism service trade in Henan Province by using the diamond model; this paper puts forward some suggestions to improve the export competitiveness of tourism service trade in Henan Province. A lthough the development of the tourism service trade is not long in history, as an extremely important part of service trade, the market is open and close to other industries in China, which can further the promote tertiary the development of industry. People's living standards demand have changed from material demand to spiritual demand. China's tourism service trade is also growing continuously, Overused word ranking first in the service trade. At the end of the last century, China's total trade in tourism services did not exceed the US $20 billion. In 2014, it was the US $227.93 billion, and the trade volume of tourism services exceeded the US $413 billion in 2018. From the data can also be seen that China's service trade volume has a qualitative change[1]. The development of the tourism service trade has increased China's foreign exchange reserves. More income has promoted the high-quality development of China's economy. Henan has many places of interest in cultural heritage as the birthplace of Chinese civilization. Natural resources are abundant. They span four Overused word rivers and natural landscapes, magnificent, rich in tourism resources, and have broad prospects tourism development[2]. From 2013 to 2019, the number for of inbound tourists in Henan Province continuously set new records, increasing from 2073300 to 3514700, with an increase of 69.5% and an average annual increase of 11.5%. From 2013 to 2019, the foreign exchange income of tourism service trade in Henan province continued to rise in 2015, with an annual growth rate of 17.12%. After 2015, the growth rate of foreign exchange earnings from tourism decreased in a fluctuating manner, but the overall total amount of foreign exchange earnings increased. In 2019, the growth rate of foreign exchange earnings from tourism in Henan Province reached a record high, reaching 26.16%. To some extent, this reflects that under the government's policy measures of attaching importance to tourism service trade, Henan tourism service has been recognized by foreign tourists, which has promoted the significant increase of foreign tourism exchange earning scale[3]. By observing the statistical data of different prefecture- level cities in Henan Province, the number of overseas tourists in 2019 and the number of visitors across the province are uneven. Zhengzhou receives the most tourists, and Kaifeng and Luoyang around Zhengzhou are the second and third in the number of tourists, respectively. It can be seen that there are few other prefecture-level cities. Except that Jiaozuo has a famous Yuntai Mountain scenic spot in Henan Province, with a total number of foreign tourists of more than 60 million, other prefecture standard [4]. level cities are lower than this According to Porter's diamond model. When we study industry and analyze its international competitiveness, we should analyze it from five aspects: factor conditions, demand conditions, supporting industries and related industries, enterprise strategic structure and competition, and government. the role of the The production factors of tourism are the foundation of tourism development. The richness of resources, the level of tourism services, and whether they have characteristics different from other tourism products all determine the competitiveness of a region's tourism service trade to a certain extent.",
    "In terms of supply, the supply of tourism resources mainly refers to natural resources and cultural resources. Henan Province has relatively rich tourism resources. For example, the wild Lingxia lake landscape was formed by the water conservancy project in Xiaolangdi. The Yellow River passes through six major cities in Henan, with about 800 kilometers. The distinctive Swan Lake is in Sanmenxia City. Liuyuankou, known as the hanging river on the ground, was in Kaifeng, the ancient capital. The majestic lake resources show the charm of the Central Plains. There are also the famous Zhongyue Song Mountain and other famous natural scenic spots. Henan is developing tourism resources in an all-around way. Some representative tourism projects are about to develop in northern, southern, and western Henan. The level of tourist reception and domestic tourist reception in Henan Province has reached a new level. In 2019, the income of domestic tourists received reached 951.7 billion yuan, and the number of domestic tourists received exceeded 800 million. Under such influence, develop in a benign direction. From the above statistics, we can see that the tourism market in Henan Province has been continuously developing and expanding. Henan, as the center of high-speed rail network, coupled with its own natural and cultural tourism resources has a strong influence, attracting more and more domestic tourists to Henan for tourism. As the domestic tourism market matures, it will attract more foreign tourists and meet their needs. Industrial cluster can bring good income. At present, the tourism industry in Henan province has not formed industrial cluster effect, including hotel catering service industry, transportation industry, travel agency and many other industries related to tourism are developing, and forming industrial cluster can promote the competitiveness of tourism service trade in Henan Province. Henan Province's tourism service trade continues to increase infrastructure construction, improve traffic conditions, and optimize related supporting industries. The number of provincial hotels attracting foreign tourists increased from 502 in 2013 to 446 in 2019, a rapid increase[6]. Henan province, it is also limited by the service level of other industries. In terms of financial services, big banks are less distributed outside Zhengzhou and Luoyang, foreign exchange functions are not perfect, ATM types are relatively single, and many tourist attractions are rarely equipped with ATM; Most of the bankers in Henan have low foreign language proficiency and it is difficult to communicate with international tourists, which has a serious impact on the development of tourism service trade in Henan Province. These situations have a serious impact on the development of Henan Province’s tourism service trade. The hotel layout of scenic spots is unreasonable and does not combine with regional characteristics. The construction of hotels in Henan Province is also a problem that affects the competitiveness of Henan Province's tourism service trade. Most scenic spots have incomplete hotel projects, irregular accommodation facilities, unreasonable configuration, and improper management services[7]. Analyzing the tourism data of foreign tourists visiting Henan Province, we can find that from 2013 to 2019, the number of inbound tourists in Henan Province set a new record continuously, increasing from 2.0733 million to 3.514 million, an increase of 69.5%, and an average annual increase of 11.5%. However, it is affected by a series of factors such as geographical location, transportation, economic development level, and characteristic tourism resources[5], the distribution ratio of the source of tourists in Henan Province is also different, all concentrated in Zhengzhou, Kaifeng, and Luoyang. The tourist resources of Henan Province are cultural heritages that reflect the oriental civilization and charm and show the unique scenery and customs of China. Due to these characteristic resources, there is much room for domestic and external demand for tourism commodities in Henan Province. According to the latest statistics, the number of tourists visiting both at home and abroad has continued to increase. During the \"Thirteenth Five-Year Plan\" period, the development of the tourism industry in Henan Province is facing a rare historic opportunity, and it has steadily passed the golden opportunity period of \"transformation and upgrading, sustained and rapid development.\" At present, through the development plan of the \"14th Five-Year\" tourism industry in Henan Province, the tourism system of Henan Province has been improved through project construction, aiming to improve marketing, service quality, and enterprise training. The increase in the degree of development, etc., to achieve remarkable results in the development of the tourism industry of henan province and maintain a good situation, the tourism industry is required to maintain rapid and healthy development. Comprehensively improve the quality and efficiency of tourism development, strengthen infrastructure construction, provide a guarantee for the overall improvement of the development level of the tourism industry, and create an excellent environment for the development of the tourism industry.",
    "communication. For tourists from all over the world, training guides who provide language services different countries will help improve service level and customer satisfaction. Therefore, it is necessary to in strengthen the training of existing staff and improve the level of foreign language service. It is necessary to adopt some preferential policies to attract some graduates of tourism-related majors, such as international trade and marketing, to engage in the international promotion of Henan's tourism service and improve the international competitiveness of henan's tourism service trade. Through the analysis of the current stage of the development of Henan Province's tourism service trade, this kind of defect has generally existed in the market for a long time. Sustainable development in the tourism industry exists as a slogan. Usually, only care about partial short-term commercial interests, ignore long-term interests, consume resources unscientifically, destroy the environment, pay a high price for minimal gain. From the upper level to the market, participants often show blindness to this phenomenon. Government departments must play the role of coordinator in the development of tourism service trade. Apart from the government, the nature of the market determines that it is difficult to play such a role. First, develop the government-led tourism industry. For a long period from now to the future, the government will continue to play a role that cannot be replaced by any enterprise or entity in terms of macro- control, market layout resources, infrastructure construction, and market supervision, and other safeguards and balancing measures. For example, \"Jiaozuo phenomenon\" in the past ten years, Jiaozuo has successfully transformed from a coal city to an excellent tourist city by developing tourism. Now, Jiaozuo has the responsibility and obligation of the government to accelerate tourism again and promote the transformation from \"ticket economy\" to \"industrial economy\", which shows the importance of developing government-led tourism industry[8]. In recent years, the Yuntai Mountain Music Festival and other cultural tourism activities that young people enjoy have the government acted as a promoter. Secondly, Enterprises are important participants in economic activities, and travel agencies directly provide services for customers, which is the most important part of the industrial chain and an important carrier of international competitiveness of tourism service trade. Improving the overall quality of travel agencies is the biggest problem facing current travel companies. Analyzing the relevant data, the number of Henan tourism companies is not large, restricting the further improvement of Henan's tourism service trade level. In addition, there is also monopoly and unhealthy competition in the travel market. Moreover, the entry threshold of this industry is high, the demand for employment is great, the labor cost is high, and the development of small travel agencies is difficult. Rectifying travel agencies is very necessary to improve the competitiveness of Henan Province's tourism service trade export."
]