[
    "Gross Domestic Product (GDP) is an important statistical indicator for quantitatively studying of economic development and space distribution characteristics. However, GDP has been often calculated based on administrative units without fine describing the difference of space distribution in the administrative unit. This paper calculated night-light indexes of Henan province using DMSP/OLS remote sensing data in 2006 and 2013. Those correlation between different light indexes and GDP was analyzed, and the best regression model of GDP was constructed. The accuracy of statistical data in 2006 and 2013 was used to verify the accuracy. The spatial visualization and dynamic analysis of GDP in Henan province were realized. Finally, this paper realized the spatial visualization and dynamic analysis of GDP in Henan province and produced 1 km x 1 km distribution map of GDP density.The results showed that the Total Night-time Light (TNL) index had the highest correlation with GDP in 2010 with the coefficient of 0.928, R2 was 0.861. The TNL indicator and GDP in 2013 achieved the correlation coefficient of 0.930, R2 was 0.865. the average relative error between GDP simulation value and statistical value in 2006 and 2013 is 8.19%, 8.08%, respectively.The GDP density map of 18 prefecture-level cities in Henan province showed an obvious expansion trend from 2006 to 2013.This research demonstrated that the Night-time light data could be used as an important index of analyzing economic status of Henan province. The model between light indicators and GDP could better simulate the spatial distribution of regional economic development. With the continuous progress of science and technology, the research of regional economic data, such as economy and population, in the process of interaction between people and the environment has attracted the attention of all social circles. The traditional GDP comes from statistical data. GDP statistical data can only reflect the macro situation of a certain region, and can not reflect the internal differences of the region. GDP spatial distribution is based on night-time lighting brightness, population distribution, land use data model and other factors, and GDP space is allocated to each pixel of night-time lighting data for data sharing among many fields. Carry on Spatial statistical analysis brings great convenience. In recent years, the research of night-time lighting data mainly focuses on socio-economic population assessment (Li Feng,et al 2016), urban expansion(Wu Jiansheng,et al 2016), major event monitoring (Li X,Chen F, Chen X,2013) and so on. There are not many provincial studies in China. Elvidge et al found that the lighting area of each country is highly correlated with GDP (GDP) according to DMSP/OLS data, but failed to extract its spatial information(Elvidge C D,et al,1997). Henderson et al. DMSP/OLS stabilizes the optimal threshold of the two kinds of data for the light image and the radiometric calibration light image, and correctly extracts the spatial information of the difference between the urbanization level and the economic development level of San Francisco, USA and Beijing, China and Lhasa (Henderson M,et al,2003). Most of the above studies on the spatial nature of social and economic statistics are carried out on the global or national scale, and the influencing factors are often simplified. Henan is located in the east-central part of China, the middle and lower reaches of the Yellow River, Anhui, Shandong, Hebei, Shanxi, Shaanxi in the west and Hubei in the south. The gross domestic product of GDP in 2006 is 1.241286 trillion yuan, and the gross domestic product of per capita GDP is 262.85 billion yuan. In 2010, the gross domestic product of GDP is 2.324088 trillion yuan, and the gross domestic product of per capita GDP is 418.71 billion yuan. In 2013, the gross domestic product of GDP was 3.242355 trillion yuan, and the gross domestic product of GDP per capita was 5647. It's 800 million yuan. Henan Province has four economic zones: northern Henan, western Henan and southwest Henan, Central Plains urban agglomeration and Huang-Huai region. The high level agglomeration area of economic development in northern Henan and central Henan forms the economic growth center of Henan Province in space, and the surrounding area becomes its peripheral area, showing an obvious center-periphery model. There is obvious club convergence in the level of regional economic development, which is manifested in Zhengzhou-Jiaozuo-Jiyuan-Xuchang economic growth center; Luoyang-Pingdingshan-Luohe-Anyang-Puyang secondary economic zone; Xinxiang-Kaifeng-Shangqiu-Zhoukou level 3 economic zone; Sanmenxia-Nanyang-Zhumadian-Xinyang peripheral area (Zhou Yi,et al,2013). The role of the economic development in the whole province is increasing, and the importance of the long-headed Zhengzhou of the central-China urban agglomeration and the central-China urban agglomeration is increasing, and the influence of the This paper takes the municipal administrative division as the basic unit, calculates the light index of each administrative district of Henan Province in 2006 and 2013 respectively, and analyzes the lighting data and the different regional economy. Based on the correlation between the data, the spatial model of GDP suitable for the small scale research area of Henan Province is established, and the visual expression of GDP is realized by using 1 km × 1 km space to find out the temporal and spatial dynamic variation of GDP in each administrative region of Henan Province, which lays a foundation for the formulation of economic development strategy in the future.",
    "from the American ground ball theory (https://ngdc.noaa.gov/eog/dmsp/downloadV4composites.ht ml) download night-time light images from 2006 (F152006), and 2013 (F182013). The night-time lighting data include three kinds of annual average data and average observation values (Average). The cloudless number (Cloud Free Coverges) observed by Visible), stable lamp value (Stable Lights),(Doll C N H,et al,Zhuo L,et al) The spatial resolution of 3000 km, data is 2.7 km. Since building the GDP model needs to exclude the influence of accidental lighting, this paper takes the stable light values (Stable Lights) as the research data. values, NL and AN represent the total number of pixels in the area and the total area of all light pixels in the area, and A represents the entire area. The TNL,I and CNLI lighting data indexes of each administrative region of Henan Province were calculated by zoning. The correlation between lighting index and gross domestic product (GDP), primary output value, secondary output value and third output value of 18 administrative districts was statistically analyzed by using origin software. The scatter map of three indexes and GDP was generated, and the correlation coefficient R2 of lighting index of each industry was obtained. In this paper, the total light intensity at night (Total Night-time Light,TNL), the average relative light intensity I, the light area ratio S, the comprehensive lighting index (Compounded Night-time light Index,CNLI) are used to describe the economic level differences in 18 administrative areas of Henan Province. the total light intensity at night refers to the sum of the number of light attribute values multiplied by the corresponding attribute values. The average relative light intensity is the percentage of the total night-time light intensity to the maximum light intensity, and the light area ratio is the area of the light area. Compared with the total area in the administrative area, the comprehensive lighting index is the light area ratio multiplied by the average relative light intensity, and the specific formula is as follows: Based on the correlation between different light index and GDP, GDP1, GDP2, GDP3 and GDP2&3, the best light index is selected for regression analysis. The established model is as follows: The night-time lighting data reflect the distribution of regional economy. Therefore, the spatial distribution of GDP in Henan Province is studied by using lighting data, and the GDP space is allocated to each pixel in the space according to the mode type. The simulated GDP is divided into seven categories by using the natural disconnection method of ArcGIS, and the spatial distribution map of the simulated GDP is obtained. In the formula: DNi represents the attribute value of the I pixel, ni represents the number of corresponding I attribute In the formula, it is the density distribution of GDP after linear correction, the simulated GDP density value, the GDP output value of the district and county statistics, and the GDPall value of the simulated GDPj value of the district and county. The TNL,I,CNLI three lighting indices of 18 municipal administrative regions are calculated by formula (1) From the change of the three lighting indexes, we can see that the lighting index of most cities in 2006-2013 increases with the increase of GDP. From the TNL value of 2006-2013, we can see that the difference between Nanyang City, Zhengzhou City and Shangqiu City is relatively large, which is closely related to the development of GDP in administrative region. I. The areas where the value has changed greatly from 2006 to 2013 are Zhengzhou City, Hebi City, Puyang City, and the CNLI value is from the following areas: Zhengzhou City, Hebi City, Puyang City. correlation between GDP and TNLI is the most (Fig.2). (a-e) The regression analysis of GDP1, GDP2, GDP3, GDP2&3, GDP and night-time light total intensity (TNL) in 2006. The correlation coefficient between GDP1 and TNL is 0.12, the correlation coefficient between GDP2 and TNL is 0.77, and the phase of GDP3 and TNL is 0.77. The relationship number is 0.82, the correlation coefficient between TNL and TNL is 0.82, and the linear correlation coefficient between TNL and GDP is the highest. The closer the R2=0.87.R2 is to 1, the closer the actual observation point is to the sample line, the higher the goodness of fit is. Fig. 2 (e-g) is a linear regression analysis between GDP and different light indices. The correlation coefficient between GDP and total light intensity TNL at night is 0.87, the correlation coefficient between GDP and composite light index CNLI is 0.15, and the correlation coefficient between GDP and average light intensity I is 0.87. The correlation coefficient is 0.14. To sum up, the TNL light index with the highest number of phase relations in 95% confidence interval is selected as the best regression model, see formula (4).",
    "The correlation between the three light data indices of TNL, I and CNLI in 2006 is analyzed. The results show that the Using the three light data indices of TNL, I and CNLI in 2013 to analyze the correlation with GDP, the results showed that the correlation between GDP and TNLI was the largest (Figure 3). Figure 3(a - e) shows the regression analysis of GDP 1, GDP 2, GDP 3, GDP 2&3, and total intensity of nighttime light TNL. The correlation coefficient between GDP and TNL is 0.62, and the linear correlation coefficient between TNL and GDP is 0.64, and the correlation coefficient between GDP and GDP is 0.62, and the linear correlation coefficient between GDP and GDP is the highest (R2 = 0.69). Fig.3(e-g) is a linear regression analysis between GDP and different light indices. The correlation coefficient between GDP and total light intensity TNL at night is 0.69, the correlation coefficient between GDP and comprehensive light index CNLI is 0.67, and the correlation coefficient between GDP and average light intensity I is 0.68. To sum up, choose 95% confidence The TNL light index with the highest correlation coefficient in the interval is used as the best regression model, see formula (5). Compared with the correlation analysis of (GDP), primary industry (GDP1), secondary industry (GDP2), tertiary industry (GDP3) and sum of secondary and tertiary industries (GDP2&3) between 2006 and 2013, the correlation coefficient between GDP and I of the two kinds of lighting data was low, and it was found that there was a significant correlation between GDP and TNL. In two years, it was 0.8706 and 0.6936 respectively. In 2006, the lighting index TNL analysis of social and economic aspects of other indicators are more objective. In this paper, the correlation coefficient is used as the judgment principle, and the statistical regression model of GDP and light index TNL in 95% confidence interval is selected as the best model of spatial expression of GDP in Henan Province to predict the output value of GDP at each municipal level in Henan Province. It can be seen from Table 1 that the overall error of the prediction equation is small, 70% of the relative errors of the cities are less than 10%, the cities with relative errors of more than 15% in 2006 are Zhengzhou, Luoyang, Nanyang, and Zhengzhou, Luoyang and Anyang. For the difference between the relative error of GDP in 2006 and 2013, the relative error of 70 percent of cities increases, which is due to the fact that with the growth of economy and the interference of other factors, the error of economically developed areas will be larger, which is higher than that of night lighting images. There is a close relationship between the DN value of. In economically developed cities such as Zhengzhou and Luoyang, because the DN value has reached saturation since 2013, it can not match the economic level, so there is a big error. In other cities, such as Kaifeng City and Nanyang City, the error between the simulated value and the real value is caused by the excessive brightness of the light. Among them, Kaifeng City is a famous tourist city, tourism is developed, and the lights are often bright at night, resulting in a higher level of lighting. The results show that the regional economy where the GDP value simulated by the model matches the actual value is relatively backward. Because most of the lighting index in these areas is not saturated, it can be strong lighting at night due to the development of urban tourism. The average relative error between GDP simulation value and statistical value in 2006 is 8.19%,.In 2013, the average relative error between GDP simulation value and statistical value was 8.08%. The formula (3) can be used to calculate the The output value of GDP has high reference value. Using the established model to visualize the GDP space in Henan Province, the GDP statistical data space is allocated to each pixel according to the model, and finally the GDP density map is formed (Fig. 4). macro-economic development of Henan Province 2006-2013 is good, the GDP growth of the whole province in 2006-2010 is 10695.14 billion yuan, and the GDP of the whole province in 2010 is 9340.11 billion yuan. From the distribution of GDP, it can be seen that the distribution is more uniform, and the overall GDP spatial distribution pattern of the two is basically the same. From city,2006-2013 The prefectural cities with rapid growth are Zhengzhou (2.08 times), Sanmenxia City (1.92 times) and in the Kaifeng City (1.87 times). Although the economy of Sanmenxia City has been in a backward state, the economic development situation is good in the past six years. Zhengzhou City increased by 2.08 times, up 418.837 billion yuan, showing a trend of continuous expansion around. Luoyang City, adjacent to Zhengzhou, increased 1.36 times, Xinxiang City increased 1.76 times, and the economic growth of the three cities was stable. Kaifeng, as the ancient capital of the eight dynasties in Henan Province, grew 1.87 times. The economy developed rapidly in 2006 and 2013. But the regional difference is clear, from the view of the GDP density, there is a clear difference between the town and the rural GDP in various cities, among which the relatively developed regions of the economy are distributed in the city of Zhengzhou and Kaifeng; the middle-economic region is mainly distributed in most of the county-level urban areas, Mainly in Xinxiang City, Luoyang is the generation form; the economically underdeveloped region is distributed in the southwest, especially in the city of Nanyang, Xinyang, Zhumadian, Henan Province, and the land type is mainly in the farmland, the garden, the forest land and the grassland, and the light value is low, This led to a low overall GDP value in these areas. as can be seen from the figure, It is obvious that the GDP per unit area in Henan Province has increased significantly. Different from the traditional statistical data or the values evenly assigned to each administrative unit, the GDP spatial distribution map based on night-time lighting data reflects the value and GDP distribution characteristics of GDP on each pixel, reflects the law of GDP distribution more clearly, and is more helpful to the macroeconomic development planning of Henan Province.",
    "In this paper, based on the DMSP/OLS night-time lighting data and GDP statistical data of 2006—2013, the GDP regression model is constructed, and the spatial visual expression of GDP in Henan Province is realized. The conclusions are as follows: data, and analyzes the linear correlation between night-time lighting index and GDP. Comparative analysis 2006-2013 The linear correlation between TNL, CNLI, I and GDP was found in 2006 and 2013. It was found that there was an obvious linear correlation between TNL and GDP at night, and R2 reached 0.98 in 95% confidence interval. 1) This paper first determines the TNL,CNLI,I lighting index calculated by lighting data, and analyzes the correlation between TNL,CNLI,I lighting index and GDP1,GDP2,GDP3,GDP2&3, GDP statistical 2）Based on the TNL light index which has the highest correlation with GDP, the regression analysis is carried out and the optimal regression analysis model is established. According to the established model, the GDP simulated values in 2006 and 2013 are compared with the GDP statistical values. The accuracy test shows that the average relative error between GDP simulation value and statistical value in 2006 and 2013 is 8.19% and 8.08%, respectively. Henan Province in 2006 and 2013 can be seen intuitively from the GDP density map. From 2006 to 2013, the economic development of Henan Province is rapid but the regional differences are obvious. The development speed of the central and northern regions is faster, and the development speed of the southern region is relatively slow due to topography, climate and other reasons. The model established in this study can simulate the spatial distribution of the economy in the administrative region, and the light intensity data of the administrative region are closely related to the economic data GDP. It can reflect the difference of economic development in the region more accurately, so the lighting data can be applied to the economic analysis, which provides a certain reference value for Although the high precision visual representation of GDP is realized in this paper, there are some errors between the simulated data and the real data, which are mainly restricted by two aspects: (1) limitations of the night-time lighting data itself. The night-time light data has high sensitivity, which can not only record the light data, but also record the information generated by accidental light, such as lightning, etc., so it is necessary to process the light data in order to eliminate accidental light. However, some of the light errors can not be completely eliminated, such as the reflection of water on the light not only increases the light intensity of the area, but also increases the light area of the area, and the lack of underground working light data reduces the light intensity of the area.（2）regression model error. In this paper, the municipal administrative area is taken as the research object, and the spatial scale of the research unit is large, which reduces the accuracy of the model. In the later research, a smaller area will be selected as the research unit, and the society and the This study was funded by the National Natural Science Foundation of China (Grant No. 41801071), Natural Science Foundation of Guangxi (Grant No. 2018GXNSFBA281015), and Guilin university of technology scientific research Foundation (Grant No. GUTQDJJ2017096)."
]