[
    "Jincai Zhang® | Ling Li | Qingsong Li | Weiqiang Chen | Junchang Huang | Yulong Guo | Guangxing Ji® Funding: This research was funded by the Key project of Joint Fund for science and Technology Research and Development Programs in Henan Province (225200810045), and the Special Fund for Top Talents in Henan Agricultural University (30501031). Keywords: comprehensive CES index services ecosystem | ecosystem services | FLUS model | Henan Province | InVEST model | land use change Studying the impact of future land use changes on regional ecosystem services (ES) is crucial for sustainable development plan- ning in the region. However, there is a lack of research specifically targeting Henan Province under different future scenarios. Therefore, this study simulates four ES functions—water yield (WY), carbon storage (CS), habitat quality (HQ), and nutrient delivery ratio (NDR)—for the historical period in Henan Province. It also constructs a Comprehensive Ecosystem Service (CES) Index. Additionally, the study predicts the spatial and temporal distribution characteristics of various ES and CES under two different Shared Socioeconomic Pathways (SSP) scenarios for the future. The results of the study showed that: (1) The high simu- lation accuracy of the FLUS model indicates that the FLUS model is suitable for land use simulation in the study area. (2) Under the SSP2-4.5 scenario, the area of construction land expansion is the largest, and the HQ, CS, water production capacity, and water purification capacity of Henan Province all decrease. Under the SSP5-8.5 scenario, the area of cultivated land increased the most, and all three decreased except for the water production capacity, which increased. (3) Under the SSP2-4.5 scenario, the area of CES decline is the largest, and the severe decline in CES mainly occurs in areas where forest land is encroached upon by urban land, followed by areas encroached upon by rural settlements, and the encroachment of arable land by construction land leads to a mild decline in CES, which accounts for the largest proportion of the area. Under the SSP5-8.5 scenario, Henan Province has the largest area of CES rise, and most of it is dominated by mild rise, but the mean CES in 2050 is still lower compared to 2020. The results of the study can provide a reference basis for the formulation of sustainable development policies in Henan Province and provide new ideas for the study of the impacts of land use change on ES under different scenarios in the future. Ecosystem services (ESs) refer to the benefits that humans de- rive directly or indirectly from ecosystems, and mainly include four types of services: provisioning, regulating, cultural and supporting services (Costanza et al. 1998; Ouyang et al. 1999). Natural capital, mainly in the form of ESs, facilitates human so- cial development and enhances human well-being, providing a resource and environmental foundation for human survival and development (Kremen and Ostfeld 2005; Summers et al. 2012; Bai 2011). However, the increase in population and unlimited human production and business activities have caused serious damage to the ecological environment, resulting in a series of major natural disasters such as the increased frequency and intensity of extreme weather and fires (IPCC 2014; Mahecha et al. 2017; Ummenhofer and Meehl 2017), which has led to a This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. global scale of ecological system structure and functioning at the global scale. According to the United Nations “Ecosystem Services and Human Well-being” (MA) program, more than 60% of the world's ecosystem services have declined to varying degrees, and this downward trend is likely to continue, which is a serious obstacle to sustainable human development (Briones- Hidrovo et al. 2020; Mi et al. 2021). Statistics show that ecosys- tem function can create up to 15 trillion pounds of value for human beings (Wu et al. 2020), however, under the irrational use of human beings, nearly two-thirds of this value has been lost, and problems such as soil erosion, land sanding, and a sig- nificant decline in biodiversity have led to a decline in ecolog- ical function and undermined the sustainable development of the ecological environment at the same time (Jiang et al. 2021; Chatanga et al. 2020), it is urgent to assess and improve ESs (Yang et al. 2020; Fu et al. 2020).",
    "Early ecosystem service assessment suffered from the problems of a single research object and one-sided research conclusions (Wang et al. 2013; Deng et al. 2019). In order to be able to better quantify ESs, some assessment models based on complex theo- ries and research results have emerged, such as InVEST (Benra et al. 2021), the ARIES (Villa et al. 2009) and SolVES (Kim et al. 2017; Zhao et al. 2019) among other models. Compared with other models, the INVEST model is more maturely devel- oped, has the advantages of easy access to driving data, easy pa- rameter adjustment, visualization of results, and is in the stage of continuous updating and improvement, so it has been widely used (Li et al. 2023, 2024; Yue et al. 2023) and has achieved a bet- ter response all over the world. For example, Zhang et al. (2022) used InVEST's carbon stock, HQ, water yield (WY), and sedi- ment transport ratio models to assess the conservation effects inside and outside the Qinghai-Tibet Plateau National Nature Reserve. The InVEST model has been widely used at different research scales, and its reliability has been verified, e.g., for the urban agglomeration of the Jing-Guan-Zhong Plain, China (Yang et al. 2022), on the spatiotemporal dynamics of the Loess Plateau in China (Chen et al. 2022) and on the dynamics of soil and water conservation and water quality purification in the Koshi River Basin in Nepal (Yigez et al. 2023). Several practi- cal cases have demonstrated that the InVEST model can better reflect the ecological processes in different ecosystems and well assess the spatial characteristics of ESs. Land use/cover change (LUCC) is the most important factor affecting ESs (Rao et al. 2018; Wang et al. 2018), and certain ecosystem service functions are closely related to land use type changes. In recent years, many scholars have explored the im- pacts of land use change on ecosystem functions such as soil and water conservation, biodiversity, and HQ from different research perspectives. For example, Liu et al. (2015) showed that the increase of grassland, watershed, and forest land has a positive effect on the water environment, while the increase of agricultural and construction land has an almost equal negative effect on the water environment. Li et al. (2013) showed that the reduction of farmland and the expansion of forests improved the soil conservation service, while the increase of forests im- proved the carbon sequestration service but weakened the water resource supply service, and the expansion of construction land improved the soil conservation service, and the increase of for- ests improved the water resource supply service. The expansion fication. The research mentioned above only covers the impact of land use change on ecosystems during historical periods. To better study the future impact of land use change on eco- systems, Thomas et al. (2024) proposed the use of endogenous value coefficients in the assessment of future ecosystem service values. Additionally, scholars have utilized models such as CA- Markov (Liu et al. 2021), CLUE-S (Li et al. 2021), and the FLUS model (Wang et al. 2020) to simulate future land use conditions, thereby modeling future ecosystem functions. Chen et al. (2024) have employed the CA-Markov and InVEST models to simulate the spatial flow of future ESs. Their study indicates that veg- etation coverage is the primary driving force for soil conser- vation. Compared to the CA-Markov model, the FLUS model (Liu et al. 2017) is better suited for simulating complex land use changes in multiple scenarios, across various scales, and with high precision (Liang et al. 2018), and it has been more widely applied. For instance, Ma et al. (2024) combined the FLUS and InVEST models to evaluate the relative contributions and com- prehensive impacts of water-related ecosystem functions in Southwest China, finding that land use and climate change have a comprehensive impact on future ESs. Li et al. (2020) also used the FLUS and InVEST models to investigate the effects of land use change on carbon storage (CS), flood regulation (FR), and soil conservation (SC) in the Beijing Ecological Protection Area of China. These studies suggest that the combination of FLUS and InVEST models is more suitable for simulating future land use and ecosystem service functions in multiple scenarios.",
    "Henan Province is China's most populous and agricultural prov- ince, with 6% of the country's arable land and 10% of its popula- tion (Zhang 2021). It is the main producing area for wheat, corn, and other grain crops in China (Wang et al. 2023) and is a key re- gion for realizing China's rural revitalization strategy. However, most areas in Henan Province are still ecologically fragile (Song and Yang 2022), with issues such as forest structure problems, land desertification, soil erosion, and agricultural non-point source pollution (Huang et al. 2021). Previous studies have fo- cused on the single functions of ecosystems in Henan Province (Ren et al. 2022; Fan et al. 2023) or on CES valuation of an area in Henan Province (Niu et al. 2022; Ji et al. 2021). No scholars have yet used InVEST to integrate multiple indicators to comprehen- sively assess the impacts of ecological functions and their spa- tial and temporal changes in Henan Province. Henan Province has reached a forest coverage rate of 25.47%, but this coverage is not uniformly distributed across the region. Similarly, while the total water resources in the province are adequate, there is a disparity in their spatial distribution. The amount of carbon stored is linked to land use patterns, and there is a spatial mis- match between the supply and demand of carbon sequestration services (Li et al. 2022). In Henan Province, the issue of non- point source pollution is severe (Gao et al. 2024). Evaluating the nitrogen load is essential for the government to develop effective strategies for enhancing water quality. Considering the current situation in Henan, the assessment of HQ, WY, carbon storage (CS), and nitrogen export is vital for the protection of biodiver- sity, management of water resources, reduction of carbon emis- sions, and improvement of water quality. Therefore, this paper uses the FLUS model to check the accu- racy of land use data in Henan Province and then simulates the multi-scenario land use data from 2030 to 2050 using the FLUS model. After that, the INVEST model was used to quan- tify four ESs: CS, WY, HQ, and nutrient delivery ratio (NDR) for the period 2000-2050, and a hierarchical analysis was used to construct a comprehensive ecosystem services index (CES) for comparing the overall levels of multiple ESs. Finally, the impacts of land use drivers on CES in Henan Province are ex- plored using geoprobes, and changes in multiple ESs and their total supply in Henan Province are further analyzed for mul- tiple scenarios for 2000-2020 and 2030-2050. It is hoped that this will provide information for future land use decisions in Henan Province, a theoretical basis for ecological revitalization in Henan Province, and a reference for ensuring ecological secu- rity in Henan Province. The geographical location of Henan Province is shown in Figure 1. Henan Province is located in the middle and lower reaches of the Yellow River in east-central China, south of the North China Plain. It is located at longitude 110°21’-116°39’ E and latitude 31°23’-36°22'N, with a straight-line distance of about 580km from east to west and 550km from north to south, and the total area of the province is 167,000km?. The topogra- phy of Henan Province presents the trend of looking north to south and bearing east to west; the terrain is high in the west and low in the east. The north, west, and south are bounded asuaor] suoUIILIO aAnRaID a]quoydde ayy £q pousoro# are sajanse YO ‘asn Jo sajna s0J Azeagry autUG Aaqt,A\\ UO (suORIPUOD-puP-suuIA} HOD\" Ao|LAW-AaeaquaUt|UO)/:sd)y) SUONIpUO uk sUD| ay3 99g ~[$Z0Z/T 1/90] HO AreIQLT aUNJUE AOIEA\\ “TLTTL°€299/ZOOI O1/lp/to9-Kajtav'KseaqrauN|UO//:sdny wos, papwoUMo “E “SZOZ *SSLLSHOT by the Taihang Mountains, Mount Fuyao, Mount Tongbai, and Mount Dabie along the provincial boundary in a semian- nular distribution, in the middle and east of the Yellow River and Huaihai alluvial plain, and the southwestern part of the Nanyang Basin. The plains and basins, mountains, and hills account for 55.7%, 26.6%, and 17.7% of the total area, respec- tively. Most of Henan Province is located in the warm temper- ate zone; the south crosses into the subtropics, belonging to the continental monsoon climate of the transition from the north- ern subtropics to the warm temperate zone, but it also has the characteristics of the transition of the climate from east to west from the plains to the hilly and mountainous areas, with four seasons, rain and heat at the same time, complex and varied me- teorological disasters that occur frequently. The average annual temperature of the province from south to north ranges from The data used in this study and its sources are shown in Table 1. In this study, the land use data for the historical periods (2000, 2010, and 2020) were further categorized into six types based on the original data: agricultural land, forest land, grassland, wetland, building land, and unused land. The global 0.25° x 0.25° Land Use Harmonization 2 (LUH2) dataset was downscaled to obtain pre- dicted quantities of various land use types for the future periods of 2030, 2040, and 2050 under two SSP scenarios (SSP2-4.5 and SSP5-8.5). The SSP scenarios SSP2-4.5 and SSPS5-8.5 are briefly described as follows: In the SSP2-4.5 scenario, socioeconomic factors follow their historical trends without significant changes, and CO, emissions start to decline in the mid-21st century. Under this scenario, the temperature is expected to rise by 2.7°C by the end of the century. SSP5-8.5 is a more aggressive scenario where CO, emission levels double by 2050, with rapid global economic growth. By 2100, the global average temperature is projected to be 4.4°C higher in this scenario.",
    "Land use change is closely related to the natural environment and transportation location. The main spatial variables driving land use change in this paper include natural factors (Digital Elevation Model (DEM), slope, aspect, and soil data) and trans- portation location factors (distance from city center, town center, railway, expressway, national highway, and provincial highway). Slope and aspect were extracted from the DEM using ArcGIS. The distance data to the city center, town center, rail- way, expressway, national highway, and provincial highway were further processed using ArcGIS based on the city center data and road network data. The precipitation and evaporation data for the two SSP scenarios in the future periods used in this paper are sourced from the Scenario Model Intercomparison Project (ScenarioMIP) of CMIP6. All raster data have been uni- fied to a resolution of 1000m x 1000 m, and the coordinate sys- tem has been reprojected to Albers_Conic_Equal_Area, with the raster extent maintained consistently. The FLUS model was developed by Liu et al. (2017) based on the principle of traditional metacellular automata with improvements; the principle is based on the use of artificial neural network algorithms on the basis of the operation of the base period land use data and the data of each driving factor, to estimate the probability of the development of each class in the region, and then the development probability is combined with the domain influence factor, adaptive inertia coefficient, and the cost of conversion to derive the overall probability of conversion of the metacellular. The simulation results are fi- nally derived after a roulette wheel competition mechanism. The principles of neural network-based suitability probabil- ity calculation and adaptive inertia competition mechanism will not be elaborated in detail in this paper, with specific reference to the literature (Liu et al. 2017). In the validation process, we employed the Kappa coefficient, also known as Cohen's Kappa, which is a crucial indicator for measuring the consistency of classification results. It reflects the degree of similarity between the model's simulation results and actual observed data. A Kappa coefficient value closer to 1 indicates a higher level of consistency between the model's simulation results and the actual observed data. In this paper, the INVEST model was used to quantitatively esti- mate the HQ, WY, CS, and NDR in Henan Province. Since there have been many related studies describing the specific princi- ples and calculation methods of the above functions, this paper will not elaborate on them in detail, and the specific principles can be found in the user manual of the INVEST model (Sharp et al. 2020). HQ was assessed using the HQ module in the INVEST model, which reflects the impacts caused by human activities on the environment, and the greater the intensity of human activ- ities, the greater the threat to the habitat. In this paper, we refer to relevant studies (Wang et al. 2022) to select arable land, built-up land and unused land as stressors, and define woodland, grassland and water as habitats, and refer to the InVEST model user manual and relevant studies (Zhang, Li, et al. 2022) to determine various parameters of the model. The water production service was calculated using the INVEST water production module, which is based on the principle of water balance, subtracting the actual evapotranspiration from the precipitation of each raster to obtain the water production of that raster (Hu et al. 2020). The annual precipitation was adopted as the average value of precipitation from 2000 to 2050, and the parameters of the bio coefficient table were set according to the relevant references (Yang et al. 2020). The Z value is a seasonal factor characterizing rainfall, and after several simulations, it is found that the accuracy of the model is higher when the Z value is taken as 11.4, and the simula- tion results are closest to the total water resources of Henan Province in the 2020 Government Water Resources Bulletin, which is 699. 95 billion m, with a relative error of 0.06%. The CS service was calculated using the carbon stock module of the InVEST model, and the average carbon densities of the different land classes were referred to related studies (Yang et al. 2021; Fan et al. 2023). NDR services were calculated using the “NDR” module of the INVEST model, with the pa- rameters required by the model referenced to research settings in similar study areas (Zhang et al. 2022, Wang et al. 2022). The module first determines the number of pollutants re- tained in each grid in the watershed, and then calculates the total and average pollution loads in the watershed, with the lower the nitrogen output, the higher the water purification service (Cong et al. 2020).",
    "To reflect and quantify the total impacts of multiple ESs, this paper constructs a composite ecosystem services index (CES; Laterra et al. 2012; Wen et al. 2018). In many studies (Pan et al. 2013; Wu et al. 2017), all ESs are given equal weights, but in reality, the importance of different ecosystem service functions is different. Drawing on previous research (Niu et al. 2022), this paper uses the hierarchical analysis method (APH) to construct a CES for comparing the overall level of multiple ESs under different scenarios. The index can spatially reflect the overall condition of urban ecosystems and provide a reference for the government to formulate urban planning policies. The formula for calculating the CES is as follows: asuaor] suoumuo3 danas aiquoydde ayy Aq pousaro# are sajonae YO fasn Jo Sajna so} Arwaqr] auTTUG £9]1,\\\\ Ho (suON PPUOS-puR-suLID} HOD kay AL’AseaquoUTTUO//:sdhy) SuOLPUOD CES, is the comprehensive ecosystem service index in year j, w; is the weight of the ith ecosystem service, Sj is the normalized value of the ith ecosystem service in year j, and n is the number of ecosystem service species. In this paper, a two-by-two comparison of the elements in the impact and indicator layers was used to construct the judgment matrix, and four methods, namely, geometric mean, arithmetic mean, eigenvector, and least squares, were chosen to calculate the weights, and the average of all the calculation methods was taken as the final weights. Table 2 shows the weights of each type of ecosystem service determined by AHP. Land use change serves as a critical factor influencing ecological environments and their interactions, while the inverse relation- ship between land use intensity dynamics and spatial expan- sion positions it as a pivotal sustainability concern (Erb 2012). Through the application of land use intensity quantification methods—following the methodology of Liu et al. (2019)—we modified the land use intensity classification index (Table 3) to reflect the observed dominance of forestland over grassland cov- erage in the study area. The specific computational formula can be found in the cited reference. In this study, a factor detector was used to detect the extent to which the independent variable X (driver) explains the de- pendent variable Y (CES) (Wang and Xu 2017), to explore the drivers of changes in ecosystem service trade-offs and synergistic relationships in terms of both natural and trans- port locations, which were calculated using the following equation: In this study, the Geo SOS-FLUS model is used to simulate the land use distribution in 2020 based on the current land use map of Henan Province in 2010. After that, the simulated land use distribution in 2020 was compared with the real land use distribution in 2020 (Figure 2). In order to verify the accuracy of the simulation results, the Kappa coefficient was calculated, and the results showed that the average coefficient was 0.94, and the Kappa coefficient was 0.89 (>0.75), which indicated that the FLUS model has a better simulation ability, and it can provide future land use data for Henan Province for the InVEST model. where L is the stratification of the variable, N, and N are the number of cells in stratum h and the whole region, o;, and o? are the variance in stratum h and the variance in the region, re- spectively, and SSW and SST are the sum of the intra-stratum variance and the total variance in the whole region, respec- tively. q is the explanatory power of the driving factors to the CES, with a range of values of [0,1], and the larger the value of q, the greater the degree of the driving factors’ contribution to the CES. In this paper, the global 0.25°x0.25° LUH2 dataset is used to determine the quantities of each land use type in Henan Province under two scenarios (SSP2-4.5, SSP5-8.5) in 2030, 2040, and 2050. Since changes in the number of water bodies are not predicted in the LUH2 dataset, this paper assumes that the number of water bodies under different SSP-RCP scenarios in 2050 remains the same as the number of water bodies in 2020. In addition, the area of five types of land in the LUH2 dataset, including cropland, forest land, grassland, construc- tion land, and unutilized land, is significantly different from its actual area. In order to avoid the errors caused by the future land use simulation, this paper uses the FLUS model to sim- ulate the future land use area of each type of land in LUH2 based on the actual land use data of the study area in 2020. The calibration process is as follows: first, replace the area of corresponding land types in LUH2 with the actual area of each land use type in 2020; then, calculate the proportion of changes in the five land use types from 2020 to 2030, 2040, and 2050 under different scenarios; finally, multiply the actual area of each land use type in 2020 by the proportion of changes in LUH2 to obtain the proportion of changes in 2030, 2040, and 2050, and finally, multiply the actual area of each land use type in 2020 by the proportion of changes in LUH2. Finally, by multiplying the actual area of each land use type in 2020 by the proportion of change of each land use type in LUH2, the pre- dicted area of each land use type in 2030, 2040, and 2050 can be obtained. Finally, the demand for each land use type under the two scenarios (SSP2-4.5 and SSP5-8.5) in Henan Province in 2030, 2040, and 2050 is shown in Table 4.",
    "Based on the land use data of Henan Province in 2000, 2010, and 2020, using ArcGIS software to analyze to get the transfer matrix of land use types in Henan Province in 2000-2010 and 2010-2020 (Tables 5 and 6), according to the data of the transfer matrix, the change in the area of six land use types in Henan Province can be found. Through the analysis, it was found that from 2000 to 2010, the area of forest land, water area and construction land in Henan Province increased by 1846.61 km? (1.11%), 506.27 km? (0.30%) and 31.61 km? (0.02%), while the area of arable land, grassland and unutilized land decreased by 1694.94 km?(1.01%), 621.35 km? (0.37%) and 68.19km? (0.04%), respectively, 621.35 km? (0.37%) and 68.19 km? (0.04%) respectively. From 2010 to 2020, the areas of grassland, water, construction land and unutilized land in Henan Province will increase by 5.04km? (0.003%), 282.30 km? (0.17%), 2747.34 km? (1.65%) and 6.05 km? (0.004%) respectively, and the areas of arable land and forest land will decrease by 2995.36 km? (1.79%) and 45.37km? (0.03%) respectively. As can be seen from Tables 5 and 6, the reduced cropland area has been primarily converted to construction land, which aligns with the actual urban expansion observed in Henan Province over the past two decades. The increased forestland area from 2000 to 2010 mainly originated from conversions of cropland and grass- land, primarily attributed to the implementation of the “Grain for Green Program” ecological restoration program. Conversely, the decrease in forestland area from 2010 to 2020 resulted from the “returning forestland to cropland” policy adjustments aimed at ensuring food security. Changes in unutilized land are com- plex and it is not possible to determine the main sources. In con- clusion, from 2000 to 2020, the area of waters and construction land in Henan Province increases, respectively by 788.56 km? (0.47%) and 4593.95km? (2.75%), and the area of cultivated land, forest land, grassland and unutilized land decreases, re- spectively by 4690.30 km? (2.81%), 13.76 km? (0.01%), 616.31 km? (0.37%), and 62.14 km? (0.04%) respectively. asuaor] suoUIILIO aAnRaID a]quoydde ayy £q pousoro# are sajanse YO ‘asn Jo sajna s0J Azeagry autUG Aaqt,A\\ UO (suORIPUOD-puP-suuIA} HOD\" Ao|LAW-AaeaquaUt|UO)/:sd)y) SUONIpUO uk sUD| ay3 99g ~[$Z0Z/T 1/90] HO AreIQLT aUNJUE AOIEA\\ “TLTTL°€299/ZOOI O1/lp/to9-Kajtav'KseaqrauN|UO//:sdny and increased by 77.27 t in 2050. In summary, 2030-2050 water production, HQ, and CS decreased by 29.31 10°m}, 0.026, and 6.44 10°t, and nitrogen output increased by 669.63 t. According to Table 7, water production, HQ, carbon stock, and nitrogen output in Henan Province in 2000 were 70.04 x 10°m°, 0.376, 16.06 x 10°t, and 27.65 x 10°t, respectively. In 2010, water production, carbon stock, and nitrogen output decreased by 18.93 x 109m, 8.71 10°t, and 545.35t, respectively, while HQ increased from 0.376 to 0.380. In 2020, carbon stocks decreased by 10.69 x 10°t, water production and nitrogen output increased by 18.01x10°m> and 58.38t, and HQ increased from 0.380 to 0.396. Under the SSP2-4.5 scenario, water production, HQ, and CS decrease each year from 2030 to 2050, and nitrogen export decreases and then increases. Under the SSP2-4.5 scenario, water production decreased by 6.44x10°, 19.28x10°, and 3.60 x 10° m3 from 2030 to 2050, HQ decreased by 0.021, 0.004, and 0.001 from 2030 to 2050, CS decreased by 2.95x 10°, 2.36 x 10°, and 1.13 x 10°t from 2030 to 2050, and nitrogen out- put decreased by 4.96t in 2030, increased by 597.35t in 2040, Under the SSP5-8.5 scenario, from 2030 to 2050, HQ and car- bon stocks decrease every year, water production increases every year, and nitrogen output increases, then decreases, then increases again. Under the SSP5-8.5 scenario, HQ decreases by 0.025, 0.001, and 0.004 from 2030 to 2050, and carbon stocks decrease by 5.84x10°, 1.25x10°, and 3.48x10°t from 2030 to 2050, and water production from 2030 to 2050 increased by 5.60X 109, 5.81Xx10°, and 6.07x10°m? from 2030 to 2050, and nitrogen output increased by 536.14t in 2030, decreased by 255.69t in 2040, and increased by 667.80t in 2050. In sum- mary, 2030-2050 HQ and carbon stocks decreased by 0.030 and 10.57X10°t, while water production and nitrogen output in- creased by 17.47 x 10°m3 and 948.24t. This study maps the spatial distribution pattern of ESs in 2000 and for 2010 and 2020 (Figure 3), and the spatial distribution are sajanse YO ‘asn Jo sajna s0J Azeagry autUG Aaqt,A\\ UO (suORIPUOD-puP-suuIA} HOD\" Ao|LAW-AaeaquaUt|UO)/:sd)y) SUONIpUO uk sUD| ay3 99g ~[$Z0Z/T 1/90] HO AreIQLT aUNJUE AOIEA\\ “TLTTL°€299/ZOOI O1/lp/to9-Kajtav'KseaqrauN|UO//:sdny wos, papwoUMo “E “SZOZ *SSLLSHOT pattern of ESs in 2020 and for changes from 2030 to 2050 under the two future scenarios (Figures 4 and 5). The results of the study showed that the spatial distribution patterns of HQ and CS in Henan Province were relatively similar, with high values distributed in the western, northwestern, and southwestern regions with high vegetation cover, low values distributed in densely populated urban areas, and CS in cropland at an inter- mediate level, and the high-value areas of the two ESs were all regions with high vegetation cover. The spatial distribution pat- tern of water output is related to precipitation, with high values mainly distributed in the southern and western regions, and low values mainly distributed in the plains in the north. The low values of nitrogen output are mainly distributed in the western, northwestern, and southwestern mountainous areas, which are basically the same as the distribution of woodland and grass- land, while the high values are mainly distributed in the south- western and southeastern plains areas where cultivated land is concentrated.",
    "From 2000 to 2020, HQ and carbon stocks were most severely degraded around urban centers, while degradation of varying degrees also existed around many mountain ranges in Henan Province, especially along Song mountain. This was due to the massive expansion of urban land use and rural settlements en- croaching on cropland, woodland, and grassland, resulting in a significant decline in HQ and carbon stock. Water production asuaory suoumMo3 danas aiquoydde ayy Aq pousaro# axe sajonae YO fash Jo Sapna soy Arwaqry] aULIUG K9]1,\\\\ Uo (suONPUOD-puR-suLID} HOD 9] AL’AIIQHT and nitrogen output, on the other hand, showed an increasing trend in the southeast and a decreasing trend in the center and north, both of which were more related to the distribution of precipitation. Continued degradation of HQ and carbon stocks under the SSP2-4.5 scenario 2030-2050, with water produc- tion decreasing each year and nitrogen output decreasing and then increasing, with most of the decrease occurring around cropland. In 2030-2050 under the SSP5-8.5 scenario, the deg- radation of HQ, carbon stocks, and water purification increased compared to the SSP2-4.5 scenario, except for water production, which increased every year. Geoprobes were used to explore the explanatory power of each factor on the differences in the spatial distribution of CES, and the results of single-factor probes are shown in Table 8, and the results of interactive probes of each factor are shown in Figure 6. Where X1, X2, ..., X10 represent the gross domestic product asuaory suoumMo3 danas aiquoydde ayy Aq pousaro# axe sajonae YO fash Jo Sapna soy Arwaqry] aULIUG K9]1,\\\\ Uo (suONPUOD-puR-suLID} HOD 9] AL’AIIQHT (GDP), normalized difference vegetation index (NDVI), night light data, population density, temperature, oxygen content of soil root, optimum soil tilth, soil salt salinity, soil type, and land use intensity as the 10 driving factors. As indicated in Table 8, the p-values for all factors are 0, suggest- ing that each factor has a significant explanatory power. The q- value for soil type is the highest at 0.436, indicating that soil type has the strongest explanatory power for the spatial distribution differences of CES. Optimum soil tilth and soil salt salinity have the weakest explanatory power for the spatial distribution dif- ferences of CES, with q-values of 0.007 and 0.003, respectively. The influence of each factor, in descending order, is as follows: soil type>population density>GDP>temperature>land use intensity>NDVI>Night light data>Oxygen content of soil root > optimum soil tilth > soil salt salinity. Figure 6 reveals that after interacting with each other, all influencing factors significantly enhance the impact on the spatial distribution differences of CES in the study area. The interaction between factors shows effects of bilinear enhance- ment and nonlinear enhancement, without any instances of mutual independence or weakening. Notably, the interaction between soil type and temperature is the strongest, followed by the interaction between soil type and GDP. The maximum value of soil typenTemperature (aspect, q=0.529) indicates that the interaction of soil type and Temperature exhibits stronger explanatory power. Considering the results of single- factor detection, the spatial heterogeneity of CES in Henan Province is the result of the interaction and enhancement of multiple factors, rather than the result of the independent ac- tion of a single factor. Combining the results of single-factor detection, the spatial heterogeneity of CES in Henan Province is the outcome of the interaction and enhancement of multiple factors, rather than the result of the independent action of a single factor. The average value of CES can reflect the overall supply status of ESs, and the average values of CES in Henan Province in 2000, 2010, and 2020 were 0.569, 0.544 (decreased by 4.53%) and 0.553 (increased by 1.65%), respectively, which showed a decreasing and then increasing trend. The 2030, 2040, and 2050 CES aver- ages under the SSP2-4.5 scenario are 0.543 (down 1.47%), 0.533 (down 1.82%), and 0.529 (down 0.74%), respectively, showing a continuing downward trend. The 2030, 2040, and 2050 CES averages under the SSP5-8.5 scenario are 0.551 (up by 4.13%), 0.563 (up by 2.23%) and 0.550 (down by 2.33%), showing an in- creasing and then decreasing trend. From the magnitude of the mean CES values for 2030-2050 under the two different sce- narios, it can be judged that the mean CES values are larger in the SSP5-8.5 scenario. This indicates that the SSP5-8.5 scenario is more suitable for the future development of Henan Province than the SSP2-4.5 scenario.",
    "The average annual changes in CES from 2000 to 2050 in each city of Henan Province are shown in Table 9, while the percentage changes in the average CES in each city under different scenarios are shown in Figures 7 and 8. The above graphs and tables show that Luoyang, Sanmenxia, Nanyang, Xinyang, and Jiyuan had higher CES mean values, and wood- land and grassland were mainly distributed in these cities. On the other hand, Zhengzhou, Kaifeng, Puyang, Xuchang, Luohe, Shangqiu, and Zhoukou had lower forest and grass- land cover and lower CES mean values. In 2030-2050 under the SSP2-4.5 scenario, except for the seven cities of Luoyang, Pingdingshan, Sanmenxia, Nanyang, Xinyang, Zhumadian, and Jiyuan, the CES averages of the rest of the cities in the last three decades generally show a downward and then up- ward trend, with Puyang City showing the greatest increase. In 2030-2050 under the SSP5-8.5 scenario, only Luoyang, X1 X2 X3 X4 X5 X6 X7 X8 X9 0.263 0.067 0.057 0.328 0.238 0.023 0.007 0.003 0.436 0.000 0.000 0.000 0.000 0.000 0.000 0.000 0.000 0.000 Xl X2 X3 x4 X5 X6 X7 X8 x9 X10 X1 X2 X3 X4 X5 X6 X7 X8 x9 X10 435] 034i] 0.328] asuaor] suoUIILIO aAnRaID a]quoydde ayy £q pousoro# are sajanse YO ‘asn Jo sajna s0J Azeagry autUG Aaqt,A\\ UO (suORIPUOD-puP-suuIA} HOD\" Ao|LAW-AaeaquaUt|UO)/:sd)y) SUONIpUO uk Pingdingshan, Sanmenxia, and Nanyang CES averages co- incide with the overall changes in Henan Province, while Kaifeng, Luohe, Shangqiu, and Zhoukou CES averages first decrease and then increase, and CES averages in all other mu- nicipalities first decrease, then increase, and then decrease. Sanmenxia and Nanyang have the largest decreases among all the cities. The results of the study (Figure 9) show that the CES of urban land, rural settlements, and other construction land in the urban cen- ters of each city is low, while the CES of forest land and grassland in the Furniu Mountain and Dabie Mountain regions is high. In asuaor] suoUIILIO aAnRaID a]quoydde ayy £q pousoro# are sajanse YO ‘asn Jo sajna s0J Azeagry autUG Aaqt,A\\ UO (suORIPUOD-puP-suuIA} HOD\" Ao|LAW-AaeaquaUt|UO)/:sd)y) SUONIpUO uk sUD| ay3 99g ~[$Z0Z/T 1/90] HO AreIQLT aUNJUE AOIEA\\ “TLTTL°€299/ZOOI order to more clearly reflect the spatial changes of CES under dif- ferent scenarios in Henan Province, the CES distribution maps be- fore and after the two periods were subjected to raster subtraction, and the change values between +0.001 were defined as basically unchanged areas (Leh et al. 2013), and the change values were classified into seven levels by combining with the natural break- point method: severe decline (< —0.30), moderate decline (—0.30 to 0.15), mild decline (—0.15 to 0.001), essentially unchanged (—0.001 to 0.001), mildly increasing (0.001 to 0.12), moderately increasing (0.12 to 0.24), and substantially increasing (> 0.24). The overall 2030-2050 share of area change in CES class for each city is shown in Figure 10. Under the SSP2-4.5 scenario, Zhumadian City has the highest ratio of the area of severely declining CES regions, accounting for 0.57% of the overall CES change in Zhumadian City. Xinxiang City has the highest ratio of the area of CES moderately declining areas, accounting for 54.41% of the overall CES change in Xinxiang City. Luohe and Zhoukou CES mildly declining areas accounted for more than 97% of the ratio value. Hebi City has the highest percentage of CES mildly increasing area, accounting for 54.02% of the overall CES change in Hebi City. Jiyuan City has the highest percent- age of CES moderate increase area, accounting for 1.19% of the overall CES change in Jiyuan City. Xinyang City has the highest percentage of CES substantially increasing area, accounting for 0.34% of the overall CES change in Xinyang City. In 2030-2050 under the SSP2-4.5 scenario, the overall CES decreasing area is the largest, accounting for 85.38% of the total area, and the area of the CES rising area accounts for 11.40% of the total area, and the CES rising area is mainly located in the areas of Anyang, Hebi, and Puyang City, and the main reason for the rise is the expansion of woodland and grassland. mildly decreasing area, accounting for 56.30% of the overall CES change in Nanyang City. Shangqiu City has the highest percent- age of CES mildly increasing area, accounting for 93.21% of the overall CES change in Shangqiu City. Jiyuan City has the high- est percentage of CES moderate increase area, accounting for 1.08% of the overall CES change in Jiyuan City. Xinyang City has the highest percentage of CES substantially increasing area, accounting for 1.04% of the overall CES change in Xinyang City. Under the SSP5-8.5 scenario, the overall CES increases the most, accounting for 61.28% of the total area, and the CES decreases the most, accounting for 33.65% of the total area. The CES de- creases are mainly in the areas with more forest and grassland resources, and the main reason for the decreases is the expan- sion of urban land and rural settlements.",
    "In this study, the InVEST model was used to calculate four ESs for Henan Province: annual WY, HQ, CS, and nitrogen export. Since the model validation for WY in Henan Province has al- ready been described in Section 3.3, it will not be repeated here. Additionally, the results of HQ are greatly influenced by threat sources, and different researchers may use different threat source data. Therefore, we compare the results of CS and nitro- gen export with existing research findings to further validate the accuracy of the model. Figure 10 shows that under the SSP5-8.5 scenario, Xinyang City has the highest ratio of the area of severely declining CES re- gions, accounting for 1.76% of the overall CES change in Xinyang City. Jiyuan City has the highest percentage of CES moderately declining area, accounting for 2.86% of the overall CES change in Jiyuan City. Nanyang City has the highest percentage of CES In previous studies, Fan et al. (2023) reported total CS of 59.42 x 10°, 58.62 10°, and 57.54x10%t for the years 2000, 2010, and 2020, respectively; Wang et al. (2024) found total CS of 21.95x10® and 21.07x10°t for 2010 and 2020. Tao et al. (2021) used the export coefficient method to simulate non-point source pollution in the Yellow River basin, obtain- ing total nitrogen exports of 9.93 x 10+ and 4.08 x 10*t/a for Henan Province in 2006 and 2017, respectively. Comparing juoy/:sdny Woy papeorumod “€ ‘SZOT “SSLLS HOT. juo//:sdniy) suorpuo 5 pur sud, 947 29g -[$Z0Z/T1/90] HO AreIqL aUI]UE AAIEA\\ “TLL TL°€299/ZOOI O1/10P/to9:KajEav'Aseagy| these results with the present study, the estimated values of CS and nitrogen export are consistent in order of magnitude but differ in specific values, which may be attributed to differ- ences in data sources, study periods, and simulation precision among the various models used. Based on the map of land use type changes in Henan Province from 2000 to 2020 (Figure 11), combined with the changes in ecological service functions and CES in Henan Province from 2000 to 2020 summarized in the previous analysis, it can be con- cluded that the increase in construction land use will lead to the destruction of carbon stocks and HQ, which will affect the de- cline of CES (Li, Ye, et al. 2021, Li, Ling, et al. 2021). Meanwhile, it was found that the increase in the area of built-up land did not necessarily reduce the value of ESs, and although the area of built-up land in Henan Province increased year by year from 2000 to 2020, the average value of CES in 2020 increased by 1.65% compared with that in 2010. This may be due to the effect of the increase in grassland area in 2020 or the effect of other factors on the ecosystem service function, which needs to be an- alyzed in further research. Meanwhile, overlaying the CES changes with land use changes and ecosystem service function changes, it was found that the severe decline of CES in the SSP2-4.5 scenario oc- curred mainly in the areas where forest land and arable land were encroached upon by the construction land, which caused the simultaneous decline of HQ, CS, water production, and water purification capacity, and the moderate decline of CES occurred mainly in the areas where grassland was encroached upon by the construction land, which caused the simultane- ous decline of water production, HQ, CS, and water purifica- tion capacity. The moderate decline in CES occurred mainly in areas where grassland was encroached upon by construc- tion land, causing a simultaneous decline in water quantity, HQ, CS, and water purification capacity, while the mild de- cline in CES accounted for the largest proportion of the declin- ing areas, mainly due to the decline in HQ of the encroached Under the SSP5-8.5 scenario, there are very few areas of severe and moderate decline in CES, and the areas of mild decline are dominated by simultaneous declines in WY, CS, and HQ, with the largest area of cropland encroached by rural settlements. The area of CES rise is the largest, with mild rise dominated by increases in HQ and WY, and the conversion of land type is mainly from grassland to woodland. The areas of moderate rise are the second largest, with the largest area of moderate rise mainly due to the conversion of cropland to woodland. The area of moderate rise is the second largest, mainly due to the conver- sion of grassland to woodland. The second largest area of CES is the area of moderate increase, which mainly occurs in the area of returning farmland to forest, and the area of large increase in asuoar] suowuo3 aatwosy aiquar{dde ayy q pousaro# axe sajonsze YO 9sn Jo sajna 10} AreIqr] aUI|UG AojtA\\ UO (suON PUOD-PuE-suUID}/AUOD' Kaj LAv:KswIQhy CES is dominated by the increase in HQ and carbon stock ser- vice, which mainly occurs in the area of converting constructed land to forest land and grassland.",
    "The present study investigates the spatiotemporal changes in ESs from the perspective of land use, and the findings align with existing research. CS, heavily influenced by land use, is primarily affected by changes in forest, cropland, and grassland, consistent with Zhang et al.'s (2024) research. The significant expansion of construction land, leading to the degradation of HQ, parallels Zhao et al.'s (2024) findings. Although Anhui and Henan are different regions, both are major agricultural provinces in China with similar patterns of urban expansion, resulting in similar research outcomes. WY and nitrogen export are influenced by land use type changes, but according to Hu et al. (2022) and Li et al. (2020), both are more significantly affected by precipitation. The change in CES under the SSP2-4.5 scenario may be due to the dual im- pact of decreasing annual precipitation and land use changes. The change in CES under the SSP5-8.5 scenario could be at- tributed to the conversion of cropland, forest, and grassland into construction land, causing losses in CS and HQ, thereby leading to changes in CES. In response to the changing ecosystem service functions in different cities of Henan Province under various scenar- ios, we propose the following recommendations. Under the SSP2-4.5 scenario, where the overall average CES in Henan Province shows a declining trend, it is crucial to be vigilant against the risks associated with the deterioration of ecosys- tem functions. Appropriate policies should be formulated for different cities based on local conditions. For cities like Luoyang, Pingdingshan, Sanmenxia, Nanyang, Xinyang, Zhumadian, and Jiyuan, where CES is expected to continue declining, special attention should be given to the impacts of climate change on land use structures. Efforts should be made to protect and restore ecologically vulnerable areas. For cities experiencing fluctuations in CES, it is important to focus on the coordinated development of ecological functions across regions and formulate comprehensive ecological stability pol- icies to ensure the healthy and stable development of regional ecosystems. Under the SSP5-8.5 scenario, for cities like Kaifeng, Luohe, Shangqiu, and Zhoukou, where CES changes are inconsistent with the overall CES trend of Henan Province, it is necessary to be alert to sudden ecological disasters caused by unexpected factors. Emergency response measures should be developed to prevent the destruction of ecosystem functions. For other cities in this scenario, it is recommended to implement key ecological protection and restoration projects. Priority should be given to the ecological restoration of degraded wetlands and areas with sparse vegetation, enhancing their water purification and car- bon sequestration functions. Strict control should be exercised over agricultural and industrial pollution sources to reduce the entry of pollutants into wetlands, ensuring the effectiveness of ecological restoration. The present study has some limitations. First, in terms of land use prediction, this study is based on the findings of previous research, which may introduce some degree of lag (Schirpke et al. 2020). Second, while this research investigates the impact of land use change on multiple ESs, data limita- tions restricted the selection to only four ESs. Additionally, the influence of land use change on WY and nitrogen export is confounded by the effects of precipitation, making it dif- ficult to isolate the impact of land use change on these two variables (Ding et al. 2021). Future research aims to address these limitations by incorporating regional-specific condi- tions and studying other ESs such as food production, soil and water conservation, and cultural services (Cybéle et al. 2024) in Henan Province. This will allow for a more comprehensive and integrated assessment of the effects of land use change on a diverse range of ESs. In this paper, the land use types of Henan Province in 2030, 2040, and 2050 under two different climate scenarios were simulated by using the FLUS model combined with the LUH2 dataset. After that, the ecosystem service functions of four modules, namely water production, CS, HQ, and water purifi- cation, were calculated using the INVEST model, and the CES was constructed. Finally, the temporal and spatial changes of each ecosystem service function and CES were analyzed, and the conclusions are as follows: increases are observed in Henan Province. However, the average CES in 2050 is still lower than that in 2020, indi- cating the necessity for government intervention in urban development before 2050 to ensure the sustainable man- agement of ESs.",
    "Jincai Zhang: conceptualization (equal), writing - original draft (lead), writing - review and editing (lead). Ling Li: data curation (equal), formal analysis (equal), resources (equal). Qingsong Li: data curation (equal), formal analysis (equal), supervision (equal). Weiqiang Chen: investigation (equal), project administration (equal). Junchang Huang: validation (equal), visualization (equal). Yulong Guo: soft- ware (equal), validation (equal). Guangxing Ji: formal analysis (lead), funding acquisition (equal), methodology (lead). We thank Meng, Li, and Lei, Li for providing us the network datasets. This research was funded by the Key project of the Joint Fund for sci- ence and Technology Research and Development Programs in Henan Province (225200810045), and the special fund for top talents in Henan Agricultural University (30501031). The data that support the findings of this study are openly available in the Earth Resources Data Cloud (http://www.gis5g.com/home), OpenStreetMap (https://download.geofabrik.de/), National Geographic Information Resources Catalog Service System (https://www.webmap. cn/), Resource and Environmental Science Data Platform (https:// www.resde.cn/), the World Soil Database (HWSD) (http://webar chive.iiasa.ac.at/Research/LUC/External-World-soil-database/), the Scenario Model Comparison Program of CMIP6 (https://pcmdi.llInI. gov/CMIP6/) and the global 0.25°x0.25° Land Use Harmonization 2 (LUH2) dataset (https://luh.umd.edu/)."
]