[
    "Abstract: It is of great theoretical and practical significance to explore the impact of land use change on carbon storage and the driving factors of spatial differentiation of carbon storage in Henan Province based on the strategic goal of \"dual carbon\". Taking Henan Province as an example, nearly 30 studies were conducted using the InVEST model and geographic detectors. The response of annual carbon stock to land use change and its spatial differentiation driven, and the potential impact index (PI) was used to evaluate the vulnerability of ecological carbon storage services in this region. (1) In the past 30 years, the land use of Henan Province has undergone significant changes, with the cultivated land area decreasing by 11323.5 km2 and the construction land increasing11136.1 km2, the transfer of cultivated land to construction land is the main type of land use transfer. (2) From 1990 to 2020, the carbon storage in Henan Province decreased by 0.127×109t. The decrease of cultivated land and the increase of construction land are the leading factors for the reduction of carbon stocks. Spatially, the spatial distribution characteristics are high in the western and southern margins, and relatively low in the central, northern and eastern regions. (3) The spatial differentiation of carbon storage in Henan Province was affected by a variety of factors, among which the influence of a single factor on the medium slope factor (explanatory power of 0.36) was the most significant. Among the multi-factor interactions, the interaction between night light (x9) and slope (x6) has the largest explanatory power, reaching 0.43. (4) The overall PI index of each stage in Henan Province showed that the ecosystem carbon storage services had a negative impact, showing a trend of first weakening and then increasing. There are spatial differences in the vulnerability between cities, with the distribution characteristics of high in the south and low in the north, and the vulnerability of 55% of the cities has increased in 30 years. The transfer of cultivated land and the expansion of construction land in Henan Province have a significant impact on carbon storage and carbon storage service vulnerability, and the rational allocation of construction land and cultivated land should be paid attention to in the future. degradation, a cascade of climate-related issues, including acid rain pollution and the intensifying greenhouse effect, has been set in motion [1]. Ecosystem carbon storage, a pivotal indicator of ecological health and stability, emerges as a vital mechanism capable of mitigating atmospheric CO2 concentrations, thereby alleviating the greenhouse effect, curbing the pace of global warming, and sustaining regional carbon equilibrium [2,3]. Among the myriad factors influencing ecosystem carbon cycles, land use change stands out as a core determinant [4]. This phenomenon exerts a direct impact on both above-ground and below-ground vegetation carbon storage, while also reshaping soil types and environments, thereby influencing soil carbon storage dynamics. In response, the effective understanding and exploration of the extent and mechanisms by which land use change affects ecosystem carbon storage capacity have become integral to contemporary climate change research [5,6]. China, as a major contributor to global car-bon stocks, plays a crucial role in maintaining the balance between global carbon sinks and sources [7]. In a landmark declaration at the United Nations General Assembly in 2020, China committed to peaking carbon emissions by 2030 and achieving carbon neutrality by 2060, with these ambitious targets and plans for carbon emission peaking and neutralization subsequently embedded in the 14th Five-Year Plan. Against this backdrop, conducting research on regional ecosystem carbon storage assumes para-mount importance, as it holds the potential to enhance national and regional carbon sequestration capacities and foster a trajectory of green, low-carbon development. At present, a large number of studies have been carried out at home and abroad on the assessment of ecosystem carbon storage and its response to land use change, and there are two main research methods: field investigation method and ecological remote sensing model method [8]. In the early stage of research, due to the immaturity of technology and lack of equipment, the assessment of ecosystem carbon storage mainly used field survey method, although field survey method can improve the accuracy of data, but its representativeness in spatial coverage is limited, and due to the high cost, it is difficult to quantify space [9]. Therefore, with the development of science and technology and the progress of technology, scholars have gradually used ecological remote sensing model method to assess carbon storage. Nowadays, the most commonly used carbon stock assessment models include the CEVSA model, the CASA model, and the InVEST model. Among them, the InVEST model has shown significant advantages due to its small number of required parameters, simple operation process, efficient operation speed and intuitive evaluation result display, and has been widely used by scholars at home and abroad. Li et al.[10] evaluated carbon storage in karst area in central Guizhou based on the InVEST model, and analyzed the characteristics of carbon storage change under the background of construction land expansion. Zhu et al.[11] evaluated the spatial and temporal changes of carbon storage in wetlands in the Guang-dong-Hong Kong-Macao Greater Bay Area based on the InVEST model. Tian et al.[12] evaluated carbon storage in the Tarim River Basin from 1990 to 2020 based on the In-VEST model. and analyze the impact of land use change on carbon stocks. Zhuo et al.[13] evaluated carbon storage in Wuhan based on the InVEST model and simulated the temporal and spatial variation of carbon storage under different scenarios. In addition, organizations such as GLP, IPCC, and UNEP have proposed studies on the vulnerability of human-ecosystems from the perspective of climate change [14]. At home and abroad, the research on ecosystem vulnerability mainly focuses on the value of ecosystem services [15], and there are few studies on the vulnerability of ecosystem ser-vices. Ecosystem service vulnerability refers to the fact that ecosystems show a lack of ability to adapt to external disturbances, resulting in changes in their service functions and characteristics [16]. As an important part of ecosystem services, the study of carbon storage services and their changes and vulnerabilities has scientific guiding significance for effectively mitigating the loss and degradation of ecosystem services.",
    "Land use change is one of the main factors causing carbon stock change, which has become a consensus among a wide range of scholars [17]. However, most of the cur-rent studies focus on coastal zones [18], watersheds [19], and wetlands [20]. As the key to the development of the Central Plains, Henan Province is also a major grain-producing province in China, so it is necessary to pay special attention to the protection of eco-system carbon storage. Therefore, this study took Henan Province as the research object, based on the land use data of seven periods from 1990 to 2020, and used In- VEST and ArcGIS to evaluate ecosystem carbon storage and analyze the impact of land use change on carbon storage. With the help of geographic detectors, the spatial differentiation driven analysis of carbon storage was carried out, and the vulnerability of carbon storage at the provincial and municipal scales was analyzed by using the potential impact index, in order to provide a scientific and effective reference for regional territorial spatial planning and sustainable development of ecosystems. Henan Province is located in the central plain area of China(110°21'~116°39′E, 31°23'~36°22'N), it is bordered by Anhui and Shandong in the east, Hebei and Shanxi in the north, Shaanxi in the west, and Hubei in the south. The total area of the province is 167,000 square kilometers, accounting for 1.73% of the total area of the country. The terrain is high in the west and low in the east, Taihang Mountain, Funiu Mountain, Tongbai Mountain and Dabie Mountain are distributed in a semi-circular along the provincial boundary in the north, west and south, the central and eastern parts are the Huanghuaihai alluvial plain, and the southwest is the Nanyang Basin. Plains basins and mountains and hills accounted for 55.7% and 44.3% of the total area, respectively. This is shown in Figure 1. In 2022, the GDP of Henan Province will be about 6.13 trillion yuan, accounting for 5.06% of the national GDP, and the annual per capita GDP will reach 62,100 yuan. In 2022, the permanent population of Henan Province will reach about 98.72 million, of which 56.33 million will be urban residents. The permanent population of rural areas is 42.39 million. The data used in this paper include land use data, natural condition data, transportation network data and socio- economic data of the Central Plains urban agglomeration. (1) The land use data of Henan Province is derived from the CLCD dataset of the Earth Resources Data Cloud (http://www.gis5g.com), which classifies nine categories: cultivated land, forest land, shrub, grassland, water body, ice and snow, bare soil, construction land and wetland. The spatial resolution is 30m×30m. (2) The natural condition data includes DEM data, slope data, etc., and the DEM data comes from the geospatial data cloud (https://www.gscloud.cn) , the slope data is calculated from the DEM data by the ArcGIS Slope module. (3) Location condition data includes road data. Data from OpenStreetMap (https://www.openstreetmaporg(4) Socio-economic data include GDP data, population data, POI data and night light data. The GDP data and population data are from the Resource and Environmental Science Data Center(http://www.resdc.cn) of the Chinese Academy of Sciences. Nighttime light data from the National Geophysical Data Center. InVEST (Integrated valuation of ecosystem services and trade-offs) model is widely used in environmental assessment, which includes multiple modules such as carbon stocks, habitat quality, and soil and water conservation [21]. In this paper, the carbon storage module of InVEST model version 3.14.0 is used to calculate the carbon storage in Henan Province, which divides the carbon storage into above-ground organisms. There are four basic carbon pools: carbon, below- ground biocarbon, soil, and dead organic carbon [22]. According to the land use classification, the average carbon density of different land types was counted and calculated, and then the area of each type was multiplied by the corresponding carbon density, and the sum was the total carbon amount (Ctotal) of the study area. It is calculated as follows: where Ci, above, Ci, below, Ci, soi and Ci, dead are terrestrial creatures of type i, respectively carbon density, below ground biocarbon density, soil carbon density, and dead organic carbon density, where C is the total carbon density of land group i, Ai is the area of land type i, n is the number of land types, and Ctotal is the total carbon storage The carbon density data of this study were obtained according to Xu et al. [23] Chen et al. [24] Li Kerang et al.[25] and 2010 The carbon density dataset of terrestrial ecosystems in China obtains the carbon density data of the whole country and corrects it on the basis of the data again. For the correction of precipitation and air temperature, the formula proposed by ALAM et al.[26] was used to correct the precipitation and carbon density. The modified formula of temperature and carbon density proposed by Chen et al.[27] and GIARDINA et al.[28] was adopted. The comprehensive correction formula is as follows: Where: Csp is the carbon density (t/hm2) obtained from the average rainfall; CBP, C BT is the vegetation carbon density (t/hm2) obtained according to the average rainfall and average temperature, respectively; MAP and MAT mean precipitation (mm) and mean temperature(°C), respectively. The annual average temperature values of Henan Province and the whole country were determined to be 15 °C and 9.89 °C, respective- ely, and the average precipitation was determined to be 636.4mm, 719.5mm, substituting the above formula, the ratio of the two is the carbon density correction coefficient of Henan Province.",
    "Where: KBP and KBT are the correction coefficients of vegetation carbon density obtained by precipitation factor and temperature factor, respectively, and are the KB correction coefficients of biological carbon density. KS is the correction factor for soil carbon density. Multiplying the carbon density correction coefficient with the national carbon density value is the carbon density data of Henan Province. Compared with other carbon densities, the carbon density of dead organic matter is difficult to obtain and accounts for a relatively small proportion of the carbon pool, so it is not within the scope of research in this paper. The carbon density of different land types in Henan Province is shown in Table 1 Geographic detectors are used to identify and quantify the influencing factors that affect geographical phenomena by detecting the spatial distribution differences of geographical factors. The tool is mainly composed of four parts, namely: factor detection, risk detection, interaction detection and ecological detection. The formula for differentiation factor detection is as follows: where: L is the stratification of variables; Np is the number of samples in layer h; N is the total number of samples; of represents the variance of the dependent variable within layer h; o? Represents the total variance of the dependent variable within the study area. SST is the total variance within the study area; SSW is the sum of the variances within layer h. qis a key index to evaluate the effect of the independent variable X on the spatial distribution ofthe dependent variable Y, and its value range is within [0,1]. where: L represents the comprehensive index of land use intensity, D; represents the i level of land use intensity, and P; represents the area of the i level of land use Percentage. Referring to the research on land use by Wang et al.[32] and Liu et al.[33] the land use index is divided into four levels: 4 for settlement and 3 for cropland. 2 for forest, grassland and water, and | for unused land. AC It represents the change in carbon stock and the AL change in land use intensity index. In order to alleviate the rapid loss of carbon storage services, which is an important part of ecosystem services, it is necessary to carry out the vulnerability analysis of carbon storage services under regional land use change. For the first time, the IPCC report proposes a vulnerability representation to measure the degree to which a system is unable to deal with the adverse effects of climate change [29]. Subsequently, Schröter et al.[30] expanded on this to include the concept of vulnerability in land use change. Based on the above research and combined with the method proposed by Metzger [31] to quantify the vulnerability of land use change to ecosystems, this paper uses the Potential Impact Index (PI) to measure the vulnerability of services such as carbon storage in ecosystems to land use change. The specific calculation formula is as follows: This can be seen in Figure 2. The distribution of various categories in Henan Province is relatively stable, and there is no large-scale fluctuation. The area of the six types of land use is cropland, forest land, construction land, grassland, water area and unused land. Among them, cropland accounts for more than 65% of the total land area, mainly distributed in the southern, eastern and central plains of Henan Province. Forest and grassland are mainly distributed in the western part of Henan Province, located in high-altitude areas such as Sanmenxia City and Nanyang City. The settlement is scattered, radiating to Zhengzhou City, the capital of Henan Province, ac-counting for more than 7% of the total land area. The water area is mainly concentrated in the Yellow River, Danjiang Lake and Nanwan Lake, accounting for about 1% of the total land area. Finally, unused land is the smallest and even negligible type of land. From 1990 to 2020, it can be seen from Table 2. The largest fluctuation of land use change in Henan Province is cropland, which decreased from 120154.5km2 in 1990 to 108831.0km2 in 2020, showing a continuous decline trend, with a total reduction of 11323.5km2 in 30 years. The second is the settlement, which increased from 12325.4 km2 in 1990 to 23,461.4 km2 in 2020. It showed a continuous expansion trend, with a total increase of 11136.1km2 in 30 years. The second is forest, which showed a slow decline from 28,037.3 km2 in 1990 to 2000 between 1990 and 2000 27257.7km2 in 2000, a total decrease of 779.7 km2; From 2000 to 2020, there was a continuous expansion trend, increasing from 27257.7 km2 in 2000 to 29594.4km2 in 2020, an increase of 2336.7km2. From 1990 to 2020, although the grassland fluctuated, it showed an overall decreasing trend, from 3481.8km2 in 1990 decreased to 1895.1 km2 in 2020, a decrease of 1586.7km2; The water area did not change much, from 1801.4km2 in 1990 to 2056.5km2 in 2020, an increase of only 255.1km2. Finally, there is unused land, which is mainly bare land, showing a continuous attenuation trend. From 2010 to 2015, the changes of cropland and settlement were the most obvious, and the cropland decreased from 113073.7 km2 to 110076.6km2, a decrease of 2997km2, accounting for 26% of the total change from 1990 to 2020 ; The settlement increased from 19475.7km2 to 21865.7km2, an increase of 2389.9km2, accounting for 21% of the total change between 1990 and 2020.",
    "With the rapid economic development and urbanization, the land use structure of Henan Province has undergone drastic changes, as shown in Table 3, a total of 20304.98 km2 of land has been transformed in the past 30 years. It accounts for 12.3% of the total land use area. Among them, cropland is the main transferor of land use area transformation, accounting for 73.3% of the total transfer area, mainly converted to construction land. Construction land is the main transferee of land use area transformation, accounting for 56.1% of the total transfer area. Forest, water area and cropland were transformed into each other, and the overall change was not reached, while grassland changed to forest land and cultivated land in large quantities, transferring 997.38 km2 and 1126 km2, respectively. A large amount of unused land has been converted into cultivated land and construction land. Combined the carbon storage module of the InVEST model to calculate the carbon storage of Henan Province during the seven periods of 1990, 1995, 2000, 2005, 2010, 2015, and 2020, as shown in Figure 3 and Figure 4. The carbon storage in Henan Province in the study is respectively2.341×109t, 2.315×109t, 2.287×109t, 2.275×109t, 2.255×109t, 2.232×109t, 2.214×109t, the overall trend is decreasing year by year. Overall, the carbon storage in Henan Province decreased by 0.127×109t from 1990 to 2020, with an average annual decrease of 0.423×107t. Among them, the period from 1995 to 2000 was the period when carbon storage changed the most, with a total decrease of 2.841×107t. In terms of land use type, cropland contributed the most to carbon storage, accounting for 65.6% of the total area of the study area in 2020, and the carbon storage was 1.493×109t, accounting for 67.4% of the total carbon storage in the study area. This is followed by forest land, which accounts for 17.8% of the study area, and the carbon storage is 0.66×109t, accounting for 29.9% of the total carbon storage in the study area. Finally, settlement, grassland and water area account for 1.4%, 1.1% and 0.4% of the total car-bon storage in the study area, respectively. The proportion of unused land is too small to be ignored. According to the statistics of carbon storage changes and carbon storage distribution characteristics of 18 cities in Henan Province, as shown in Figure 5, the areas with high carbon storage are mainly located in the western region and the southern fringe areas, while the low-carbon storage areas are distributed in Zhengzhou City and its surrounding areas, and most of them are located in urban areas with frequent human activities. As shown in Figure 6, the total carbon storage of each city is ranked as follows: Nanyang City> Xinyang City> Luoyang City> Zhumadian City> Sanmenxia City> Zhoukou City> Shangqiu City> Pingdingshan City> Xinxiang City> Anyang City> Zhengzhou City> Kaifeng City> Xuchang City> Jiaozuo City> Puyang City> Luohe City> Jiyuan City> Hebi City. In the past 30 years, Sanmenxia City in Henan Province showed an increasing trend, with a total increase of 0.137×107t. The carbon storage in the remaining cities showed a downward trend, and the largest decrease in carbon storage was in Zhengzhou City, which decreased by 1.751×107t. The smallest decrease was in Jiyuan City, with a total decrease of 0.191×107t. According to the analysis, the change of land use types in Henan Province in the past 30 years will cause the corresponding temporal and spatial changes of carbon storage, and the contribution of different land types to carbon storage in the study area is cultivated land, forest land, grassland, construction land, water, and unused land. Among them, cultivated land is the main contributor to ecosystem carbon storage because it occupies the largest area in Henan Province. Forest land is not the main land use type in Henan Province, but it is a secondary contributor to ecosystem carbon storage because it has the highest carbon density value. As shown in Table 4, the reduction of cropland area led to the loss of carbon storage by 15.531×107t from 1990 to 2020. It is the main contributor to the loss of carbon storage in Henan Province, accounting for 87.9% of the carbon storage loss. The increase of forest area increased the carbon storage by 3.458×107t, which was the main contributor to the increase of carbon storage in Henan Province, accounting for 69.4% of the increase in carbon storage. Table 5 shows the details of the changes in carbon storage caused by land use change from 1990 to 2020, and the most obvious loss of carbon storage is the conversion of cropland to construction land, which has decreased in 30 years 13.868×107t, of which the loss of carbon storage reached the maximum in 2010-2015, during which the rapid economic development and the rapid expansion of construction land led to a large loss of cultivated land 2.974×107t reduction in carbon stocks. The second is the conversion of forest to cropland, and the most obvious loss is between 1990 and 1995. Conversely, the main contributor to the increase in carbon stocks over the 30-year period was the conversion of cropland to forest land, which increased by 4.918×107t over the 30-year period carbon stocks increased most significantly between 2000 and 2005, followed by 1.124×107t from 2010 to 2015, 1.096×107t carbon stocks. The substantial expansion of construction land and the gradual encroachment of ecological land such as cultivated land and forest land are the main factors for the loss of carbon storage in Henan Province.",
    "The influence of the driving factors on the spatial distribution of carbon storage in Henan Province was analyzed by using geographic detectors, and the single factor analysis results are shown in the figure, and the p values of the 10 driving factors are less than 0.001, which passes the significance test. It can accurately explain the changes in carbon storage in Henan Province. As shown in Figure 7, the degree of influence of factors on regional carbon storage is as follows: slope (x6), elevation (x2), and night light (x9), population density (x7), average annual temperature (x5), first-class road (x10), high-speed (x3), average annual rainfall (x4), GDP (x1) and water (x8). The explanatory power of slope (x6) and elevation (x2) is above 0.25, which is the main factor affecting the change of carbon storage in the region. The explanatory power of night light (x9), population density (x7), average annual temperature (x5) and first-class road (x10) were all above 0.15, which is a secondary impact factor. The remaining factors have little direct impact on the change of carbon stocks. The interaction between any factors is greater than that of a single factor on the change of carbon stock, showing a relationship between two-factor enhancement and nonlinear enhancement. This indicates that the change of carbon storage in Henan Province is affected by the multi-factor composite effect. Among them, the interaction between night light (x9) and slope (x6) has the largest explanatory power, which is 0.43. Therefore, the driving factor affecting the spatial distribution of carbon storage is not a simple linear superposition effect, but is affected by the multi-factor composite effect. In this paper, we will evaluate the vulnerability of ecosystem carbon storage services at two spatial scales: provincial and municipal. Firstly, the vulnerability of carbon storage to land use change in Henan Province from 1990 to 2020 was measured by using a formula, and it was divided into six stages at five-year intervals, as shown in Table 6. From 1990 to 2020, the land use intensity indices were 287.31, 289.23, 290.49, 290.82, 297.67, 292.75, 293.92, showing a continuous upward trend year by year, an increase of 6.61 in 30 years, an increase 2.3%. In the past 30 years, the carbon storage has continued to decline year by year, reaching 1.27×108t in the past 30 years. The increase in the land use intensity index is mainly due to the sharp increase in the construction land classified as 4 in the formula, while the decrease in carbon storage is mainly due to the large transfer of cultivated land with high carbon density to construction land with low carbon density land. Due to the increase of land use intensity index and the decrease of carbon storage, the PI index in the six time periods was negative, indicating that the potential impact of land use change on carbon storage from 1990 to 2020 was negative. From 1990 to 2005, the PI index gradually decreased, indicating that during this period, the vulnerability was deteriorating and the land use was not rationally developed. Between 2005 and 2020, although the PI index was still negative, it showed an upward trend, indicating that the problem still exists, but the situation has improved relatively well. Secondly, the vulnerability of municipal unit carbon storage to land use change in Henan Province was calculated by using a formula, and it was divided into two stages at 15- year intervals, as shown in Figure 8. From 1990 to 2020, only Sanmenxia City in Henan Province had a positive potential impact on carbon storage, with PI indices of 8.537 and 0.534 in the two phases. The negative impact of land use change on carbon storage in Nanyang City is the most significant, with the PI index even reaching -19.041 from 2005 to 2020. From 1990 to 2005 and 2020, the PI index of each city has changed to varying degrees, and there are 10 cities with an increasing trend in the PI index, and 8 cities with a weakening trend. Although the PI index of Sanmenxia City is positive, it shows a downward trend, indicating that the potential impact of land use change on carbon storage in Sanmenxia City is positive, but its vulnerability is deteriorating. The PI indices of Pingdingshan City, Xinxiang City, Zhengzhou City, Puyang City, Nanyang City and Luoyang City were all negative in both phases and showed a downward trend, indicating that the vulnerability of carbon storage in these six cities has been deteriorating and land use has not been rationally developed. Finally, Hebi City, Jiyuan City, Kaifeng City, Luohe City, Xuchang City, Zhoukou City, Zhumadian City, Xinyang City, Shangqiu City and Jiaozuo City, although the PI index of these nine cities is negative, it has increased in these two stages, indicating that the problem still exists. It's just that the Taking Henan Province as the study area, this paper analyzes the response of carbon storage to land use change in Henan Province based on land use data, combined with the InVEST model and geographic detector land use change and transfer, spatiotemporal change of carbon storage and spatial differentiation drive, and uses the potential impact index (PI) conducts an assessment of the vulnerability of carbon stock services: (1) The land use type in Henan Province is mainly cultivated land, and the land has undergone significant changes from 1990 to 2020, which is mainly manifested in a large decrease in cultivated land area, with a total decrease of 11323.5 km2, and a sharp expansion of construction land area, with a total increase of 11136.1 km2, of which the change range from 2010 to 2015 was the most significant.",
    "(2) From 1990 to 2020, carbon storage in Henan Province showed a continuous downward trend, with a total decrease of 0.127×109t. The decrease of cultivated land and the increase of construction land are the leading factors for the reduction of carbon stocks. Spatially, the spatial distribution characteristics are high in the western and southern margins, and relatively low in the central, northern and eastern regions. (3) The spatial differentiation of carbon storage in Henan Province is affected by a variety of factors, which is the result of the synergistic effect of socio-economic development and natural geographical environment. Among them, the influence of single factor on the slope factor (explanatory power of 0.36) was the most significant. The interaction between each driving factor is greater than that of a single factor on the change of carbon stock, showing a relationship between two-factor enhancement and nonlinear enhancement, among which the interaction between night light (x9) and slope (x6) has the largest explanatory power, reaching 0.43. (4) The overall PI index of Henan Province at each stage was -0.14, -0.22, -0.37, -0.23, -0.21 and -0.15, the ecosystem carbon storage services were all negative, showing a trend of first weakening and then increasing. There are spatial differences in the vulnerability between cities, with the distribution characteristics of high in the south and low in the north, and the vulnerability of 55% of the cities has increased in 30 years."
]