[
    "The renewable energy industry in Henan Province suffers from uneven development rate and unreasonable structure of various types of renewable energy, high industrial development cost, financing difficulties, and insufficient consumer demand, which seriously restrict the coordinated development of the industry. In order to promote the coordinated development of renewable energy industry in Henan Province, this paper proposes the solution strategies including strengthening the scientific planning of the industry, determining the key development areas, improving the awareness level of renewable energy among residents, and cultivating the consumption demand of renewable energy. With the double carbon target, the construction of China's ecological civilization in the 14th Five-Year Plan period will enter a new stage focusing on carbon reduction. Vigorously developing renewable energy, expanding clean energy supply and realizing green transformation of energy structure are of strategic importance to achieve the double carbon target in the energy field. Scholars have carried out rich research work on the development of renewable energy industry. According to Yue Li and Yang Fan, the supply-side reform of the energy industry should guide the transformation of the main body of China's energy development from traditional fossil energy to renewable energy, and promote the transformation of the energy industry structure from a \"black system\" to a \"clean system\"[1].Cheng Lu and Feng Junshu point out that the demand-side management should be used to increase the overall consumption of renewable energy to solve the problem of supply and demand balance[2]. Chang Fengrui and Zeng Zihao develop the transformation path for the energy industry in terms of fostering emerging energy demand and breaking down barriers to renewable energy development[3]. Nick Johnstone argues that different types of renewable energy should be supported by different policies[4]. Mario Richter argues that only business model innovation can accelerate the promotion of distributed new energy[5]. Zhang Xiaoqiang and others from the China Center for International Economic Exchanges point out that in order to promote the development of renewable energy industry, it is necessary to break the cost, technology and mechanism constraints faced in the process of renewable energy development[6]. Lin Boqiang proposes to change the way of renewable energy subsidies and introduce renewable energy quota system at the right time[7]. Yuan Jian finds through empirical research that industrial policy has a significant role in promoting the growth of renewable energy enterprises[8]. Hoang Phong Le,Samuel Asumadu sarkozy argue that there is a feedback effect between renewable energy, traditional fuel The above studies show that strengthening demand-side management and increasing the proportion of renewable energy consumption is an effective way to promote energy supply- side reform. In order to promote the development of renewable energy industry, it needs to be strongly supported by industrial policies. However, the literature on the coordinated development of renewable energy industry is relatively rare. In recent years, the renewable energy industry in Henan Province has developed rapidly, but there are still problems such as uneven speed, unreasonable structure, and insufficient consumption demand. These problems, if not effectively solved, will seriously restrict the healthy and coordinated development of the industry. For a long time, Henan Province has formed an energy structure dominated by fossil energy, and coal is prominent in the energy structure with a high proportion. In 2020 Henan Province's total energy consumption is about 227 million tons of standard coal, of which the proportion of coal consumption has dropped to 67.6%, but compared with the national 56.8% in the same period, it is still 10.8 percentage points higher (as shown in Figure 1). The harmful gases and dust emitted by coal during combustion are 1.4 times and 3.3 times of oil and natural gas respectively, which leads to more serious air pollution in Henan Province. In 2020 average concentrations of PM2.5 and PM10 in Henan Province are 52 µg/m3 and 83 µg/m3 respectively, with 245 days of good ambient air quality. Although completing the national or provincial air pollution prevention and control targets, there is still a large gap compared with the national average (the national figures for the above three indicators in 2020 are 33 µg/m3, 56 µg/m3 and 317 days, respectively). According to the data about the national ecological and environmental quality profile in 2020 published by the Ministry of Ecology and Environment, among the 20 cities with relatively poor ambient air quality in 168 key monitoring cities, four cities in Henan Province, including Anyang, Hebi, Jiaozuo and Xinxiang, are on the list, ranking 1st, 9th, 10th and 16th from the bottom, while none of the 20 cities in Henan Province with relatively good ambient air quality on the list. Renewable energy has the feature of no pollution or little pollution, which can effectively solve the air pollution problem faced in the process of economic development in Henan Province, in line with the people's expectations for better and better environmental quality, in line with the development concept of ecological civilization construction, is an effective way to alleviate environmental development and maintain the ecological environment.",
    "At present, Henan Province is still in the industrialization development stage, and the secondary industry is still the leading force to drive economic growth. The industrial structure of Henan Province is dominated by high energy-consuming industries, which is difficult to fundamentally change in the short term, so the future demand for energy is still in the growth stage. Henan Province's per capita energy consumption, per capita living energy consumption is still at a low level, only 2252 and 349 kg of standard coal in 2019 respectively, only 64.56% and 79.68% of the national average for the same period. While accelerating the process of industrialization, Henan Province is also improving its urbanization level (as shown in Figure 2). 55.43% of Henan Province's resident population is urbanized in 2020, which maintains a fast pace of growth but still has a large gap compared to the national average of 63.89% in the same period. Studies show that for every rural population transferred to urban areas, energy consumption will increase by an average of 3.5 times[10]. Therefore, as the level of urbanization continues to increase, it is bound to bring about a rapid increase in energy demand. The two factors of industrialization and urbanization are superimposed on each other, and energy consumption in Henan will continue to grow in the future. In this case, it can not meet the needs of the future growth of energy consumption in Henan to rely on traditional fossil energy completely. We must actively carry out the energy supply revolution, vigorously develop renewable energy industry, increase the effective supply of clean energy, and effectively ensure the needs of economic and social development for energy consumption. In recent years, Henan Province has accelerated the energy supply revolution, and the scale of utilization of various types of renewable energy has been expanding (as shown in Figure 3). As of 2020, the installed scale of wind power in the province is 15.18 million kilowatts, the installed scale of photovoltaic power generation is 11.75 million kilowatts, the installed scale of biomass power generation is 1.379 million kilowatts, and the total installed capacity of various renewable energy power generation reaches 32.39 million kilowatts. At the same time, Henan Province actively promotes renewable energy heating, issues the \"Henan Province to promote geothermal energy heating guidance\", which is the first provincial geothermal energy heating special guidance. By 2020, 24 million square meters of renewable energy heating capacity is added. Henan Province has established a relatively complete renewable energy development and utilization system. In the future, Henan Province will strive to actively explore and cultivate new technologies and new modes of renewable energy development and utilization in distributed development, energy storage, multi-energy complementary, biomass and geothermal energy gradient utilization, and strive to lay a solid foundation for the establishment of a diversified energy supply system. In the process of developing the renewable energy industry, Henan province has formed various renewable energy industrial clusters and relatively complete industrial chains by relying on the driving and agglomeration role of leading enterprises[11]. In the field of wind power, Xuji Group led the establishment of the first domestic wind power alliance----Henan Province Wind Power Industry Technology Innovation Strategic Alliance, which members include wind power industry enterprises, universities and research institutes inside and outside the province, covering all wind power equipment manufacturing links such as tower, fan blade manufacturing, complete machine manufacturing, grid access. Now technological breakthroughs have been made in key fields such as wind farm operation and maintenance. In the field of photovoltaic manufacturing, Henan Province has well-known leading enterprises such as China Silicon Hi-Tech and Ancai Hi-Tech, forming a more complete photovoltaic manufacturing industry chain and two major photovoltaic industry bases in Luoyang and Anyang, with polysilicon production capacity ranking among the top in the industry. In the field of biomass energy industry, Henan Tianguan Group has established the first industrialized process route of straw ethanol in China and realized comprehensive benefits of straw ethanol, straw biogas, straw power generation and straw return to the field. Tianguan Group has driven the development of a number of related supporting enterprises in Nanyang City, and is becoming an important base for the R&D and promotion of biomass energy applications in China.",
    "In recent years, due to the stimulation of national high subsidies for photovoltaic power generation and wind power generation, many cities in Henan Province have launched photovoltaic power generation and wind power generation projects, making the development of photovoltaic power generation and wind power projects at an unusually rapid pace. In 2020, the installed capacity of photovoltaic power generation and wind power in Henan province was 11.75 million kilowatts and 15.18 million kilowatts respectively, while in 2015, they were only 500,000 kilowatts and 1.2 million kilowatts respectively, up 23.5 times and 12.65 times respectively in just five years. At the same time, the installed capacity of biomass power generation in Henan Province is only 1.379 million kilowatts by 2020, which is only 2.9 times higher than the 470,000 kilowatts in 2015. Due to the constraints of raw material acquisition radius, raw material storage and project financing, many biomass straw power plants in Henan Province are under-started and enterprises are in development difficulties[12]. Overall, the development rate of various renewable energy industries in Henan Province is unbalanced, the internal structure of the industry is unreasonable, and a good new multi-energy complementary energy system has not yet been formed. The renewable energy industry in Henan Province started late and the technology is not mature enough, coupled with the inherent disadvantage of resource endowment, resulting in the generally high construction cost. In the process of development, renewable energy enterprises have great demand for capital, but the main sources of financing are only shareholder capital and bank loans, which are too single. Even the bank loans, due to the large risks and lack of effective collateral in the development process of renewable energy industry, banks are more strict in reviewing the loan applications of renewable energy enterprises in order to reduce their own lending risks. In addition to some renewable energy enterprises with state-owned background, most private renewable energy enterprises are difficult to get loans from banks and have to borrow private capital with higher interest rates, which further increases the capital burden and cost of enterprises and is also an important reason for the enterprises to lose money. In addition, due to the lack of sufficient R&D funds, most renewable energy enterprises in Henan province have insufficient investment in R&D, and product technical level is backward and lack of competitiveness in the market, which further leads to financing difficulties for enterprises and forms a vicious circle. In order to understand the current situation of Henan residents' awareness and demand for renewable energy products, we specially conducted a field survey. The survey results show that the residents of Henan Province are not fully aware of the positive role of renewable energy for carbon emission reduction and ecological civilization construction. \"Do you think the renewable energy industry is green\", \"Do you think the use of renewable energy products will reduce the consumption of natural resources\", \"Do you think the use of renewable energy products is in line with the social value orientation \"The average scores of the three questions are only 3.01, 3.13 and 2.77 respectively (full score of 5). Residents not only use less renewable energy products in their daily lives, but also have a weaker demand willingness. 74% of the respondents still mainly use traditional energy in their daily lives. When asked whether to give priority to renewable energy in the future, only 25% of the respondents answered in the affirmative. Overall, the renewable energy industry in Henan Province has the problem of insufficient awareness and weak demand willingness. The coordinated development of the renewable energy industry requires concerted efforts from both sides of the supply and demand, and no demand or lack of demand is unable to promote the sustainable and healthy development of the renewable energy industry. Governments at all levels in Henan Province should strengthen the scientific planning of the renewable energy industry and actively guide enterprises to optimize the allocation of production resources. Relevant departments should combine the natural resource endowment of Henan Province, determine the key field of renewable energy development, focus on making breakthroughs in distributed photovoltaic systems, wind power maintenance, biomass energy, and other fields. First, actively develop distributed photovoltaic power generation projects. Install distributed PV demonstration projects on the roofs of public buildings such as government agency, schools and hospitals, use the roofs of standard factory buildings in industrial parks to build industrial and commercial distributed PV projects, and actively develop rural household PV projects according to the needs of rural revitalization construction. Second, actively explore new areas of wind power services. According to statistics, in 2021, the cumulative installed capacity of China's wind power industry reached 328 million kilowatts. In the future the market size of wind power operation and maintenance will be at the level of one hundred billion yuan, and the profitability of wind turbine operation and maintenance is much higher than that of fan manufacturing. Wind power enterprises should actively develop the operation and maintenance business of wind turbines to open up new strategic space for the future development of the industry. Third, properly solve the dilemma of biomass power industry development. Through scientific planning and reasonable layout, biomass power generation enterprises can explore new fuel acquisition mode and actively carry out carbon emission trading, etc. to solve the current development dilemma.",
    "Science and technology innovation is the first driving force to lead the development of modern industry, and this is also true in the renewable energy industry. For a long time, China's renewable energy industry mainly relies on the introduction of foreign technology and lack the key technologies with independent intellectual property rights, which has become the bottleneck restricting the development of China's renewable energy industry. Renewable energy enterprises in Henan province should increase their independent research and development efforts, and constantly carry out independent innovation. On the one hand, they should form a strategic interest community organization similar to the wind power industry technology innovation strategy alliance, and use the market mechanism to gather innovation resources. This organization can jointly carry out independent innovation for the key technology or common problems in the industry, so as to provide technical guarantee for the sustainable development of the industry. On the other hand, they should strengthen the digestion and absorption of the introduced renewable energy technology. By jointly setting up renewable energy research and development institutions with foreign enterprises, the industry can realize the localization of foreign technologies through cooperation, and on this basis, achieve further innovation by imitating innovation or following innovation. Finance is the core of modern economy and is in a central position to guide the optimal allocation of resources. Henan Province needs to give full play to the role of modern finance as a support and external catalyst for the development of renewable energy industry[13]. First, we need to increase credit support. The green credit work should be understood from the strategic height of developing green economy and low-carbon economy, and more and greater green credit support should be given to the key demonstration projects of renewable energy, the introduction of foreign advanced equipment, and the promotion of technical achievements. Second, we should broaden the financing channels of renewable energy industry. While actively striving for listing and using the domestic capital market for financing, renewable energy enterprises can also consider raising funds from foreign capital markets through technology equity or market equity and other forms. Relevant regulatory agencies can give priority to approving the issuance of bonds by renewable energy enterprises in urgent need of financial support, and expand the bond financing scale of bonds for the renewable energy industry on the premise of effectively controlling risks. Third, we should innovate and expand renewable energy financial services. Financial institutions should to combine the characteristics of renewable energy industry and development needs to launch targeted financial products and services, such as contract energy management special financial products or enterprise future income rights as a pledge for financing and so on. At present, the demand side of renewable energy in Henan Province has the problems of insufficient awareness among residents, weak demand willingness and insufficient industrial demand, which have restricted the development of the industry to a certain extent. In order to accelerate the development of renewable energy industry in Henan Province, we must optimize energy supply structure, guide renewable energy consumption, stimulate residents to consume and use renewable energy, guide new supply with new demand, so as to realize the balance of renewable energy demand and supply. First, we must flexibly use a variety of publicity strategies to improve the residents' knowledge and understanding of renewable energy. The publicity methods should be pleasant and flexible, focusing on the combination of online and offline, so that residents are fully aware of the positive role played by the use of renewable energy to achieve the dual carbon goals and the construction of ecological civilization. The publicity focus should be to attract the attention of residents and make residents realize the real benefits of renewable energy through experiential publicity. Second, we should actively lead the demand for renewable energy and build a number of demonstration projects for the use of renewable energy. The government should take the lead and set an example by actively purchasing and using renewable energy products to help residents understand the advantages of renewable energy, eliminate their concerns and put them into action. Third, we should strictly implement the renewable energy quota system and improve the renewable energy power consumption guarantee mechanism. In order to make the renewable energy power consumption guarantee mechanism into practice, it is suggested that the weight of responsibility for consumption should be further detailed and decomposed to each city, district or power enterprise, which can be implemented to each household user in the future, so as to mobilize the enthusiasm of the whole society to consume renewable energy power.",
    "The authors would like to thank General Projects of China National Social Science Foundation: Research on the calculation and effect evaluation of renewable energy consumption subsidy (No. 18BJY067) for supporting this research."
]