[
    "Abstract. A research framework supported by the GSE system is formulated. The research is focus on the implementation of construction pollution prevention and control of Henan Province. Three levels, government, society and enterprise, are touched, from macro to micro, from the whole to the part. In recent years, China has made certain achievements in the treatment of pollution problems caused by construction, but the relevant treatment research and implementation are far from enough. For example, the \"source reduction\" and \"recycling\" of construction waste, the reasonable discharge of wastewater, and the noise caused by construction have not attracted the attention of relevant departments. At the same time, as urbanization process accelerates, the amount of building construction is larger and more complicated, and the related environmental pollution problems will become more and more prominent. At present, laws and standards on the prevention and control of construction pollution are not perfect enough in China. After sorting out the laws and regulations related to construction pollution in China, it was found that they are not perfect enough to regulate the waste reduction behavior of construction units, the punitive measures for pollution prevention and control in construction are insufficient, and there is no uniform standard for construction waste disposal fees. At present, punishment on environmental violations is still insufficient in China. Law enforcement should be strengthened for environmental violations that improperly use pollutant treatment facilities, falsify testing data, or fail to discharge pollutants in accordance with regulations. Especially it’s important to focus on cracking down on typical violations. At present, in China environmental supervision has the problem of insufficient coordination between different districts. Most of the air, water and garbage pollution affect multiple regions. So relational different districts should establish joint prevention and coordination, improve coordination mechanisms across departments, regions, and projects to give full play to their respective roles. 2.2 Insufficient technological upgrading and innovation in the construction industry The research on pollution caused by construction still lacks the corresponding technology or is still in the initial stage. For example, there is a lack of relevant technology and research on the treatment technology of construction waste, the recycling and utilization of construction waste water, and the protection or treatment of radioactive material pollution. On the basis of investigation some construction projects in Henan Province, it was discovered that there are still some obsolete equipment and facilities or processes that should be eliminated. Some projects use unqualified dust-proof nets to cover, unreasonable entrance and exit flushing facilities, etc., which cannot effectively reduce dust; some equipment is outdated, lacks of repair and maintenance, and the sound insulation shed is not effective, resulting in a lot of noise pollution. At present, the responsibilities of all parties in Chinese environmental pollution control system are unclearly defined and not fully implemented. 1). The leadership role of local governments needs to be further strengthened. At present, the project- level pollution prevention and control regulations of Henan Province are not perfect enough, and the operation of the prevention and control plan is limited. 2). The main responsibility of the pollutant discharge unit should be further implemented. Many construction departments do not pay much attention to the pollution sources generated just for avoidance of trouble. Most units have not adopted any safeguard measures for wastewater pollution, noise pollution and light pollution. As far as air pollution is concerned, real-time monitoring and detection everywhere are not possible, and even worse, false reports are concealed. Construction waste is treated on-site, or some moved directly to other places without rationalization. To sum up the reasons, the main responsibility of the pollutant discharge unit has not been effectively implemented. 3). Insufficient participation of social forces. Third-party service companies, associations, etc. lack training in pollution control for construction units, and they pay less attention to environmental pollution evaluation and assessment. All of these result that construction units pay less attention to pollution control. The government encourages the public to monitor environmental violations that cause air pollution, wastewater pollution, and construction waste pollution through the \"12369\" environmental reporting hotline, letters, emails, government websites, and WeChat platforms. However, the current level of supervision by the public, social organizations, media and other social forces is insufficient and their enthusiasm is not high, and they cannot report and expose construction pollution in a timely and objective manner.",
    "Environmental protection is related with everyone. The people and social organizations should actively participate and contribute their own strength. The public should pay attention to the pollution problems caused by the construction of surrounding buildings in a timely manner, make their own suggestions, and contribute their own strength. Social groups such as associations and organizations, should provide technical and force assistance based on their own characteristics. The media should do a good job, revealing companies or projects with serious construction pollution and speaking highly of good ones. At present, the market's mechanism for pollution control of construction is not perfect, different quality of construction pollution is treated equally, and the market's adjustment function that rewards good and The closed management of the construction site does not meet the requirements. No wet operation was used on site and the road in the construction field is not completely hardened. The muck is not completely covered and other materials are not closed transported. On the construction sites, the vehicle, entering and leaving, without washing did not meet the standards. Poor management of the dust online monitoring system is common. The environmental protection awareness of relevant management personnel and operators on the construction site is weak. The air control system of the construction project department is not perfect. The construction organization design and construction plan are not reasonable enough. The construction and supervision units lack a sense of responsibility. The main reason for the large output of construction waste in China is the Obsolete construction technology and management technology. From design labs to construction organization, unreason and unscience will lead to the generation of unnecessary construction waste. The earthquake resistance level of the building is not enough, and a lot of construction waste may also be generated due to the earthquake. In addition, the use of backward building materials will inevitably lead to waste of materials. The awareness of regulating construction waste is relatively weak. The level of classification and transportation of construction waste is not high. At present, most of the construction waste in China is still mixed collection, and some construction sites have set up sorted garbage bins, but they have not been effectively used. (1) Dewatering of foundation pit. Due to large-scale water pumping, unreasonable settings of equipment and construction organization are extremely likely to result in waste and pollution of water resources. (2) Wastewater from concrete curing. Concrete pouring wastewater mainly refers to the wastewater produced by improper use of curing water during the concrete curing process. Excessive maintenance water will bring about waste of water resources, and at the same time, excess wastewater will affect the entire construction environment. (3) Pipeline test, water before masonry, etc. Water before masonry, including bricks and blocks, is wetted in advance to ensure the moisture content of the masonry. Excessive watering will cause wastewater pollution. (1) Concrete pouring pipe and mixing system flushing wastewater. Concrete pouring pipe flushing wastewater refers to the wastewater generated by the flushing of the pipe and concrete mixing system after concrete pouring. maintenance will produce oily sewage. The suspended solids and petroleum content in the waste water are high and random discharge will seep into the soil. If it is not cleaned in time, the discharge will cause water pollution and air pollution. (3) Environmental protection produces re-pollution. For example, in order to prevent dust, a series of environmental protection measures will be adopted. If these measures are not implemented properly, water pollution will occur again. The use of the fog forest system and the washing of construction machinery are the main ways of environmental protection and re-pollution. Improper use of the dust prevention and fog forest system, such as open spraying on rainy days, and the inability in controlling the amount of spray water in time according to the dust situation, will cause wastewater pollution, resulting in muddy roads on both sides of the construction enclosure. Especially in the past two years, in the process of controlling urban construction dust, a large amount of water has been used to control the dust generated during the construction process, to wash the vehicles entering and leaving the construction site. If the wastewater is improperly treated, it will cause serious harm to the environment near the construction site.",
    "(4) Garbage and sewage in the living and office areas of the construction site are dumped at will. Improper sewage disposal in the office and living areas of the construction site will also have a serious impact on the surrounding water resources. The common ones are drainage from toilets and washrooms, and drainage from kitchens without grease traps. 4.4.1. Implementation issues of construction noise pollution prevention and control. (1) as far as the construction units are concerned, the awareness of environmental protection is weak. Some construction units are only pursuing economic benefits and often neglect public interests due to the shortened construction period. In the construction arrangement, there is no reasonable construction process, leading to the continuous increase of construction noise. (2) Outdated construction technology, construction machinery and equipment. Some construction units did not update the eliminated equipment in time, and construction machinery that did not meet the usage standards produced high noise during overload work, which constituted the main source of noise pollution. (3) The general layout of the construction site is unreasonable. Some construction units neglected the reasonable layout of the equipment and failed to fully consider the noise treatment. (4) The construction unit failed to take reasonable noise reduction measures during the construction process. Since most constructions are performed in an open-air environment, No corresponding noise barriers or noise reduction measures have been taken by the construction unit for equipment or machinery with high noise, resulting in strong noise transmission and noise pollution. (5) Insufficient supervision by relevant government departments. The competent department lacks noise monitoring data for construction units, making it difficult to monitor the noise prevention measures of construction units in real time. 4.4.2. Implementation issues of light pollution prevention and control during construction If the light pollution of building construction is not controlled, the skin and eyes of the constructors will be impacted directly. Some accidents will also happen. Indirect pollution will affect the lives of surrounding residents. However, in order to improve the efficiency of night construction and ensure the lighting requirements of the construction site, most construction units often neglect the prevention and control of construction light pollution. 4.4.3. Implementation issues of prevention and control of radioactive pollution in construction The radioactive elements and radon in building materials will have adverse effects on human health, but such radioactive pollution is often difficult to detect. For example, radon is a colorless and odorless radioactive inert gas that is easily deposited in the respiratory tract and lungs, causing radiation damage to the human body. In order to reduce the construction period and cost, some construction units often neglect the detection of soil radon concentration, material radioactivity and indoor air pollutants. Or these units just take a form. All of those bring about certain problems in the prevention and control of radioactive pollution in construction. As urbanization process accelerates, the amount of building construction is larger and construction situations get more complicated, and this makes related environmental pollution problems more and more prominent. This paper systematically analyzes the main problems of construction pollution prevention and control in Henan Province from three levels of Government, Society and Enterprise. With the help of the paper, a research framework supported by the GSE system can be established, which is helpful to improve the construction pollution control measures in Henan Province. At the same time, it also has a certain role in promoting the research on the implementation of construction pollution control in China."
]