[
    "Abstract: Agricultural modernization refers to the transformation of traditional agriculture into modern agriculture, and is a key way to solve the \"three rural\" problem. 2023 No. 1 document of the CPC Central Committee for the first time explicitly put forward the goal of \"accelerating the construction of a strong agricultural country\", requiring the whole party and society to put the \"three rural\" problem in the first place, and comprehensively implement the strategy of rural revitalization to accelerate the process of agricultural modernization. The first document of the CPC Central Committee in 2023 clearly put forward the goal of \"accelerating the construction of a strong agricultural country\", requiring the whole party and society to put the issue of \"three rural issues\" in the first place, comprehensively implement the strategy of revitalizing the countryside, and accelerate the modernization of agriculture and rural areas. Henan Province is an important grain production base in China, and its total grain output has always ranked the forefront of the country, playing an important role in guaranteeing national food security. This paper analyses the current situation of agricultural development in Henan Province, finds that there are some problems in agricultural inputs, agricultural outputs, the level of rural economic development and the sustainable development of agriculture in Henan Province, and puts forward practical countermeasures and suggestions to address these problems. From 2014 to the present, the central No. 1 document has focused on the major theme of agricultural modernization for 10 consecutive years, and promoting agricultural modernization has become the theme of today's agricultural development [1]. Agricultural modernization is an important foundation of national modernization and a key factor in guaranteeing national food security and rural revitalization. The development direction of agriculture should be to transform to modernization and improve the scientific and technological level and production efficiency of agriculture. Henan Province is an important agricultural base in China, the development of modern agriculture is the inevitable requirements of the trend of the times is also the road to modernization. This is because: on the one hand, agriculture plays an important role in the economic development of Henan Province. The level of agricultural modernization in Henan Province will determine the development trend of agriculture in Henan Province, thus affecting the economic structure and economic level of the province. At the same time, as one of the important grain-producing areas in the country, the level of agricultural modernization in Henan Province is also related to the national food security and agricultural development level. On the other hand, the process of agricultural modernization in Henan Province is still very slow, even lower than the national average. In order to \"enrich the people\", to a large extent, it is necessary to promote the modernization of agriculture, solve the problem of agricultural development, also solves the problem of people's livelihood in Henan Province [2]. According to the data of Henan Provincial Bureau of Statistics, the total output value of agriculture, forestry, animal husbandry and fishery in Henan Province reached 10,501.20 billion yuan in 2021, with a year-on-year growth of 5.47%. Henan Province is a major agricultural province in China, ranking 2nd in the country in terms of grain sown area and grain output, second only to Heilongjiang Province. In 2021, Henan Province produced 65.442 million tons of grain, accounting for 9.58% of the country's total grain output. The agricultural output value of Henan Province has increased from 126.429 billion yuan in 2000 to 656.483 billion yuan in 2021, with an average annual growth rate of 19.06%. Forestry, animal husbandry and fishery in Henan Province have also achieved better development, growing by 5.83 per cent, 3.02 per cent and 21.92 per cent respectively. From the point of view of the average annual growth, Henan Province's agricultural development is fast, and the strength of economic growth has been enhanced to a certain extent, but there is still a big gap between the stage of basic realization of agricultural modernization. According to statistics, as of 2021, Henan Province owns 418,300 large and medium-sized tractors, while the country owns 4,980,700 large and medium-sized tractors, accounting for 8.40%. Small-sized tractors, on the other hand, had 2,946,000 units, ranking second in the country. In 2021, Henan Province's total financial revenue amounted to 661.124 billion yuan, an increase of 5.49% over the previous year. Among them, the general public budget expenditure was 978.429 billion yuan, an increase of 0.5%. Among the general public budget expenditures, agriculture, forestry and water expenditures accounted for 10.74%, reaching 105.122 billion yuan, down 13.018 billion yuan from the previous year.",
    "According to the data released by the Bureau of Statistics of Henan Province, in 2021, the disposable income per capita of rural residents in Henan Province reached RMB 17,533, an increase of 8.8% year- on-year, and an increase of 133% compared with RMB 7,525 per person in 2012. The rise in disposable income per capita of rural residents in Henan Province mainly stemmed from the growth of wage income, net business income and net transfer income. Compared with the per capita disposable income of 37,095 yuan per person for urban residents, the per capita disposable income of rural residents still lower. According to the official website of Henan Provincial Bureau of Statistics, in 2021, the forest coverage rate of Henan Province reached 24.1%, slightly higher than the national average of 22.96%, ranking 20th among all provinces in China, but there is still a big gap with the first place, Fujian Province, which has a forest coverage rate of 66.80%. The trend of fertilizer application per hectare of arable land in Henan Province is from 0.80 t/ha in 2010 to 0.83 t/ha in 2021, with an overall increase of 3.75 percentage points. The area of comprehensive soil erosion control in Henan Province also decreased from 4428.7 thousand hectares in 2010 to 4141.8 thousand hectares, a decrease of 6.48%. The use intensity of pesticides and fertilizers in Henan Province is higher than the national average, while the use structure of pesticides and fertilizers in Henan Province also suffers from a single type of pesticide, an imbalance in the ratio of nitrogen, phosphorus and potassium in fertilizers, and a low utilization rate of organic fertilizers. According to the data, between 2010 and 2021, the level of agricultural modernization in Henan Province did not improve significantly, but rather declined to a certain extent. This is mainly due to the fact that although Henan Province has increased its financial investment in agriculture, forestry and water affairs every year during this period, the proportion of these inputs in the total financial expenditures has not continued to rise, and has decreased compared with 2010. This shows that the financial support for agriculture in Henan Province has weakened during this period, which has affected the process of agricultural modernization. the proportion of primary industry output value generally show an inverse relationship, i.e., the higher the proportion of primary industry output value in a region, the lower the development level of its agricultural modernization [3]. In 2012-2021, the proportion of primary industry output value decreased from 13.8% to 9.5%, with a decrease of 4.3 percentage points, and the national level decreased from 9.33% to 7.26%, with a decrease of 1.71 percentage points during the same period, which can be seen that the growth rate of the level of agricultural output in Henan Province is higher than the national average level, but the overall output level is weaker than the national average level. At the same time, the output of grain and vegetables per unit area is also improving but to a lesser extent, only less than 10% in twelve years. Henan Province has a large agricultural population, and the per capita area of arable land is quite limited, which is a very big resource condition in the modernization of Henan's agriculture. Henan Province is an important grain production base in China, and its total grain output has long ranked among the top three in the country, but its level of rural economic development is unsatisfactory. According to the statistics of 2021, the per capita disposable income and consumption expenditure of rural residents in Henan Province were 17,533.3 yuan and 14,073.2 yuan, respectively, which are significantly higher than those of 12 years ago, but still lower than the national averages of 18,930.9 yuan and 15,915.6 yuan, and ranked 21st in the country, lagging behind most of the provinces. The imbalance in the level of rural economic development, the slow growth of farmers' incomes and the problem of rural poverty are all important factors affecting the modernization of agriculture. The widening gap between urban and rural areas is not conducive to the advancement of the process of agricultural modernization. The indicator of per capita electricity consumption of rural residents in Henan Province reflects the low level of modernization of rural residents' life. Although the per capita electricity consumption of rural residents in Henan Province has increased over the past decade, it is still lower than the national average. Henan's urbanization rate is also lower than the national average, ranking sixth from the bottom.",
    "In order to promote the modernization of agriculture in Henan Province and to maintain a steady increase in grain production, chemical fertilizers have been used in large quantities in Henan Province over the past few years, which, although it has increased grain production, has also had a negative impact on the soil and the ecological environment. Henan Province is an important agricultural province in China, and every year it has to deal with various natural disasters that threaten agriculture. Natural disasters cannot be controlled or eliminated, but the hazards of natural disasters can be reduced and the resilience of agriculture can be enhanced by taking some effective measures. At present, there are still some deficiencies in this regard in Henan Province, mainly in two aspects: first, the application of intelligent agricultural machinery is not widespread enough to monitor and warn of natural disasters in a timely manner, or effectively carry out post-disaster recovery and reconstruction. Secondly, farmers' understanding of agricultural insurance is not deep enough, and the participation rate is still very low, and they have not fully utilized agricultural insurance as an important risk management tool to protect their income and life. In addition, the agricultural insurance mechanism in Henan Province is not comprehensive enough, failing to form a reinsurance system for agricultural insurance organizations, and the lack of these aspects affects the sustainable development of agriculture [4]. This shows that the twelve- year road to sustainable agricultural development in Henan Province has been arduous and tortuous, and also shows that there is still a lot of room for upward mobility in the sustainable development of agriculture in Henan Province. The construction of agricultural modernization requires increased financial investment to improve agricultural quality and efficiency and enhance agricultural competitiveness. To do this, the first task is to build high-standard basic farmland, supporting perfect farmland facilities, and improving the productivity and disaster resistance of farmland [5]. In order to protect farmland and improve agricultural productivity, it is necessary to clarify the responsibilities of governments at all levels and relevant departments, establish and improve farmland protection regulations and systems, and strengthen the quality supervision and management of farmland projects. At the same time, it is necessary to increase investment in agricultural and rural infrastructure and public services, prioritize support for the construction of farmland water conservancy infrastructure, and implement major planning projects in the field of \"three rural areas\". In addition, financial institutions, private enterprises and social capital should be actively guided to participate in the development of the rural economy, corresponding financial incentive policies should be introduced, innovative investment and financing modes should be adopted, and the sources of agricultural funding should be broadened to increase agricultural inputs. The development of agricultural modernization should not only create high-quality agriculture, but also focus on the improvement of the rural economic level[6]. In order to realize agricultural modernization in the new era, we must strengthen the coordinated development between urban and rural areas, promote the integrated development of various industries in rural areas, as well as improve the comprehensive quality of farmers, so as to continuously enhance the development capacity of the rural economy. The coordinated development of urban and rural areas will enable the transfer of advanced resources from the cities to the countryside, providing strong support for the process of agricultural modernization, and at the same time will enable the flow of idle resources from the countryside to the cities, which will also play a very important role in promoting the development of the cities. At the same time, it actively introduces a variety of policies to encourage rural areas, promotes the construction of scientific and technological talents to the countryside, and injects high-quality human resources for rural development [7]. In the process of promoting the development of agricultural modernization, the concept of sustainable development should always be carried through, gradually reducing the use of pesticides and chemical fertilizers and reducing soil erosion [8]. And actively improve agricultural insurance, reduce disaster losses, strengthen the protection of arable land, and promote the sustainable development of agriculture. The excessive use of pesticides and chemical fertilizers can lead to a decline in the quality of agricultural products, soil pollution and ecological damage, which are all factors detrimental to the sustainable development of agriculture. Therefore, Henan Province should follow the Ministry of Agriculture and Rural Development's policy of zero growth in pesticides and fertilizers, while strengthening scientific and technological innovation and promoting more environmentally friendly alternatives. In addition, the overuse of pesticides can cause land sloughing and pollution of the atmosphere and water resources, which are also problems that threaten the sustainable development of agriculture. However, not using pesticides at all can also affect crop yields due to the damage done to crops by pests. Therefore, Henan Province should adopt various technical measures to minimize the use of pesticides while ensuring crop production. Finally, Henan Province should implement a strict arable land protection system and increase the proportion of high-quality farmland through land improvement. At the same time, the construction of artificial protection forests should be increased to gradually restore the local ecological environment and effectively prevent soil erosion. At the same time, it is necessary to increase the punishment for indiscriminate logging behavior, increase the cost of violation of the law, and stop soil erosion from the root [9].",
    "At present, the overall cultural quality of farmers in China is low, but farmers are the main body of agricultural production, and the cultural quality of farmers is a key factor in the process of agricultural modernization [10]. In order to improve the efficiency and quality of agricultural production, strengthening agricultural education is essential. Agricultural education can not only teach agricultural technology and knowledge, but also cultivate farmers' innovative consciousness and entrepreneurial ability, so that they can become new farmers with modern agricultural concepts and skills, able to adapt to market demand and social changes, able to effectively use resources and the environment, and able to participate in agricultural management and services. Strengthening agricultural education and fostering new types of professional farmers is conducive to enhancing the competitiveness and sustainable development of agriculture, and to promoting the development of rural economy and society. In order to cultivate vocational farmers, we should start from the following three aspects: first, to improve the quality and coverage of basic education in rural areas, to ensure that farmers enjoy the right to nine-year compulsory education, to optimize the allocation of educational resources in rural areas, and to improve the educational situation in poverty-stricken areas, so as to lay a solid foundation for the training of vocational farmers; second, to set up a system of vocational farmers' education and training, and, through the cooperation with institutions of higher learning and scientific research institutes and other institutions, to provide farmers to provide systematic curriculum training, regularly update their knowledge of agricultural science and technology, and carry out various forms of scientific and technological competitions and lectures by experts, so as to cultivate farmers' innovative and practical abilities; thirdly, to improve the incentive mechanism for vocational farmers, and to encourage farmers to change their traditional concepts of production and business methods, improve the efficiency and effectiveness of agricultural production, and promote the modernization of agriculture by means of policy support, financial subsidies, and technological guidance. Agriculture is an important pillar of economic development, and the Party's Document No. 1 of 2023 once again highlights the direction of promoting agricultural modernization, the agricultural and rural work in the new era is still the top priority of the Party Central Committee, and the promotion of agricultural modernization is an urgent task, which has a bearing on the enhancement of agricultural productivity, the vitality of the rural economy, and the process of the construction of socialist modernization. Promoting agricultural modernization is an ongoing project, and under the new circumstances we should adhere to the Party Central Committee's overall planning for the work of the \"Three Rural Areas\", give full play to Henan's role as a major agricultural province, increase agricultural inputs, enhance agricultural output, promote rural economic development, and push for the sustainable development of agriculture, so as to continuously improve the level of agricultural modernization."
]