[
    "Abstract. In recent years, with China's economic development and social progress, the country needs to constantly improve the quality of its citizens to meet the needs of society for talents. At the same time, people also need to improve their work skills through adult education to meet the needs of the market. In this case, both countries and individuals recognize the importance of adult education. This paper will take Henan Province as an example. As Henan Province is an inland province in China, it has the characteristics of large population and low overall education level. The economic development of Henan Province urgently needs adult education to improve people's knowledge structure. In this context, by consulting many references, this paper puts forward five hypothetical factors affecting the effectiveness of Adult Education: Learners' motivation, learners' age, learning time, learners' learning willingness and physical environment obstacles. The PLS-SEM model and OLS regression model are used to conduct questionnaires and in-depth interviews with the target population in Henan Province. The survey results are analyzed qualitatively and quantitatively by SPSS software. The proposed assumptions are fully demonstrated according to the final analysis, so as to draw the final research conclusion. Since the 1980s, China has implemented two major strategies of “opening the economy to the outside world” and “vigorously developing the economy”. In order to meet the needs of its socialist modernization drive, China has put forward higher requirements for professional workers and professionals in many fields. The Chinese government also attaches great importance to the sustainable development of adult education, and has formulated a series of important talent cultivation plans for this purpose (Xie, 2003). In November 2001, at the 16th National Congress of CPC, the Central Committee of CPC took “building a learning society in an all-round way and making every effort to promote the all-round development of talents” as the goal of “Comprehensive construction of a well-off society in China”. With the rapid development of China’s economy and society, adult education is also developing at an alarming rate. It is a trend to meet the demand for improvement of the country’s national quality as an important task, and the demand of the market also leads to a higher demand for adult education. According to the Chinese Ministry of Education report (2019), China has established numerous adult primary schools, adult middle schools and adult high schools. However, due to the small number of ordinary colleges and universities, the number of graduates is limited, so it is still difficult to meet the demand for talent skills, and adult education is facing great pressure. On the other hand, the characteristics of adult education should be adapted to the requirements of a market economy system (Radwan, 2020), which is an important precondition for adult education to flourish in China today. Under these circumstances, many people began to realize the important role of adult education (Xiao, 2003). The popularization of adult education and lifelong education is facing new challenges. In the context of economic globalization, how to face the increasingly fierce competition and challenges and improve the effectiveness of teaching activities has become an urgent problem to be solved in adult colleges and universities (Zunmin, 2013). In this study, the author attempts to narrow the research gap by deeply understanding the factors affecting the effectiveness of adult education and paying attention to the characteristics of learners' age, motivation and environmental factors (such as situational and physical environmental barriers). The purpose of this thesis is to explore the factors that affect the effectiveness of adult education. It is hoped that the research will help improve the effect of adult education in China’s Henan This study aims to improve the teaching efficiency of educational institutions and provide reference for the masses to obtain effective adult education, which has certain theoretical and practical significance. Theoretically speaking, the exploration of this research field will help people better understand and grasp the factors affecting adult education activities, provide reference and theoretical approaches for adult education, and partially fill the research gap at home and abroad. In a practical sense, this study will take Henan Province as an example and analyze the factors affecting the effectiveness of adult education on the basis of the investigation of the current situation of adult education, so as to solve the problems existing in the adult education industry and help improve the value and macroeconomic benefits of the adult education industry. On this basis, it will provide power for the development of the adult education industry in the future.",
    "Kola et al. (2015) believes that the indicators to measure the effectiveness of teaching activities include student evaluation, student motivation, learning environment, teachers’ personal quality, teachers’ professional development, teaching delivery and interpersonal relationship between teachers and students. According to Patil et al. (2016), effective teaching requires an interactive classroom environment to stimulate and encourage students. Effective teacher-student interaction is based on various activities. Considering the above the author of this research studies the effectiveness of teaching activities from the perspective of learners. Khodadad Azizi et al. (2018) also divided the influence factors of adults’ learning into internal factor and external factors. Internal factors include learner’s motivation, current knowledge, physical conditions, and learning disabilities, while external factors include age, peer, teacher behavior, parental support, and classroom environment. Ramli et al. (2018) studied the relationship between external factors, internal factors and academic achievement, and concluded external factors to be family environment and academic environment, and internal factors to be learning motivation and interest. H1: The effectiveness of adult education is influenced by learners’ motivations. H2: The effectiveness of adult education is influenced by age of the learner. H3: The effectiveness of adult education is influenced by the duration of participants’ learning. H4: Situational barriers affect adult learners’ willingness. This research mainly adopts the method of combining qualitative research and quantitative research. Quantitative research can be used to analyze the data collected, but in order to improve the reliability and accuracy of the data, qualitative data will also be used to supplement the inadequacy of quantitative research. For the qualitative aspect, it mainly includes non-numerical data obtained through questionnaires and interviews to determine respondents’ feelings and attitudes towards challenges in adult education (Wrigley, 2013) In this study, nonprobability sampling will be used to collect the data because it is a convenient sampling method to select subjects. Due to the large population of Henan Province, Zhengzhou, as the provincial capital, has more people engaged in adult education than other prefecture level cities in the province. Therefore, it is planned to take the population of Zhengzhou as the sample. The sample of this sampling survey is planned to be selected from several large-scale adult education institutions in Zhengzhou, such as Zhengzhou Chengding education, Beijing cumulus education Zhengzhou campus and Zhengzhou Beida Qingniao Zhengzhou campus. n 1(P ZP ) e 2 2 Note: n = sample size P = random scale = 0.5 E = sampling error ratio = 0.05 Z = confidence leve 95%=1.96 The calculation process is as follows: n ）（ 5.0-15.0 05.0 2 96.1 2 25.0 .3 8416 .0 0025 384 Therefore, the planned sample size is determined to be more than 384. It is mainly about the basic information or demographic characteristics of the respondents, which is carried out through a checklist, including 6 variables: gender, age, income, educational level, region and learning time. Mainly through the quantitative form, it contains four variables. It is planned to use Likert scale to divide the value of each variable into five levels: very agree, agree, neutral, disagree and very disagree. Data collection mainly collects the original data through questionnaires and expert interviews. The raw data required for quantitative and qualitative analysis mainly includes information from 400 respondents. These respondents are the lists of students and teachers obtained through various adult education institutions. According to these lists, a sample population is randomly obtained as the data source of the study. The questionnaire is mainly used to collect quantitative data and is mainly sent to educational institutions electronically for respondents to fill in. Qualitative research also needs to determine the sample size. According to the research of vasileiou et al. (2018), the best sample size is 20-30 interviews. Therefore, 20-30 people will be recruited to participate in expert interviews. Quantitative analysis of the data was performed with the data analysis software SPSS. To strengthen the statistical accuracy of the data, all useless data will be cleaned up, and only useful data will be retained. Qualitative data were analyzed using content analysis, a methods which refers to the analytical process of grouping and categorizing data profiles by topic (Elo et al., 2014) ,such as the challenges involved in the teaching process. Through careful analysis of the audio data, repeated utterances in the interviews, such as repeated patterns, themes and aspects, etc., were obtained, Highly repetitive utterances will be seen as a major challenge affecting adult education, while less repetitive utterances will be seen as a secondary challenge. Through the data analysis, specific topics can be generated from various information obtained from it to make it easier to draw valid conclusions on this issue.",
    "The descriptive analysis of quesestionniare survey show the 57.6% of the respondents are females while 41.1% of the respondents are males. The rest 1.3% are others. Regards to the age, 40.4% of the respondents are at the age of 27.7;35-26% of the respondents are at the age of ;25-18 17.6% of the respondents are at the age of 12.3 ;45-36% of the respondents are at the age of 60-46;the rest 2.3% are Less than 18 or More than 60. When it comes to the income, nearly three quarter of the respondents are medium-lower incomers while the rest one quarter of the respondents are high incomers. As for education level, 68.8% of the respondents are college or university graduate; 11.2% of the respondents have master and PHD postgraduate, the rest of the respondents are those graduated from high middle school or lower level than high middle school. When asked how many hours spent on adult education weekly,55.0% of the respondents answer that they spend 2-1 hours a day, 10-5 hours a week; 31.2% of the respondents answer that they spend 4-3 hours a day, 20-15 hours a week;12.1% of the respondents answer that they spend 8-7 hours a day, 40-35 hours a week; the rest of the respondents answer that they spend More than 40-35 hours a week. The descriptive analysis show gender has influence on the adult education. More females tend to choose adult education than their counterpart. Addition, those who just graduate from school and enter the social in the first 5years are more likely to attend adult education. The adult education needs adult have certain education background so that most of the people attend the adult education are those who graduate from college or university. The descriptive analysis indirectly demonstrates thatt gender, age, and education backgrond have impacts on adult education. Satisfaction to adult education and personal growth are measurements of effectiveness of the adult education. The correlation analysis shows that motivation has weak relationship with satisfaction to adult education (0.3 < r=0.5< 0.368) and personal growth (0.3 < r=,(0.5< 0.360 implying that effectiveness of the adult education is slightly affected by motivation. Though age has very weak relationship with personal growth (r=0.3< 0.191), it has weak relationship with satisfaction to adult education (0.3 < r=0.5< 0.313). Though time has very weak relationship with satisfaction to adult education (r=0.3< 0.271), it has weak relationship with personal growth (0.3 < r=0.5< 0.326). Situational barriers and physical barriers are similar to age, having very weak relationship with personal growth (r=0.3< 0.277;r=0.3< 0.230,respectively) and weak relationship with satisfaction to adult education (0.3 < r=0.3;0.5< 0.302 < r=0.5< 0.318, respectively). Besides, the correlation analysis also show that other internal factors, such as Attitude, Self-efficacy or Self-maturity, Interest to learning or Willingness, Self-directed learning readiness and other external factors, such as Learning environment and Family and friends’ support have weak relationship with either satisfaction to adult education or personal growth whereas other internal factors, such as Physical health, Leisure time availability and Intelligence or education level and other external factors, such as External pressure, Relationship between teachers and students, Family environment and Faculty facilities have very weak relationship with either satisfaction to adult education or personal growth. Several regression models have been built. In model 1 and 2, satisfaction to adult education and Personal growth are chosen as dependent variables and motivation, age, time, situational barriers and Physical barriers are treated as independent variables. The research results show that motivation, age, time, situational barriers and Physical barriers have very weak relationship with either satisfaction to adult education or personal growth. Among these five factors, motivation has relative stronger relationship with satisfaction to adult education and personal growth. That means motivation has much more impacts on the effectiveness of adult education that other four factors. In addition, in model 6- 3, other internal factors, such as Attitude, Self-efficacy or Self-maturity, Interest to learning or Willingness, Self-directed learning readiness, Physical health, Leisure time availability and Intelligence or education level and other external factors, such as External pressure, Learning environment, Relationship between teachers and students, Family environment, Family and friends’ support and Faculty facilities are treated as independent variables. The research results also show that other internal factors, such as Attitude, Self-efficacy or Self-maturity, Interest to learning or Willingness, Self-directed learning readiness, Physical health, Leisure time availability and Intelligence or education level and other external factors, such as External pressure, Learning environment, Relationship between teachers and students, Family environment, Family and friends’ support and Faculty facilities have very weak relationship with either satisfaction to adult education or personal growth.",
    "The content analysis has been conducted for interview and the result show that adult education is an important part of Henan Province's education system and an organic component of lifelong education system. It is interdependent with and have mutual relation with formal education. The university enrollment expansion not only drives the rapid development of higher education, but also drives the expansion of adult education audience. Currently, there are many adult education platforms that do not seem to have changed the actual situation of adult education attendee and they are still restricted in the work seeking .Record of adult education is approbated by most companies so that many adults think that it is not necessary to attend adult education. As a result, fewer and fewer adults attend adult education nowadays. The adult education in China is featured with gold-plated, expanding social communication circle, gaining certificate, useless, charge. On the one hand, a lot of schools provide adult education for profits; some schools do have reasonable curriculum and many famous universities have outsourced adult education. On the other hand, The adults who attend the adult education have various goals. In addition, the content analysis also show that several internal factors and external factors have impacts on adult education. The adult education is very important for adults, when they looking for a job, they are often asked of their academic level, and required to show relevant certificates to prove their academic level. Generally, those with high education level can find a job more easily, and with better wages. To gain a better job, adults with relatively low academic level often choose the adult education. Career development has reached the bottleneck stage due to education background or professional skills. The adult education can improved education background or professional skills, thus it can reduce the impact of education background or professional skills on career development. Through adult education, one can change one's knowledge structure, broaden the professional horizon and career development path. Self-discipline,refering to self control and self time management affects adult education effectivenss. Self-discipline affects how well one finish one's tasks.Self-request also has influences on adult education effectivenss. The high self-request may result in formation of internal motivation to seeking higher level of adult education.Moreover, one choose adult education given time is allowed, and time can be reasonably arranged and used so that one can attend adult education at the arranged time. one interviewee reports that lack of learning energy, limited free time, daily life pressure and too many trivial things to deal with, result in that adult education cannot be carried out, the time of learning and the Many adults need to face a lot of public opinion while attending adult education, because many people around the adult education attendee discriminate against the adult education attendee. As for the recruitment, many well-known enterprises or state-owned enterprises have a general sense of discrimination against adult education so that they emphasize the first school record, resulting in the rejection of adult education. The external environment, peer view and the educational preference and supporting facilities are the external factors affecting the adult education effectiveness. The external environment influences the efficiency and completion degree of adult education. If there are good educational resources nearby, such as more training institutions or learning, people are more likely to receive adult education. The peer view influences the psychological state of adult education, If People around are excellent and well-educated or are still pursuing higher levels of education through adult educaiton, one is likely to attend adult education. And the educational preference and supporting facilities influence the efficiency of adult education. Competition in developed regions is more exciting. In order to be competitive in the market, people tend to pay more attention to the improvement of ability, so that they attend adult education. Adult education needs to pay charge commonly, the person with certain economic foundation, such as with relatively high income or with finance support from family, is like to receive adult education. The cost of adult education is generally higher than that of a full-time education. On the one hand, the adult education tuition and other fees generally higher than that of full-time education, on the other hand, the learning cost is more than the full-time education, adults who have work need to squeeze out more time for adult education so as to complete their study.",
    "The social pressure that impels adults to study can be divided into public pressure, occupational pressure, work pressure, family pressure and social competition. The most prominent sign of the formation of a learning society is the emergence of many \"learning families\". Parents' participation in learning and attending the adult education is not only beneficial to themselves, but also has a good influence on their children. Additionally, with economic and social development, competitive activities are further intensified. No matter the competition of organization or individual, it is the comprehensive competition of commence and knowledge. The formation of competitive ability mainly depends on learning activities. In a sense, competition provides motivation for adults to learn.In real life, people have to attend adult education, continuing to learn and upgrading their skills to meet the requirements of the job because of job changes and job types adjustment. Compared with the compulsory education, adult education is more dependent on one's own efforts. In compulsory education, there are teachers and parents' supervision, whereas in adult education, the most important factor is the learner's own efforts. Therefore, the most important factor for adult education is self-requirement. Because it is the most fundamental and core factor. If one does not have higher self-requirements, one will not attend adult education even if the external factors do work. There are many reasons influencing the teaching quality of adult education, which can be grouped into internal and external factors. The internal factors are fundamental while the external factors are the condition, the internal factors play a decisive role whereas the external factors must play a role through the internal factors. According to Nyambe et al.(2016),the internal factors consist of physical health, leisure time availability, hobby or passion, self-maturity, and intelligence whereas the external factors consist of family and friends’ support, faculty facilities, problems encountered, peer relationships, and the influence of parents and friends. Previous studies have pay attentions to the internal factors, such as students motivation, previous knowledge, interest in learning and physical and learning disabilities and external factors, such as age, peers, teachers’ behavior, parents support and classroom environment, family environment and academic environment. This research attaches importance to the five factors, motivation, age, time, situational barriers and Physical barriers, which include both internal and external factors .Besides these five factors, this research also investigate the influence of other internal factors, such as Attitude, Self-efficacy or Self-maturity, Interest to learning or Willingness, Self-directed learning readiness, Physical health, Leisure time availability and Intelligence or education level and other external factors, such as External pressure, Learning environment, Relationship between teachers and students, Family environment, Family and friends’ support and Faculty facilities on the effectiveness of adult education. The questionnaire survey and semi-structured interview show that the above internal and external factors have weak or very weak relationship with the effectiveness of adult education. Besides the internal and external factors, the factors that affect the effectiveness of adult education can be categorized into the perspective of student, school, teachers , family and society. From the perspective of student, the students who attend the adult education have work and most of them graduate from college. The interview show that they choose adult education because of competition in the society and pressure in workforce. They just want to gain a record of adult education so as to keep their current position. They lack the motivation for adult education. They are not to gain knowledge and skills through adult education. They do not have good attitude towards adult education. Usually, they are absent from class. From the perspective of teacher, teachers ‘teaching is direct related with the study content and quality of learning of adult education. In most case, the adult education teachers are part-time. They are busy with their teaching tasks and research work in university. In addition they have difficulty in deal with the adult education which is different from the formal college education, with professional and social features. From the perspective of society, From the perspective of family, individuals with supportive family environment tend to choose adult education to achieve high level of education through adult education after finding a job. From the perspective of school, some colleges and universities that provide adult education even engage in false propaganda at the cost of sacrificing the dignity and quality of education. Some give the promise of admission at low scores and ensure that everyone passes the exam and obtain the record of adult education. From the perspective of society, the adult education are not accepted by the society.Most organization have biases towards the students who have the record of adult education though the policy stipulate that the record of adult education is similar to the corresponding first-record of formal education. It is the social discrimination that Adult education, as an important part of Henan Province’s education system, is an important channel to improve the quality of workers and promote economic and social development. Over years, the adult education have developed in Henan Province. However, it is facing with problems and challenges. The number and quality of adult education levels continue to decline. It is necessary to address these problems. In fact, there are many factors influencing the effectiveness of adult education.",
    "Based on the theories related to adult education, such as Pedagogy, autonomous learning and transformational learning and the previous studies on factors affecting the adult education, several hypotheses have been developed. To test the hypotheses, questionnaire survey have conducted and the collected data is analyzed with regression model. The result show that motivation, age, time, situational barriers and Physical barriers have weak or very weak relationship with adult educations. Besides the five factors, other internal factors, such as Attitude, Self-efficacy or Self-maturity, Interest to learning or Willingness, Self-directed learning readiness, Physical health, Leisure time availability and Intelligence or education level and other external factors, such as External pressure, Learning environment, Relationship between teachers and students, Family environment, Family and friends’ support and Faculty facilities also have weak or very weak relationship with the effectiveness of adult education. To further explore the relationship between the factors and the effectiveness of adult education, the semi-structured interview has been carried out and the collected data is analyzed with content analysis. The results further demonstrate that motivation, age, time, situational barriers and Physical barriers have weak or very weak relationship with adult educations. It is the same with other internal and external factors. Based on the findings, this research will come up with some suggestions on how to improve teaching effectiveness from a perspective of a learner. Determine the right direction for their development according to one own's knowledge and interest, and plan the courses they should learn; 3) Choose several classmates so as to encourage each other and help each other, as well as supervise each other;"
]