[
    "Li Songhua, Wan Luping, Xu Yanxia. Research on the Evaluation of Ecological Environment Governance Efficiency: Based on Panel Data from Henan Province. International Journal of Environmental Monitoring and Analysis. Vol. 11, No. 5, 2023, pp. 102-105. doi: 10.11648/j.ijema.20231105.11 attracted much attention. And, to speed up the governance and improvement of ecological environment, it is necessary to understand its governance efficiency. Therefore, this article uses DEA models to evaluate the efficiency of ecological environment governance through constructing the evaluation index system of ecological environment governance, and based on 17-cities data of Henan province during the period of 2013 to 2018. The results are as follows: the calculation of the efficiency of ecological environment management shows that the overall level of ecological environment governance efficiency in Henan Province is not high and is showing a slow upward trend. There are significant differences in ecological environment governance efficiency among different cities. And the decomposition of ecological environment governance efficiency in Henan Province shows that scale efficiency is greater than the rate of technological progress, which indicates that the driving force of ecological environment governance comes from the scale expansion of input, and the effect of technological progress is relatively limited. Based on these findings, countermeasures for improving the efficiency of ecological environment governance in Henan Province are proposed in terms of optimizing investment in ecological environmental governance, improving environmental protection technology, establishing ecological environment governance supervision mechanism, and enhancing regulatory efforts. Nowadays, China's economy and society have entered a stage of high-quality development, and the governance and improvement of the ecological environment, as an important link, have received much attention. General Secretary Xi Jinping has repeatedly stated the need to strengthen source control, promote efficient resource utilization, accelerate green and low-carbon development, and strengthen pollution prevention. The government has introduced and implemented a series of ecological environmental protection policies. The Outline of the 14th Five Year Plan also proposed a series of ecological and environmental quality indicators, and formulated a roadmap and timetable for building a beautiful China. However, how to improve the efficiency of ecological environment governance and accelerate ecological improvement is still an urgent and important issue to be solved. Many studies have a consistent view that ecological environment governance efficiency is not high and there are significant differences between regions. Sun Yu, Zhao Yuping, & Cui Yin found that the overall level of ecological environment governance efficiency in Chinese provinces is not high, and there are significant differences between provinces [1]. Zhao Yuping found that the efficiency of rural Li Songhua et al.: Research on the Evaluation of Ecological Environment Governance Efficiency: Based on Panel Data from Henan Province ecological environment governance in the Beijing-Tianjin-Hebei region was generally relatively average during the period of 2008 to 2017 [2]. In comparison, the governance in Beijing and Hebei Province was more effective Fan Ziyi found that there are significant differences in ecological environmental governance efficiency between regions in China, and having strong spatial clustering characteristics [3]. Chen Zuhai & Kuang Ruolan found that the efficiency of ecological governance in ethnic areas is relatively low [4]. Han Yonghui found significant differences in ecological environment governance efficiency among the regions of China [5]. Huang Huan, Yang Suyi, & Jia Ruyin found that the ecological environment governance efficiency in the upper reaches of the Yangtze River is lower, while in the middle and lower reaches, it is higher [6]. Li Hongyan, Zhang Xinghua & Fu Junyi found that the efficiency of rural ecological environment management in the Yellow River Basin is relatively low [7]. Zhang Wencong found that the efficiency of rural ecological environment management in China is low and needs to be improved [8]. Miao Shiqing, Sun Yu & Li Xiangchun found that the level of ecological environment governance in Shanxi Province fluctuates and needs to be further improved [9]. On the contrary, Liu Tingting found that the efficiency of ecological environment governance in Zhejiang Province is relatively high [10]. Zhang Xin & Fan Guohua found that the overall efficiency of rural ecological environment management in Gansu Province is relatively high [11]. Wang Bing & Ma Yuan found that from 2012 to 2021, the environmental and ecological governance capacity of the Yangtze River Economic Belt maintains an upward trend [12], Lin Qiong, Cheng Li & Wen Chuanhao found that the overall level of environmental governance efficiency in China's provinces and cities is good, but it shows a trend of slight decline in fluctuations [13]. While, Peng Yu & Zhang Dengfeng found that the differences in ecological environment governance efficiency between the Yangtze River Delta region are not significant. In addition, some studies have found that the efficiency of ecological governance is improving [14]. Yang & Zhang found that the efficiency of regional ecological environment governance in China showed an upward trend from 2003 to 2014 [15].",
    "Throughout the existing literatures, due to differences in research objects and evaluation indicators used, although there are some common research findings, further research on the efficiency of ecological environment governance is still needed. In view of this, this article analyzes the efficiency of ecological environment governance in various cities in Henan Province based on relevant data from 2013 to 2018, and considers decisions to improve the efficiency of ecological environment governance. In order to calculate the efficiency of ecological environment governance in Henan Province from two perspectives: static and dynamic, this article employs DEA models, such as BBC model and Malmquist index model respectively. The DEA model usually divides index into two categories: input and output index. Therefore, input and output index for ecological environment governance have been constructed. The input indexes of ecological environment governance include two characterization layers: environmental pollution and resource consumption. The output indexes of ecological environment governance are represented by their effectiveness, ecological improvement. The specific index system is shown in Table 1. environment governance efficiency of various cities in Henan Province. As shown in Table 2, the annual average value of ecological environment governance efficiency in Henan Province is less than 1, but it is increasing year by year, which indicates that the overall level of ecological environment governance efficiency in Henan Province is not high and has not reached the effective level of DEA. Among the five cities in the north, Puyang has a relatively high efficiency of ecological environment governance, while Xinxiang and other four cities have a fluctuating and improving trend of ecological governance efficiency. The efficiency of ecological environment management in the central region is on the rise, indicating that the effect of ecological management is obvious, and the efficiency of Sanmenxia, Pingdingshan and Shangqiu is low. In the southern region, the ecological environment governance efficiency of Xinyang is high, but it showed a downward trend after 2015, while Nanyang and Zhumadian show a fluctuating trend of improvement in ecological governance. In Henan Province, the efficiency of ecological environment governance is high in the central part and relatively low in the north and the south, a possible reason is that the industrial adjustment and environmental governance measures in the central part of Henan Province have achieved remarkable results under the background of the high-quality development of the Yellow River basin and the coordinated development of the national central city of Zhengzhou and other regional strategies. Table 3 shows the dynamic decomposition of ecological environment governance efficiency of Henan Province based on Malmquist index. During the period of from 2013 to 2018, the total factor productivity (TFP) of ecological environment governance in Henan Province shows a pattern of first decreasing and then increasing, and the value of TFP in 2017-2018 was greater than 1. The decomposition of TFP shows that the average scale efficiency is 1.013, which is high and on the rise, while the average rate of technological progress is only 0.814 and low, which indicates that the driving force for improving the efficiency of ecological environment governance in Henan Province mainly comes from scale efficiency, and the role of technological progress in improving the efficiency of ecological environment governance in Henan Province has not been fully brought into play. The technological innovation ability of ecological environment governance urgently needs to be improved. The comprehensive technical efficiency value is basically greater than 1, which indicates that the input of ecological environment governance in Henan Province is basically in an effective state except for the period from 2015 to 2016. However, its decomposition shows that the pure technical efficiency is low while the scale efficiency is high, which indicates that the allocation and management capacity of ecological environment governance input in Henan Province is low, and the role of resource input in environmental governance is not fully played, the role of technological progress is weak. Based on the relevant data from 2013 to 2018, this paper adopts the DEA-BCC model and Malmquist index to conduct static and dynamic measurement of ecological environment governance efficiency in Henan Province. The findings are as follows: Among them, Zhengzhou, Kaifeng and Luoyang have relatively good environmental governance effects, while Shangqiu, Nanyang and Pingdingshan have relatively low environmental governance efficiency. The ecological environment governance rate of different cities shows great differences, indicating that the ecological environment governance of Henan Province is uneven, and the overall lack of balance.",
    "Li Songhua et al.: Research on the Evaluation of Ecological Environment Governance Efficiency: Based on Panel Data from Henan Province progress in improving the efficiency of ecological environment governance in Henan Province is not fully brought into play, and the technological innovation ability of ecological environmental governance urgently needed to be improved. Therefore, in order to improve the efficiency of ecological environment governance in Henan Province, it is necessary to (1) optimize the investment in environmental governance and improve environmental protection technology. In order to improve the comprehensive technical efficiency and pure technical efficiency, Some measures should be implemented, such as Introducing technology projects that can effectively improve environmental governance, constantly improving the scientific and technological level in the field of environmental governance, paying attention to the research and development of practical technologies and equipment for environmental governance, training relevant professional and technical personnel, and stimulating innovation vitality. (2) Establish and improve the supervision mechanism of environmental governance and enhance the intensity of supervision. The utilization degree of resource input and the efficiency of resource allocation are particularly important for improving the efficiency of environmental governance. Therefore, it is necessary to continuously improve the policy system and supervision mechanism of environmental governance, and clarify the supervision responsibility; It is necessary to further promote the openness and transparency of environmental governance to ensure the effective implementation of environmental governance supervision; Strengthen the training of supervision methods, strengthen the supervision of environmental protection funds and the operation of related facilities. This work was financially supported by General project of humanities and social science research in universities of Henan Province (2022-ZDJH-00237)."
]