[
    "Yanqi Zhao '?/3, Yue Zhang 1, Ying Yang ’*, Fan Li 1, Rongkun Dai !, Jianlin Li 1.3, Mingshi Wang 1/23 and Zhenhua Li 173 Citation: Zhao, Y.; Zhang, Y.; Yang, Y.; Li, F.; Dai, R.; Li, J.; Wang, M.; Li, Z. The Impact of Land Use Structure Change on Utilization Performance in Henan Province, China. Int. J. Environ. Res. Public Health 2023, 20, 4251. https:// doi.org /10.3390/ijerph20054251 Abstract: Because of the trends in population growth and rapid industrialization and urbanization, the intensity and structure of land use are undergoing great changes. Henan Province is an important economic province and a major grain producing and energy consumption area, and its land use plays a key role in the sustainable development of the whole of China. This study takes Henan Province as the research object, selects panel statistical data from 2010 to 2020, and discusses the land use structure (LUS) in Henan Province in terms of three aspects: information entropy, analysis of land use dynamic change, and land type conversion matrix. Based on the indicator system “social economy (SE)—ecological environment (EE)—agricultural production (AP)—energy consumption (EC)”, a land use performance (LUP) evaluation model was constructed to judge the performance of various land use types in Henan Province. Finally, the relational degree between LUS and LUP was calculated through the grey correlation. The results show that among the eight land use types in the study area since 2010, land used for water and water conservancy facilities increased by 4%, In addition, transport and garden land changed significantly, and was mainly converted from cultivated land (decreased by 6674 km?) and other land. From the perspective of LUP, the increase in ecological environment performance is the most obvious, while agriculture performance is lagging behind; it is worth paying attention to the energy consumption performance, which is decreasing year by year. There is an obvious correlation between LUS and LUP. LUS in Henan Province presents a gradually stable state, and the transformation of land types promotes LUP. Proposing an effective and convenient evaluation method to explore the relationship between LUS and LUP is very beneficial in helping stakeholders to actively focus more on optimizing land resource management and decision making for the coordinated and sustainable development among agricultural, socio- economic, eco-environmental, and energy systems. Copyright: © 2023 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by / 4.0/). The land resource is an important spatial carrier of human socioeconomic development [1]. Furthermore, land use and land cover change (LUCC) plays a significant role in regional and global environmental changes [2]. In the past several decades, because of population growth, industrialization and urbanization, climate change, etc., China’s social and eco- nomic achievements have been accompanied by major changes in land use structure (LUS), which in turn accelerated some serious consequences, such as spatial sprawl and reduction in vegetation cover, inefficient land use or even degradation, escalating environmental pol- lution and urban water logging, heat island effects, and an increasingly tense relationship between people and land [1,2]. Therefore, it is of great important to balance land utilization, economic growth, and environmental sustainability in the process of development [3]. The efficiency of LUS is vital for the level of sustainable development [1] and has be- come a growing concern in urban design, city management, and land use analysis [1,4]. The current studies of LUS focus on LUCC’s spatial-temporal pattern or evolution of land use structure using spatial correlation and statistical models [5,6] or geographic methods [7,8], mechanisms, or driving factors of land use change. For example, using time series Landsat imagery and the Random Forest algorithm, Shen et al. [9] detected the land use conversions of the Huangshui River Basin of China. Using the FLUS model, Xuet al. [10] simulated land use pattern evolution in Jincheng, Shanxi Province. Huang et al. [11] simulated the temporal and spatial characteristics of urban land use in Wuhan from the past to 40 years into the future. Wu et al. [2] and Burra et al. [12] revealed the driving mechanism of land use change. To solve the fragmentation problem in China, Zhang et al. [13] also studied how institutional change affects diverse governance structures of land consolidation. In addition, there are scholars who have studied land use structure optimization [14-16], and he relationships between population [17,18] and energy consumption [19] and land use.",
    "The purpose of studying land use structure (LUS) is to improve land use performance (LUP). That is, the premise of the rational layout and optimization of land structure finally ensures that the land use achieves good economic, social, and environmental effects. In erms of industrial land efficiency, Chen et al. [20], Dong et al. [21] and Chen et al. [22] researched the impact mechanism of different ranks of development zones and industrial ransformations on land use efficiency. Regarding agricultural land use, Li et al. [23] proposed an agricultural land use decision support system (LDSS) and Ustaoglu et al. [24] developed a spatial model for land suitability assessment to study the comprehensive benefits of land use. For efficiency of urban land use, using Data Envelopment Analysis (DEA) and the Tobit model, Gao et al. [25], Ding et al. [3] and Song et al. [26] estimated he land use efficiency and its possible determining factors for the resource-based cities or urban agglomerations in China. He et al. [27] and Zhang et al. [28] also studied the spatial effects of urban form on land use efficiency and the optimizing model of urban land use structure [4]. Understanding the relationship between performance and different types of land use has been of great significance [17] to optimizing land resource allocation and improving utilization efficiency in order to achieve regional sustainable development [1]. The above researchers have made significant achievements in the related fields of LUCC. Previous research objectives chiefly focused on improving the efficiency of LUS, and optimizing the allocation of land resources and the formulation of land use policies [1], but rarely involved environmental protection and energy consumption. In particular, although some valuable results have been obtained, few studies have paid attention to the correlation between land use structure change (LUSC) and land use performance (LUP), due to the interactions and multiple efficiencies among the ecological environment, social economy, agricultural production, and energy consumption. Henan Province is an important economic province and a major grain producing and energy consumption area in China, having a large population but less arable land per capita. The degree of land development and utilization has been very high. The comprehensive effect of population, urbanization, and industrialization has created tension around land resources, and significant changes have taken place in land use types and structures over the past decades [7]. In some regions, the contradiction between land supply and demand is acute, environmental problems are prominent, natural disasters occur frequently, and land use efficiency and sustainable ability are reduced. It is difficult to guide the land use system towards a sustainable track if the driving factors and key mechanisms of coordination among the complex coupled systems cannot be scientifically identified [29]. Considering the gap in research and the actual situation of Henan Province, to examine possible policy and measures to attain sustainable land use [1] this study aimed to: (1) clarify the structural change characteristics of eight land use types; (2) evaluate the performance of all types of land use in Henan Province; and (3) precisely uncoverthe relationship between land use structure (LUS) and land use performance (LUP) in Henan Province. So, in this study, an LUP evaluation system was proposed and the relationship between LUS and performance was derived using the grey relational degree for the identification of the core driving factors of land use change. This can provide a decision-making basis for land resource management in strategic adjustment among agricultural, social economic, ecological, energy, and sustainable land use. The remaining sections of the paper are organized as follows. In Section 2, the background of the research area and the data source and processing are introduced. Section 3 describes the methods and procedures, including theoretical framework, calculation method, and analysis process. Finally, Section 4 presents conclusions and some related policy implications. Henan Province (110°21' E-116°39 E, 31°23’ N-36°22' N) is located in central-eastern China, in the middle and lower reaches of the Yellow River (Figure 1). It consists of 18 cities with a total area of 167,000 square kilometers, and in 2021 had a total population of 98.83 million (ranked third in China) and GDP of CNY 5,888.74 billion (ranked fifth) (HSB, 2021 [30]). Henan Province, with a cultivated area of 7.514 million hectares, mainly in the form of plains and basins, is the only province in China that crosses the Yangtze, Huaihe, Yellow, and Haihe River basins. The eight types of land use in Henan Province are cultivated land (49.49% of the total land area), forest land (21.19%), residential land (12.4%), garden land (1.4%), grassland (4.11%), transportation land (2.6%), water area (6.36%), and other land (2.46%).",
    "Based on data accessibility and integrity, the research period of this study is set as 2010-2020. Basic data mainly include the following categories: (1) Land use data of Henan Province is from the Natural Resources Bulletin of Henan Province (DNRHP. [31]). (2) The selected data of ecological environment, social economy, agricultural production, and energy consumption of Henan Province come from the Bulletin of National Economic and Social Development of Henan Province (HSB. [32]), the Statistical Yearbook of Henan Province (HSB. [30]), and the Natural Resources Bulletin of Henan Province (DNRHP. [31]). (3) The remote sensing data of changes in land use types of 2010, 2015, and 2020 with spatial resolution of 1 km x 1 km in Henan Province were collected from the Cloud Platform of Resource and Environment Science and Data Center, Institute of Geographic Sciences and Natural Resources Research, Chinese Academy of Sciences. We first use the 1 kmx1 km spatial grid data of remote sensing images of Henan Province in 2010, 2015, and 2020, which we interpret as the basic unit to perform evalua- tion of the land use type transformation (LUTT). According to the existing statistical data (NBSC. [33]), the land use types can be divided into eight categories, namely, cultivated land, garden land, forest land, grassland, wetland, land used for urban, rural, industrial, and mining activities, land used for transport, land used for water, and water conservancy facilities. Then, the spatial-temporal evolution characteristics and influencing factors of coupling coordination among multiple land use efficiencies in agriculture, socio-economy, and ecology are further analyzed [29]. Furthermore, the land use performance is compre- hensively evaluated according to the data of the social economy, ecological environment, agricultural production, and energy consumption in the Statistical Yearbook. Land use and land cover change (LUCC) is the result of interaction between natural and human factors [7]. From the perspective of land use structure (LUS) change and land use performance (LUP), this paper studies the characteristics of LUS and its correlation with LUP in Henan Province, and then studies the coordination between land use and social economic development and environment. The analytical framework for the research is shown in Figure 2. First, the area data of different land use types in Henan Province from 2010 to 2020 were selected to calculate the information entropy, to then analyze the dynamic degree of land use. At the same time, ArcGIS was used to extract the land remote sensing images of Henan Province during the research period, and the land use transfer matrix was calculated to obtain the transformation of land types and the change process of LUS. Second, we integrated the social economy, ecological environment, agricultural production, and energy consumption to build a comprehensive evaluation model of LUP in Henan Province. LUP evaluation is the basic goal of promoting the optimal allocation of land resources and realizing the rational utilization of land resources, which is conducive to the policy formulation of strengthening land use and optimizing land supply structure. Then, the correlation between LUS and LUP in Henan Province was analyzed using the grey relational degree model. Finally, through the above research work, the internal mechanism between land use transformation and social economic development in Henan Province was revealed. This enables rational planning of the LUS in Henan Province, takes full advantage of the change in land use types in Henan Province to drive the transformation of the industrial structure, and achieves better development of the social economy, ecological environment, and agricultural production. A land use system is complicated and associated with nature, society, economy, pro- duction, and consumption [34,35]. It is also a typically controllable and open dissipative system with specific structures and functions [35,36]. Information entropy of land use struc- ture (IE,.us) is a commonly used indicator [35] to measure the order degree of a regional land use system and determine its evolutionary direction [35]. The more orderly a system, the lower the information entropy; conversely, the more chaotic the system, the higher the information entropy. The order and equilibrium degree of the land use system can be described by information entropy: where IE; ys is the information entropy of land use structure; the larger the information entropy, the more complex the land type and its internal structure. pj = A;/A denotes the n proportion of land type iin total area A, )° p; = 1; A; is area of the land type i; A is total i=1 n The dynamic degree of land use (DD,y) can intuitively reflect the range and rate of change in each land type during the specific study period, which helps in the study of the mechanism of the change in land use type. The formula is as follows: where Ua and Uj represent the area of a land use type at the beginning and end of the study, respectively. T is the study period; the value of DDjy is the annual change rate of some land use type, where the unit is year.",
    "The land use transfer matrix is the main tool for specifically and quantitatively reflect- ing the structural characteristics of land use change and the mutual conversion direction of various land use types. Through the interact module of ArcGIS and the data perspective of Excel, the interpreted remote sensing images of 2010, 2015, and 2020 were folded and analyzed to obtain the land use transfer matrices of 2010-2015 and 2015-2020.The land use transfer matrix is as follows: where T;j is the land area converted from category i to j during the study period. represents the land use types. The sum of each row of the transfer matrix represents the total area of type i land use at the beginning of the study, and the value of each row represents the transfer purpose and scale of land type. Land use performance is a systematic representation of land resource utilization mode and benefit. It is led by the government with the aim of building scientific and sustainable land use patterns and achieving maximum social and economic benefits under the premise of maintaining a good ecological environment. In terms of the selection of evaluation indexes, the evaluation of land use performance has gradually developed from a single indicator reflecting the efficiency of a certain aspect to a multi-index comprehensive system including society, the economy, and the environment [1]. Combined with the actual land use situation in Henan Province, this study selected 20 indicators from four criteria layers of social economy (SE), ecological environment (EE), agricultural production (AP), and energy consumption (EC) to construct a comprehensive evaluation index system (Table 1) for regional land use performance measurement, and then explored the effects of land use and existing problems in Henan Province. In order to eliminate the dimensional difference between different indicators that make comprehensive evaluation impossible, the standardized formulas of the original data are as follows: where x! ‘i is the standardized index value of the j-th evaluation index in the i-th year; x;; is its original value; Xjmax ANA Xjmin are the maximum and minimum initial values, respectively, of the j-th index in all years. To avoid the homogenization defect of the single weight method, the combinatorial method of the entropy weight and variation coefficient is used to assign weights. The entropy weight formula is as follows: where Dj is the entropy weight value of the j-th index; 0 < Dj<1 and int Dj =1. Mjis the entropy value of the j-th index calculated by the information entropy.bj; = Yij Jy Yij is the proportion of the j-th indicator in the i-th year (bjjlnbj; = 0 if bij = 0); Yj; is its standard value; i=1,2,...,n,j=1,2,...,m. where W, is the weight value of the j-th index determined by the variation coefficient. V; and S j are respectively the variation coefficient and standard deviation of the j-th index; Xj is the average of the j-th indexes, j=1, 2,... ,m. According to the principle of the multi-factor weighted score method, the evaluation model of regional land use performance is obtained as: where Cj represents the land use performance scores, ranging from 0 to 1. Xi is the normalized value of the j-th indicator in the i-th year (i=1, 2, ..., n;j=1,2,...,m). P is the comprehensive performance value of land use. Nj is the combined weight of each index. Grey system theory is an interdisciplinary research field [37]. For land use systems, grey relational analysis (GRA) is mostly manifested in the interaction or relation between the elements of land resources [1,37]. Its basic idea is the geometric similarity of time series [1]. This research used GRA to analyze the grey correlation grade between the land use performance value, land use type, and information entropy, and to further describe the evolution pattern of the system [37]. The land use performance index {Cc } = [C1, Co,.. +, Cu] is selected as the parent sequence, and the land use structure and its characterization value information entropy {C;} = [Cj1, Ci2,...,Cin], which affected the level of land use performance, are taken as the subsequence. Then, the correlation coefficient of the parent and subsequence at point K is as follows: where ¢; is the correlation coefficient of C and C; at time k. |C, — Cjx| is the absolute differ- ence between parent sequence and subsequence at time k (k= 1, 2...n). minmin| Cy — Cix| i and maxmax|C; — Cix|, respectively, are the minimum and maximum absolute difference i k at each time. p is the resolution coefficient, 0 < o < 1, The smaller the value, the higher the resolution; p = 0.5 in this paper.",
    "The calculated information entropy (IE) of land use structure in Henan Province (Table 2) showed that the total trend increased gradually during the study period (2010-2020), but the rise was slower. (1) From 2010 to 2015, it increased slightly with an average annual increase of 0.16%. During this period, the area of cultivated land, forest land, garden land, and grassland decreased, while land used for urban, rural, industrial, and mining activities, transport, and water and water conservancy facilities increased significantly. The size of the city gradually increased. (2) The IE decreased slightly in 2016; however, it increased slightly again in 2017 and increased by 8.465% in 2018. That is, in the past two years, the order degree of land use structure in Henan Province decreased. Facts also indicate that the area of cultivated land was reduced by 19,600 hectares because of construction occupation of land such as transportation, water and water conservancy facilities, disaster-destroyed farmland, and agricultural structure adjustment. (3) From 2018 to 2020, the IE of land use structure gradually declined slightly, with an average annual decrease of 0.74%. This is largely because the pattern of the cultivated land protection as a priority in Henan Province was established against the background of the land management regulations proposed by the Ministry of Land and Resources to improve land use efficiency and increase the balance of land use structure. The pattern comprehensively applied administrative, economic, technical, and legal factors, among others, to manage and control the cultivated land and implement the balance system of cultivated land occupation and compensation. To sum up, during the study period, the range of the change in land use information entropy (IE) in Henan Province is smaller and its structure is relatively stable. With the scientific planning of land resources by the government, the land type tends to be rationalized, and the IE value of land use will become smaller and smaller. Figure 3 shows the area change in various land types in Henan Province from 2010 to 2020. Among all the land types in Henan Province, cultivated land occupies a large share (accounting for more than 40% of the total area), but from 2010 to 2020, the cultivated land area shrank year by year and gradually transformed into other types of land, such as increased land used for water and water conservancy facilities, transportation, and grassland. The range of forest land change is not significant. The area of other land was reduced by 11.75%, and mainly converted into part of the cultivated land and forest land. Thus, the cultivated land and forest land was still the main land type in Henan Province at the end of 2020. According to Formula (3) the average annual change rates of each land use type over five and ten years from 2010 to 2020 can be calculated (Table 3). The results showed that: (1) The fastest changing rate in ten years was land used for water and water conservancy facilities, followed by land used for transport, garden land, other land, and forest land. Simultaneously, the annual change rate of land used for urban, rural, industrial, and mining activities was relatively small, and there was a trend of a year-by-year decrease in cultivated land. (2) From 2010 to 2015, the largest change was in land used for transport, with an annual growth rate of 4.22%. It was followed by land used for urban, rural, industrial, and mining activities, and water and water conservancy facilities, with annual growth rates of 1.34% and 0.35% respectively. The smallest changes were in cultivated land and forest land, with an annual rate of decrease of 0.18%. (3) From 2015 to 2020, the annual increase in land used for water conservancy facilities reached a rate of 71.05%, which is principally due to the policy implemented in Henan Province in 2017 of returning farmland to forest and grassland, and obviously speeding up the construction and reinforcement of water conservancy facilities, and improving soil and water conservation and water ecological protection. As a result, the vegetation coverage rate of Henan Province increased from 57.3% in 2000 to 66.2% in 2018 (Figure 4). The next obvious increase was in transport, garden land, and other land. The land type transfer matrix cannot only reveal the changes in the area in each type of land use, but also enables a visual and clear judgment of the change trajectory of land types (Figure 5). (1) The land type change in Henan Province from 2010 to 2015 was primarily manifested by the increase in land used for transport, urban, rural, industrial, and mining activities. Most of these increases came chiefly from the cultivated land, with a transfer area of 756.43 km2. Other undeveloped land was transformed into land used for water and water conservancy facilities, and a small part of land was used for transport. (2) The key change in land types from 2015 to 2020 was the transfer of cultivated land to land used for urban, rural, industrial, and mining activities (91.87 km?), transport land (726.38 km?), and garden land (188.07 km?). Other land mainly transformed into land used for water and water conservancy facilities. Overall, in the past decade, all converted land mainly came from the reduction in cultivated land and other land. (3) From 2010 to 2020, the general trend is that cultivated land was mainly converted into land used for urban, rural, industry, and mining activities, water area and water conservancy facilities, and grassland. Other land was mainly converted into forest land. The land for water area and water conservancy facilities increased substantially, mainly from cultivated land.",
    "Through the calculation of the regional land use performance evaluation model, the performance values of agricultural production, social economy, ecological environment, and energy consumption, and the comprehensive performance in Henan Province from 2010 to 2020 were obtained (Figure 6). APP is in a steady and slow rising state. As a major grain-producing province, Henan Province has high agricultural production efficiency, so it reached 0.921 in all types of land use performance in 2010, and reached a maximum of 0.97 in 2020. The agricultural performance fluctuated slightly from 2017 to 2020. Nevertheless, the overall trend was still increasing, mainly because the sown area and land reclamation rate decreased slightly year by year in this period. This also reflects the fact that, since 2017, part of the cultivated land in Henan Province has been transformed into construction land, but at the same time, agricultural production technology and efficiency have been greatly improved to a certain extent. EEP was the lowest among the four performance indicators at the beginning of the study period, with a performance value of 0.344 in 2010. There was even a decline between 2013 and 2014. This was mainly due to a decrease in ecological and environmental water replenishment (from 669 million m3 to 566 million m°). However, it was the fastest growing performance from 2014 onward, and reached the maximum among all performances at the end of the study period. In 2017, the work of returning farmland to forest played an increasingly significant role in conserving water sources, wind prevention and sand fixation, and improving the ecological environment, and achieved good results. In recent years, Henan Province has also augmented the construction of urban environmental infras- tructure, enhanced the disposal capacity of domestic waste, and reduced environmental pollution. While controlling pollution in key industries, Henan province has also enlarged the per capita public green space and coverage in urban areas, which reached 14.4m? and 25.1% by 2020, respectively. These combinational measures rapidly promoted the benefits of the ecosystem. As a result, the environmental quality of Henan Province has been continuously improved. The development trend of SEP is basically similar to that of APP, which is mainly related to the fact that Henan Province is a major agricultural province, and agriculture plays a pivotal role in the economic development structure. SEP reached the highest value in 2018, and its proportion of tertiary industry increased from 28.1% in 2010 to 42.7%. Accompanied by optimization and adjustment of the industrial structure, SEP of Henan Province has been greatly improved in the past decade. With the growth in population, and effective government support of employment, medical insurance, housing, etc., the output values of industry and agriculture have been improved year by year. Performance values dropped to 0.959 and 0.933 between 2019 and 2020, respectively, because of the COVID-19 epidemic, but Henan Province’s economy has still maintained a steady and sustained positive trend. Overall, ECP showed a downward trend. Since energy consumption per unit GDP decreased by 13.708% from 2010 to 2012, the performance value (inverse index) increased from 0.842 to the maximum of 0.87. ECP presented a fluctuating decline from 2013 to 2020, with an average annual decrease of 0.017. Although energy consumption increased from 21.09 million tons of standard coal to 227.52 million tons of standard coal during this period, carbon emission intensity and energy consumption per unit GDP decreased year by year and reached the lowest value at the end of 2020, with an average annual decline of 3.025% and 5.054%, respectively. This reflects the increasing demand for energy in Henan Province because of population growth and economic development. Facing the arduous task of reaching a “carbon peak” before 2030 and the corresponding policies to reduce carbon emissions, Henan Province has achieved remarkable results in industrial and energy consumption structural adjustment and environmental governance. The increase in the new area of farmland returning to forests has enhanced the capacity of forest carbon sinks and alleviated the carbon emission problem. Consequently, the relationship between energy consumption and the ecological environment is inseparable. That is, effective ecological environment treatment can relieve the pressure of carbon emissions. The CP of land use in Henan Province increased from 0.73 in 2010 to 0.929 in 2020, and the performance level has been continuously improved, with the maximum increase from 2016 to 2017 being 0.053. This is attributed to the implementation of the concept of green coordinated development in Henan Province in recent years. The various policies issued pay more attention to the sustainable and harmonious development of humans and nature, which continuously strengthens the coordination of the elements within the land use system.",
    "The grey correlation method (Equations (10) and (11)) was used to calculate the change in land use structure and its information entropy in Henan Province from 2010 to 2020. The grey correlation classification is: 0-0.6 is a relatively weak correlation; 0.6-0.8 indicates gen- eral correlation; and 0.8-1 is a relatively strong correlation [1]. Generally, a grey correlation degree of greater than 0.6 indicates that there is an obvious correlation between land use structure (LUS) and land use performance (LUP). That is, the closer the relationship, the greater the impact on land structure. From the calculation results (Figure 7), the correlation degree between land use struc- ture (LUS) and performance of social economy (SE), ecological environment (EE), agri- cultural production (AP), and energy consumption (EC) was relatively close. During the research period, the IE of land use structure was increasing year by year, indicating that the stability of land use types and rationality of land use structure in Henan Province were reinforced. The correlations between agricultural benefits and land use structure (LUS) in Henan Province were, in order, information entropy (0.989), land used for urban, rural, industrial, and mining activities (0.989), cultivated land (0.986), forest land (0.977), garden land (0.927), land used for transport (0.84), and other land (0.832). As a major agricultural province, these correlations between agricultural production performance (APP) and LUS show that with the expansion in urban construction land in recent years, the occupation of agricultural land has become more prominent, which should be of great concern. The correlation degree between socio-economic performance (SEP) and LUS was consistent with that mentioned above of APP and LUS. Urban expansion was closely related to social and economic development, and the cultivated land and the forest land also had a strong correlation with the social economy. All these results indicate that social development has a relatively significant impact on land structure. Ecological environment is a sign of the benign development of land utilization. During the study period, from the ecological performance associated with LUS, there was a strong correlation degree in land used for transport (0.921), garden land (0.897), forest land (0.865), land used for urban, rural, industrial, and mining activities (0.864), information entropy (0.862), cultivated land (0.847), land used for water and water conservancy facilities (0.833), and other land (0.739), and grass land had a general correlation (0.675). On the basis of the relational degree between ecological performance and LUS, the transportation and green space coverage have a significant influence on the ecological environment. The strong correlation degree between energy consumption and LUS, ranked from large to small, was: cultivated land (0.978), information entropy (0.964), forest land (0.961), land used for urban, rural, industrial, and mining activities (0.957), garden land (0.916), other land (0.851), and land used for transport (0.829); land used for water and water con- servancy facilities (0.742) and grassland (0.62) were generally correlated. It can be seen from this correlation that cultivated land, green space, urban construction, and industrial and mining production activities are closely related to energy consumption. That is, as a major agricultural province, Henan Province has a large demand for energy from agricultural mechanized production, urban construction, and industrial and mining activities. The calculation results of grey relational analysis (GRA) show that the relationship between comprehensive performance and LUS is as follows: land used for urban, rural, industrial, and mining activities (0.983), information entropy (0.98), forest land (0.978), cultivated land (0.962), garden land (0.944), land used for transport (0.859), other land (0.816), land used for water and water conservancy facilities (0.763), and grassland (0.631). Compared with the other subsystems mentioned above, it was found that the correlation degree between urban construction, industrial, mining, and agricultural activities, forestry and garden land, and LUP is greater than 0.9, indicating that industrial and agricultural production has a strong response to land use. The correlation between grassland, water area, and LUP was always at a general level; that is, they make little contribution to the benefits. From the perspective of the correlation between various subsystems and LUP, Henan Province has a significant impact on land resources in urbanization construction and land used for industrial and mining enterprises. At the same time, the ecological environment has also been greatly improved through the policy of returning farmland to forests. Through correlation analysis and the significance test, the results (Figure 8) show that there was a significant correlation between land use type and land performance. The ecological environment performance (EEP) and comprehensive performance (CP) were positively correlated with forest land, garden land, land used for urban areas and villages, industrial and mining activities, water area and water conservancy facilities, and transportation, but significantly negatively correlated with cultivated land and other land. There was no significant correlation between socio-economic performance (SEP) and energy consumption performance (ECP) on forest land and garden land.",
    "In this study, analysis of land use type transformation, information entropy, and grey relational analysis were applied to estimate the efficiency and order of land use structure and their grey relational grade from the perspective of the social economy, ecological environment, agricultural production, and energy consumption performance in Henan Province of China from 2010 to 2020. Given this assessment, the conclusions are as follows. Based on the matrix analysis of land use type transformation, in the land use structure of Henan Province in the past ten years, among all land types, cultivated land occupies the largest proportion, although it decreased year by year and transformed into other land uses. In terms of the land change rate, land used for water and water conservancy facilities, transport, urban, rural, industrial, and mining activities, and other land, are more significant. Although different land use types changed to different degrees during the study period, the information entropy of the land use system in Henan Province fluctuated little and its stability gradually strengthened. In land use performance (LUP), in the past decade, Henan Province achieved the best grade in the ecological environment, but the lowest score in terms of energy consumption. In addition, the comprehensive performance showed an upward trend. According to the correlation degree between land use structure (LUS) and land use performance (LUP), there was a significant correlation between the performance of each subsystem and land use types (>0.6) during the study period. Moreover, agricultural production and social economy are closely related to cultivated land, forest land, and land used for urban, rural, industrial, and mining activities, while the correlation degree with other land is the lowest. This indicates that the structure of land type has significant influence on the performance of land use. As a major agricultural, economic, and populous province in Central China, Henan Province has the most active economic activities and outstanding contradictions between human and land resources. It is necessary to study the change characteristics of land use types and land use performance, which plays an imperative role in guiding the sustainable use of land resources and ensuring the benign interaction between the environment and social economy. As two essential dimensions of land use evaluation, structure and efficiency of land use have a momentous impact on regional sustainable development. The research identified that several problems were found in the land use of Henan Province during its development, for example, the conversion of cultivated land to construction land, low efficiency and high emission of energy use, and the unbalanced development of the east and the west. As a major grain-producing province in China, Henan Province plays a crucial role in national food security, so it is necessary to scientifically plan agricultural production and continuously optimize the structure of industrial and agricultural land use. Furthermore, in the process of boosting the market-oriented allocation of land resources in the future, it is necessary to advance the efficiency of land use while obtaining land income. Judging from the ecological performance of land use, Henan Province has made good achievements in ecological environment governance in the past decade, which is inseparable from the external effect of the implementation of ecological environmental protection policies on land type adjustment. With the implementation of various land policies in Henan Province, especially returning farmland to forests and developing of clear water areas and green mountains, the change in land types has been accelerated. The adjustment of these forms of land cover not only achieved obvious ecological benefits, but also enhanced the comprehensive performance of land use as a whole. At the same time, they have also played a role in promoting the social economy and sustainable development. These factors further confirm the vital importance of guiding policies for the optimal allocation and sustainable utilization of land resources. In the future, we should further optimize the energy and industrial structure, strengthen environmental monitoring, and execute measures such as cleaner production, energy conservation, and emission reduction. Author Contributions: Y.Z. (Yanqi Zhao): Conceptualization; Formal analysis; Funding acquisition; Writing—Review and Editing. Y.Z. (Yue Zhang): Data curation; Methodology; Validation; Software; Writing—Original draft preparation. Y.Y.: Investigation; Resources. F.L.: Supervision. R.D.: Visual- ization. J.L., M.W. and Z.L.: Project administration; Funding acquisition. All authors have read and agreed to the published version of the manuscript.",
    "Funding: This work was supported by the Key Scientific Research Projects of Colleges and Univer- sities in Henan Province (234610002 and 22A170009) and National Natural Science Foundation of China (52174073). Data Availability Statement: No new data were created or analyzed in this study. Data sharing is not applicable to this article."
]