[
    "Citation: Su, X.; Shi, J.; Wang, T.; Shen, Q.; Niu, W.; Xu, Z. More Income, Less Pollution? How Income Expectation Affects Pesticide Application. Int. J. Environ. Res. Public Health 2022, 19, 5136. https:// doi.org/10.3390/ijerph19095136 Abstract: Farmers are still the foundation of China’s current “small, scattered, and weak” agricultural production pattern. As such, increasing guidance for reduction response behavior is central to reducing agricultural pesticide use. Following this pesticide reduction logic, four of the most widely promoted pesticide reduction technologies, including light trapping, biopesticide application, healthy crop growth, and insect-proof net technologies, were selected, and a theoretical analysis framework of farmers’ willingness to adopt these technologies was constructed based on the theories of value perception and planned behavior. An ordered logistic regression model is used to explore key factors behind current pesticide reduction technology perceptions, technology response willingness, and behavioral decisions of farmers in China, with survey data from 516 farmers in Henan Province. The results show that among the four pesticide reduction technologies, healthy crop growth technology is the most-appealing one for farmers, followed by insect-proof net technology and biopesticide application technology. The least-appealing one for farmers is the light trapping technology. Farmers’ perceived degree of income improvement from technology adoption is the main determinant of their willingness, which is positively signiﬁcant at a 1% conﬁdence level in all four models. In addition, farmers’ willingness to respond to technologies is also signiﬁcantly inﬂuenced by farmers’ perception of technical operational ability, perception of risk from adopting technology, government-related subsidies, government technical training guidance, trust in government promotion of technology, and perception of the government’s role in improving the external environment for adopting technology. Copyright: © 2022 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). Overreliance on chemical pesticides, together with long-term excessive and inefﬁcient use of pesticides in small-scale decentralized agriculture, has led to a series of problems such as non-point source pollution, environmental damage, declines in agricultural product safety, and risks to human and animal safety [1]. Therefore, more attention should be paid to protecting consumers and ﬁeld workers (farmers) from the risks to their health and harmful effects of using pesticides [2] and ingesting them with food and drinking water [3]. The Chinese government is concerned with the excessive and inefﬁcient application of pesticides and has introduced a series of policies to guide and reduce pesticide use in agriculture. In February 2021, the “Guiding Opinions of the State Council on Accelerating the Establishment and Improvement of a Green, Low-Carbon and Circular Development Economic System” and the “Central Document No. 1” (the ﬁrst policy statement released by central authorities each year) were released. Both documents proposed to “accelerate green development of agriculture” and emphasized this paradigm shift as a priority. Since the Ministry of Agriculture issued the “Action Plan for Zero Growth in Pesticide Use by 2020” in 2015, the demand for pesticides in China has shrunk steadily. In 2019, the commodity quantity of pesticides used in China was 1.456 million tons, down 3.2% compared with that in 2018. In 2020, the pesticide utilization rate of China’s three major staple foods reached 40.6% (Ministry of Agriculture and Rural Affairs, 2021), with an increase of 4% over 2015. However, the pesticide application rate in China is not only much higher than the world average but also far exceeds the optimal level in the economic sense [4]. Therefore, there is still ample opportunity to reduce the quantity of formulated product applied as well as the increase application efﬁciency. Thus, it is necessary to explore the path of pesticide reduction in depth. tives. The ﬁrst one is the farmer’s perspective, which mainly includes the characteristics of resource endowment and psychological perceptions. Farmers’ decision-making behavior around reducing pesticide use is affected by the gender of the household head, age [5], edu- cation level, family planting size [6], degree of part-time employment [7], health status [8], number of family laborers, source of family income [9], identity characteristics [10], etc. In addition, farmers’ expected cost savings and income improvement [11], ecological envi- ronment perceptions [12], risk preferences [1], public image [13], learning and operating ability perceptions, and sense of moral responsibility [14] can also signiﬁcantly affect their decision-making behaviors on reducing pesticides. Among these factors, farmers are more inclined to focus on whether reducing pesticide use can optimize their private economic goals by saving costs and increasing income [11]. Moreover, farmers’ understanding of the relationship between pesticide use and their own health can also inﬂuence their decisions to reduce pesticides. Empirical studies have found that farmers’ health awareness is one of the most important determinants inﬂuencing the intensity of pesticide application [3,15,16]. Farmers will experience varying degrees of pesticide exposure during pesticide application, which in severe cases can even lead to acute poisoning. About 7% of the agricultural population in the world is affected by pesticide poisoning [17,18]. From 2007 to 2019, only Chongming District, Shanghai, China, reported as many as 1182 cases of pesticide poisoning [19]. The increasing exposure to pesticides has led to an increasing number of farmers perceiving a greater health risk in the process of pesticide application reduction.",
    "The second perspective is based on the organization of the agricultural business. Pes- ticide reduction is inﬂuenced by the characteristics of agricultural business [20]. More moderate-scale agriculture operations [21], more embedded cooperative organizations [22], more service of scale operations, and a better division of labor transactions [23] can ef- fectively contribute to pesticide reduction. The third perspective focuses on the external institutional environment. Agricultural pesticide reduction has a positive economic exter- nality [23], which calls for government intervention to encourage farmers to reduce pesti- cide use. Government intervention mainly includes policy advocacy, project support [24], government subsidies, a system of proper rewards and punishments [25], institutional trust [26], social capital [27], and social norms [28]. The fourth perspective is the con- sumer perspective. Consumers’ purchasing preferences can signiﬁcantly affect agricultural production behavior. Therefore, through green product marketing, health information communication, and other methods [29], consumers can have a stronger passion for green agricultural products, and pesticide use can be reduced [30]. Although pesticide application involves multiple stakeholders, farmers are still the foundation of the “small, scattered, and weak” production pattern of China’s agriculture. Thus, raising farmers’ pesticide reduction awareness is an important logical prerequisite for reducing pesticides in agriculture. Following this logic, many scholars have studied pesticide reduction decision-making behavior from the farmer’s perspective. Wu et al. [31] ﬁnd that farm size is closely related to farmers’ pesticide use. Their study shows that a 1% increase in farm size induces a 0.5% decrease in pesticide use per hectare. Cheng et al. [21] examine the impact of networks embedded on farmers adopting green farming technolo- gies and ﬁnd that the role of the family farming area is more substantial than that of education level or annual family income in green technology adoption. Guo et al. [32] study farmers’ pesticide reduction behavior from a mutual perspective of social learning and social network and ﬁnd that farmers’ production experience and technical knowledge based on their social networks can motivate pesticide reduction behavior. Wang et al. [13] argue that the effect of adopting green agricultural technologies is heterogeneous in terms of risk perceptions and public image, and thus the government should implement var- ious guidance measures accordingly. Zhao et al. [14] study the impact of differences in socio-economic status among farmers on pesticide application behavior based on their sense of moral responsibility and conclude that some social norms such as rules of conduct, regulations, customs, and value standards can encourage farmers to reduce pesticide use. Xiang et al. [27] ﬁnd that the accumulation of farmers’ social capital can promote their willingness to adopt fertilizers and technologies for pesticide reduction. Among different dimensions of social capital, social trust plays a major role. In addition, given the obvious lack of incentives for pesticide reduction in China [33], Yang et al. [34] compare the effects of two types of incentives, “green technology training” and “green agricultural subsidies”, on farmers’ biopesticide application behavior. Li et al. [35] argue that promoting green production behavior depend more on value orientation, disciplinary supervision, and internalization of transmission, as well as guiding and incentive regulations. They argue that restraint regulation is prone to the “relative institutional failure” phenomenon, suggesting the necessity to build an interactive regulatory system that integrates formal and informal institutions. Yang et al. [30] argue that agricultural socialization services can effectively boost farmers’ participation in reducing agricultural pesticide use, and Qin et al. [36] argue that market agents such as cooperatives, contractors, and purchasers can also effectively curb excessive pesticide use among farmers. Compared with traditional high-toxicity and high-residue chemical pesticide applica- tion technology, pesticide reduction technology is a technology to reduce and control pests with higher efﬁciency. It uses physical, biological, ecological, and other pest prevention and control methods to replace traditional chemical pesticides. It aims to reduce the amount of pesticide application and improve the efﬁciency of pest control [37]. It is characterized by low toxicity, low residue, high efﬁciency, and low dosage requirements. Common physical prevention and control technology mainly includes light trapping technology and insect- proof net technology, which takes advantage of the characteristics of insects (e.g., phototaxis) to trap and kill crop pests. Biological prevention and control technology mainly includes biopesticide application technology and natural enemy preying, which controls insects and bacteria by using insects and bacteria themselves. Ecological prevention and control technology mainly includes improving water and fertilizer management and promoting farmland ecological engineering, intercropping and other biodiversity control methods of healthy crop growth technology, and artiﬁcially enhancing crop resistance to pests and diseases (as shown in Figure 1). Pesticide reduction technologies not only help reduce the health risks to farmers but also help improve the ecological environment and ensure the safety of agricultural products, and promote high-quality agricultural development [38].",
    "The above studies on farmers’ pesticide reduction behavior provide a rich theoretical foundation and empirical basis for this paper. In this study, the four most widely used pesticide reduction technologies, including light trapping, biopesticide application, healthy crop growth, and insect-proof net technologies, are selected, and a theoretical framework of farmers’ willingness to adopt pesticide reduction technologies is constructed based on the theories of value perception and planned behavior. This study also takes into account the current status of the adoption of pesticide reduction technologies by farmers in China. This paper uses survey data from 516 farmers in Henan Province to compare and analyze the commonalities and differences in farmers’ willingness and behavior in response to the four existing pesticide reduction technologies. It also reveals the key factors behind farmers’ perceptions of pesticide reduction technology, their willingness to adopt the technologies, and farmer behavioral decisions in China. This paper contributes to a deeper understanding of farmers’ willingness to respond to pesticide reduction technologies in a psychological sense. It also provides empirical implications for the government to promote pesticide reduction and also to maintain efﬁcient production in agriculture. Research on perceived value dates back to Porter, who argues that perceived value is the difference between a decision-maker’s perceived beneﬁts and perceived costs [39]. With this initial claim, scholars deﬁne perceived value from different perspectives: the overall utility based on comparing gains and losses [40], the ratio of perceived beneﬁts to perceived costs [41], and the trade-off between beneﬁts and costs in the whole process of multiple transaction behaviors [42]. Nowadays, the view of ‘balance between perceived beneﬁts and efforts’ is widely accepted [43]. Since then, some researchers have started to study farmers’ production behavior based on a value perception perspective. To explore the differences and inﬂuencing factors of farmers’ behaviors and willingness, they analyze the costs and beneﬁts behind farmers’ behavioral decisions mainly based on perceived beneﬁts and perceived risks [44,45], or construct farmers’ value systems from different value dimensions such as economic dimension, ecological dimension, emotional dimension [46,47], monetary dimension, social dimension, conditional dimension, and perceived dimension [48]. Numerous studies have shown that farmers’ value perceptions signiﬁcantly affect their willingness to adopt technologies [49,50], and generally, the stronger the value perception, the stronger the willingness [51]. Among them, expected beneﬁts and integrated value The theory of planned behavior, proposed by Ajzen [54], suggests that behavioral atti- tudes, subjective norms, and perceived behavioral control can jointly affect an individual’s intentions, which then affect their behavioral outcomes. Behavioral attitudes arise from the people’s expected outcome. Subjective norms are pressures and constraints from other individuals or organizational groups that make people perform or not perform a behavior. Subjective norms include ‘legal norms’ and ‘descriptive norms’ [55]. Perceived behavioral control is an individual’s prior self-perception of the ease or difﬁculty of performing a be- havior based on past experience and future expectations. It is inﬂuenced by the individual’s perception of their own resources, skills, opportunities, and other factors [56]. In general, the more positive the behavioral attitude of the subject is, the greater the subjective normative constraints are, and the stronger the perception of behavioral control and the intention to perform a certain behavior is. The theory of planned behavior has been widely used in research on farmers’ production behavior decisions because of its explanatory power in human’s general decision-making behavior [54]. Based on the theory of planned behavior, Xie et al. [57] explore the intrinsic attribution of the heterogeneity in farmers’ willingness to adopt ecological farming, and Hu et al. [58] studied farmers’ heterogeneous willingness to adopt rice and shrimp co-cropping models. Some researchers further expand the research framework of this theory, however, because they argue that the theory of planned behavior does not explain the deviation between the empirical results and the actual behavior of farmers [59]. In addition to behavioral attitudes, subjective norms, and perceived behavioral control factors, Shi et al. [60] intro- duce economic rationale and environmental values to study the factors inﬂuencing farmers’ willingness to adopt green production. Shi and Yu [61] introduce risk expectations and perceptions of citizenship to study the mechanisms of farmers’ homestead withdrawal and analyze the moderating factors behind farmers’ behavioral decisions. Zhang et al. [49] analyze the factors inﬂuencing farmers’ adoption of straw return technology and its re- lation with external variables such as perceived value and awareness of environmental responsibility based on an extended Technology Acceptance Model (TAM). In integrating the theories of value perception and planned behavior, this paper constructs a theoretical, analytical framework for farmers’ willingness to adopt pesticide reduction technologies based on three key factors: behavioral attitudes, subjective norms, and perceived behavioral control, as described below.",
    "Farmers’ behavioral attitudes, subjective norms, and perceived behavioral control jointly inﬂuence their willingness to adopt pesticide reduction technologies. Behavioral attitudes are farmers’ expectations and evaluations of the outputs of adopting pesticide reduction technology, which is formed based on farmers’ value perception of technology adoption, risk perception, and perception of technical operational ability, and may also be related to farmers’ personal characteristics [28]. Three aspects of farmers’ value perception of technology adoption are reﬂected in their personal characteristics: economic values, ecological values, and social values. Subjective norms are a collection of various external constraints farmers face when deciding to adopt pesticide reduction technology. The effect of subjective norms can be un- derstood as the interactive inﬂuence of people around and the policy environment in which farmers live. Policy environment factors include government subsidies, publicly available government technology information, government-related technical training guidance, and the role government plays in improving the external environment for adopting technology. Perceived behavioral control is a farmer’s psychological perception of the difﬁculties in the practical application of pesticide reduction technologies. This psychological perception is also related to the farmer’s personal characteristics, production conditions, relevant experience, and perception of technical operational ability. The interactive relations among all these factors are shown in Figure 2. The data for this study are mainly collected from a ﬁeld survey of farmers conducted by the research team in Kaifeng, Henan Province (as shown in Figure 3) from July to September 2020, with questionnaires (as shown in Supplementary Materials) and interviews by the trained researchers. Six villages in the administrative area of Kaifeng were randomly selected for ﬁeld research. The survey focuses on farmers’ willingness to adopt pesticide reduction and pest control technologies in their agricultural production process. The contents of the survey mainly include farmers’ basic characteristics, production conditions, perceptions and psychology around pesticide reduction technology, relevant experience of technology adoption, the current status of technology response, and policy perceptions. A total of 516 valid observations were obtained from this survey. Table 1 shows that most of the farmers in the sample are middle-aged and elderly people with a relatively low level of education. The proportions of male and female farmers interviewed are similar, accounting for 54.8% and 45.2% of the total sample, respectively. The farmers’ age varies from 20 to 78 years old, and those who are above 45 years old account for 73.4% of the total sample. The education level of farmers is generally low; 80.6% of them only have a primary school (43.6%) and junior/middle school education. Moreover, most farmers have been engaged in agricultural production for a long time, and 76.7% of farmers have more than 25 years of experience in agricultural production. The overall family planting area of the sample farmers is of small or medium size. A total of 62.6% of farmers have a planting area that is between 6 and 15 mu (1 mu = 0.067 hectares). The planting area for 17.6% of the farmers is less than 5 mu. Farmers whose planting area is more than 35 mu account for only 3.9%. In total, agricultural income is the major source of family income for 76.7% of the sample farmers. A total of 36.2% of farmers claim that pesticide expenditure is a substantial component of total family agricultural expenditure. It is not common for the sample farmers to have either part-time employment or membership in cooperatives. More speciﬁcally, 36.2% of farmers have part-time employment, and 42.1% of farmers are members of professional cooperatives. A total of 97.1% of the sample farmers have ever encountered technical problems in the process of agricultural production. The above descriptive statistics are in line with the current situation of agricultural production in underdeveloped regions of China. The question on willingness to adopt technology in the questionnaire has three options: “unwilling”, “doesn’t matter”, and “willing”. This feature makes the answer an ordered multi-classiﬁcation variable. Therefore, this study chooses an ordered logistic regression model for quantitative analysis. The model formulations are as follows: where y denotes the dependent variable, representing farmers’ willingness to adopt pesti- cide reduction technologies; xi denotes the explanatory variable, representing the ith factor inﬂuencing farmers’ adoption of pesticide reduction technologies; µ denotes the threshold or critical value; α denotes the intercept; and βi denotes the corresponding parameter to be estimated for xi, representing the degree and direction of the inﬂuence of each explanatory variable on the dependent variable.",
    "The pesticide reduction technologies involved in this study mainly focus on four types of pesticide reduction: light trapping technology, biopesticide application technology, healthy crop growth technology, and insect-proof net technology. Four ordered logistic regression models are constructed to study the factors affecting farmers’ willingness to adopt pesticide reduction technologies. The dependent variable is farmers’ willingness to adopt each technology. There are three options for measuring farmers’ willingness: “Farmers” are the interested subjects that are expected to respond to the promotion of pesticide reduction technologies in this study. Indicator designs related to farmers have been widely used and proven effective. Li et al. [35], Guo et al. [62], and Gao et al. [63] describe the individual characteristics of farmers in terms of gender, age, education level, years of agricultural production, part-time employment and farmer status; Tian et al. [6], Li et al. [22], and Li et al. [64] describe the family characteristics of farmers in terms of fam- ily planting size, income structure, and cost expenditure. Huang et al. [25], Yan et al. [38], and Zhang et al. [65] describe farmers’ proﬁt perceptions in terms of income improvement, ecological environment improvement, and agricultural product safety; Huang et al. [11], Wang et al. [13], and Su et al. [66] describe farmers’ risk perceptions in terms of operational risk, market risk, and perception of operational ability. Cheng et al. [21], Gai et al. [24], Xiang et al. [27], He et al. [67], and He et al. [68] describe the policy environment in terms of government subsidies, technical information publicity, technology training, interper- sonal trust, and government credibility. Based on previous literature, this study selects 21 indicators on farmer characteristics, production conditions, perceived value and risk of technology adoption, ability perception, peer inﬂuence, and policy environment, as well as relevant experience to construct a model including the factors inﬂuencing farmers’ response to pesticide reduction technologies. These indicators can be classiﬁed into eight categories. A conceptual description of these indicators is found in Table 2. X1 Gender: Male = 1; Female = 0 X2 Age: ≤20 = 1; 21~30 = 2; 31~40 = 3; 41~50 = 4; ≥50 = 5 X3 Education level: Primary schools = 1; Junior/middle School =2; Technical secondary school and high school = 3; College and above = 4 Farmers’ characteristics X4 Years of agricultural production: ≤5 = 1; 6~10 = 2; 11~20 = 3; 21~29 = 4; ≥30 = 5 X5 Planting size: ≤5 = 1; 6~15 = 2; 16~25 = 3; 25~35 = 4; ≥35 = 5 X6 Income structure: Agricultural income dominated = 1; Non-farm income dominated = 0 X7 Proportion of pesticide expenditure in total family agricultural expenditure: Very small = 1; Relatively small = 2; Neutral =3; Relatively large = 4; Very large = 5 X8 Perception of degree of income improvement from technology adoption: Very small = 1; Relatively small = 2; Neutral = 3; Relatively large = 4; Very large = 5 X9 Perception of technology adoption in improving ecological environment: Value perception Completely unecological = 1; Relatively unecological = 2; Neutral = 3; Relatively ecological = 4; Completely ecological = 5 X10 Perception of product safety through technology adoption: Very unsafe = 1; Relatively unsafe = 2; Neutral =3; Relatively safe = 4; First, the farmer characteristics category mainly includes two factors: personal features and production conditions. Among them, four indicators are selected for personal features: the gender of the household head, age, education level, and years of production experience. Three indicators are selected for factors of production conditions: the size of the family planting land, the income structure, and the proportion of pesticide expenditure in total family agricultural expenditure. Age, gender, and education level of the household head are expected to affect farmers’ technology response behavior, and the expansion of family planting land is expected to increase the risk of technology adoption by farmers. Farmers with larger agricultural income tend to be more cautious in technology adoption, and a higher proportion of pesticide expenditure in total family agricultural expenditure predicts a higher likelihood of farmers adopting pesticide reduction technologies. Second, farmers’ psychological perception consists of three categories of technology adoption: value perception, risk perception, and ability perception. Five indicators re- lated to technology adoption are selected: farmers’ perception of the degree of income improvement, perception of improved ecological environment, perception of product safety, farmers’ attitudes towards risk, and perception of technical operational ability. Pesticide reduction technologies have substantial value on ecological, economic, and social, and farmers’ motivation to pursue proﬁt and food and ecological safety will promote their technology response behavior. Meanwhile, pesticide reduction technologies are also char- acterized by uncertain effects, complex technical operations, and high market operation risks. This cognitive conﬂict brings a signiﬁcant impact on farmers’ technology response behavior: stronger risk perception generally leads to lower technology adoption [13].",
    "Third, subjective norms include peer inﬂuence and relevant policy environment factors. The policy environment is measured by ﬁve indicators: farmer satisfaction with govern- ment subsidies, satisfaction with technical information publicized by the government, satisfaction with government technical training guidance, trust in government promo- tion of technology, and perception of the government’s role in improving the external environment for technology adoption. Fourth, the category of relevant experience includes three aspects that can affect farmers’ technology response behavior: cooperative organizations, part-time employment, and relevant experience of farmers. Therefore, three indicators, participation in professional cooperatives, part-time employment, and the frequency of technical problems encountered in industrial operations, are selected as other variables. Based on the statistical analysis of the sample farmers’ psychological perceptions of pesticide reduction technologies (Table 3), the farmers generally agree that the four pesticide reduction technologies have a higher safety level in terms of ecology and product quality. Among them, farmers strongly emphasize the ecological safety of the healthy crop growth technology, with 84.9% of farmers believing it is relatively safe, followed by light trapping technology. However, 11.2% of farmers are skeptical about the biopesticide application technology, considering it is relatively unsafe ecologically. However, based on the benign nature of new biopesticides, such should be the most desirable green option at present [69], which indicates that the relevant government departments need to further strengthen technical publicity and continuously improve farmers’ perceptions of this technology. The vast majority of farmers believe that adopting pesticide reduction technologies have helped to increase agricultural income. The scale of the impact, however, is considered to be relatively negligible. The vast majority of farmers considered that technology adoption has a “relatively large” or “very large” impact on income growth. A total of 26.5% of the sample farmers think the impact of healthy crop growth technology is substantial, followed by the biopesticide application technology (10.9%). However, only a few of them believed that adopting the biopesticide application technology would have a “very large” impact on agricultural income growth. Due to the wide variety of biopesticides’ poor stability and complex application process [70], it is necessary to scientiﬁcally select proper biopesticide products and suitable equipment [71]. At the same time, it is also essential to accurately grasp the time, dose, and time interval of application; otherwise, it will be less effective and even induce additional cost [72]. Therefore, farmers generally consider that biopesticide application technologies are difﬁcult to operate [73] and require training on the application technologies of different biopesticide varieties. In the sample of this paper, similar observations were obtained. The biopesticide application technology is said to be the most difﬁcult one, with 40.3% and 26.6% of farmers saying it is “relatively difﬁcult” and “very difﬁcult”, respectively. The healthy crop growth technology is considered to be the easiest one to implement. The survey ﬁnds that farmers are risk-sensitive, and the majority of farmers believe that there are risks in adopting pesticide reduction technologies. Among them, most farmers believe that the risks of the biopesticide application technology are “relatively large” or “very large”, accounting for 51.4% and 6.6% of the sample, respectively. By contrast, the adoption of insect-proof net technology is considered to be the least risky among the four pesticide reduction technologies. In order to clarify farmers’ attitudes to pesticide reduction technologies, this study further surveys and interviews the sample farmers with additional questions focusing on four aspects: “whether they have heard”, “whether they are concerned”, “ whether they need”, and “whether they are willing” (Table 4). The results show that: (1) 65.5% of farmers have heard of these four pesticide reduction technologies. The most well-known ones are insect-proof net technology and biopesticide application tech- nology, which reﬂects the efforts to promote them by relevant government departments. (2) Farmers show the greatest interest in the healthy crop growth technology (e.g., soil test and formula fertilization, crop rotation and intercropping, deep loosening and tilling of the soil, etc.). The proportion of concern and need reached 80.6% and 74.2%, respectively, followed by insect-proof net technology. (3) Light trapping technology is the least attractive option for farmers, and the per- centage of those unwilling to adopt the technology is also the highest (79.8%). One possible reason for this is that they are skeptical about the insecticidal effect. Moreover, the insec- ticidal equipment needs to be set up in the ﬁeld, which can induce many accompanied problems in practice.",
    "(4) Among the respondents, the number of farmers who are willing to adopt the insect-proof net technology is the largest, accounting for 73.6% of the total sample. By contrast, the number of farmers who are unwilling to adopt it is also relatively substantial (19.8%). Although the insect-proof net technology is relatively easy to apply, farmers also express greater difﬁculties in selecting suitable speciﬁcations for insect-proof nets, choosing the follow-up of supporting measures for covering and cultivation of insect-proof nets, and selecting suitable varieties of agricultural products. (5) In total, 58.3% of the interviewed farmers claim they are reluctant to adopt the biopesticide application technology, which is the second-highest proportion among the four technologies after light trapping. The reasons for this might be the high cost of biopes- ticide application, its poor quick-acting properties, narrow insecticidal and bactericidal spectrum [12], and relatively complex application procedures. These factors make farmers think that the technology is less cost-effective and reduce their willingness to adopt it. SPSS20.0 is used to analyze correlations in the survey data, and Kendall’s Tau-b coefﬁcients of the independent variables and farmers’ willingness to respond to light trapping technology, biopesticide application technology, healthy crop growth technology, and insect-proof net technology are obtained separately. For brevity, only the results of the analysis related to the willingness to respond to the light trapping technology are presented in Table 5. The results show that farmers’ age, participation in professional cooperatives, years of working in agricultural production, perception of income improvement, peer inﬂuence, satisfaction with government-related subsidies, satisfaction with technical information publicized by the government, trust in government promotion of technology, satisfaction with government technical training, and perception of the government’s role in improving the external environment for technology adoption are all signiﬁcantly and positively correlated with farmers’ willingness to implement pesticide reduction and pest control technologies. In contrast, gender, part-time employment, perception of operational ability, and risk perception are negatively correlated with farmer willingness. The results may indicate that farmers can be prompted to respond to pesticide reduction technologies by improving the government-related subsidy system, enhancing government-related technical information publicity, and training guidance. These measures can lower the risk of technology adoption and optimize the external environment for technology adoption. The ordered logistic regression models of farmers’ responses to the four technologies are estimated using the stepwise regression analysis method in Stata 12.0. The results are shown in Tables 6–9. Combined with the goodness-of-ﬁt test index of each model, the model chi-square statistic is signiﬁcant at the 1% level, which indicates that the models are powerful in predicting the dependent variable and the effects of the explanatory variables are strong. Note: Log likelihood = 249.491, LR chi2 = 173.567, Prob > chi2 = 0.000, Pseudo R2 = 0.729. ***, ** denote signiﬁcance at the 1%, 5% level respectively. Note: Log likelihood = 508.719, LR chi2 = 152.694, Prob > chi2 = 0.000, Pseudo R2 = 0.256. ***, ** denote signiﬁcance at the 1%, 5% level respectively. Note: Log likelihood = 624.094, LR chi2 = 414.969, Prob > chi2 = 0.000, Pseudo R2 = 0.553. ***, ** denote signiﬁcance at the 1%, 5% level respectively. First, the inﬂuence of farmer characteristics on their willingness to respond to pesticide reduction technologies is discussed in terms of the following aspects. Among the results of the four ordered logistic regression models, only age and farmers’ years of working in agricultural production signiﬁcantly affect farmers’ willingness to respond to the insect- proof net technology. The effect is positively signiﬁcant at a 1% conﬁdence level. This result indicates that older farmers who have been in agricultural production longer are more willing to respond to the insect-proof net technology. The government has been promoting the insect-proof net technology for several years, and the technology is relatively easy to apply, so older farmers who are more experienced in agricultural production have better knowledge and richer experience with it. Therefore, they can better solve the problems of suitable insect-proof nets selection, soil disinfection, wind, and ﬂood prevention, etc., which can more effectively improve the effectiveness of insect-proof nets. Note: Log likelihood = 624.094, LR chi2 = 414.969, Prob > chi2 = 0.000, Pseudo R2 = 0.553. *** denote signiﬁcance at the 1% level respectively.",
    "Second, the impact of farmers’ psychological perception on their willingness to re- spond to pesticide reduction technologies is as follows. Farmers’ perception of the degree of income improvement from technology adoption is positively signiﬁcant at a 1% conﬁ- dence level in all four regression models, indicating that the more the technology response contributes to agricultural income improvement, the more willing farmers are to adopt the technology. Farmers’ perception of technical operational ability signiﬁcantly inﬂuenced their willingness to respond to healthy crop growth and insect-proof net technologies, and the effect is negatively signiﬁcant for both technologies at the 1% conﬁdent level. This indicates that the harder the technology is perceived to operate, the less willing farmers are to adopt the technology. Farmers’ perception of technology adoption risk signiﬁcantly affects their willingness to respond to light trapping and insect-proof net technologies. The effect is signiﬁcant at a 1% level for both technologies. The biopesticide application passes the signiﬁcance test at the 5% level, both in a negative direction, indicating that the greater the perceived risk of technology adoption is, the less willing farmers are to respond to the technologies. Agricultural production has many uncertainties. Farmers adopting new agricultural technologies are exposed to not only natural and social risks but also market and tech- nological risks. Therefore, reducing risks and maximizing returns is the fundamental motivation for farmers’ behavioral decisions. In promoting pesticide reduction and pest control technologies, on the one hand, it is necessary to vigorously advertise the efﬁcient, environment-friendly, safe, and harmless features of these technologies to enhance farmers’ conﬁdence in technology adoption through word-of-mouth publicity through demonstra- tion households and also enhance their perception of technical operational ability through ﬁeld demonstrations. On the other hand, the adoption of some technologies will improve product quality by sacriﬁcing yield to some extent. This trade-off requires the government to optimize planting structures, which refer to the combination and optimization of differ- ent varieties of crops guided by the local government through better regulations. It also requires the government to actively seek markets for products to ensure farmers’ income. In this way, farmers will be more willing to respond to pesticide reduction technologies. Third, the inﬂuence of subjective norms on farmers’ willingness to respond to pesticide reduction technologies also deserves researchers’ attention. Among the environmental policy factors, farmers’ satisfaction with government subsidies is positively signiﬁcant at a 1% conﬁdence level in all four regression models. Farmers’ satisfaction with gov- ernment technical training guidance signiﬁcantly affects their willingness to respond to light trapping, biopesticide application, and healthy crop growth technologies, with a positive signiﬁcance level of 1%. The estimated effect of farmers’ trust in government promotion of technology is positively signiﬁcant at the 1% level in the response model for biopesticide application and insect-proof net technologies and is positively signiﬁcant at the 5% level in the response model for light trapping and healthy crop growth technologies. Farmers’ perception of the government’s role in improving the environment for technology adoption is positively signiﬁcant at the 1% level in the biopesticide application technology response model. These results show that a higher level of farmers’ satisfaction with the government- related subsidy system and the effectiveness of government technical training, a higher level of farmers’ trust towards government-promoted technologies, and a more crucial role of the government in improving the external environment for technology adoption, can make farmers more willing to respond to new technologies. As “rational economic individuals”, farmers make their decisions by comparing costs and beneﬁts. In general, the lower the cost, the higher the expected beneﬁts. After technology adoption, they can attain more compensation from the government to hedge the risk of technology adoption. The government can improve the environment for technology adoption with more detailed and clearer technical training guidance and improve the corresponding infrastructure. Meanwhile, farmers will be more convinced that the technologies can improve productivity if the government is more credible. Consequently, they will have stronger motivation to adopt pesticide reduction technologies. Fourth, the impact of relevant experience on farmers’ willingness to respond to pes- ticide reduction technologies is as follows. The frequency of the technical problems en- countered is negatively signiﬁcant at the 5% level in the model of willingness to respond to light trapping technology, indicating that frequent technical problems in practice hinder farmers’ willingness to respond to light trapping technology. Although the light trapping technology has been used for decades, the function of insecticidal lamps has not seen substantial improvements for many years [74]. Moreover, many technical problems arise in farmers’ long-term practice [75], which then affects farmers’ willingness to respond to the technology.",
    "Based on the survey of 516 farmers in Henan Province, this paper constructs four ordered logistic regression models for light trapping, biopesticide application, healthy crop growth, and insect-proof net technologies to explore farmers’ willingness and determi- nants of their response to pesticide reduction technologies. Three main conclusions are drawn below. First, the interviewed farmers have a high perception of the ecological safety and product safety of all four pesticide reduction technologies, and most farmers are familiar with the four technologies to some degree. The four technologies can be ranked from high to low in terms of farmers’ concern and need: healthy crop growth technology, insect- proof net technology, biopesticide application technology, and light trapping technology. Farmers are overall passive in adopting new technologies, and most farmers believe the costs are high while the beneﬁts are uncertain. Large-scale demonstrations which can help farmers learn more about the technologies are necessary to increase farmers’ willingness to adopt them. Second, most farmers believe that adopting pesticide reduction technologies has slightly increased agricultural income, but the impact is relatively small. Among them, 16.9% and 6.6% of farmers believe adopting healthy crop growth technology has a “rela- tively large” and “very large” impact on income growth. Very few farmers believe adopting biopesticide application technology will have a “very large” impact on agricultural income growth. Moreover, farmers generally believe that biopesticide application technology is the riskiest and hardest technology to apply. The least-appealing technology farm- ers are unwilling to adopt is the light trapping technology, followed by the biopesticide application technology. Third, the effects of the farmers’ characteristics, their technology perceptions and psychology, the relevant policy environment, and the relevant experience on farmers’ response to different technologies are heterogeneous. Overall, farmers’ willingness to adopt technologies is mainly affected by their perception of many factors, including income improvement, their technical operational ability, their estimated risks, government-related subsidies, government technical training guidance, trust in government promotion of the technology, and the government’s role in improving the external environment for technology adoption. Most of these factors have positive effects on farmers’ willingness to adopt technologies, while higher risks can inhibit their willingness. Typically, farmers make decisions in response to technologies by considering whether the technology can reduce productive inputs and labor intensity, save working time, and increase productivity and income. However, with the increasing demand for sustainable environmental practice and product quality, farmers’ technological needs are no longer limited to simply increasing productivity and income. They also begin to emphasize the quality of the products and the sustainability of the ecological environment. Farmers have an intrinsic motivation to adopt new technologies only when the per- ceived value of their adoption exceeds the risk of loss. Therefore, encouraging farmers to positively respond to pesticide reduction technologies can start from two key points: ﬁrst, strengthen technology publicity and demonstrations to guide farmers to form a more positive value perception of technology adoption, thus stimulating their intrinsic motivation to adopt pesticide reduction technologies; second, use technical subsidies, and incentive mechanisms to encourage farmers to more positively respond to pesticide reduction technologies. First, expand the breadth and depth of technical publicity and training programs to raise farmers’ awareness of reducing pesticide use. Farmers’ perceptions of pesticide reduc- tion technologies, especially whether technology is promising in improving productivity and quality and whether it contributes to high product prices and best-selling products are the key concerns for farmers’ behavioral decisions. Information publicity and training guidance on pesticide reduction technologies are important ways of improving farmers’ perception of pesticide reduction technologies and promoting their technology response behavior [76]. On the one hand, it is necessary to advertise pesticide reduction technologies through multiple channels such as radio, television, the Internet, MMS/texting, technical training courses, etc. These measures can facilitate the top-down publicity and promote the role of government agricultural technology extension departments. They can also highlight the beneﬁts of adopting pesticide reduction technologies, making farmers fundamentally aware of the importance of pesticide reduction technologies to ecological protection and their own health. The prevalence of such information can enhance their conﬁdence in technology adoption [77]. At the same time, the ecological education of farmers should be continuously strengthened to guide their choice of pesticide reduction behavior from the dimension of ecological protection and personal health. On the other hand, through government regulation, efforts should be made to optimize planting structures and actively seek broader markets for products. The incentive mechanisms such as government subsidies should also be improved to ensure farmers’ income, strengthen the direct perception of the results and effectiveness of pesticide reduction technology responses, enhance willingness to respond to technology, and ﬁnally promote technology adoption behavior.",
    "Second, promote the innovation of pesticide reduction technologies to balance technol- ogy supply and demand and achieve cost savings and income enhancement. A scientiﬁc and technological innovation mechanism targeting the needs of farmers should be estab- lished and continuously improved. It should highlight the transformation from researchers’ technical innovation to economic outputs and also take into account the public and so- cial nature of pesticide reduction technologies, and facilitate government investment in technological innovation research and development. In this way, the mechanism should be able to contribute to the diffusion and adoption of pesticide reduction technologies through scientiﬁc and technological innovations [78]. The technical needs of farmers should be carefully clariﬁed, and the help and guidance provided to the farmer trainees should precisely match their demands and mitigate their difﬁculties. The channels of education and training should also be further broadened, and the role of private training institutions, professional associations, and leading enterprises should be used to promote high-quality training programs. At the same time, training contents and methods should be further improved to enhance farmers’ technical mastery and application abilities. After training, additional efforts must be made to improve land cultivation, ﬁnance, insurance, and other related supporting systems to promote the adoption of new pesticide reduction technologies. Third, effectively improve farmers’ satisfaction with technical training and promote farmers’ active participation in technical training. Due to the outﬂow of young and strong laborers from rural areas to urban areas, most of the individuals actually engaged in agricultural production are older and limited in relevant knowledge. Therefore, more on-site ﬁeld guidance and instruction should be developed. By making better use of agricultural leisure time and appropriately extending the training time, the government can hire agricultural experts from inside and outside the province to carry out ﬁeld guidance to improve the applicability and practicality of the technologies and help farmers to operate them proﬁciently [79]. Farmers who have received such training should also be publicized more vigorously to enhance their demonstration effect and to stimulate other farmers’ intrinsic motivation to participate in agricultural green education and pesticide reduction production skills training. Fourth, improve the government subsidy system, strengthen institutional trust, and build a favorable environment for technology adoption. Government subsidies play an important role in promoting the adoption of pesticide reduction technologies as an explicit incentive. Farmers’ trust in the government also signiﬁcantly inﬂuences their willingness to adopt pesticide reduction technologies. Further improving the government subsidy system, strengthening government trust-building, and reducing transaction costs and institutional costs in technology promotion can effectively incentivize farmers to adopt pesticide re- duction technologies. The importance of pesticide reduction technology subsidies should be highlighted as equivalent to that of other mainstream subsidies such as “direct sub- sidies for grain cultivation”, “subsidies for good seeds”, “subsidies for the purchase of agricultural machinery”, and “comprehensive subsidies for agricultural materials” so that subsidies can become a regular form of incentive for farmers to adopt pesticide reduction technologies [76]. Relevant policies, laws, and regulations should be strictly implemented to support and beneﬁt farmers. This can help to ensure that compensation or subsidies for pesticide reduction technologies are in place and maintain the credibility of the government. As long as farmers are convinced that they will beneﬁt from adopting the technologies and the compensation or subsidies can hedge the additional costs and risks stemming from using the technologies, they will be more willing to try these technologies [80]. The risk compensation system should be designed to suit those high-income, well-educated, and large-scale planting farmers and also coordinate with differentiated subsidy policies. The transparency of policy implementation must be ensured to establish a foundation of mutual trust and communication between the government and farmers. Such transparency can also mitigate farmers’ worries when participating in environmental protection and governance. The whole system should also focus on solving the problems and obstacles encountered by farmers in adopting pesticide reduction technologies. Fifth, it is vital to strengthen the training of new professional farmers and solidify the demonstration effect. Stakeholders, including family farms and large professional households of new professional farmers with moderate-scale operations, as well as intensive and specialized production organization structure, provide the favorable potential for applying pesticide reduction technologies. Strengthening the guidance and promotion of pesticide reduction technologies for new professional farmers can become a “ﬁeld classroom” for other small and scattered farmers, allowing many small farmers to learn operational skills of new pesticide reduction technologies in the ﬁeld. At the same time, risk-averse small farmers will become increasingly aware of the economic and social beneﬁts of pesticide reduction technologies, which promotes their adoption of pesticide reduction technologies.",
    "In order to strengthen the training of new professional farmers and guide the intensive and specialized operation in agriculture, it is ﬁrst necessary to clarify farmers’ contracting rights on land, establish a long-term mechanism for land transfer, secure farmers’ land tenure, and create an environment for moderate scale operations; second, a strict approval system should be established, and organizations that are qualiﬁed for approval should be allocated differentiated ﬁnancial support and subsidies according to their operations so that these large demonstration households can truly beneﬁt from the whole process and better exert their demonstration effect [14,81]. Author Contributions: X.S. and W.N. conceptualized the study and analyzed the results; X.S. ran model simulations and wrote the ﬁrst draft; X.S. provided basic data; X.S. provided support in modelling. J.S., T.W. and Z.X. reviewed, edited, and improved the manuscript. X.S., J.S. and Q.S. wrote the revised version. All authors have read and agreed to the published version of the manuscript. Funding: This research was ﬁnancially supported by the Soft Science Project of Henan Province in China (Grant No. 192400410054), the Philosophy and Social Science planning project of Henan Province in China (Grant No. 2018BJJ052), the Foundation for Key Scientiﬁc Research of Henan Province in China (Grant No. 20A790026), the Foundation for University Key Teacher of Henan Province in China (Grant No. 2018GGJS014), the Philosophy and Social Science planning project of Henan Province in China (Grant No. 2021BJJ093), the Think Tank Project for Philosophy and Social Sciences of Henan Province in China (Grant No. 2021ZKYJ10), and the National Social Science Foundation of China (Grant No. 20BJL073). Data Availability Statement: The data presented in this study are mainly from a ﬁeld survey of farmers conducted by the research team in Kaifeng, Henan Province from July to September 2020, which was conducted by questionnaires and interviews by the researchers after the training. Based on the principle of random sampling, six villages in the administrative area of Kaifeng were randomly selected for ﬁeld research in this study. A total of 516 valid questionnaires were retained for this survey."
]