[
    "Citation: Zhao, M.; Li, J.; Zhang, J.; Han, Y.; Cao, R. Research on Evaluation Method for Urban Water Circulation Health and Related Applications: A Case Study of Zhengzhou City, Henan Province. Int. J. Environ. Res. Public Health 2022, 19, 10552. https://doi.org/10.3390/ ijerph191710552 Abstract: The acceleration of urbanization and climate change has increasingly impacted the health level of urban dual water cycles. In order to accurately evaluate the health status of urban water cycles, the evaluation system covers four standard layers of water ecology, water abundance, water quality and water use, including 19 basic indicators such as water storage change and annual average precipitation. Three-scale AHP and EFAST algorithms are adopted to set the criterion and index layer weights. Water-cycle health assessment models are based on the improved TOPSIS model. The model evaluated Zhengzhou’s water cycle health from 2011 to 2021. We compared the TOPSIS model and FCE method to ensure the scientiﬁc objectivity of the evaluation results. The evaluation results indicated that the water cycle in Zhengzhou City improved annually, and the relative progress in 2020 was 0.567 in a sub-health state. The eco-environmental water demand, green coverage rate of the built district, water resources amount, and industry’s water consumption per unit of value added (CNY 10,000) were the major obstacles. These four factors have preponderantly inﬂuenced Zhengzhou City’s water cycle health. Our research results provide scientiﬁc reference for Zhengzhou to achieve a healthy urban water cycle and regional sustainable development. The water cycle supports the formation of water resources and is the main driving force for the evolution of water environments and ecosystems. With the development of the social economy and acceleration of urbanization and other human activities, the regional water cycle has gradually changed from a single “natural” water cycle model to a “natural–social” dual water cycle model. The basic process of a natural water cycle is precipitation–runoff–evaporation. The basic process of a social water cycle is water intake– water use–water supply–water drainage–water reuse. Natural and social water cycles inﬂuence each other and system structure coupling. A set of “natural-social” dual water cycle models based on “water supply–water use–water consumption–water drainage–water reuse” is formed. Copyright: © 2022 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). Zhengzhou City is in the north-central part of Henan Province (Figure 1). The water cycle is greatly inﬂuenced by the urbanization rate and urbanization processes with prob- lems including severe water pollution, a sharp decline in groundwater depth, and water shortage. In 2020, Zhengzhou’s total water resources were 859.12 million cubic metres. The per capita water resources were only 68 cubic metres, one-tenth of the national per capita share, far below the internationally recognized 500 cubic metres, signifying an extreme water shortage warning line. In general, Zhengzhou is in a state of severe water shortage. In recent years, the rapid economic development in Zhengzhou has led to increased water supply demand. In 2020, the total amount of sewage discharge reached 105.125 million tons, which restricted the long-term social development in Zhengzhou. Maintaining a healthy water cycle has become a signiﬁcant proposition for the sustainable development of human society. At the beginning of the 21st century, China’s urban water system developed rapidly. Many experts and scholars began to study the healthy circulation of urban water systems from the overall direction of the water environment and ecology. Zhang et al. [1] proposed a healthy water cycle according to the water crisis caused by human behaviours and emphasized the importance of recycling water models for water cycle health. Some scholars have adopted different methods to study this concept from different dimensions. For example, Jia et al. [2] evaluated the water cycle health in Ningxia and ﬁve other cities using principal component analysis. Zhang et al. [3] analysed the water cycle health in Beijing and comprehensively considered the inﬂuence of the South–North Water Diversion Project on the water cycle in Beijing, thus analysing the urban water cycle’s inﬂuencing factors more scientiﬁcally. Luan et al. [4] proposed a farmland healthy water cycle and evaluated the water cycle health of the Jun Liu irrigation area. Research on water cycle in foreign countries has obtained many research results. Chu [5] established an index system based on “S-E”, thought to evaluate the health status of the urban water cycle. Maria et al. [6] used life cycle methods to evaluate urban water cycles in the Mediterranean region. Deng et al. [7] proposed an improved entropy-based fuzzy matter element model to evaluate the Taihu Lake Basin in China. Healthy water cycles are a fuzzy concept.",
    "The TOPSIS model ignores the linear relationship between indicators, leading to the failure of Euclidean geometry. In addition, Euclidean distance can only reﬂect the evaluation object and reason from position distance. The closeness of the solution cannot reﬂect similar geometry. Mahalanobis distance and grey relational analysis improve the TOPSIS method, which can evaluate healthy water circulation and provide references for water cycle health and ecological management in Zhengzhou. In this context, Zhengzhou was chosen for case studies, and an evaluation system covering four criteria layers was established, namely water abundance, water ecology, water use, and water quality, including 19 evaluation indexes such as mean annual precipitation, annual water storage change of reservoir, and eco-environmental water demand. The combined weights of subjective and objective indexes were obtained by combining the three-scale AHP and EFAST algorithms. On this basis, we established an improved TOPSIS model to evaluate the water cycle in Zhengzhou. We used the TOPSIS model and FCE for comparison and veriﬁcation, aiming to provide scientiﬁc reference for the realization of benign water cycles and sustainable development in Zhengzhou City. The data derive from China Environmental Statistics Yearbook (2010–2020), Zhengzhou City Water Resources Bulletin (2010–2020), Zhengzhou City Environmental Bulletin (2010– 2020), Zhengzhou City Statistical Yearbook (2010–2020), Henan Province Water Resources Bulletin (2010–2020), Henan Province Statistical Yearbook (2010–2020), and so on. The traditional concept emphasizes that humans should not interfere with the natural water cycle to maintain its intrinsic natural state. However, with the intensiﬁcation of human activities, the social water cycle’s role has gradually enhanced. Healthy water cycles should consider natural and human factors. On the one hand, the natural water cycle must ensure the social “three-living” water use under the premise of health and support the long-term development of society. On the other hand, human society must use water resources efﬁciently and avoid irreversible damage to the natural water cycle [8,9]. A healthy water cycle is manifested in the interaction between the natural and social water cycles on the cycle path, achieving dynamic balance. A healthy water cycle is demonstrated in normalizing water ecology, reasonably developing water resource abundance, healthy water environment quality, and efﬁcient resource utilization [10,11]. Therefore, maintaining a healthy water cycle mainly includes the following three points: Firstly, water resource management must ensure the normalization of ecological water levels and self-healing capabilities. Secondly, the amount of water resources satisﬁes the need for socially sustain- able development. Thirdly, efﬁciency in water resource utilization patterns [12]. A diagram of the urban healthy water cycle is shown in Figure 2. The urban water cycle health assessment is a complex process. The natural and social water cycles should be included in the established evaluation index system. If the indi- cators are not comprehensive enough, the urban health status cannot be truly reﬂected. Therefore, the selection of indicators should follow objective laws and be regionally rep- resentative [13,14]. We comprehensively consider the connotation and regional status of water cycles in healthy cities. The relevant basic data of Zhengzhou City were collected by referring to the Water Resources Bulletin of Zhengzhou City and Water Resources Bulletin of Henan Province. The health evaluation system of the water cycle was established from four dimensions: water supply, water sources, water use, and water treatment. The water utility criterion layer mainly determined the index layer from the effective utilization coefﬁcient of irri- gation water and social “three living”, which reﬂects the utilization efﬁciency of water resources in cities. The water abundance criterion layer mainly considered the natural endowment conditions of urban water resources, such as the annual water storage varia- tion of medium-sized reservoirs and annual average precipitation. The water ecological criterion layer mainly established the index system from the human protection measures of water resources, river and lake storage capacity, and drainage pipeline density. The water quality reﬂected natural attributes of the water cycle and mainly involved urban greening and water function area status. The evaluation index system is shown in Figure 3. In this paper, we determined the index threshold by combining the investigation and referring to relevant research results and national regulations to ensure scientiﬁc objectivity [15]. Due to the relativity of the water cycle’s health degree, the health standard was divided into ﬁve grades: excellent (grade I), healthy (grade II), sub-healthy (grade III), unhealthy (grade IV), and sick (grade V). The thresholds and attributes of each indicator in the evaluation system are shown in Table 1.",
    "According to the principle of minimum information entropy, the three-scale AHP and EFAST algorithm were combined, and the subjectivity and objectivity of the weight were coupled. The weight of the evaluation index was accurate and reasonable. The calculation steps were as follows. where xij is the original value of the evaluation index; rij is the index value after standard transformation and Xj is the mean value of item j; Sj is the standard deviation of indicator j. two indexes. In this paper, we only used a scale of 0–2 to establish the judgment matrix, which improved the shortcomings of the traditional analytic hierarchy process. where Vi is the variance of index xi; Vij is the variance of the interaction between xi and xj; Vijk is the variance of the interaction between xi, xj and xk; Vijk...n is the variance of the interaction between indicator xi and indicator n − 1. The second-order Mij, the third-order Mijk and the higher-order sensitivity index Mij...n of the index xi coupled with other indexes can be deﬁned as: The sensitivities of the coupled indicators were used to calculate weights, and the sensitivity of the ﬁrst index Mmi normalized weight value Ei. The weight calculation formula can be expressed as: where w; is the index combination weight value; n is the number of indicators; wW; prime is the weight result obtained by three-scale AHP; and Ww; prime obtains weight results for the EFAST algorithm. In this paper, the weighted Mahalanobis distance replaced the Euclidean distance of the original TOPSIS model, and the grey correlation analysis was introduced to improve the TOPSIS model. Based on the original TOPSIS model, the improved TOPSIS model comprehensively considered the correlation between various indicators and intuitively showed the nonlinear relationship between sequences. The calculation process is as follows: criterion layer: m and n. The standardized index matrix Am×n was established: the matrix Am×n comprised the standardized index data xij, where xij is the standardized value of the sample j and index i: m and n are the criterion number of the criterion layer and the index number of the index layer, respectively. where m is the number of evaluation schemes; n is the number of indicators in each evaluation scheme; pij is the value multiplied by the corresponding weight value after the standardized transformation. where ρ = 0.5, r+ is the grey correlation degree between the evaluation scheme and i positive ideal solution, r− is the grey correlation degree between the evaluation i scheme and negative ideal solution. Dimensionless processing weighted Mahalanobis distance d+ tion r+ i , r− i : i , d− i , and grey correla- where a1+a2 = 1, β1+β2 = 1; D− i , R+ i , D+ i , R− i , H+ i , H− i all reﬂect the distance be- tween each evaluation object and the ideal solution; Ci is the relative progress, and the larger the value is, the higher the water cycle health level is, and vice versa. The value of Ci represents the degree of water cycle health, which is between 0 and 1. A higher Ci value indicates a higher water cycle health rating, whereas a lower Ci value indicates a lower water cycle health rating. Based on the existing research results and related data, water cycle health was divided into ﬁve grades, as shown in Table 3. The ﬂow chart of water cycle health evaluation is shown in Figure 4. The subjective weight of the evaluation index was calculated using a three-scale AHP. After calculation,CR = 0.05 < 1; therefore, the consistency test was passed. The objective weights of evaluation indexes in different years were determined by the EFAST algorithm. The minimum information entropy principle combines the subjective and objective weight values. Finally, the combined weight value of each evaluation index was calculated. The weight values of four criteria layers and 19 indicators of the evaluation system are shown in Figure 5. The health state for the index layer is shown in Figure 6 according to the threshold of each indicator. According to evaluation results of the index layer, most indicators were developing towards a healthy trend annually. Among them, the indicators D2, D3, B4 were healthy in the past decade, showing that the sewage treatment rate in Zhengzhou was high, the industry’s water consumption per unit of value (CNY 10,000) was reasonable, and the safety of drinking water sources was high. A1,A5,B3 were opposing indicators and have been in sub-disease and morbid states for a long time in the past decade. The health level of B3 was poor, and the health score was only 1.0. Apart from the general health level in 2016, A5 was sub-morbid for nine years, and the score was only 2.0. The health level of A1 improved in the past three years, but it was still sub-morbid. These three indicators indicated that Zhengzhou had to improve the drainage pipeline density, increase the water consumption of the ecological environment, and draw attention to reservoirs’ annual water storage change. D5,D6, A4 status continued to improve and tended to be healthy. A2 experienced three consecutive years of health from 2011 to 2013, but the next seven years were sub-health, showing that the protection of water resources in Zhengzhou City was increased and resulted in improved water ecological functions such as river and lake storage capacity and water function area compliance rates. C3 was morbid in 2021 due to the once-in-a-millennium heavy rainfall in Zhengzhou on 20 July 2021, showing that the precipitation in Zhengzhou was unstable. Therefore, the precipitation trend in Zhengzhou should be better monitored. If the precipitation was excessive, there should be a timely warning to avoid the adverse effects of jade. The health status of C4 was volatile, showing the dependence of Zhengzhou on groundwater and the sensitivity of indicators.",
    "According to Formulas (17)–(19), the obstacle degrees of 19 evaluation indexes in Zhengzhou City from 2011 to 2021 were calculated. Six indexes with large obstacle degrees were selected for statistical analysis to accurately understand the distribution of obstacle degrees. The calculation results are shown in Table 4. The greatest obstacle factor was the ecological environment’s water consumption (A1), and the average obstacle degree was 19.65. The main obstacle factor of the minimum obstacle degree was the green coverage rate in a built-up area (A2); the average obstacle degree was 7.3. Table 4 shows eco-environmental water demand (A1), the proportion of river length above class III water quality (B3), the industry’s water consumption per unit of value (CNY 10,000) (D2), water resources amount (C1), effective utilization coefﬁcient of irrigation water (D1), and the green coverage rate of the built district (A2) when the obstacle degree was high. The six factors with a higher obstacle degree were the main inﬂuencing factors. D1 and D2 belonged to the water utility criterion layer, C1 belonged to the water abundance criterion layer, A1 and A2 belonged to the water ecology criterion layer, and B3 belonged to the water quality criterion layer. In order to visually display the obstacle degree change of the six main obstacle factors, the trend was plotted as a broken line, as shown in Figure 7. From 2011 to 2021, the eco-environmental water demand (A1), the green coverage rate of built districts (A2), the water resources amount (C1), and the industry’s water consumption per unit of value (CNY 10,000) (D2) showed an increasing trend of obstacle degree annually. Therefore, Zhengzhou should increase ecological environment water consumption and improve the green coverage of built-up areas. In residents’ daily life, there should be more water-saving instruments to improve the water resources shortage in Zhengzhou City. In terms of industrial structure, the production mode should be improved to reduce the industry’s water consumption per unit of value (CNY 10,000). Through the value of each index and the corresponding weight, we established the improved TOPSIS model using Formulas (1)–(16), and the relative progress of Zhengzhou City from 2011 to 2021. The speciﬁc results are shown in Table 5. From 2011 to 2021, the overall health status of the water cycle in Zhengzhou City developed a healthy trend. Due to the low eco-environmental water consumption from 2011 to 2012, the compliance rate of the water function zones was low, and the health level of the water cycle in Zhengzhou City from 2011 to 2012 was grade IV. From 2020 to 2021, the water cycle’s health degree in Zhengzhou City decreased mainly due to the rare heavy rainfall weather on 20 July 2021; the annual average precipitation rose to more than 1000 mm, resulting in severe urban waterlogging, slightly lowering the water cycle’s health degree in 2021 compared with 2020. In recent years, with the implementation of the most stringent water resources management system by the government and the strengthening of natural environmental protection, the water cycle health of Zhengzhou City has developed healthily and steadily. Based on our analysis of the evaluation results, the countermeasures to improve Zhengzhou City’s water cycle health are as follows: We selected two conventional assessment methods, the FCE method and the traditional TOPSIS model, to compare our evaluation results to the improved TOPSIS model and verify the effectiveness of the improved TOPSIS model. The results are shown in Table 6. The evaluation results calculated by the three methods were consistent. There were some differences between the traditional TOPSIS model and the improved TOPSIS model in the evaluation results from 2013 to 2015 and 2021 because, in the improved TOPSIS model, the traditional Euclidean distance was replaced by the weighted Mahalanobis distance and the grey correlation analysis degree. As a result, the correlation degree between some indexes was comprehensively considered, and the position and form indicated the health grades of each year. The FCE method comprehensively considers the subjective opinions of experts and has strong subjectivity [20], whereas the improved TOPSIS method does not need subjective judgment and reﬂects the relative progress of each evaluation scheme from the original data. The improved TOPSIS model is applicable and scientiﬁc in water cycle health evaluation.",
    "The water cycle plays an important role in promoting the sustainable development of nature and human society. The evaluation and deﬁnition of a healthy water cycle relate to the development direction of society, which are of great research signiﬁcance. In this paper, we deﬁned the concept of a healthy water cycle from several perspectives, and an index system was established based on the natural and social attributes of the water cycle. We analysed and compared the evolution of the water cycle in Zhengzhou City from 2011 to 2021 using the improved TOPSIS model and TOPSIS model and FCE. Our research led to the following conclusions. Author Contributions: Conceptualization, Y.H. and J.Z.; methodology, J.L.; software, J.L.; validation, M.Z., R.C. and Y.H.; formal analysis, J.L. and R.C.; investigation, J.L.; resources, Y.H. and M.Z.; data curation, M.Z.; writing—original draft preparation, J.L.; writing—review and editing, J.L. and M.Z.; visualization, Y.H.; supervision, J.Z.; project administration, M.Z. All authors have read and agreed to the published version of the manuscript. Funding: This research was funded by the National Natural Science Foundation of China (52009045), scientiﬁc and technological research projects in Henan Province (212102310539), and Postdoctoral funding in Henan Province."
]