[
    "Abstract: The current study examines the long-run effects of climatic factors on wheat production in China’s top three wheat-producing provinces (Hebei, Henan, and Shandong). The data set consists of observations from 1992 to 2020 on which several techniques, namely, fully modified OLS (FMOLS), dynamic OLS (DOLS), and canonical co-integrating regression (CCR) estimators, and Granger causality, are applied. The results reveal that climatic factors, such as temperature and rainfall, negatively influenced wheat production in Henan Province. This means that Henan Province is more vulnerable to climate change. In contrast, it is observed that climatic conditions (via temperature and rainfall) positively contributed to wheat production in Hebei Province. Moreover, temperature negatively influenced wheat production in Shandong Province, while rainfall contributed positively to wheat production. Further, the results of Granger causality reveal that climatic factors and other determinants significantly influenced wheat production in the selected provinces. Citation: Zhang, H.; Tang, Y.; Chandio, A.A.; Sargani, G.R.; Ankrah Twumasi, M. Measuring the Effects of Climate Change on Wheat Production: Evidence from Northern China. Int. J. Environ. Res. Public Health 2022, 19, 12341. https:// doi.org /10.3390/ijerph191912341 Copyright: © 2022 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by / 4.0/). China cultivates only eight percent of the world’s arable land to feed eighteen percent of the global population. It is expected that China’s population will peak around 2030 [1]; hence, the food security problem in China has always been a concern. In the “Outline of the 14th Five-Year Plan for National Economic and Social Development of the People’s Republic of China and the Long-term Goals in 2035,” the Chinese government, for the first time, incorporated the food security strategy into the planning system and set the goal of ensuring that grain output will remain stable at over 650 million tons over the 14th Five-Year Plan period. Climate has a strong influence on food production. Climate change and more frequent bad weather events around the world exacerbate the insecurity of China’s grain production [2,3]. As a result, understanding the impact of climate change on China’s grain crop productivity and devising countermeasures to implement China’s food security strategy are critical. The impact of climate change on grain crop production has both advantages and disadvantages. Nevertheless, the disadvantages outweigh the advantages overall, and different climate variables have different impacts on different crops and regions [4—6]. In recent years, the increased heat caused by climate change has been conducive to expanding the grain sown area and producing more grain [7]. Increasing rainfall and CO2 concentra- tions are beneficial for crop production to some extent, but high temperatures may negate this effect in some areas [8,9]. Similarly, climate change had a negative impact on grain production by expanding pest and disease occurrence areas, shortening crop growth cycles, and increasing the frequency of extreme weather events [10,11]. The global climatic variations are a sensitive topic being discussed in China. According to the National Meteorological Administration, China’s temperature has increased by 0.3 °C every 10 years (higher than the global average during the same period), and its annual precipitation has increased by 5.1 mm every 10 years between 1961 and 2020 [12]. Climate change is causing a “double increase in water and heat.” By evaluating the expected impact of global warming on the yields of China’s main crops (wheat, rice, and corn), it was discovered that the crop yield effect emanating from climate change is primarily due to an increase in air temperature [13]. Grain production has been impacted by significant deviations in China’s agricultural climate resources. The regional space of grain production is also changing, with the emphasis shifting to the main production areas in the north [14]. Researchers incorporate technological progress factors into the research system of food production under climate change [15-18]. Food security is a technical issue in terms of production mode, and the level of technology determines the ability to ensure food security. As a result, technological advancement can be used as an effective tool for grain production to cope with climate change [19,20]. Many studies have found that technological progress significantly impacts grain production, which is primarily reflected in the two factors listed below. First, technological advancement has improved the crops’ ability to withstand disasters. The advancement of bio-pesticides due to technological advancement has increased the agricultural departments’ ability to prevent and control major agricultural pests and diseases while causing less environmental impact [21,22]. Simultaneously, the monitoring technology system of major sudden agricultural meteorological disasters constructed by the agricultural sector is also conducive to the agricultural sector’s better response to extreme weather events [23]. Second, technological advancement is a driving force in changing the mode of production. Modern agricultural mechanization can promote rapid agricultural production growth while producing good environmental results [24,25]. Fertilizer use can improve crop yield, but excessive use reduces crop yield [26]. Improved seed varieties, fertilizers, pesticides, echnical equipment, and infrastructure are used as proxies for technological progress in agricultural production [18,27-29]. Hence, this study also considers fertilizer use a proxy ‘or technological advancement, as it is a crucial factor in crop production.",
    "Wheat is China’s second most important food crop, after rice, and its planting area accounts for 22~30% of the total cultivated land [30]. Winter wheat is the predominant crop in China, accounting for more than 90 percent of the total output [31]. The regions of China hat produce winter wheat can be divided into Southern and Northern cultivation areas. The northern winter wheat producing region is the most concentrated wheat growing and consuming region in China, and its sown area and wheat output account for around wo-thirds of the country. In recent years, the top three provinces in northern China for winter wheat production were Henan, Shandong, and Hebei. Henan Province has an alternating temperate monsoon and subtropical climate, whereas Shandong and Hebei Provinces have a temperate monsoon climate. Figures 1 and 2 show their geographical ocation, wheat yield, temperature, and rainfall. Previous studies in various parts of the world have extensively documented the impact of changing climate on wheat crop yield. Most existing research on China discussed the relationship between the two at the national and regional levels [31-33] or only focused on a specific province, such as Henan Province, which has the highest wheat yield [30,34]. However, climate change causes food production variability in regions with varying climate resources. The current paper assesses the long-term effects of changing climate on wheat production in the top three provinces in northern China to further analyze the heteroge- neous influence of changing climate on wheat production, propose targeted measures to deal with climate change for the main grain-producing areas in China, and contribute to China’s food security strategy. Figure 3 shows the dynamic nexus between climatic factors, other determinants, and wheat production. Wheat may be one of the crops most susceptible to the effects of climate change, but its substantial impact on crop production is profound. Numerous research works have investigated the impacts of climate change on wheat development and harvest in major wheat-producing regions in Asia, Europe, and northern Africa. However, it is important to note that varied temperature conditions and precipitation patterns affect wheat growth and yield differently in different regions. Several researchers, for example, Zhai et al. [18], Abbas [27], Gul et al. [28], Ali et al. [35], and Warsame et al. [36], have explored the short-term and long-term climate change effects on food crop production by applying the autoregressive distributed lag (ARDL) methodology and reported mix outcomes related to climate variables. While, a study by You et al. [37] revealed that climate warming lowered wheat yield growth, a 1 °C rise in wheat growing temperature reduced wheat production by 3-10% in China. However, the findings of Zhai et al. [18] from 1970 to 2014 in China evaluated that temperature did not significantly influence the amount of wheat produced per unit of land in the short run and long run, while farm mechanization and fertilizer usage increased wheat output in the long run. More recently, the research by Gul et al. [5] from 1985 to 2016 in Pakistan established the long-term link between climate variables and main food crop production. The findings showed that temperature negatively affects key food crop production, while rainfall im- proves food production. Similarly, the study of Chandio et al. [38] from 1977 to 2014 in Pakistan revealed that climate change and CO; have a detrimental short- and long-term influence on grain productivity, reducing cereal production and causing food security issues in the country. Another similar study by Warsame et al. [39] for the period of 1980-2017 in Somalia examined the effects of climate change along with political instability on the productivity of sorghum by using various estimation techniques (i.e., FMOLS, DOLS, and CCR). The findings revealed that political instability and temperature significantly declined the pro- ductivity of sorghum, while rainfall and cultivated area enhanced the production in the long term. The long-term findings are also verified by the CCR approach. In the case of India, Bhardwaj et al. [40] reported that climate variables negatively contributed to wheat and paddy production; moreover, excessive rainfall had a detrimental influence on wheat and rice yields. In the case of Ghana, Ntiamoah et al. [41] used a novel dynamic simulated autoregres- sive distributed lag (ARDL) model to examine the impact of CO, emissions, rainfall, credit supply, and fertilizer on the productivity of maize and soybean, covering the period from 1990 to 2020. The findings revealed that CO, emissions, as well as rainfall, have a significant and positive impact on crop production, while the supply of credit and fertilizer negatively influenced maize production. In the context of Asia, Ozdemir [42] studied the effects o climate change on agricultural output by using various estimation techniques (i.e., PMG and CCEMG). The outcomes showed that temperature and CO) affected agricultural output negatively and significantly in the long term, while precipitation improved productivity. In addition, other factors, such as power consumption for agricultural machinery and fertilizer, significantly enhanced agricultural output in the same period.",
    "According to research by Akhtar and Masud [4] on the influence of climatic factors on rice and cereal production from the period 1985-2016, it was found that temperature and energy usage severely influence rice and vegetable output, although their effect on cereal productivity is minor. However, CO) emissions negatively influenced coffee production, and the temperature, energy use, and fossil fuel usage induced climate change, which had a negative impact on Malaysian agriculture. The empirical study of Kumar et al. [43] in selected lower-middle-income nations from 1971 to 2016 assessed the climate change-—cereal crops production association. The authors’ findings revealed that rising temperatures diminish crop productivity. Rainfall and CO, emissions boosted crop yields, and a bidirec- tional causation between grain output, temperature, and CO? emissions was discovered. Rainfall and temperature affect grain production uni-directionally and might threaten the food security of the rural populations. In particular, a study in China by Pickson et al. [44] from 1998 to 2017 examined the effects of climate change on rice cultivation. The findings showed that the climate variable, such as the temperature, adversely influences rice cultivation, while average rainfall influences the rice output but is insignificant. The farmed area positively affected short-term crop output. At the same time, fertilizer use had little effect and bidirectional causation between rice production and the cultivated area. Similarly, the investigation of Pickson et al. [6] in China over the period 1990Q1-201304 found that the average tempera- ture and its variability associated with cereal production were negative but significant in the long run. Additionally, rainfall variability and cereal production linkage showed no significant effect in the long run, but two variables (CO and temperature variability) had a negatively significant association in the short run. Likewise, Pickson et al. [45] investigated the impact of global warming on the main food crops (i.e., rice and maize) production in the case of China over the periods 1978Q1- 2015Q4. The outcomes revealed a significantly positive trend in average temperature and seasonal temperature increases during the spring, summer, and fall with the insignificant change in the monthly, seasonal, and annual precipitation. The impact of temperature decreases maize and rice production at higher quantiles. Due to the diverse time scales, geographic locations, and techniques, the following research work has not yet formed consistent findings on climate change’s influence on wheat growth and yield. These research works failed to combine the climatic conditions and agricultural progress elements into crop yield—climate functions to investigate their influence, and the long-run impacts on wheat must be studied. In this work, we employed the FMOLS method to assess the long-run climate variations’ influence on wheat yield in the northern region of China. The findings of the FMOLS approach are verified by the DOLS and CCR estimators. The present study intends to investigate the long-run impact of temperature, rainfall, ertilizer usage, power usage, farming area, and labor on wheat production in the con- ext of top 3 wheat-producing provinces of northern China. Wheat production is used as he dependent variable, and it is measured in 10,000 tons, while climatic factors, namely, emperature measured in degrees Celsius, rainfall measured in millimeters, fertilizer us- age measured in 10,000 tons, power consumption measured in 1000 kWh, the cultivated area measured in 1000 hectares, and labor measured in 10,000 people, are used as the independent variables. The data were extracted from the China Rural Statistical Year- book (https: / /data.cnki-net/ Yearbook/Navi?type=type&code=A# (accessed on 1 June 2022)) and the National Weather Science Data Center (http: / /data.cma.cn/ (accessed on June 2022)). This study examines the long-run impact and the causal relationship between tem- perature, rainfall, fertilizer usage, power consumption, cultivated area, labor, and wheat production in the selected provinces of China. Several investigation tests were carried out to achieve the research objective, including the co-integration test, FMOLS, DOLS, and CCR estimators, and the Granger causality test. The basic model is constructed as shown below: where WP indicates wheat production, TEMP denotes average annual temperature, RF represents average annual rainfall, FER indicates fertilizer usage, PC shows the power consumption, WA stands for wheat cultivated area, LF indicates rural labor force. This paper uses the fully modified OLS (FMOLS) proposed by Phillips and Hansen [46] to estimate the co-integration coefficient. Based on the OLS, this method uses the semi- parametric two-stage estimation method to correct the equalization error and the explained variable, which can effectively eliminate the endogeneity caused by the co-integration relationship and the sequence correlation of error terms, thus obtaining the consistent estimator of co-integration parameter estimator and the asymptotic normal distribution of FMOLS estimator. Suppose the model is Let pu = Me + ,. First, perform OLS estimation on Equation (3) to obtain the 6 and (t, of OLS estimators. Second, estimate the long-term variance of 14. Let O and A represent long-term variance and one-sided long-term variance, respectively, and the estimates are shown in Formulae (5) and (6).",
    "Furthermore, we use the dynamic OLS (DOLS) proposed by Stock and Watson [47] and the canonical co-integrating regressions (CCR) proposed by Park [48] to verify the robust- ness of FMOLS estimation results. The DOLS estimation model contains the lag term of explanatory variables, and the standard deviation of its estimator has a normal asymptotic distribution, which is also better than the OLS estimation [40]. The idea of the CCR model is the same as the FMOLS model, but the difference is that it transforms the data stationarity to obtain the least-square estimation and then eliminates the dependency between the co-integration equation and the random correction equation of the explanatory variables. We use the FMOLS, DOLS, and CCR estimators to examine the long-term influence of temperature, rainfall, fertilizer use, power consumption, wheat farming area, and labor on wheat production in the selected three provinces of China. Table 1 reports the statistical summary of the dependent and independent variables for the Hebei, Henan, and Shandong Provinces. The J-B test confirms that all the studied variables are normally distributed. Figure 4 shows the trend of wheat production and climatic factors in the selected provinces of China. The outcomes of the correlation matrix for Hebei, Henan, and Shandong Provinces are presented in Table 2. The findings for Hebei Province reveal that temperature, rainfall, fertilizer usage, power consumption, and labor are significantly and positively associated with wheat production, while the cultivated area is negatively associated. Further, the findings for Henan Province show that all the studied variables are significantly linked with wheat production, except rainfall. In addition, the outcomes for Shandong Province indicate that temperature, cultivated area, and labor are significant and interrelated with wheat production, whereas fertilizer is negatively associated. We employ the Johansen and Juselius co-integration procedure to explore the long- term association between the explained variables, such as wheat production and its ex- planatory variables. We test the research hypothesis, as the null hypothesis states that the explained variables, wheat production and its explanatory variables, are not co-integrated in the long term. In contrast, the alternative hypothesis mentions that the considered variables are co-integrated in the long term. To reach a decision about the hypothesis, we use the Trace t-statistic test, and the findings for Hebei, Henan, and Shandong Provinces are reported in Table 3. The findings reveal that wheat production, temperature, rainfall, fertilizer usage, power consumption, cultivated area, and labor force are co-integrated in the long term in China’s selected wheat-producing provinces. Note: LWP, LTEMP, LRE, LFER, LPC, LWA, LLF signify the natural log of wheat production, average annual temperature, average annual rainfall, fertilizer usage, power consumption, wheat cultivated area, and rural labor force, while J-B denotes the Jarque—Bera test. Table 4 reports the estimated results of long-term effect of climate variables and other control variables on wheat yield in Hebei, Henan, and Shandong Provinces, respectively. In the case of Hebei Province, the climate variables (i.e., temperature and rainfall) have a positive, significant impact on wheat production. This means the climate conditions are more favorable for wheat cultivation in Hebei Province. Specific to the North China Plain, where this study area is located, some research evidence shows that in the north of this plain, the impact of rainfall on wheat production is positive, while in the south of this plain, the impact of rainfall turns negative [49]. Similarly, for temperature, the increase in temperature increases the winter wheat yield in the northern part of the North China Plain but decreases the wheat yield produced in winter in the south of the North China Plain [50]. The top three wheat-producing provinces are selected for this investigation. Hebei, Shandong, and Henan Provinces are distributed in the North China Plain. The three provinces’ yearly mean temperature and yearly mean precipitation are ranked from low to high in Hebei, Shandong, and Henan (see Figure 2). The temperature and rainfall in Hebei Province are low, and the impacts of temperature and precipitation on wheat yield are positive. Further results reveal that fertilizer use, cultivated area, and labor force also have a positive, significant influence on wheat production. The long-run coefficients of fertilizer use, cultivated area, and labor force indicate that a 1% increase in fertilizer treatment use, cultivated area, and labor force wheat production improved by 0.17%, 0.58%, and 1.36%, respectively.",
    "In the case of Henan Province, the climatic factors (i.e., temperature and rainfall) and wheat production relationship was significant and negative. This means that climatic factors severely impact wheat production in Henan Province. The long-run coefficient of both climate variables, temperature and rainfall, indicates that with a 1% increase in both climate variables (i.e., temperature and rainfall), wheat production decreases by 0.51%, and 0.05%. Geng et al. [51] reported that high temperatures will be detrimental to wheat production by shortening the growth cycle of the wheat crop. Further, Song et al. [33] stated that excessive rainfall causes excessive water accumulation, which will aggravate the wet damage of wheat and negatively affect wheat production. Moreover, the results show that fertilizer usage also significantly negatively impacts wheat production. The long-term coefficient of fertilizer usage reveals that if a farmer overuses the fertilizer by 1%, wheat production declines by 0.61%. Fertilization can not only supplement the nutrients needed by wheat but also improve the utilization rate of water, thus increasing the yield of wheat [52,53]. However, unreasonable and excessive use 0 chemical fertilizers will cause soil degradation and adversely affect wheat yield. This shows that the rational use of chemical fertilizers is very important for wheat production, and Henan Province should pay more attention to improving chemical fertilizer use efficiency. In contrast, these variables (power usage, wheat farming area, and labor force) and the wheat production relationship were significant and positive. The long-run coefficien! of power usage, wheat farming area, and labor force reveals that a 1% increase in power usage, wheat farming area, and labor force increases wheat production by 0.48%, 2.98%, and 0.21%, respectively. In the case of Shandong Province, the climate variables, temperature, and whea production displayed a diverse relationship. At the same time, rainfall had a significan and positive influence, suggesting that with a 1% increase in temperature and rainfall, wheat production decreased by 0.07% and improved by 0.08%. The heterogeneous effec of the climate variables on regional wheat yield is verified by some existing studies. For example, the evidence from Mexico and China verified that the sensitivity of wheat yield to climate variables is uneven in space [54,55]. Tao et al. [56] studied climate change’s influence on wheat productivity and found the prospective consequences of climate change on winter wheat output in northern China under 10 climatic scenarios and concluded that environmental variability might enhance wheat yield by 37.7% (18.6%), 67.8% (23.1%), and 87.2% (34.4%), with (without) CO) fertilization effects in the 2020s, 2050s, and 2080s, respectively, in the future. The temperature and rainfall in Shandong Province are in the middle of the three provinces, and the impact of temperature on wheat yield is negative, but the impact of rainfall is positive. In Henan Province, it is observed that the temperature is higher, and the rainfall is higher; the influence of temperature and rainfall on wheat is negative. Moreover, the results show that these variables (fertilizer use, cultivated area, and labor force) and wheat production association was significant and positive, suggesting that a 1% increase in fertilizer usage, cultivated area, and labor force enhanced wheat production by 0.29%, 1.16%, and 0.23%, respectively. This study applied the DOLS and CCR long-run estimators as a robust check approach for the FMOLS findings. Table 5 shows that climate variables positively affect wheat production in the context of Hebei Province. The estimated coefficients of DOLS and CCR are consistent with the findings of the FMOLS model. Likewise, in Henan Province’s case, climatic factors negatively influence wheat production. These outcomes are also consistent with the outcomes of the FMOLS model. In addition, climatic factors, such as temperature, only have a negative impact on wheat production. Meanwhile, rainfall has a significant and positive linkage with wheat production. Hence, the results of both techniques, such as DOLS and CCR, are similar to the results of the FMOLS method. Although the long-run impact of the variables concerned was explored through the FMOLS, DOLS, and CCR estimators, the causal connection between the underlying vari- ables is still in question. Therefore, we further apply the Granger causality method. The findings for Hebei, Henan, and Shandong Provinces are presented in Table 6. A bidirec- tional causality between precipitation and fertilizer usage with wheat production in the context of Hebei Province can be observed. This means that rainfall and fertilizer usage significantly contributed to Hebei Province’s wheat production.",
    "Further, the results only discover a unidirectional causality association between wheat production and temperature. In the context of Henan Province, it is revealed that a uni- directional causality association runs from precipitation and fertilizer usage to wheat production. In contrast, a bidirectional causality exists between power consumption and wheat production. This depicts that climate change factors, such as rainfall, and other inputs also positively influence wheat production. In addition, a bidirectional causality is established between the farming area and wheat production, while a unidirectional causality is detected from precipitation and labor to wheat production. These results imply that the cultivated area, rainfall, and labor significantly improve wheat production in the context of Shandong Province. The current study assesses the climate variables’ long-run impact on wheat production in China’s top three wheat-producing provinces. The other important factors considered in this paper include fertilizer usage, cultivated area, power consumption, and labor. The data set consists of observations from 1992 to 2020 on which several time-series techniques, namely, the DOLS, FMOLS, CCR, and Granger causality, were applied. Based on the estimations, the findings revealed that wheat production is negatively affected by climate change in Henan Province. In contrast, climate change is more favorable for wheat production in Hebei Province. On the other hand, temperature negatively influenced wheat production but was not significant, while rainfall significantly contributed positively to wheat production in Shandong Province. Further findings showed that fertilizer usage, cultivated area, and labor positively and significantly improved wheat production in Hebei and Shandong Provinces. In contrast, power usage, wheat farming area, and labor force significantly and positively enhanced wheat production in Henan Province. In addition, the findings of the Granger causality test reported a bidirectional causality between rainfall and fertilizer use with wheat production in Hebei Province, while a unidirectional causality connection was revealed between wheat production and temperature. In the context of Henan Province, it was discovered that a unidirectional causality link was observed from rainfall and fertilizer use to wheat production. In contrast, a bidirectional causality existed between power consumption and wheat production. Moreover, a bidirectional causality was established between the cultivated area and wheat production, while a unidirectional causality was detected from the rainfall and labor to wheat production in Shandong Province. Based on the estimated outcomes, the current paper offers several policy implications: With both advantages and disadvantages, China’s wheat production is affected by global warming. To mitigate the effects of a changing climate on China’s wheat yield, it is vital to increase the adaptability of wheat production. First, modify wheat’s sowing date and area in a reasonable manner. Adjust the sowing date of crops, rationally plan the planting areas, fully utilize the additional heat resources brought about by climate change, decrease the impact of meteorological disasters, and increase the stability of wheat production based on the climatic conditions of various regions. Second, agricultural technology advancement will continue to be important in en- suring wheat yield stability. On the one hand, the Chinese government must prioritize research and develop seed resources resistant to extreme weather conditions. It is crucial to develop and store wheat germplasm resources that can respond to adverse weather conditions, given the prevalence of extreme weather events (high-temperature resistance, waterlogging resistance, low-temperature resistance, etc.). On the other hand, it is essential to continue using advanced agricultural technologies to produce wheat. For instance, more fertilizer use techniques should be implemented to increase the input effectiveness of chemical fertilizers and ensure the sustainability of agricultural production. Furthermore, there are regional differences in wheat planting varieties and methods in China, making it difficult to continuously improve wheat production levels by relying solely on a single technology. As a result, it is necessary to promote improved varieties in conjunction with good methods, agricultural machinery, and agronomy, as well as to further tap the potential of science and technology to increase production. Author Contributions: Conceptualization, A.A.C. and H.Z.; methodology, A.A.C.; software, A.A.C. and Y.T.; validation, G.R.S.; formal analysis, A.A.C. and Y.T.; investigation, A.A.C. and Y.T.; resources, H.Z.; data curation, Y.T.; writing—original draft preparation, A.A.C. and Y.T.; writing—review and editing, M.A.T. and G.R.S.; visualization, H.Z.; supervision, A.A.C.; project administration, H.Z.; fund- ing acquisition, H.Z. All authors have read and agreed to the published version of the manuscript."
]