[
    "Yu Zhang 1, Wenliang Geng 1, Pengyan Zhang 1,2,*, Erling Li 1,2,*, Tianqi Rong 1, Ying Liu 1, Jingwen Shao 1 and Hao Chang 1 Abstract: The measurement of eco-eﬃciency is an important tool to evaluate the level of urban sustainable development. Therefore; improving urban eco-eﬃciency in the lower reaches of the Yellow River ensures the implementation of ecological protection and high-quality development strategies in the Yellow River Basin. In this study; the dynamic changes of urban eco-eﬃciency and spatiotemporal diﬀerences in the lower reaches of the Yellow River were investigated using the Super-SBM (Super-Slack measure model) model with undesirable outputs and standard deviation ellipse. The STIRPAT (Stochastic Impacts by Regression Population; Aﬄuence and Technology) model was introduced to analyze the factors aﬀecting the change in urban eco-eﬃciency. The results showed that the overall urban eco-eﬃciency in the lower reaches of the Yellow River has not reached the optimal level. The overall eco-eﬃciency in the lower reaches of the Yellow River in Shandong Province was higher than that in Henan Province but the gap is narrowing. The spatial diﬀerentiation of urban eco-eﬃciency in the lower reaches of the Yellow River showed the following trends: “blooming in the middle and reverse development at both ends” in the high-value area and gradual decrease in the low-value area. From 2007 to 2018; a direction was notable with respect to the development of urban eco-eﬃciency in the lower reaches of the Yellow River; with the centripetal force weakening. Although the mean center of urban eco-eﬃciency located in Shandong Province; it notably shifted to the west during the study period. In terms of driving factors; aﬄuence and technological progress play positive roles in driving eco-eﬃciency; while investment intensity; industrial structure; and foreign investment intensity hindered the optimization and improvement of urban eco-eﬃciency in the lower reaches of the Yellow River. The results of this study show that urban eco-eﬃciency in the lower reaches of the Yellow River is improving; but the regional coordination is poor. The main methods promoting the sustainable development in the study area include changing the mode of extensive investments and the introduction of foreign capital; which improve the energy eﬃciency and promote As economic, political, and cultural centers, cities accommodate more than 50% of the world’s population and contribute to 80% of the gross domestic product (GDP) growth [1,2]. Urbanization has promoted economic growth and profound changes in the population structure [3]. However, unrestricted urbanization severely aﬀects the ecological environment and leads to changes in global and regional resources, such as global warming, environmental pollution, food security, and so on [4,5]. China has experienced large-scale urbanization and industrialization since the reform and opening up (since 1976) [6]. While urbanization promotes rapid development of the social economy, it has caused serious damage to the ecological environment, which has become the key factor restricting the sustainable development of Chinese cities [6–9]. Methods to eﬀectively maximize economic output while minimizing environmental pollution and to promote the transformation of the extensive development model of cities to an “intelligent”, “sustainable”, and “healthy“ development model have become the focus of governments and scholars worldwide [10–13]. The concept of eco-eﬃciency, put forward by Schaltegger and Sturm in 1990 [14], refers to a cross-eﬃciency that connects environmental problems with economic problems and embodies the relationship between economic development and utilization of resources and the environment [15,16]. Embedding the ecological consumption of resources into traditional socioeconomic input–output accounting provides a new cut-in point and perspective for the comprehensive study of the level and quality of urban development [17]. The World Council for Sustainable Business deﬁnes eco-eﬃciency as the provision of competitive goods and services to meet human needs and improve the quality of life, while gradually reducing ecological impacts and the resource intensity throughout the life cycle to meet the carrying capacity of the planet [18]. After more than 20 years of development, the evaluation of eco-eﬃciency has become an important tool for the comprehensive analysis of urban sustainable development and a focus of academic research pertaining to urban geography [19,20]. measurement methods, and driving factors [21]. In this study, the progress and challenges of current research as well as methods for improvement are discussed. The evaluation index of the eco-eﬃciency has changed from a single ratio to a comprehensive index system including resource input, energy consumption, economic output, and environmental pollution output. However, urban CO2 emissions are rarely included in the index system in current research, mainly because CO2 plays an important role in the development and sustainability of life, and thus is not regarded as a pollutant [22]. However, CO2 produced by fossil fuel combustion during urban development is the main carbon source leading to global warming [23] and is regarded as an undesirable output in the evaluation of eco-eﬃciency in this study. Based on this perspective, the measurement results better reﬂect the actual development processes of cities.",
    "are diﬀerent [16]. Current research on urban eco-eﬃciency mainly focuses on life cycle analysis [24], the ecological footprint [25], frontier analysis [26], and data envelopment analysis (DEA) [27]. Although many standardized and normalized statistical methods are available, both subjective and objective methods have limitations. The DEA is widely used in the study of eco-eﬃciency because it is not aﬀected by index units and weights and is easy to operate [28,29]. Research on urban eco-eﬃciency based on DEA is mainly divided into three aspects. First, during the processing of undesirable indicators, undesirable data generated in the process of urban production are classiﬁed into the input part to measure, which is usually based on traditional or super-eﬃciency DEA models [16]. Second, some scholars have used DEA model based on mixed distance function to solve the deviation of measurement results of DEA model based on radial and non-radial angle. [30,31]. Third, when faced with decisions in diﬀerent directions, the traditional DEA model is not suﬃciently comprehensive to measure the undesirable output (e.g., pollutants); hence, there may be a deviation in the eﬃciency [32]. To obtain accurate results, scholars generally process undesirable outputs using the SBM (slack measure model), which better reﬂects the actual situation [33,34]. However, during the calculation, multiple decision making units (DMUs) eﬃciency values might equal 1. In order to solve the defects, the Super-SBM model is often introduced for the calculation of eco-eﬃciency [35]. Because the Super-SBM model can not only measure the undesirable output but also compare the eco- eﬃciency of each DMU, it is the most suitable model for this study. is the focus of the current research. Many regression models are available to study the socioeconomic determinants of eco-eﬃciency, including the spatial and non-spatial regression models [31]. Because the STIRPAT(StochasticImpactsbyRegressionPopulation,AﬄuenceandTechnology)modelcanaccurately specify the sensitivity of environmental impacts to the driving forces, it has been widely used in the study of the eﬀects of human activities on the ecological environment [36,37]. At present, Chinese scholars have made great progress in the study of the relationship between ecology and the economy based on the DEA model. However, research on the regional ecological environment is mainly focused on urban agglomeration [19], with a high level of urbanization, the eastern coast [21], and the Yangtze River economic belt [38] with good regional coordination. There is a relative lack of research on the eco-eﬃciency of the sub-region of the river basin where the level of urbanization lags and the pressure of ecological environment is high. The plain area of the lower reaches of the Yellow River is one of the most important grain-producing areas in China and has the longest farming history [39]. It is one of the typical areas of the Yellow River Basin in which the economy develops rapidly and human activities have a greater impact on the environment [28]. This is characterized by the lack of groundwater, uneven economic development of regional cities, and serious environmental pollution [40,41]. Ensuring ecological protection and high-quality economic development in the Yellow River Basin have become national strategies; further, the green transformation and development of cities in the lower reaches of the Yellow River are urgent problems to be solved. In this study, we constructed an index system for measuring urban eco-eﬃciency including environmental pollution data and explored the temporal and spatial evolution of urban eco-eﬃciency in the process of urbanization of traditional agricultural areas in China. In addition, the factors inﬂuencing the change in eco-eﬃciency are analyzed, which is of great signiﬁcance for the sustainable economic development of cities in the lower reaches of the Yellow River. challenges existing in the current research and puts forward corresponding solutions to make the research reﬂect the actual process of urban production. In this study, the lower reaches of the Yellow River, which are characterized by a contradiction between urban economic development and ecological environment protection, were selected as the study area. The estimated urban CO2, wastewater, sulfur dioxide, and dust emissions were included in the undesirable output—these indicators can reﬂect the eﬀorts made by local governments in the improvement of water quality and atmospheric environment control. The Super-SBM model was used to measure the change characteristics of urban eco-eﬃciency in the lower reaches of the Yellow River during 2007–2018. Moreover, the STIRPAT model, which is relatively mature with respect to the analysis of the eco-environmental tradeoﬀ and coordination [42,43], was introduced to determine the eﬀect of human factors, such as population, aﬄuence, technology, and urbanization, on urban eco-eﬃciency. The results support urban development and eco-environmental protection, providing references for research on the sustainable development of the region and cities with similar environmental and economic conditions worldwide.",
    "In this study, an index system was established that can better reﬂect the real urban production. The most suitable measurement model of urban eco-eﬃciency was selected based on the characteristics of the DEA model, with the relatively mature STIRPAT model being used to measure the eﬀects of social and economic factors of eco-eﬃciency. Finally, the cities in the lower reaches of the Yellow River were selected as the study objects to analyze the spatiotemporal variation and driving mechanism of urban eco-eﬃciency in traditional farming areas. The overall structure of this study is as follows: The data resources and method used for the estimation of eco-eﬃciency are described in Section 2. The changes in the time series and spatial diﬀerentiation of urban eco-eﬃciency in the lower reaches of the Yellow River are analyzed in Section 3, as well as the eﬀects of socioeconomic factors, which are discussed based on the STIRPAT model of urban eco-eﬃciency. The novelty and shortcomings of the study as well as future research directions are discussed in Section 4. Conclusions and suggestions for the sustainable development of cities in the lower reaches of the Yellow River are provided in Section 5. Based on the natural division, the lower reaches of the Yellow River, with a length of 785.6 km, can be divided from Taohuayu to Lijin County [43]. Because the close relationship between regional economic development in the lower reaches of the Yellow River and the integrity of administrative divisions at the prefectural level, the areas covered by the irrigation areas in the lower reaches of the Yellow River are merged into the study area [41,44] (see Figure 1). Laiwu City in Shandong Province was merged with Jinan City in 2019, forming the Laiwu District. However, because the research period of this study is 2007–2018, Laiwu City was still considered as an independent prefecture-level city. By 2018, the GDP in the study area reached 6.63 trillion yuan, accounting for more than 40% of the total GDP of the whole basin, while the average level of urbanization and urbanization level of key cities reached >57% and >70%, respectively. In 2019, the ecological protection and high-quality development of the Yellow River Basin became national strategies that provided strategic opportunities for the coordinated development of the regional economy as a unit [45]. Therefore, it is urgent to study the spatiotemporal diﬀerences of the urban eco-eﬃciency in traditional farming areas in the lower reaches of the Yellow River and to analyze the inﬂuencing factors in order to provide relevant policy suggestions for the study of regional urban sustainable development. The data were obtained from the 2008–2019 “China City Statistical Yearbook”, 2008–2019 “Shandong Statistical Yearbook”, and 2008–2019 “Henan Statistical Yearbook”. In this study, we used interpolation to supplement instances of data loss. The yearbook data are obtained from China Economic and Social Big Data Research Platform [46]. According to previous research results; the actual situation of urban development in the lower reaches of the Yellow River; and principles of comprehensiveness, scientiﬁcity, typicality, operability, and dynamics, researchers have established an index system for the determination of the urban eco-eﬃciency [9,15–17,19]. This system is based on the principle that the DEA model’s calculation indicators are less than or equal to one-third of the number of DMU [47]. In this study, input–output evaluation indicators, including resource input, economic output, and pollution output, were established. The urban resource input includes the resources, labor, and capital and the GDP is the desirable output. Pollution data are considered as undesirable output. The speciﬁc indicators are shown in Table 1. According to previous studies, the input of production factors calculated using DEA mainly includes labor, capital, and energy resources. Based on previous studies, energy is an important input resource for urban development [31]. Because the energy data of prefecture-level cities are diﬃcult to obtain, in order to make the energy input of diﬀerent prefecture-level cities comparable with each other, this study converted the consumption of natural gas, liqueﬁed petroleum gas, and electricity consumption of diﬀerent prefecture-level cities into 10,000 tons of standard coal equivalent (SCE). According to their caloriﬁc value, and then added the values up to obtain the total energy input of each prefecture-level city. Labor resources are expressed in terms of the urban employment population at the end of the year. The ﬁxed asset investment was reduced by selecting the total ﬁxed asset investment and using 2007 data as the constant price based on previous depreciation rates [32] and the perpetual inventory method to simulate the capital stock during the study period. The equation is as follows: where K0 represents the capital stocks of the base period, I0 denotes the gross ﬁxed capital formation of the base period, g is the annual average growth rate of the regional GDP, and δ is the depreciation rate. We selected the depreciation rate following the research of Hall and Jones [48].",
    "The output index includes desirable and undesirable output indicators. The actual GDP of each city is used as the desirable output indicator. However, due to diﬀerences in the levels of economic development of various cities, we reduced the GDP using 2007 as the base period according to the GDP index in the annual statistical yearbook to eliminate the inﬂuence of price factors and allow for comparison. Many pollutants are generated during urbanization and industrialization. Based on the selection of traditional pollutant indicators, the city’s CO2 emissions were simulated in this study considering the availability and consistency of data and actual production and living conditions. For the speciﬁc method of urban carbon dioxide, see Equation (2). The result of this calculation can reﬂect the actual city production process better. Energy consumption is the main source of carbon emissions [23]. Because it is diﬃcult to collect energy consumption data of prefecture-level cities in the lower reaches of the Yellow River, we followed previous studies and used the product of the output values of secondary and tertiary industries and the energy consumption per unit of GDP as urban carbon emissions [49]. The output values of secondary and tertiary industries are mainly generated by urban economic activities, and thus choosing GDP energy consumption data to calculate carbon emissions can better reﬂect the government’s eﬀorts in energy saving, emission reduction, and industrial upgrading [50]. The equation is as follows: where Ei represents the carbon emissions of the i-th city, GDP23 represents the GDP of the secondary industry and the tertiary industry of the i-th city, H is GDP energy consumption (standard coal/10,000 yuan), and K is the carbon emission coeﬃcient of the coal consumption based on the conversion factor of standard coal into CO2. The value of standard coal K was determined to be 2.7725 t CO2 /tce based on previous studies [51]. The DEA model as a linear programming method for measuring the technical eﬃciency of DMUs was ﬁrst proposed by Charnes et al. in 1978, which can include multiple input–output variables [52]. In order to avoid errors when the traditional DEA model is faced with diﬀerent directions of decision making, this study calculated the urban eco-eﬃciency of the lower reaches of the Yellow River according to the SBM model based on undesirable outputs proposed by Tone [33]. However, it was found that there were multiple DMUs whose eﬃciency values were equal to 1. To make the eﬃciency value of each DMU comparable, we introduced the Super-SBM model to measure eco-eﬃciency. The Super-SBM model is a new model proposed by Tone in 2002 that is based on the Super-DEA model and the SBM-DEA model, combining the advantages of the SBM model and the super-eﬃciency DEA model. Each DMU can be compared according to the actual situation [35,53]. First, assume that n decision making units (DMUs), X inputs, and Y output variables, m, s1, and s2 are expressed as the number of inputs, desirable output, and undesired output, respectively. Each DMU will have m types of inputs Xij (q = 1, 2, ... , m), S1 desirable outputs, and S2 undesired outputs (r = 1, 2, ... , s2). The speciﬁc formula is as follows: where s , sg, and sb denote the slack in the inputs, desirable outputs, and undesirable outputs, respectively. The target function value of ρ is the eﬃciency value of the DMU. When ρ ≥ 1, the DMU is eﬀective. Thestandarddeviationellipse(SDE)wasproposedbyLefeverin1926forthecharacterizationofthe spatial direction distribution of geographic elements, focusing on revealing the global characteristics of the spatial distribution of geographic elements [54,55]. The model includes 4 basic elements—azimuth, mean center (MC), standard deviation along the long axis, and standard deviation along the short axis, which indicate the main trend direction of the development of geographic elements and degree of dispersion in the main and secondary directions and represent the central position of all data [56–58]. The corresponding equations are as follows: where xi and yi are the spatial coordinates of the research object, qi is the weight, i is the DMU, and x and y represent the relative coordinates of each point from the center of the region. The IPAT (Impact, Population, Aﬄuence, Technology) model has been widely used to analyze the relationship between human activities and the environment since it was proposed in the 1970s (Equation (6)) [59]. Dietz et al. proposed the STIRPAT (Stochastic Impacts by Regression Population, Aﬄuence and Technology) model based on the elasticity coeﬃcient in 1994 [60]. The STIRPAT model (Equation (7)) more accurately measures the eﬀects of socioeconomic factors on the environment [42,61]. The equations are as follows: where I is the environmental impact; P is the population concentration; A is the degree of aﬄuence; T is the technological progress; a is the constant term; e is the error term; and b, c, and d are human-driven indices of P, A, and T, respectively.",
    "Based on previous studies [43], we used the STIRPAT model in this work to detect the driving factors that aﬀect the urban eco-eﬃciency of the lower reaches of the Yellow River. It measures the 6 aspects of population agglomeration, wealth, technological progress, industrial structure, openness, and investment intensity. After normalization with the dependent variable, application of the natural logarithm, and regression simulation, we obtained the following equation: where E represents the eco-eﬃciency of the city, P is the population agglomeration expressed by the level of population urbanization, A is the per capita GDP, and T is the technological progress. Based on previous studies, technological progress is mainly reﬂected by improvements in the energy eﬃciency during urban development [62]. Therefore, the reciprocal of the energy consumption per unit GDP was used in this study. The parameter FDI indicates the intensity of foreign investment, which is expressed as the ratio of the actual utilized foreign capital to the GDP. The parameter II is the investment intensity and is expressed by the ratio of ﬁxed asset investments to the GDP. The parameters a, b, c, d, g, and h are elastic coeﬃcients. Based on the Super-SBM model with undesirable output, we used MAXDEAultra7.2 software (Beijing Realworld Software Company Ltd., Beijing, China) to measure the urban eco-eﬃciency of 20 prefecture-level cities in the lower reaches of the Yellow River from 2007 to 2018 and analyzed the spatiotemporal evolution of the urban eco-eﬃciency in China. Figure 2 shows that the value of urban eco-eﬃciency in the lower reaches of the Yellow River did not reach 1, and thus the whole study area had not reached the stage of “eﬃciency”. The average eﬃciency in each year ranged from 0.6 to 0.8. The overall average eco-eﬃciency in the lower reaches of the Yellow River in Shandong Province was higher than that in the lower reaches of Henan Province. However, optimum eﬃciency had not been achieved, indicating that the focus must be placed on green development when considering the economic development of cities in the lower reaches of the Yellow River in order to improve eco-eﬃciency. During the study period, the average urban eco-eﬃciency in the lower reaches of the Yellow River steadily increased, except for the period of 2010–2012. In 2011, the eco-eﬃciency of the study area was at the lowest level in the study period, and began to rebound in 2012, mainly due to the implementation of the Twelfth ﬁve-year plan for the prevention and control of air pollution in key areas in 2012, which strengthened the eﬀorts of environmental protection and control. The urban eco-eﬃciency in the lower reaches of the Yellow River in Shandong Province shows an overall “decline–rise–decline” trend, while the urban eco-eﬃciency in the lower reaches of the Yellow River in Henan Province ﬂuctuated in the early stage and steadily increased in the later stage. From a phased point of view, the eco-eﬃciencies of the cities in the lower reaches of the Yellow River showed a downward trend in the early stage of the study period (2007–2009), mainly due to the government increasing infrastructure investments and vigorously promoting the development of the economy to slow down the impact of the global economic crisis. This led to ineﬃcient economic development and serious environmental pollution. In the middle of the research period (2009–2014), the urban eco-eﬃciency in the lower reaches of the Yellow River signiﬁcantly ﬂuctuated. The urban eco-eﬃciency in Shandong Province ﬁrst declined, then rose, and then declined. The urban eco-eﬃciency in Henan Province ﬁrst increased, then decreased, and ﬁnally steadily increased. In the later period of the research period (2014–2018), the gap in the urban eco-eﬃciencies between the two provinces gradually decreased. In the past two years, the level of the urban eco-eﬃciency in the lower reaches of the Yellow River in Henan Province has been the same as that in Shandong Province, indicating that the mode of economic development in Henan Province has changed since 2011 and the eﬃciency of economic development has improved on the basis of energy conservation and emission reduction, which greatly improves urban eco-eﬃciency. 2007to2018. First,theﬂuctuationattheupperandloweredgesoftheboxmapweakened,indicatingthat the high and low eco-eﬃciency values obtained for each year were stable. Second, except for the low eﬃciency value corresponding to the 75th percentile of the boxplot in 2011, the eﬃciency value corresponding to the 75th percentile in other years remained basically stable, and the eﬃciency was ~1, i.e., almost optimal. The median value decreased from 2007 to 2011 and was close to the lower edge of the box, indicating that the average level of urban eco-eﬃciency in the lower reaches of the Yellow River decreased during this period. During this period, urban development was mainly restricted by the traditional economic development model, the government’s economic stimulus policy, and the relatively weak environmental protection. The median distribution of the eco-eﬃciency ﬂuctuated from 2011 to 2014 and gradually increased from 2015 to 2018, indicating that the average eco-eﬃciency improved during this period. During this period, the Chinese government promulgated a series of policies and measures to strictly protect the environment and promote the transformation of urban economic development and the upgrading of industrial structure. The gap between the upper and lower edges of the box map decreased in the past two years, indicating that the gap between the eco-eﬃciencies of cities has been reducing since 2017.",
    "The analysis of the temporal evolution of the urban eco-eﬃciency in the lower reaches of the Yellow River in Section 3.1.1 indicates a signiﬁcant diﬀerence, although the diﬀerence in the eco-eﬃciency in the research area was alleviated later in the study period. Therefore, to explore the spatial diﬀerentiation of the urban eco-eﬃciency in the lower reaches of the Yellow River, we selected four time points in this study (2007, 2011, 2015, and 2018) and used the visualization tools of ArcGIS10.1 software to obtain spatial diﬀerentiation maps of the urban eco-eﬃciency for those years (Figure 4). The analysis of Figure 4 shows that the level of urban eco-eﬃciency in the lower reaches of the Yellow River showed a deteriorating trend from 2007 to 2011, showing a trend of improvement from 2015 to 2018. The high-value area showed a “blooming in the middle and developing in the opposite direction at both ends” trend. This means the high value areas of urban eco-eﬃciency in Henan Province are gradually increasing, while the cities in Shandong Province with high eco-eﬃciency show a downward trend. In the border area of the two provinces, the urban eco-eﬃciency also showed improvement. Meanwhile, the urban eco-eﬃciency in the low-value area gradually decreased. In 2007, the high-value area in the lower reaches of the Yellow River was in Shandong Province, and only Xuchang and Zhoukou in Henan Province exhibited eﬃciency values greater than 1. The junction of Shandong and Henan provinces has become a low-value agglomeration area with respect to eco-eﬃciency. Hebi was the city with the lowest eco-eﬃciency in the study area (Figure 4a). In 2011, areas with low eco-eﬃciency expanded and the eﬃciency values of Zhengzhou, Zhoukou, Jinan, Dongying, and Zibo signiﬁcantly decreased. The eco-eﬃciency values of Anyang and Laiwu declined below 0.4 (Figure 4b). In 2015, the high-value area rebounded and the area with an eco-eﬃciency below 0.4 gradually disappeared. The high-value area in Henan Province returned to the state of 2007. Dezhou City in the Shandong Province did not reach an eﬃcient level, but the urban eco-eﬃciency of Heze City reached the optimum level (Figure 4c). In 2018, the range of areas with low eco-eﬃciency decreased, areas with high eco-eﬃciency in Henan Province expanded, and Zibo City in the Shandong Province reached an eﬃcient level, while the eco-eﬃciency of Liaocheng City decreased (Figure 4d). to the study of the stage and spatial diﬀerentiation characteristics of urban eco-eﬃciency in the lower reaches of the Yellow River. Therefore, to analyze the spatial evolution of the urban eco-eﬃciency in the lower reaches of the Yellow River during the research period, we used the SDE model and MC in this study. On the basis of the urban eco-eﬃciency in the study area in 2007, 2011, 2015, and 2018 and through using ArcGIS10.2 software, we obtained the spatial pattern of the urban eco-eﬃciency in the lower reaches of the Yellow River (Figure 5a), the MC migration curve of the eco-eﬃciency (Figure 5b), and quasi-elliptical parameters and changes in the eco-eﬃciency MC (Table 2). of the Yellow River from 2007 to 2018 had a “southwest–northeast” direction, which is consistent with the overall trend in the study area and the position and trajectory of the Yellow River itself. The main axis of the SDE of urban eco-eﬃciency and the MC of eco-eﬃciency moved westward, which indicated that the cities located in the lower reaches of the Yellow River in Henan Province are characterized by better development of urban eco-eﬃciency and contribute more to the development of regional eco-eﬃciency. Based on the distribution pattern of the SDE (Figure 5a), the standard deviation of the long axis was always larger than that of the minor axis, indicating a notable development of the urban eco-eﬃciency in the lower reaches of the Yellow River. Further, on the basis of the results of the calculation of the SDE parameter (Table 2), the standard deviation along the x-axis increased from 88.66 to 89.22 km from 2007 to 2011 and the standard deviation along the y-axis decreased from 255.24 to 246.574 km, indicating that the development of the urban eco-eﬃciency was weakened and centrifugation had a notable eﬀect during this period. The standard deviations of the x- and y-axes increased in 2015 and 2018. From 2011 to 2017, the standard deviations increased by 1.39 and 5.94 km along the x- and y-axes, respectively, indicating that the development of urban eco-eﬃciency in the lower reaches of the Yellow River had strengthened since 2011, while the centrifugation eﬀect was weakened.",
    "Based on the change in the MC transfer curve of the urban eco-eﬃciency (Figure 5b), we found that the MC of urban eco-eﬃciency was in Shandong Province but notably shifted to the west. The results show that the sustainable development of cities in Shandong Province reﬂected the main development of urban eco-eﬃciency in the study region. However, the transformation and development of cities in the lower reaches of the Yellow River in Henan Province showed good trends, contributing to the spatial evolution of urban eco-eﬃciency in the study region. Factors inﬂuencing the urban eco-eﬃciency have been studied extensively. Based on the STIRPAT model, the eﬀect of human activities on the natural environment can be analyzed by considering three aspects: population, aﬄuence, and technological progress. The STIRPAT model was used in this study to analyze the eﬀects of the aﬄuence (A), population accumulation (P), industrial structure (IS), intensity of foreign investment (FDI), technology progress (T), and investment intensity (II) on urban eco-eﬃciency. Prior to the analysis in this study, we standardized the selected independent and dependent variables and applied a natural logarithm. The results of the analysis are shown in Table 3. Note (1) R2 = 0.520926, F-statistic = 42.22583, Probability (F-statistic) = 0.0000; R2, F-statistic and Probability (F-statistic) are all indexes to evaluate the simulation eﬀect of STIRPAT model, The R2 represents the coeﬃcient of determination of the regression model, and refers to the degree of ﬁtting of the model. The higher the value, the better the simulation eﬀect of the model. (2) The symbols ***, **, and * denote the signiﬁcance at 1%, 5%, and 10%, respectively; (3) VIF is an acronym for variance inﬂation factor. To solve the problem of inaccurate regression results caused by collinearity between data, we analyzed the collinearity between independent and dependent variables in this study. The test results VIF (variance inﬂation factor) were less than 7.5 empirical values [63], indicating that there was no multicollinearity problem among the variables. Based on the analysis results in Table 3, except for the urbanization level index (P), all indicators passed the signiﬁcance test. The per capita GDP (A), investment intensity (II), intensity of foreign investment (FDI), and technological progress (T) were signiﬁcant at the 1% signiﬁcance level and the proportion of industrial added value to the GDP (IS) passed the 10% signiﬁcance level test. The coeﬃcients of the aﬄuence and technological progress were 0.2202 and 0.5217, respectively, indicating that every 1% increase in the per capita GDP and 1% reduction in the energy consumption per unit GDP will lead to a 22.02% and 52.17% increase in urban eco-eﬃciency, respectively. The investment intensity, foreign investment intensity, and industrial structure coeﬃcient were −0.2005, −0.102, and −0.159, respectively, indicating that a 1% increase in the proportion of ﬁxed asset investment in the GDP, proportion of foreign capital actually utilized in the GDP, and proportion of industrial added value in the GDP will lead to a 20.05%, 10.2%, and 15.9% decrease in urban eco-eﬃciency, respectively. On the basis of the analysis in Table 3, it is clear that the per capita GDP and technological progress eﬀectively improved the urban eco-eﬃciency in the lower reaches of the Yellow River. Note that the positive eﬀect of technological progress was more signiﬁcant because technological progress is mainly reﬂected in the improvement of the energy use eﬃciency [11]. Energy is not only the basic guarantee of the life of urban residents and production but also an important source of environmental pollution. The implementation of the national strategy of eco-environmental protection and high-quality development in the Yellow River Basin will greatly improve urban energy use eﬃciency, change energy use structure, and reduce energy consumption per unit GDP, which can eﬀectively improve urban eco-eﬃciency and promote urban sustainable development. The investment intensity, foreign investment intensity, and index of the industrial structure negatively aﬀect urban eco-eﬃciency. The main reason for these negative eﬀects is that the industrial structure in the current process of urban industrialization in the lower reaches of the Yellow River is unreasonable and there are many industries with high-energy consumption, low eﬃciency, and high emissions, which lowers the urban eco-eﬃciency. The cities in the lower reaches of the Yellow River are still in the stage of high-speed urbanization and industrialization and the extensive investment-driven model is one of the reasons for the low urban eco-eﬃciency. Furthermore, the process of introducing foreign investments to promote urban economic development in the lower reaches of the Yellow River includes a type of industrial transfer characterized by “The Hypothesis of Pollution Haven”, i.e., the transfer of industries from developed areas to undeveloped areas is usually dominated by high energy-consuming and high-pollution industries. These factors cause the decrease in urban eco-eﬃciency in the lower reaches of the Yellow River.",
    "Unrestricted urban development causes serious resource and environmental problems; therefore, the promotion of urban sustainable development is an important goal [64]. According to the basic connotation of eco-eﬃciency, research on the evolution and diﬀerences of urban eco-eﬃciency in the lower reaches of the Yellow River is of great signiﬁcance in terms of analyzing the stages of urban development and determining future directions of urban development. First, the undesirable output in the process of urban economic production was improved in this study and the urban CO2 emissions were estimated based on the ratio of energy consumption per unit GDP to the second and third output value, yielding an urban eﬃciency that better reﬂects the urban economic production. Second, the Super-SBM model, which can be used to directly measure the undesirable output, was used. It combines the advantages of the SBM and Super-DEA models and eliminates the limitations of traditional index analysis. Each decision making unit was analyzed to determine the diﬀerences in the eco-eﬃciency among regional cities. Finally, the lower reaches of the Yellow River were selected as the study area. This area is characterized by a contradiction between urban economic development and ecological environment protection. By measuring the regional eco-eﬃciency and analyzing the eﬀects of socioeconomic factors on the eco-eﬃciency, we were able to investigate the reasons for the diﬀerences in urban eco-eﬃciency in this study. Subsequently, a scientiﬁc basis was provided for the formulation of policies to promote sustainable urbanization in areas characterized by a contradiction between urban economic development and ecological environment protection. The value of urban eco-eﬃciency in the lower reaches of the Yellow River did not reach 1, and thus the whole study area did not reach the stage of “eﬃciency”. Urban eco-eﬃciency in Shandong Province was generally found to be better than that in Henan Province, which is consistent with the results of previous research [65,66]. This shows that the urban development is still in the stage of high resource consumption and high environmental impact in areas with the most active urban economic development in the Yellow River Basin and is facing environmental pressure. The urban eco-eﬃciency is closely related to urban economic development, which can be conﬁrmed by the analysis of driving forces, moreover validating previous research [67,68]. The development of urban eco-eﬃciency in the lower reaches of the Yellow River can be divided into stages, which are mainly aﬀected by the government’s economic policies [69,70]. In the early period (from 2007 to 2011), the economic development model of the cities in the lower reaches of the Yellow River was a single traditional GDP-oriented development model and the input–output conversion rate was low. To alleviate economic risks caused by the global ﬁnancial crisis, the local government implemented a series of strategies to stimulate economic development. Although these measures successfully alleviated the risk of ﬁnancial crisis, environmental management during this period was relatively ineﬃcient, which caused serious damage to the ecological environment, serious environmental problems, and the decline of urban eco-eﬃciency. This also reﬂected the overall development of urban eco-eﬃciency in China during this period [71]. After 2012, the government strengthened the environmental protection and governance when facing overcapacity, ineﬃcient use of resources, and serious environmental problems. With the implementation of new urbanization and ecological civilization construction strategies, the urban development of the study area entered a new stage. There was a signiﬁcant spatial diﬀerence in the urban eco-eﬃciency in the study area. During the study period, the number of cities in Henan Province that reached an optimum urban eco-eﬃciency increased, while the number of cities with an urban eco-eﬃciency above 1 in Shandong Province decreased, indicating a trend of “blossom in the middle and reverse development at both ends” in the high-value area and a gradual decrease in the low-value area. Urban eco-eﬃciency in Henan Province is developing, leading to a westward shift of the MC of the urban eco-eﬃciency in the research region, which is consistent with the latest research results of Cui [72]. However, the eco-eﬃciency of many cities in the study area is still not optimal. Because the development of cities in the lower reaches of the Yellow River is seriously aﬀected by administrative regionalization and the distance from the core cities, a positive spillover eﬀect of cities with a higher urban eco-eﬃciency cannot be observed in the border area of Henan and Shandong.",
    "The STIRPAT model more accurately speciﬁes the sensitivity of environmental impacts to the forces that drive them. Therefore, the STIRPAT model was used in this study to analyze the eﬀects of population, aﬄuence, technological progress, industrial structure, investment intensity, and foreign capital utilization intensity on urban eco-eﬃciency. The results show that all inﬂuencing factors passed the signiﬁcance test, except for the population elements represented by the population urbanization index. Aﬄuence and technological progress positively aﬀect urban eco-eﬃciency, but the industrial structure and investment intensity hinders the improvement of the urban eco-eﬃciency, which is consistent with previous research results [33,68,73,74]. In contrast to relatively developed urban areas [75], the intensity of foreign investment hinders the optimization of urban eco-eﬃciency in the lower reaches of the Yellow River, mainly because the industrial transfer introduced by the cities in the lower reaches of the Yellow River is related to industries with high consumption and a low production capacity. However, this study has its limitations. Because of the small sample size, some mature spatial analysismodelscannotbeapplied,suchasexploratoryspatialdataanalysis(ESDA),GWR(geographical weighted regression), and some spatial econometric models. In the future, we are going to take the county-level cities in the lower reaches of the Yellow River as the research region to expand the sample size and explore the spatial spillover of urban eco-eﬃciency and the spatial heterogeneity of driving factors in the lower reaches of the Yellow River. area. From 2007 to 2018, the area of cultivated land in the study area remained stable, accounting for about 5.6% of the total area, with grain output increasing by nearly 20% and per capita grain being 0.62 kg, ensuring food security in the lower reaches of the Yellow River. Promoting high-quality urban development under the premise of ensuring food security will remain as the theme of urban developmentinthefuture. However, thelevelofurbandevelopmentlagscomparedwiththedeveloped areas in the east. Moreover, the mode of economic development that has not yet been fully transformed and the backward industrial structure have led to a prominent contradiction between urban economic development and ecological environment protection in this area, while the related research on the eco-eﬃciency of the Yellow River Basin is still very weak. This study enriches research on urban sustainable development in traditional agricultural areas. It is of great signiﬁcance to study the dynamic changes, diﬀerences, and factors inﬂuencing the urban eco-eﬃciency in traditional farming areas. Based on data obtained from 2007 to 2018, we extended the study of urban eco-eﬃciency in this work to traditional farming areas, calculating the urban eco-eﬃciency of the lower reaches of the Yellow River by using the Super-SBM model. By investigating the dynamic changes and spatial diﬀerences, we determined the eﬀects of relevant socioeconomic factors on urban eco-eﬃciency in this study. The results show that the overall eco-eﬃciency of the study area has not reached the optimal level. Although the overall urban eco-eﬃciency of Shandong Province is better than that of Henan Province, the urban eco-eﬃciency of Henan Province has been improving and the gap between the two provinces continues to decrease, leading to a continuous westward shift of the center of eco-eﬃciency in the study area. In addition, urban economic development and technological progress promote urban eco-eﬃciency, while high consumption, low-output industrial structures, extensive investment, and low environmental beneﬁts of the foreign investment model hinder the optimization of urban eco-eﬃciency in the study area. Based on the results of this study, we provide some policy suggestions for the cities in the lower reaches of the Yellow River: Author Contributions: Conceptualization, W.G., P.Z., and E.L.; data curation, J.S. and H.C.; formal analysis, E.L.; funding acquisition, E.L.; investigation, W.G., P.Z., T.R., and Y.L.; methodology, Y.Z.; resources, W.G.; supervision, E.L.; writing—original draft, Y.Z.; writing—review and editing, W.G. and P.Z. All authors have read and agreed to the published version of the manuscript. Funding: This research was funded by the National Natural Science Foundation of China, grant numbers 41601175, 41801362and 41971222; the 2018 Young Backbone Teachers Foundation from Henan Province, grant number 2018GGJS019; the Program for Innovative Research Talent in University of Henan Province, grant number 20HASTIT017; and Philosophy and Social Sciences Planning Project of Henan Province, grant number 2020BJJ020."
]