[
    "Agricultural development undertakes the important mission of ensuring food security and promoting the development of people's livelihood. Therefore, it is of great significance to evaluate the logistics capacity of agricultural products for the healthy development of agricultural product markets. In this paper, the consumption capacity, production capacity, transportation capacity and informatization degree of agricultural product logistics were selected as indicators to construct the evaluation model of regional agricultural product logistics capacity in Henan Province, and the development status of agricultural products was comprehensively analyzed by factor analysis. The results show that there is a large imbalance and regional differences in the logistics capacity of agricultural products in Henan Province. This paper puts forward a series of countermeasures and suggestions to promote the rapid development of the agricultural product logistics industry in Henan Province, and contribute to the comprehensive promotion of rural revitalization and the creation of a major agricultural province in the new era. The report of the 19th National Congress of the Communist Party of China pointed out that China's economy has shifted from a high-speed growth stage to high-quality development, and the logistics industry, as an important part of the national economy, is also an important force to promote the high- quality development of the national economy. Agriculture occupies an important position in China's national economy, and it is also pointed out in the rural revitalization strategy that it is necessary to continue to strengthen the advantages of agricultural product production capacity. As a major agricultural province in China, Henan Province's grain output in 2022 will be 65.4419 million tons, accounting for 9.6% of China's grain output. Because of its perishable and perishable characteristics, agricultural products are often short-timed, and are easily damaged due to various reasons in the process of transportation and loading and unloading, so the transportation of agricultural products has extremely high requirements for logistics capacity. At present, the transportation loss of agricultural products is large, and the corresponding infrastructure is weak, which hinders the further development of agricultural product logistics. The No. 1 document of the central government released in 2022 mentions that Shenren will promote the whole chain of \"production, transportation, storage, plus consumption\" to save grain and reduce losses, and reduce the loss of agricultural products in the transportation process. Therefore, it is necessary to use scientific methods to study the logistics capacity of agricultural products, find out the existing problems, and put forward corresponding suggestions for improvement, so as to promote the acceleration of the transportation efficiency of Content from this work may be used under the terms of CC BY-NC 4.0 licence (https://creativecommons.org/licenses/by-nc/4.0/). Published by Warwick Evans Publishing. agricultural products, the reduction of transportation costs and the further development of agricultural economy in various places. The evaluation and research of the logistics capacity of agricultural products in Henan Province is conducive to promoting the development of agricultural modernization in Henan Province. In the supply chain, logistics as a link between supply and demand, connecting suppliers in the upstream, production in the middle, and downstream and consumer docking, is directly affected by production capacity and consumption capacity, and its degree of informatization directly affects the efficiency and quality of the transportation process. Based on the research object of agricultural product logistics in Henan Province, this paper selects 13 development indicators of 18 provincial municipalities in Henan Province with reference to the existing relevant research results, and selects the four basic conditions of agricultural product consumption capacity, production capacity, transportation capacity and logistics informatization degree as the basis for in-depth discussion and analysis according to the main body relationship of logistics demand in the supply chain, and proposes an evaluation method for the development of agricultural product logistics in Henan Province based on factor analysis. And put forward the corresponding development strategy to provide reference for the development of agricultural product logistics in Henan Province and the whole country. Li Jiaxuan and Jiang Hua (2024) [1] used factor analysis to evaluate the logistics capacity of agricultural products in each city, calculated the individual scores and comprehensive scores of each city in four aspects: economic foundation level, agricultural product development conditions, logistics development level and informatization level, and ranked and evaluated 11 cities. Finally, corresponding suggestions are given for the further improvement of the logistics capacity of agricultural products in Hebei Province. Gao Mei (2024) [2] believes that the high-quality development of cold chain logistics of agricultural products will not only help farmers achieve higher economic benefits, but also be of great significance to accelerate the in-depth implementation of the rural revitalization strategy. Zhang Simin et al. (2024) [3] used the gravitational model, principal component analysis (PCA) and community discovery algorithm to calculate the comprehensive quality of regional agricultural product logistics and its logistics connection network, analyze the spatial correlation characteristics of agricultural product logistics network in Guangdong Province, and propose an optimization scheme. Yang Mingyu (2021) [4] believes that the economic and social development form with the Internet as the infrastructure and innovation element is taking shape, and the integrated development of the Internet and modern agricultural product logistics has derived a series of new models and new formats, and the Internet can achieve great development in modern agricultural product logistics in rural areas and play a prominent role in rural revitalization. Wang Fengyun (2022) [5] believes that an important way to enhance the market competitiveness of agricultural products includes not only the innovation of agricultural product logistics technology management, but also the sustainable development of agricultural product logistics technology management. Miao Xiaohong (2022) [6] found that it is a good choice to realize the integration and development of blockchain technology for the logistics system of fresh agricultural products with low level of informatization, too many logistics and distribution links, untraceable products, low controllability of the distribution process and inconsistent standards. Zhang Jianxi et al. (2022) [7] draw the following conclusions through research: the agricultural product logistics management system based on big data technology can manage the whole process of agricultural product logistics and transportation, and can be checked and controlled for each step of the logistics process, which can effectively further improve the logistics efficiency of agricultural products, and at the same time reduce the loss rate and deterioration rate that are prone to occur in the transportation process of agricultural products. Earnestly improve the efficiency of agricultural production. In the research of agricultural product logistics in Henan Province, Wang Shuai (2019) [8] studied the problems existing in the fresh product logistics market in Henan Province at this stage, and found that fresh logistics should be improved from the development of four aspects: equipment, main body, information construction and talents.",
    "Scholars have studied a lot on the direction of agricultural product logistics at home and abroad, but there are still few studies on the logistics development level of local cities, and with the transformation and upgrading of China's agriculture, it is of great strategic significance for the study of the sinking market. This study mainly uses factor analysis to rank the overall development level of agricultural product logistics in various cities in Henan Province through the integration of data analysis results, and is committed to studying the relative differences between regions, and puts forward targeted countermeasures to enrich the research content in this field. This paper is based on the cross-sectional data of 18 provincial municipalities in Henan Province in 2022, and the relevant data are taken from the official website of Henan Provincial Bureau of Statistics \"2022 Henan Provincial Statistical Yearbook\". By reading a large number of literatures, referring to the existing methods of selecting agricultural product logistics indicators, and starting from the actual development of agricultural product logistics in Henan Province, 13 indicators in 4 dimensions in Table 1 were selected to establish the evaluation index system of agricultural product logistics in Henan Province, and SPSS27.0 was used for empirical analysis. In order to eliminate the influence of different dimensions, all data are standardized in this paper. In this paper, the R-type model in the factor analysis method is used to analyze the logistics of agricultural products in Henan Province, and the hypothesis is established before the study: assuming that there are N in the sample data surveyed, p in the observed variable index, and m hidden common factors, the initial common factor variables can be expressed as Y1, Y2, ..., and YM. After normalization, it can be expressed as F=(F1, F2 , ..., FM), and if X is used to represent the new variable after transformation, it can be denoted as X=(X1, X2, ..., Xp)t, so the factor analysis model is derived: In this paper, spss27 is used to perform the KMO test and Bartlett test on the data, and the test results are shown in Table 3. When the KMO value is larger, it indicates that the correlation between variables is stronger, and it is generally considered that the data are suitable for factor analysis when the KMO value is greater than 0.6, and when the significance of the Bartlett sphericity test is less than 0.05, it indicates that there is a correlation between the variables. As can be seen from the table, the KMO value of the data in this paper is 0.672, which is greater than the critical value of 0.6, and the significance of the Bartlett sphericity test value is 0.001, which is less than 0.05, indicating that the correlation between the factors is strong, and the data can be analyzed by factor. The total variance explanation table was obtained by SPSS27 factor analysis, as shown in Table 4. From Table 4, it can be seen that the characteristic values of the first two common factors are 7.299 and 4.029, both of which are greater than 1, and the variance contribution rates after rotation are 49.622% and 37.519% respectively, generally from the analysis of research and practical experience, it is believed that when the cumulative variance contribution rate is 80% high, it can cover all the variable data characteristics, and the cumulative variance contribution rate of the two factors in Table 4 is 87.141%, which is greater than 80%, indicating that it is feasible to use them to evaluate the logistics capacity of agricultural products in Henan Province. In this paper, the maximum variance method is used to rotate the factor to make the factor closer to 0 or 1, so as to better judge the load of each index on the common factors F1 and F2. The results are shown in Table 5. After rotation, it can be seen that the total retail sales of consumer goods in X2, the per capita consumption expenditure of X3 residents X8 road freight volume, the number of X9 trucks, the number of employees in the logistics industry in X10, the total number of post and telecommunications services in X11, the total number of fixed broadband access users in X12, and the total number of mobile phone users in X13 have a high load on the common factor 1, which is mainly explained by the first component, reflecting the level of regional economic development and the level of logistics informatization. It is defined as a potential factor for the development of agricultural product logistics and named F1; X1 regional GDP, X4 main fresh agricultural product output, X5 main fresh agricultural product output value, X6 total crop sowing area, X7 total highway mileage, these five indicators have a higher load on the common factor 2, mainly explained by the second component, reflecting the regional agricultural product production capacity, is the basis for the development of agricultural product logistics, which is defined as the basic factor of agricultural product logistics, named F2.",
    "𝐹1 = 0.068 ∗ 𝑋1 + 0.163 ∗ 𝑋2 + 0.142 ∗ 𝑋3 − 0.019 ∗ 𝑋4 − 0.022 ∗ 𝑋5 − 0.015 ∗ 𝑋6 + 0.021 ∗ 𝑋7 + 0.083 ∗ 𝑋8 + 0.116 ∗ 𝑋9 + 0.152 ∗ 𝑋10 + 0.163 ∗ 𝑋11 + 0.142 ∗ 𝑋12 + 0.151 ∗ 𝑋13 The weight of the explanatory percentages of variance of the two common factors to the explanatory percentage of the total variance is used as a weight, and the comprehensive score of the logistics capacity of agricultural products is calculated: According to the above formula, the ranking of regional agricultural product logistics scores in Henan Province is calculated, as shown in Table 6: From the comprehensive score and ranking in the data in Table 6, it can be seen that Zhengzhou City, Nanyang City, Zhoukou City, Shangqiu City overall logistics development level is higher, of which Nanyang City, Zhoukou City, Shangqiu City with its considerable agricultural product output, agricultural product transportation and logistics information level in the forefront, these three cities as Henan Province agricultural city, agricultural resources are rich, good quality, the total output is as high as 10 billion catties, good transportation network for the development of agricultural product logistics to lay a solid foundation. Compared with Nanyang City, Zhoukou City and Shangqiu City, which are large cities with agricultural output, Hebi City, Sanmenxia City and Jiyuan Demonstration Zone have less output of agricultural products, and the development level of logistics transportation capacity and logistics informatization is not as good as that of Zhengzhou and other economically developed areas. Although Zhengzhou ranks first in the overall ranking, its agricultural product output ranks low, which can further connect well with the surrounding cities with rich agricultural product resources, and rely on Zhengzhou's developed cold chain logistics network to improve the circulation capacity of agricultural products between Zhengzhou and surrounding cities. From the perspective of F1, the development potential factor of agricultural product logistics, Zhengzhou City, Luoyang City, Nanyang City, and Shangqiu City ranked in the forefront, indicating that the economic development level of the region is closely related to the logistics capacity. In areas with developed economy and abundant funds, the consumption capacity of fresh agricultural products is strong, and the cold chain logistics infrastructure of agricultural products is relatively perfect, which is easy to form a relatively mature agricultural transportation system and a high level of modern agriculture. The lower-ranked Liansanmenxia City, Hebi City, and Jiyuan Demonstration Zone have been hampered by the relatively slow regional economic development, incomplete logistics infrastructure, and the outflow of professional talents. From the perspective of F2, the basic factor of agricultural product logistics development, Nanyang City, Zhoukou City, Zhumadian City and Shangqiu City rank relatively high relying on rich agricultural product resources. Zhengzhou City, Luoyang City, Xuchang City, Kaifeng City, as a relatively developed city, agriculture is not its leading industry, the output of agricultural products is limited, but the number of permanent residents is huge, agricultural products consumption capacity is strong, can rely on the developed agricultural products logistics network, mobilize the surrounding cities to enrich agricultural resources, promote further development. Cities such as Hebi City and Jiyuan Demonstration Zone are mainly small urban agglomerations, which lack basic agricultural crop layout and industry basic guarantee, so the output of agricultural products ranks low as a whole. According to the results of the above factor analysis, it is found that there is a large imbalance and regional differences in the logistics capacity of agricultural products in Henan Province, and the following suggestions are put forward in order to make the logistics of agricultural products in various regions develop rapidly. The short shelf life of agricultural products is a bottleneck that restricts their development, and improving their logistics efficiency has become an urgent problem for the industry. The traditional marketing model of agricultural products is based on production, distribution and retail, and the buyer has a long purchase cycle and low transportation efficiency. Therefore, it is necessary to establish a complex professional agricultural product logistics public information platform that can be connected with all parties to cover the entire logistics process from production to distribution, so that each participant can understand it in real time, so as to reduce circulation links and improve the efficiency of the entire logistics and transportation. Based on this, the government should vigorously promote the construction of logistics information platform, attract individual farmers and cold chain logistics- related enterprises to participate together, and unify information technology standards such as bar codes and the Internet of Things to ensure the standardization and compatibility of various technologies.",
    "Based on the results of the logistics development potential factor F1 mentioned above, it is concluded that although Zhengzhou City and Luoyang City have a high level of logistics transportation capacity and logistics informatization, they restrict the overall development of agricultural product logistics to a certain extent due to the basic factor F1 of logistics development, that is, the limited output capacity of agricultural products. The supply of agricultural products is mainly concentrated in Nanyang City, Zhoukou City, Shangqiu City and Zhumadian City. Therefore, it is very important to scientifically plan the regional development layout, strengthen inter-regional cooperation, and form a logistics system for raw and agricultural products with internal and external linkage. In order to solve the main contradiction of the unbalanced development of logistics capacity in Henan Province, we should build a cross-network with the current two strong cities of agricultural product logistics (Zhengzhou and Luoyang), and give full play to the radiation and driving role of strong cities in agricultural product logistics. As an important carrier in the circulation of agricultural products, infrastructure provides important basic conditions for the circulation of agricultural products. It can be seen from the logistics development potential factor F1 that Anyang City, Puyang City and Xinyang City have limited logistics development potential, but their agricultural product resources are relatively abundant. The government should help enterprises build refrigerated warehouses, improve the storage environment of agricultural products, and promote the systematic construction of cold chain logistics infrastructure for agricultural products, so as to ensure faster and better transportation of agricultural products. Further improve the construction of logistics infrastructure, integrate the logistics and transportation facilities and resources of agricultural products in various cities, establish a transportation data platform, achieve information sharing, improve service quality, and further promote the pace of agricultural products in Anyang City, Puyang City and Xinyang City to go out and improve the development level of agricultural product logistics. Combining agricultural products with e-commerce can broaden sales channels, diversify sales methods, and make it easier for consumers to browse and choose. Establish a sound online agricultural products trading platform, cooperate with large-scale e-commerce, vigorously promote special agricultural products in various places on the platform, form a brand effect, and introduce the form of live broadcast to enhance popularity and realize the value added of agricultural products. Vigorously promote the improvement of the transportation and distribution capacity of agricultural product e-commerce logistics, and actively introduce third-party logistics, so that agricultural products can be delivered to consumers quickly, fresh and complete. Local governments should also pay attention to standardizing the distribution standards and prices of agricultural product e- commerce logistics, avoid violent distribution and delayed delivery, provide customers with high- quality services, enhance consumer stickiness, and promote the sustainable development of the agricultural product e-commerce logistics industry."
]