[
    "Agriculture is an important part of Henan's economic development, and agricultural production is also an important source of greenhouse gas emissions. In this paper, the activity level data of agricultural carbon emissions in 18 cities in Henan Province were collected. Based on the calculation method provided by the Guidelines for Compiling Provincial Greenhouse Gas Inventories and referring to the 2006 IPCC Guidelines for National Greenhouse Gas Inventories, agricultural CO2, CH4 and N2O emissions were carefully estimated. An agricultural greenhouse gas inventory was compiled for Henan Province from 2011 to 2020. Then, based on the spatial distribution and emission intensity, the carbon emissions of each city in Henan Province in 2019 were further analyzed. The results show that carbon emissions decreased from 57,603,500 tons in 2011 to 44,517,300 tons in 2020, with an average annual decrease rate of about 2.66%. The total agricultural carbon emissions in Henan showed a downward trend, and agricultural land was the dominant factor of carbon emissions, accounting for about 47% of the total carbon emissions over the years. Economic development is accompanied by pollution and harm to the environment. Observations show that global warming has been occurring in the last 100 years, especially since 1970, with corresponding sea level rise, melting of snow and ice, unusual and extreme weather, and a high incidence of climatic events, which have had a great impact on society and the economy[1]. With the passage of time, more and more evidence confirms that greenhouse gases (GHGs) emitted by human activities are the main cause of global warming in the last 100 years (IPCC). Carbon dioxide is the most important of the greenhouse gases, so the term carbon is used to represent it, and therefore greenhouse gas emissions are also called carbon emissions. Any human activity can cause carbon emissions, such as the simple burning of fire and cooking by ordinary people.CO2, CH4 and N2O are the main greenhouse gases that cause global warming, and their contribution to the greenhouse effect is close to 80%. Agricultural activities are an important source of anthropogenic emissions of greenhouse gases, and the most important gases emitted by them are CH4 and N2O. The United Nations Environment Programme (UNEP) has pointed out that 40% of anthropogenic emissions of CH4 come from agricultural activities, and the greenhouse gas effect of CH4 is more than 26 times that of CO2 [2]. According to IPCC (2007), global agricultural N2O emissions account for about 69% Content from this work may be used under the terms of CC BY-NC 4.0 licence (https://creativecommons.org/licenses/by-nc/4.0/). Published by Warwick Evans Publishing. of total anthropogenic GHG emissions. China's agricultural N2O and CH4 emissions account for 82% and 47% of total human emissions, respectively. The Food and Agriculture Organization of the United Nations (FAO) points out that greenhouse gas emissions from cropland have exceeded 30% of global anthropogenic emissions. According to statistics, the livestock industry emits about 32.564 billion tons of greenhouse gases, accounting for about 51% of the total global greenhouse gas emissions[3]. Carbon emissions from agricultural sources have received extensive attention from domestic scholars, organizations, governments and the public, but there is still a lack of systematic methods and data support[4]. Domestic scholars mainly focus on accounting for agricultural carbon emissions in large regions, e.g., Fan Ziyue et al. accounted for China's agricultural greenhouse gas emissions. Li Yang et al. analyzed the spatial and temporal characteristics of carbon emissions from agricultural sources in the Yangtze River Economic Zone[5]. Chen Hui et al.'s study analyzed the spatial and temporal differences in agricultural GHG emissions in Jiangsu Province and simulated the trend evolution. The above studies have enriched China's system and framework in the study of GHG emissions from agricultural systems and provided references. However, the existing studies lack a more refined study of each province. In this paper, agricultural carbon emissions are accounted for at the provincial and municipal scales, revealing the differential characteristics of agricultural GHGs in Henan Province in 2019 in each municipality[6]. At present, there are no relevant research results on the inventory of carbon emissions from agricultural sources in Henan Province, and there is a lack of long time series and small regions to assess the calculation of carbon emissions. The innovation of this paper is that it establishes the carbon emission inventory of agricultural sources in Henan Province in the past ten years from 2011 to 2020, and then studies the carbon emission from agricultural sources in each city of Henan Province in 2019 in a more detailed way, and the results of the study have positive significance for the historical traceability of air pollution and environmental pollution management in Henan Province. The results of the study are of positive significance for the historical traceability of air pollution and environmental pollution management in Henan Province. It can also provide powerful data support and scientific reference for the air pollution management and air quality management decision- making in Henan Province. Therefore, it is of great significance to establish an inventory of carbon emissions from agricultural sources in Henan Province.",
    "The study area was Henan Province, with 18 municipalities including Jiyuan City. Henan is the first largest agricultural province in China, and also a large province of animal husbandry. The output of major agricultural products, such as grain, cotton and oil, is among the highest in the country, and it is an important production base for high-quality agricultural products, producing one-tenth of the country's grain with one-sixteenth of the country's arable land, and the total output has ranked first in the country for many years. This study analyzes the trend of agricultural carbon emissions in Henan Province in the past 10 years, and determines the accounting boundaries and objects with reference to the IPCC National Greenhouse Gas Inventory Guidelines and the current situation of agricultural carbon emissions in Henan Province. The accounting boundary is set as CH4 emissions from paddy fields, and methane emissions from enteric fermentation of animals, targeting the breeding of major livestock species (cattle, sheep, pigs, horses, donkeys, and mules) in Henan Province. The third is methane and nitrous oxide emissions from animal manure management, targeting mainly ruminants and poultry. Fourth, direct and indirect N2O emissions from inputs to crops on agricultural land throughout the process from sowing to harvesting. Direct emissions are mainly carbon emissions from agricultural inputs such as fertilizers (nitrogen, phosphorus, potash, and composite fertilizers); nitrogen from livestock and poultry manure and nitrogen from manure of the rural population applied to agricultural land; and nitrogen contained in straw and root stubble of major crops that are returned to the agricultural land to be used as fertilizers. Indirect emissions are mainly NH3 and NOx (atmospheric nitrogen deposition) emissions from livestock and rural population manure and nitrogen inputs to agricultural land; and a portion of nitrogen inputs to agricultural soils is emitted directly or indirectly into water bodies through leaching runoff (leaching runoff). The activity level data covered in the paper are from official government statistics, of which the sown area of paddy fields, the year-end stock of animals, the number of rural population, nitrogen fertilizers, compound fertilizers, and crop yields are taken from the Henan Provincial Statistical Yearbook; the proportion of large-scale rearing of animals is taken from the Twelfth Five-Year Plan for Livestock Husbandry of Henan Province; the rate of nitrogen content in compound fertilizers, the excretion factor of people, and the rate of straw returned to the fields are taken from literature; and the emission factors are taken from the 2006 IPCC Guidelines for National Greenhouse Gas Inventories. The emission factors were taken from the 2006 IPCC Guidelines for National Greenhouse Gas Inventories. In Henan Province, there is only single-season rice, so it is only necessary to multiply the sown area of single-season rice by the corresponding emission factor to calculate the methane emission from paddy fields. Where ECH4 is the total amount of methane emissions from paddy fields (tons); EFi is the methane emission factor for paddy fields by type (kg/ha); ADi is the sown area of rice corresponding to the emission factor (thousand hectares); and the subscript i denotes the type of paddy field. Animal enteric fermentation methane emission refers to the methane emission produced by microorganisms parasitized in the digestive tract of animals during normal metabolism when fermenting and digesting feedstuffs, and enteric fermentation methane emission only includes methane discharged from the animals' mouths, noses and rectums, and excludes methane emission from feces (Guideline). Ruminants are the main source of methane emissions from enteric fermentation, and according to the situation of animal husbandry in Henan Province and the availability of data, the sources of methane emissions from enteric fermentation include dairy cows, non-dairy cows, sheep, goats, pigs, horses, donkeys and mules. Where ECH4 is the total methane emissions from animal enteric fermentation, 10,000 tons of CH4/year; ECH4,enteric,i is the methane emissions from the i-th animal, 10,000 tons of CH4/year; EFCH4,enteric,i is the methane emission factor of the i-th animal, kg/head/year; and APi is the number of the i-th animal, head (only). Animal manure management methane and nitrous oxide emissions are methane and nitrous oxide emissions from the storage and handling of animal manure before it is applied to the soil. Based on livestock rearing in Henan Province and the availability of statistical data, sources of methane and nitrous oxide emissions from animal manure management include dairy cows, non-dairy cows, sheep, goats, swine, horses, donkeys, mules, and poultry.",
    "Where ECH4,manure,i is the methane emissions from manure management of the ith animal, 10,000 tons of CH4/year; EFCH4,manure,i is the methane emission factor from manure management of the ith animal, kg/head/year; and APi is the number of animals of the ith animal, head (only). where EN2O,manure,i is the nitrous oxide emissions from manure management of the ith animal, 10,000 tons N2O/year; EFN2O,manure,i is the population-specific nitrous oxide emission factor for manure management, kg/head/year; and APi is the number of animals of the ith species, number of heads. N2O emissions from agricultural land consist of both direct and indirect emissions. Direct emissions are from nitrogen inputs from the production process on agricultural land. Nitrogen inputs to agricultural land mainly include fertilizer nitrogen (nitrogen in nitrogen fertilizers and compound fertilizers) Nfertilizers, manure nitrogen Nmanure, and straw return nitrogen Nstraw. Indirect nitrous oxide emissions from agricultural land (N2O indirect) result from nitrous oxide emissions (N2O deposition) caused by volatilization of nitrogen oxides (NOx) and ammonia (NH3) from fertilized soils and livestock manure through atmospheric nitrogen deposition, as well as nitrous oxide emissions (N2O leaching) caused by soil nitrogen leaching or runoff losses into water bodies. Calculating the inter-annual trend of carbon emissions from agricultural sources in Henan Province from 2011 to 2020 and the contribution rate of each source, as shown in Table 1 and Figure 1, it can be seen that the total amount of carbon emissions has been on a downward trend in general, decreasing from 57.635 million tons in 2011 to 44.5173 million tons in 2020, with an average annual decline rate of about 2.66%. Among them, the carbon emissions between 2014 and 2020 are relatively stable, with an annual average of 45,399,100 tons; between 2013 and 2014 see a significant decline, with a decline rate of 16.59%. Agricultural land is the dominant factor of carbon emissions, accounting for about 47% of the total carbon emissions in the calendar year, declining from 23,203,800 tons in 2011 to 20,941,300 tons in 2020, of which fertilizers declined from 9,067,400 tons to 8,093,100 tons, with an average annual decline rate of 1.07%. Methane emissions from the gastrointestinal tract of ruminants decreased from 17,382,600 tons to 9,741,900 tons, which is related to the increase in the rate of large-scale livestock and poultry farming, and Henan Province expects the rate of large-scale livestock and poultry farming to reach more than 80% in 2025. Rice paddy methane emissions are the smallest, it can be seen that food cultivation has a small impact in all types of emission sources. 2014 is the turning year of a significant decline in carbon emissions from agricultural sources, down 9,415,300 tons compared with 2013, of which the animal intestinal methane emissions fell by 6,373,800 tons, the analysis of the reasons for this is that at the end of 2013, China issued the \"Regulations on Prevention and Control of Pollution from Large-Scale Farming of Livestock and Poultry,\" which regulate the scale standards of livestock and poultry farms and farming scale standards for small communities, thus leading to a significant decrease in gastrointestinal methane The carbon emission inventory of Henan Province in 2019 is shown in Table 2. The annual carbon emissions from agricultural sources were 44,317,700 tons, of which 20,805,000 tons were emitted from agricultural land, 10,121,100 tons were emitted from animal intestinal fermentation, 9,622,600 tons were managed by animal manure, and 3,064,900 tons were emitted from rice paddies, which accounted for 47.7%, 23.2%, 22.1%, and 7% of the total carbon emissions, respectively. Fertilizer application in agricultural land is the largest contributing source, with carbon emissions of 8,343,800 tons, accounting for 39.78% of the total carbon emissions from agricultural land. Due to the current stage of fertilization technology grassroots promotion system is not sound, the system, funding and other reasons lead to grass-roots technical service personnel's work enthusiasm is not strong, affecting the popularization of soil testing and formulation of fertilizer application technology, so the current soil testing and formulation of fertilizer application technology to promote the mechanism of innovation, focusing on resources, to the three food crops fertilizer application of carbon emission reduction potential in the region as the focus of the soil testing and formulation of fertilizer application technology promotion on the carbon emission reduction has an Important significance. Carbon emissions from paddy fields are the smallest compared to other emission sources, only 3.0649 million tons, accounting for 6.7%, concentrated in Xinyang City, with 2.3738 million tons.",
    "In terms of carbon emissions from cities, Xinxiang City and Nanyang City are higher than other cities, accounting for 12.4% and 12.38% of the province's total carbon emissions, respectively. Jiyuan City is constrained by land area and the scale of various industries is small, of which carbon emissions are the smallest in the province (198,400 tons), accounting for only 0.45%. Agricultural land is the main contributing source, accounting for the largest proportion of Zhoukou City and Nanyang City, respectively 2,687,800 tons and 2,466,200 tons. The largest carbon emission from animal enteric fermentation is in Xinxiang City, due to the fact that Xinxiang City is an important livestock and poultry production, processing and marketing area in Henan Province, and adequate forage and feed resources provide basic raw materials for the development of the livestock industry in Xinxiang City, coupled with a favorable geographic location, which gives the livestock industry an obvious advantage. Carbon emissions from animal manure management systems are mainly distributed in Nanyang City, Zhoukou City and Zhumadian City, with carbon emissions reaching 1,261,300 tons, 1,182,000 tons and 1,127,200 tons, respectively. Carbon emissions from rice cultivation in Xinyang City ranked first in the province, amounting to 2,373,800 tons, due to the fact that Xinyang City is the first major rice-growing city in Henan Province, with a year-round rice cultivation area of about 6 million mu, accounting for about 70% of the province's rice-crop area. Figure 2 shows the carbon emission intensity of cities in Henan Province in 2019. In terms of carbon emission intensity, Xinxiang City is the highest at 6.65t/km2, followed by Zhoukou City, Kaifeng City, Luohe City, Puyang City, Shangqiu City, Zhumadian City, Pingdingshan City, and Anyang City, with 4.06, 4.02, 3.82, 3.75, 3.7, 3.1, 2.98, and 2.95t/km2 respectively, which are higher than the average of the province (2.83t/km2). The carbon emission intensity of each city is composed of total carbon emission and land area. Although Nanyang City has a large carbon emission, its land area accounts for 16.32% of the province, and its carbon emission intensity as a whole is not large, only 2.06t/km2. Jiyuan City is the smallest city in the province in terms of land area, with only 193,100 hectares, and its carbon emission intensity is small (1.03t/km2). Agricultural land is the largest contributing source of carbon emissions in Henan Province, accounting for 25.89% to 70.90% of the total carbon emissions in each city. Figure 3 shows the carbon emission contribution rate of each emission source from agricultural land in 2019. Fertilizer nitrogen is the largest contributing source of agricultural land emissions, with carbon emissions amounting to 8,343,800 tons, accounting for 39.8% of the total carbon emissions from agricultural land. Fertilizer application is the main contributing source of agricultural land, accounting for 38.65% to 41.23% of the total agricultural land. The application of compound fertilizer is the largest among chemical fertilizers, followed by nitrogen fertilizers, but the carbon emission source of chemical fertilizers is mainly nitrogen, and the nitrogen content of compound fertilizers is 33%, so nitrogen fertilizers in chemical fertilizers are the largest contributing source. In terms of realizing the carbon emission reduction pathway of chemical fertilizer application, it is recommended to promote the application of nitrogen fertilizer reduction technologies and modes such as soil testing and formula application and new fertilizer application. Straw returned to the field contributes the least, accounting for 10.09% to 11.86%. In the case of paddy fields, straw is also one of the main raw materials for soil methane production. The effect of straw on methane emission showed a significant decreasing trend with the prolongation of the year of field return. About 3 years after returning the straw to the field, the soil fertility of the paddy field increased significantly, the rice plant and root system grew vigorously, which promoted oxygen transport, the oxygen content of the soil increased rapidly, and the oxidizing bacteria grew rapidly, oxidizing methane to carbon dioxide, and the methane emission decreased significantly. Animal enteric fermentation is the second largest contributor to carbon emissions from agricultural sources in Henan Province, with the total carbon emissions in each city accounting for 6.93% to 65.84% of the total emissions, and Figure 4 shows the carbon emissions of different animals in each city. As the province's equipment and requirements for large-scale farms continue to improve, there is a large space for carbon emission reduction from animal enteric fermentation, so this paper further analyzes the carbon emission contribution of different animals. Non-dairy cows are the main contributing source of animal enteric fermentation, accounting for 17.3%~64.15% of the total carbon emissions from animal enteric fermentation in each city. Dairy and non-dairy cows have larger feeding scale and higher carbon emission contribution. Compared to sheep, the number of both dairy and non-dairy cows is not as high as that of sheep, but since the emission factor of dairy and non-dairy cows is much higher than that of sheep, they have higher carbon emissions. Next is goats, which have the same emission factor as sheep, but their number is the largest, so they still have higher carbon emissions. In realizing the carbon emission reduction pathway of livestock and poultry farming, it is appropriate to promote the application of low protein diets and manure confined or covered storage, planting and manure deep application and other technologies, and at the same time, reasonably control the scale of breeding of large livestock, such as pigs, cows and goats, and implement the measures of land- based livestock in the appropriate breeding areas, which will play a greater role in the effective reduction of carbon emissions.",
    "Using ArcGIS to extract the geographic boundary information of Henan Province, the spatial distribution of carbon emissions in 2019 in 18 cities in Henan Province was mapped. As can be seen from Figure 5, the total carbon emissions of Xinxiang City and Nanyang City are larger, both exceeding 5 million tons, mainly because of the large land area of Nanyang City, the two cities are developed in agriculture, and the amount of livestock and poultry breeding and fertilizer application is relatively high The spatial distribution of carbon emissions from agricultural sources in Henan Province is mainly in the south, presenting a trend of high emissions in the south and low emissions in the north, with the high value area concentrated in the southwest, distributed in Nanyang City and Xinyang City. Low-value areas are distributed in the northwest, in Sanmenxia City and Luoyang City. This is due to the fact that northwestern Henan is mountainous and hilly, with high terrain, and the level of agricultural activity in the region is low, resulting in lower carbon emissions. This paper compares the inventory of carbon emissions from agricultural sources with other scholars in regions such as Inner Mongolia and Shandong for similar base years. As shown in Table 3, the most important contributing source of carbon emissions from agricultural sources in Henan Province and Shandong Province is agricultural land, followed by animal enteric fermentation and animal manure management system, and paddy field is the smallest contributing source; the most important source of carbon emissions from agricultural sources in Inner Mongolia is animal enteric fermentation, followed by agricultural land, and animal manure management system emissions are only second to the emissions from agricultural land, and paddy field emissions have the smallest contribution. The reason for this analysis is that Inner Mongolia has resource advantages and basic conditions for developing pastoralism, with many pastoral areas and relatively little agricultural land. Henan is close to Shandong Province, and both are large agricultural provinces, so the impact of each emission source is roughly the same. Carbon emission sources with large differences are mainly rice paddies and animal manure management systems, which are related to the chosen emission factors in addition to differences in activity level data. In general, the level of carbon emissions reflects the differences in the level of economic development, population size, geographic conditions, material needs, industrial structure and natural conditions between different regions. The uncertainty of the inventory mainly comes from the selection of emission factors and the lack of activity level data for some emission sources. In this study, the activity level data for paddy fields and animal manure management systems were obtained from the Henan Provincial Statistical Yearbook, and the emission factors were taken from the recommended values in the IPCC, which had the least uncertainty. The proportion of large-scale rearing of goats and sheep in animal enteric fermentation was not collected, and the average value of large-scale rearing of livestock and poultry from the Henan Provincial Statistical Yearbook of Animal Husbandry was taken for calculation, which is the main source of uncertainty in the carbon emission inventory of agricultural sources in this study. Fertilizer application in agricultural land was taken from the Henan Provincial Statistical Yearbook, annual excretion coefficient of rural population was taken from the literature[7], and straw return rate was taken from the literature[8], which is also a source of uncertainty in the inventory. (1) The total amount of carbon emissions from agricultural sources in Henan Province from 2011 to 2020 shows an overall decreasing trend, from 57.6035 million tons in 2011 to 44.5173 million tons in 2020, with an average annual decrease rate of about 2.66%. Agricultural land is the main contributing source of carbon emissions from agricultural sources in Henan Province, accounting for about 47% of the total carbon emissions in all years; carbon emissions from paddy fields are relatively stable, with total carbon emissions ranging from 3.03 to 3.09 million tons. (2) The emissions from agricultural land in 2019 were 8,343,800 tons, accounting for 39.8% of the total carbon emissions from agricultural land. Xinxiang City, Nanyang City and Xinyang City are higher than other cities, accounting for 12.4%, 12.38% and 11.18%, respectively. The average carbon emission intensity of agricultural sources in Henan Province is 2.83t/km2, the highest is Xinxiang City with 6.652.83t/km2. The lowest is Jiyuan City with 1.032.83t/km2.",
    "(3) From the spatial distribution characteristics, the carbon emissions from agricultural sources in Henan Province are mainly distributed in the southern region, showing a trend of high emissions in the south and low emissions in the north, with high values in Xinxiang City and Nanyang City and Xinyang City in the south. Emissions in the northwestern region are lower."
]