[
    "Taking Anyang City, Henan Province, China, as an example, this paper mainly discusses the ecological role of artificial wetlands in water-scarce cities, elaborates the important ecological functions of artificial wetlands in urban ecosystems, and demonstrates the practical experience of artificial wetland renovation and sponge city construction through specific cases, such as the wetland redevelopment project of Magnuson Park in the United States. Anyang City, Henan Province, China is located in the north of China's Central Plains, belonging to the warm-temperate continental monsoon climate, located in a semi-humid region, with four distinct seasons, plenty of sunshine, rain and heat at the same time. Winters are cold and dry, with high winds. Summer is hot and precipitation is concentrated. The average annual temperature is 14.1°C. January is the coldest month, with an average temperature of -0.9°C; July is the hottest month, with an average temperature of 27.0°C. The extreme minimum temperature of -21.7°C is the lowest. The extreme minimum temperature is -21.7℃ (12 January 1951) and the extreme maximum temperature is 43.2℃ (25 June 2009). The average annual air pressure is 1001.5 millibars, the average annual sunshine hours are about 2,225 hours, the frost-free period is about 210 days, the average annual precipitation is about 557 millimetres, and the maximum daily precipitation is 249.2 millimetres. Climatologically, Anyang City has a long winter of about 140 days, a long summer of about 110 days, and a transition period of more than 50 days in both spring and autumn, resulting in a long local winter and summer, and a shorter spring and autumn. Due to the monsoon and other factors, summer is dominated by southerly winds, with abundant rainfall and hot weather; autumn is sunny with plenty of sunshine; and winter and spring are characterised by prevailing northerly winds, drought and dusty weather. In general, Anyang City is a relatively water-scarce and arid region, in which case the role of small- scale artificial wetlands in the city is particularly important, such as the Cangxiang Street small-scale water system, the Red River Wetland Park and other small-scale wetland systems. Artificial wetland refers to the project that simulates the structure and function of natural wetland, and artificially allocates low-pollution water to a unique ecosystem consisting of fill materials (including soil) and aquatic plants, animals and microorganisms, so as to improve water quality through the synergistic effects of physics, chemistry and biology. It is also a near-natural system that Content from this work may be used under the terms of CC BY-NC 4.0 licence (https://creativecommons.org/licenses/by-nc/4.0/). Published by Warwick Evans Publishing. makes use of river banks, depressions and green areas, etc., and is transformed through enhanced measures such as optimising water harvesting and distribution, so as to achieve the improvement of water purification functions and ecological quality enhancement. Artificial wetlands are divided into surface flow artificial wetlands and submerged flow artificial wetlands according to the position of filler and water, and submerged flow artificial wetlands are divided into horizontal submerged flow artificial wetlands and vertical submerged flow artificial wetlands according to the direction of water flow. Surface flow artificial wetland refers to an artificial wetland where the water surface is above the soil surface and the water flows from the inlet end to the outlet end. Submerged flow artificial wetland refers to the artificial wetland where the water surface is below the surface of the fill material and the water flows horizontally or vertically from the inlet end to the outlet end. Horizontal submerged flow wetland refers to an artificial wetland where the water surface is below the filler surface and the water flows horizontally from the inlet end to the outlet end. Vertical submerged flow artificial wetland refers to the artificial wetland where the water flows vertically through the filler layer. According to the different direction of water flow, it can be divided into downward vertical flow artificial wetland and upward vertical flow artificial wetland. Artificial wetland is essentially an integrated ecosystem, an artificially constructed marsh-like environment, which, in the process of artificially controlled operation, can make use of the synergistic effects of soil, plants, artificial media and microbial physics to effectively treat sewage and sludge. The problems of environmental pollution, heat island effect and lack of water resources in the urban ecological environment can be well solved and the urban ecological environment can be improved effectively. Therefore, analysing the impact of urban ecological environment caused by artificial wetlands has important research value.",
    "Firstly, they can play the role of water quality purification. Water pollution has become a serious problem due to sewage and rainwater discharges during urbanisation. Artificial wetlands can remove pollutants such as organic matter, heavy metals and nutrient salts from water bodies through the absorption of plants and the action of soil microorganisms, and play the role of water purification. Secondly, artificial wetlands have a certain effect on improving urban climate. Cities often have a \"heat island effect\" due to large buildings, paving and vehicle emissions, leading to high urban temperatures. Artificial wetlands with high water storage capacity and lush vegetation can reduce the surrounding air temperature in summer through evaporation and heat dissipation. In addition, artificial wetlands provide habitat and the basis of the food chain. They are places where a wide variety of birds, insects, amphibians and other wildlife inhabit and reproduce. This is of positive significance for the protection and restoration of urban ecological diversity. It should also be noted that the construction of artificial wetlands requires rational planning and design to ensure that their ecological functions are maximised. For example, suitable wetland plants should be selected so that they can better adapt to the urban environment and water purification needs. In addition, water level and water quality need to be reasonably managed to ensure the stability and function of the wetland. In conclusion, artificial wetlands play important ecological functions in urban ecosystems, including water purification, improving urban climate and providing habitat. Therefore, strengthening the construction and management of artificial wetlands in urban planning is one of the effective means to promote sustainable development and improve the quality of life of residents. Firstly, they can play the role of water resource regulation. As a result of urbanisation, a large amount of ground surface is covered by construction and hardening, which leads to a large amount of rainwater flooding as rainwater cannot fully penetrate into the ground. Artificial wetlands can slow down the flow of rainwater into the drainage system and reduce the pressure of flood discharge through water storage and plant transpiration. Secondly, artificial wetlands can play the role of stagnation and regulation of runoff. They can absorb rainfall and delay discharge through natural deposition and plant absorption, effectively reducing the risk of flooding caused by heavy urban rainfall. In addition, artificial wetlands can also provide ecological water supply. When freshwater resources, which are used for a large number of domestic and productive activities in cities, are in short supply, artificial wetlands can be used as a recharge source to provide a non-traditional desalination supply that can be used sustainably. It should also be noted that the construction of artificial wetlands requires attention to scientific planning and design in order to give full play to their role in water resource management. For example, the characteristics of rainfall runoff and water quality should be taken into account when choosing the location, as well as the synergistic design with the urban drainage system. In summary, artificial wetlands play an important role in urban water resources management, including regulating water resources, mitigating flood risks and providing ecological recharge. Therefore, strengthening the construction and management of artificial wetlands in urban planning and management is one of the important measures to achieve sustainable water resource utilisation. Carbon sink is a process, activity or mechanism that reduces the concentration of greenhouse gases in the atmosphere by absorbing carbon dioxide from the atmosphere through measures such as afforestation and vegetation restoration. Artificial wetlands have high biodiversity and vegetation cover, which means they are able to absorb large amounts of carbon dioxide (CO2) and fix it in the vegetation and soil. Plants absorb CO2 through photosynthesis and convert it into organic matter and store some of the carbon in their roots and soil. In addition, aquatic vegetation absorbs dissolved organic carbon in water and converts it to solid organic matter through degradation. These processes make artificial wetlands important carbon sinks. Artificial wetlands are rich in water resources and can regulate rainfall processes, reduce flooding and maintain the balance of the regional hydrological cycle. Due to the high heat capacity of water bodies, artificial wetlands can act as thermoregulators, absorbing heat and slowing down the rise of surrounding temperatures in summer and releasing heat and slowing down the fall of surrounding temperatures in winter. In addition, artificial wetlands can increase air humidity through evaporation, improving the climate conditions in dry areas.",
    "I. Ecotourism and education: As a unique ecological landscape, an artificial wetland can attract tourists and visitors and increase tourism income for the community. At the same time, the artificial wetland provides a place conducive to eco-environmental learning for educational institutions, fosters public awareness of nature conservation, and promotes environmental education. Recreation and leisure activities: The artificial wetland can provide a rich and diverse venue for recreation and leisure activities for community residents. For example, residents can engage in outdoor activities such as picnics, fishing, bird watching, etc. to increase communication and interaction among community residents. Natural beauty and health promotion: Artificial wetlands are considered a natural beauty that creates green space in the urban environment. Such an environment reduces urban stress and promotes physical and mental health through close contact with the natural environment. II. Community purification and improvement: By purifying water bodies, reducing pollutant discharges and providing flood control, artificial wetlands improve the environmental quality of communities. At the same time, the vegetation of the wetland can absorb pollutants and harmful substances in the air and improve air quality. III.Enhancing community identity: Artificial wetlands not only provide natural landscapes and ecological functions, but also pass on and promote specific cultural values. For example, some artificial wetlands incorporate local cultural elements and traditional architectural styles, and enhance the community residents' sense of identity with the local culture by displaying local cultural artefacts and organising folklore activities. In summary, artificial wetlands play an important role in enhancing community well-being and cultural values. They provide residents with recreational areas, increase natural beauty, improve environmental quality, and promote the physical and mental health and identity of community residents through education and passing on local culture. Therefore, the protection and construction of artificial wetlands should be emphasised in the process of urban planning and development. One of the more obvious examples is the Magnuson Park Wetlands Redevelopment Project in the United States of America, which, prior to European settlement in Seattle, was covered with wetlands, alder and fir forests, and was a rich type of wildlife habitat. European development of the area resulted in the drying up of the original creeks, and the construction of the U.S. Naval Base completely changed the landscape. In the 1970s, through the efforts of Senator Magnuson, the Naval Base was preserved as parkland, but faced a series of challenges including flat terrain, compacted soil, and poor drainage. The Seattle Department of Parks and Recreation developed an effective phased renovation plan that sought to restore the park's ecology with wetland reclamation and reconstruction. Design strategies included reconstructing the site topography to simulate a sequence of dry, marsh, shallow, and deep water wetland habitats and adding wetland habitat edges through dikes, bays, continents, and islands to create areas with rich topography and geomorphology; and utilising stormwater runoff as a source of water for the wetland by introducing stormwater runoff from the sports fields and car parks and roadways into the wetland through the laying of permeable synthetic grasses and a rational slope design. The park also employs vegetation management tools to remove invasive and diseased vegetation and introduce native plants to recreate urban wetland habitats through vegetation management. The restored and re-established wetland communities within Magnuson Park have maintained a west- to-east flow pattern, sustained high water cover, and significantly improved water quality. Approximately 80 per cent of the newly planted native plants survived; insect, waterfowl, bird and amphibian species and populations increased. Henry Palmisano Educational Park in the United States is another example of transformation. In the first half of the 20th century, Henry Palmisano Park was located on the site of a privately owned limestone quarry that was 380 miles deep. The mine was later sold off and gradually converted into a landfill to which the City of Chicago's construction debris was brought to landfill. In partnership with three City of Chicago companies, the 27-acre site was transformed into an active educational park. The Xixian New District in Shaanxi Province, China, is a case of urban renewal similar to that of Anyang. Located between the built-up areas of Xi'an City and Xianyang City in Shaanxi Province, the Xixian New District covers a total area of 882 square kilometres, of which 272 square kilometres are built-up land and more than 610 square kilometres are non-built-up area. Xixian New District is the only city in China's first batch of sponge city pilots located in Northwest China, which has a temperate continental monsoon type semi-arid and semi-humid climate, similar to that of Anyang.",
    "In 2013, a 22.5 square kilometre area in Fengxi New City of Xixian New Area was opened for several \"low-impact development rainwater comprehensive use projects\". By 2016, Fenghi New City has initially constructed a \"four-level rainwater collection and utilisation system\" including building blocks, municipal roads, landscape green areas and central green corridors: rainfall falling on building blocks, roads and landscape green areas, in addition to evaporation of part of the runoff, most of the runoff through the grass ditch and rainwater sewers into the area of the low point first! The \"rainwater corridor\" in the central green corridor will be purified by the rainwater corridor and then flow into the artificial wetland as the central core of the green corridor; rainfall in the central green corridor will either directly infiltrate through the infiltration ditch or enter the artificial wetland. The rainwater runoff collected in the central green corridor is partially evaporated to join the regional water cycle, and the excess rainwater overflows to the infiltration wetlands on the east and west sides with the help of topographic trends to recharge the groundwater; in case of extreme rainstorms, it is discharged into the Feng River and the Wei River through the pumping station to reduce the risk of flooding in the city. The use of multiple channels to obtain water resources is an important way to obtain water sources for artificial water body landscapes in drier cities. Water resources are the source and basic for the creation of water body landscapes. At present, many cities usually include tap water, surface runoff, groundwater, rainwater and urban sewage reclaimed water as supplementary water sources when creating artificial water body landscapes. Although the tap water quality is the best, but the high cost and waste of quality water resources, only appropriate as a water source for smaller bodies of water; river water and other surface runoff and groundwater water quality is better, but the need to set up lifting, water transmission system; rainwater mostly as a supplementary water source, but also need to consider the pollution of the initial rainfall, and the city of Anyang City by the impact of climate and rainfall, the amount of water is insufficient; urban sewage water recycled water need to strictly guarantee the quality of water also need to set up a scientific water transmission system. The city sewage recycled water needs to strictly guarantee the water quality and also needs to set up the water transmission system scientifically. In cities where water resources are scarce, river water can be used as a source of recharge; in addition, the use of rainwater recycling technology as an important guarantee of sprinkler irrigation water in public and residential green areas. Secondly, inheriting Chinese traditional culture, the design emphasises the generalisation, refinement and reproduction of natural landscape features, artistic and realistic expression of water features, highlighting the mood of \"though opened by man, just like heaven\". Focus on the various water features of the form of portrayal, according to the source of the flow, static and static, poly points, contrast, set off, sound, light and shadow, and a series of techniques, the formation of running water, static water, water and fountains in the form of four kinds of water landscapes. Playing a coordinating role with rocks, aquatic plants and bridges, etc., to create a water landscape rich in cultural meaning, to win the psychological recognition and love of residents. Finally, the ecological role of water should be given full play. Based on the regional characteristics of dry climate, water is used to regulate regional and local microclimates and environmental temperatures. Water can not only reduce the air temperature near the water surface, increase the humidity of the air, but also adsorb dust in the air, wet air, purify the air, reduce noise. In the overall effect of the artificial water landscape should not only consider the overall layout of the landscape, but also give full consideration to the artistry, ecology and culture of the artificial water landscape. Scientific support, rational planning and construction of leisure and recreational facilities, highlighting the artificial water body landscape on the environment unfavourable climate change, enhance humidity, lower the temperature, enhance the quality of life of residents."
]