[
    "As an extension of ecological concepts, urban green development has gradually become a new bridge for various countries or regions to achieve sustainable development. Based on the panel data of 17 cities in Henan Province, China from 2007 to 2022, this article uses the entropy method to measure the green development level of cities in Henan Province, and uses the Dagum Gini coefficient method to analyze the green development differences between cities. The results show that: first, urban green development in Henan Province is generally at a lower-middle level and tends to be balanced. Second, there are obvious regional gaps in urban green development in Henan Province. Third, inter-regional disparity is the main reason for the differential distribution of urban green development levels in Henan Province. In order to promote the improvement of urban green level and narrow the spatial development gap in Henan Province, this study puts forward corresponding policy suggestions from the aspects of green investment, green technology innovation, industrial structure upgrading and green life. This also provides reference for other less developed regions in China to achieve balanced urban green development. Urban green development has gained international attention due to the acceleration of global urbanization (He, B. J., Zhao, D. X., & Gou, Z., 2020). Henan Province, one of China's most significant centers of agricultural production, is also one of the most populous regions, both urban and rural. Its urban green development is connected to other impoverished areas of China as well as to the region's future sustainable development. Urban green transformation offers a certain level of expertise. In order to support the creation of a new development pattern, the Chinese government's \"14th Five-Year Plan\" development plan states that it is imperative to expedite the regional ecological development process and simultaneously increase the effectiveness of green development (Liu, Q., 2022). \"Promoting green development and harmonious coexistence of man and nature\" is the green development philosophy that the Chinese government put forth in October 2021. Building a sustainable society where people and the environment coexist peacefully from the standpoints of the economy, resources, and health is the goal of green development. Content from this work may be used under the terms of CC BY-NC 4.0 licence (https://creativecommons.org/licenses/by-nc/4.0/). Published by Warwick Evans Publishing. Scholars have published an increasing number of research findings on green development in recent years as nations all over the world have given the topic more and more attention. comprising the measurement of regional variations, the building of a green development indicator system (Zhou, G., Zhu, J., & Luo, S., 2022), and the assessment of green development levels (Ma, D., & Zhu, Q., 2022). Liu, S., & Hou, M. (2022) measured. Using panel data from 17 cities in Henan Province between 2007 and 2022, this article will create an indicator system for the degree of urban green development and measure it using the entropy approach. The geographical variations in green development across different cities will be measured and analyzed using the Dagum Gini coefficient. In addition to helping Henan Province's cities develop sustainably, this study can serve as a resource for researchers studying urban sustainable development in China's other less developed areas. There are still several limitations to this study, primarily because the data sources and indicator selection were inadequate. This is how the remainder of the article is structured: The research design, including the data sources, indicator system setup, and research methodologies, are introduced in Section 2. The research findings and analysis are presented in Section 3. The research findings and suggested policies are presented in Section 4. The entropy weight approach exploits the discreteness of the data to obtain a more objective weight that is independent of the positive and negative indications. It does this by objectively determining the weight based on the information provided by each assessment index. The degree of urban green development in Henan Province is assessed and examined using this methodology for the years 2007– 2022. (1) Symbol explanation. Suppose there are c regions, m years and n indicators. And a=1,2,3,…,c. i=1,2,3,…,m. j=1,2,3,…,n. Therefore, xaij represents the original value of the j-th indicator in the i- th year in the a-th region. In this study, c=17, m=16, n=12. (2) Standardized processing. In order to eliminate the impact of dimensional problems on data analysis, all indicators need to be standardized. Proceed as follows: Among the several techniques for calculating spatial gaps, the Dagum Gini coefficient considers factors like sample overlap and subsample distribution, in contrast to the conventional Gini coefficient and Theil index. The coefficient is more precise, therefore the results are more accurate. The spatial difference is more noticeable the larger the size. The precise equation is as follows: The j and h stand for several separated areas among them. The i and r stand for a specific city in a specific area. The total number of cities is denoted by n. The total number of separated areas is denoted by k. The number of cities in region j(h) is denoted by nj(h). U is the average green development level across all cities, and uji(uhr) is the green development level of city i or h in region j(h). We must first arrange the cities based on each region's green development level scores in order to make calculations easier. The following is the formula: The spatial disparity can be broken down into three categories using the Dagum Gini coefficient: intra-regional, inter-regional, and hypervariable density. Gw is the comparable contribution to the intra-regional Gini coefficient, Gjj. The net gap contribution is represented by Gnb, and the Gini coefficient between areas is Gjh. The formula“G=Gw+Gnb+Gt” is satisfied by the hypervariable density contribution, which is Gt.",
    "Among them, pj(h)=nj(h)/n represents the proportion of the number of cities in the j(h) region to the total number of cities, s )( hj Un hj )( hj )( Un represents the proportion of urban green development level in region j(h) to the urban green development level in all study areas. Djh represents the relative impact of urban green development levels between region j and region h. djh represents the difference in urban green development levels between regions, and is the mathematical expectation of the summary value of all samples with uji-uhr>0 in region j and region h. pjh is the supervariant first- order moment, which is all the mathematical expectation of the sample summary value for uhr-uji>0. Fj and Fh represent the cumulative distribution function of the urban green development level in region j and region h respectively. Table 1 shows the urban green development evaluation index system. Urban green development should be comprehensive, so it mainly includes three dimensions: green production, ecological management and green life, with a total of 12 indicators. With a population of over 98 million, Henan Province is a core region of China that has an area of around 167,000 square kilometres. It is a province with a sizable rural populace and a significant agricultural production base. As a result, researching the urban development of Henan Province is crucial and will serve as a model for the sustainable growth of cities in the majority of China's impoverished regions. Henan Province has jurisdiction over 17 cities, namely Zhengzhou, Luoyang, Xuchang, Kaifeng, Nanyang, Xinxiang, Jiaozuo, Anyang, Puyang, Xinyang, Luohe, Pingdingshan, Zhoukou, Shangqiu, Zhumadian, Sanmenxia and Hebi. The data in this article come from the \"Henan Province Statistical Yearbook\", the \"Government Work Report\" of each city and the \"National Economic and Social Development Statistical Bulletin\". The entropy method is used to calculate the urban green development level and average ranking of Henan Province from 2007 to 2022. As shown in Table 2. In general, there will be fluctuations in the level of urban green development in Henan Province between 2007 and 2022. Furthermore, it is evident from the \"mean value\" that 17 cities in Henan Province have a concentrated degree of green development in [0.45, 0.59]. This demonstrates that Henan Province's cities' general green development is at a middle-to-lower level. \"Mean Value 2\" shows that, between 2007 and 2022, Henan Province's degree of urban green development went from 0.5528 to 0.6197, with an average yearly growth rate of 0.446%. This growth rate was incredibly slow. The variance, on the other hand, reveals that the variance of the levels of urban green Based on the analysis results of the entropy method, it can be seen that there are spatial differences in the green development levels of cities in Henan Province. In order to further explain its spatial non- equilibrium using the Dagum Gini coefficient method, Henan Province will be analyzed by regional decomposition. In 2007, the Henan Provincial Government divided the province into the central region, northern region, west and southwestern region and Huanghuai region based on regional development status. The Central Plains region includes Zhengzhou City, Luoyang City, Kaifeng City, Xuchang City, Xinxiang City, Jiaozuo City, Pingdingshan City, and Luohe City. The northern region includes Anyang City, Puyang City and Hebi City. The west and southwestern regions include Nanyang City and Sanmenxia City. The Huanghuai region includes Shangqiu City, Xinyang City, Zhumadian City and Zhoukou City. This study will follow this division method. Table 2 shows the Dagum Gini coefficient of urban green development in Henan Province from 2007 to 2022. Among them, C represents the Central Plains region, N represents the northern Henan region, W represents the west and southwestern regions, and H represents the Huanghuai region. The calculation results are shown in Table 3. First, the overall Dagum Gini coefficient.Table 3 shows that the Dagum Gini coefficient of the levels of urban green development in Henan Province from 2007 to 2022 usually showed a progressive lower trend, suggesting that the overall disparity in urban green development in Henan Province is gradually narrowing. Second, the Dagum Gini coefficient within the region.Table 3 makes clear that each of the four regions' intra-regional disparities is at a different level and exhibits a distinct evolution tendency. At 0.0683, the N region has the highest Gini coefficient. C region 0.0509, W region 0.0331, and H region 0.0315 come next. This indicates that there is a big disparity in urban green development levels between region N, a medium level of disparity between region W and H, and a tiny gap within region C.Given the evolution trends perspective, the most noticeable variations in urban green development may be seen in region N, as indicated by the highest variance of its Dagum Gini coefficient. The variation of the Dagum Gini coefficient in the other three locations varies essentially indistinguishably, suggesting that there is minimal variation un urban green development in these regions between 2007 and 2022.",
    "Third, the Dagum Gini coefficient between regions. As can be seen from Table 3, the Dagum Gini coefficient of urban green development in W and H regions is the smallest, and the variance is the smallest, indicating that the difference in urban green development between these two regions is minimal and with the stable evolution. The Dagum Gini coefficient of urban green development in N and W regions is the largest and the variance is also the largest. This shows that the two regions have the greatest difference in urban green development, and with the unstable evolution trend. Fourth, the source and contribution of the spatial gap in urban green development in Henan Province. Table 3 makes clear that inter-regional gaps are the primary cause of the uneven distribution of urban green development levels in Henan Province. The contribution rate of inter-regional gaps is significantly higher than the contribution rate of intra-regional gaps and hyper-variable density. There is a general increase tendency in the inter-regional disparity contribution rate. The intra-regional gap's contribution rate varies somewhat smoothly. There is a general lower trend in the contribution rate of hypervariable density (the interaction between the first two), suggesting a weakening of the phenomena of cross-over overlap between regions. Through the entropy method calculation, it is known that urban green development in Henan Province has improved to a certain extent from 2007 to 2022, but the overall level is still at the middle to lower level. The Dagum Gini coefficient method is used to measure the spatial differences in urban green development in Henan Province. The results show: First, from 2007 to 2022, the overall gap in urban green development in Henan Province is narrowing. Second, from the perspective of each region, the green development gap within the northern region is the most obvious, while the urban green development gap in other regions is relatively stable. Third, from the perspective of inter-regional urban green development gaps, only the west and southwestern regions and the Huanghuai region have smaller urban green development gaps and smaller fluctuations. However, the urban green development gap between other interactive areas is obvious and fluctuates greatly. The inter-regional gap is the main reason for the differential distribution of urban green development levels in Henan Province. The government can increase financial support for environmental protection projects and encourage social capital to participate in green industry investment to promote urban green infrastructure construction (Pauleit, S., Vasquéz, A., Maruthaveeran, S., Liu, L., & Cilliers, S. S., 2021). Green industry funds can be established by the government and attract social capital to participate. This fund is used to support projects in line with green development directions and provide diversified financial support such as loans and equity investments (Irfan, M., Razzaq, A., Sharif, A., & Yang, X., 2022). Local governments formulate preferential tax policies and grant a certain percentage of tax reductions or tax preferences to enterprises engaged in green industries to increase the return on investment and attract more funds to flow into the green field (Song, M., Wang, S., & Zhang, H., 2020). And the government can issue green bonds to raise funds to support urban green infrastructure construction (Cousins, J. J., & Hill, D. T., 2021). According to Hepburn, C., Qi, Y., Stern, N., Ward, B., Xie, C., & Zenghelis, D. (2021) the government must direct businesses to invest more in green technology research and development, encourage the transformation of scientific and technological advancements, and encourage the application of green technology in urban energy, transportation, and other fields.First, by issuing rewards and subsidies for technological innovation, companies are encouraged to invest more resources in green technology innovation and improve innovation vitality (Shao, Y., & Chen, Z., 2022). Second, allocate special funds to establish a green technology innovation platform, provide opportunities for resource sharing, information exchange and cooperative projects, and accelerate the research and development and promotion of green technology (Gebhardt, M., Kopyto, M., Birkel, H., & Hartmann, E., 2022). Third, the government can encourage companies to establish close cooperation mechanisms with universities and research institutions to promote the transformation of scientific research results (Lerman, L. V., Gerstlberger, W., Lima, M. F., & Frank, A. G., 2021). The upgrading of industrial structure requires policy guidance to promote the upgrading of Central China's industries in a green and low-carbon direction and promote the development of clean production and circular economy (Xing, X., & Ye, A., 2022). First, the government can provide financial support and provide direct financial support for green industries by establishing a special fund for green industry development (Wang, X., & Wang, Q., 2021). Second, to encourage enterprises to adopt cleaner production technologies (Dong, Z., Tan, Y., Wang, L., Zheng, J., & Hu, S., 2021), promote the green upgrading of the industrial chain, and guide enterprises to implement The circular economy model reduces dependence on natural resources and improves resource utilization efficiency through resource recycling and waste reuse. Third, establish green industry standards and certification systems to encourage companies to follow environmental protection and social responsibility standards, which will help improve the competitiveness of corporate green industries and provide consumers with more environmentally friendly product choices (Jiang, X., Li , G., & Fan, X., 2023).",
    "The government and enterprises contribute to urban green development through green investment, green technology innovation and industrial structure upgrading. In daily life, ordinary residents must also have the awareness of green environmental protection, whether urban residents or rural residents. The government should strengthen publicity and education on environmental protection and green living, and promote green living among residents through certain reward and punishment measures. This includes waste sorting, water and electricity conservation, green travel, etc. (Makomere, J., 2024)."
]