[
    "Based on the WorldPop center population data set and the dynamic monitoring data of China 's floating population, this paper analyzes the spatial and temporal changes of regional population and the characteristics of flow network and its influencing factors with the help of ArcGIS spatial analysis and mapping function and geographic detector model. It shows that: The regional difference of population spatial distribution in Henan Province is obvious and extremely uneven, and the population agglomeration speed of Zhengzhou metropolitan zone is obviously accelerated. The regional differentiation of population change in Henan Province is serious, and the population attraction of Zhengzhou is increasing, The population of Undertake industrial transfer zone such as Shangqiu and Zhoukou continued contraction. The population growth area and the population contraction area are more concentrated in space, showing the characteristics of spatial agglomeration. In addition, economic factors are still the main driving factors of population change in Henan Province. The influence of service industry on population change is increasing, and the explanatory power of traditional agriculture, forestry, animal husbandry and fishery and manufacturing industry on population change is decreasing. The integrated development of secondary and tertiary industries will further affect the future population distribution pattern of each region. The evolution characteristics of population distribution pattern and its driving factors are the hot issues of global sustainable development, and it is also an important part of regional development planning[1]. The statistical results show that the total population of China has reached its peak around 2020, and at the same time, it has ushered in the ' Lewis turning point ', which indicates that the population structure of China is changing, the population competition between regions will be more intense, and the population flow will be more frequent, forming a new spatial redistribution pattern of population. The report of the 20 th National Congress of the Communist Party of China in 2022 proposed to \" build a coordinated development pattern of large, medium and small cities based on urban agglomerations and metropolitan areas. \" Provinces across the country have also proposed a \" strong provincial capital \" strategy[2]. Through the high concentration of policies, talents and capital, we will create a regional growth pole, which will radiate the surrounding areas and drive the development of the province[3]. The implementation of these measures has further promoted the formation of a new pattern of regional population spatial distribution. Content from this work may be used under the terms of CC BY-NC 4.0 licence (https://creativecommons.org/licenses/by-nc/4.0/). Published by Warwick Evans Publishing. At present, the research on population distribution has been relatively perfect. The academic research on the population distribution pattern mainly has the following aspects : (1) The research methods are constantly enriched. It mainly uses the population center of gravity, population density, population agglomeration degree, Gini coefficient of population spatial distribution, imbalance index and other indicators for research. For example, Liu Ruiwen[4-6] classified each region based on population agglomeration degree, and studied the population concentration and distribution situation and internal law of each region. Ge Meiling[7-9] described the population density hierarchically and established the population center of gravity curve, so as to realize the reclassification of population density and reveal the law of spatial distribution of China 's population. (2) Research scale refinement. Previous studies mainly focused on the spatial scale of county and above. With the continuous refinement of population data, the distribution of population at the township ( street ) level has gradually become a hot topic in human geography research. Ru Bai Zhongqiang[10] revealed the spatial distribution characteristics of population in 25 provinces and regions of China based on the township scale. (3) Diversified research perspectives. Feng Zhiming[12] proposed the concept of population distribution suitability, and based on this, quantitatively evaluated the coordination between population distribution and resource environment and socio-economic development. Liang[13] simulated and predicted the population pattern of Beijing based on CA-MAS, in order to provide reference for urban management and regulation. In the evaluation of population change and its influencing factors, Cao Zhi[14] selected three types of village environmental factors : topographic features, resource endowments, and location conditions, and two types of regional environmental factors : market demand, and economic base. The geographical detector method was used to quantitatively analyze the spatial distribution pattern of professional villages and towns in China ; Gu[15] selected the influencing factors such as the average annual wage of employees, the average growth rate of GDP, the concentration of PM2.5, the average temperature difference and the disposable income of residents, and studied the evolution characteristics of China 's inter-provincial population migration from 2000 to 2020 by means of the eigenvector spatial filtering Poisson pseudo maximum likelihood estimation ( ESF PPML ) gravity model. Liu[2] selected 14 variables such as per capita GDP, temperature, slope, per capita income of urban residents and natural population growth rate, and used regression analysis model to explore the mechanism of the evolution of China 's population distribution pattern from 2000 to 2020.",
    "To sum up, Henan Province, as an important part of the six provinces in central China, is of great significance to study the temporal and spatial evolution of its population distribution under the national strategy of ' Rise of Central China ' and comprehensive promotion of rural revitalization. The newly compiled ' Henan Land and Space Planning ( 2021-2035 ) ' is a spatial blueprint for achieving high-quality development in Henan Province. Therefore, in the study of the spatial distribution characteristics of the traditional population and the population of agricultural provinces, Henan Province can be used as a better case. Based on the WorldPop center population data set, this paper analyzes the pattern dynamics of population distribution in Henan Province since the 21 st century, analyzes the influencing factors of population change by using geographic detectors, and tries to explain and compare the changes of population distribution pattern in two periods from 2000 to 2010 and from 2010 to 2020, and explores the new trend of spatial and temporal changes of regional population, in order to provide reference for regional land and space planning. Taking Henan Province as the research area, it is divided into four regions according to the ' Henan Provincial Land Spatial Planning ( 2021-2035 ) ' : the ' 8 + 1 ' Zhengzhou metropolitan area with Zhengzhou City as the core and Luoyang, Xinxiang, Jiaozuo and Kaifeng as the support ; the ecological economic development zone with Sanmenxia and Nanyang as the core ; the cross-regional collaborative development zone constructed by Anyang, Hebi and Puyang and the industrial transfer development zone composed of Shangqiu, Zhoukou, Zhumadian and Xinyang. The population data source is WorldPop data from 2000 to 2020, which is a global population spatial database jointly maintained by international organizations and researchers. The population data set has a resolution of 100 m. Due to the adjustment of administrative divisions in different years, in order to maintain consistency, the township administrative divisions of Henan Province in 2020 were uniformly adopted, with a total of 2510 townships ( streets ). The population raster data of three years ( 2000,2010,2020 ) were selected, and the raster data of three years were partitioned and counted, and then connected according to the consistency of administrative divisions to obtain the comparable population data sets of different years in the same spatial unit. In addition, 12 natural geographical and socio-economic statistical data such as per capita GDP, urbanization rate, nighttime light index, and multi-year average temperature were selected as independent variables, and they were gridded. The R language was used to classify and classify the influencing factors, and the influencing factors of population change were analyzed by the geographical detector model. The Theil index was first used to measure the degree of income distribution between individuals or regions. The value range is 0 ~ 1. The larger the value, the greater the difference in income distribution. Its advantage is that it can reflect the contribution of intra-regional and inter-regional to the total gap in space[16] .This paper uses the Theil index to analyze the degree of difference in the spatial distribution of population in Henan Province, and calculates the overall difference, intra-regional difference, inter-regional difference and their contribution rate of population distribution in Henan Province. The specific formulas are as follows : Among them, Ttheil represents the Theil index, Ta represents the intra-regional difference, and Tb represents the inter-regional difference ; x and Y represent the total population and total land of Henan Province, respectively. xm and ym respectively represent the total population and total land of the mth township in the ith region ; Xi and Yi represent the total population and total land in the ith region, respectively. In addition, Ta / Ttheil and Tb / Tthiel are defined as the contribution rate of intra- regional differences and inter-regional differences to overall differences, respectively. ( Yi / Y ) * ( Ta / Ttheil ) is the contribution rate of each region to the overall difference within the region[17]. Spatial autocorrelation analysis is a geo-spatial statistical method to study the degree of autocorrelation between the eigenvalues of a spatial unit in space and the eigenvalues of its adjacent spatial units. The global spatial autocorrelation can describe the distribution of the eigenvalues of the spatial unit in the whole region and judge the spatial agglomeration characteristics of the distribution, but it cannot accurately point out the aggregated area [ 18 ]. The Global Moran, s I index is commonly used to measure. The value of the Global Moran, s I index is [ -1,1 ]. When the Moran index > 0, it indicates a positive spatial correlation and presents a state of agglomeration distribution. The larger the value, the more obvious the spatial relationship agglomeration ; when Moran 's index < 0, it represents the spatial negative correlation and presents a discrete state. The smaller the value is, the more obvious the discrete trend of spatial relationship is. When Moran index = 0, it means that the spatial relationship is randomly distributed. Local spatial autocorrelation can reveal the degree of correlation between the units in the local area space and measure the aggregation position. LISA clustering diagram can measure the heterogeneity of local space, reveal the agglomeration characteristics of spatial pattern, and specifically characterize the agglomeration and discrete types of spatial units. Its clustering diagram expresses four different spatial autocorrelation categories : High-High, Low-Low, Low-High, High-Low.",
    "Geodetector is a statistical method to detect the spatial heterogeneity of dependent variables and reveal the driving force behind them. The core idea is that if an independent variable has an important influence on the dependent variable, the spatial distribution of the independent variable and the dependent variable should be similar[19]. In this paper, differentiation and factor detection are used to express the similarity of population change in the same region and the difference of population change between different regions, and to detect the explanatory power of each influencing factor on population change, which is measured by q value. The formula is as follows : In the formula : q represents the detection index of the explanatory power of the influence factor on the spatial distribution of population change ; h = 1,..., L is the stratification of the impact factor X, that is, classification or partition ; nh and N are the number of samples in the layer h and the whole region, respectively ; σh2 and σ2 are the variances of the layer h and the whole region dependent variable Y, respectively. The range of q is [ 0, 1 ]. The larger the q value is, the stronger the explanatory power of the impact factor X to the spatial distribution of population change Y is, the greater the impact is, and vice versa. As for the selection of influencing factors, referring to other existing studies and combining with the availability of data, the population density change is taken as the explanation object, in which the multi-year average temperature and multi-year average precipitation are the direct manifestations of climate in various regions. The topographic relief and altitude are selected to reflect the geomorphological conditions of each region. The number of beds per ten thousand people in the hospital reflects the medical level and health guarantee ability of each region ; the natural growth rate and the initial population density characterize the degree of mechanical growth of the local population ; per capita GDP, urbanization rate and road network density represent the economic development, urbanization level and traffic conditions of each region respectively. The proportion of employees in traditional manufacturing industry and the proportion of employees in agriculture, forestry, animal husbandry and fishery represent the development of agriculture, forestry, animal husbandry and fishery and traditional manufacturing industry respectively. The proportion of employees in the service industry represents the development of the service industry . It can be seen from Table 1 that the Theil index of population spatial distribution in Henan Province in 2000,2010 and 2020 gradually increased from 0.1842 to 0.1869 and 0.1939, and the overall difference was obvious and showed an increasing trend year by year. From the perspective of difference structure, the overall difference of population spatial distribution mainly comes from intra- regional differences, and the contribution rate of differences reaches 90 %. Further, the contribution rate of intra-regional differences in Zhengzhou metropolitan area is significantly greater than that of undertaking industrial transfer development area, ecological economic development area and cross- regional cooperative development area. The contribution rate of regional differences in the Zhengzhou metropolitan area has gradually increased from 48.23 % to 52.07 %, the development area of undertaking industrial transfer has gradually decreased from 21.61 % to 15.66 %, and the ecological economic development area and cross-regional collaborative development area have been basically maintained at about 10 %. The spatial distribution of population in Henan Province shows obvious regional differences and imbalances, and the proportion of population and land is unbalanced. In 2020, the average population density of township-level units in Henan Province was 2166 people / km2, with a median of 642 people / km2, far exceeding the national average [11]. In general, the population distribution pattern of Henan Province is higher in the east than in the west, and higher in the north than in the south. Among them, the population distribution of Zhengzhou metropolitan area in the central part of Henan Province is the most dense, showing the characteristics of regional center agglomeration ( Fig.2 ). From 2000 to 2010, the Theil index of population spatial distribution in Henan Province increased by 0.0027, while from 2010 to 2020, it increased by 0.007, reflecting that the speed of population agglomeration increased by more than 2 times. This rapid agglomeration trend can be confirmed by other statistical indicators : the number of township-level administrative units with population density greater than 700 people / km2 gradually increased from 1041 to 1078 and 1114, and the proportion of population in these areas gradually increased from 48.80 % to 50.50 % and 57.11 %. The trend of population agglomeration focuses on the Zhengzhou metropolitan area. Compared with 2000, the proportion of township-level units with a population density of more than 700 people / km2 in the Zhengzhou metropolitan area in 2020 increased from 49.63 % to 59.48 %, an increase of nearly 10 %.This shows that with the upgrading of manufacturing and service industries in Zhengzhou metropolitan area, the population of Henan Province is accelerating to the metropolitan area centered on Zhengzhou. The \" Henan Provincial Land Spatial Planning ( 2021-2035 ) \" plan has constructed a provincial urbanization spatial pattern of \" one main, two sub-centers, one circle, four From 2000 to 2020, about 40 % of the townships in Henan Province have been in a state of population contraction. Compared with 2000-2010, the number of townships with population loss in 2010-2020 has eased, from 1025 to 986, a decrease of 3.8 %. From the perspective of spatial distribution ( Fig. 2 ), the population growth area and the population contraction area are more concentrated in space. Among them, the population contraction area is the most prominent in the area of undertaking industrial transfer development. From 2000 to 2010, 695 townships in the area of undertaking industrial transfer development were in a state of population contraction. From 2010 to 2020, it climbed to 743, accounting for 90.3 %, which is a concentrated contiguous area of population contraction. The industrial transfer development area is located in the Huang-Huai Plain, which is dominated by planting industry. The industrial structure is relatively single, and the social and economic development is relatively lagging behind. It is a traditional agricultural labor export area in Henan Province, and the population in the region continues to shrink. In addition to undertaking industrial transfer development areas, other regions have basically achieved population growth, among which Zhengzhou has a much larger population attraction capacity than other cities. From 2000 to 2020, the townships with a density increase of more than 20 % in Henan Province, and the proportion of Zhengzhou City increased from 58.0 % to 74.0 %.",
    "Through ArcGIS software, the Global Moran, s I index of population change in Henan Province in 2000-2010 and 2010-2020 was calculated ( Table 2 ). In the two time periods, the Global Moran, s I and z test values are positive, and p < 0.01, indicating that there is a significant positive correlation in the spatial distribution of population change in Henan Province. The high value area is adjacent to the high value area, and the low value area is adjacent to the low value area, which shows the spatial distribution characteristics of central agglomeration and regional agglomeration. On the whole, the Global Moran, s I and z test value index has an upward trend, indicating that the spatial agglomeration degree of population change in Henan Province is generally increasing. In order to reflect the spatial autocorrelation degree of population change in each local area, taking the population change of township ( street ) as the spatial unit, the population change of Henan Province in two time periods is clustered and the abnormal value analysis is carried out to reveal the spatial aggregation characteristics of population change, and the LISA clustering map ( Fig. 3 ) is drawn. The high-value gathering area ( H-H type area ) is a concentrated contiguous area with a large population growth, with Zhengzhou City as the most prominent ; the low-value agglomeration area ( L-L type area ) is a concentrated area of population shrinkage, which is mainly distributed in the undertaking industrial transfer development area in eastern and southeastern Henan, with obvious diffusion trend. The ' H-L ' type area and the ' L-H ' type area are mainly distributed in the interior and surrounding of the L-L type area and the H-H type area, which are distributed in a point-like distribution, and over time, these two types of areas gradually decrease. This is due to the increasing degree of spatial agglomeration of the H-H type area and the L-L type area, which leads to the gradual decrease of this local heterogeneous ' cold and hot spot ' area. Based on the geographical detector, this paper analyzes the influence degree of each influencing factor on the population change in Henan Province ( Table 3 ). Among them, the topographic relief passed the significance test at the 0.05 level, and other influencing factors passed the significance test at the 0.01 level. From the perspective of the size of the influencing factors, the top three factors explaining the change of population density are per capita GDP, urbanization rate and road network density. It can be seen that the population change in Henan Province is relatively affected by social and economic factors. From the perspective of time scale, the comprehensive development level of cities, such as per capita GDP, urbanization rate, road network density, and the number of beds per ten thousand people in hospitals, has an increasing impact on population change, while the natural growth rate and initial population density have a lower impact on population change. The influence of natural environmental factors on the two time periods is less than 0.1, and the change is small ; this shows that the population change in Henan Province is closely related to the level of economic development, urban traffic conditions and medical level. The natural growth of population and the change of natural environment have little influence on population change. Further, from the perspective of the three major industries of economic development, compared with 2000-2010, the impact of agriculture, forestry, animal husbandry and fishery and traditional manufacturing on population change in Henan Province from 2010 to 2020 is declining, and the impact of service industry on population change is increasing. Resource-based cities such as Jiaozuo, Hebi and Pingdingshan are facing problems such as resource depletion, urban transformation and environmental governance, and the attractiveness of population agglomeration is weaker than before. Shangqiu, Zhoukou and other grain production functional areas, agricultural labor surplus, modern agricultural infrastructure is weak, urban public service resource allocation is low, and the industrial structure is relatively single, resulting in a large number of population flow to coastal developed areas. This shows that the development of a single traditional industry can no longer meet people 's needs, and it is urgent to enhance the attractiveness of the population by promoting the development of industrial integration.",
    "Note : * * indicates p < 0.01, and the correlation is significant ; * indicates p < 0.05, and the correlation is significant. Whether it is developed areas driven by metropolitan areas or underdeveloped areas driven by small and medium-sized cities, it is necessary to establish a sustainable population development strategy according to local conditions. The formulation and implementation of active population development policies is an important measure of population growth. Such as : For the Zhengzhou metropolitan area with regional center agglomeration, the population attraction advantage of the provincial capital Zhengzhou is significantly stronger than that of other cities. By 2020, the proportion of township- level units with a population density of more than 700 people / km2 in Zhengzhou metropolitan area has increased from 49.63 % to 59.48 %, an increase of nearly 10 %. During this period, the proportion of Zhengzhou increased from 58.0 % to 74.0 % in the townships with a population density increase of more than 20 % in Henan Province. Zhengzhou metropolitan area and its surrounding industrialized cities have superior location, developed transportation, and high industrial foundation and development level. Zhengzhou should continue to give full play to its core agglomeration advantages as a national central city, adjust relevant settlement policies, fertility policies, and high- skilled talent introduction policies, etc., and enhance its attractiveness to the floating population. For Shangqiu, Zhoukou and other industrial transfer development areas with good agricultural endowments, the proportion of villages and towns in the state of continuous population contraction reached 90.3 % from 2010 to 2020. Based on this, the government should actively increase agricultural subsidies, use the existing advanced modern technology to open the market and sales of agricultural products, layout related agricultural grain related enterprises for industrial integration, ensure the demand for agricultural production and processing space, and promote the integration and development of the primary, secondary and tertiary industries in the county. At the same time, we actively undertake industrial transfer, introduce policies such as corporate tax relief, corporate rental or purchase subsidies, attract enterprises to settle in, and realize population return by undertaking industrial transfer and related policy guidance. While building the ' Central Plains Granary ', we will achieve a balanced development of food security and economic construction. In general, whether it is Zhengzhou metropolitan area or small and medium-sized cities with good agricultural endowments, the government should continue to increase investment, improve the infrastructure system, promote the equalization of urban and rural public services and the integration of urban and rural facilities construction, and fully consider the characteristics and needs of different regions when formulating population sustainable development strategies. This paper explores the regional population evolution pattern and its influencing factors in Henan Province from 2000 to 2020 from three aspects : the spatial distribution pattern of population in Henan Province, the evolution of population distribution pattern and the influencing factors of population change. The main conclusions are as follows: (1) The overall characteristics of the spatial distribution of population in Henan Province show the central agglomeration with Zhengzhou as the core and the regional spatial agglomeration with Zhengzhou metropolitan area as the direction. The spatial distribution is obviously different, and the spatial agglomeration speed of population is still accelerating. (2) The spatial heterogeneity of population change in Henan Province is obvious. The population of Shangqiu, Zhoukou, Zhumadian, Xinyang and other regions continued to shrink, and the population agglomeration capacity of Zhengzhou and its surrounding cities continued to increase. (3) The level of economic development still maintains a large explanatory power for the population changes in Henan Province, followed by road conditions, medical level and urbanization level. The influence of natural environmental factors on population change is the lowest. Among the three major industries, the influence of agriculture, forestry, animal husbandry and fishery industry and traditional manufacturing industry on population change is declining, while the influence of productive and living service industry, as the ' reservoir ' of absorbing employment population, on population change is increasing."
]