[
    "Based on the development background of new qualitative productive forces, this paper constructs an innovation capacity indicator system from five aspects: regional economic capacity, logistics operation capacity, logistics infrastructure, innovation drive capacity, and green development capacity. It employs the factor analysis method to conduct a comprehensive quantitative evaluation and ranking of the logistics innovation capacity of 18 cities in Henan Province. Additionally, using the systematic cluster analysis method, the logistics innovation capacity of each city is classified into three gradients. The research conclusions indicate significant differences in logistics innovation capacity among the 18 cities in Henan Province. Furthermore, suggestions are proposed in terms of scientific and technological talents and investment, logistics infrastructure equipment construction, and green logistics to promote the regional synergy of logistics in various cities in Henan Province and achieve innovative development. As China's economy gradually shifts from high-speed growth to high-quality development, under the background of new qualitative productive forces, the modern logistics industry must disrupt traditions, enhance innovation capacity, establish an efficient and smooth Internet of Things circulation system, implement the \"dual carbon\" target requirements, lay the foundation for building a high-quality and efficient new service industry system, and promote the high-quality development of the logistics industry. In recent years, the logistics innovation capacity of cities across the country has been significantly improved, but there are still many shortcomings that restrict its rapid development. Therefore, this paper scientifically constructs an evaluation system for logistics innovation capacity from multiple dimensions and conducts an empirical analysis combined with specific data from 18 cities in Henan Province, building mathematical models for quantitative evaluation to better promote the future development of urban logistics and construct a modern logistics system that meets the development requirements of new qualitative productive forces. The research on the evaluation of urban logistics innovation capacity mainly focuses on three aspects: constructing logistics capacity evaluation indicators, different evaluation methods, and the impact of innovation on the high-quality development of logistics. Regarding the construction of the logistics Content from this work may be used under the terms of CC BY-NC 4.0 licence (https://creativecommons.org/licenses/by-nc/4.0/). Published by Warwick Evans Publishing. capacity evaluation indicator system, Wang Wenwen et al. (2022) constructed 15 secondary evaluation indicators from aspects such as carrying capacity, innovation capacity, economic development foundation, and logistics development effectiveness to evaluate the logistics capacity of the Wanjiang City Belt against the backdrop of high-quality development [1]. Wang Xiaoli and Zhou Xudong (2024) constructed 13 indicators from six aspects such as logistics basic capacity, operational capacity, innovation capacity, and green development capacity to assess urban logistics capacity [2]. In terms of evaluation methods for urban logistics capacity, Rao Shuwen (2022) explored the regional logistics capacity evaluation indicator system with the help of the entropy weight-TOPSIS method against the backdrop of high-quality development [3]. Zhang Guangsheng and Gao Shufang (2024) used the analytic hierarchy process to evaluate the logistics capacity of 31 provinces in China [4]. Regarding the impact of innovation on the high-quality development of logistics, Sun Chunxiao concluded through research on the national logistics level that the efficient flow of logistics innovation factors among cities has a significant impact on the high-quality development of the Chinese logistics industry and the coordinated development of regional logistics [5]. Xie Xinyu believes that innovation is the endogenous driving force for the high-quality development of logistics and is of great significance in guiding the upgrading and transformation of the modern logistics industry [6]. From the existing research results, significant achievements have been made in the research on the evaluation of urban logistics capacity, and the construction of the evaluation indicator system for urban logistics capacity is increasingly improving. However, according to the current research literature, there has not been a systematic study on urban logistics innovation capacity from the perspective of new qualitative productive forces. Therefore, this paper draws on existing results and combines the development connotation of new qualitative productive forces to construct an evaluation indicator system for urban logistics innovation capacity, ranks the logistics innovation capacity of 18 cities in Henan Province, summarizes the corresponding problems, and proposes countermeasures. New qualitative productive forces are dominated by scientific and technological innovation and characterized by digitization, intelligence, and greenness. To understand the level of logistics innovation capacity of cities in Henan Province under the background of new qualitative productive forces, this paper constructs an innovation capacity indicator system from five aspects: regional economic capacity, logistics operational capacity, logistics infrastructure, innovation-driven capacity, and green development capacity (refer with: Table 1).",
    "Regional economic capacity is an important indicator of the economic foundation and market potential for measuring urban logistics innovation capability. Therefore, the gross regional domestic product (GRP) and total retail sales of consumer goods of each city have been selected to reflect their respective economic development capabilities. Logistics operational capacity is a crucial indicator for measuring urban logistics innovation capability, having a direct impact on it. Therefore, we have selected the following five secondary indicators to reflect the logistics operational capacity of each city: \"Value-added of transportation, warehousing, and postal services,\" \"Number of employed persons in transportation, warehousing, and postal services,\" \"Number of legal entities in the transportation industry\" (representing \"Value-added of the logistics industry,\" \"Number of employed persons in the logistics industry,\" and \"Number of legal entities in the logistics industry,\" respectively), as well as \"Cargo turnover\" and \"Total postal business volume.\" Logistics infrastructure has a direct impact on urban logistics innovation capability. The completeness of infrastructure determines the future capacity of logistics cities. Therefore, we have chosen two secondary indicators: \"Number of civil cargo vehicles\" and \"Total length of postal routes\" to reflect the status of logistics infrastructure in each city. The development of new-quality productivity requires innovation in the logistics industry. Innovation can promote the continuous optimization of logistics organization and business processes, significantly improving the efficiency of logistics resource allocation. Therefore, this paper selects four secondary indicators: \"Number of international internet users,\" \"Expenditure on research and development (R&D),\" \"Number of personnel engaged in R&D activities,\" and \"Number of valid invention patents\" to measure the innovation-driven capacity of urban logistics in each city. Green and low-carbon are prominent features of new-quality productivity and are inevitable requirements for high-quality development. Energy-saving capacity must be considered in the renewal and development of urban logistics. Therefore, this paper selects two indicators: \"Total energy consumption\" and \"Area of park green spaces\" to represent the green development capacity of each city. This paper employs factor analysis using SPSS software for dimensionality reduction to rank the logistics innovation capacity of 18 cities in Henan Province. Additionally, cluster analysis is used to obtain comprehensive scores and classify the logistics innovation capacity of these 18 cities. The analysis in this paper is based on cross-sectional sequence data for 2023, with the original data sourced from the \"Henan Statistical Yearbook 2023\" and the statistical yearbooks of each city for 2023. The original data was analyzed using SPSS 23.0. Firstly, based on the principle of optimal membership degree, the data was standardized to eliminate the impact of inconsistent units among different variables, resulting in Table 2. The feasibility of the data was tested through the Kaiser-Meyer-Olkin (KMO) test and Bartlett's Test of Sphericity. The KMO test is a crucial indicator used to measure the strength of the correlations between variables, primarily obtained by comparing the correlation coefficient and partial correlation coefficient of two variables. The KMO value ranges between 0 and 1. A higher KMO value indicates stronger commonality among variables, making factor analysis more appropriate. The general criteria are as follows: 0~0.49 is unacceptable; 0.5~0.59 is very poor; 0.6~0.69 is reluctantly acceptable; 0.7~0.79 is acceptable; 0.8~0.89 is relatively good; and 0.9~1 is very good. The calculation results are shown in Table 3. According to Table 3, the KMO value is 0.793, which is greater than 0.5. The Bartlett's Test of Sphericity statistic value is 575.544, with a P-value of 0.000, which is less than the significance level of 5%. This indicates that factor analysis can be performed. Using SPSS 23.0 to conduct principal component analysis (PCA) on the data, the total explained variance is shown in Table 4. Based on the principles of a cumulative contribution rate exceeding 50% and a characteristic value greater than 1, three common factors can be extracted from the initial 15 indicators. The cumulative variance contribution rate of these three common factors reaches 95.742%, indicating that the amount of excluded information is minimal. Furthermore, these three common factors basically encompass all the information contained in the original indicators, suggesting that the factor analysis results are reliable. After performing variance maximization rotation on the factor loading matrix, the rotated factor loading matrix is obtained as shown in Table 5. Through the factor loading matrix, the symbolic meanings of the common factors are interpreted. By rotating the loading matrix, the corresponding factor cost matrix is obtained, as shown in Table 5.",
    "Common Factor 1 carries a significant load in 12 indicators: \"Expenditure on Research and Experimental Development,\" \"Total Length of Postal Routes,\" \"Number of Employees in the Logistics Industry,\" \"Number of Valid Invention Patents,\" \"Gross Regional Domestic Product,\" \"Total Postal Business Volume,\" \"Number of Legal Entities in the Logistics Industry,\" \"Value Added by the Logistics Industry,\" \"Total Retail Sales of Consumer Goods,\" \"Total Energy Consumption,\" \"Area of Park Green Spaces,\" and \"Personnel Engaged in Research and Experimental Development Activities.\" Therefore, Common Factor 1 can be interpreted or named as the \"Innovation Environment Factor\" (F1). Common Factor 2 carries a significant load in the two indicators of \"Cargo Turnover\" and \"Internet Users,\" so Common Factor 2 can be named the \"Market Potential Factor\" (F2). Common Factor 3 carries a significant load in the indicator of \"Ownership of Civil Cargo Vehicles,\" so Common Factor 3 can be named the \"Logistics Capacity Factor\" (F3). The component score coefficient matrix (as shown in Table 6) is used to calculate the scores for the common factors. Based on the ranking of the total factor Z, Zhengzhou City, Luoyang City, and Nanyang City are the top three cities in Henan Province with strong logistics innovation capabilities in 2023, while Sanmenxia City, Hebi City, and Jiyuan Demonstration Zone rank at the bottom. The top three cities each have some outstanding indicators. Zhengzhou City ranks first in the overall ranking and the \"innovation environment factor,\" but its \"market potential factor\" and \"logistics capability factor\" rank fourth and sixth, respectively. Luoyang City, which ranks second, ranks tenth in the \"market potential factor,\" but its \"innovation environment factor\" and \"logistics capability factor\" rank first and second, respectively. Although Nanyang City ranks second in the \"market potential factor,\" its \"innovation environment factor\" and \"logistics capability factor\" both rank seventh. This shows that Zhengzhou City and Luoyang City, as the two most economically developed cities in Henan Province, have a good innovation environment, prominent economic strength, adequate talent reserves, and complete logistics innovation infrastructure. Nanyang City has a sufficient number of cargo vehicles, which can provide a cargo foundation for future logistics innovation development. However, from the perspective of comprehensive scores, there is a large gap in logistics innovation capabilities among the 18 cities in Henan Province. Zhengzhou City is far ahead, and the development shows a relatively uneven trend. Attention should be paid to the cities that rank lower to achieve balanced development of logistics innovation capabilities throughout the province. This paper uses cluster analysis to classify the logistics innovation capability level index of 18 cities in Henan Province (as shown in Figure 1). Cluster analysis based on the original indicators can divide Based on the numerical values of the three common factors extracted above, a systematic cluster analysis was conducted using SPSS, resulting in three categories. Zhengzhou City. Zhengzhou, as the capital city of Henan Province, serves as the economic, political, and cultural hub of the province. With a solid economic foundation, well-equipped logistics facilities, and substantial research personnel and R&D expenditures, Zhengzhou has inherent advantages in logistics innovation development and leads the way in the development of new-type productivity in Henan Province. However, with the second-highest comprehensive energy consumption index, indicating high energy consumption in production, energy conservation and green production should be emphasized during the development of new-type productivity. Nanyang City, Shangqiu City, and Zhoukou City. These three cities rank relatively high overall and possess a certain level of economic foundation. Nanyang ranks third in both the comprehensive ranking and the market potential factor ranking, but its innovation environment factor and logistics capability factor rankings are only in the upper-middle range. The primary factor limiting its innovation capability is the comprehensive energy consumption index, so Nanyang should focus on the use of clean energy and energy conservation in its future development. Shangqiu ranks fifth overall, with lower rankings in the innovation environment factor and logistics capability factor. It has a large number of logistics industry employees, civil cargo vehicles, and postal industry volume, indicating a good foundation for the logistics market. However, its expenditures on research and experimental development, research and experimental development personnel, and the number of valid invention patents all rank in the middle of Henan Province, lacking economic, personnel, and achievement support for logistics innovation. The Shangqiu government should pay attention to investments in scientific research. Zhoukou, although ranking only eighth in the comprehensive ranking of logistics innovation capability, ranks first in cargo turnover and third in the number of civil cargo vehicles, possessing huge market potential and logistics carrying capacity. Therefore, the government should emphasize encouraging and supporting logistics-related policies and attach importance to the development of the logistics industry to further drive Zhoukou's economic development.",
    "Including 14 cities such as Kaifeng, Luoyang, and Xuchang. Most of these cities have a relatively weak economic foundation. Luoyang, a well-known tourist city in Henan Province, ranks second in the comprehensive score but ranks in the third tier in logistics innovation capability due to its cargo turnover and the number of civil cargo vehicles. This indicates that logistics infrastructure has a significant impact on logistics innovation capability. Luoyang should increase the number of cargo vehicles and expand logistics transit facilities to increase cargo turnover. The current economic foundation, logistics facilities, and logistics innovation foundation of the other cities cannot support their logistics innovation development. Therefore, they need to first develop their economies, use economic capabilities to drive logistics development, combine with local pillar industries such as agriculture and trade, coal, and tourism, develop logistics in related industries, and enhance local logistics innovation capability. From the perspective of new-type productivity, this paper constructs an evaluation index system for urban logistics innovation capability with five primary indicators and 15 secondary indicators. The systematic cluster analysis method is used to conduct cluster analysis on the logistics innovation capability of various cities, and quantitative assessment and comprehensive evaluation of the logistics innovation capability of 18 cities in Henan Province are carried out. Through research, conclusions are drawn and corresponding development suggestions are proposed. (1) The study found that there is a large gap in logistics innovation capability among the 18 cities in Henan Province, with uneven development. Except for Zhengzhou, which ranks high in all indicators and leads in logistics innovation capability, other cities have shortcomings that limit the further development of their logistics industry. (2) There are three tiers of logistics innovation capability among cities in Henan Province, with Zhengzhou in the first tier, Nanyang, Shangqiu, and Zhoukou in the second tier, and the remaining 14 cities in the third tier. (3) The differences in sub-item logistics capabilities among the 18 cities in Henan Province are obvious, resulting in unbalanced overall regional logistics development in Henan Province. It can be mainly divided into three aspects: \"innovation environment factor\", \"market potential factor\", and \"logistics capability factor\". Each city has its own shortcomings in these three aspects, and targeted measures should be taken to promote coordinated and efficient development of regional logistics, so Zhengzhou has a large number of research personnel and good economic support for scientific research, while other cities lack this. To achieve regional logistics synergy and excellent development of new-type productivity throughout the province, cities should strengthen the construction of think tanks, increase the introduction of logistics talents, provide policy support to encourage enterprises, universities, and scientific research institutions to strive for innovation and novelty, improve the conversion rate of logistics patent achievements, disseminate theoretical achievements into practice, and comprehensively enhance the technological innovation capability and management innovation capability of the logistics industry. From the comprehensive scores, it can be seen that although some cities rank among the top in terms of comprehensive logistics innovation capacity, they lack logistics infrastructure and equipment. There is a shortage of practitioners and cargo vehicles, which is detrimental to the innovative expansion and development of the logistics industry in the future. Therefore, cities should make good preparations for the innovative development of the logistics industry by adding logistics infrastructure and equipment, encouraging people to purchase cargo vehicles to increase transportation capacity, and encouraging people to engage in logistics work to increase the reserve force. Henan Province is rich in coal mine resources, and most cities still rely mainly on traditional energy for production and life, which does not meet the requirements of the development of new-quality productive forces. Therefore, to achieve low-carbon and green production, the logistics industry in various cities should, on the one hand, increase the use of clean energy such as wind and solar power. On the other hand, it should focus on the recycling of logistics resources, reasonably plan transportation routes, transit hubs, etc., so as to achieve the goals of green transportation, green logistics, and green warehousing. Policies should support the access system for new-energy cargo vehicles, release road rights, rationally utilize railway transportation resources, optimize multimodal transportation methods, reduce logistics costs, improve logistics efficiency, and reduce carbon emissions. In summary, the development of urban logistics innovation capacity requires the joint efforts of governments, enterprises, industry associations, logistics talents, and other parties. They should coordinate and plan, combine the development concept of new-quality productive forces with local industries, and continuously promote the high-quality, innovative, and coordinated development of urban logistics."
]