[
    "Background: With the vigorous development of sports in higher education in China, the popularity of basketball on university campuses has increased significantly. However, the high incidence of sports injuries not only restricts the physical and mental health development of students, but also poses a potential threat to the construction of campus sports culture. Existing studies mostly focus on professional or semi-professional athletes, and there is a relative lack of systematic investigations on basketball injuries among ordinary college students. Objective: This study aims to use epidemiological survey methods to deeply analyze the occurrence patterns, anatomical distribution characteristics and influencing factors of basketball injuries among college students in Henan Province, so as to provide empirical support for the formulation of scientific and effective prevention and intervention strategies. Methods: A cross-sectional survey was conducted on 754 college students from 17 colleges and universities in Henan Province using a multi-stage stratified random sampling method. A structured questionnaire verified by experts was used to collect data related to sports injuries, including key indicators such as injury type, anatomical location, severity, and recovery time. Descriptive statistics, chi-square test, and logistic regression analysis were used for data analysis. Results: A total of 487 cases of basketball injuries were recorded among the surveyed subjects, with an overall incidence of 64.6%. Lower limb injuries accounted for 65.5%, significantly higher than upper limb injuries (34.5%). Acute injuries (70.2%) were significantly more common than chronic injuries (29.8%), among which sprains were the most common type of injury (45.8%). The incidence of knee injuries in female athletes was significantly higher than that in male athletes (27.3% vs 15.4%, OR=2.06, 95% CI: 1.32-3.21). Conclusion: Basketball injuries among college students in Henan Province are on the rise, with acute lower limb injuries as the main feature. The results provide an important scientific basis for building a personalized prevention system and improving the campus sports medical security mechanism. As one of the most popular team sports in the world, basketball occupies an important position in my country's higher education system. According to a review by Harmer (2005), the high intensity confrontation and complex movement patterns of basketball make it a sport with a high incidence of sports injuries. Cumps et al. (2007) showed that the injury incidence of amateur basketball players was 9.9 cases per 1,000 hours of exposure, confirming the importance and urgency of basketball injury prevention. A large-scale survey of American high school basketball players by Borowski et al. (2008) found that the injury incidence was 1.94 cases per 1,000 athletes exposed, further confirming the prevalence of basketball injuries. International studies have shown that the incidence of basketball injuries ranks among the highest among all kinds of sports. In a follow-up study of Australian youth basketball players, McKay et al. (2001) found that about 6.2 injuries occurred in every 1,000 hours of training, among which ankle injuries were the most common. A multicenter European study by From a biomechanical perspective, basketball involves a lot of high-intensity movements such as jumping, sudden stops, and changes of direction, which put a huge load on the lower limb joints, especially the knee and ankle joints. Krosshaug et al. (2007) found through video analysis of 39 cases of anterior cruciate ligament injuries that 75% of non- contact anterior cruciate ligament injuries occurred during typical basketball movements such as landing, cutting, and sudden stops. Fong et al. (2007) pointed out in a systematic review that the impact force on the knee joint during landing can be several times the body weight, and this high load is an important cause of lower limb injuries. At present, research on basketball injuries mainly focuses on professional or semi-professional athletes. Zuckerman et al. (2018)'s study on NCAA players revealed the injury characteristics of elite college basketball players and found that during the period of 2009-2015, the injury rates of male and female basketball players were 4.3 and 5.1 cases per 1,000 athletes, respectively. However, these findings may not be applicable to ordinary college students with large differences in technical level and physical fitness. Although Drakos et al.'s (2010) 17-year follow-up study of NBA players provided valuable injury data, showing that ankle sprains were the most common type of injury (13.2%) among professional basketball players, the training intensity, medical care and recovery conditions of professional athletes were significantly different from those of ordinary college students. Starkey's (2000) 10-year study of the NBA also confirmed the dominance of lower limb Henan Province is a populous and educational province in my country with rich higher education resources and a large number of college students. However, there is still a lack of systematic research on basketball injuries among college students in the region. Given the potential impact of regional differences, cultural background, and sports facilities on sports injury patterns, conducting regional epidemiological surveys has important practical significance. This study systematically analyzed the epidemiological characteristics of basketball injuries among college students in Henan Province through a large-sample cross-sectional survey, aiming to provide empirical support for formulating scientific prevention strategies and improving the campus sports medical security system.",
    "The history of research on basketball injuries can be traced back to the 1970s. The pioneering study by Garrick and Requa (1978) systematically described the basic characteristics of high school sports injuries for the first time, laying the foundation for subsequent research on basketball injuries. Their study found that basketball has a relatively high injury incidence rate among all high school sports. Prieto-González et al. (2021) pointed out in their latest systematic review that research on basketball injuries has evolved from early descriptive studies to more in-depth mechanism analysis and prevention studies. From the perspective of anatomical distribution, lower limb injuries dominate basketball. Starkey's (2000) analysis of 10-year injury data of NBA players showed that lower limb injuries accounted for about 60-70% of all basketball injuries, and this proportion was relatively stable at different levels of basketball. Dick et al. (2007) confirmed this distribution feature through a long- term monitoring study of NCAA men's basketball players, and found that the ankle and knee joints were the most vulnerable parts. Ankle sprains are the most common type of injury. Tummala et al. (2018) found in a 10-year follow-up study of college basketball players that ankle injuries accounted for 15-25% of all basketball injuries. Gender differences are an important dimension of basketball injury research. Arendt and Dick (1995) found through a large-scale epidemiological survey of NCAA basketball and football players that the anterior cruciate ligament injury rate of female basketball players was significantly higher than that of male players. This finding has attracted widespread attention in the sports medicine community. Their research showed that the incidence of anterior cruciate ligament injuries in female basketball players was 2-8 times that of male players, and this gender difference has been repeatedly verified in subsequent studies. Beynnon et al. (2014) further confirmed the existence of this gender-specific injury pattern in a larger multi-sport study. players that psychological factors such as psychological stress, life event stress, and coping ability were significantly associated with the occurrence of sports injuries. Although the study was aimed at football players, its findings are also of great significance to other team sports such as basketball, providing theoretical support for multi-dimensional injury prevention strategies. The occurrence of basketball injuries is the result of the combined effects of multiple factors. The multifactorial injury model proposed by Meeuwisse (1994) provides an important theoretical framework for understanding the complex mechanisms of sports injuries. The model divides risk factors into internal factors (such as age, gender, previous injury history, physical fitness) and external factors (such as training load, venue conditions, equipment quality, environmental factors), emphasizing the multifactorial nature of injury. van Mechelen et al. (1992) further elaborated on the complexity of this multifactorial interaction in the classic model of sports injury prevention. Biomechanical research has revealed the specific mechanisms of basketball injuries. Olsen et al. (2004) found through systematic video analysis of anterior cruciate ligament injuries in handball that most non-contact anterior cruciate ligament injuries occur in dangerous postures that combine knee valgus, internal rotation, and tibial anterior displacement. This finding also applies to basketball. Krosshaug et al. (2007)'s basketball- specific study confirmed the same injury mechanism, providing important guidance for subsequent preventive training design. Weiss et al. (2017) found in their study of the relationship between training load and injury among professional basketball players that excessive training load is an important factor leading to an increased risk of injury. The role of psychological factors in sports injuries has also gradually received attention. Johnson and Ivarsson (2011) found in their study of adolescent football The development of basketball injury prevention strategies has undergone an important transition from passive protection to active prevention. Early preventive measures mainly relied on protective gear and equipment improvements. McKay et al. (2001) found that appropriate ankle support equipment can significantly reduce the incidence of ankle injuries. Moore et al. (2021) summarized the application effects of various ankle protection equipment in professional basketball players in the latest review. effects of various ankle protection equipment in professional basketball players in the latest review. The role of neuromuscular training in injury prevention has been widely recognized. The anterior cruciate ligament injury prevention training program developed by Hewett et al. (1999) has achieved remarkable results in female basketball and volleyball players. After 6 weeks of neuromuscular training, the incidence of anterior cruciate ligament injuries in female athletes was reduced by 88% and the incidence of knee injuries was reduced by 60%. This pioneering study demonstrated the great potential of preventive training in reducing serious knee injuries. Taylor et al. (2015) further confirmed the effectiveness of neuromuscular training in basketball injury prevention in a systematic review and meta- analysis.",
    "Owoeye et al. (2020) found in a study among adolescent basketball players that neuromuscular training programs can significantly reduce the incidence of ankle sprains. Padua et al. (2019) conducted a randomized controlled trial that proved that a standardized warm-up program can effectively prevent ankle injuries in young female basketball players. These studies provide important evidence- based medicine for building a scientific injury prevention system. In recent years, the concept of injury prevention has gradually shifted from a simple biomedical model to a more comprehensive bio-psycho-social model, emphasizing the importance of multidisciplinary collaboration in injury prevention. This study adopted a cross-sectional survey design and used epidemiological methods to systematically investigate basketball sports injuries among college students in Henan Province. The research protocol was reviewed and approved by the Ethics Committee of the National University of Malaysia (UKM) to ensure the ethical compliance of the study and the protection of the rights and interests of participants. A multi-stage stratified random sampling method was used to select 754 college students from 17 colleges and universities in Henan Province as the survey subjects. Inclusion criteria included: (1) aged 18-25 years; (2) participated in basketball in the past year; (3) voluntarily participated in the survey and signed the informed consent. Exclusion criteria included: (1) the presence of serious underlying diseases; (2) a history of serious sports injuries that affected current sports participation; (3) incomplete questionnaires. The sample size calculation was based on an expected injury rate of 60%, an allowable error of 3%, and a confidence interval of 95%, and the required sample size was 737. Considering a dropout rate of 10%, 754 people were actually selected to ensure sufficient statistical power. The study used a self-designed structured questionnaire, which included: (1) basic demographic characteristics (age, gender, professional background, etc.); (2) basketball participation (experience, frequency, level, etc.); (3) detailed information on sports injuries (type, location, mechanism, severity, etc.); (4) injury prevention knowledge and behavior; and (5) medical treatment and rehabilitation. The Delphi method was used for expert discussion during the questionnaire design process. Ten experts in sports medicine, physical education and epidemiology were invited to conduct two rounds of consultation. The expert consistency coefficient reached 0.85, and the questionnaire items were finally determined. In the pre-test phase, a pilot survey was conducted on 50 college students. The Cronbach's α coefficient of the questionnaire was 0.87, and the test-retest reliability was 0.92, indicating good reliability and validity. Data collection will be conducted from March to June 2024 by uniformly trained investigators. All investigators received two days of professional training, including questionnaire usage, communication skills, and quality control requirements. The survey will be conducted in the form of face-to-face interviews to ensure data quality and integrity. Each questionnaire will take about 20- 30 minutes to complete, and missing information will be verified on site and supplemented in a timely manner. To ensure data quality, the study implemented multi- level quality control measures: (1) standardized training and qualification certification for investigators; (2) repeated surveys of 10% of the questionnaires to verify consistency; (3) daily data entry and logical error checking; and (4) regular supervision and quality assessment. Data analysis was performed using SPSS 26.0 software. Data cleaning and quality checks were performed first, followed by descriptive statistical analysis. Categorical variables were expressed as frequencies and percentages, and continuous variables were expressed as mean ± standard deviation. Chi-square tests were used for comparisons between groups, and logistic regression analysis was used for multivariate analysis. Odds ratios (ORs) and their 95% confidence intervals were used to quantify the strength of association. The statistical significance level was set at α = 0.05. A total of 754 valid questionnaires were collected in this survey, with a recovery rate of 100%, ensuring the integrity and representativeness of the data. The respondents were aged 18-25 years old, with an average age of (20.8±1.6) years old, which is the golden period of physical function and athletic ability, but it is also the age group with a high incidence of sports injuries. In terms of gender distribution, there were 456 males (60.5%) and 298 females (39.5%). This ratio basically reflects the gender structure characteristics of basketball Analysis of professional backgrounds showed that there were 187 students majoring in sports (24.8%) and 567 students majoring in non-sports (75.2%), which provided a good basis for comparing the injury characteristics of students with different professional backgrounds. It is worth noting that non-sports majors accounted for the vast majority, indicating that basketball is highly popular among ordinary college students and also suggesting the importance of injury prevention strategies for non- professional athletes.",
    "The distribution of basketball experience ranged from 1 to 10 years, with an average of (4.2±2.1) years, which reflects that college students have a relatively rich basketball foundation. However, differences in sports experience may also be an important factor affecting the occurrence of injuries. Inexperienced athletes often have defects in the execution of technical movements and the judgment of dangerous situations. In terms of the nature of the injuries, 342 cases (70.2%) were acute injuries and 145 cases (29.8%) were chronic injuries. This distribution ratio is highly consistent with the high-intensity confrontation and explosive characteristics of basketball. The high proportion of acute injuries reflects the prevalence of sudden trauma in basketball. Such injuries are often directly related to improper technical movements, physical contact or venue environmental factors. In contrast, although the proportion of chronic injuries is relatively low, their progressiveness and concealment make prevention and early intervention more difficult, and they are often discovered only when the injury significantly affects sports performance. Among the 754 survey subjects, a total of 487 basketball injuries were recorded, with an overall incidence of 64.6%, which is significantly higher than the injury incidence of general sports, highlighting the characteristics of basketball as a high-risk sport. This incidence is similar to the Australian research results of Mclay et al. (2012) (58.2%), but higher than the injury rate of European amateur basketball players reported by Cumps et al. (2007). This difference may be related to factors such as research methods, injury definitions, and population characteristics. The time distribution of injuries showed interesting characteristics: 56.3% of injuries occurred during training, slightly higher than 43.7% during competition. This finding challenges the traditional assumption that higher competition intensity leads to greater injury risk. The high incidence of injuries during training may be related to the following factors: longer training time, higher repetitive movements, cumulative fatigue effects, and gradual escalation of confrontation intensity. This finding has important guiding significance for training arrangements and injury prevention strategies. In-depth analysis from an anatomical perspective revealed the distinct characteristics of basketball injuries. The 319 cases of lower limb injuries (65.5%) were significantly higher than the 168 cases of upper limb injuries (34.5%). This distribution pattern is closely related to the biomechanical characteristics of basketball. As the core part of basketball that bears body weight, generates power, and maintains balance, the lower limbs bear huge mechanical loads in typical movements such as jumping, landing, sudden stops, and changes of direction. This asymmetric injury distribution reflects the high dependence of basketball on lower limb function. From the perspective of evolutionary biology, the structure and function of human lower limbs are mainly adapted to walking and running in a straight line, while the frequent multi-directional changes, vertical jumps and unstable landings in basketball put forward requirements beyond the normal physiological range for the lower limb joints and muscle systems. The specific distribution is shown in Table 1: accounting for 45.8% of the total injuries. This proportion is quite common in international basketball injury research. The high incidence of sprains is closely related to factors such as frequent changes in direction, imbalance in landing control, and body contact in basketball. Lower limb sprains (156 cases, 32.0%) far exceed upper limb sprains (67 cases, 13.8%). This difference reflects the huge torsional stress that lower limb joints are subjected to in basketball. Muscle strain ranked second (134 cases, 27.5%), of which lower limb strains accounted for the majority (89 cases, 18.3%). This type of injury is often related to muscle strength imbalance, lack of flexibility, and overextension under fatigue. It is worth noting that although the proportion of upper limb strains is relatively low (45 cases, 9.2%), it is still important in specific basketball actions such as shooting, passing, and rebounding. The occurrence pattern of contusions showed a relatively balanced distribution, and the difference in the proportion of lower limbs and upper limbs was not as obvious as that of sprains and strains. This distribution feature may be related to the randomness and multi-directional nature of body Although chronic injuries account for a small proportion of the total, their impact on athletes' long-term health and sports performance cannot be ignored. Tendinitis (43 cases, 8.8%) and stress injuries (25 cases, 5.2%) are often related to long- term repetitive loads, insufficient recovery, and improper training methods. The prevention of such injuries requires systematic consideration from the perspective of training load management and individualized rehabilitation strategies.",
    "In order to more accurately understand the distribution patterns and clinical significance of injuries of different natures, this study conducted a detailed anatomical analysis of acute and chronic injuries. This classification method not only helps to reveal the pathophysiological mechanism of injury, but also provides a scientific basis for the development of targeted prevention and treatment strategies. Ankle/foot injuries ranked first with an absolute advantage (143 cases, 29.4%), of which acute injuries dominated (112 cases, 32.7%). This finding is highly consistent with the results of McKay et al. (2001), who found that ankle injuries accounted for the majority of injuries in basketball. As a key joint for the human body to bear weight, the ankle joint is subjected to complex multi-directional stress during actions such as jumping and landing, sudden stops and changes of direction. Acute ankle injuries often occur when the foot is in an improper posture during landing, the ground is uneven, or in contact with others. Its instantaneous and high-intensity characteristics make it difficult to prevent. The distribution characteristics of knee injuries showed a unique pattern: the ratio of acute injury (67 cases, 19.6%) to chronic injury (31 cases, 21.4%) was relatively close, which reflects the complexity and diversity of knee injuries. Acute knee injuries often involve severe pathological changes such as ligament tears and meniscus injuries, while chronic knee injuries are often manifested as overuse injuries such as patellofemoral pain syndrome and patellar tendinitis. This distribution characteristic suggests that the knee joint is both a prone site for acute trauma and a sensitive area for chronic load accumulation. The injury pattern of the hip/groin region is also worthy of attention. Although the overall incidence is relatively low (78 cases, 16.0%), its distribution in acute and chronic injuries is relatively balanced, which may be related to the complex anatomical structure and diverse functional requirements of this area. As the core link of the lower limb movement chain, its dysfunction often has a chain reaction on the biomechanics of the entire lower limb. Among upper limb injuries, wrist/hand injuries (67 cases, 13.8%) were slightly higher than shoulder injuries (56 cases, 11.5%), and this distribution characteristic is related to the frequency of hand contact with the ball and the ground in basketball. It is worth noting that the proportion of chronic injuries of the wrist/hand (22 cases, 15.2%) was relatively high, which may be related to overuse caused by repeated catching, passing and shooting. Although the total number of back injuries was relatively small (45 cases, 9.2%), the proportion of chronic injuries (19 cases, 13.1%) was the highest among all parts of the body. This feature indicates that basketball requires high spinal stability and core muscle function. The occurrence of chronic back injuries is often related to long-term poor posture, insufficient core strength, and limited spinal severity and prognostic characteristics of different injury types. This study divided the recovery time into three stages: short-term (<14 days), medium- term (14-28 days) and long-term (>28 days). This classification not only reflects the biological healing process of the injury, but also reflects the actual impact of the injury on the athlete's functional recovery and return to sports. Contusions showed the most optimistic recovery characteristics, with 77.4% of cases achieving functional recovery within two weeks and only 3.2% requiring more than 28 days of rehabilitation. This rapid recovery feature is closely related to the pathological mechanism of contusions: contusions mainly involve local vascular damage and inflammatory response of soft tissues, while deep structures such as ligaments, tendons and bones usually remain intact, so the healing process is relatively simple and direct. Sprains and strains show similar recovery patterns, with about 65% of cases recovering in the short term, but about 9% still requiring long-term rehabilitation. This distribution reflects the complexity of acute soft tissue injuries: minor sprains and strains may only involve a small amount of fiber tearing and heal quickly, while severe sprains and strains may be accompanied by joint capsule damage, partial ligament tearing, or large-area muscle fiber rupture, requiring a longer process of tissue remodeling and functional reconstruction. The recovery characteristics of chronic injuries are in stark contrast to those of acute injuries. The long- term recovery rate of tendinitis is as high as 23.3%, and the medium-term recovery rate is 48.8%. This extended recovery time reflects the stubbornness and complexity of the chronic inflammatory process. The relatively poor blood supply of tendon tissue, coupled with the changes in tissue structure caused by chronic inflammation, makes the healing process slow and prone to recurrence.",
    "52.0% requiring medium-term rehabilitation, and only 20.0% able to recover in the short term. This characteristic is closely related to the nature of stress injuries: long-term repetitive microtrauma leads to cumulative damage to tissues, often involving structural changes in bones, cartilage or dense connective tissue, requiring thorough load adjustment and a progressive rehabilitation process. The difference in recovery time also reflects the different effects of different injury types on athletes' psychological states. Although acute injuries are extremely painful, the healing process is relatively predictable, and athletes can adapt psychologically relatively easily. However, the uncertainty and recurrence of chronic injuries often have a greater impact on athletes' psychology, which may lead to psychological problems such as sports fear and decreased self-confidence, thus affecting the rehabilitation effect and the success rate of returning to sports. The impact of sports injuries on college students' academic performance is an important topic with both theoretical and practical value. This study is the first to systematically quantify the specific impact of basketball injuries on students' daily academic activities, providing direct evidence for understanding the socioeconomic costs of sports injuries. The data showed that more than one-third of the impairments (38.4%) directly affected students’ class attendance, a finding with far-reaching educational significance. Class attendance is an important predictor of academic success, and the degree of impairment is directly related to students’ learning outcomes and academic performance. Especially in theoretical courses, interruptions in continuous learning may lead to a break in the knowledge system, which in turn affects the overall quality of learning. The proportion of laboratory work affected (20.1%) is also worthy of attention, and this phenomenon is particularly prominent among science and engineering students. Laboratory work often requires precise operating skills and sustained concentration. Sports injuries, especially upper limb injuries, may seriously affect students' experimental operation ability. More importantly, the difficulty of making up for experimental courses is much greater than that of theoretical courses. Missed experimental opportunities are often difficult to make up, which may have a long-term impact on students' professional skills training. The slightly affected group (33.9%) mainly showed mild limitations in daily mobility, which did not directly affect academic activities, but may indirectly affect learning efficiency by increasing fatigue, reducing attention, etc. This \"hidden impact\" is often overlooked, but its cumulative effect should not be underestimated. profound impact on students overall. This type of injury often requires a long recovery time, which may cause students to miss important exams, internships or academic activities, causing substantial obstacles to academic progress. More seriously, long-term functional limitations may cause psychological problems such as anxiety and depression, further exacerbating the negative impact on academic performance. From the perspective of time, the distribution of the duration of the impact shows a clear gradient feature. Although the short-term impact (1-3 days) is relatively mild, it may just cover important academic nodes, such as midterm exams, course demonstrations, etc., causing disproportionate negative consequences. The medium-term impact (4-7 days) just covers a complete learning cycle and may lead to the loss of an entire learning unit. The long-term impact (8-14 days or more) may affect the learning progress of the entire semester and require additional remedial measures. This multi-dimensional impact assessment reveals the complexity of sports injuries. It is not only a medical problem, but also an educational problem that affects the comprehensive development of students. This understanding has important guiding significance for the formulation of college sports policies, the allocation of medical resources, and the optimization of students' comprehensive development strategies. Gender differences in basketball injuries provide a unique perspective for understanding the biological mechanisms of injury. The differences in injury patterns between men and women in this study not only reflect differences in anatomy and physiology, but also reveal the complex impact of sociocultural factors on sports participation and injury risk. The overall injury rate of male athletes (60.2%) was significantly higher than that of female athletes (39.8%), a phenomenon that is closely related to the higher intensity and confrontation of male participation in basketball. From the perspective of evolutionary psychology, men tend to show greater aggression and risk tolerance in competitive sports, and this behavioral characteristic may increase the risk of injury exposure. In addition, the physical confrontation intensity of male basketball is usually higher, and the jumping height and movement speed are faster, all of which may increase the probability of acute injury.",
    "However, the most striking finding is that the incidence of knee injuries in females is significantly higher than that in males (27.3% vs 15.4%, OR=2.06, 95% CI: 1.32-3.21). This statistically significant difference reveals the existence of gender- specific injury patterns. This difference is highly consistent with the classic research results of Arendt and Dick (1995), further confirming the prevalence of high incidence of knee injuries in female athletes. The biological basis of this difference can be explained from multiple dimensions: pattern when landing. This phenomenon, known as \"dynamic knee valgus\", is a typical dangerous posture for anterior cruciate ligament injury. Electromyographic studies have shown that when women perform jump landing tasks, the activation pattern of the quadriceps is significantly different from that of men, which may lead to gender differences in knee control strategies. Hormonal factors should not be ignored either. Cyclic changes in estrogen levels may affect the mechanical properties of the ligament, and the strength of the anterior cruciate ligament may be relatively reduced at certain stages of the menstrual cycle. Although this mechanism remains controversial, a large amount of epidemiological evidence supports the association between hormonal The distribution of ankle sprains between genders is relatively balanced (30.4% in men vs 27.8% in women), which suggests that the mechanism of ankle injury may be more related to external factors (such as venue conditions, shoe quality) and technical factors, and less affected by gender-specific anatomical differences. From an anatomical perspective, women have a relatively wide pelvis, which increases the Q angle between the femur and tibia. This geometric structure increases the valgus stress of the knee joint. At the same time, women's joint capsules and ligaments are relatively loose. Although this feature is conducive to the expansion of certain ranges of motion, it may also reduce the mechanical stability of the joint. Women have relatively small muscle mass, especially the strength ratio of the quadriceps and hamstrings may be unbalanced. This muscle strength imbalance is an important risk factor for knee injuries. The incidence of hip/groin strain is relatively higher in men (17.7% vs 13.4%), which may be related to the more frequent explosive movements and greater range of motion in men in basketball. Male athletes tend to have stronger lower limb explosive power, which puts greater load on the muscles around the hip joint during rapid starts and changes of direction. The gender distribution of upper limb injuries is relatively uniform, which may reflect the high degree of standardization of upper limb movements in basketball and the relatively limited impact of gender differences on upper limb injury patterns. However, it is worth noting that back injuries tend to be slightly higher in women (10.8% vs 8.2%), which may be related to the relatively weak core muscle strength of women and gender differences in spinal stability. These gender differences are of great significance for developing personalized injury prevention strategies. For female athletes, the focus should be on strengthening knee stability training and improving neuromuscular control ability; while for male athletes, more attention should be paid to controlling overall injury risk and cultivating safety awareness. The 64.6% injury incidence found in this study is at a high level among similar international studies, and this finding deserves further analysis. Compared with the results of Mclay et al. (2012) in Australia (58.2%), the injury incidence of college students in Henan Province was about 6 percentage points higher. The injury incidence found by Owoeye et al. (2020) in Canadian youth basketball players was 55.8%, which is also lower than the results of this study. The latest study by Stojanović et al. (2024) in Serbia reported an injury incidence of 62.3%, which is closer to the results of this study. This difference may be related to multiple factors: first, differences in research methods and injury definitions may lead to incomparable results; second, sports infrastructure, medical security levels and sports culture in different regions may have an impact on injury occurrence and reporting; finally, differences in the characteristics of the survey population, including technical level, physical fitness and sports experience, may also be important influencing factors. The high incidence of basketball injuries among college students in Henan Province may be related to the following factors: First, the sports foundation of college students in my country is relatively weak, and their physical fitness and sports skills vary, which provides objective conditions for the occurrence of injuries. Sekine et al. (2022) found similar problems in their study of Japanese college basketball players, suggesting that college basketball players in Asia may face similar challenges. Secondly, the imperfections of campus sports facilities and medical security systems may lead to minor injuries not being treated promptly and effectively, and then developing into more serious injuries. In addition, students' lack of knowledge about sports injury prevention is also a factor that cannot be ignored.",
    "From a public health perspective, such a high injury rate not only threatens individual health, but is also likely to have an important impact on the entire education system and social medical resource allocation. Mack et al. (2024) pointed out in their study of NBA players that even in the professional basketball environment with the best medical conditions, injuries remain a major challenge, which Lower limb injuries accounted for 65.5% of total injuries, a proportion that is highly consistent with international research results, confirming the high load characteristics of basketball on the lower limb system. Prieto-González et al. (2021) reported a 63.7% lower limb injury rate in a comprehensive systematic review, which is almost completely consistent with the results of this study. Minghelli et al. (2022) found a similar distribution pattern (66.2%) among Portuguese basketball players, further confirming the dominance of lower limb injuries in basketball. From a biomechanical perspective, jumping, landing, sudden stops, and changes of direction in basketball exert enormous loads on the lower limb joints. Krosshaug et al. (2007) showed that the impact force on the knee joint during landing can reach 6-8 times the body weight, and this high load is an important cause of lower limb injuries. Doherty et al. (2014) further quantified this load characteristic in a large- scale meta-analysis, pointing out that typical movements in basketball are the main mechanism leading to ankle injuries. Ankle sprain is the most common type of injury (29.4%), and its mechanism of occurrence is mainly related to the imbalance of posture control when the foot lands. McKay et al. (2001) pointed out that the ankle is most likely to be sprained when landing in an inversion position, which is extremely common in basketball. Herzog et al. (2019) found in a study of NBA players that about 26% of players suffer ankle injuries every season, confirming the high incidence and recurrence of ankle injuries. Kofotolis and Kellis (2007)'s prospective study further confirmed the high incidence of ankle injuries among female basketball players. Although the incidence of knee injuries is relatively low (20.1%), their long-term impact on athletes is more serious, often requiring a longer recovery time and may leave permanent functional impairment. Khan et al. (2018) found in a study of professional basketball players that lower limb stress injuries had the most significant negative impact on athletic performance, emphasizing the importance of knee joint protection. This injury distribution pattern provides important guidance for the formulation of prevention strategies: first, emphasis should be placed on ankle stability training, including proprioception training and balance improvement; second, strength training of the muscles around the knee joint needs to be strengthened, especially the coordinated development of the quadriceps and hamstrings; finally, correct landing technique teaching should be promoted to help athletes master a safe landing posture. The significant increase in the risk of knee injuries in women (OR=2.06) is an important finding of this study. This result is highly consistent with the classic study of Arendt and Dick (1995), further confirming the existence of gender-specific injury patterns. Beynnon et al. (2014) reported a similar gender difference ratio (OR=2.3) in a large-scale multi-sport study, which provided strong support for the results of this study. Tisano et al. (2022) also found a high incidence of knee injuries in female basketball players in a large sample study of pediatric emergency departments, especially in late adolescence. From an anatomical perspective, women have a wider pelvis and a larger Q angle, which may increase the biomechanical load on the knee joint. From a physiological perspective, cyclical changes in estrogen levels may affect the mechanical properties of the ligament, especially during specific phases of the menstrual cycle. From a neuromuscular control perspective, women tend to show a tendency to valgus their knees when landing, a phenomenon known as \"dynamic knee valgus\" that is a typical risk factor for anterior cruciate ligament injury. This finding emphasizes the importance of gender- specific prevention strategies. For female athletes, neuromuscular control training should be strengthened, including standardized training of jump landing techniques, core stability training, and lower limb strength and balance development. Hewett et al. (1999) have shown that targeted neuromuscular training can significantly reduce the risk of knee injuries in female athletes. Leppänen et al. (2017) further confirmed the importance of early intervention in their study of adolescent athletes.",
    "This study showed that acute injuries (70.2%) were significantly more common than chronic injuries (29.8%), a feature that reflects the characteristics of college basketball. Skazalski et al. (2021) found a similar distribution of proportions in a study of professional basketball players (72.1% vs 27.9%), indicating that this injury pattern has a certain degree of universality. Rodas et al. (2019) analyzed in detail the different characteristics and recovery patterns of acute and chronic injuries in a 9-year prospective study. Acute injuries often occur in situations of high- intensity confrontation and improper execution of technical movements, while chronic injuries are related to long-term accumulation of training load and insufficient recovery. For the prevention of acute injuries, the focus should be on the standardization of technical movements and the use of protective equipment. Neuromuscular training has been proven to be an effective means of preventing acute injuries, especially in preventing anterior cruciate ligament injuries. In addition, the improvement of venue conditions, the standardization of sports equipment, and the cultivation of safety awareness are also important preventive measures. The prevention of chronic injuries needs to start with training load management and recovery strategy optimization. A reasonable training plan should include appropriate load increments, sufficient recovery time, and personalized rehabilitation training. The study by Weiss et al. (2017) emphasized the important role of training load monitoring in the prevention of chronic injuries. In addition, nutritional support and sleep quality are also important factors affecting the occurrence of chronic injuries. This study is the first to systematically analyze the impact of basketball injuries on college students' daily life and academic performance. The results showed that 38.4% of injuries affected students' class attendance and 20.1% of injuries affected laboratory work. These data reveal the significant impact of sports injuries on academic activities. Pappas et al. (2011) also focused on the impact of basketball injuries on daily activities of children and adolescents in a study of emergency departments in the United States and found a similar pattern of functional limitations. This impact is not only reflected in direct functional limitations, but may also have indirect effects through psychological factors. Psychological reactions such as pain, anxiety, and depression may further affect students' learning efficiency and quality of life. Therefore, the management of sports injuries should not only focus on physical rehabilitation, but also pay attention to mental health support. From the perspective of education management, this finding emphasizes the importance of establishing a sound campus sports medical security system. Colleges and universities should be equipped with professional sports medicine personnel and establish a full-process management system from pre-injury screening to post-injury rehabilitation to minimize the negative impact of sports injuries on students' academic development. There are several limitations of this study that need to be explained. First, a cross-sectional design cannot establish a causal relationship, and prospective cohort studies are needed in the future to verify the relevant findings. The prospective studies of Owoeye et al. (2020) and Pasanen et al. (2017) provide important methodological references in this field. Second, the sample is limited to Henan Province, and the extrapolation of the results may be limited. Third, injury information mainly relies on self-reports, which may be subject to recall bias. Finally, the study failed to explore in depth the impact of psychological factors, training methods, and environmental factors on the occurrence of injuries, which are important directions for future research. Future research should focus on the following aspects: first, conduct multicenter, prospective cohort studies to establish more reliable causal relationships; second, deeply explore the psychological and social factors that cause injuries and establish a more comprehensive injury prediction model; third, develop and verify personalized preventive intervention strategies for different populations; fourth, evaluate the cost- effectiveness of existing preventive measures and provide an economic basis for policy making. This study, through a systematic epidemiological investigation of basketball injuries among college students in Henan Province, deeply revealed the inherent laws and complex mechanisms of sports injuries in this specific population. The results not only provide important scientific evidence for understanding the nature of basketball injuries, but also lay a solid foundation for building a prevention and intervention system based on evidence-based medicine. The high injury incidence rate of 64.6% warns us that basketball injuries have become an important public health issue that affects the physical and mental health and academic development of college students, and requires the coordinated attention and systematic intervention of education departments, medical institutions and sports organizations.",
    "The significantly increased risk of knee injuries in women reveals the necessity of gender-specific prevention strategies. This finding not only has important clinical significance, but also reflects the application value of the concept of precision medicine in sports injury prevention and control. The dominance of acute injuries suggests the urgency of standardized technical teaching and safety awareness training, while the profound impact of chronic injuries on academic performance highlights The value of this study goes beyond simple injury statistics. It provides important theoretical support and practical guidance for promoting the scientific development of sports in my country's colleges and universities, optimizing health promotion strategies for young people, and improving the sports injury prevention and control system. It marks an important shift in basketball injury research from empirical observation to scientific, systematic, and precise directions."
]