[
    "2020 4th International Workshop on Renewable Energy and Development (IWRED 2020) IOP Publishing IOP Conf. Series: Earth and Environmental Science 510 (2020) 022024 doi:10.1088/1755-1315/510/2/022024 Abstract. In order to study the restriction and promotion relationship of the energy revolution to the rising provinces in central China-Henan Province, this article builds an energy revolution consumption model based on the multi-dimensional development data of Henan Province from 2010 to 2018, and predicts Henan’s GDP growth from 2020 to 2035, energy demand, changes in primary energy structure, and CO2 emissions. The results show that: under the scenario of rapid economic growth, the total GDP of Henan Province in 2035 is 11561.1 billion yuan; in the scenario of benchmark growth, the total GDP is 11018.5 billion yuan. The path of high- quality rise in Henan Province may be between SE21 and SE25. In 2035, the proportion of renewable energy will increase to 24.4%. The peak of Henan's carbon emissions may appear in 2021, with total carbon emissions between 49.577 million to 50 million tons. Based on the above data, Henan Province should take the road suitable for the development of regional energy revolution and promote the high-quality rise of Henan Province. The energy revolution is related to economic and social development. Under the strategy of the rise of the central part of the country, promoting the energy production and consumption revolution is a long- term task. Henan Province is accelerating the development from large agricultural industrialization to large industrial industrialization. How to achieve the mutual coordination of economic development and energy utilization, and the overall coordination of economic and social development of Henan Province with population, resources, and the environment are important difficulties to be resolved urgently. Studying the interrelationship between the energy industry and economic development in Henan Province and establishing an energy consumption model can provide scientific basis for economic and social development in Henan Province [1]. Exploring the situation of carbon dioxide emissions caused by energy consumption during the economic rise of Henan Province can control the peak of carbon dioxide emissions, coordinate energy-environment-economic constraints, and promote the sustainable development of Henan Province. 2. The connotation and mechanism of the energy revolution promoting the rise of central China The energy revolution has its inherent mechanism in promoting the high-quality development of the local economy. From an economic perspective, high-quality energy drives high-quality economic development, which significantly improves the efficiency of energy use and greatly improves economic benefits [2]. Due to Henan's coal-based energy structure [3], Henan's energy revolution should comprehensively consider the economic, environmental and social benefits of coal. From an ecological perspective, the energy revolution is driving the transition of high-quality energy to ecological harmony. Henan's energy revolution should start with \"green energy\". From a social perspective, high-quality energy promotes the rise of high-quality, and its ultimate goal is to share development results. As the leading province in the Yellow River Basin, Henan Province is accelerating the construction of Zhengzhou National Central City. This paper models the energy consumption demand through the energy consumption elasticity coefficient ES [4]. The energy consumption elasticity coefficient reflects the proportional relationship between the growth rate of energy consumption and the growth rate of the national economy. The elasticity coefficient of energy consumption indicates that if the economic development accelerates, the economic benefits of energy consumption will become higher, and the elasticity coefficient will become lower. The energy elasticity coefficient is used to predict the energy demand. As long as an elasticity coefficient that is consistent with the actual situation is determined, and then a growth rate is determined, the growth rate and development rate of energy consumption can be calculated to predict the future energy consumption. Based on this, the energy consumption prediction model constructed is as follows. In equations (1) and (2): ES is the elasticity coefficient of energy consumption; GDPn is the GDP of the nth year. Qn is the forecasted energy consumption demand for the nth year; GDP0 and Q0 are the GDP and energy demand of the base year, respectively. At the same time, in order to analyze the increase of carbon dioxide emissions caused by energy consumption, a CO2 emission forecast model was established based on the kaya model. In the formula (3)-(8): EIGDP is the energy consumption intensity, EP is the production energy consumption, ER is the living energy consumption; PP is the primary industry, PS is the secondary industry, PT is the tertiary industry, Si is the energy consumption share of the industry, Ii is the corresponding energy intensity of each industry; EUR is urban living consumption, ERR is rural living consumption, IU is urban disposable income, IR is rural disposable income, eU and eR are urban and Per capita energy consumption in rural areas, RU is the urbanization rate of the population; CIGDP is the carbon intensity.",
    "According to the forecast model of energy consumption demand, the parameters affecting energy consumption demand and CO2 emissions include: GDP, industrial structure, urbanization, energy efficiency, per capita income, and living energy. In the context of the energy revolution and the rise of central China, these parameters include high-speed growth scenarios, baseline growth scenarios, and low-speed growth scenarios [5]. Henan Province has a total of 144 different rising paths. Considering that GDP is the main measure for the rise of Henan Province, three key sub-scenarios of high-speed GDP growth, baseline growth, and low-speed growth are selected for analysis, and the energy consumption demand scenarios corresponding to the 12 rising paths of SE11-SE34 are studied, as follows in Table 1. This article uses the GDP, industrial structure, urbanization, energy efficiency, per capita income, and living energy data of Henan Province from 2010 to 2018 as the base period conditions for simulation and analysis. GDP is the main measure for the rise of Henan Province. It predicts and analyzes high-speed GDP growth, baseline growth, and low-speed growth, and obtains the total GDP of Henan Province's rise from 2020 to 2035, as shown in Table 2. From the above predictions, it can be known that under the scenario of rapid growth, the total GDP of Henan Province in 2035 will be 11561.1 billion yuan. Under the benchmark growth scenario, the total GDP of Henan will be 11018.5 billion yuan. In the context of low-speed growth, the total GDP of Henan Province will be 9390.6 billion yuan. In order to achieve the rise of Henan Province, Henan's GDP growth rate should maintain the growth rate above the baseline scenario. 4.2. Prediction and analysis of the rising energy demand in Henan Province The forecast results of energy consumption of the rising path of SE11-SE34 under different growth scenarios are shown in Table 3. This article analyzes the scenario of high economic growth. Under the SE11 path, that is, under the background of high industrial structure, high-speed urbanization, substantial improvement in energy efficiency, high per capita income growth, and rapid growth in domestic energy demand, it will reach 238.96 million tons tce in 2034; The SE12 path is based on the development of the SE11 energy efficiency baseline scenario and will reach 257.9 million tons tce in 2035; SE13 is based on the SE11 and the industrial structure is not adjusted and will reach 241.41 million tons in 2035; The SE14 path is based on the SE11, the industrial structure and energy efficiency are developed according to the benchmark scenario, and the energy consumption will reach 260.61 million tons tce in 2035. Other paths can also be analyzed in this way. Henan is a province with large coal consumption. The primary energy structure is uneven, and new energy needs to be vigorously developed [6],assuming that the share of natural gas and renewable energy will increase by 0.4% in 2020,as shown in Table 4. Combining economic benchmark growth, high growth, low growth with the energy revolution, and energy benchmark development, a total of six energy carbon emissions are obtained, the following analysis uses economic benchmark growth as an example. In the context of economic benchmark growth, if Henan Province develops according to the energy benchmark scenario, there are two scenarios of carbon dioxide emissions under five different rising paths: the peak carbon emissions of SE22, SE23, SE24, and SE25 are 2021; and the carbon emissions of the SE21 path continue to decline. With a combination of economic baseline growth and the energy revolution, carbon dioxide emissions are roughly the same as under the baseline scenario. In summary, it can be seen that the peak carbon emissions of Henan Province may appear in 2021, and the total carbon dioxide emissions are between 49.577 million to 50 million tons. In the context of the energy revolution and high economic growth, carbon dioxide emissions in Henan Province have been declining, which is conducive to the optimization of the energy structure. Based on multi-dimensional development data from 2010 to 2018, this paper simulates and predicts the role of the energy revolution in promoting the rise of the central region-Henan Province, the research conclusions are as follows. (1) Under the scenario of rapid economic growth, the total GDP of Henan Province will be 11561.1 billion yuan in 2035; under the scenario of economic benchmark growth, the total GDP of Henan Province will be 11018.5 billion yuan; under the scenario of low economic growth, Henan's GDP will be 9390.6 billion yuan. In order to realize the rise of Henan Province, Henan Province's GDP should maintain a growth rate above the baseline scenario.",
    "(2) Against the background of the new normal economy, it is more likely that Henan's economy will develop according to the baseline scenario. The path of Henan's high-quality rise may be between 2020 4th International Workshop on Renewable Energy and Development (IWRED 2020) IOP Publishing IOP Conf. Series: Earth and Environmental Science 510 (2020) 022024 doi:10.1088/1755-1315/510/2/022024 SE21 and SE25. The vigorous improvement of energy efficiency and the heightened industrial structure will have a significant impact on Henan's energy consumption. In 2035, the total energy consumption of Henan will be within 260.61 million tons of tce. (3) Under the benchmark development scenario, Henan Province's renewable energy share will reach 23.9% in 2035, achieving the goal of clean development. In the context of the energy revolution, renewable energy can account for 24.4% in 2035. (4) According to Henan Province’s energy consumption scenario and carbon dioxide emissions projections, Henan’s peak carbon emissions may occur in 2021, with total carbon dioxide emissions between 49.577 and 50 million tons. Under the circumstances of the energy revolution and high economic growth, carbon dioxide emissions in Henan Province will continue to decline, which is conducive to the optimization of the energy structure. In summary, the energy revolution promotes the rise of high-quality development in Henan. It is necessary to properly handle the practical problems faced by the development of coal, oil and gas, electricity, and renewable energy, and build a clean, low-carbon, safe, and efficient energy system based on Henan's energy endowment conditions. Henan Province should start from five aspects of energy consumption, production, technology, system and cooperation [7], combine the energy endowment and regional energy demand characteristics of Henan Province, take the road suitable for the development of regional energy revolution, so as to realize the balanced development of energy environment economy, and finally realize the high-quality rise of Henan Province."
]