[
    "Citation: Zhang, X.; Yu, L.; Xu, X. Study on the Spatial Distribution Characteristics and Poverty Inducements of Poverty-Stricken Villages in Henan Province. Land 2023, 12, 957. https://doi.org/ 10.3390/land12050957 Abstract: With the advancement of “targeted poverty alleviation”, the main problems we face at this stage are analyzing the causes of poverty and preventing poverty-stricken villages from falling back into poverty. Using the last batch of poverty-stricken villages that have been lifted out of poverty, which were announced by the Henan Provincial poverty alleviation and development ofﬁce, as the research object, this research discusses the spatial distribution characteristics of 835 poverty-stricken villages in Henan Province from the perspective of the macro province by combining kernel density analysis and spatial autocorrelation analysis, analyzes their inﬂuencing factors using the least squares linear regression model, and performs a quantitative analysis of their inﬂuencing factors. The results revealed the following: (1) The spatial distribution characteristics of poverty-stricken villages in Henan Province are characterized by signiﬁcant agglomeration. A banded high-density area is formed in the east of Henan Province, with a sub-density area in the west of Henan Province, and it radiates outward with the “dikaryon” as its center. (2) High-density and sub-density areas of poverty-stricken villages are mainly located in ﬂat areas, with spatial dependence on each other. The high-high clustering areas are mainly areas dominated by agricultural economies. The low-low clustering areas mainly have limited agricultural development and rapid urban–rural integration. (3) Geographical locations and socio-economic and basic public services are the main factors affecting poverty in poverty-stricken villages. At the same time, environmental livability is an advantageous condition in areas where poverty-stricken villages are located, of which the Temperature Humidity Index factor is most closely related to the distribution density of poverty-stricken areas. The research results are intended to provide information for the policies and program intervention strategies for poverty reduction and sustainable development in poverty-stricken villages in Henan Province, and this is conducive to consolidating the results of targeted poverty alleviation and preventing a return to poverty. Copyright: © 2023 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). Poverty is a major social issue all over the world. The international community’s long-term goals include eradicating poverty and achieving shared prosperity. Since the establishment of the People’s Republic of China, China has prioritized the development of national infrastructure and alleviating poverty in poverty-stricken villages. China imple- mented the “targeted poverty alleviation” strategy following the 18th National Congress of the Communist Party of China, and the annual poverty reduction population is more than 10 million [1,2]. By the end of 2020, China will complete the task of poverty alleviation in the new era, as scheduled. Under the current standard, 98.99 million rural poverty- stricken people will be lifted out of poverty. According to the World Bank’s international poverty standard, China’s poverty reduction population accounts for more than 70% of the global poverty reduction population in the same period, and poverty alleviation has made outstanding achievements [3,4]. Although China has made remarkable achievements in eradicating extreme poverty, this does not mean it has reached the end of the ﬁght against poverty. With the “targeted poverty alleviation” policy, the country has entered the “post-poverty alleviation era.” Poverty reduction is the main problem we are facing at this stage. The poverty reduction rates in rural areas of China are approximately 20%, and ap- proximately 2 million rural residents may be subjected to poverty reduction. According to the speciﬁc environmental characteristics of poverty-stricken villages, the factors associated with their distribution have been found, and this is conducive to consolidating the results of targeted poverty alleviation and preventing a return to poverty. At the same time, it should be noted that the problem of rural poverty is no longer only reﬂected in an economic aspect; poverty-stricken villages may have more difﬁculties improving their economic and social conditions because of basic services such as transportation, geographical location, and infrastructure construction, thus presenting complex diversity [5,6]. spectives of economics, management, sociology, politics, tourism, ethics, and education. In terms of research content, they have analyzed the spatial geographical distribution charac- teristics of poverty villages in their administrative regions [7,8], the causes of poverty [9,10], and the treatment methods [11–13]. The spatial and geographical distribution charac- teristics of poverty villages have focused on the analysis of local poverty distribution patterns in provinces [14], cities [15], counties [16], and concentrated poverty areas [17,18]. Some scholars have analyzed the distribution characteristics of poverty-stricken villages in karst landforms and mountainous regions from the perspective of geomorphology and regional resources. Poverty-stricken villages tend to gather near township centers and deviate from water sources [19–21]. In terms of analyses of causes of poverty, the causes of poverty are not only the natural environment [10,14], society, and economy [6,14] but also policies [12] and resources [22]. At the same time, the research areas have focused on the poverty-stricken villages in critical counties and towns, and the research scales have focused on the micro level to study the poverty problems of poverty-stricken villages and families [23,24]. Poverty can be solved by formulating new policies and systems, resource utilization, capital intervention, etc. In addition to qualitative research methods, methods using geography, economics, statistics, and other disciplines have also been introduced. For example, the G-TOPSIS model [25], logical regression [26], multi-standard model [27], lin- ear quantitative, mixed model [28], correlation analysis [29], space-time statistics [30], and other methods have been used to study the causes of poverty in poverty-stricken villages. The spatial autocorrelation method is used to analyze the distribution characteristics of poverty-stricken villages, establish a comprehensive evaluation mechanism, and establish an early warning mode to prevent poverty-stricken villages from returning to a state of poverty. However, most of these studies focused on mountainous and hilly areas and were limited to the distribution characteristics at the meso and micro levels; thus, there has been a lack of evaluation and analysis of poverty-stricken villages in plain areas from a macro perspective, and there is a need to assess the development suitability of poverty-stricken villages according to regional characteristics.",
    "As a central agricultural province in China, Henan Province has a vast plain area. Therefore, analyzing the distribution characteristics and development suitability of poverty- stricken villages in Henan Province is necessary. For this purpose, we selected four aspects of indicators, namely, geographical location, socio-economy, basic public services, and environmental livability, to evaluate the development suitability of poverty-stricken vil- lages in Henan Province, clarify the geographical spatial relationship between various indicators and poverty-stricken villages, and deﬁne the relationships between poverty- stricken villages and multiple factors. This will be conducive for helping policymakers and practitioners to formulate effective poverty reduction strategies and increase the synergy between regions to ensure their effectiveness. It has also revealed the characteristics of spa- tial agglomeration and spatial dependence in the distribution of poverty-stricken villages in the plains province, and it expands the basic research on the features of the regional distribution of poverty in China. part area between 31°23'-36°22' north latitude and 110°21/-116°39 east longitude, with a total area of 167,000 square kilometers (Figure 1). It is an important transportation hub and passenger logistics information flow center in China. The terrain of Henan Province is high in the west and low in the east. The Taihang Mountains, Funiu Mountains, Tongbai Mountains, and Dabie Mountains are distributed in a semicircle along the provincial boundary in the north, west, and south. The central and eastern parts are the Huanghai and Huaihai alluvial plains. Plains, mountains, and hills account for 55.7%, 26.6%, and 17.7% of the total area, respectively. Most of Henan Province is in a warm temperate zone, and the south is within a subtropical zone. It belongs to a continental monsoon climate, with a transition from a north subtropical zone to a warm temperate zone. The annual average temperature from the south to the north of the province is 10.5~16.7 °C, and the average yearly precipitation is 407.7~1295.8 mm. The most rainfall occurs from June to August. By the end of 2021, Henan Province had 17 prefecture-level cities, 21 county-level cities, and 82 counties under its jurisdiction, with a permanent population of 98.83 million, including 55.79 million urban residents and 43.04 million rural residents, and a GDP of CNY 5888.741 billion and an annual per capita GDP of CNY 59,410. Henan Province, China’s largest grain production province, has a cultivated area of 6.871 million hectares, many rural residents, and a high proportion of residents engaged in agricultural labor [31]. Due to a lack of infrastructure, reduced resources, limited access to education, and limited markets, some rural settlements cannot provide a good development foundation for enterprises, resulting in difficulties with employment for residents. Residents rely mainly on farming as their primary source of income, ultimately becoming poverty-stricken. The number of poverty-stricken people and villages in Henan Province is far more than in the southeast coastal areas. Henan Province is ina plain, unlike other regions where poverty-stricken villages are mainly distributed in mountains and hills. The poverty-stricken villages are represented as point-like elements on the provincial scale; therefore, in the study, the geographical spatial coordinates of the poverty-stricken villages are used to replace the poverty-stricken villages with speciﬁc regular shapes. The last batch of 835 poverty-stricken villages that have been lifted out of poverty, announced by the Henan provincial poverty alleviation and development ofﬁce, is the research object, involving approximately 600,000 impoverished people. The relevant data from poverty- stricken villages were obtained by searching the Henan Provincial Bureau of Planning and Natural Resources website and other methods. On this basis, the POI (points of interest) spatial location of each poverty-stricken village in a Baidu Map was obtained with the help of the software Geosharp, and location and coordinate picking (the coordinate picking point is subject to the location of the village committee of the poverty-stricken village, December 2022) were carried out. The data selected in the study covered geographical location, socio-economy, basic public services, environmental livability (Figure 2), and speciﬁc names and sources (Table 1). These parameters were gathered from various sources and were processed and converted into raster data of 30 × 30 m for convenient handling using ArcMap 10.8 software. Taking 835 poverty-stricken villages in Henan Province as the research object, this paper discusses their geographical distribution characteristics about the inﬂuencing factors. First, the data from poverty-stricken villages in Henan Province were processed. The geographical distribution characteristics of poverty-stricken villages were analyzed using kernel density analysis, global autocorrelation, and local autocorrelation. Then, the distance to the county, distance to a city, distance to a river, primary industry contribution rate, urbanization degree, cooperatives drive capacity, road network density, distance to a fast road, distance to a slow road, hydrology index (HI), temperature humidity index (THI), days of suitable temperatures (a total of 12 inﬂuencing factors) were divided into four dimensions, namely, geographical position, socio-economy, basic public services, and environmental livability. Finally, the relationships between the geographical distribution characteristics of poverty-stricken villages and the various inﬂuencing factors were explored using the least squares linear regression model. The overall framework of this study is shown in Figure 3.",
    "Kernel density analysis is a non-parametric surface density estimation method that estimates the density value of spatial points with the help of dynamic cells, indicating that a geographical event has a high probability of occurrence in an area with a high spatial point density and a low probability of occurrence in an area with a low spatial point density [37]. This paper analyzes the spatial density distribution of poverty-stricken villages in Henan Province with the help of kernel density analysis. The expression of kernel density estimation is: where k () is the kernel density equation of the poverty-stricken village and h is the band- width, which is the width (h > 0) of the surface, with x as the origin extended in space. The value of h will affect the smoothness of the graph. In the study, the value of h was set at 70,000, x was the location of the poverty-stricken villages, xi was the village within the center of x, and n was the number of all poverty-stricken villages within the threshold. The kernel density value was directly proportional to the density of the distribution of the poverty-stricken villages. The higher the kernel density value, the higher the con- centration degree of the distribution of the poverty-stricken villages and the stronger the spatial aggregation. The smaller the kernel density value, the thinner the distribution of the poverty-stricken villages and the weaker the spatial aggregation. The average nearest neighbor index is a geographical metric used to describe the proximity of point objects in a geographic space [38,39]. According to the proximity of point elements in the area, the geographical distribution types of the poverty-stricken villages in Henan Province could be classiﬁed as uniform, random, or clustered. The nearest point index serves as the discrimination basis, and its formulas are as follows: where R denotes the ratio between the actual and theoretical nearest distances, r1 denotes the actual nearest distance, rE denotes the theoretical nearest distance, D denotes the point density, n denotes the total number of research objects, and A is the research area. When R = 1, it indicates that the poverty-stricken villages are randomly scattered throughout the space; R > 1 indicates that the poverty-stricken villages tend to be uniformly dispersed spatially; and R < 1 indicates that the poverty-stricken villages tend to be spatially clustered. Local spatial autocorrelation analysis can represent the degree of spatial clustering of similar attribute values between spatial units and neighboring units [40,41]. This research used the local univariate spatial autocorrelation model to measure the spatial pattern correlation between the nuclear density values of the poor villages. A LISA plot was used to reﬂect the signiﬁcance level of the local spatial autocorrelation. Using the spatial position i, the calculation formula for the index Ii is: where wij is the element of the spatial weight matrix, xi and xj are the observed values of the standardized space units, and x is the average value. The univariate local Moran’s I index Ii value is −1~1. When Ii is a positive value, the attribute values of two geospatial units are positively correlated, indicating spatial clustering phenomena, which can include high-high clustering or low–low clustering. When Ii is a negative value, the attribute values of two geospatial units are negatively correlated, indicating spatial dispersion or differences, which can include high values surrounded by low values (high-low) or low values surrounded by high values (low-high). In this study, a positive value of Ii indicated the convergence of high-density areas or low-density areas in the distribution of the poverty-stricken (high-high or low-low) villages. A negative value of Ii indicated that the poverty-stricken high-density regions were surrounded by low-density poverty- stricken areas or the low-density poverty-stricken areas were surrounded by high-density poverty-stricken regions. The least squares linear regression model is a statistical analysis method used to study whether there is a linear relationship between independent variables and various inﬂuencing factors. It is used to accurately express the internal relationships between related variables and to analyze the inﬂuencing factors quantitatively [42]. The calculation formula is: where yi is the dependent variable of the sample i, β0 is the intercept constant, βp is the regression coefﬁcient, xpi is the p-th independent variable of the sample i, εi is the random error subject to a normal distribution, and p is the number of independent variables.",
    "The core density analysis tool in ArcMap10.8 software was used to analyze the spatial distribution of the poverty-stricken villages in Henan Province. The results showed that (Figure 4) the spatial distribution characteristics of the poverty-stricken villages showed signiﬁcant agglomeration. Taking the west of Shangqiu City and the northeast of Puyang City as the core and radiating outward, a banded high-density area was formed in the east of Henan Province. According to the nuclear density values, the high-density areas had 0.019–0.024 poverty-stricken villages per square kilometer. With the central part of Luoyang City and the western part of Pingdingshan City as the core, a sub-density area was formed in the western part of Henan Province. The distribution density decreased from the east and west to the middle of Henan Province. The average nearest neighbor tool in ArcMap10.8 was used to analyze the geographical distribution of the poverty-stricken villages in Henan Province, with the nearest neighbor index R ≈ 0.47 < 1. The index result showed that the poverty-stricken villages in Henan Province were clustered in a spatial distribution (Figure 5). The p-value was less than 0.01, and the z-score was less than −2.58, indicating that the probability that the pattern was created by random chance was small (less than one percent). To further explore the correlation patterns of the poverty-stricken villages in Henan Province and test the correlations between the regional poverty levels and the neighboring regional poverty levels, GeoDa 1.20 software was used to analyze the Spatial distribution density of the poverty-stricken villages. From the perspective of local spatial autocorrelation (Figure 6), the Moran’s I index of poverty-stricken villages was 0.614, indicating that the spatial distribution of the poverty-stricken villages tended to be a spatial agglomeration distribution. There was a signiﬁcant positive correlation where poverty-stricken villages were spatially dependent, where it would be easy to form impoverished areas. The p-value of all regions was less than 0.05, indicating that all spatial patterns were unlikely to be generated from random processes. There were no high-low and low-high clustering areas with poor village densities. The high-high clustering areas with poor village densities were mainly concentrated in central Luoyang, eastern Pingdingshan, central Nanyang, western Shangqiu, eastern Kaifeng, and eastern Puyang, that is, the number of poor villages in the neighboring areas was large and the number of poor villages in the area was also large, meaning they belonged to the “poverty hotspot area”. Because these areas have ﬂat terrain and are dominated mainly by agriculture, their economic income and urbanization rate are low. The low-low clustering areas of the poverty-stricken villages were primarily located in Jiyuan City, Zhengzhou City, Jiaozuo City, Xuchang City, Luohe City, and Zhumadian City in the central part of Henan Province, that is, the number of poor villages in the neighboring areas was small and the number of poor villages in the area was also small, meaning they belonged to the “poverty cold spot area”. Because the terrain is higher than that in the surrounding areas, agricultural development is limited, and thus the area relies on urban resources, promoting urban–rural integration and convenient transportation, and therefore, The least squares linear regression model was used to analyze the inﬂuencing factors of the spatial distribution of the poverty-stricken villages in Henan Province. First, the statistical data of the inﬂuencing factors were processed as dimensionless. The result of the residual histogram showed (Figure 7) that the residual mean was close to zero, the standard deviation was close to one, and the data presented a normal distribution, which means that the linear regression model of the inﬂuencing factors and the spatial distribution of the poverty-stricken villages was correct. The beta value was the dimensionless regression coefﬁcient, representing the correlation value of the independent variable and dependent variable. According to the p-value, the impacts of the distance to the County, distance to a city, primary industry contribution rate, urbanization degree, cooperatives drive capacity, road network density, distance to a fast road, distance to a slow road, THI, and days of suitable temperatures on the spatial distribution of the poverty-stricken villages were signiﬁcant, while the distance to a river was not. The primary industry contribution rate, road network density, distance to a fast road, HI, urbanization degree, and cooperatives drive capacity were negatively correlated with the spatial distribution of the poverty- stricken villages. The distance to the County, distance to a city, distance to a river, distance to a slow road, THI, and days of sustainable temperatures were positive correlated with the spatial distribution of the poverty-stricken villages, and the THI had the closest relationship with the distribution density of the poverty-stricken villages (Table 2).",
    "Figure 6. Local autocorrelation of kernel density in the spatial distribution in the poverty-stricken villages: (a) Moran’s I scatterplot; (b) LISA signiﬁcance map; and (c) LISA cluster map. According to the results of the regression analysis, the p-value of the distance to a river was greater than 0.05, which was not signiﬁcant. Therefore, after removing this factor, the spatial relationship between the distribution density of the poverty-stricken villages in Henan Province was analyzed from four dimensions (geographical position, socio-economy, basic public services, and environmental livability) to ﬁnd out the factors or potential advantages that affected the development of the poverty-stricken villages (Figure 8). The results showed that environmental livability positively correlated with the distribution density of the poverty-stricken villages. The higher the distribution density of the poverty- stricken villages, the better the livability of the regional environment. Geographical location, socio-economy, basic public services, and the distribution density of the poor villages were negatively correlated, and the number of poor villages in areas with convenient transportation conditions, high public service levels, and fast economic development speed was small. Improving transportation and upgrading basic services would have a good effect on poverty alleviation and development in poor villages, and the development of the County’s economy could also improve the economic levels of the poor villages around the County. The interaction results of the four aspects of the factors showed a dual-factor-enhanced relationship between the factors. Figure 8. Scatter matrix of the spatial correlation between the four dimensions of the inﬂuencing factors and the poverty-stricken villages. The spatial distribution of the poor villages in Henan Province showed signiﬁcant agglomeration, forming high-density and sub-density areas in the east and west of Henan Province, respectively. Combined with the elevation data of Henan Province, it was found that the poor villages were more distributed in ﬂat areas, which is different from the distribution of poor villages in Fujian, Guizhou, and other places in mountainous areas that have high altitudes, signiﬁcant terrain undulation, poor trafﬁc conditions, poor production and development conditions, and more difﬁcult access to resources and services, resulting in difﬁculties with village economic development [21]. Henan is located in central China and is a major grain-producing area. However, due to its large population and insufﬁcient per capita arable land area, the economic incomes of areas mainly relying on arable land are lagging, resulting in many poverty-stricken villages. Large-scale agriculture has been abandoned in some areas with uneven terrain, and economies mainly focused on secondary and tertiary industries have developed. Alternatively, relying on resource-based cities to promote urban–rural integration and enhance the radiative driving ability of cities to rural areas has rapidly increased residents’ incomes and reduced poverty. From the perspective of local spatial autocorrelation, the poverty-stricken villages formed a clustered distribution in central Luoyang, eastern Pingdingshan, central Nanyang, western Shangqiu, eastern Kaifeng, and eastern Puyang, indicating that the poverty areas were concentrated and no longer independent of each other. This is due to historical effects, such as the past land-use patterns, economic and social factors, such as the lack of investment and support from government and non-government organizations, limited access to basic services, and limited economic opportunities, resulting in insufﬁcient employment and income generation of the residents, which makes it difﬁcult to break the cycle of poverty. Taking the poverty-stricken villages in Henan Province as the research object, the spatial agglomeration characteristics of the distribution of the poverty-stricken villages in the plains areas were revealed, and most existing studies have focused on contiguous impoverished areas that tended to be mountainous areas, high-altitude areas, and alpine areas with greater poor population distribution. From the perspective of a single-factor impact, the farther a poverty-stricken village is from the County and a city, the more poverty-stricken the village will be. This is mainly because the farther the village is from a city’s center, the more likely it is that the external transportation and sales of agricultural and sideline products will be restricted, and the farther a village is from a city, the more limited resources and services become, with fewer employment opportunities, lower levels of education, and the poorer infrastructure. In addition, there are relatively few jobs in the region, and the incomes of agricultural workers are small. They cannot enjoy an area’s economic center’s service radiation and economic drive. The large plains area in Henan Province is very conducive to the construction of water conservancy projects, effectively improving the agricultural production environment and enabling villages to reduce their dependence on rivers, and thus, agriculture is no longer utterly dependent on the direct irrigation of waterways. Henan Province has achieved good results for irrigation according to the scientiﬁc guidance of rainfall every year, and so the impacts of the river factors on the poverty-stricken villages have yet to show obvious signiﬁcance. Villages are still distributed along the river in mountainous areas and keep close contact with the river. Under the inﬂuence of elevation, undulation, slope, and other terrain variations, disaster risk has become the main element affecting the distribution of the poverty-stricken villages [43,44].",
    "Geographic position, socio-economy, and basic public services were negatively cor- related with the distribution density of the poverty-stricken villages in Henan Province. Geographic location can play an essential role in poverty. For example, rural areas are often more likely to fall into poverty due to geographical location constraints than urban areas are. The socio-economy is also an essential factor in poverty. Areas with low eco- nomic development, unemployment, and weak social safety nets may experience higher poverty levels. Basic public services can also affect poverty. Inadequate access to these services will limit economic opportunities, exacerbate health problems, and lead to a cycle of poverty. Environmental livability was positively correlated with the distribution density of the poverty-stricken villages. This indicated that areas with a high distribution density of poverty-stricken villages had higher livability, mainly due to slow development and low urbanization rates, resulting in better ecological environments and suitable climate conditions. Poverty-stricken villages can use this as a basis to develop ecotourism and health vacation industries, attract external investment, and create employment opportu- nities and incomes. Striving to achieve mutual promotion between ecological protection and poverty eradication while enhancing infrastructure construction in poverty-stricken villages and improving facilities such as roads, electricity, and clean water supplies can help attract enterprises to come to the area and create employment opportunities. Supporting agricultural productivity through investment in irrigation, mechanization, and access to credit can help boost the local economy by increasing the quantity and quality of crops and creating value chains. The factors that cause poverty in rural or poverty-stricken villages may be complex and multidimensional. In analyzing poverty-stricken villages, four critical factors, namely, geographical position, socio-economy, basic public services, and environmental livability, were selected for analysis, ignoring the impacts of education, medical care, capital support, and politics. The lack of opportunities for receiving quality education in poverty-stricken villages leads to the inability of poverty-stricken villagers to develop the skills needed to obtain good jobs or to engage in entrepreneurship. Limited access to medical care makes it difﬁcult for villagers to maintain their health and productivity. Political corruption and social inequality will also lead to poverty in villages. However, if the government takes appropriate policies and measures, it will achieve signiﬁcant results. In future research, we should complement the relevant inﬂuencing factors. This study took 835 poverty-stricken villages in Henan Province as the research object, analyzed the spatial distribution characteristics and development suitability of these poverty-stricken villages, and drew the following main conclusions: (1) The spatial distribution characteristics of the poverty-stricken villages showed signiﬁcant agglomeration. With the west of Shangqiu City and the northeast of Puyang City as the core, a banded high-density area was formed in the east of Henan Province. With the central part of Luoyang City and the western part of Pingdingshan City as the core, a sub-density area was formed in the west of Henan Province. It radiated outward with the “dikaryon” at the center. (2) Poverty-stricken villages’ high-density and sub-density areas were mainly dis- tributed in ﬂat areas. The poverty-stricken villages were spatially dependent and no longer independent from each other. High-high clusters distributed in the poverty-stricken villages were mainly concentrated in central Luoyang, eastern Pingdingshan, central Nanyang, western Shangqiu, eastern Kaifeng, and eastern Puyang, and they were dominated by agri- cultural economies. Low-low clusters were mainly concentrated in Jiyuan City, Zhengzhou City, Jiaozuo City, Xuchang City, Luohe City, and Zhumadian City, which have limited agricultural development and rapid urban–rural integration. (3) The primary industry contribution rate, road network density, distance to a fast road, HI, urbanization degree, and cooperatives drive capacity were negatively correlated with the spatial distribution of the poverty-stricken villages. The distance to the County, distance to a city, distance to a river, distance to a slow road, THI, and days of sustainable temperatures were positively correlated with the spatial distribution of the poverty-stricken villages. Geographical location, socio-economy, and basic public services are the leading causes of poverty in poverty-stricken villages while environmental livability is an advan- tageous condition in impoverished village areas, and the THI factor is the most closely related factor to the distribution density of the poverty-stricken villages. Author Contributions: Conceptualization, L.Y. and X.Z.; methodology, X.Z. and X.X.; software, X.X.; validation, X.X.; formal analysis, X.Z. and X.X.; investigation, L.Y. and X.Z.; resources, X.Z.; data curation, L.Y.; writing—original draft preparation, L.Y.; X.Z. and X.X.; writing—review and editing, X.Z. and X.X.; visualization, X.X.; supervision X.X. and L.Y.; contact author, X.X.; project administration, L.Y., X.Z. and X.X.; funding acquisition, L.Y. All authors have read and agreed to the published version of the manuscript.",
    "Funding: This research was funded by (1) the Henan Province Science and Technology Research Pro- gram, project number: 162102310078, project title: Research on the Organic Protection and Utilization of the Architectural Environment around the Historical and Cultural Heritage; and (2) the Henan Province’s key R&D and promotion project (scientiﬁc and technological breakthrough), project num- ber: 232102320175, project title: the research on the function improvement strategy of historical blocks in the perspective of urban organic renewal. Conﬂicts of Interest: The authors declare no conﬂict of interest. The funders had no role in the design of the study; in the collection, analyses, or interpretation of the data; in the writing of the manuscript; or in the decision to publish the results."
]