[
    "Henggang Zhang 1,† , Chenhui Zhu 1,† , Tianyu Jiao 1, Kaiyue Luo 1,2 , Xu Ma 1,* and Mingyu Wang 1 Citation: Zhang, H.; Zhu, C.; Jiao, T.; Luo, K.; Ma, X.; Wang, M. Analysis of the Trends and Driving Factors of Cultivated Land Utilization Efficiency in Henan Province from 2000 to 2020. Land 2024, 13, 2109. https://doi.org/ 10.3390/land13122109 Abstract: Amid persistent global food security challenges, the efficient utilization of cultivated land resources has become increasingly critical, as optimizing Cultivated Land Utilization Efficiency (CLUE) is paramount to ensuring food supply. This study introduced a cultivated land utilization index (CLUI) based on Fractional Vegetation Cover (FVC) to assess the spatiotemporal variations in Henan Province’s CLUE. The Theil–Sen slope and the Mann–Kendall test were used to analyze the spatiotemporal variations of CLUE in Henan Province from 2000 to 2020. Additionally, we used a genetic algorithm optimized Artificial Neural Network (ANN) and a particle swarm optimization- based Random Forest (RF) model to assess the comprehensive in-fluence between topography, climate, and human activities on CLUE, in which incorporating Shapley Additive Explanations (SHAP) values. The results reveal the following: (1) From 2000 to 2020, the CLUE in Henan province showed an overall upward trend, with strong spatial heterogeneity across various regions: the central and eastern areas generally showed decline, the northern region remained stable with slight increases, the western region saw significant growth, while the southern area exhibited complex fluctuations. (2) Natural and economic factors had notable impacts on CLUE in Henan province. Among these factors, population and economic factors played a dominant role, whereas average temperature exerted an inhibitory effect on CLUE in most parts of the province. (3) The influenced factors on CLUE varied spatially, with human activity impacts being more concentrated, while topographical and climatic influences were relatively dispersed. These findings provide a scientific basis for land management and agricultural policy formulation in major grain-producing areas, offering valuable insights into enhancing regional CLUE and promoting sustainable agricultural development. Copyright: © 2024 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). In recent years, global socio-economic development and urbanization have accelerated the consumption of cultivated land resources, posing serious challenges to both the quantity and quality of cultivated land [1]. The sustainable use of cultivated land directly affects food production and living standards, forming a foundation for ensuring food security and social stability [2,3]. For a populous and agriculture-based country like China, the strategic importance of rational land use cannot be overstated [4]. As of the latest available data, the Chinese urbanization rate has surpassed 66.16%, signaling a transition from rapid urban growth to a more stable phase [5]. This rapid urban expansion has led to reductions in cultivated land, with substantial transfers of rural labor and capital to urban areas [6,7]. Such shifts have altered the production structure of cultivated land, severely impacting the land environment and, consequently, China’s food security [8,9]. As rural labor increasingly migrates to cities, there is a growing demand for both the quantity and quality of agricul- tural crops. Optimizing Cultivated Land Utilization Efficiency (CLUE) is thus crucial, not only for national food security but also for sustainable economic development and social stability [10,11]. The Chinese government is actively implementing measures to promote CLUE, including encouraging appropriately scaled agricultural operations, advancing high-standard cultivated land construction, and improving overall land productivity. In recent years, China has made significant progress in land transfer, high-standard cultivated land development, and improvements to agricultural infrastructure [12,13]. According to data from the Ministry of Agriculture and Rural Affairs of China, by 2022, land transfer markets had been established in 1474 counties (cities and districts), with approximately 22,000 towns establishing land transfer service centers. The area of transferred contracted cultivated land has exceeded 350,000 hectares nationwide [14]. Consequently, the devel- opment of effective land protection strategies is of great importance in optimizing land resource utilization, improving CLUE, and securing national food safety [15,16]. In the process of formulating cultivated land protection strategies, scientific assess- ment and improvement of CLUE are key processes [17,18]. Accurately understanding the current state, trends, and mechanisms influencing CLUE helps identify key constraints on sustainable land use and provides a solid foundation for optimizing protection policies [19]. Accordingly, domestically and internationally, researchers have conducted extensive studies on changes in CLUE and its driving factors, focusing primarily on efficiency measurement, spatiotemporal analysis, and exploring influencing factors [1,2]. This research aims to evaluate the comprehensive benefits of cultivated land—including economic, social, and environmental returns—by examining the relationships between multiple inputs (e.g., land, labor, capital, etc.) and outputs [4,20]. As socio-economic research has evolved, studies have expanded to include efficiency measurements and a deeper investigation into the spatiotemporal characteristics and various influencing factors, covering aspects like natural conditions, economic development levels, social conditions, agricultural production con- ditions, and the ecological environment. Research methods for CLUE have continued to evolve [21,22]. Traditionally, the Data Envelopment Analysis (DEA) model and its variants have been widely used due to their flexibility, though they exhibit sensitivity to outliers and extreme values, which can limit predictive applicability [23,24]. To mitigate the excessive influence of extreme data, the Stochastic Frontier Analysis (SFA) is often employed, helping to minimize the impact of random error on efficiency measurements [6]. However, SFA requires a predetermined production function form, making it susceptible to model con- straints. In studies analyzing spatiotemporal characteristics, the Analytic Hierarchy Process (AHP) is commonly applied. The AHP uses multi-criteria decision-making based on expert knowledge, assigning relative weights to indicators based on expert scoring [7]. However, the AHP is subject to subjective correlations and decision biases. To avoid subjective fac- tors in research, the Grey Relational Analysis (GRA) method was introduced [25]. GRA evaluates the influence of different factors on the system by calculating the grey relational degree between each indicator and a reference sequence, though GRA is primarily suitable for small sample sizes and becomes computationally intensive with large datasets [8]. To handle computation challenges in large sample scenes, Principal Component Analysis (PCA) is applied [26]. PCA is based on the eigenvalue decomposition of the covariance matrix and removes redundant information by extracting the main features of the data, which can effectively improve the calculation of high-dimensional data [27,28]. PCA ig- nores nonlinear features and the interpretability of reduced dimensional information is weak [29]. To improve the interpretability of the model, geographically weighted regres- sion (GWR) is used to capture spatial heterogeneity by assigning weights to different geographical locations, which is suitable for revealing local relationships but susceptible to multicollinearity [30,31]. To avoid the influence of multiple factors, a Geodetector is used to identify spatial interactions and distribution characteristics between variables. In recent years, the development of Machine Learning (ML), Artificial Neural Networks efficiency evaluation and prediction models [32–34]. ML has powerful nonlinear modeling and feature extraction capabilities, is suitable for complex data processing, and performs well in improving analysis accuracy, resisting overfitting, and processing missing values and outliers, reducing the subjective impact in research, but there is also the problem of poor model interpretability. In addition, ML is highly sensitive to parameter selection, which directly affects the stability and accuracy of the model results.",
    "Research on CLUE has made significant progress in theoretical framework, research methods and application practice [35]. Especially with the continuous introduction of new technologies and methods, the assessment and prediction of CLUE have become more scien- tific and accurate. However, compared with the current food security situation and the realistic needs of regional agricultural development [36], research on CLUE still has shortcomings and needs to be further deepened and improved [37]. In terms of research areas, most studies focus on the national level, especially the lack of research on major grain-producing areas based on the background of national development strategies. This results in an insufficient understand- ing of regional differences and policy development, affecting precise policy recommendations for specific regions [38]. In terms of research methods, although the DEA model and SFA algorithm are widely used, they rely heavily on the model structure and make it difficult to handle dynamic changes and environmental factors. In terms of influencing factors, existing research focuses mostly on input factors (e.g., labor, fertilizer, mechanization level, etc.), while there is less research on the impact of exogenous variables (e.g., climate change, human activities). As changes in the external environment intensify, the impact of exogenous factors on CLUE will become increasingly important. These research deficiencies are particularly prominent in China’s main grain-producing areas, and there is an urgent need to select typical areas to conduct in-depth research to provide other similar areas with experience that can be used for reference [39–41]. Therefore, scientifically assessing the changing trends of CLUE and its driving factors is of great significance for formulating reasonable land management policies and ensuring food security [33,42,43]. Research on CLUE has achieved significant progress in terms of theoretical frame- works, research methodologies, and practical applications. With the continual introduction of new technologies and methods, the evaluation and forecasting of CLUE have become increasingly scientific and precise. However, compared to the current demands of food security and regional agricultural development, studies on CLUE still face limitations and need further refinement [44]. In terms of research scope, most studies focus on the national level, with a notable lack of studies specifically targeting major grain-producing regions within the context of national development strategies [45]. This gap leads to an insufficient understanding of regional disparities and limits the development of precise policy recommendations tailored to specific areas. Regarding methodologies, while DEA and SFA models are widely utilized, they have limitations. Both models are highly de- pendent on specific model structures, making it challenging to capture dynamic changes and environmental influences effectively [46]. On the topic of influencing factors, existing research primarily focuses on input variables (e.g., labor, fertilizers, and mechanization levels) but tends to overlook the impact of exogenous variables. With the intensifying shifts in external environments, the influence of these exogenous factors on CLUE will only grow in importance. These research gaps are particularly pronounced in China’s main grain-producing regions, underscoring the urgent need for in-depth studies in selected key areas to provide valuable insights for similar regions. Therefore, a scientific assessment of trends in CLUE and its driving factors is essential for developing sound land management policies and ensuring food security [47]. As one of China’s major grain-producing regions, changes in CLUE in Henan Province directly impact both regional and national food production capacity. In recent years, amid rapid industrialization and urbanization, Henan faces dual pressures of protecting cultivated land resources and promoting economic development. Urban expansion has led to the occupation of cultivated land, shifts in land-use patterns due to rural labor migration, and increasing ecological constraints—all posing significant challenges to improving CLUE. Additionally, Henan exhibits marked spatial heterogeneity, with varying natural conditions, levels of economic development, and agricultural practices across different regions, making it an ideal sample for studying the mechanisms influencing CLUE [48]. In this study, we selected Henan Province as a representative region to identify the primary driving factors in CLUE from 2000 to 2020. This study aims to reveal the spatiotem- poral evolution and main driving factors of CLUE and provide strategic recommendations for land management in major grain-producing areas. To accurately assess cultivated land utilization in Henan, we introduced a cultivated land utilization index (CLUI) based on cultivated land vegetation coverage data, applying decomposition and standardization methods to spatiotemporal trends. We calculated the trends in this index from 2000 to 2020 using the Theil–Sen Median and Mann–Kendall (the Sen-MK) method. To identify the primary driving factors behind these trends, we employed an ANN optimized by a genetic algorithm and an RF model optimized using a particle swarm algorithm. Considering the interpretability challenges of machine learning models, we applied the SHAP to evaluate machine learning results, allowing us to identify the main driving factors and conduct an in-depth analysis of the influences on changes in CLUE.",
    "Henan Province is in the central region of China, within the middle and lower reaches of the Yellow River, covering an area of approximately 167,000 km2 [49]. As shown in Figure 1, Henan’s terrain is higher in the east and lower in the west, featuring diverse topography primarily composed of plains, alongside basins, mountains, and hills [50]. The province spans four major river basins: the Hai River, Yellow River, Huai River, and Yangtze River. Plains and mountainous areas, respectively, constitute 56% and 44% of Henan’s landscape, with elevations ranging from 23 to 2387 m. Most of Henan falls within a warm temperate zone, with the southern region crossing into the subtropical zone, forming a continental monsoon climate zone transitioning from a northern subtropical to warm temperate climate. The climate shifts from plains in the east to hilly and mountainous terrain in the west. Over the past decade, the average annual temperature has ranged from 15.1 ◦C to 15.9 ◦C, and annual precipitation has varied between 512.6 mm and 1133.3 mm. Henan’s cultivated land area is approximately 75,300 ha, ranking second nationwide, making it a critical grain production base for China. In 2023, the province had a grain cultivation area of 10,785.29 thousand hectares, with 5686.07 thousand hectares devoted to wheat. As of the end of 2023, Henan’s permanent population reached 98.15 million, with an urbanization rate of 58.08%. Given this background, Henan represents an ideal region for studying CLUE due to its typicality in terms of terrain, climate, and human activities. This study selects Henan as the research area to explore the dynamic evolution of CLUE under the influence of multiple factors. Analyzing the spatiotemporal patterns and influencing factors of CLUE in Henan provides a scientific basis for improving CLUE and promoting the sustainable use of cultivated land in the region. Moreover, it offers valuable insights into land management and agricultural policy formulation in other major grain-producing regions. The data sources for this study include vegetation coverage data, topographic factors, climatic factors, and human activity factors. As shown in Table 1, the calculation of the CLUE index is based on FVC, with FVC data obtained from the National Tibetan Plateau Data Center, covering the period from 2000 to 2023. Given that May is a critical growth phase for Henan’s primary crop (wheat) from grain filling to maturity, when vegetation coverage is relatively stable and better reflects CLUE, the FVC data from each May is used to model the CLUI. The climatic and topographic factors include annual Average Temperature (Avg. Temp), Precipitation (Precip.), Digital Elevation Model (DEM), and slope data. For human activity factors, variables (e.g., Power Consumption (PC), Primary Industry (PI), Secondary Industry (SI), Tertiary Industry (TI), Gross Domestic Product (GDP), local fiscal gross budget expenditure (GBE), General Budget Revenue of Local Finance (GBR), Completed Investment in Residential Development (CIRD), Total Amount of Real Estate Development (TRED), Population Density (Pop. Dens.), Non-Agricultural Population (Non-Ag Pop.), and Registered Population (Reg. Pop.) were considered. Figure 1. Overview of the study area: (a) location of Henan Province; (b) true-color satellite image of Henan Province; (c–g) typical cultivated land areas in central, northern, western, southern, and eastern regions of Henan Province. To assess the overall CLUE in Henan Province, this study introduced a CLUI. The calculated CLUI results were organized into three levels of research units: provincial cities, prefecture-level cities, and counties, based on a 250 m pixel resolution. The average CLUI value was calculated for each research unit by considering the number of pixels within each unit’s boundary, representing the overall CLUE within the area. The index calculation is based on FVC, derived from the Normalized Difference Vegetation Index (NDVI) using the pixel dichotomy method [51,52]. FVC effectively reflects the spatial distribution of vegetation cover on the surface, specifically as the proportion of land area covered by vegetation. This measure is crucial for quantifying CLUE and monitoring changes in FVC. To capture the detailed characteristics of vegetation cover changes, the study decomposed the FVC time series to extract its long-term trends and interannual fluctuations, forming the basis for modeling the CLUI [53,54]. The formula for calculating the CLUI is as follows [55]: where FVC represents the Fractional Vegetation Cover, T denotes the long-term trend component, YF indicates the interannual fluctuation component, and σR is the standard deviation of the residuals. The formula first removes the long-term trend and interannual fluctuations, enabling standardized processing of the residuals to construct an index that reflects changes in CLUE. The standardized residual component becomes the CLUI, which visually reflects the temporal dynamics of CLUE in Henan Province. The technical workflow of this study is shown in Figure 2.",
    "To quantitatively analyze the trend in CLUE, this study employs the Sen-MK trend test method [56]. This non-parametric statistical method combines the Theil–Sen slope estimator with the Mann–Kendall significance test and is widely used for trend analysis of long-term time series data [57]. The Theil–Sen slope estimation is a robust trend estimation method that calculates the median slope between all possible pairs of points in the time series to determine the direction and intensity of data change. This approach effectively reduces the influence of outliers on trend assessment and is suitable for non-normally distributed data. The equation is as follows [58]: The Mann–Kendall trend test is a non-parametric method used to assess the signif- icance of trends in time series data. By ranking the time series and calculating a sign function, it determines whether there is a significant upward or downward trend in the sequence. Its advantages include not requiring the data to follow a normal distribution and being unaffected by outliers. The calculation equation is as follows: In the spatiotemporal analysis of changes in vegetation coverage, the combined use of the Sen-MK trend test method enables a quantitative assessment of the rate of change and its significance in the time series. As shown in Table 2, CLUI is classified into nine categories: ANN is a computational model inspired by biological nervous systems and is widely used for modeling and prediction of complex nonlinear relationships. In this study, ANN was used to analyze the importance of driving factors for changes in cultivated land veg- etation coverage in Henan Province from 2000 to 2020. By constructing a multi-layered artificial neuron network, the ANN can handle the relationship between complex input variables and capture the potential impact of different factors on cultivated land vege- tation coverage. The calculation process of the ANN can be expressed by the following equation [56,59]: where xi represents the input variable, ωij denotes the weight between the input layer and the hidden layer, and ωj represents the weight from the hidden layer to the output layer. bj and b are the bias terms for the hidden layer and output layer, respectively. To improve the optimization efficiency and accuracy of the model, a genetic algorithm is used to optimize the ANN parameters. In the genetic algorithm (GA), each individual represents a set of weights and bias terms for ANN, and ANN evaluates each individual’s performance using the following fitness function [60]: Here, yk denotes the actual value, ˆyk(ω, b) is the ANN’s predicted value, and N is the sample size. The genetic algorithm optimizes the weights (ω) and biases (b) by maximizing the fitness function, thereby enhancing the predictive performance of the ANN. To improve the model’s generalization ability and avoid overfitting, the input data was standardized to ensure consistency across variable scales [58]. In this study, the RF regression model improves prediction accuracy by integrating multiple decision trees, and the results of each decision tree are weighted and averaged to generate the final prediction value. Specifically, the prediction formula of RF is: where ˆy is the final predicted value, T is the number of decision trees, and ft(x) represents the prediction result of the t-th decision tree. To mitigate the impact of initial hyperparameter settings, this study employs Particle Swarm Optimization (PSO) for hyperparameter tuning. The velocity update formula for Particle Swarm Optimization is as follows: where vt+1 represents the velocity of particle i in generation t + 1, ω is the inertia weight, c1 i and c2 are learning factors, r1 and r2 are random numbers, pt i is the best position of particle i, gt is the global best position, and xt i is the current position of particle i. The position update formula for the particle is as follows: PSO optimizes the RF model by iteratively updating particle velocity and position to identify the best hyperparameters, thereby improving model performance in driving factor analysis [61,62]. This study uses SHAP to assess variable importance in the ANN and RF models, evalu- ating how each driving factor affects changes in CLUE. Based on Shapley values from game theory, SHAP assigns a contribution value to each input variable, including topographic, climatic, and human activity factors. By calculating SHAP values, the study quantita- tively evaluates the impact of these variables on CLUE trends, determining their average importance through marginal contributions to predictions across different scenarios: Here, ϕi is the Shapley value of the i-th variable, N represents the set of all variables, S is a subset of variables, f(S) is the model prediction value for subset S, and f(S ∪ {i}) is the model prediction value when variable iii is added to subset S. This study uses SHAP to reveal both the global importance of variables and their specific contributions to individual predictions. It visualizes how each variable affects CLUE changes, providing an accurate However, in this study, a comprehensive analysis of the driving factors affecting changes in CLUE in Henan Province from 2000 to 2020 was conducted by combining ANN and RF with the SHAP. Since SHAP values may differ significantly in range and scale across different models, directly comparing these values could lead to misleading conclusions. To further enhance the stability and accuracy of variable importance rankings and to ensure the reliability of results, this study normalized and averaged the variable importance results from the ANN and RF.",
    "where SHAPvalue represents the calculated SHAP value for each variable, SHAP (ANN) denotes the SHAP value of variables calculated from the ANN model, and SHAP (RF) denotes the SHAP value of variables calculated from the RF model. In Figure 3 and Table A1 in Appendix A, between 2000 and 2020, the changes in the CLUI in Henan Province showed significant inter-annual variation characteristics, with an overall fluctuating upward trend. In the past 20 years, CLUI has experienced many fluctuations, and the vegetation coverage has gradually increased from a lower level to a higher level. Especially after 2004, 2012, and 2016, the utilization rate of cultivated land improved significantly. Specifically, from 2000 to 2008, the utilization rate of cultivated land in Henan Province increased slowly and the vegetation coverage was low, indicating that the CLUE was greatly restricted at that time. After 2008, CLUI increased significantly, especially in the eastern and northern regions. By 2020, CLUI has reached a high level, and most of the province’s cultivated land areas show high vegetation coverage. From the perspective of spatial distribution, the improvement of CLUI in Henan Province has obvious spatial heterogeneity. The eastern plains area has obvious advantages due to its flat terrain and high CLUI; in comparison, the western and southern mountainous areas are limited by terrain, and their CLUE has improved more slowly. Overall, from 2000 to 2020, the cultivated land utilization rate in Henan Province showed an overall increase but significant regional differences. Figure 4 shows the interannual changes in the maximum and average values of the CLUI in Henan Province from 2000 to 2020. Among them, Figures 4a and 4b, respectively, show the changing trend of the maximum value of CLUI and the changing trend of the average value and their corresponding linear regression models and 95% confidence intervals. During the research period, the maximum value of CLUI remained at a high level close to 1.0 in most years, especially reaching significant peaks in 2002, 2015, and 2018, indicating that the CLUE of some cultivated land reached extremely high levels in these years. The average CLUI gradually increased from approximately 0.85 in 2000 to approximately 0.87 in 2020, which means that the overall CLUE in Henan Province has improved. In 2004 and 2010, the CLUI average reached a relatively high point, while there was a significant decline in 2006, 2008, and 2019. These fluctuations reflect the differences in CLUE between years. At the same time, there are also fluctuations in the maximum CLUI, e.g., slight decreases in 2006 and 2012. In the interannual changes of the average CLUI in Figure 4b, the average CLUI also shows a gradual upward trend. Comparing the changes in the maximum value and the average value, it can be found that the fluctuation range of the maximum value of CLUI is relatively large, while the fluctuation of the average value of CLUI is relatively stable. This shows that although some areas have achieved high CLUE in specific years, overall, the improvement in CLUE across the province has been relatively slow and balanced. The width of the confidence interval reflects the credibility of the model to changes in the data. Figure 4 shows that the width of the confidence interval changes over time, indicating that there is a certain uncertainty in the fluctuations of cultivated land utilization in different years. Overall, between 2000 and 2020, both the maximum and average values of CLUI showed an upward trend, and its linear regression model showed a significant positive slope, indicating that the CLUE of Henan Province has improved during the study period. Figure 4. Interannual change trend of CLUI index from 2000 to 2020: (a) represents the interannual change of the maximum value of CLUI, and (b) represents the interannual change of the average CLUI. In Figure 5 and Tables A1–A3 in Appendix A, the spatial evolution trend of the CLUI in Henan Province from 2000 to 2020 is based on the Sen-MK trend test. A small part of Zhengzhou City in the middle and Shangqiu in the east show an obvious decreasing trend, especially Zhengzhou City. Figure 5a shows that the cultivated land utilization rate in most areas mainly decreases from slight to extreme (orange and red), only in some places. There is a small increase in the area. The situation in the eastern region is similar to that in the central region. The utilization rate of cultivated land has mainly declined in the past two decades, and a few areas have experienced slight degradation (yellow). This general downward trend shows that the central and eastern regions faced a more significant problem of insufficient utilization of cultivated land during the study period.",
    "The trend of cultivated land utilization in Hebi City in the north and Luoyang City in the west is more positive. In Hebi City, the overall cultivated land utilization rate remained stable and increased slightly, mainly in light green and light blue, indicating that the CLUE in this area increased slightly during the study period. The situation in Luoyang City is the most prominent, with dark blue covering most of the region, indicating that the cultivated land utilization rate in the west has increased significantly, and it is the region with the most positive changes in CLUE among the five regions. This improvement may be closely related to factors, (e.g., improvements in infrastructure, support from government policies, and advances in agricultural technology), in recent years, making Luoyang City a model for improving CLUE in the province. The situation at the junction of Zhumadian City and Xinyang City in the southern region is more complicated. There are areas with significant increases (dark green) and areas with significant decreases (red and orange), showing obvious spatial imbalance. This fluctuation characteristic indicates that there are significant differences in CLUE in different regions. Overall, the cultivated land utilization rate in Henan Province showed strong spatial heterogeneity between regions from 2000 to 2020: it mainly decreased in the central and eastern parts, remained stable and slightly improved in the north, increased significantly in the west, and increased in the south. It shows complex fluctuations. The differences between different regions reflect the differences in agricultural development and land management policies within Henan Province. This study uses ANN optimized by genetic algorithm and RF optimized by particle swarm to conduct an in-depth analysis of the controlling factors of changes in cultivated land utilization in Henan Province from 2000 to 2020, aiming to reveal different driving factors. The importance of factors in the process of improving CLUE. Tables 3 and 4 show the comparison results of modeling parameters and accuracy indicators of ANN and RF models before and after optimization, respectively. For the ANN model, the hidden layer size before optimization is 10, the learning rate is 0.05, the regularization term is 0.01, the coefficient of determination (R2) of the model is 0.48, and the root mean square error (RMSE) is 0.007. After optimization, the hidden layer size was reduced to 5, the learning rate was reduced to 0.0214, the regularization term was increased to 0.0875, R2 was significantly improved to 0.78, and the RMSE was reduced to 0.001. Obviously, the optimized ANN model has significantly improved in terms of fitting accuracy and error control, which shows that the optimization of model parameters through genetic algorithms makes the model more efficient and accurately reflect the changing characteristics of cultivated land utilization. For the RF model, the parameters before optimization are set to the number of trees 100, the minimum leaf node is 5, the maximum depth is 20, the number of sampled predictors is 16, and the learning rate is 0.1. In the optimized model parameters, the number of trees is reduced to 54, the minimum leaf node is reduced to 1, the maximum depth is increased to 50, the number of sampled predictors is reduced to 8, and the learning rate is increased to 0.5. The R2 value of the model increased from 0.74 before optimization to 0.94, and the RMSE significantly decreased from 0.00007 to 0.000002. This shows that the adjustment of model parameters through the particle swarm optimization significantly improves the prediction accuracy of the model, allowing the RF to characterize dynamic changes more accurately in CLUE in Henan Province. Figure 6 shows the ranking of the importance of variables in the model before and after optimization, reflecting the contribution of each variable to changes in cultivated land utilization. In Figure 6a,b, the importance ranking of variables before and after ANN model optimization is shown, respectively. The ranking of each variable in the model has changed significantly after optimization. Before optimization, variables (e.g., GBE, TRED, SI, and CIRD) had high importance in the model; after optimization, the influence of factors (e.g., GBR, SI, Pop. Dens., and Reg. Pop.) increased significantly. This shows that the optimized ANN model more prominently reflects the control effect of economic and social factors among human activity factors on cultivated land utilization. Similarly, Figure 6c,d show the ranking of variable importance before and after RF model optimization. Before optimization, variables (e.g., Precip, Pop. Dens., CIRD, and TI) have high importance in the model; but after optimization, factors (e.g., TI, Pop. Dens., Avg. Temp, and Reg. Pop.) influence has increased significantly. This shows that the optimized RF is more sensitive in reflecting socio-economic-related factors among human activity factors, and the importance of various economic activities and demographic data is further enhanced.",
    "To compare the importance of variables in different models more comprehensively, we normalized the variable importance results of the ANN and RF to the same range to eliminate the differences caused by different calculation scales. The normalized results can more accurately reflect the relative contribution of each variable in different models. In order to further improve the robustness and accuracy of variable ranking, the study gener- ated the final comprehensive variable importance ranking by averaging the normalized results of the ANN and RF, as shown in Figure 7. As can be seen from Figure 7, economic and social factors play the most significant role among human activity factors. In particular, factors (e.g., Pop. Dens., local fiscal revenue, and industrial output value play a major driving role in improving CLUE. At the same time, natural factors (e.g., Avg. Temp and Precip.) also play a certain supporting role in the environmental conditions of cultivated land productivity. The top seven main variables that contribute most significantly to changes in CLUE are “Pop. Dens.”, “GBR”, “SI”, “Reg. Pop.”, “GBE”, “PC” and “Avg. Temp.”. These results indicate that economic and social factors (e.g., Pop. Dens., GBR, and SI) play an important role in driving changes in CLUE. Among them, “Pop. Dens.” has the highest average importance, reaching 0.95, which reflects that in areas with relatively concentrated populations, CLUE is significantly im- proved, which is related to the fact that population density directly affects the intensive use of land. Secondly, the average importance of “GBR” is 0.92, indicating that local govern- ment fiscal revenue plays an important role in promoting the improvement of cultivated land utilization. The importance of “Avg. Temp” is 0.84, showing that temperature, as an environmental condition, plays a key role in CLUE and has a direct impact on crop growth and cultivated land productivity. Furthermore, the average importance of “SI” is 0.89, indicating the significant impact of industrialization level on cultivated land utilization. The average importance of “Reg. Pop.” is 0.88, showing the comprehensive impact of Reg. Pop. on land resource demand and CLUE. The average importance of “CIRD” and “TI” is both 0.78, indicating that the rapid development of real estate development and the service industry has a certain impact on cultivated land utilization. Through an in-depth analysis of the main driving factors, the time evolution character- istics of the main driving factors in Henan Province from 2000 to 2020 can be systematically observed. As shown in Figure 8, overall, the inter-annual changes in each factor show a significant trend. From 2000 to 2020, the maximum and average values of Pop. Dens. generally, show a steady upward trend. The maximum fitting degree is 0.53, while the fitting degree of the average value is 0.31, which shows that between different regions. There is obvious hetero- geneity in the changes in population density, reflecting the differentiated characteristics of population agglomeration in different regions during this period. The maximum and average values of the Reg. Pop. also show a significant upward trend, with fitting degrees of 0.63 and 0.97, respectively, indicating that the overall population growth is significant and stable. Both GBR and GBE showed significant growth during the study period. The fitting degree of the changing trend of the maximum value and average value of GBR is 0.92 and 0.94, respectively, while the fitting degree of GBE also reaches a similar level. These high- fitting degrees indicate that fiscal budget revenue and expenditure show a highly consistent and significant growth trend across the province. Similarly, the maximum and average trend-fitting degrees of SI are 0.97 and 0.96, respectively, showing the steady advancement of industrialization during the study period. Both the maximum value and the average value of PC show a significant linear upward trend, and the fitting degrees for them are both 0.98, which further reflects the general improvement of the level of industrialization. The maximum and average values of Avg. Temp. generally show a downward trend, and the fitting degrees are 0.19 and 0.42, respectively, reflecting the large fluctuations and regional differences in temperature changes. During the study period, the changes in Avg. Temp were complex and showed large uncertainties between different years and regions. According to the spatial correlation analysis between the main driving factors and CLUE in Figure 9, it can be found that human activity factors have a significant and concentrated impact on CLUE, while the effects of terrain and climate factors are relatively scattered. According to the correlation between each driving factor and CLUE, these factors can be classified into four categories: strong correlation, weak correlation, no correlation, and negative correlation.",
    "Figure 9. Correlation analysis between main driving factors and CLUI: (a) represents the correlation analysis between Pop. Dens. and CLUE; (b) represents the correlation analysis between GBR and CLUE; (c) represents the correlation analysis between SI and CLUI; (d) represents the correlation analysis between Reg. Pop. and CLUI; (e) represents the correlation analysis between GBE and CLUI; (f) represents the correlation analysis between PC and CLUI; (g) represents the correlation analysis between Avg. Temp and CLUI. Among the human activity factors, economic and demographic factors have the most significant impact on CLUE. Pop. Dens., GBR, GBE and PC show strong positive correlation and have obvious spatial characteristics (Figure 9a,b,e,f). In the cities of Zhengzhou, Xuchang and Kaifeng in central Henan Province and Xinyang City in the south (research unit correlation analysis Appendix A), CLUE shows a strong positive correlation (red area) with these factors, reflecting that human activities are closely related to CLUE. In Puyang City in the north of Henan Province and Shangqiu City in the west, the correlation of these factors is weak or even negative (blue area), indicating that human activities in these areas have less impact on CLUE. In these areas, GBR, PC, and Pop. Dens. do not have a significant positive correlation with improvements in CLUE. The spatial correlations of SI and Reg. Pop. in Figure 9c,d show regional differences. The output value of the SI in Luoyang City and Nanyang City in the west of Henan Province and Xinyang City in the south shows a positive correlation with CLUE (red and orange areas), while in Zhengzhou City in the center of Henan Province and Shangqiu City in the north the performance is as follows Weak or negative correlation (light blue and blue areas). The Reg. Pop. shows a positive correlation in some areas of Xinyang City in southern Henan Province and Pingdingshan City in the central part of the province. However, in Kaifeng City in western Henan Province, the increase in Reg. Pop. does not bring about an obvious improvement in CLUE, and some areas even show a negative correlation. The correlation between Avg. Temp. and CLUE (Figure 9g) shows a positive correlation in Anyang City in the north of Henan Province and Xinyang City in the south, while it shows a negative correlation in most areas of Henan Province. This shows that there are regional differences in the impact of Avg. Temp on CLUE, which may be related to climatic conditions and agricultural production methods in different regions. The effects of terrain and climate factors on CLUE show significant differences in different regions. Through the analysis of the CLUI in Henan Province, it can be found that topographic factors (e.g., slope and DEM) have a relatively limited impact on the province’s CLUE. Most areas in Henan Province are plains with small terrain changes, therefore, their contribution to CLUE is low. However, in mountainous and hilly areas (e.g., western Henan Province), slope and elevation have certain constraints on the use of cultivated land. The complexity of the terrain makes the level of mechanization in these areas low, and it is difficult to improve CLUE. This finding has certain similarities and differences with research results in other regions. In Yunnan Province in southern China, research shows that natural factors have a certain impact on CLUE, but agricultural production conditions (e.g., effective irrigation area and total power of agricultural machinery) have a more significant impact on CLUE [63,64]. The terrain of Yunnan Province is complex, with a large proportion of mountains and plateaus. The impact of terrain factors on agricultural mechanization and irrigation conditions is more prominent, resulting in a more obvious impact of terrain factors on CLUE [65]. In contrast, northeastern regions (e.g., Jilin Province), China’s main grain-producing areas, have relatively flat terrain and are suitable for large-scale mechanized operations [66–68]. The topography has fewer constraints in CLUE. However, cold climate conditions may limit crop growth cycles and negatively impact CLUE. This is consistent with the inhibitory effect of Avg. Temp on CLUE in the northern and western regions of Henan Province, indicating that climate factors have an important impact on CLUE in cold areas. Human activity factors have a significant driving effect on the improvement of CLUE. It can be seen from the ranking of variable importance (Figure 7) that Pop. Dens., GBR, SI, Reg. Pop., GBE and PC are the factors that have the greatest impact on CLUE. The impact of these factors on CLUE in different regions reflects obvious regional differences. First, Pop.",
    "Dens. shows a significant positive correlation with CLUE in areas with relatively concen- trated populations, e.g., central and southern Henan. This shows that the agglomeration of population resources helps to manage and utilize cultivated land resources more effectively. Sufficient labor allows the land to be cultivated intensively, improving land productivity and utilization efficiency. This finding is consistent with research results in areas, e.g., Jilin Province, where areas with higher population density also have higher CLUE. The main reason is that labor input promotes the intensification of agricultural production [5]. Secondly, local fiscal revenue and expenditure have played an important role in pro- moting CLUE. Financial investment is mainly used for the construction of agricultural infrastructure, the improvement of cultivated land water conservancy facilities, and the promotion of agricultural mechanization, thus directly improving the utilization of land, especially in aspects, e.g., reservoir expansion, river management, and water diversion projects [69]. During 2023–2024, Henan Province has 454 projects in seven categories includ- ing flood prevention and disaster reduction, irrigation area renovation, water ecological management, urban and rural water supply, water system connectivity, water environment improvement, and digital twins, with a total investment of CNY 51.724. For example, in Xinyang City in southern Henan Province, Pingdingshan City in central China, and Nanyang City in southwestern Henan Province, the investment in major water conservancy projects was CNY 9.751, CNY 8.618, and CNY 5.917, respectively. By increasing fiscal expenditures, agricultural production capacity was significantly improved, resulting in a significant increase in CLUE in these areas during the study period. This echoes the research in Yunnan Province, where effective irrigated areas and the total power of agri- cultural machinery are the main factors in improving CLUE, and financial investment is crucial to improvements in these aspects. For example, the Xixiayuan Project is in Henan Province in the middle reaches of the mainstream of the Yellow River. After the project is completed, it will be connected to the four major water diversion areas of Xixiayuan, Wujia, Renmin Shengli Canal and Dagong to divert water from the Yellow River into the irrigation area, with an annual water diversion of 213 million cubic meters. New develop- ments the irrigated area is 310,000 acres, and the irrigated area of 1.4 million acres will be supplemented by Wujia Irrigation District, Renmin Shengli Canal Irrigation District and Dagong Irrigation District, which can increase grain production capacity by 410 million The output value of the SI has a positive correlation with CLUE in some areas, indicat- ing that capital flows brought about by industrial development help improve agricultural productivity. Industrialization has promoted agricultural mechanization and technological progress, and improved CLUE. However, this impact differs between the central, western, and northern regions of Henan Province. The increase in the level of industrialization in some regions has led to a reduction in the agricultural labor force, as the labor force is at- tracted to the industrial sector, resulting in a shortage of agricultural production personnel, which has a negative impact in CLUE. For example, in Xuchang City, located in the central part of Henan Province, in 2023, the added value of the SI was CNY 139.89, an increase of 1.6%. At the end of 2023, the city’s permanent population was 4.383 million, including 2.460 million urban residents and 1.923 million rural residents; The urbanization rate of the permanent population was 56.12%, an increase of 0.94 percentage points from the end of the previous year. The permanent population in rural areas decreased, and industrial development attracted the agricultural population [70,71]. In addition, economic and demographic factors (e.g., GDP, PC, Reg. Pop.) also have an important impact on CLUE. However, rapid economic development and urbanization have caused many rural labor forces to migrate to cities, resulting in a shortage of agricultural labor and affecting agricultural production efficiency. In Henan Province, the impact of urbanization on CLUE presents such complexity. On the one hand, it promotes agricultural modernization, and on the other hand, it may lead to labor shortages. Therefore, there is a need to balance the relationship between industrial development, urbanization and agricultural land use when formulating future agricultural and land management policies. Financial support for agriculture should be strengthened, agricultural mechanization and technological progress should be promoted, and CLUE should be improved. At the same time, we must prevent excessive industrialization and urbanization from causing the loss of agricultural labor and affecting agricultural production. Drawing on the experience of other regions, Sichuan Province, for example, while promoting urbanization, has strengthened large-scale agricultural operations and promoted the coordinated improvement of high- quality agricultural development and CLUE.",
    "Based on the above analysis of the inter-annual changes and main driving factors of CLUE in Henan Province, in order to effectively improve the CLUE in Henan Province, the following policy recommendations are put forward to ensure food security and pro- mote sustainable agricultural development [72]. In response to the complex terrain and unfavorable agricultural production conditions in the western region of Henan Province, infrastructure construction, especially the construction of terraces and irrigation systems, should be stepped up to effectively prevent soil erosion. At the same time, small machin- ery suitable for mountainous operations should be introduced to improve CLUE. In the central and eastern regions, we should continue to strictly implement the cultivated land red line policy to prevent non-agricultural construction from occupying cultivated land, and actively promote the crop rotation and fallow system and high-standard cultivated land construction to improve soil fertility and thereby improving the quality of cultivated land and CLUE. The promotion of agricultural mechanization and water-saving irrigation technology is also crucial. Especially in the eastern region, high-efficiency water-saving technologies (e.g., drip irrigation and sprinkler irrigation), should be promoted through increased financial support to ensure the stability and efficiency of agricultural production. In regions with higher population densities (e.g., the central and eastern regions), emphasis should be placed on optimizing land management and preventing degrada- tion caused by overuse of land [73]. Especially in the process of industrialization and urbanization, it is necessary to scientifically plan land use, clarify the protection scope of agricultural land, and prevent high-quality cultivated land from being encroached upon. We should encourage the integrated development of agriculture and industry, support emerging industries (e.g., agricultural product processing and agricultural tourism), ex- tend the agricultural industry chain, and achieve coordinated development of agriculture and industry. In areas with weak infrastructure, financial support for agricultural mechanization and water-saving irrigation facilities should continue to be increased to cope with sudden drought conditions [74]. For example, in June 2024, the area that could not be sown in Henan Province due to drought reached 3.23 million acres. In total, 72 national weather stations in 16 prefectures and cities in Henan, including Anyang, Hebi, Jiaozuo and Kaifeng, have monitored meteorological droughts that have reached severe drought levels or above and have lasted for several days. The Henan Provincial Department of Water Resources has strengthened the dispatching and management of irrigation water sources, increased the discharge flow according to the needs of downstream drought relief irrigation, and maximized the guarantee of irrigation water in the irrigation areas. Henan Electric Power Company prioritizes ensuring electricity demand for drought relief and increases the frequency of inspections and inspections of well power supply facilities. Electricity is an important energy source for modern agriculture. In order to ensure the energy supply for agricultural production, it is recommended to improve the construction level of rural power grids and ensure the stability of electricity consumption for agricultural production, especially during critical farming seasons. At the same time, the use of clean energy (e.g., solar energy) should be encouraged to reduce dependence on traditional energy and promote the development of green agriculture. In addition, for regions with rapid industrialization (e.g., the central and eastern regions), it is recommended that policymakers strike an effective balance between industrialization and agricultural development to In the future, agricultural development in Henan Province will need to rely on inter- regional cooperation and experience sharing, especially between efficient and backward areas. To promote this, Henan can focus on the following measures: First, industrial collab- oration by leveraging its agricultural foundation and partnering with modern agricultural enterprises and industrial capital from technologically advanced regions. This can be achieved through joint park development and extending the industrial chain, with the goal of building agricultural production bases that improve both production and management levels. Second, Henan should strengthen agricultural openness and external cooperation by implementing institutional strategies that promote multi-level, diversified collaboration. This includes optimizing agricultural foreign cooperation, establishing open platforms, and enhancing international competitiveness to expand agricultural international cooperation. Finally, Henan can enhance agricultural science and technology cooperation by partnering with key agricultural research institutes and universities. Joint efforts should focus on breeding quality seeds, in-depth agricultural product processing, and agricultural ma- chinery innovation. These measures will help improve agricultural management, support sustainable development, and strengthen food security and agricultural modernization in Henan.",
    "This study comprehensively analyzed the spatiotemporal evolution characteristics of CLUE in Henan Province from 2000 to 2020 by constructing a CLUE index based on vegetation coverage, combined with Theil–Sen slope and Mann–Kendall trend test, and based on the optimized ANN and The RF evaluates the combined effects of terrain, climate and human activity factors. The results show that: (1) From 2000 to 2020, the CLUI of Henan Province generally showed a fluctuating upward trend, especially after 2004, 2012 and 2016, which increased significantly. The CLUI in the eastern plains is higher, while the improvement in mountainous areas is slower due to terrain restrictions. (2) Between 2000 and 2020, the CLUI in Henan Province showed obvious spatial differences: the central and eastern regions mainly decreased, and the northern Maintained a stable slight increase, with a significant improvement in the west, while the south fluctuated greatly, showing significant spatial imbalance. (3) Henan Province’s CLUE is mainly affected by human activity factors, especially economic and demographic factors among human activity factors, showing significant positive correlation in Zhengzhou, Xuchang and other places. However, human activities in Puyang in the north and Shangqiu in the west have little impact on CLUE, or even have a negative correlation. The impact of SI output value and Reg. Pop. varies significantly in different regions. For example, Luoyang and Xinyang have a positive correlation, while Zhengzhou and Shangqiu have a weak or negative correlation. At the same time, the impact of Avg. Temp on CLUE has significant regional differences, with a positive correlation in Anyang and Xinyang, and a negative correlation in other regions. The findings of this study provide a scientific basis for future land management and agricultural policy formulation in Henan Province, especially in improving regional CLUE and promoting sustainable agricultural development. Author Contributions: Project administration and funding acquisition, H.Z. and X.M.; writing—review and editing, H.Z., T.J. and C.Z.; writing—original draft and methodology, H.Z., K.L. and C.Z.; investigation, M.W. and K.L. All authors have read and agreed to the published version of the manuscript. Funding: This research was funded by Graduate Education Innovation Plan Project of the Education Department of Xinjiang Uygur Autonomous Region (grant number XJ2024G083); National Natural Science Foundation of China (grant number 42201390 and 42461052); the University of Basic Scientific Business Fees for Scientific Research Projects in the Xinjiang Uygur Autonomous Region (grant number XJEDU2022P014); the Open Project of Key Laboratory in the Xinjiang Uygur Autonomous Region (grant number 2023D04051); the Tianchi Doctoral Program in the Xinjiang Uygur Autonomous Region (grant number TCBS202127); the International Cooperation Scientific Research Project of the Ministry of Education’s “Chunhui Plan” (grant number HZKY20220609); the State Key Laboratory of Desert and Oasis Ecology, Xinjiang Institute of Ecology and Geography, Chinese Academy of Sciences (grant number G2023-02-05); the General Project of the Central Asian Research Institute from Xinjiang University (grant number 24FPY003); and the Key Research and Development Program of the Xinjiang Uygur Autonomous Region (grant number 2022B02003 and 2022B01012). Data Availability Statement: The data provided in this study are available upon request from the corresponding author. The data are not publicly available as they are being collated. Table A1. Statistical results of the overall CLUI and trend of 18 provincial municipalities and provincial-level cities in Henan Province in 2000 and 2020. Table A2. Statistical results of the overall CLUI and trend of 21 county-level cities in Henan Province in 2000 and 2020. Table A3. Statistical results of the overall CLUI and trends in 89 counties in Henan Province in 2000 and 2020."
]