[
    "Heying Li 1,2,3, Jiayao Wang 1,2,3, Jianchen Zhang 1,2,3,4,* , Fen Qin 1,2,3, Jiyuan Hu 1,2,3 and Zheng Zhou 3 Citation: Li, H.; Wang, J.; Zhang, J.; Qin, F.; Hu, J.; Zhou, Z. Analysis of Characteristics and Driving Factors of Wetland Landscape Pattern Change in Henan Province from 1980 to 2015. Land 2021, 10, 564. https://doi.org/ 10.3390/land10060564 Abstract: The study of the temporal and spatial evolution of wetland landscapes and its driving fac- tors is an important reference for wetland ecological restoration and protection. This article utilized seven periods of land use data in Henan Province from 1980 to 2015 to extract the spatial distribution characteristics of wetlands and analyze the temporal and spatial changes of wetlands in Henan Province. Transfer matrix, landscape metrics, correlation analysis, and redundancy analysis were applied to calculate and analyze the transformation types and area of wetland resources between all consecutive periods, and then the main driving factors of wetland expansion/contraction were explored. First, the total wetland area in Henan Province increased by 28% from 1980 to 2015, and the increased wetland area was mainly constructed wetlands, including paddy ﬁeld, reservoir and pond, and canal. Natural wetlands such as marsh, lake, and ﬂoodplain decreased by 74%. Marsh area declined the most during 1990–1995, and was mainly transformed into ﬂoodplain and “Others” be- cause of agricultural reclamation, low precipitation, and low Yellow River runoff. The ﬂoodplain area dropped the most from 2005 to 2010, mainly converted to canals and “Others” because of reclamation, exploitation of groundwater, the construction of the South–to–North Water Transfer Project, and recreational land development. Second, the results of correlation analysis and redundancy analysis indicated that economic factors were positively correlated with the area of some constructed wetlands and negatively correlated with the area of some natural wetlands. Socioeconomic development was the main driving factors for changes in wetland types. The proportion of wetland habitat in Henan Province in 2015 was only 0.3%, which is low compared to the Chinese average of 2.7%. The government should pay more attention to the restoration of natural wetlands in Henan Province. Copyright: © 2021 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). Wetlands are called the “kidneys of the earth” and serve important ecological func- tions, such as water conservation, water puriﬁcation, ﬂood storage and drought resistance, climate regulation, and biodiversity protection [1,2]. Given the rapid socioeconomic devel- opment in recent years, wetland landscapes have become fragmented due to agricultural reclamation, water facility construction, and climate change [3]. Especially for Henan Province of China, as a big agricultural province, there has been excessive utilization of wetland resources. For example, land reclamation, illegal occupation of ﬂoodplain or marsh, and sand mining have caused the conversion of some wetlands into drylands, paddy ﬁelds, or aquaculture ponds. Consequently, wetlands are seriously degraded and shrinking, and the area of wetlands has been signiﬁcantly reduced in Henan Province [4]. It is very important to understand the factors driving the spatial and temporal distribution of wetland changes in Henan Province to help mitigate both current and future environmental challenges. Since the 18th National Congress of the Communist Party of China in 2012, with increasing emphasis on the construction of ecological civilization, the People’s Government of Henan Province has published the Notice on Strengthening Wetland Protection and Management and issued a number of policies, including the Henan Province Wetland Protection and Restoration System Implementation Plan. The report of the 19th National Congress of the Communist Party of China in 2017 pointed out that it is necessary to increase the protection of ecosystems and strengthen the protection and restoration of wetlands [5]. Therefore, quantitative analysis of the change characteristics, transformation mechanism, and driving mechanism of wetland landscape patterns is essential to the protection and utilization of wetland resources. Landscape pattern refers to the spatial distribution and conﬁguration of landscape ele- ments of different types, sizes, and shapes [6]. The landscape metrics area series of indices describes the characteristics of this spatial structure, including patch area, patch density, and mean patch fractal dimension [7]. It can summarize landscape pattern information and reﬂect certain characteristics of its structural composition and spatial conﬁguration [8]. Earlier studies quantiﬁed the landscape pattern of the wetlands along the Yellow River in Henan Province based on the landscape metrics. They suggested that substantial landscape fragmentation has occurred and that the changed landscape pattern was the result of the combined effects of natural and socioeconomic factors [9,10]. However, there are many wetlands in Henan Province. Besides the wetlands along the Yellow River, other wetlands in Henan Province are also worthy of attention. Existing studies on wetlands in Henan Province have mainly focused on qualitative analysis, such as the status of wetland resource utilization and protection measures [5,11]. By analyzing the distribution and changes of wetlands in Henan Province over three periods in 1990–2007, Liang et al. reported that the marsh area has shrunk signiﬁcantly and the pond area has increased signiﬁcantly [12]. However, they did not specify what type of land use the marsh was converted to, and what type of land use was converted to pond. The land use transition matrix comes from the quantitative description of system state and state transfer in system analysis, and such a matrix can clearly show the change and transformation of landscape types in different periods [13–15]. However, few studies have examined the change and transformation of wetland landscape types in Henan Province. Generally, the evolution of landscape patterns should be driven by natural ecological processes or socioeconomic activities. Current research methods on the driving forces of landscape pattern evolution include qualitative and quantitative analyses. Quantitative analysis primarily includes regression analysis, correlation analysis, principal component analysis, and back propagation neural network analysis [16–22].",
    "The objectives of this study were to: (1) investigate the changes of Wetland Landscape Pattern in Henan Province; and (2) explore the driving forces of these changes. Therefore, we established a wetland landscape dataset over 35 years, and the transformation charac- teristics of the wetlands landscape were obtained and driving forces were investigated by using the method transfer matrix and statistical analysis. This study can provide scientiﬁc insight into the protection and management of wetlands in Henan Province. Henan Province (Latitude: 31°23’ N-36°22' N, Longitude: 110°21’ E-116°39 E) is in central-eastern China (Figure 1). The province has a land area of 167,000 km?. There are many rivers in the province, for a total of more than 1500 large and small rivers that belong to four major water systems: the Yellow River, Huai River, Haihe River, and Yangtze River [23]. The province is in the southern warm temperate zone and northern subtropical region. The landform types are diverse, the geographical environment is complex, and the climate has obvious transitional characteristics. With reference to the China Wetlands Resources (Henan Volume), and combined with the feasibility of interpretation, we divided the wetlands in Henan Province into six categories: paddy ﬁeld, canal, lake, reservoir and pond, marsh, and ﬂoodplain, as shown in Table 1 [12,23]. In this study, canal is assigned to constructed wetland, although it includes rivers and ditches. Marsh, lake, and ﬂoodplain belong to natural wetlands, and canal, reservoir and pond, and paddy ﬁeld belong to constructed wetlands. The wetland landscape data used in this study were downloaded from the national land use data provided by the scientiﬁc data sharing platform of the middle and lower reaches of the Yellow River (http://henu.geodata.cn/, accessed on 1 May 2017). A hierar- chical classiﬁcation system of 25 land-cover classes was applied to the Landsat TM/ETM (Enhanced Thematic Mapper) data (Table 2). The 25 classes of land cover were further grouped into 6 aggregated classes of land cover: croplands, woodlands, grasslands, water bodies, built-up areas, and unused land. The land use classiﬁcation system was according to Liu et al. [24]. According to the administrative boundary of Henan Province, the land use data of Henan Province in 1980, 1990, 1995, 2000, 2005, 2010, and 2015 were extracted. We extracted all types of wetlands from land use data, merged other types into “Others”, and generated a new raster ﬁle. After that, they were converted into vector data via ArcGIS 10.3 and converted into a uniﬁed coordinate system WGS1984 at 50◦ N. The socioeconomic data were gathered from the “Statistical Yearbook of Henan Province (1985–2019)”. The observational data of precipitation and temperature were obtained from the monthly dataset (spatial resolution: 0.5◦ × 0.5◦) produced by the China Meteorological Data Service Center. The annual regional average in Henan Province was used as the annual average temperature in Henan Province from 1980 to 2015. To analyze the distribution and change characteristics of the wetland landscape pattern in Henan Province from 1980 to 2015, this study used seven periods of national land use data to generate a wetland landscape vector dataset in Henan Province and calculated the patch area, patch density, and mean patch fractal dimension to analyze the temporal and spatial distribution characteristics of the wetland landscape. The transfer matrix method was applied to analyze the characteristics of transfer and change between different types of wetland landscapes and between wetland landscapes and “Others”. Considering the number and characteristics of variables, the driving force of wetland landscape evolution in Henan Province was studied by combining qualitative and quantitative methods. Judge- ment analysis, which belongs to qualitative method, was selected to build a set of driving force variables of landscape pattern from natural views and economic ones according to the previous literatures, while correlation analysis and redundancy analysis, which belong to quantitative analysis, were employed to ﬁnd out which variables were real inﬂuence factors of landscape pattern. In this study, patch area (PA), patch density (PD), and mean patch fractal dimension (MPFD) were selected to reﬂect the characteristics of landscape fragmentation and degree of human disturbance, respectively. The meaning of the speciﬁc formula and the calculation method are shown in Table 3 [6,25,26]. The three metrics were calculated by combining the spatial statistical analysis function of ArcGIS 10.3 and Microsoft Excel 2010.",
    "The transfer matrix can reﬂect the conversion between land use types in two periods, including the transfer source, destination, quantity, and other information. It was ﬁrst applied to land use changes and was also used to analyze changes in wetland types [27]. Its mathematical expression is: where S is the area of wetland type, n is the total number of wetland types, and Sij represents the area of type i wetland converted to type j wetland from the beginning to the end of the study period. The sum of each row of the transfer matrix represents the total area of the wetland type at the beginning of the study period, and each row value represents the transfer area to other wetland type; the sum of each column represents the total area of the wetland type at the end of the study, and each column value represents the transferred area from other wetland type. To calculate the transfer matrix of wetland types, it is necessary to use the overlay analysis module of ArcGIS 10.3 to intersect the land use data of different years, calculate the area and export the attribute table, and complete the data extraction of the transfer matrix in Microsoft Excel 2010. To ensure the integrity of land use data in Henan Province, all land use types (except the wetland types listed in Table 1) were integrated into the “Others” category when calculating the transfer matrix. The measured landscape metrics were analyzed by one-way ANOVA to test the signif- icant differences between the constructed wetlands and natural wetlands [28]. Meanwhile, the Pearson correlation analysis was employed to explore the signiﬁcant relationship be- tween economic indicators and landscape metrics [29]. Based on the indicators selected by Pearson correlation coefﬁcient at p = 0.05, redundancy analysis (RDA) was applied to clarify the relationship between landscape pattern and economic development [30]. All data analyses were carried out in SPSS 20.0 for Windows software package and Canoco 5.0 for Windows software package. From Figure 1, paddy ﬁelds were the main wetland type and distributed mostly in the south of Henan Province. Canals were distributed throughout the study area. There were several big reservoirs and ponds distributed in the west and south of Henan Province. Marshes were north of the Yellow River. Lakes were mostly on the eastern boundary of Henan Province. The total wetland area of Henan Province increased by 28% from 1980 to 2015, despite some ﬂuctuation (Figure 2), which was mainly driven by the conversion of “Others” into constructed wetlands (represented by the increase of paddy ﬁelds, reservoirs, and ponds). The paddy ﬁeld area was the largest at 7699.11 km2 (a signiﬁcant increase from 4970.54 km2 in 1980). From Figures 1 and 2, we can see that paddy ﬁelds were the dominant wetland landscape in Henan Province and were mainly distributed in Xinyang City, while the proportions of other types of wetlands were small. The total area of natural wetlands was 537.75 km2, which was only 7% of the paddy ﬁeld area. It decreased by 74% from 1980–2015 (Figure 3). The marsh area was the smallest at 1.38 km2 (a signiﬁcant degradation from 59.5 km2 in 1980). The area of reservoir and pond increased by 61%. The canal area increased by 64%. The patch density of the wetland landscapes in Henan Province are shown in Figure 4. The PD values of constructed wetlands (paddy ﬁeld and reservoirs and pond) were rela- tively high, indicating high degree of landscape fragmentation. Combined with Figure 3, the PA values of constructed wetland increased year by year, the number of patches also increased. The mean patch fractal dimension (MPFD) reﬂects the impact of human activities on the landscape pattern (Figure 5). The closer its value is to 1, the greater the effect of human activities have on the landscape. The results indicated that constructed wetlands were signiﬁcantly impacted by human activities. The one-way ANOVA test indicated that the landscape metrics between constructed wetlands and natural wetlands had signiﬁcant differences. Therefore, two categories of wetlands were analyzed from different perspectives in Section 4.3. The transfer matrix of wetland landscape types from 1980 to 2015 is displayed in Table 4. In this period, the total wetland area in Henan Province increased by 2580.46 km2. The increased wetland area was mainly composed of constructed wetlands. The area of the three wetland types increased by 4076.57 km2. Natural wetlands such as marsh, lake, and ﬂoodplain decreased by 1496.11 km2. Marsh area decreased 98%, and ﬂoodplain area decreased by 73%. The marsh area was mainly converted to “Others” and reservoir and pond (Figure 6). The ﬂoodplain area was transformed to “Others”, canal, and reservoir and pond. It can be concluded that with the increase of constructed wetland area, the natural wetland area decreased (Figure 7).",
    "From 1980 to 1990, the paddy ﬁelds increased by 431.91 km2, due to the conversion from “Others”. With the expansion of the Banqiao Reservoir, the reservoir area increased by 170.97 km2, primarily from the conversion of ﬂoodplain and “Others”. The ﬂoodplain area declined by 349.70 km2, which was largely converted into canals and “Others”. The main reason for the degradation of ﬂoodplain is that the runoff of the Yellow River decreased continuously in the 1980s and 1990s [31]. In particular, after the Longyangxia Reservoir was put into operation in 1986, the water and sediment in the lower reaches dropped sharply. This caused sediment deposition on the lower riverbed and the intensiﬁcation of the “second-level suspended river” phenomenon in the lower reaches of the Yellow River. During this period, the wetland landscapes were seriously fragmented [32,33]. From 1990 to 1995, the paddy ﬁeld area increased by 1151.75 km2, of which the conversion of “Others” into paddy ﬁelds accounted for the greatest proportion, followed by the conversion of ﬂoodplain and reservoir and pond. The increased paddy ﬁeld was the application of new technology in rice planting. The marsh area decreased by 59.68 km2 (or a decrease of 99%), which was mainly converted into ﬂoodplain and “Others”. By analyzing the change trend of the annual precipitation and the Yellow River runoff from 1990 to 1995, we can see that the precipitation and runoff experienced a decreasing trend [34]. The marshes did not receive water replenishment and gradually dried up in that period. Then they were turned into dryland or other landscapes because of agricultural reclamation. The paddy ﬁeld area decreased rapidly by 1092.84 km2 from 1995 to 2000 (mainly converted to “Others”). The decreased paddy ﬁelds were the failure of the promotion of new rice planting technology. The canal area increased by 335.17 km2, mainly due to the conversion of “Others”, followed by ﬂoodplain. The marsh area increased by 20.59 km2 (mainly transformed from ﬂoodplain and “Others”), mostly concentrated in the vicinity of the Yellow River. The increase in the areas of most wetlands (such as canal, marsh, and ﬂoodplain) was related to the abundant precipitation during 1995–2000. From 2000 to 2005, the reservoir and pond area increased by 482.08 km2 because of the operation of the Xiaolangdi Reservoir and the construction of the Yanshan Reservoir. The lands used to construct these reservoirs were mainly from “Others”. converted from “Others”. The main reason for this was that Duliang rice from Kaifeng was gradually packaged and branded after 2003. Especially in 2007 and 2008, Duliang rice became well-known at home and abroad, and its output and area increased [35]. The canal area rose by 795.87 km2, mainly from the conversion of ﬂoodplain and “Others”. The key reason for the increase of the canal area was that the Henan section of the main canal of the ﬁrst phase of the middle route of the South–to–North Water Transfer Project was constructed in 2006, and most parts of the canal were open channels. The marsh area decreased from 21.99 km2 to 6.30 km2, mainly converted into “Others” and reservoir and pond. This was caused by both reclamation and the exploitation of groundwater. The drop in water level led to the drying up and disappearance of marshes. The ﬂoodplain area dropped by 751.64 km2, which was mainly converted into canal and “Others”. In general, the mutual transformation between canal and ﬂoodplain was mainly caused by changes in water volume. The decreased area of ﬂoodplain was also related to the construction of the South–to–North Water Transfer Project. In addition, reclamation and recreational land development occupied a large area of the ﬂoodplain. Natural wetlands declined considerably in this period, especially for marshes. From 2010 to 2015, Xixiayuan Reservoir was put into use and the land used for its construction was mainly non-wetland type land. The construction of reservoir blocked the surface water supply to marshes. With the drop of the groundwater level, hygrophytes and aquatic plants were gradually replaced by xerophytes. The marsh area was reduced from 6.30 km2 to 1.38 km2, and marshes were degraded into drylands. Based on the annual precipitation and temperature data of the China Meteorological Data Service Center, we plotted the change curve of precipitation and temperature in the study area from 1980 to 2015 (Figure 8). From 1980 to 2015, the annual average temperature of Henan Province ﬂuctuated and trended upward (R2 = 0.6, p < 0.01), while the annual precipitation ﬂuctuated slightly with no upward trend. With the increase in temperature, transpiration of wetland vegetation escalated [36], but precipitation did not increase signiﬁcantly, which caused the shortage of water supply to wetland vegetation and the shrinkage of the wetland area.",
    "The analysis in Section 4.3 indicated that human activities such as water conservancy facilities and agricultural reclamation were the key driver of wetland transformation. These activities contributed to socioeconomic development. Meanwhile, economic development has promoted the excessive use of wetland resources, such as overﬁshing, cutting reeds, overgrazing, and caused ecological imbalance of wetlands. Therefore, economic indicators, including gross domestic product (GDP), total population, primary industry value (PIV), and urbanization rate (urban population divided by total population) from 1985 to 2015 were selected to analyze the relationship between socioeconomic and wetland area transfor- mation. The effect of various economic indicators on the evolution of the landscape pattern is shown in Table 5. Table 5 reveals that GDP, total population, PIV, and urbanization rate were positively correlated with PA, PD, MPFD of constructed wetland. These four economic indicators were negatively correlated with PA, PD, MPFD of natural wetland. The correlation coefﬁcients between PA of natural wetland and GDP, total population, PIV, and urbanization rate were −0.902 (p < 0.01), −0.943 (p < 0.01), −0.943 (p < 0.01), and −0.910 (p < 0.01), respectively. Floodplain and marshes belonging to natural wetlands were very suitable for agricultural reclamation because of their rich nutrition, and they were also suitable for urban construction because of their convenient water supply and beautiful landscapes. Therefore, the correlation coefﬁcients of natural wetland landscape metrics to the four economic indicators were all strongly negative except MPFD. The values of MPFD of natural wetland and constructed wetland are similar to each other in different periods. Therefore, the correlation coefﬁcient did not pass the t test. The paddy planting was a part of the agriculture in Henan Province. It contributed to PIV directly. Hence, the correlation coefﬁcient of PA of constructed wetland and PIV is larger than that of PA of constructed wetland and GDP. Apparently, socioeconomic development has promoted the expansion of the constructed wetlands while causing precipitous reduction of natural wetlands. Furthermore, RDA was performed to explore the relationship between landscape metrics and economic indicators. As shown in Figure 9, the ﬁrst two axes cumulatively explained 93.81% of the variation of landscape pattern, which indicates that the ﬁrst two axes can fully explain the relationship between landscape pattern changes and economic in- dicators. From 1980 to 2015, the landscape pattern indicators PDCW, PACW, and MPFDCW are positively correlated with economic parameters, whereas the indicators PDNW, PANW, and MPFDNW are negatively correlated. The construction of water conservancy projects has destroyed the original ecological balance of wetlands, cut off the water source of natural wetlands, and caused natural wetlands to shrink and degrade. Although the construction of the South–to–North Water Transfer Project and other water diversion and irrigation projects has promoted the ex- pansion of canal area, the construction of cement dams has cut off the lateral hydrological connectivity, resulting in the degradation of the ﬂoodplain due to water shortages [37]. Unreasonable reclamation, excessive grazing, and illegal construction are the direct causes of the degradation of ﬂoodplain and marsh. Industrial and agricultural production, domestic water use, and over-exploitation of groundwater have reduced water resources in wetlands. Since the water resources of wetlands cannot be effectively recharged, they have dried up on a large scale. Economic development has promoted the excessive use of wetland resources, such as overﬁshing, cutting reeds, and overgrazing, and caused ecological imbalance of wetlands. The promotion of branded rice has promoted economic development, and rice paddy area has increased signiﬁcantly. Most constructed wetlands (e.g., paddy ﬁeld and pond) need water supply. However, it can be found that water resources from runoff of the Yellow River and precipitation are not adequate to guarantee supply to both the natural environment and human beings [38]. In view of this, the government of Henan Province has been vigorously promoting wet- land protection measures. As of 2014, the government has built 25 wetland nature reserves and established 8 wetland parks, according to the second survey of wetland resources in Henan Province [23]. The wetland protection rate was 30.56%. Previous studies have examined the wetland restoration models of nature reserves. Different wetland restoration models should be adopted according to the local conditions for different wetland nature reserves [39]. The total wetland area was about 7% of the total area of Henan Province in 2015. However, the natural wetland area was only 0.3%. Although the constructed wetlands increased the proportion of the total wetland, they are the result of social and economic development. In the long run, they are not conducive to the healthy development of the ecological environment. For such a large agricultural province, the best way to balance the relationship between cultivated land and the ecological environment needs to be studied carefully.",
    "Socioeconomic development has brought great challenges to the wetland ecological environment, especially in large agricultural provinces such as Henan Province. This study used seven periods of national land use data to generate a wetland landscape dataset in Henan Province over 35 years. The spatiotemporal variation characteristics of wetlands, the transformation types and areas of wetland resources between all consecutive periods, and the driving factors were obtained. We found that the paddy ﬁeld area was largest among the wetland landscapes, and it was mainly distributed in the south of Henan Province. The wetland landscape with the smallest area was the marsh, and as of 2015, the marsh area was only 1.38 km2. It was mainly distributed north of the Yellow River. The proportions of natural wetland were very small in the seven periods. The natural wetland decreased by 74%, while the constructed wetland increased by 57%. The conversion mostly occurred between the wetland types and “Others”. Through the detailed analysis between all consecutive periods, we found that precipitation, the runoff from the Yellow River, the construction of reservoirs, the South–to–North Water Transfer Project, and the promotion of brand rice were the driving forces to wetland change, and the dominant factor was different in different periods. The correlation analysis and redundancy analysis indicated that socioeconomic development has promoted the expansion of constructed wetlands while causing the precipitous reduction of natural wetlands. The development of social economy promoted the construction of water conservancy facilities and the cultivation of paddy ﬁelds, which increased PIV and GDP. However, it caused wetland fragmentation and even shrinkage and degradation of natural wetlands. Natural wetland restoration should be paid more attention to while developing economy. This study can serve as a reference for the balance between the socioeconomic development and ecological environments protection. Author Contributions: Conceptualization, methodology, and writing—original draft preparation, H.L.; writing—review and editing, J.Z.; visualization, supervision, and funding acquisition, J.W.; formal analysis, F.Q.; investigation, J.H.; data curation, Z.Z. All authors have read and agreed to the published version of the manuscript. Funding: The Project Supported by the Open Fund of Key Laboratory of Urban Land Resources Monitoring and Simulation, Ministry of Natural Resources (Grant No. KF-2020-05-037), and National Natural Science Foundation of China (Grant No. 42005031)."
]