[
    "Qingyun Di1,2,3,4,∗, Changmin Fu 1,2,3,4, Guoqiang Xue3,4,5, Miaoyue Wang1,2,3,4, Zhiguo An1,2,3,4, Ruo Wang1,2,3,4, Zhongxing Wang 1,2,3,4, Da Lei1,2,3,4 and Xianjun Zhuo6 Laboratory of Shale Gas and Geoengineering, Institute of Geology and Geophysics, Chinese Academy of Sciences, Beijing 100029, China; 3Innovation Academy for Earth Science, Chinese Academy of Sciences, Beijing 100029, China; 4College of Earth and Planetary Sciences, University of Chinese Academy of Sciences, Beijing 100049, China; 5Key Laboratory of Mineral Resources, Institute of Geology and Geophysics, Chinese Academy of Sciences, Beijing 100029, China and 6China Ship Research and Development Academy, Beijing 100101, China Skywave refers to the electromagnetic wave reflected or refracted from the ionosphere and propagated in the form of a guided wave between the ionosphere and the Earth’s surface. Since the skywave can propagate over large distances, it has been widely used in long-distance communication. This paper explores and demonstrates the feasibility of skywave for deep resource and energy exploration at depths of up to 10 km. Theoretical and technical advancements were accomplished in furthering skywave applications. A new solution method based on Green’s function has been developed to study skywave propagation in a fully coupled lithosphere-air-ionosphere full space model. For the first time, the model allows one to study skywave distribution characteristics in the lithosphere containing inhomogeneity such as ore deposits or oil and gas reservoirs. This model also lays a foundation for skywave data processing and interpretation. On a parallel line, we have developed a multi-channel, broadband, low-noise, portable data acquisition system suitable for receiving skywave signals. Using the skywave field excited by a high-power fixed source located in central China, actual field surveys have been carried out in some areas in China including the Biyang depression of Henan Province. The initial results appear encouraging—the interpreted resistivity models prove to be consistent with those of seismic exploration and known geological information, and the exploration cost is only ∼1/4 to 1/10 that of seismic surveys. These initial successful applications of the skywave theory lay a solid foundation for further verification of the new method. Skywave refers to electromagnetic (EM) waves propagating in the waveguide formed by the iono- sphereandtheEarth’slithosphere[1–7].Duetothe large contrast in the electrical property between the ionosphereand air and between thelithosphere and air, the EM waves are reflected back and forth be- tween the ionosphere and the lithosphere as they propagate within the air waveguide. The skywave was first applied in radio communication [8–11]. Since skywave propagation is not affected by the curvature of the Earth, long-distance communica- tion can be achieved (Fig. 1a). In traditional ra- diocommunication,high-frequency(>3MHz)EM waves are usually used for efficient information travelveryfarintheair,makingremotecommunica- tionwithhigh-frequencyradiowavespossible.Inthe middle of the 20th century, with the widespread de- ploymentofsubmarines,demandemergedforcom- munication between land and underwater vehicles. However, because of the rapid attenuation of high- frequency EM waves in seawater, underwater vehi- cles could not receive signals transmitted from the land. To tackle the problem, the possibility of us- ing low-frequency skywave for long-distance com- municationwasexplored[12–20].Forexample,the United States established two super-low frequency (SLF, 30–300 Hz) transmitting stations (WTF and MTF) in Wisconsin and Michigan for communica- tion at a distance of 4600 km and a water depth of 100 m. The former Soviet Union set up a larger SLF transmitting station (ZEVS) in the high-resistivity area of the Kola Peninsula, and successfully realized the communication between land and underwater submersibles at a distance of 8000 km and a water depthof100m.Tofurtherincreasethedepthofun- derwater communication, scientists from all around the world have also explored the extremely low fre- quency (ELF, 3–30 Hz) band [21–24]. Due to the difference in electrical properties of underground resources, the EM method has be- come the key technology in resource exploration [25–29]. The controlled-source audio-frequency magnetotelluric (CSAMT) method has been one of the most important methods used for resource ex- ploration in the earth [30]. The CSAMT method has the advantages of high resolution, strong anti- interference ability and high operational efficiency, and has gradually become the mainstream method for resource exploration worldwide. However, the CSAMTmethodhasthelimitationsoflowtransmit- ter power, small signal coverage and shallow sound- ing depth. The actual depth of investigation of the CSAMTmethoddependsontheresistivitystructure of the survey area (for the geological environment of China, the depth of investigation of the CSAMT methodisusually<1.5km).Withthegradualdeple- tion of shallow resources, demand has become in- creasingly high for exploration methods with larger depth of investigation [31,32].",
    "Skywave bears great potential in resource explo- ration in the earth due to its large penetration depth into the lithosphere. Russian scientists have applied ZEVSsignalstogeophysicalstudies,earthquakepre- diction and space physics areas [33–36]. However, skywave applications for resource exploration have been scarce. The first challenge in applying skywave to resource exploration is the establishment of a proper physical model. In skywave communication, the Earth’s lithosphere is assumed to be a near- perfect conductor so that it is largely excluded from the model. However, for resource exploration, this model becomes inadequate as the heterogeneities in the lithosphere now become the main target of interest. Thus, a fully coupled lithosphere, air and ionosphere model must be used (Fig. 1b). The sec- ond challenge is the lack of proper data acquisi- tion equipment. The required equipment must be able to acquire multi-channel and wide-band data, and must have extremely low noise level. Mean- while, the equipment must be sufficiently cost ef- fective for large area exploration. However, no suit- ableinstrumentwasavailableonthemarkettomeet both the technical challenges and the economic re- quirements. Therefore, new equipment had to be developed.Moreover,literatureonthedataprocess- ing of skywave signals was rare. In this paper, we report some of the breakthroughs we have made in recentyearsinskywavetheoryandequipmentdevel- opment for resource exploration. We also present a fieldexampletoillustratetheapplicationofskywave theory to oil and gas exploration. To study skywave propagation in the lithosphere, a fully coupled lithosphere-air-ionosphere model is firstestablished.Thismodelisdifferentfromthetra- ditional skywave model for communication in that the communication model excludes the lithosphere completely, whereas the fully coupled model en- ables the study of the lithosphere, including any in- homogeneity within. Also, the fully coupled model allows for the study of skywave propagation and attenuation over large distances. The model lays a foundation for skywave survey design and data interpretation. For skywave propagation over a large distance, a spherical Earth model should be used to accu- rately account for the Earth’s curvature. However, for propagation distances on the order of a few hundred kilometers, a planar model can be ade- quate. We derive the planar full-model skywave the- ory by expanding the half-space CSAMT model to include ionosphere and lithosphere. The solu- tion is achieved by the integral equation method basedontheGreen’sfunction,andderivedusingthe R-function and layer-matrix method [37,38]. By using the R-function and layer-matrix method, we calculate the Green’s function for horizontal lithosphere-air-ionosphere model over the territory of China. The Green’s function is used as the kernel of the integral equation method for three-dimensional (3D) modeling [39]. Figure 2 the showsthemodelresultfortheelectricandmagnetic field distributed over the entire land area of China (see Supplementary Data for how the 3D geoelec- tricalmodelisbuilt).Fortheparticulartransmission antenna layout, both Ex and Hy fields are divided into four quadrants (north, east, south and west). Along the NE-SW and NW-SE directions, the field strengths are locally diminished. These aerial field variations should be taken into account when doing the survey design and data interpretation. receiver system for our needs. The specifications of the new broadband and low-noise system are listed inSupplementaryTables1and2.Figure3showsthe main components of the system. Field experiments proved that the newly developed acquisition system wasabletoacquireskywavefieldsforresourceexplo- ration at a depth of up to 10 km. It is worth men- tioning that the instrument may also be used for traditional CSAMT and MT surveys. For traditional CSAMT or magnetotelluric (MT) applications,differentkindsofreceiversareavailable on the market for EM exploration [40]. However, none of the receivers were designed for acquiring skywave signals. Their bandwidths and noise rejec- tion capabilities appear inadequate for skywave ap- plications. In this regard, we have developed a new Prior to any field survey, we conducted experi- mental field studies to validate the skywave mea- surement against the well-known CSAMT and MT methods. This would establish a solid basis for per- forming massive skywave surveys. It is helpful to first understand how the different methods respond to a layered Earth model. For survey parameters similar to those used in this study, Supplementary Fig. 3 shows that, over all frequency ranges of in- terest, both the skywave and the MT responses are characterized by plan wave propagation, whereas the CSAMT method demonstrates the near-field feature at the lower frequencies due to the short transmitter-receiver spacings. This result suggests that the skywave data in the modeled transmitter- receiverdistancerangecanbeinterpretedastheMT data. Next, the skywave method was validated against the MT method over an area with low levels of EM noise. As Supplementary Fig. 4 shows, over the overlapped frequency band, the skywave sound- ing curves compare well in general with the MT response curves, with the skywave response being more stable than the MT response. The skywave method was further compared to both the CSAMT and MT methods in a highly noisy area. As Sup- plementary Figs 5 and 6 illustrate, the skywave data show good consistency over the entire frequency range, whereas the CSAMT or MT data demon- strate uninterpretable variations or outliers due to environmental noise.",
    "Two skywave surveys were carried out in China. The first study area was in Chongqing, southwest China,∼700kmawayfromthetransmitter.Thesec- ond test area was in Henan Province, central China, ∼300kmawayfromthetransmitter.Inbothcases,a total of 30 sets of receiver systems were deployed. In the Mingyuexia oil and gas area, the skywave exploration result was compared with seismic im- ages. The skywave method was able to outline the largest regional fault, from a resistivity anomaly, as explainedbytheseismicreflectionimage.Bothelec- trical and seismic reflection images show the typical chevron anticlines of the Huaying Mountain fold- and-thrust belt thin-skinned structures. The inter- ested reader should refer to [41] for more details. ThispapershallfocusontheBiyangdepressioncase study. The study area is part of the Biyang depression in the Henan Province. Figure 4a and b show the geological structure of this area as determined by previous studies. The Biyang depression is a fan- shaped depression with a southeast–northwest ori- entation. The major basal structures are normal faults, named F1 through F4. The primary basin fault F1 spans 5 km horizontally and is located at the southern extent of the survey line. Part of the Wangji-Xingzhuang tectonic zone (WXTZ) is gen- erallyadjacenttothenortherngentleslopezone(lo- catedatdistancesof25kmto33kminFig.4b)along the boundary of Fault F3 (marked in Fig. 4b). Most In this survey, a transmitter in central China was used. The transmitter consists of a north–south ori- ented antenna that is 60 km long and located on the surfacewithbothendsgroundedintheearth.Asinu- soidalcurrentwasinjectedintotheearththroughthe grounded wire, and the oscillating current created EMwavesthatpropagatedoutwards.Duringthesur- vey, 24 frequencies were transmitted in the range of 0.1 Hz to 256 Hz (see Supplementary Table 3). with an azimuth of 174◦, and the spacing between skywavereceiverswas80m(Fig.4a).Thesignalwas collected in a scalar CSAMT format in this study, wheretheelectricfieldExandthemagneticfieldHy were recorded. The data processing was also similar to that in CSAMT [42]. The apparent resistivities were used to perform a laterally constrained inver- sion [43,44]. The inversion model obtained from the skywave data (Fig. 4c) shows good agreement with the basin geometry. The resistivity model suggests that the studyareacanbedividedintothreepartsfromsouth to north: an outcrop zone in the south of the base- ment rock (I), a depression zone in the middle (II) and a gently sloping zone in the north (III). In ad- dition, there are two areas with complex resistiv- ity structures along the survey line: the Anpeng- Yinzhuang tectonic zone (APTZ) and the WXTZ. Combined with the stratigraphy of the study area, a comprehensive interpretation is provided in Fig. 4c. A comparison of Fig. 4b with Fig. 4c demon- strates that the resistivity structures determined by inversion of the skywave data are consistent with the known fault structures. In particular, the hydro- carbon layer can be distinguished by the resistivity values in the range of 1-30 Q m, thereby providing important guidance for subsequent drilling. The re- sistivity model also shows a deep low-resistivity zone toward the northern end of the profile that was not present in the geological mapping. To apply the extremely low-frequency skywave to the exploration of deep Earth resources, the the- ory on the skywave wave propagation has been ex- tendedtoafullycoupledlithosphere-air-ionosphere model. The R-function and layer-matrix method are used to solve the problem of skywave based on the 3D integral equation method. The inclusion of displacement currents in the model allows the accurate study of skywave propagation within the lithosphere-ionospherewaveguideonaglobalscale. For practical application of the skywave theory, we have developed a new multi-channel, broadband, low-noise and portable data acquisition system suit- able for field surveys. Field studies have been suc- cessfully carried out in the Mingyuexia oil and gas area of Chongqing and the Biyang depression of Henan Province, and the resistivity models were derived from the skywave signal for depths up to 10 km. The obtained lithospheric models are con- sistent with those of seismic exploration and known The skywave method has a few important advan- tages over the MT and CSAMT methods. By us- ing a much more powerful transmitter than in the CSAMT method, skywaves can be detected at a dis- tance of thousands of kilometers from the transmit- ter. These waves may be processed as plane waves, as in the MT method, greatly simplifying the data interpretation for the structure of the Earth’s crust. Because the skywave method uses human-made sources, the signal-to-noise ratios are more control- lablethanfortheMTmethodandthedataqualityis generally better.",
    "Our theoretical research and field case studies show that extremely low-frequency skywave explo- ration may become one of the practical methods for resource and energy exploration within the upper 10 km of the crust. The cost of this method is sig- nificantly less than the seismic exploration method. Inaddition,theskywavemethodhasthepotentialof discriminatingoilorgasfromwaterbasedonthere- sistivitycontrastsofthefluids.Whencombinedwith seismic methods, the skywave method can be effec- tively applied in exploration of deep oil and gas. The field examples show that the skywave signal can be stronger or even much stronger than back- ground noises. Given the broad signal coverage, a large area (e.g. the whole of China) can be sur- veyed simultaneously as long as a sufficient num- ber of survey stations cover the survey area. This can greatly reduce survey costs. Offshore applica- tioncanbeanotherareaworthexploring.Extremely low-frequency skywave may supplement or super- sedethetraditionalmarineEMmethodsforoffshore exploration. As a resource exploration method, the extremely low-frequency skywave method warrants further study in some aspects. For example, few studies are available to address the response characteristics of the skywave in the near-field, far-field and waveg- uide areas. The applicability and limitations of the methodformineralexplorationinthesedifferentar- eas call for more theoretical and field studies. An- other area of study is the intermediate zone effect that describes the influence of lithospheric hetero- geneities between the transmitter stations and sur- veyareas.Inthisstudy,wehaveassumedthatground waves are highly attenuative and can be ignored in the acquired skywave data. Nevertheless, a detailed study of the intermediate zone effect may yield new insights into the skywave method for mineral explo- ration.Also,foruseinareasveryfarfromthesource, it is necessary to develop the theory of a spherical layered model. For the R-function method, the upper half-space in- cludes two layers: air and the ionosphere. The lower half-space is an N-layer lithosphere, and the N-th layer extends downward infinitely. The integral so- lution of the model is derived, and the numerical solution of the lithosphere-air-ionosphere model is obtained by using the Fast Hankel transform. The field of c peu pz + dpe−u pz, the VP = c∗ peu pz + d∗ pe−uoz, where p = −1,0,1,2..., N. When p = −1, dp = 0, d∗ p = 0, there are only upward waves. When p = N, c N = 0, c∗ N = 0, there is only a downward wave. When the air layer contains the source, X0 = c0eu0z + d0e−u0z + Xs, where Xs = λ e−u0|z+h0| isknown.Theparametersc p,dp, u0 c∗ p, d∗ p that need to be solved are unknown, where p = −1,0,1,2,... N.Aftergettingtheseparame- ters, we can calculate the EM field. In the solution, the R-function is defined in the lower half-space, p(z) = d∗ pe−u p z+c∗ RP(z) = dpe−u p z+c peu p z dpe−u p z−c peu p z, R∗ pe−u p z−c∗ d∗ peu p z peu p z. The function at the interface of each layer can be obtained by recursions. It can further be proved that Since R,(0) and R7(0) are known, the ratio of the field in the first layer of solid rock X,(0), its vertical derivativeX{ (0), V|(0), and its vertical derivativeV{ (0) are determined. For the layer-matrix method, the air layer and iono- sphereintheupperhalf-spacecanhavearbitrarylay- ers, and the lithosphere layer in the lower half-space canalsohavearbitrarylayers.Thefull-spaceGreen’s function in the wave number domain is derived by using the layer-matrix method, while the numerical solutionoftheGreen’sfunctioninthefrequencydo- main can be obtained by Fourier integration. In the layer-matrix method, the air layer is set as the 0-th layer, the ionosphere is composed of M-layers and the lithosphere layer is composed of N-layers.Thedepthofthefirstlayerintheupperhalf- space is z−p, where p = 1,2,..., M, the depth of thelowerhalf-spaceiszp,wherep = 1,2,..., N.It can be deduced that In the above equations, ux and Vz have the same meaning as those in the R-function method X and V, and aRp and a−1 Rp are the layer matrix and the inverse matrix for the p-th layer. Similar to the R-function method, after the coefficients of the air layerareobtainedbyusingtheboundaryconditions, thevaluesofeachcomponentofthesurfacefieldcan be obtained. Based on the boundary conditions, the FourierintegraloftheEMfieldineachlayercanalso be derived. We would like to thank Dr. Rixiang Zhu for his valuable sugges- tions and comments that helped improve the clarity of the paper. We are grateful to Dr. Jianxun Lu for leading us into the field of skywave exploration and for assistance with this work. We thank Prof.GuangyouFangandhisteamfortheirhardworkindevelop- ingthemagneticcoil.TheauthorsalsothankDr.TsiliWangforhis good suggestions that improved the readability of this paper. We areespeciallygratefultoProf.MartynJ.Unsworthforhisvaluable suggestions and many fruitful discussions. We thank the review- ers for their thorough and constructive suggestions that helped improve this paper.",
    "This work was supported by the National Science and Technol- ogy Infrastructure Program Wireless Electromagnetic Method project,theNationalKeyResearchandDevelopmentProgramof China (2018YFC0603200), the National Natural Science Foun- dation of China (41874088) and the Strategic Priority Research Program of the Chinese Academy of Sciences (XDA14050000). Q.D. designed and supervised the research. C.F. analyzed all the data and co-wrote the manuscript. G.X. and M.W. contributed to the analysis and co-wrote the manuscript. Z.A. and R.W. pro- cessedthedata.Z.W.developedthereceiversystem.D.L.partici- pated in the experiments. X.Z. assistedin the experimental analy- sis. All authors approved the final version prior to submission for publication."
]