[
    "Qiangian Zhang! - Zheng Wang’ - Yanping Lv? - Jiang Zhao? - Qiang Dang? - Dongfeng Xu’ - Dongxiang Zhao’ - Haiyang Liu’ - Ziqi Wang! - Xingru Zhao! - Zhiwei Xu° - Xiaoju Zhang! Received: 22 December 2020 / Accepted: 28 January 2021 / Published online: 13 February 2021 © Japan Human Cell Society 2021 Since December 2019, the novel coronavirus SARS-CoV-2 pandemic (COVID-19) outbroke in Wuhan and spread in China. Here we aimed to investigate the clinical and radiological characteristics of COVID-19 cases. We collected and analyzed the clinical data of 172 hospitalized cases of COVID-19 who were diagnosed via RT-PCR of nasopharyngeal swabs during January 2020 and February 2020. The chest images were reviewed by radiologists and respirologists. The older patients with COVID-19 in Henan Province had more severe disease and worse prognosis. The male sex, smoking history and Wuhan exposure of patients are not related to the severity or prognosis of COVID-19. Family gatherings were showed among 26.7% of patients. A greater proportion of patients in the severe group suffer from combined chronic diseases. CT results showed that most patients had bilateral lung lesions and multiple lung lobes. The lungs of severe patients are more damaged. Both the infection range and inflammatory factor levels are related to the poor prognosis. Antiviral drugs, immunoglobulin and traditional Chinese medicine are mainly used for the treatment of COVID-19 patients. The discharge rate of COVID-19 patients was 93.0%, and the mortality rate was 2.3%. Case type, lymphocyte ratio grade, and respiratory failure at admission are risk factors for poor prognosis, except for the number of infiltrating lung lobes. The results showed that severe disease process, lymphopenia and respiratory failure are risk factors for the COVID-19. . . . . Since December 2019, a novel respiratory virus pandemic outbroke in Wuhan, Hubei Province, China [1-8]. It has spread to other provinces in China as well as to other coun- tries, which infected more than 400,000 people and was : : : responsible for over 18,000 deaths worldwide till Mar 24th, 2020, as the victim numbers tend to be rising despite meas- ures undertaken for controlling it. One of the utmost of stop- ping the pandemic is to fully recognize, isolate and cure the patients together with a more comprehensive understandings of both the disease and the virus. The virus was identified as the seventh member of enveloped RNA coronavirus (subgenus sarbecovirus, Orthocoronavirinae subfamily) by high-throughput sequencing, and was named as SARS-CoV-2 [9, 10]. Pneu- monia associated with SARS-CoV-2 infection is named COVID-19 [10], which resembles some clinical features of severe acute respiratory syndrome (SARS) and middle east respiratory syndrome (MERS) [1-8]. Presumably, the while in some countries the fatality rate may rise to 6-8%. The contagion of SARS-CoV-2 seems to be much more difficult to be dealt with, as revealed by 10-20 times higher affinity of spike glycoprotein to ACE2 compared to SARS [11], an estimated RO of 3.0-4.0 [6] and by reported cases of insidious contagion by asymptomatic carriers as well as familial, in-prison and in-hospital transmission [6, 12, 13]. Recent studies have shed light on the characteristics and prognosis of patients with COVID-19. The preliminary report by Huang et al. [1] highlighted the first 41 Wuhan patients with their clinical features and courses, laboratory test results including the existence of detectable serum viral RNA and elevated serum inflammatory cytokine levels, high risks of ARDS and ICU admission, and unfa- vorable outcomes in critically ill patients. Yang et al. [14] demonstrated that older age and the development of ARDS predict poor outcomes in critically ill patients with COVID-19. Guan et al. [8] performed a large cohort analy- sis of 1099 COVID-19 patients that were treated in 31 provinces or provincial municipalities all over China. The death rates of all patients, non-severe patients and severe patients were 1.4%, 0.1% and 8.1%, respectively, which were predicted by disease severity parameters including oxygen saturation, respiratory rate, blood leukocyte/lym- phocyte count and chest X-ray/CT manifestations. A recent epidemiological analysis of 72 314 cases (44 672 cases or 61.8% were diagnosed by nucleic acid test) revealed that severe or critically ill patients account for 19.1% of all patients with COVID-19; the gross fatality rate was 2.3%, with 81% deaths occurred in 60 years old or more, and complications/comorbidities increase the morality [6]. There are 107 million residents in Henan Province approximately, thousands of whom reside, work or study in Wuhan and return back home to celebrate the Spring Festival There are 107 million residents in Henan Province approximately, thousands of whom reside, work or study in Wuhan and return back home to celebrate the Spring Festival during January 2020 to February 2020. For instance, more than 36,000 people return back from Wuhan to Nanyang, a city of Henan Province that borders Hubei Province in the northeast. COVID-19 patients and asymptomatic SARS- CoV-2 carriers have been identified among the returning home personnel, which have caused local residents to be infected in Nanyang. The situation is similar to that of Zhe- jiang Province, as reported by Xu et al. [7] that none of the cases has never been to the Wuhan seafood market. Sup- posedly the epidemiological and clinical features might be different among the patients with different exposure histo- ries. Here we sought to investigate the clinical, laboratory, radiological characteristics of the patients diagnosed and treated in Nanyang city, and to seek the differences between patients with different exposure histories and clinicoradio- logical characteristics, providing insights into the prevention and treatment of COVID-19.",
    "This is a retrospective study in Henan Province, China. We sought the medical records of Henan Provinical Peo- ple’s Hospital, Zhoukou Central Hospital, Nanyang Cen- tral Hospital, the First Affiliated Hospital of Nanyang Medical College and Dengzhou Central Hospital for cases with COVID-19. These four hospitals include a provin- cial hospital, three municipal hospitals that covered 11 million people in Nanyang City and 8 million people in Zhoukou City, and a county hospital (Dengzhou Central Hospital) that serves 1400 thousand people. These hos- pitals represent the typical three grades of the healthcare system (provincial, municipal and county level) in Henan Province that were qualified to treat patients with COVID- 19. Patients got fully access to the medical facilities as needed, and all the Medicare fees were covered by the cen- tral and local government. Cases were suspected to have COVID-19 in those who had a recent exposure history to Wuhan or to confirmed COVID-19 patients in the previous 2 weeks, and was presented with fever and/or respiratory symptoms (e.g. cough and dyspnea), or having fever/res- piratory symptoms and typical radiological abnormalities (such as multiple ground-glass opacity) on CT or chest X-ray. The suspected cases were closely followed up and subjected to real-time reverse transcriptase-polymerase chain reaction (RT-PCR) assay for nasopharyngeal swab specimens. Patients were diagnosed based on the WHO interim guidance [15]. Suspected cases were excluded after two consecutive RT-PCR assays were negative (not collected on the same day) and a careful discussion by a multidisciplinary discussion involving respirologists, epidemiologists, radiologists and intensive care experts. Doctors of the confirmed cases were fully accessible to all available medical resources including intensive care, and some patients were transferred to regional medical cent- ers or university-affiliated hospitals for ECMO care. We included laboratory-confirmed cases for further analysis. Written consent was waived by the IRB considering that this was a retrospective study. The research was approved by the academic committees of each hospital, Zhengzhou and Medical The epidemiological data, the laboratory test result data, the radiological reports and radiological data were acquired from electronic medical record systems of each hospital. Photos were taken and read by undergraduates or medical doctor candidates and recorded by being entered into a database, then checked by respiratory clinicians. Exposure history, disease onset, time to the first negative nasopharyngeal swab nucleic acid test, time to afebrile and time to discharge were documented. The usage of antiviral drugs, anti-inflammatory drugs, respiratory supplemen- tary treatments [oxygen supply through a nasal duct or facial mask, high-flow nasal cannula oxygen (HFNC), non- invasive ventilation (NIV), invasive mechanical ventilation (IMV), extracorporeal membrane oxygenation (ECMO)], continuous renal replacement therapy (CRRT), the length of ICU stay, as well as complications and comorbidities were also recorded. The radiological data (expressed as DICOM or JPEG format) were copied from the elec- tronic imaging systems of each hospital and reviewed by a panel of radiologists and respirologists. Further radio- logical analysis was performed using CT image processing software. software. The severity of COVID-19 was defined based on the international guidelines for community-acquired pneu- monia [16]. Briefly, mild COVID-19 was defined by the presence of minimal symptoms and absence of radiologi- cal abnormalities; common COVID-19 was defined by the presence of fever and/or respiratory symptoms and radio- logical alterations of pneumonia; severe COVID-19 met one or more of these criteria: respiratory distress and respira- tory rate > 30 bpm, oxygen saturation <93% at rest on room air, PaO,/FiO, < 300 mmHg; critically ill patients met one or more of these criteria: respiratory failure that requires mechanical ventilation, presence of shock, complicated with other organic failure that requires intensive care in the ICU. The time to afebrile was defined as the duration from the days of disease onset to the first day when the patient was no longer febrile. The time to nucleic acid negative was defined as the duration from disease onset to those of twice rhinopharyngeal swab nucleic acid tests appearing negative, i.e. meet the criteria of isolation cessation. Further inquiry and communication were done between data processor and analyzer and attending physicians whenever there was miss- ing data, or anything question that may interfere were data analyzing. Some patients who met the criteria of non-severe COVID-19 were also treated in the ICU or respiratory ICU, while some patients who met the criteria of severe COVID- 19 were treated in common respiratory wards with HFNC or NIV till being transferred to the ICU. So we used a com- posite endpoint of intensive care instead of ICU stay, which refers to the use of non-invasive ventilation (NIV), invasive mechanical ventilation (IMV), extracorporeal membrane oxygenation (ECMO) or death. All data were dated back to March 15th, 2020. For patients still on treatment, parameters such as length of hospital stay alike refer to hospitalization till March 15th, 2020.",
    "throat-swab specimens were obtained from patients with fever, cough or dyspnea every other day and subjected to PCR examination. Blood examinations were routinely per- formed, including complete blood count, coagulation profile, serum biochemical tests (alanine aminotransferase, aspartate transaminase, procalcitonin, total bilirubin, hyperbilirubine- mia, lactose dehydrogenase, creatinine and urea nitrogen. LightSpeed Plus (GE, Medical System, Milwaukee, WI) and UCT 780 (United Imaging, Shanghai, China) were employed for scanning chest CT images with a tube voltage of 120 kV combined with automatic tube current modula- tion (100-400 mA). Images were reconstructed with a slice thickness of 1.25 mm and an interval of 1.25 mm, respec- tively. All patients underwent initial CT 3 days after the onset of symptoms. The interval time from initial to follow- up examination was 5 days. SARS-CoV-2 was confirmed through RT-PCR assay of viral nucleic acid in nasopharyngeal swabs and was conducted in accordance with the protocol established by the World Health Organization [17]. The tests and further confirma- tion were executed by the coordination of the clinical labo- ratories of each hospital, the Nanyang Center for Disease Prevention and Control (CDC), the Zhoukou city CDC and the Henan Provincial CDC. Co-infections were excluded either by nasopharyngeal antigen test on influenza A and influenza B, or serological tests on influenza A, influenza B, parainfluenza virus, adenovirus, rhinovirus, respiratory syncytial virus, Chlamydia pneumoniae, Mycoplasma pneu- moniae, Legionella pneumophila and Coxiella burnetii. Cul- ture of sputum, bronchoalveolar lavage fluid, airway aspi- rates, blood, urine or duct tips was performed as necessary. Interferon-y release assay (IGRA), 1-3-B-p glucan test (G test) and B-galactomannan test (GM test) were performed to exclude mycobacterium or fungi infections. Connective tissue disease, lung cancer or other diseases were excluded by consultation of the expert panels of each hospital based on clinical, laboratory and radiological data. Continuous variables were descriptively analyzed as either means and standard deviations or medians with interquartile ranges. Further comparisons were performed by independ- ent sample student f test for 2 groups, one-way ANOVA and Mann-Whitney test for 3 or more groups or Wilcoxon rank- sum test as appropriate (e.g. if the variance was uneven). Categorical variables were expressed as numbers and per- centages and compared using chi-square tests and Fisher’s exact tests. Cox regression analysis and Kaplan—Meier sur- vival tests were used for analyzing the incubation period, time to clinically stable, time to first nucleic acid negative or other survival indices. We set up logistic multivariate regression models to explore the prognostic factors of com- plex unfavorable outcomes. Data were input and analyzed using SPSS software (version 17.0, IBM Inc., Armonk, NY) and GraphPad Prism software (version 8.0, Graph- PadSystat Software Inc., San Diego, CA). Missing values were exempted from statistical analysis and expressed in the results. Two-tailed P values of less than 0.05 are considered statistically significant. The patient enrollment is outlined in Figure $1 and Figure $2. We retrieved medical records from 172 patients that were admitted with SARS-CoV-2 infection. CT images of seven cases were normal on their first CT, two of whom showed some extent of abnormalities on their later follow-up CT and were thus enrolled. Three patients were excluded for lacking some clinical data. The clinical characteristics are outlined in Table 1. 78.5% of all patients had a clear exposure history, and the median incubation period was 3.0 (95% CI: 2.6-5.8, range: 1.0-17.0) days. 45.3% and 34.6% of all patients had a recent Wuhan exposure history (reside or travel in Wuhan). 26.7% of all patients had familial cluster, i.e. one relative or more to be diagnosed with SARS-CoV-2 infection, and the average whole number of familial member infection was 2.2+1.6 (95% CI: 1.0-3.5, range: 0-4). The mean age was 47.9 + 18.3 (range: 16-98) years, and 46.5% were females. All patients have at least one symp- tom, and the most common symptoms were fever (94.2%) and cough (68.6%), followed by expectoration (41.9%), fatigue (36.0%) and dyspnea (32.6%). 40.7% of all patients had at least one comorbidity, among which hypertension (18.6), diabetes (17.4%) and coronary artery disease (7.6%) were most prevalent. 121 (70.3%) and 51 (29.7%) patients were classified as non-severe and severe cases, respectively. Severe group differed from non-severe group in age, dura- tion of fever, fatigue, cyanosis, and the number and type of comorbidities. 31 patients (18.0%) reached the outcome of NIV, IMV, ECMO or death, and are distinguished in age, duration of fever, fatigue, cyanosis and comorbidities. Clini- cal characteristics are equally distributed in patients with or without a history of Wuhan residence.",
    "According to Fig. 1 and Table 2, the lesions of 77.3% of all cases were bilaterally distributed, with 65.1% of pure GGO, 5.8% of pure consolidation and 25.6% of a mixed type of GGO and consolidation. 3.5% of all patients were CT- negative on admission. Pleural effusions were documented in 2.9% of all cases, 1.7% unilateral and 1.2% bilateral. Severe cases and those received intensive care have more lobes involved. As shown in Table 2, leukopenia, lymphopenia and throm- bocytopenia were documented in 32.6%, 76.7% and 7.0% of all patients, respectively. The serum levels of CRP, procalci- tonin, aminotransferases (ALT or AST), creatine kinase MB subtype (CKMB), BNP/pro-BNP/pro-NT-BNP and D-dimer were elevated in 66.3, 27.9%, 18.6%, 19.2%, 14.5% and 45.3%, respectively. Severe group differed from non-severe group in oxygenation, lactate level, WBC, NEU, LYM and %LYM, PCT, CRP, LDH, CK, BUN and D-dimer (all P <0.05). Statistical significances between patients receiv- ing intensive care or not are also documented in radiologi- cal involvement, oxygenation, lactate, WBC, NEU, LYM, %LYM, CRP, PCT, AST, Hyperbilirubinemia, hypokalemia, hyponatremia, BNP and D-dimer. Patients with or without Wuhan residence history differ in AST, hypoproteinemia, Hb and PLT. According to Table 3, Lopinavir/ritonavir and aerosol IFN- a1b were most universally used, which account for 93.0% and 96.5% of all cases, respectively. Darunavir and rem- devisir were used in 9.3% and 1.2% of all cases. 5.8% of patients underwent an antiviral regime shift because that initial treatment failed. Intravenous methylprednisolone was administered in 57% of all patients with an average duration of (3.5+4.3) days and maximal daily doses of 0-160 mg. Intravenous immunoglobulin (I[VIG), intravenous antibiot- ics and antifungals were administered in 39.0%, 98.8% and 7.0% of all patients, respectively. Oxygen therapy, high-flow nasal cannula oxygen therapy, NIV, IMV, ECMO was used in 61.6%, 7.6%, 11.6%, 7.0%, 17.4% and 3.5% of all cases, respectively. 30.8% of patients had a co-infection, 13.4% were bacteria, 5.2% fungi, 5/8 another respiratory virus (3 cases of influenza A, 5 cases of influenza B, | case of both influenza A and B, 1 case of adenovirus), 1 Mycobacterium tuberculosis. The mean length of stay, the time from disease onset to the first visit, the time from disease onset to confir- mation, the time from confirmation to initial antiviral treat- ment, the time (from antiviral treatment) to afebrile, the time Ayrurey & ur a[quiasse sjuaned 6[-GIAQO eu0 ueY} a1OU! 0} S1aJos JOYSN]O [eI] (% ‘uonsodoad) soquinu Jo (unuTTUTW ‘uMUTTXeUT) UeTpoUT ‘uOTeTAop prepuL]s F uKoUT sv possodxo ore BIE (from antiviral treatment) to virus clearance were 16.3+5.1, 2.94+3.2,0.5+1.1, 6.6+6.1, 13.1+45.0 days, respectively. 51.2% of all patients were admitted to the ICU, while 8.7% of all patients were subjected to IMV, ECMO or death. Com- plications include liver injury (11.6%), myocardial injury (8.7%), acute renal injury (5.8%), the shock of any causes (3.5%), pneumothorax (1.7%) and major bleeding (1.7%) that inquires immediate therapy and/or transfusion. 93.0% of all cases were discharged that included 86.3% severe cases, and 4.7% were still on treatment. The fatality rate was 2.3%. The median CURB-65 score was 0 (range 0-2), while 79.1% of patients were 0. The mean pneumonia sever- ity index (PSI) score was 46.5 + 22.1, and 87.2% of patients were classified with PSI grade of I or II (scoring <70) score. The mean of MuLBSTA score was 7.0+4.3, and 15.1% of all patients had a MuLBSTA score of > 12. At 72 h of admis- sion, 23.3% of all patients underwent a clinical or radiologi- cal deterioration. Statistical significance was observed in subgroup analysis between non-severe and severe group, and intensive care/ death group and non-intensive care/death group in antiviral regime, antiviral treatment switch, proportions of steroid use, maximum dose and duration of steroid use, antifungal use, IVIG, oxygen therapy, HFNC, NIV, IMV, ECMO and CRRT, overall co-infection and bacterial co-infection, the time to afebrile, CURB-65 score, PSI score and MuLBSTA score, complications, deterioration at 72 h and overall out- comes. However, the patients with or without Wuhan resi- dence history do not show any differences except for their antiviral regimes. As shown in Fig. 2, Table 4 and Figure S3-S6, case type (severe or non-severe), proportions of lymphocyte and respiratory failure on admission are key risk factors of the The current multi-center study depicts the overall character- istics and outcomes of 172 patients with COVID-19 in three cities of Henan province, where patients have free, fully access to all available medical resources. The median incu- bation period was 3.0 (95% Cl: 2.6-5.8, range: 1.0-17.0) days and is similar to those of previous cohorts [1—8] as well as a systemic review [18]. The average time from disease onset to the first visit and the time from disease onset to confirmation were 2.9+3.2 and 0.5+1.1 days, which are shorter than those in Wuhan [1-8]. These data demonstrate the availability of medical resources, which might be dif- ferent from that in Wuhan in Feb 2020 but resembles more to the report of Zhejiang Province [7]. Another situation is that only 45.3% of all patients had a recent Wuhan exposure history (reside or travel in Wuhan), i.e. composed of third or fourth-generation cases. The third one is that by the time our cases were admitted much later than those of other studies of Wuhan when several editions of guidelines. Differences may thus be induced by the understandings and execution of triage and treatment guidelines by different doctors. Such discrepancies may partly explain the differences between this cohort and previous reports of Wuhan patients [1-8].",
    "Household transmission has been documented in res- piratory viruses such as influenza and SARS-CoV [12, 19-21]. According to several analytical researches, human coronaviruses such as MERS-CoV can survive on metal, glass or plastic surfaces for 9 days, but the virus were effec- tively inactivated by disinfectants, such as 62-71% etha- nol, 0.5% hydrogen peroxide or 0.1% sodium hypochlorite [22]. Although our study did not provide direct evidences vn (LT) OserOJsUe TOUTE SUTULTY wn “(Lsv) Fr6z — esvseysuenourue oyeyedsy (COP qwysu $70< Ld qwysu ¢70>LId > 10 qwsu 10> Lod ({wysu) [29] (LOd) UluoHOBo01g V/8u 001 <dao T/8w OT > duoS V8w 0¢ T/8ur 0S > dao S Vs OT Tw 01 >dao (7/8ux) [2] (YO) ursyord oanovar-a implicated by 26.7% of all patients had familial cluster, i.e. one relative or more to be diagnosed with SARS-CoV-2 infection. In a study about the family aggregation phenomenon, it was found that 5 persons in the same family were confirmed to be infected with COVID-19 after traveling to Wuhan, while another family which did not travel to Wuhan was infected with the virus several days after contacting with four fam- ily members [12]. In another study on family gatherings, COVID-19 carried by two family members might be trans- mitted to the children during a grand temple fair [13, 23]. In addition, some patients were asymptomatic while the viral loads are as likely to cause COVID-19 infection in asymp- tomatic patients as in symptomatic patients [13]. Interest- ingly, the proportion of the family cluster is similar in the Wuhan exposure group and non-Wuhan exposure group. Precise contact and familial cluster history were missing for all patients, so we could not give an exact picture of the household secondary attack rate in each patient. By estima- tion, the household secondary attack rate was 28.7%. This rate seems to be much higher than that of SARS (reported to be 6.2% [20] and 10.2% [21]) and HIN] influenza (reported to be 10% [19]). Domestic isolation without identification of COVID-19 cases seems to be dangerous, given that COVID- 19 has a~60% rate of occult asymptomatic infection and is more difficult to be identified. In this scenario, in terms of optimizing COVID-19 pandemic control by constraining household transmission, each patient shall be identified and isolated with medical care, and individual with an expo- sure history shall be isolated within a medical surveillance period away from their familial members. Furthermore, the RO of SARS-CoV-2 is presumably 3.0 to 3.5, but the average number of familial member infection is 2.2+ 1.6 (95% CI: 2.0-3.5, range: 0-4). The gap might be attributed to both the reduction of virulence and transmissible capability and the strict measures undertaken by the local government and by the people, including traffic block and individual isolation, handwashing and wearing facial masks even at home. According to this study, the gender distribution is similar in the current cohort as compared to most of other stud- ies. In terms of gender ratio, there were 80 female patients in this study, accounting for 46.5% of the total proportion and 53.5% less than men. In previous studies on SARS and MERS, the proportion of female infection was low [24]. However, our analysis demonstrated that the proportion of male and female patients with COVID-19 was roughly the same without statistical difference. In another study of 138 patients diagnosed with COVID-19, 54.3% of the patients were male, which was similar to our statistics, with slightly more male patients than female patients [5]. The most common clinical features include fever, cough and lymphopenia that may have diagnostic or differential relevance. Wang et al. demonstrated that the most common sro TOpIqze + NAT + avunse qd UlAeqit+ jopiqe + NAT + Hacurdoy lopiqre + NAT + t1aeutdoy NaI + 1avurdoy OurIdor [eALATIUL [eITUT CAIN) UoneTHUaA sATsvAUL-UON (ONAH) ATddns wad kxo BnUUeO [ese MOY-YSTH uorssrupe uo Aderoy) uoshxQ uioddns Aroyerdsai Jo poyjour ureyy snouoavnut snyd [e1O snouoaenur A[UQ Te10 A[UO, suonoajur-o_D (Law) Adesorp uourade[dos Jeuor snonuTUOD Jo os, (sep) osn woneTHUDA [eouRYyooUr Jo YSU] (OWO®) von -Budshxo oursquiow [earodsooenxg (ANI J AIN) UOReTHUGA JeorueYyoow [TY Shep ‘apliqaye 0} OWL, UONHLULIYUOS 0} JOSUO JO SUT], (sdep) 3so} prow orajonu qeass [eos -Areydoseu oanesou rssy oy) 0} OWL, UONENTLAVI UO sMLIS [BOISOTOIPeI-OOUT]O oY} UO Sutseq Joued jJodxo uv Aq Surspney uorsnysuey Jo suoneoyIpour Adesoy) SuIpnpoUr “JuoWIeEN oeIpourUN SuLTMbuT yey) SuIpog]q 0} ssoyar Surpooyq JOleWg sapnyouy, sUONROT|dWICD OU “IdAd} OU SUBD 91qRIS Fig. 2 Risk factors for invasive mechanical ventilation or ECMO or death as revealed by multivariate Logistic analysis included the case type (severe or nonsevere) (HR 1.126, 95% CI 3.728-39.444), respiratory failure on admission (6.894, 95% CI 1.364-35.748) and grade of lymphocyte proportion (HR 5.519, 95% CI 1.700- 17.913) symptoms of 138 COVID-19 patients in Wuhan were fever (136 cases, 98.6%), fatigue (96 cases, 69.6%), dry cough (82 cases, 59.4%), myalgia (48 cases, 34.8%) and dyspnea (43 cases, 31.2%) [5]. In addition, Chen et al. reported that the symptoms of 99 cases of COVID-19patients in Wuhan were characterized by fever (82 cases, 83%), cough (81 cases, 82%), shortness of breath (31 cases, 31%), muscle soreness (11 cases, 11%), unconscious (9 cases, 9%), headache (8 cases, 8%), sore throat (5 cases, 5%), runny nose (4 cases, 4%), chest pain (2 cases, 2%), diarrhea (2 cases, 2%), nausea and vomiting (1 case, 1%) [4].",
    "Interestingly, abdominal symptoms, moist rale and cyano- sis are uncommon. Bilateral involvement of GGO or GGO plus consolidation is most prevalent on CT images. 3.5% of all patients were CT-negative on admission, which differs from the same rate of Gan et al. [8]. The average number of lobes involved was 2.6 + 1.0. 40.7% of the patients have at least one comorbid. In a study that evaluated the time period from symptom onset to first abnormal CT findings in patients with COVID-19, the results indicated that CT images were normal in 56% of patients within 2 days of symptom onset [25]. In addition, among patients with posi- tive RT-PCR detection, the sensitivity of CT examination is high (86-97%), while in patients with non-respiratory symptoms, the sensitivity is low (about 50%) [26]. Further- more, Bernheim er al. analyzed the CT results of COVID-19 patients, and found that 76% (25 cases) had bilateral lung lesions 3-5 days after the onset of symptoms, and 88% (22 cases) had bilateral lung lesions 6-12 days after symptoms, indicating that the lesion scope gradually expanded with by myocardial injury, acute injury, shock, pneumothorax and major bleeding. These complications are further proved by laboratory test results of ALT, AST, CKMB, B type natriuretic peptide (Table 2). These data are consistent with previous studies and reviews [1-8, 12, 18-21, 27, 28]. These complications may develop before or after admission, but pneumothorax typically develops after NIV and IMV, and is supposed to be responsible for prolonged hospital stay. The serum levels of CRP and PCT are elevated in 66.3 and 27.9% in all cases, while 14.3% were complicated by bacteria co-infection. The rate of viral co-infection (notably influenza A or/and influenza A) is comparable to that of other studies [8]. M.bacterium was identified by fast-acid staining in 2 sputum samples of a 23-year old man with COVID-19, and this patient received standard antituberculosis therapy thereafter with isonia- zid, rifampicin, pyrazinamide and ethambutol. He has had cough and expectoration more than 2 months before he had COVID-19, so we suppose a SARS-CoV-2 co-infection superimposed on tuberculosis infection in him. The issue of tuberculosis co-infection or relapse should be taken into account in developing countries with a high incidence of tuberculosis. An elevation of serum PCT, but not CRP, was associated with a bacterial infection. It’s, therefore, con- cluded that procalcitonin is more specific than CRP in bac- teria but not a viral infection. The events of major bleeding are rare and in parallel with prophylactic anticoagulative treatments or ECMO usage. On treatments and outcomes, 29.7% were severe cases, 16.3% had respiratory failure on department or respiratory department. Some patients were admitted to the ICU if the infectious department beds were occupied and unavailable, or if the patient was of older age (supposedly, > 80 years), with more comorbidities or complications, or be transferred from another hospital. The average length of stay was sig- nificantly longer than that of time to afebrile but was closer to the time to viral clearance. An explanation is that nasal swab test for SARS-CoV-2 was not performed daily due to lack of test kits at that time, so a repeated nucleic acid test was performed after afebrile and/or CT resolution, making the time to viral clearance inaccurate. Shorter treatment duration seems to be feasible based on some recent studies. Similar to previous studies, severe cases and patients subjected to intensive care were distinguished in clinical characteristics, prognosis and costs from non-severe cases and patients without intensive care, respectively. However, as for those with or without Wuhan exposure history, there were few discrepancies regarding history, symptoms, labora- tory parameters and prognosis. To be inconsistent with other prognostic studies, CURB-65 score, PSI score or MuLB- STA score are not associated with composite unfavorable outcomes. These scoring systems were primarily developed for identifying patients with a high risk of death in CAP (CURB-65 and PSI score) or viral pneumonia (MuLBSTA score). The disease severity, the proportions of lymphocyte as well as respiratory failure on admission is possible risk factors for unfavorable outcomes. So, the triage of patients should keep in accord with the disease severity rather than with their exposure history or pneumonia severity scoring and the death rate is 2.3%. Sanders et al. supported that the most promising treatment is Remdesivir [29]. Remdesivir is more effective against SARS-CoV-2 in vitro, but it has not been approved by the U.S. Food and Drug Administration. In addition, there is currently no evidence that oseltamivir is effective, and corticosteroid use and discontinuation of ACE2 inhibitors are not recommended. Another study also concluded that in patients with COVID-19, hydroxychloro- quine reduced inflammatory responses and cytokine storms, but excessive use could lead to poisoning and death [30]. Neuraminidase inhibitors such as oseltamivir, peramivir and zanamivir are ineffective in the 2019-NCOV. Protease inhibitors such as lopinavir/ritonavir, combined with abidol, are effective in inhibiting early replication of SARS-CoV and have antiviral effects. The most universally used anti- viral regime was lopinavir/ritonavir combined with aero- sol IFN-alb, while darunavir and remdevisir were used in 10.5% of all cases. The antiviral regime was changed in 5.8% of patients due to failure to initial treatment failure. Our data did not show statistical differences in different antivi- ral groups and severity groups in time to afebrile, time to virus clearance or length of stay. This retrospective data is in line with other reports on the effect of lopinavir/ritonavir on severe cases with COVID-19. Intravenous methylpredni- solone was administered more in severe and intensive care cases as compared with non-severe and non-intensive care patients. However, corticosteroid use is not associated with unfavorable outcomes. Therefore, we would not give con- crete data on the controversial use of glucocorticosteroids in COVID-19. IVIG and anti-inflammatory agents such as trazumab and baricitinib was supposed to be beneficial in some patients with COVID-19, but our data neither support nor oppose their usage.",
    "Respiratory support is considered as an important sup- portive therapy. However, non-ICU patients are mainly treated with a nasal catheter or mask oxygen therapy, high- flow oxygen inhalation and other methods, while ICU patients are treated with non-invasive mechanical ventila- tion, invasive mechanical ventilation and extracorporeal membrane oxygenation. Therefore, patients with severe disease and patients with severe events tend to occupy more medical resources [5]. In our research, the results indi- cated that oxygen therapy, high-flow nasal cannula oxy- gen therapy, NIV, IMV, ECMO was used in 61.6%, 7.6%, 11.6%, 7.0%, 17.4% and 3.5% of all cases, respectively. Severe cases and the patients received intensive care tend to occupy more resources and cost more. However, our data showed that half of all patients had been ever admitted to the ICU, which include one-third of non-severe cases and is far higher than the rate of IMV and ECMO. We considered this as an unequal use or triage, if not, overuse, of medical resources. All the patients were admitted to the infectious Our study has some limitations. The retrospective nature and relatively limited size of this study restrains its statisti- cal confidence and interpretation of results, especially risk factors. Missing data exists, although not common, adding to research bias. The interpretation of the incubation period might be cautiously understood since the exposure history is somewhat secretive in 20% of all patients. Additionally, some patients are still being treated in hospital, and further follow-up is needed to give a more precise picture of their disease outcome or costs. Thirdly, we included five medi- cal facilities that serve different people groups in 3 separate cities, 2 available with ECMO and 3 not. The immediate availability of medical resources may obscure the triage and treatment decision as well as disease outcome. Finally, the fees of all patients were covered by the government, which seems to be difficult to be replicated outside China. In this retrospective analysis, clinical features and prog- nostic factors of 172 patients with COVID-19 were system- atically analyzed, including age, gender, smoking history, exposure history in Wuhan, clinical symptoms, complica- tions, radiological and laboratory indicators, therapeutic regimens, treatment time, risk factors for poor prognosis. Data availability The data used to support the findings of this study are available from the corresponding author upon request. Ethical approval All procedures performed in studies involving human participants were in accordance with the ethical standards of the insti- tutional committee and with the 1964 Helsinki declaration and its later amendments or comparable ethical standards. The research was approved by the academic committees of each hospital, Zhengzhou University and Nanyang Medical College."
]