[
    "This study constructs a comprehensive evaluation framework for new quality productive forces in Henan Province by integrating an improved entropy weight-TOPSIS method with deep learning techniques. The term “new quality productive forces” follows the official expression used in Chinese economic planning documents. A multi-dimensional indicator system encompassing innovation- driven development, digital transformation, green development, industrial integration, and factor coordination was established and optimized through deep learning-based feature extraction, achieving 35% indicator reduction while maintaining 94.6% information retention. Empirical analysis of 18 cities from 2018 to 2023 reveals significant spatial-temporal disparities in new quality productive forces development, characterized by a “core-periphery” structure and east-west development gradient. The improved methodology demonstrated superior performance in both accuracy (92.7%) and stability compared to traditional evaluation approaches. The findings indicate steady provincial progress with a 6.6% average annual growth rate, with digital transformation emerging as the fastest- growing dimension while innovation-driven development exhibits the highest regional disparity. Based on these results, targeted policy recommendations are proposed to promote balanced advancement of new quality productive forces across Henan Province. The concept of new quality productive forces represents a fundamental paradigm shift in economic development theory that transcends traditional productivity frameworks through three distinct transformative mechanisms!. Unlike conventional productivity theory, which primarily emphasizes quantitative expansion through factor accumulation, new quality productive forces represents a qualitative transformation of productivity systems that integrates innovation-driven development, structural optimization, and sustainability constraints as core components rather than external considerations.This paradigm transformation fundamentally differs from traditional productivity frameworks through three core distinguishing mechanisms. First, innovation-driven replacement positions technological innovation as the primary growth driver, replacing traditional factor inputs (labor and capital accumulation). As President Xi Jinping emphasized, “technological innovation is the core element of developing new productive forces,” marking a decisive shift from the growth-maximizing orientation that prevailed from 1979 until the early 2010s. Second, structural optimization involves industrial transformation from labor-intensive to knowledge-intensive sectors, with advanced productivity that “plays a leading role in innovation and breaks away from the traditional economic growth mode and productivity development path”. Third, sustainability integration incorporates environmental constraints as internal productivity components rather than external limitations, reflecting features of “high technology, high efficiency, and high quality”. New quality productive forces represent “an outcome of the evolution of productive forces and technological progress; they represent a revolutionary enhancement of humanity’s ability to improve nature in a holistic and fundamental way”. This concept emerges from revolutionary breakthroughs in technology, the innovative allocation of production factors, and the in-depth transformation and upgrading of industry, with a centra hallmark of significant increases in total factor productivity. The evaluation of new quality productive forces serves three critical purposes: providing standardize measurement frameworks for monitoring transformation progress and identifying development bottlenecks; enabling evidence-based policy formulation through quantitative assessment of regional comparative advantages; and supporting resource allocation optimization by tracking dynamic changes in productivity structures an transformation effectiveness. As a core strategic concept proposed in recent Chinese economic planning, new quality productive forces integrates advanced manufacturing, digital economy, green development, and talent cultivation to create more efficient, sustainable, and intelligent production systems’. This new development paradigm has become increasingly critical for China’s economic transformation as it navigates complex globa challenges and pursues high-quality development goals*. Henan Province, as a crucial agricultural and industrial base in central China, faces both opportunities an challenges in developing new quality productive forces*. With its strategic geographical location, abundant human resources, and established industrial foundations, Henan possesses significant potential for implementing new quality productive forces development strategies®. Drawing from China's successful experience with special economic zones and industrial cluster development’, the province continues to grapple with structural imbalances, including uneven regional development, relatively low innovation capacity, and ongoing industria transformation challenges that hinder the full realization of new quality productive forces’. These complex conditions necessitate a systematic evaluation framework to guide policy formulation and resource allocation effectively. Constructing a scientific evaluation index system for new quality productive forces holds paramount importance for several reasons. First, it provides a standardized framework to measure progress and identify development gaps accurately, enabling targeted policy interventions®. Second, a well-designed evaluation system can effectively highlight regional comparative advantages and optimization directions, supporting evidence- based decision-making processes’. Third, quantitative evaluation helps track dynamic changes in productivity structures and transformation effectiveness, offering valuable feedback for iterative policy adjustments.",
    "Recent research on productivity evaluation has evolved significantly, with scholars developing increasingly sophisticated methodologies. Traditional productivity measurement approaches have gradually expanded from single-factor productivity to multi-factor and total factor productivity analyses, incorporating more comprehensive variable sets!!. However, existing methods face several limitations: traditional entropy weight methods suffer from indicator redundancy issues; TOPSIS approaches use fixed ideal solutions that may not reflect domain-specific characteristics; factor analysis assumes linear relationships between variables; and AHP- based methods rely heavily on subjective expert judgments. These three methods (Traditional Entropy Weight- TOPSIS, Factor Analysis, and AHP) were selected for comparison as they represent the most widely applied approaches in regional development evaluation, offering different perspectives on objectivity (statistical vs. expert-based) and computational complexity. International research has particularly emphasized innovation metrics, technological advancement indicators, and sustainability factors in productivity measurement frameworks!2. Domestic studies have explored various evaluation methods, including analytic hierarchy process (AHP), data envelopment analysis (DEA), and principal component analysis, yet few have specifically addressed the unique characteristics of new quality productive forces in regional contexts!*. The integration of entropy weight methods with TOPSIS (Technique for Order Preference by Similarity to Ideal Solution) has emerged as a promising approach for complex multi-criteria evaluation scenarios, offering advantages in objectivity and comprehensive ranking capabilities'*. However, conventional implementations often face challenges in addressing indicator correlations and processing diverse data types effectively. Meanwhile, deep learning techniques have demonstrated remarkable potential in pattern recognition and complex feature extraction across various domains. Existing applications in productivity evaluation include neural network-based total factor productivity forecasting’, convolutional neural networks for industrial efficiency assessment!®, and recurrent neural networks for temporal productivity pattern recognition!’. However, these applications primarily focus on traditional productivity metrics and lack integration with multi- criteria evaluation frameworks. This study advances the field by combining deep learning with improved entropy weight-TOPSIS methods for comprehensive productive forces evaluation. This research applies and adapts an integrated evaluation framework for new quality productive forces in Henan Province by combining an improved entropy weight-TOPSIS method with deep learning techniques. The study makes several distinct contributions: (1) developing a five-dimensional indicator system with 20 specific metrics tailored for regional new quality productive forces evaluation; (2) proposing correlation-based redundancy processing mechanisms and dynamic ideal solution determination that improve evaluation accuracy by 8.2% compared to traditional methods; (3) incorporating autoencoder networks and attention mechanisms that achieve 35% indicator reduction while maintaining 94.6% information retention; and (4) providing quantitative empirical evidence revealing spatial-temporal patterns and targeted policy recommendations for Henan’s development strategy. The remainder of this paper is organized as follows: Section II reviews relevant literature on productivity evaluation methodologies and new quality productive forces concepts. Section III presents the research methodology, including the proposed evaluation framework, improved entropy weight-TOPSIS algorithm, and deep learning integration. Section IV elaborates on the construction of the evaluation index system. Section V discusses the empirical application of the proposed model in Henan Province. Finally, Section VI concludes with policy implications and future research directions. New quality productive forces represents a paradigm shift from traditional productivity frameworks, characterized by innovation-driven, technology-intensive, and sustainability-oriented development patterns that fundamentally transform the economic growth model'®. Unlike traditional productivity that primarily emphasizes input-output efficiency within existing technological paradigms, new quality productive forces focuses on quality enhancement, structural optimization, and ecological coordination through disruptive technological innovation and institutional reform!®. The evaluation of new quality productive forces must therefore transcend conventional productivity metrics to incorporate dimensions of innovation capacity, digital transformation, green development, and talent agglomeration effects. The theoretical underpinnings for evaluating new quality productive forces derive from multiple complementary frameworks. Innovation-driven development theory posits that technological innovation constitutes the primary driver of productivity advancement in modern economies, with innovation performance expressible through a modified production function: where Y represents economic output, A represents capital input, L represents labor input, T represents technological level, and J represents innovation input that drives technological advancement and efficiency gains”°. High-quality development theory extends this framework by emphasizing structural optimization and qualitative improvements beyond quantitative expansion, with productivity advancement characterized by: where ATF'P represents total factor productivity growth, with the first term capturing within-sector productivity improvements and the second term reflecting structural optimization effects as resources shift toward higher-productivity sectors”!. Sustainable development theory further complements these frameworks by integrating ecological constraints and social dimensions, positioning green total factor productivity (GTFP) as a critical metric: This formulation explicitly accounts for environmental externalities in productivity measurement, reflecting the ecological efficiency dimension fundamental to new quality productive forces evaluation”.",
    "These theoretical foundations collectively inform a comprehensive evaluation framework for new quality productive forces that balances economic, technological, social, and ecological dimensions’. The integration of these multidimensional theoretical perspectives necessitates methodological innovations in evaluation approaches, particularly in weight determination, indicator selection, and data processing techniques, which the proposed improved entropy weight-TOPSIS method with deep learning integration aims to address. The traditional entropy weight method and TOPSIS (Technique for Order Preference by Similarity to Ideal Solution) represent widely utilized approaches in multi-criteria decision-making systems, each with distinct mathematical foundations and evaluation paradigms™*. The entropy weight method derives from information theory, where entropy quantifies the disorder degree of information, enabling objective weight determination based on indicator variation. For a decision matrix with m evaluation objects and n indicators, the information entropy of the j-th indicator is calculated as: where pj; represents the normalized value of the j-th indicator for the i-th evaluation object. The corresponding weight is then determined by: The TOPSIS method establishes evaluation rankings based on relative proximity to ideal solutions. Following normalization, the method calculates positive ideal solution (PIS) and negative ideal solution (NIS): Despite their widespread application, both methods exhibit notable limitations in complex evaluation contexts”°. The traditional entropy weight method fails to address indicator redundancy issues, potentially overemphasizing correlated indicators and distorting evaluation results. Similarly, the conventional TOPSIS approach employs fixed ideal solutions that may not adequately reflect domain-specific characteristics or contextual constraints in specialized evaluation scenarios like new quality productive forces assessment. The proposed improved entropy weight-TOPSIS method incorporates several key enhancements to address these limitations. First, a correlation-based redundancy processing mechanism is introduced into the entropy weight determination: where Rj = = kj |Tjk| represents the average absolute correlation coefficient between the j-th indicator and/all other ‘indicators, effectively penalizing highly correlated indicators’’. Second, the TOPSIS method is enhanced through dynamic ideal solution determination that incorporates domain knowledge and theoretical constraints specific to new quality productive forces evaluation: where adjustment coefficients a ;, (8 ;, yj, and 6; are determined through cross-validation optimization to maximize correlation with expert assessments, with constraints: 0.8< aj,y; < 1.2 and B | »|65| < 0.1 x range (vi;)**. Prior to ideal solution calculation, data standardization is performed to address scale differences across indicators using differentiated normalization approaches based on indicator directionality. For positive indicators (where higher values indicate better performance, such as R&D investment intensity, patent output quality), min-max normalization is applied: For negative indicators (where lower values indicate better performance, such as energy consumption efficiency, carbon emission intensity), inverse normalization is employed to maintain consistent directional interpretation: This inverse transformation ensures that all standardized indicators follow the same logic where higher normalized values consistently represent better performance across all dimensions. Deep learning offers transformative capabilities for multi-indicator evaluation systems through its exceptional pattern recognition and complex relationship modeling functionalities, which transcend traditional statistical limitations in handling high-dimensional, non-linear indicator relationships”. In the context of new quality productive forces evaluation, deep learning approaches enable more sophisticated indicator selection, weight optimization, and dynamic relationship modeling that better capture the complex, evolving nature of productivity systems. Deep neural networks (DNNs) provide powerful frameworks for indicator screening and dimensionality reduction through their hierarchical feature extraction capabilities. A typical DNN for indicator importance evaluation can be represented as: where h‘ denotes the output of the /-th hidden layer, W“ represents the weight matrix, b\" is the bias vector, and f (-) is the activation function. Through this architecture, DNNs can identify complex, non- Long Short-Term Memory (LSTM) networks offer particular advantages for capturing temporal dynamics in productivity indicators, which is critical for evaluating evolutionary trajectories of new quality productive forces. The LSTM memory cell update mechanism can be expressed as: where cr represents the cell state at time t, ft is the forget gate, i: is the input gate, o¢ is the output gate, Cz is the candidate cell state, and h: is the hidden state. This architecture enables identification of temporal patterns and lagged relationships between productivity indicators, providing insights into causal mechanisms and development sequences?!. The integration of deep learning with the improved entropy weight-TOPSIS method creates a hybrid evaluation framework that combines the strengths of both approaches. This integration can be conceptualized through a hybrid weight determination process: where the integration coefficient a is determined through cross-validation optimization, selecting the value that maximizes correlation between evaluation results and expert scores. Through systematic testing with a € [0,1] at 0.1 intervals, the optimal value a = 0.6 was identified.",
    "extracted from deep learning models, and qa is an integration coefficient optimized through validation processes”. This hybrid approach leverages both the objective variation-based weighting of entropy methods and the complex pattern recognition capabilities of deep learning. The methodological integration provides several advantages for new quality productive forces evaluation: enhanced capability to capture non-linear relationships between productivity indicators; improved identification of emergent patterns in productivity evolution; more accurate weight determination through multi-method validation; and adaptive evaluation frameworks that can incorporate both domain knowledge and data- driven insights. These capabilities are particularly valuable for evaluating new quality productive forces, which encompasses complex, multi-dimensional relationships that traditional evaluation methods often struggle to capture adequately. The construction of a scientific and comprehensive evaluation index system for new quality productive forces in Henan Province necessitates adherence to several foundational principles that ensure both theoretical rigor an practical applicability*>. The five-dimensional framework integrates multiple economic theories to create a comprehensive evaluation system. Innovation-driven development derives from endogenous growth theory, which positions technologica innovation as the fundamental driver of long-term economic growth through knowledge spillovers and human capital accumulation. This dimension measures how effectively regions transform research investments into productive outputs, capturing the innovation capacity that distinguishes new quality productive forces from traditional factor-driven growth models**. Digital transformation follows technology adoption and diffusion theory, which explains how digital technologies spread through economic systems and create productivity gains through network effects an efficiency improvements. This dimension serves as an enabling platform that accelerates innovation diffusion and industrial upgrading, measuring the depth of digital infrastructure penetration and the extent of digita technology integration across sectors**. Green development aligns with ecological economics and sustainable development theory, recognizing environmental constraints as integral components of modern productivity measurement rather than externa limitations. This dimension quantifies resource utilization efficiency and environmental performance, reflecting the ecological efficiency requirements embedded within new quality productive forces evaluation frameworks”. Industrial integration reflects industrial organization theory and cluster theory, capturing the structural manifestation of productivity advancement through sector coordination, value chain optimization, an industrial ecosystem development. This dimension measures how effectively regions coordinate traditiona industry transformation with emerging sector development to create synergistic productivity gains through integrated value creation mechanisms*”**. Factor coordination bases on institutional economics and resource allocation theory, addressing the efficiency of production factor utilization through institutional mechanisms, human capital deployment, an financial resource allocation. This dimension differs from innovation-driven development by focusing on resource allocation efficiency rather than innovation capacity, measuring how effectively regions coordinate multiple production factors to support productivity enhancement™. The systematic principle emphasizes the holistic integration of multiple dimensions to capture the complex, interconnected nature of new quality productive forces, ensuring comprehensive coverage of all relevant aspects while maintaining logical coherence. The scientific principle demands that indicator selection and framework design align with established theoretical foundations in productivity evaluation, innovation economics, and regional development. The accessibility principle requires that selected indicators can be quantified through reliable data sources, enabling consistent measurement and comparative analysis. The forward-looking principle emphasizes capturing emerging trends and future development directions rather than merely reflecting historical performance, particularly critical for evaluating transformative phenomena like new quality productive forces*”. Guided by these principles and informed by the theoretical foundations established in Section II, we propose a multi-dimensional evaluation framework for new quality productive forces in Henan Province that encompasses five key dimensions: innovation-driven development, digital transformation, green development, industrial integration, and factor coordination. The selection of these five specific dimensions is grounded in both theoretical foundations and empirical validation. Innovation-driven development serves as the primary dimension based on endogenous growth theory, which positions technological innovation as the fundamental driver of long-term economic growth. Digital transformation follows technology adoption and diffusion theory, demonstrating digitalization’s role as an enabling platform for productivity enhancement. Green development derives from ecological economics and sustainable development theory, recognizing environmental constraints as integral to modern productivity measurement. Industrial integration reflects industrial organization theory and cluster effects, capturing the structural manifestation of productivity advancement. Factor coordination is based on institutional economics and resource allocation theory, addressing the efficiency of production factor utilization. This five-dimensional structure was validated through: (1) Factor analysis of 156 productivity studies identifying these five as the most frequently occurring dimensions; (2) Expert validation through three rounds of Delphi consultation with 15 regional development specialists achieving 92% consensus on dimensional relevance; (3) Empirical testing showing these five dimensions explain 87.3% of the variance in regional development outcomes across 285 Chinese cities.",
    "where NQP represents the comprehensive new quality productive forces level, JD represents innovation- driven development, DT represents digital transformation, GD represents green development, IJ represents industrial integration, and F'C' represents factor coordination’). This multi-dimensional framework captures the essential characteristics of new quality productive forces while addressing Henan’s specific regional context. The innovation-driven dimension focuses on scientific and technological innovation capabilities, research and development intensity, and innovation output quality. The digital transformation dimension encompasses digital infrastructure, digital economy penetration, and digital governance advancement. The green development dimension addresses resource utilization efficiency, environmental protection performance, and ecological civilization construction. The industrial integration dimension evaluates modern industrial system construction, traditional industry upgrading, and emerging industry development. The factor coordination dimension assesses the allocation efficiency of human capital, financial resources, and institutional mechanisms“. The logical relationships between dimensions form an organic system with both horizontal and vertical interactions that can be quantified through an interaction coefficient matrix: where each element ri,; quantifies the interaction strength between dimensions, determined through: rij =0.4- ri 440.3. ree +0.3- riata, combining theoretical relationships from economic literature, expert evaluations through analytic hierarchy process, and empirical correlation analysis from 285 Chinese cities’ historical data. The matrix reveals several critical relationships that require systematic theoretical validation and policy analysis. To examine these dimensional interactions and their implications for regional development strategies, we conducted comprehensive correlation analysis combining empirical data with theoretical expectations, as presented in Table 1. As shown in Table 1, the correlation analysis validates several key theoretical relationships. Innovation-Digital synergy (r=0.73) demonstrates how technological innovation accelerates digital infrastructure development while digital platforms enhance innovation diffusion. Digital-Industrial coupling (r=0.79) reflects digital technology's role as the primary enabler of industrial transformation and upgrading. Innovation-Industrial coordination (r=0.68) captures how research and development activities directly support industrial structure optimization. These quantified relationships inform the weighted aggregation process and ensure dimensional interdependencies are properly accounted for in the evaluation framework. The selection of appropriate evaluation indicators represents a critical step in constructing a scientific index system for new quality productive forces assessment. Through comprehensive literature analysis, expert consultations, and consideration of Henan’s regional characteristics, this study systematically identified key indicators through a four-stage process: (1) literature review yielding an initial pool of 35 candidate indicators; (2) three rounds of Delphi expert consultations with 15 specialists achieving 92% consensus; (3) regional applicability assessment for Henan’s context; and (4) data availability verification ensuring consistent measurement across all 18 cities*. The indicator selection process adhered to four key criteria: theoretical relevance to new quality productive forces concepts; statistical feasibility and data availability; regional applicability to Henan’s development context; and discriminatory power to effectively differentiate development levels. The resulting comprehensive indicator system comprises 5 primary dimensions and 20 secondary indicators, providing multi-faceted characterization of new quality productive forces development in Henan Province. Within the innovation-driven development dimension, indicators focus on both innovation input intensity and output effectiveness, capturing the transformation of research investments into practical applications and market value. The digital transformation dimension encompasses indicators measuring digital infrastructure coverage, digital technology application depth, and digital economy scale, reflecting the enabling role of digitalization in productivity enhancement‘. Green development indicators address resource utilization efficiency, environmental quality improvement, and circular economy development, highlighting the ecological constraints and sustainability orientation of new quality productive forces. Industrial integration indicators focus on strategic emerging industry development, traditional industry transformation, and advanced manufacturing progression, measuring structural optimization patterns. Factor coordination indicators examine the allocation efficiency and optimization of production factors rather than their absolute quantities, measuring how effectively human capital, financial resources, and institutional mechanisms are coordinated to support productive forces development. This differs from innovation-driven development by focusing on resource allocation efficiency rather than innovation capacity and outputs”. Each indicator was carefully defined with precise calculation methods to ensure measurement consistency and reliability. Quantitative indicators primarily utilize ratio metrics rather than absolute values to enable comparative analysis across different regions and time periods. For indicators not directly available from statistical yearbooks, proxy measures were developed based on related statistical indicators while maintaining conceptual validity. The comprehensive index system, with detailed indicator definitions, calculation methods, and data sources, is presented in Table 2. This comprehensive indicator system provides a multi-dimensional measurement framework that captures the essential characteristics of new quality productive forces in the Henan context while maintaining consistency with national development strategies and theoretical foundations. The indicators collectively reflect both the current status and developmental potential of new quality productive forces, enabling systematic evaluation and targeted policy formulation”®.",
    "While the comprehensive indicator system established in Sect. 3.2 provides thorough coverage of new quality productive forces dimensions, potential issues of indicator redundancy, information overlap, and computational complexity necessitate further optimization to enhance evaluation efficiency and accuracy’’. This section proposes a deep learning-based indicator optimization methodology that leverages advanced neural network architectures to identify core indicators while preserving essential information content. The optimization process begins with a deep correlation analysis model that extends beyond traditional statistical correlation measures to capture complex non-linear relationships between indicators. Unlike conventional correlation matrices that detect only pairwise linear relationships, the deep correlation analysis employs a neural network architecture that models higher-order interactions through multiple hidden layers. ‘The correlation intensity between indicators is quantified through a sensitivity analysis framework: Table 2. Evaluation index system for new quality productive forces in Henan Province. *High-skilled talent is operationally defined as individuals meeting any of t! e following criteria: (1) Bachelor’s degree or above with intermediate professional title or higher; (2) Technical secondary school or above with technician qualification or higher; (3) Certified professionals in strategic emerging industries including new energy, information technology, biotechnology, and advanced manufacturing. This definition aligns with national statistical standards and ensures measurement consistency across all 18 cities in Henan Province while capturing both traditional professional qualifications and emerging sector expertise. where Si; represents the sensitivity coefficient measuring how changes in indicator j affect indicator i, calculated across N samples, with y representing the output of indicator i and ol) representing the input Following correlation analysis, a specialized autoencoder architecture performs feature extraction and dimensionality reduction. The autoencoder consists of an encoder function f that maps the original indicator space to a lower-dimensional latent space, and a decoder function g that reconstructs the original space from the latent representation: where x represents the original indicator vector, z the latent representation, x the reconstructed vector, o and o/ are activation functions, and 0 = {W,b} and y = {W/,b/} are the network parameters. The autoencoder is trained to minimize reconstruction error while imposing structural constraints that encourage feature disentanglement, thereby identifying the most informative indicators”. To further enhance optimization effectiveness, an attention mechanism is incorporated to automatically identify indicators with the highest discriminatory power for new quality productive forces evaluation. The attention weights for each indicator are calculated as: where ej represents the importance score of indicator j derived from a learned attention function, and a j represents the normalized attention weight. Indicators with higher attention weights contribute more significantly to the evaluation results, providing a data-driven basis for indicator selection and weighting. where represents eigenvalues from principal component analysis capturing information content. Results are summarized in Table 3. The optimized system demonstrates superior performance in terms of computational efficiency and evaluation accuracy, validating the effectiveness of the deep learning-based approach. The optimized indicator system maintains high information retention rates across all dimensions while achieving a 35% overall simplification, demonstrating the efficiency of the deep learning approach in identifying core indicators. The model performance metrics indicate that the optimized system maintains strong discriminatory power for evaluating new quality productive forces levels®’. This optimization approach represents a significant methodological advancement over traditional indicator screening methods, effectively balancing comprehensiveness with efficiency while preserving the multi-dimensional integrity of the evaluation framework. This study collected comprehensive indicator data for all 18 cities in Henan Province spanning from 2018 to 2023, establishing a robust temporal-spatial dataset for new quality productive forces evaluation’!. The primary data sources included the Henan Statistical Yearbook, Henan Science and Technology Statistical Yearbook, China City Statistical Yearbook, annual government work reports, and specialized surveys. For indicators not directly available from statistical publications, proxy indicators were constructed based on related statistical metrics, and some specialized indicators were obtained through institutional collaborations with provincial statistical bureaus, economic planning departments, and scientific research institutions. The data preprocessing procedure followed a systematic four-step protocol to ensure data quality and comparability. First, temporal consistency correction addressed statistical caliber changes across different years, particularly for digital economy and strategic emerging industry indicators that experienced statistical definition adjustments during the study period. Second, outlier detection and processing employed a modified z-score method with robust estimations of mean and standard deviation: where MAD represents the median absolute deviation. Observations with modified z-scores exceeding + 3.5 were identified as potential outliers and subjected to further verification against historical trends and regional contexts before appropriate adjustment”.",
    "Third, missing value imputation implemented a hybrid approach combining temporal interpolation for time-series gaps and spatial estimation for cross-sectional missing values. For indicators with strong temporal continuity, missing values were primarily estimated through: where JN; represents the set of neighboring cities with similar development patterns, effectively incorporating both temporal trends and spatial similarities in the estimation process*’. For indicators with limited historical Finally, data standardization procedures were applied to address scale differences across indicators. Positive indicators were standardized using min-max normalization, while negative indicators underwent inverse normalization to ensure consistent directional interpretation. Additional transformation procedures were applied to indicators with highly skewed distributions to approximate normality. These comprehensive preprocessing steps ensured the resulting dataset maintained high quality, consistency, and comparability across both spatial and temporal dimensions, establishing a solid foundation for subsequent evaluation model application. The improved entropy weight-TOPSIS method was applied to the preprocessed indicator data to evaluate new quality productive forces levels across the 18 cities in Henan Province. The indicator weights were calculated using the improved entropy weight method that incorporates correlation penalty mechanisms, as expressed in Sect. 2.2. This approach effectively mitigated the issue of information redundancy present in traditional entropy weight methods, yielding more balanced weight distributions across the indicator system>*. The correlation- adjusted entropy weight vector demonstrated significantly reduced concentration on highly correlated indicators, with the coefficient of variation for indicator weights increasing from 0.38 in the traditional entropy method to 0.62 in the improved approach, indicating enhanced discriminatory power. The evaluation process implemented the improved TOPSIS method with dynamic ideal solution adjustment, calculating the relative closeness coefficient for each city: where RC; represents the relative closeness coefficient for city i, d{ and d; represent the distances to positive and negative ideal solutions respectively, and w ; represents a context-specific adjustment coefficient that accounts for development stage differences. The comprehensive evaluation results for 2023 are presented in Table 4, while the temporal evolution from 2018 to 2023 is summarized in Table 5. The evaluation results reveal significant spatial disparities in new quality productive forces levels across Henan Province*®. Cluster analysis using k-means algorithm identified three distinct development patterns: (1) Leading cluster (Zhengzhou, Luoyang, Xuchang) characterized by balanced high performance across all dimensions; (2) Developing cluster (8 cities) showing moderate performance with specific dimensional advantages; and (3) Emerging cluster (7 cities) displaying lower overall scores but varying development potentials. Convergence analysis using o-convergence coefficient shows increasing divergence (0=0.273 in 2018 to o=0.312 in 2023), indicating growing inter-city disparities despite overall provincial improvement. The provincial capital Zhengzhou demonstrates substantially higher performance across all dimensions, particularly in digital transformation and innovation-driven development, reflecting its advantages in resource concentration, innovation infrastructure, and policy support. A clear “core-periphery” pattern emerges with three distinct tiers: the leading tier (Zhengzhou, Luoyang, and Xuchang) with scores exceeding 0.650; a middle tier of central and northern cities with scores between 0.500 and 0.650; and a lagging tier of primarily southeastern and southwestern cities with scores below 0.500. Dimensional analysis reveals varied performance patterns across the five dimensions. Digital transformation exhibits the highest average score (0.639) and the most rapid improvement rate (61.4% growth from 2018 to 2023), indicating the substantial progress in digital infrastructure construction and digital economy development across the province. The provincial coefficient of variation can be expressed as: The CV values for the five dimensions are 0.287, 0.243, 0.195, 0.258, and 0.219 respectively, indicating that innovation-driven development exhibits the highest regional disparity while green development shows the most balanced spatial distribution®°. The temporal analysis demonstrates steady improvement in overall new quality productive forces scores, with an average annual growth rate of 6.6%, suggesting positive developmental momentum across the province. To verify the reliability and validity of the improved entropy weight-TOPSIS method incorporating deep learning components, comprehensive validation procedures were implemented through sensitivity analysis and robustness testing. The sensitivity analysis systematically modified indicator weights by + 10% to assess result stability under weight perturbations. The maximum ranking change across all sensitivity scenarios was limited to 2 positions for 16 of the 18 cities, indicating strong model stability. The sensitivity coefficient was calculated as: where A R; represents the change in rank for city i, and A w; represents the change in weight for indicator j. The resulting sensitivity coefficient of 1.73 demonstrates robust result stability under weight perturbations””. Table 6 presents a comprehensive comparison between the proposed method and traditional evaluation approaches across multiple performance dimensions.",
    "The validation results confirm that the proposed integrated method outperforms traditional approaches in both accuracy and stability, though with moderately higher computational requirements. The improved approach effectively addresses key limitations of traditional methods, particularly regarding indicator redundancy management and contextual sensitivity. The empirical results reveal three critical findings that warrant detailed discussion in relation to Henan’s specific context. First, the pronounced spatial disparity (coefficient of variation increasing from 0.273 to 0.312) directly contradicts the expected convergence pattern predicted by neoclassical growth theory. This divergence pattern specifically reflects the cumulative advantage effects observed in Zhengzhou (0.842) versus Jiyuan (0.397), where early investments in digital infrastructure and innovation platforms have created self-reinforcing development cycles that compound over time. Second, the dimensional performance variations provide crucial insights into development bottlenecks. The highest disparity in innovation-driven development (CV = 0.287) compared to the lowest in green development (CV =0.195) suggests that while environmental policies have achieved relatively balanced implementation across cities, innovation capacity remains heavily concentrated. This finding directly explains why cities like Sanmenxia (green development: 0.593, innovation: 0.492) struggle to achieve overall development despite strong environmental performance. ‘Third, the temporal analysis showing digital transformation as the fastest-growing dimension (61.4% growth rate) while factor coordination lags behind (30.8% growth rate) indicates a critical structural imbalance. This specific pattern suggests that while technological infrastructure is advancing rapidly, institutional mechanisms for resource allocation are not keeping pace, creating development bottlenecks particularly evident in the emerging cluster cities where factor coordination scores consistently below 0.500. The temporal evolution analysis indicates accelerating divergence in development rates, with the coefficient of variation for overall scores increasing from 0.273 in 2018 to 0.312 in 2023. This trend suggests that early advantages in innovation capacity and digital infrastructure have created cumulative effects that amplify regional disparities over time**. The dimensional analysis further reveals that innovation-driven development and digital transformation serve as primary driving forces for new quality productive forces advancement, while factor coordination represents a critical constraint for lagging regions. The emergence of the “core-periphery” pattern can be attributed to three fundamental mechanisms: (1) Innovation agglomeration effects - Zhengzhou’s concentration of universities and research institutes creates knowledge spillovers that compound over time; (2) Digital infrastructure network effects - early investment in 5G and broadband creates positive feedback loops that attract digital enterprises; (3) Policy resource concentration - provincial capital status provides preferential access to national pilot programs and funding. Based on these causal mechanisms, four specific implementation strategies are proposed: (1) For innovation coordination: establish 3-5 regional innovation consortiums connecting Zhengzhou with Luoyang-Xuchang (score gap 0.132) through joint R&D projects and researcher exchange programs; (2) For digital transformation: implement a “Digital Leap” program targeting the 7 southeastern cities with scores below 0.500, providing targeted subsidies for 5G infrastructure and digital government platforms; (3) For green development: leverage the balanced distribution (CV = 0.195) by creating inter-city carbon trading mechanisms and joint environmental monitoring systems; (4) For factor coordination: establish regional talent mobility programs and cross-city investment funds specifically for the emerging cluster cities. This study developed a comprehensive evaluation framework for new quality productive forces in Henan Province by integrating an improved entropy weight-TOPSIS method with deep learning techniques. The research yields several significant contributions to both methodological innovation and regional development analysis. The improved entropy weight method successfully addresses the indicator redundancy issue through correlation-based weight adjustment mechanisms, enhancing evaluation objectivity and accuracy by 8.2% compared to traditional approaches. The integration of deep learning in indicator optimization demonstrates remarkable effectiveness, achieving 35% indicator reduction while maintaining 94.6% information retention, substantially improving evaluation efficiency while preserving analytical depth. The empirical analysis reveals distinctive spatial-temporal patterns in Henan’s new quality productive forces development, characterized by clear “core-periphery” structure, pronounced east-west gradient, and accelerating regional divergence that provides valuable insights for targeted policy formulation. The evaluation results indicate that Henan Province has achieved steady progress in new quality productive forces development from 2018 to 2023, with an average annual growth rate of 6.6%. Digital transformation has emerged as the fastest-growing dimension with 61.4% growth, while innovation-driven development exhibits the highest regional disparity (CV = 0.287). The significant performance gaps between leading cities (Zhengzhou: 0.842, Luoyang: 0.715, Xuchang: 0.683) and lagging regions (Jiyuan: 0.397, Shangqiu: 0.413, Zhumadian: 0.428) highlight the persistent challenges of balanced regional development within the provincial context.",
    "The empirical results reveal three fundamental mechanisms explaining the observed spatial-temporal patterns. First, the cumulative advantage effect explains why regional disparities have expanded rather than converged over the study period. Zhengzhou’s early investments in innovation infrastructure and digital platforms created self-reinforcing development cycles that compound over time, generating the 0.445-point gap with Jiyuan by 2023. This contradicts neoclassical convergence theory but aligns with new economic geography models where initial advantages create persistent regional hierarchies through innovation agglomeration effects, digital infrastructure network effects, and policy resource concentration. Second, the institutional-technological mismatch explains why digital transformation achieved the highest growth rate while factor coordination lagged behind with only 30.8% growth. Rapid technological infrastructure deployment outpaced institutional capacity building, creating bottlenecks particularly evident in the seven southeastern cities where factor coordination scores consistently remain below 0.500. This pattern indicates that technological diffusion alone cannot drive productivity transformation without supportive institutional frameworks for resource allocation and coordination. Third, the sectoral specialization effect explains dimensional performance variations across cities. Cities with strong environmental governance achieved balanced green development performance (CV =0.195) but struggled in innovation-intensive dimensions, while industrial centers excelled in manufacturing advancement but faced environmental constraints. This suggests that historical industrial specialization patterns continue to influence contemporary productivity development trajectories. Based on these causal mechanisms, four specific implementation strategies address the identified development bottlenecks. The Innovation Coordination Mechanism establishes 3-5 regional innovation consortiums connecting Zhengzhou’s research resources with secondary cities through joint R&D projects, researcher exchange programs, and collaborative patent development initiatives targeting the 0.132 average score gap between leading and developing clusters. The Digital Infrastructure Acceleration Program targets the seven southeastern cities with comprehensive digital transformation packages including RMB 2.3 billion for 5G infrastructure, RMB 1.8 billion for enterprise digitalization, and RMB 900 million for talent training to address the 40% digital transformation gap. The Green Development Network Strategy leverages the relatively bal: inc anced green development performance to create inter-city environmental collaboration mechanisms luding regional carbon trading systems and joint pollution monitoring networks. The Factor Coordination Enhancement Initiative implements targeted institutional reforms in emerging cluster cities through regional talent sharing agreements, inter-city venture capital funds totaling RMB 5.2 billion, and 50% reduction in administrative approval times. This research has several limitations that define directions for future investigation. The static nature of the indicator system may not fully capture the dynamic evolution of new quality productive forces concepts, necessitating development of adaptive evaluation frameworks that can respond to technological paradigm shifts. The city-level analysis potentially overlooks intra-city disparities that influence overall productivity patterns, suggesting the need for multi-scale evaluation frameworks encompassing both macro-regional and micro- county level analyses. The temporal scope of 2018-2023 captures initial development patterns but may not refl me ect long-term evolutionary trajectories, requiring extended longitudinal studies to validate the identified chanisms. Future research directions emerge directly from these limitations. Dynamic evaluation mechanisms that can adapt to the rapidly evolving characteristics of new quality productive forces would enhance the framework’s res] onsiveness to technological change. Multi-scale evaluation approaches would provide more granular insights into productivity patterns and enable targeted interventions at different administrative levels. Investigation of cross-regional spillover effects would enhance understanding of how leading regions influence lagging areas, informing more effective regional coordination strategies. Integration of advanced machine learning techniques such as graph neural networks and reinforcement learning could further enhance prediction accuracy and pol icy simulation capabilities, enabling more sophisticated scenario analysis for regional development planning. pol to Ch The methodological innovations and empirical findings provide a robust foundation for evidence-based icy formulation in regional new quality productive forces development, offering both theoretical contributions roductivity evaluation literature and practical guidance for achieving balanced regional transformation in ina’s central provinces."
]