[
    "Weak links in modern power grids can lead to cascading failures from isolated incidents, making the scientific assessment of grid and transmission line vulnerability essential for preventing large-scale blackouts. This study conceptualizes transmission lines as functionally critical infrastructure and develops a four-dimensional vulnerability assessment framework encompassing Danger, Susceptibility, Resistance, and Recoverability, taking into account natural environmental conditions, human disturbances, grid operational states, and emergency response capabilities. Distinct from conventional classification methods that primarily rely on structural topology or subjective judgment, this study adopts a hazard index—based approach and introduces an objective weighting mechanism using the entropy method to quantitatively evaluate and classify indicators across the four dimensions. A case study of 500 kV transmission lines in Henan Province, China, reveals that the composite vulnerability index of the province's critical power infrastructure reaches 57.2, indicating a high level of vulnerability. Among the transmission towers, 19.8% are classified at the “Higher” level and 40.6% at the “High” level. Considerable variation in Recoverability among towers significantly influences the overall vulnerability assessment results. Moreover, the distribution of susceptibility to various hazards and accidents shows strong spatial and temporal heterogeneity, closely related to seasonal factors and tower locations. Based on these findings, targeted strategies are proposed from the perspectives of line inspection and differentiated management, providing technical support for enhancing power grid resilience and improving disaster response efficiency. Although the large-scale interconnection of power grids has achieved a wider range of optimal resource allocation, it has also reduced the safety and stability of the system, with widespread power outages cause: by localized failures occurring multiple times!. In recent years, earthquakes, rain, snow, freezing weather, rainstorms, typhoons, and other natural disasters around the world, as well as intentional or unintentiona external damage are threatening the stable operation of power grid transmission lines, even leading to large-scale power outages and other accidents, causing serious economic losses and social impact. For example, on July 13, 2019, a transformer fire caused a massive power outage in Midtown and the Upper West Side of Manhattan in New York City, U.S., with nearly 70,000 customers affected; the destruction of critical infrastructure an power disruptions in Yaan, Sichuan, China in 2013 and Wenchuan, Sichuan, China in 2008 due to earthquakes, and the massive power outage in southern China in 2008 due to severe weather caused by freezing rain an snow. In a comprehensive analysis of the above power emergencies, the initial cause is mostly the damage to the grid system by external factors, which leads to the unstable operation of the grid and thus causes serious socio-economic losses*->. Therefore, it is crucial to design a comprehensive vulnerability assessment metho to evaluate the safety risks of the grid in the context of natural disasters and external damage, and to develop targeted vulnerability reduction measures for the assessment results. The vulnerability analysis of the grid was first proposed by Petroianu et al. in 1974, but due to the small scale of the grid at that time, the vulnerability analysis of the grid did not receive sufficient attention. With the 1School of Economics and Management, Shanxi Normal University, 030031 Taiyuan, China. *School of Politics an Public Administration, China University of Political Science and Law, Beijing 100088, China. School of Government Management, Beijing Normal University, Beijing 100875, China. “School of Engineering and Technology, China University of Geosciences, Beijing, China. “email: whqlustrive@cupl.edu.cn; whqlustrive@163.com increasing scale and complexity of power grids, the consequences of power grid accidents have become more and more serious, and the vulnerability of power grids in their own structure and operation state has drawn people's attention again, A. A Found reintroduced the concept of vulnerability in 1994, used the transient energy function to analyze the vulnerability of power grids, and made it a new element of power system dynamic safety assessment®, Subsequently, scholars worldwide initiated research on vulnerability assessment in the power sector. Some researchers proposed a vulnerability assessment method based on cascading indices and spectral graph metrics, which involves calculating and comparing these indices to rank transmission lines under different contingency scenarios”*. According to the different research contents, the research on vulnerability in the field of electric power can be divided into three categories. (1) Technical vulnerability assessment: Also known as electrical vulnerability, this method analyzes the power system’s structure and operational mode” based on the grid’s topology and system operating conditions. Depending on the research perspective, technical vulnerability in power grids can be classified into structural vulnerability'®, state vulnerability, and a comprehensive vulnerability assessment that integrates both perspectives!!-}3, Grid structural vulnerability assessment focuses on the tendency of a grid system to fail to maintain its topological integrity and normal operation after a certain unit or units exit due to external disturbances or failures in the system, and analyzes grid resilience from the perspective of the importance of a node or branch in the grid structure. For a particular grid, its network structure is unique, and therefore, structural vulnerability is a reflection of the inherent vulnerability of the grid'*!°, Complex network-based research methods are the mainstream approach to assessing the structural vulnerability of the grid'*!”. The grid state vulnerability assessment focuses on the tendency of the electrical parameters showing the system operating state to change abnormally and approach a critical value when a fault occurs in the system, thus making the grid unable to continue to provide services, and analyzing the grid’s ability to resist faults and disturbances from the operating state®. With the in-depth study of grid vulnerability, some scholars believe that the analysis model considering only structural vulnerability ignores the state parameters in operation, and the analysis method considering only state vulnerability ignores the importance of the unit in the grid structure, and both analysis and assessment methods have certain shortcomings'*!°. The assessment methods of grid vulnerability gradually develop from single attribute vulnerability assessment to integrated vulnerability assessment combining structural vulnerability and state vulnerability”.",
    "(2) Physical Vulnerability Assessment: For components or infrastructure in the grid, the risk of accidents such as insulation degradation, transmission line, and facility damage due to external influences (natural disasters, climatic factors, human damage) is analyzed for these elements**‘. The U.S. Department of Energy (DOE) jointly developed the VRAP (Vulnerability Risk Analysis Program) in 1997, which is an early application of physical vulnerability assessment for power facilities. The practicality of vulnerability assessment was subsequently optimized in 2002 with the promulgation of the Draft Methodology for Vulnerability Assessment of Power System Infrastructure. Since then, scholars have begun to focus on such assessment methods, Kang L et al. analyzed the vulnerability of grid infrastructure when it is affected by external factors through a risk assessment approach, and proposed a model of joint cooperation between enterprises and the government to assess”>. Baiardi F et al. used hierarchical analysis to assess the vulnerability of critical infrastructures in the event of an attack using power equipment as an example”°. Wang Yujie et al. used simulation modeling to assess the physical vulnerability of the Yunnan power grid by focusing on the impact of geological disasters on power grid towers”. (3) Emergency system vulnerability: Analyze the response and recovery capacity of the power emergency management system in the face of accident hazards. At present, there are few studies on emergency vulnerability in the field of electric power, and most of the existing studies are conducted from two aspects: vulnerability of the emergency system and vulnerability of emergency capability. Cheng Zhengang et al. constructed an assessment index of the vulnerability of the electric power emergency system from nine aspects, including the legal basis and organizational structure’’. Zhu Weidong constructed an evaluation index system for the vulnerability of emergency management capability of nuclear power plant safety accidents from the attack-defense perspective”. In summary, compared with existing studies, this paper takes into account the grid’s ability to resist disturbances and recover from disasters while considering the degree of disturbances and impacts on the grid from a safety risk perspective, and analyzes the grid and its line vulnerability qualitatively and quantitatively using the entropy weight method and the hazard index method, which qualitatively indicates the assignment criteria and vulnerability level levels of each index, and quantitatively is a method of obtaining and analyzing safety vulnerability evaluation data using GIS software, which is combined with the entropy weight method to calculate the grid safety vulnerability level. A 500 kV transmission line in Henan Province was selected for case study, and from the perspective of line operation and inspection and emergency repair, targeted countermeasure suggestions were given for different safety vulnerability characteristics and levels, with better identification capability and higher identification accuracy for transmission towers and line vulnerability levels, providing a more accurate basis for the development and implementation of measures to ensure grid operation and reduce grid vulnerability. To achieve a scientifically sound assessment of power grid security vulnerability, this study designs the research process as illustrated in Fig. 1, following the logical sequence outlined below: First, based on the theory of system vulnerability, the study defines a four-dimensional framework—Danger, Susceptibility, Resistance, and Recoverability—to establish the theoretical foundation. Second, an evaluation index system is constructed to ensure that the four dimensions are measurable and comparable. Third, the hazard index method is applied to assign values to the indicators, and the entropy weight method is employed to determine the weights, thereby enhancing objectivity and comparability among the indicators. Fourth, the DSRR comprehensive vulnerability assessment model is develo, is conducted on the 500 kV ed to map the indicators to a composite index. Finally, an empirical case study transmission lines in Henan Province to test the model’s applicability and assess indicator variability. Each phase builds on the previous one in a logically progressive manner, from theoretical construction to empirical analysis, forming a complete and coherent cycle that ensures the vulnerability assessment results are both tl eoretically grounded and practically valid. The entropy method determ of entropy originates from information theory that the ines the weights based on the information utility value of each index. The concept hysics and represents the degree of disorder of the system, and it is believed in igher the entropy of information, the lower its usable value*’. The weights derived using the entropy method reflect the extent to which a given factor contributes to variations among different evaluation targets. For exam identical, resulting in minim: le, when the transmission line spans a small area, the climatic conditions are nearly al differences in their impact on various transmission towers. However, even within a small area, road traffic conditions can vary significantly, leading to notable differences in their influence on transmission towers. Conse: uently, when applying the entropy method, the weight of road traffic factors will far exceed that of climatic conditions.",
    "The entropy method plays a pivotal role in the assessment of power grid safety vulnerability, particularly in its ability to achieve objective weighting, quantify indicator differentiation, and integrate the influence of multiple factors. By calculating the information entropy of each indicator, it determines weights scientifically, avoids subjective biases, emy hasizes the impact of key indicators, and downplays less critical factors, thereby constructing a comprehensive vulnerability index. Moreover, the entropy method dynamically captures the spatial and temporal variations in vulnerability, providing robust data support for the assessment results. This approach facilitates the identification of highly vulnerable regions and components, offering a reliable foundation for optimizing power grid layout, designing protective strategies, and ensuring efficient resource allocation*!. Thus, the vulnerability results calculated using the entropy method effectively reflect the relative vulnerability levels among different objects within the study system. The determination of indicator weights using the entropy method involves the following steps: For the studied of m transmission towers M = M;(i=1, 2, ..., m), suppose it has n sets of evaluation indicators N = Nj(j=1, 2, ...n) and let the assigned data of indicator Nj of Mi be «ij. Then the original evaluation matrix X is. In Eq. (2), Yi; is the standardized index value, x;; is the original data of the jth index of the i-th transmission tower ensemble, max(x;) and min(;) are the maximum and minimum values of the jth index, respectively. (3) Calculate the weight of the indicator. Calculate the proportion of the i th transmission tower under the j th indicator Since the information utility value is the basic basis for determining the weight of the entropy method, the greater the utility value is, the more important this factor is to the evaluation target, so the weight calculation method of the j-th index is: The hazard index method is an evaluation method proposed by Dow Chemical Company in 1964 for quantitative evaluation of fire and explosion risks, and can also be used to evaluate the hazards of potentially hazardous installations such as power distribution and drainage systems, in addition to the fire and explosion field”. This method assigns values to indicators by grading the status of stored material types, safety devices and measures to obtain scores for the corresponding indices, so that data of different orders of magnitude can be graded and then assigned to achieve a dimensionless processing of indicators. To achieve dimensionless processing of different indicators, the hazard index method mainly adopts two types of scoring approaches: (1) linear normalization, which is suitable for continuous variables, and (2) graded assignment, which is suitable for discrete variables with national standards or empirical classification criteria. For continuous variables, the scoring formula is expressed as: where S;,; is the hazard index score of the i-th evaluation object for the j-th indicator, x; is the raw data value, and Xmaz and Xmin are the reference maximum and minimum values of the indicator. U and L represent the upper and lower bounds of the score, which are uniformly set to 100 and 10 in this study to ensure consistency across indicators. For indicators with clearly defined grading standards (such as tower-to-road distance, soil pH value, air quality index, etc.), a stepwise assignment method is adopted. Based on relevant standards or literature, interval thresholds are defined and fixed scores are assigned accordingly. Due to the different units of the evaluation indicators, it is necessary to perform dimensionless processing before calculation. In this paper, the hazard index method is used for dimensionless treatment of each indicator. The raw data of the indicators in this paper differ greatly in magnitude; for example, the raw data of the distance indicator ranges from tens to thousands of meters, while the temperature indicator is nearly within the same order of magnitude. If the range method were used, the dispersion degree of the distance index would be much larger than that of the temperature index, leading to the failure of the temperature index in the evaluation. Therefore, compared to the range method, the hazard index method is more suitable for this paper. McEntire (2001) states that vulnerability is determined by the extent to which the components of a disaster include risk, susceptibility, resistance, and recoverability. Risk and susceptibility are summarised as adverse factors, while resistance and recoverability are summarised as capacity factors*>*4. The current research on vulnerability in the field of electric power is divided into technical vulnerability, physical vulnerability and emergency vulnerability. To differentiate from technical vulnerability, this paper defines grid safety vulnerability as \"the degree to which transmission lines (including towers) are vulnerable to loss of power system functions and adverse impacts on society due to insufficient structural strength or emergency recovery capabilities in the face of natural disasters and human damage”. This concept emphasizes the outstanding characteristics of four aspects of the safety vulnerability of power grid: (1) Danger: the possibility and severity of damage to the physical structure of power grid caused by natural disasters and man-made damage; (2) Susceptibility: the scope and degree of influence after the occurrence of power grid accident; (3) Resistance: the resistance of internal factors such as the structural strength of the power grid and the current operating state to external influences; (4) recoverability: the emergency repair and recovery ability of the power grid. Selecting the index elements according to the four aspects of “danger”, “susceptibility”, “resistance” and “recoverability” is the key to building the evaluation index system using the safety vulnerability model. Thus, we call it the DSRR model, which systematically reflects an analytical view of the relationship between environmental and human systems. The indicators in these four aspects each influence the grid’s safety vulnerability from the perspectives of both “offense” and “defense”. Specifically, danger and susceptibility are the attack factors of vulnerability and have a positive correlation with the safety vulnerability of the power grid. Danger represents the extent to which the power grid is affected by natural disasters and other external factors. Susceptibility represents the impact of the accident on society. The deeper the impact of the accident, the larger the scope of impact, the lower the social acceptance. It can be inferred that the higher the danger and susceptibility, the higher the safety vulnerability of the power grid. Resistance and recoverability are the defense factors of vulnerability and are negatively related to the safety vulnerability of the power grid. Resistance represents the ability of the transmission line itself to resist external influences, and recoverability represents the ability of emergency repair and recovery after the power grid accident. The higher the resistance and recoverability, the lower the vulnerability. The relationship between them is shown in Fig. 2.",
    "Danger index elements are used to characterize the degree of external impact on transmission lines. It mainly refers to the external pressure caused by natural disasters, environment and human activities on the tower and line. According to the analysis of power grid safety vulnerability factors, natural disasters affecting the safety vulnerability of transmission lines mainly include wind damage, lightning, rain and snow freezing, pollution flashovers, floods, etc. Other external damages include theft, mechanical touch, and tree crossing. Through the analysis of the impact factors of various disasters and accidents, a total of 35 danger indicators are extracted, as shown in Table 1. Susceptibility index elements are used to represent the severity of the consequences of power grid accidents and the degree of harm to society. The susceptibility index element is used to characterize the severity of the consequences of a power grid accident and the degree of harm that affects society. The damage caused by a power grid accident affects the life of the residents on the one hand and the production and operation of the local economy on the other. The higher the voltage level, the greater the loss of electrical load caused by the accident. Therefore, this paper takes the degree of grid disaster impact as the first level index of the susceptibility assessment index system and extracts three grid susceptibility index elements by analyzing the susceptibility factors and using the index system construction method, as shown in Table 2. The resistance index element is used to represent the physical property of the tower and its ability to defend against disasters. It mainly refers to the resistance of the type and current state of the tower to external pressure. Transmission poles and towers can be distinguished according to materials, functions, and insulator suspension methods. Different types of transmission poles and towers have different design strengths, and their resistance to disasters and external forces will naturally vary. At the same time, under the influence of the surrounding environment, there is corrosion, and uneven stress leading to aging and wear of accessories, which will affect the strength of the tower itself, and thus affect its ability to resist external pressure. Therefore, this paper selects tower classification, tower strength, topographic relief, and line characteristics as the primary index elements for resistance evaluation. Through the analysis of safety vulnerability factors and the construction method of the index system, 10 secondary index elements such as function classification, voltage level, service, life, and soil PH are extracted, as shown in Table 3. The recoverability index element is used to represent the emergency repair and recovery ability after the accident, and it is the social level’s resistance to the power grid accident. The longer the outage time caused by the transmission line accident, the greater the impact of the accident and the wider the scope. Therefore, it is important whether the emergency repair team can arrive at the accident site the first time and transport the emergency repair equipment and materials to the accident site. This paper takes post-disaster emergency repair and recovery as the primary indicator element of recoverability assessment, and extracts three secondary indicator elements according to the indicator system construction method, as shown in Table 4. In this paper, based on the constructed vulnerability assessment index system of power grid safety, the original data such as temperature and humidity are re-valued using the hazard index method to achieve dimensionless indicators. When the entropy method is used for the dimensionless treatment of indicators, the dimensionless score should be within the same order of magnitude as far as possible, otherwise the smaller the score is, the greater the weight determined by the entropy method will be, so the value range of each secondary indicator is 10-100 points. See Fig. 3 for the calculation process of the power grid safety vulnerability index. The scoring standard of the secondary indicator air quality index is based on the average air quality index of 53 air index monitoring stations in Shijiazhuang, Hebei Province, from March 2021 to February 2022. During this period, the average air quality index of Shijiazhuang is 99. According to the monthly report of air quality ranking issued by the China Environmental Monitoring Station, Shijiazhuang ranked 134 out of 168 monitored cities in the country in the past year.",
    "The parameter population density is determined with reference to Q /GDW152-2006 Standard for Selection of Pollution Classification and External Insulation of Power System*». In the standard, the population density range is 0-10,000 people /km”. Therefore, the calculation method of the value N of this parameter in this paper is as follows: ‘The parameter air humidity is described as “prone to heavy fog or drizzle” in the Standard for Selection of Pollution Classification and External Insulation of Power System, but no clear standard is given. According to the historical meteorological data of most cities in China, the relative humidity of the air ranges from 50 to 70%. When Jiang Yunpeng and others studied the factors affecting the adhesion of particles on the surface of porcelain insulators, they explored the adhesion effect of particles when the humidity is 40 to 80%*°, proving the significant impact of air humidity on particle adhesion. Therefore, the value P of the air humidity parameter is calculated as follows: The distance from the parameter to the pollution source is classified into five categories in the “Standards for the Selection of Pollution Classification and External Insulation of Electric Power System”. There are five levels, from very light, light, medium, heavy to very heavy. In this paper, the assignment criteria are determined according to their classification, as shown in Table 5. The establishment method of the evaluation criteria for other types of danger indicators is similar to the pollution flashover accident, see Appendix I for specific criteria and rationale for assignment of values. (2) Calculation and grading of danger index. Through weighted calculation, the danger score of various natural disasters and external damage can be obtained. The danger of each transmission tower can be calculated by calculating the weighted average value to determine the key prevention and control objects. Since the value range of each index is 10-100, according to the above calculation ideas, the maximum value of the danger index is 100. According to the danger index value the of power grid and the natural breaks, the danger index of safety vulnerability can be divided into four levels, as shown in Table 6. The values of the parameter GDP are based on the results of the analysis of the GDP data of 21 provinces in 2020 selected from seven regions of China, including East and South China, See Table 7. Data source: GDP data from the statistical yearbook of the statistical bureau of each province (autonomous region), population data from the seventh population census of each province (autonomous region) Census Announcement. Select the quartile of GDP distribution as the basis for division, and divide the city (state) GDP into four grades, as shown in Table 8. When determining the specific value of the index, according to the actual GDP of the assessment area, the value is taken within its value range according to the proportional method. The parameter population density is divided and taken from the same idea, as shown in Table 9. The population density here involves two indicators, one is the population density of the power-receiving city as a whole, which reflects the impact of the power outage caused by accident disasters on the city itself, and the other is the population density at the transmission tower, which reflects the impact of the surrounding social activities in the process of emergency repair and rescue. The parameter voltage level is ased on the current voltage level, as shown in Table 10. (2) Calculation and grading of susceptibility index. the susceptibility index, the weig There is only one primary indicator and four secondary indicators under susceptibility, and when calculating ited average method is applied to calculate the average of the scores of each secondary indicator. Since the value range of each secondary index is 10-100, the value range of the susceptibility index is 10-100, and it is divided into four levels according to the method in Table 7. Taking the tower strength as an example, the value basis and assignment method of each resistance index are explained in detail. For the parameter of service ife, when studying the vulnerability of important infrastructure in Shanghai Power Grid, MenYongsheng classified the service life of transmission lines according to the Annual Report of the State Grid Corporation on the Operation Analysis of Power Grid Equipment, and determined the service life classification table of transmission lines as shown in Table 11 with reference to its value weight.",
    "The parameter soil PH refers to the conclusion drawn by Tang Rongmao and others in the study of corrosion- influencing factors in Q235 steel and conductive concrete, that is, the soil PH value is the factor with the largest weight of corrosion influence of tower materials in the soil, and the corrosion rate will increase with the decrease of the ph value. When the PH value rises to 10, the corrosion phenomenon is no longer obvious due to the passivation reaction*”**, The valu e range of soil PH is thus determined, as shown in Table 12. Danger index, but since the resis’ The parameter air pollution degree and air humidity assignment refer to the calculation and division of tance and danger are inversely proportional and directly proportional to the safety vulnerability, the values should be adjusted appropriately as shown in Table 13 and Table 14. See appendix II for criteria and basis for assigning values to other types of resistance indicators. (2) Calculation and grading of resistance index. The resistance calculation uses the entropy weight method to determine the weight of each secondary index and then calculates the score of each primary index. Finally, the resistance index is calculated by calculating the arithmetic mean of each primary index, and is graded according to the grading method in Table 6. For the pole tower from the road straight line distance this parameter affects the emergency repair vehicles and equipment that can quickly and efficiently reach the first scene of the accident. According to GB50545-2010 Code for Design of 110-750 kV Overhead Transmission Lines, the minimum horizontal distance between the tower edge and the subgrade is specified. The minimum horizontal distance between the 110 kV tower and the road in the area with restricted path is 5 m, which is the closest distance between the high-voltage transmission tower and the road. Based on the value classification of this design sub-index, See Table 15. For the parameter of straight-line distance from the power supply bureau to the tower, according to the “Ten Commitments” of Power Supply Service of State Grid Corporation of China’, the time for power supply emergency repair personnel to arrive at the site is 45 min in urban areas, 90 min in rural areas, and 120 min in special remote areas. Considering the time for emergency repair teams to prepare for the police, the classification of linear distance is calculated according to 30, 60, and 90 min of driving distance, and the speed per hour is calculated according to the speed limit of 40 km/h in urban areas, as shown in Table 16. The parameter population density is assigned according to the division criteria in Table 9. However, due to the inverse relationship between recoverability and vulnerability, appropriate adjustments should be made when assigning values, as shown in Table 17. Consistent with the resistance, the selection of the recoverability index takes into account the environmental factors of each tower, so it is applicable to determine the weight of each index using the entropy weight method, and calculate the score of the first-level index, namely the danger index, through the weighted average method. Through the above calculation, the values of danger index A, susceptibility index B, resistance index C, and recoverability index D can be obtained. Since the two indices C, D are inversely related to the overall safety vulnerability index V, 100-C, 100-D is used to calculate the vulnerability take from resistance and recoverability. where, W represents the corresponding weight calculated by entropy method. At the same time, the overall safety vulnerability index can be divided into four levels according to Table 18. The data used in this paper mainly include tower coordinates data, meteorological data, population data, soil data, vegetation cover data, elevation data, and seismic data. Among them, tower coordinate data comes from LSV software capture, meteorological data comes from the Resource and Environmental Science and Data Center of the Chinese Academy of Sciences, population data comes from the seventh provincial census announcement, soil data comes from the National Tibetan Plateau Science Data Center, vegetation coverage data comes from the global geographic information public product GlobalLand30, and elevation data comes from LSV software, The seismic data is from the Seismic Ground Motion Parameter Zoning Map of China (GB18306-2015).",
    "This chapter conducts a comprehensive analysis of the crossing environment of the LZ500kV transmission line in Henan Province, encompassing geographical, meteorological, and social characteristics, and utilizes GIS to visually and intuitively present the current state of the transmission line. This analysis provides a foundational environmental dataset and critical support for the construction of the transmission line safety vulnerability index in the subsequent Sect. (4.2), while also serving as a basis for the determination of model parameters and the interpretation of analytical results. The 500 kV line from Luohe City to Zhoukou City in Henan Province is referred to as the LZ line for short. The starting point is located at the 500 kV substation in L City and the ending point is located at the 500 kV substation in Z City. The total length is 78.1 km. There are 187 tower bases. For the convenience of description, the number is 1 #~ 187 # from west to east. The tower material is Q235 steel, and the insulator string is I-type suspension. The line covers 2 cities, 5 counties and 12 townships (towns), and is generally east-west. A small part of its west side is located in L city, and most of the lines are located in Z city. As shown in Fig. 4, the location coordinates of the transmission tower obtained by LSV software and the crossing of the line administrative region completed by ArcGIS software. In order to observe the crossing of the line more clearly, reduce the drawing scale, as shown in Fig. 5. The position selection function of ArcGIS software can be used to analyze the crossing of the line. For the convenience of expression, the line composed of i # tower and (i+1) # tower is called i # line. The number of the line with crossing is shown in Table 19. (2) Transmission tower from the water and other special geographic element's location relationship. Since tl in Fig. 6. e study area is inland, with good vegetation coverage, mainly farmland and residential areas, without ollution sources such as sea and open space, the special geographical elements selected in this paper are shown Since tl the line is etween t! difference e transmission line is built by two towers, the total number of transmission lines is 186. The software output angle degree is the angle between the line and the due east along the counterclockwise direction. Since always from west to east, the value range of the above angle degree is [0,90] U [270,360]. The difference e two adjacent lines is the corner between the lines, with 185 included angles. Figure 7 shows the between the direction and the corner. Through t e analysis in Fig. 8, it can be seen that the area where the line passes is mainly plain area, are dominated yy farmland, without forest land. Therefore, the risk of forest fire is excluded during the danger assessment of the research object because the overall elevation of the line is low, the impact of elevation on the danger of the transmission line is mainly reflected in the unbalanced force of the tower caused by the relative elevation difference (elevation difference /span). According to GB18306-2015 Seismic Ground Motion Parameter Zoning Map of China”, the peak ground motion acceleration is 0.1 g for towns and townships in L city, and 0.05 g for the rest. There are 21 transmission towers in the town. Attribute analysis of meteorological environment around the road When analyzing the meteorological environment, if only the information of the five county meteorological stations that the line crosses is analyzed, the analysis accuracy will be affected due to the small number of samples. Therefore, the daily meteorological data of the 14 meteorological stations in L and Z cities will be analyzed, and the city-level analysis results will be extracted to the tower location. Figure 9 shows the distribution of meteorological stations in the two cities. The time range of meteorological data selection is from January 2000 to December 2019. One of the meteorological stations was completed in 2004, so the data of this station is from January 2004 to December 2019. Since the altitude difference of the region where the research object is located is not obvious, the inverse distance interpolation method is adopted for the meteorological data processing of the research object in this paper. The analysis results of the temperature grid data obtained are shown in Fig. 10.",
    "‘The distribution of air humidity in the two cities of LZ is shown in Fig. 12. The air humidity distribution is analyzed by inverse distance interpolation method. The results obtained are shown in Fig. 10. The average air humidity in winter and spring is used to reflect the impact of air humidity on icing disasters, and the average air humidity is used to reflect its impact on tower corrosion, pollution flashover and other accidents. (4) Processing of wind speed and direction data. Some of the 14 national meteorological stations in LZ began to record the maximum wind speed in 2011. In order to ensure that the time span of data at each station is consistent, the average wind speed is taken from 2000 to 2019, and the maximum wind speed is taken from 2011 to 2019 (as shown in Fig. 13). Due to its weak geographical and spatial attributes, the wind direction information within the whole city cannot be obtained through interpolation analysis. Therefore, the wind direction of the nearest meteorological station to the transmission tower is used to represent the wind direction of the transmission tower location in this paper. The nearest station information to the transmission tower shown in Table 20 can be obtained by using ArcGIS software for neighborhood analysis. Table 21 shows the wind direction frequency and frequency data processing results of each meteorological station from 2011 to 2019. It can be seen from the above table that the wind direction distribution of the five meteorological stations meets the conditions of having dominant wind. The dominant wind direction of each station is obtained according to formulas 13, 14, 15, as shown in Table 22. where, A. is the average wind direction, U is the wind direction component in the east-west direction, V is the component in the north-south direction, N is the statistical number, and A; is the included angle between the wind direction of the i-th statistic and the due north direction clockwise. According to the above method, the dominant wind directions of each meteorological station in winter and spring are shown in Table 23. Figure 14 is drawn based on the air quality monitoring data of 39 air quality monitoring stations in the two cities from January 2021 to March 2022, where the data value is the average air quality index in this period. Refer to the China Lightning Monitoring Report 2017! for the number of thunderstorm days. The range of thunderstorm days in Luohe City is 14-20, with the median value of 17, and that in Zhoukou City is 14-24, with the median value of 19. According to the results of the seventh national population census, Luohe city is a power transmission city with a population of 2,367,490 and an administrative area of 2692 square kilometers. Zhoukou city is a power receiving city with a population of 9,026,015, an administrative area of 11961km? and a population density of 754.62 people/km?. At present, the population data available in the literature can only be accurate to the district and county level. If the average population density of the district and county level is directly used to represent the population density of the location of the transmission tower, it will cause a large error. In this paper, the overall average population density is weighted by calculating the core density of the village. See Fig. 15 for the classification map of village core density after re-classifying the village core density according to the natural breakpoint method. (2) GDP According to the 2021 statistical yearbook data of Henan Province, the GDP of Zhoukou City in 2020 is 326.719 billion yuan. Table 21. Statistics of wind direction and frequency of meteorological stations. The meaning of the wind direction number represents the included angle between the wind direction and the due north direction in the clockwise direction, 1 represents 0 degrees, 2 represents 22.5 degrees, and is accumulated in sequence. ‘The included angle between the dominant wind direction in winter and spring and due north in clockwise direction (degrees) | 15 | 37 | 26 | 77 | 178 ‘The results extracted using the aforementioned software can be assigned scores according to the value assignment standards for the indicators outlined in the appendix. After scoring the corresponding secondary indicators for each transmission tower, the entropy method can be employed to determine the weight of each indicator. The weighted average of the secondary indicators is then calculated, which yields the score for each primary indicator. Based on these scores, a corresponding analysis can be provided.",
    "There are three secondary indicators of wind damage, the annual average extreme wind speed, the annual average wind speed, and the angle between the line and the dominant wind direction. The first two can be obtained directly from the software output results. The angle between the line and the dominant wind direction can be calculated by the following formula. where, V; is the angle between the direction of the i-th transmission line and the dominant wind direction, ai is the direction of the i-th transmission line, and Axi is the dominant wind direction of the position of the i-th transmission tower. Since the angle between the wind direction and the line cannot be greater than 90 legrees, when V; is more than 90 degrees and less than 180 degrees, Vi is equal to 180-V;; and when V; is more than 180 degrees and less than 360 degrees, V; is equal to 360 -V;, repeat the above operation until V; is less than 90 degrees. After obtaining the scores of three secondary indicators, the entropy weight method is used to letermine the weights of each secondary indicator as 0.01, 0.03, 0.96. See Fig. 16 for the scores and weighted comprehensive scores of all secondary indicators. From the analysis of weighted calculation results, it can be seen that the dispersion degree of extreme wind eed and average annual wind speed scores of the indicators is relatively low, that is, the difference between these ‘wo indicators on the danger of transmission towers is small. However, the scattered degree of the included angle core between wind direction and line direction is large, which has a great impact on the relative vulnerability of ach transmission line. On the whole, the transmission towers with “high” relative danger are mainly distributed n the east section of the transmission line. The line trend has a large angle with the local annual dominant wind irection, which is more vulnerable to the impact of wind. reeds By calculation, the weights of thunderstorm day, conductivity and altitude are 0.04, 0.88 and 0.08 respectively. The conductivity index scores have a large dispersion, which brings a large difference in the danger of each transmission tower. At the same time, due to the low conductivity of most soil in the area where the line passes, the lightning danger of the transmission tower is greatly improved. According to the classification of danger in Table 6, most of the lightning danger is classified as “high” or above, the results are shown in Fig. 17. (3) Ice damage. Through calculation, the weights of the average wind speed in winter and spring, the dominant wind direction angle in winter and spring, the coldest month temperature, the temperature in winter and spring, and the humidity in winter and spring are 0.01, 0.3, 0, 0.69, and 0 respectively after the weights with the order of magnitude below 10-3 are reset to zero. On the whole, the icing danger of the west section of the line is “high” or above, showing a trend of high in the west and low in the east (As shown in Fig. 18). According to the analysis of the GIS map of the line, the low temperature in the west section is mainly caused by the fact that the west section mainly crosses wide areas such as farmland, and the east section mainly passes through dense urban areas. At the same time, such geographical distribution also leads to higher average wind speed in winter and spring in non-urban areas, It further aggravates the icing danger of transmission lines in non-urban areas. It is consistent with the historical data of ice disasters and accidents in non-urban areas, which proves the effectiveness of the analysis. On this basis, the greater the angle between the line and the dominant wind in winter and spring, the higher the danger of icing. The weights of extreme precipitation, annual precipitation and distance from water system are 0.08, 0.02 and 0.9 respectively. Affected by the rise of river water level in the rainy season, the transmission towers close to the water system are more vulnerable to flooding. There are three transmission towers within 200 m from the water system, but the average distance is more than 150 m. The overall danger to flooding is at a “low” level, as shown in Fig. 19.",
    "The weights of population density and distance from pollution source are 0.3 and 0.7 respectively, and the dispersion degree of other indicators is relatively low, which will hardly bring differences to the danger of different transmission towers to pollution flashover. On the whole, the danger of pollution flashover in the west section of the line is lower than that in the east section. The main reason for the analysis is that the west is non- urban and the population density is low. At the same time, the city itself is an important pollution source, and the degree of pollution in non-urban areas is low. As the city is closer to the city, the danger of pollution flashover is higher, as shown in Fig. 20. In the west section, the danger of some transmission towers to pollution flashover is abnormal, mainly due to the proximity to highways and ordinary roads. According to the spatial attribute analysis in ArcGIS, the main reason for the high danger of pollution flashover near the 100 # transmission tower is that the line is close to the high speed and is close to the pollution source. (6) Landslide and debris flow. According to the weight calculation results, the weights of extreme precipitation and slope index are 0.02 and 0.98 respectively, and the danger difference caused by the difference in annual precipitation can be almost ignored. According to the slope information obtained from ArcGIS, the line crosses a plain area with small topographic relief and low altitude. More than 90% of the transmission tower is located at a slope of less than 10 degrees. Therefore, the overall landslide danger of the line is low, which is at or below the “low” level, as shown in Fig. 21. The weights of peak ground acceleration and slope are 0.44 and 0.56 respectively. The seismic danger is based on the distribution of the acceleration of the peak ground motion. The danger of the westernmost section is relatively high as a whole, and the seismic danger of the transmission tower with large slope will fluctuate greatly. Due to the overall low peak ground motion acceleration at the location of the line and the small topographic relief across the line, the overall danger to earthquake disasters is at a “low” level, and individual locations reach a “low” level, as shown in Fig. 22. The weights of peak ground acceleration and slope are 0.44 and 0.56 respectively. The difference in danger to theft mainly comes from the distance from the road. Due to the corresponding consideration in the assignment, the higher the population density score, the lower the actual population density, and the same is true for the distance from the road. It can be seen from the figure that the danger of tower material theft is “high” and above, and the danger of most transmission towers is “low” and below due to the relatively close distance from the road and low population density, as shown in Fig. 23. The theft danger near the 50 # transmission tower is high. Combined with the geographical characteristics of this section, the main reason is that this section is located in rural areas, with relatively low population density and relatively weak social supervision. Population density, distance from the water and cross-road situation weights are 0.09, 0.08 and 0.83 respectively, combined with the above analysis, the line overall foreign object touch line in the “low” level, foreign object touch line danger of relatively high transmission tower in the closer to the water and cross-road location. In accordance with the order of cross-area highway, urban trunk road, general road, foreign object touching line vulnerability shows a decreasing trend, as shown in Fig. 24. According to the entropy method, the weights of various disasters and accidents are shown in the Table 24, and the distribution of the danger index of the power grid calculated by the weighted sum is shown in Fig. 25. The larger the weight of accidental hazards represents the larger the gap it makes between transmission towers danger, and vice versa the smaller. For example, the greatest weight of foreign object touching danger means that there is a large gap between transmission lines threatened by foreign object touching, while the flooding danger is nearly 0, which means that there is almost no difference in the size of each transmission tower threatened by flooding. From the perspective of safety, the greater the weight, the more discrete its danger state is, the more unstable it is, and there are points with higher danger that deviate from the normal state. We should find the points with higher danger to this disaster and strive to solve it, so that the danger of this kind of disaster tends to be stable. For the disaster types with low weight, it is necessary to further analyze whether the system as a whole is in a high danger state. However, with the expansion of the scope of research and the increase of evaluation indicators, the probability of a small weight but a high danger state as a whole will become smaller and smaller. According to the weighted comprehensive danger distribution diagram of various disasters, the anger index of 168 # and 125 # transmission towers is higher than 50, which is at the “high” level of danger, indicating that they have deviated from the normal state in multiple types of disaster danger.",
    "For high-weight, high-dispersion disasters such as foreign object collisions, it is essential to strengthen patrols and clearance operations in key areas, install protective devices, and establish real-time early warning systems. For low-weight disasters such as floods, which may still affect overall stability, optimizing foundation lesign and enhancing drainage systems are recommended to improve flood resistance. For transmission towers with high vulnerability indices (e.g., towers 168# and 125#), localized reinforcement, dynamic monitoring, and customized maintenance strategies should be implemented. Additionally, the disaster assessment framework ould be optimized holistically, with dynamic adjustments to weight distributions to address the compounding ffects of multiple disasters. These measures collectively aim to significantly enhance the resilience and safety of e power grid. mee The only index of susceptibility index is that the population density at the location of the transmission tower is istributed discretely with the spatial location of the transmission tower. The other indicators will not change with the location of the transmission tower because they are selected as the relevant indicators of the power receiving area. Therefore, the weight is determined as 0 by the entropy weight method. When the number of receiving cities is multiple, these indicators will be weighted. From Fig. 26, it can be seen from the figure that when the line passes through cities and towns, the susceptibility will increase with the increase of population density. When transmission tower accidents occur in areas with high population density, the emergency repair and rescue will have a great impact on the surrounding social activities. To address the discrete characteristics of transmission tower locations and population density distribution in susceptibility indices and their potential impacts on social activities, several measures should be implemented. These include optimizing transmission line planning and layout, enhancing the design and management of transmission towers in densely populated areas, establishing emergency response mechanisms, strengthening the protection of surrounding areas, conducting public awareness campaigns, and implementing dynamic monitoring and population assessments. These measures aim to mitigate the impact of transmission tower incidents on densely populated areas, improve the overall safety and risk resilience of the power grid, and ensure the stability of social activities and public safety. total of 10 secondary indicators are set for the resistance index, of which the three indicators of tower material, insulator suspension method and service life do not change with the number of the transmission tower in the study object of this paper. The weight is calculated by entropy method as 0, so this paper only considers the weight of the other seven secondary indicators. Due to the small number of secondary indicators, the weight of resistance index is determined directly according to the degree of dispersion of secondary indicators when calculating resistance index, as shown in the Table 25. It can be seen from the table that the main index that causes the resistance gap between transmission towers in the line studied in this paper is the functional classification, that is, the design strength of tension tower and tangent tower is the most important reason for the resistance gap between transmission towers. Due to the large amount of data, this paper will not show the scores of secondary indicators of 187 transmission towers separately. The weighted scores of resistance index are shown in the figure below. The resistance is negatively related to the safety vulnerability, so it is necessary to find the transmission tower with low resistance and formulate targeted solutions. On the whole, the resistance of the tension tower is significantly higher than that of the tangent tower. The span of 101 # and 144 # transmission towers with the lowest resistance is more than 600 m. The transmission tower is located in acidic soil, and 101 # transmission tower is accompanied by an angle of about 5 degrees, as shown in Fig. 27. To address the identified issues, the following targeted safety measures can be implemented. First, enhance the structural strength of suspension towers by optimizing the design of critical components and stability measures to narrow the resistance gap with tension towers. Second, optimize the span design of long-span transmission towers by adding intermediate support points to reduce the force-bearing span. In areas with acidic soil, adopt corrosion-resistant materials or improve soil conditions to mitigate the impact of corrosion on tower foundations. Additionally, upgrade the design of angle towers to improve their capacity to withstand horizontal loads and corner stresses. Simultaneously, establish a regular monitoring and maintenance mechanism, with a focus on the operational status of towers with lower resistance, and further reinforce wind and seismic resistance in regions with complex terrain or long spans. These measures can significantly enhance the stability and risk resilience of transmission towers, thereby strengthening the overall safety and resilience of transmission networks.",
    "The indicators of recoverability are ranked from the largest to the smallest according to the weight as the distance from the road, population density and distance from the power supply bureau, with the weight of 0.88, 0.12 and 0.0006 respectively. As shown in the Fig. 28, the recoverable force shows a strong positive correlation with the distance from the road for each transmission tower. The distance from the transmission tower to the power supply bureau is within 20 km, which can be reached in a relatively short time. Therefore, this indicator has a small impact on the recoverability of the research object, while the maximum distance from the transmission tower to the road is about 3 km, and the nearest distance is only 17 m. The distance from the road has a relatively obvious impact on the transportation of emergency repair and rescue facilities and equipment, At the same time, the distance from the road Is too far, which also brings challenges to the routine inspection work. To address issues related to recoverability, several targeted measures can be implemented. Constructing dedicated access paths will enhance the accessibility of remote transmission towers, while utilizing drones and remote sensing technologies will optimize inspection efficiency. Establishing emergency response bases in key areas will strengthen rapid response capabilities. Future planning should prioritize road accessibility and incorporate supporting infrastructure for remote regions. Additionally, collaborating with local governments to improve regional infrastructure is crucial. These measures will significantly enhance the operational resilience of transmission towers and the overall safety and reliability of the power grid. It can be seen from the table that the dispersion of the recoverability index brings the greatest difference to the safety vulnerability of each transmission tower, which indicates that the recoverability of different transmission towers is quite different, while the resistance of each transmission tower is relatively small. From the perspective of safety, it shows that the recoverability of some transmission towers has a relatively high deviation from the average level. After the accident, it is difficult for these transmission towers to achieve timely and effective repair and recovery. Compared with the recoverability, the difference between the susceptibility and danger of each transmission tower is small. The power grid safety vulnerability index of 187 500 kV transmission towers from Luohe City to Zhoukou City in Henan Province is 57.2, which is a high level of vulnerability as shown in Table 18. As shown in Fig. 29, the safety and vulnerability of the 187 500 kV transmission towers are located in the “higher” level of a total of 37, accounting for 19.8% of the total number of transmission towers. There are 76 transmission towers at “high” level, accounting for 40.6% of the total number. More than half of the transmission towers have safety vulnerability at a high level or above, indicating that the safety vulnerability level of these transmission towers deviates greatly from the average level of the line. The root causes of the differences in vulnerability of different transmission towers can be found by reversely inferring the index with larger weight among the four factors, such as danger and susceptibility, so as to put forward countermeasures and suggestions to reduce the vulnerability of power grid safety. On the basis of comprehensively grasping the operation status of transmission lines, the patrol period shall be appropriately extended or shortened. DL /T741 Operating Regulations for Overhead Transmission Lines stipulates that the normal inspection period of transmission lines is once a month**. However, with the increasing scale of power grid erection and the longer operation mileage, the demand for improving the inspection efficiency is increasing. Through the analysis of the safety vulnerability of the power grid, the vulnerability and resistance of each transmission tower of the line can be obtained. For areas or transmission towers with inconvenient traffic, high difficulty in patrol inspection but low vulnerability or high resistance of the transmission tower, the patrol inspection period can be appropriately extended, such as 90 #, 91 #, 92 # transmission towers with danger index lower than 25 (as shown in Fig. 25). For transmission towers with high danger or low resistance, the inspection period can be appropriately shortened to ensure that these transmission towers are in normal working conditions, such as 168 # and 125 # transmission towers with danger index higher than 50 and 101 and 104 # transmission towers with low resistance index (as shown in Figs. 25 and 27). These transmission towers are more vulnerable to disasters and accidents than other transmission towers on the line, or are large- span and small-angle tangent towers, and their environment is greatly affected by corrosion and other factors, It’s components are more vulnerable to damage or fatigue’*.",
    "Determine key patrol inspection disaster types by season’. Through danger analysis, most disasters or accidents have strong seasonal distribution characteristics. Spring patrol inspection should focus on the impact of wind damage on the transmission tower, as well as the icing of the line caused by special climate changes such as the late spring cold, the warming of the temperature in spring, and the increase of human activities. The patrol inspection in densely populated areas should be strengthened to prevent the impact of foreign objects on the operation of the power grid caused by human activities such as kite flying and tree planting. Winter is characterized by low temperature, foggy and high degree of pollution. The winter is relatively dry. In addition to the influence of coal heating, the degree of air pollution has increased compared with other seasons. In case of heavy fog, pollution flashover is likely to occur. At the same time, the winter temperature is relatively low. Especially, the average temperature of January in the area where the research line is located is extremely in line with the temperature standard suitable for icing. Once the humidity and wind speed conditions meet the requirements, the line icing disaster is likely to occur, and the icing leads to the increase of wind area, causing secondary disasters such as line galloping. In the period of severe climate change, combined with the focus of seasonal patrol inspection, the efficiency of patrol inspection can be improved and the safety of power grid can be guaranteed. Refine the inspection contents according to disaster types. For example, the impact of wind disaster on the transmission tower is mainly concentrated on the swing angle of fittings, bolts and conductors. The frequent change of wind direction will cause the wear of fittings, especially the insulator connection fittings. The lateral swing of conductors will easily lead to the loosening of the tower bolts. When the wind is too strong, it will also lead to the wind deviation tripping. Therefore, the key inspection contents for the wind disaster will be determined“. Patrol inspection of pollution flashover mainly includes observation and measurement of insulator surface pollution. According to the different types of disasters, we can determine the focus of targeted patrol inspection, cooperate with seasonal patrol inspection, and further improve the efficiency of patrol inspection. (3) Improve the intrinsic safety level of power grid. Installation of safety guards based on safety vulnerability characteristics**. For example, the tower materials of 28 #, 65 # and other transmission towers with high danger to theft shall be subject to anti-unloading treatment, and anti-theft bolts shall be installed at the section number close to the ground (as shown in Fig. 23). For transmission towers with high danger to floods such as 149 # and 79 # and high danger to landslides such as 41 #(as shown in Fig. 21), effective anti-erosion measures can be taken to reduce their danger, such as setting drainage ditches and making foundation protection for transmission towers. The insulator suspension mode shall be improved to V type near the poles and towers with high danger to icing and pollution flashover. According to different disaster characteristics, technical means shall be used to improve the safe operation level of power grid. Reasonably follow the warning signs and warning signs. On the one hand, ensure the standardization and integrity of the pole number plate and warning plate of the transmission tower itself. On the other hand, warning signs in line with the situation should be set near the corresponding dangerous points, such as setting warning elevation on the road near the 83 # transmission tower with important crossing, and installing warning signs of “high voltage danger, no fishing” along the 111 # and 79 # transmission towers near the water area (as shown in Fig. 5). Select the appropriate online monitoring device according to the characteristics of danger and resistance. The transmission line online monitoring device can be divided into several types according to different monitoring purposes, such as meteorological monitoring, conductor temperature monitoring, line sag and wind deflection monitoring, tower tilt monitoring, anti-theft alarm monitoring, etc. Comprehensive online monitoring will not only increase the cost of line operation and use, but also cause waste of resources. Therefore, different types of online monitoring devices should be installed according to the vulnerability attributes of different transmission towers to achieve reasonable and optimal resource allocation. For example, the conductor temperature monitoring device is installed on 152 #, 153 # and other transmission towers with high icing danger (as shown in Fig. 18), and the tower tilt monitoring device is installed on 144 #, 143 # and other large-span and corner towers with low resistance, so as to grasp the line operation status remotely and online, and go to the site in time to understand and deal with the transmission towers with abnormal parameters.",
    "From the analysis of safety vulnerability results, it can be seen that recoverability and susceptibility are the two items that account for a large proportion of safety vulnerability. Improving recoverability and reducing danger are the most effective ways to reduce the gap between safety vulnerabilities of transmission towers. Densely populated areas and transmission towers far away from the road are more difficult parts in the process of power emergency response. Reasonably allocate emergency supplies’”. Targeted emergency repair equipment corresponding to disasters shall be allocated nearby. For example, the danger of wind disaster and icing near 100 # tower is relatively low, and the danger of pollution flashover is relatively high (as shown in Fig. 29). More emergency repair equipment and components for pollution flashover accidents shall be stored in the nearest emergency repair station of this section to realize the rationalization of emergency resource allocation. Improve the emergency repair capability. In the research line, the danger of wind disaster and pollution flashover of the transmission tower located in the densely populated area is relatively high, while the danger of icing and other disasters is relatively low. Therefore, it is necessary to improve the response ability and knowledge reserve of the emergency repair personnel in the area to disasters such as wind disaster and pollution flashover, develop the emergency decision support system, optimize the emergency route, minimize the repair time, and reduce the impact on the surrounding social activities, so as to improve the recoverability of the power grid in the face of accident disasters and reduce its susceptibility. In conclusion, this study establishes a comprehensive power grid safety vulnerability assessment framework incorporating four key dimensions: susceptibility, sensitivity, resistance, and resilience. By integrating the entropy weight method with GIS-based spatial analysis techniques, a multi-dimensional and spatially refined assessment approach is proposed. Taking the 500 kV transmission lines in Henan Province as a case study, the model effectively captures the differentiated vulnerability levels of transmission towers and identifies critical risk factors that impact grid stability. These findings provide a robust basis for implementing differentiated inspection protocols, targeted maintenance strategies, and focused mitigation of weak links in the power grid. Compared with existing vulnerability assessment approaches—many of which rely on structural topology or subjective weighting—this study demonstrates significant improvements in three aspects. First, it introduces a more objective weighting mechanism, where the entropy method reflects the inherent variability among indicators and eliminates the arbitrariness of expert judgment. Second, it constructs a systematically comprehensive indicator framework, integrating natural hazards, geographic conditions, socio-environmental contexts, and structural characteristics, thereby addressing the limitations of incomplete indicator coverage in prior models. Third, it enhances operational applicability, leveraging GIS tools to achieve spatial visualization and classification of vulnerable segments, thus improving the practicality and precision of risk identification. Accordingly, the proposed method outperforms conventional approaches in terms of theoretical rigor, evaluation accuracy, and practical relevance, offering a scalable and adaptable solution to support the enhancement of grid resilience and the modernization of safety management. The expected goal of this paper has been basically achieved, but due to the limitations of objective factors such as personal level and data acquisition, the research still has the following aspects that can be further improved. The data that support the findings of this study are available from [the Resource and Environmental Science an Data Center of the Chinese Academy of Sciences; (China) National Bureau of Statistics (NBS); the Nationa Tibetan Plateau Science Data Center; the global geographic information public product GlobalLand30; Chi- na National Standardisation Administration Committee] but restrictions apply to the availability of these data, which were used under license for the current study, and so are not publicly available. Data are however available from the authors upon reasonable request and with permission of [the Resource and Environmental Science an Data Center of the Chinese Academy of Sciences; (China) National Bureau of Statistics (NBS); the Nationa Tibetan Plateau Science Data Center; the global geographic information public product GlobalLand30; China National Standardisation Administration Committee]. Data are however available from the Huiquan Wang/ whqlustrive@163.com upon reasonable request."
]