[
    "Quantitative assessment of the water use balance between economic society and ecology (EEWB) is the basis for coordinating the competitive relationship of water use between human activity and ecological requirements and. It is of great significance for optimizing the water resources carrying capacity and achieving a healthy regional water balance. Based on the concept of harmonious balance, this paper puts forward the definition and connotation of EEWB regarding the competition in water use between economic society and ecology. And, a novel framework for assessing the EEWB is proposed. It has four aspects relating to water resources, economic society, ecology, and human-water relationship. Linked to these aspects the Data Envelopment Analysis (DEA) technique, Water Ecological Footprint (WEF) model, InVEST model and indicators system of human-water relationship are used to establish a water resources efficiency index (I-ewp.w), economic society high-quality development index (I-ews.cs) ecology health index (I, -we.-), harmony index of human-water relationship (I, -wp.,)- The four indices were then integrated into the water use balance between economic society and ecology index (I--wa) with Euclidean distance, thus forming the EEWB quantification method system. Finally, the temporal and spatial characteristics of EEWB during 2010-2022 was diagnosed in Henan Province and cities of China. Results reveal that: (1) The water resources utilization efficiency exhibit a changing trend of initial decrease followed by subsequent increase; (2) Southern cities in Henan Province have a higher economic society development level compared to northern cities; (3) |-ews.¢ in Henan Province is below 0.60, indicating that the regional ecology health remains consistently vulnerable; (4) |-ewe.,in Henan Province shows an increasing trend, indicating that a gradual improvement and overall upward development in the human-water relationship; (5) |_-w, multi-year average was within [0.53, 0.65] in Henan Province, indicating a state of Proximity imbalance. The low level of ecological health is the primary influencing factor. These findings will contribute to a better understanding of the water use balance between economic society and ecology and provide scientific reference for achieving a healthy regional water balance. Water resources are fundamental, primordial, and controlling resources essential for human survival and development. They play an irreplaceable role in supporting economic society development and ecology conservation!. However, in the process of the dualistic water cycle integrating the natural and social water cycles, the limited water resources create a prominent competition between the demands of economic society 1School of Water Conservancy and Transportation, Zhengzhou University, Zhengzhou 450001, China. Henan International Joint Laboratory of Water Cycle Simulation and Environmental Protect, Zhengzhou University, No.100, Kexue Avenue, Hi-tech DevelopmentZone, Zhengzhou 450001, Henan, China. “email: zangchaosw@zzu.edu.cn development and ecology conservation for water resources”. Specifically, the rapid development of economic society results in exploitative extraction of water resources, which encroaches upon the water resources allocated for ecology. At the same time, water scarcity-induced water pollution and degradation of water ecosystems impose limitations on the development of economic society**. the conflict of water use between economic society development and ecology conservation has become one of the prominent water crisis issues worldwide, posing a severe threat to ecological security, economic security, and food security’. Therefore, harmonizing the conflict of water use between economic society and ecology, enhancing the regional water resources carrying capacity, and achieving a healthy regional water balance are key scientific issues of concern in China. Addressing the aforementioned challenges, it is of great significance to define the concept of water use balance between economic society and ecology (EEWB), quantitatively assess the degree of EEWB, and promote a harmonious coexistence of a healthy EEWB and harmonious symbiosis between human and nature. At present, Researchers have begun to focus on the issues surrounding water use balance between economic society and ecology. Wang et al. (2006) proposed the theory of a “natural-social” dualistic water cycle and elucidated the complex interrelationships between water resources, economic society, and ecology®. Researchers consider the comprehensive benefits of the economic society and ecology by incorporating ecological water demand into optimization models and they explore optimal water resource allocation strategies under various water use scenarios to maximize the benefits of water resource utilization’. Additionally, quantitative models have been developed to calculate the mathematical relationship between ecological conservation water demand and economic society losses, aiming to balance the water demands of economic society and ecology and achieve synergies between the two*-!°. With the diversification of research methods and the backdrop of a changing environment, the study of water balance has gradually expanded from a single-system water quantity balance to the research of multi-system coupling. Researchers integrated water pollution, ecological degradation, and the growing water demand of economic society to develop multi-objective optimization models for coordinating the competition of water use between economic society water and ecology!!\"!”. Although the aforementioned studies consider the influence of economic society and ecology on water balance, they lack a systematic analysis of the water use balance between economic society and ecology.",
    "With the rise of water network engineering construction, the studies of regional water balance have become a key focus of national water management efforts in China. In this context, many researchers have started to interpret the concept and connotation of EEWB from a systemic perspective. Zuo et al.!° highlighted that the water use balance between economic society and ecology is a state where limited water resources are used to promote high-quality economic society development and high-level ecology protection. Zhang et al.'* proposed that a healthy water balance requires coordination between economic society development and ecological environmental protection, maintaining a moderate balance between key flux elements of economic society and natural water circulation. Li et al.!° also proposed that water balance between economic society and ecosystems is crucial for maintaining regional water balance healthily and sustainably. Furthermore, researchers have discovered through research that water resources, economic society, and ecological systems interact with each other and exhibit a high degree of consistency, forming a multi-level feedback loop!®. The balance between these three factors is essential for maintaining regional synergy and sustainable development!’. Based on the aforementioned studies, it is evident that the EEWB is an important component of regional water balance an serves as the foundation for ensuring national water security and promoting regional sustainable development. However, research on the EEWB is still in its early stages, and further in-depth studies are needed to explore its conceptual implications, mechanisms, and quantitative assessments. At present, certain aspects of quantitative assessment research regarding EEWB have made some progress. Firstly, in terms of water resources, researchers have assessed the benefits of economic society water use ani ecology water use by calculating regional water resources utilization efficiency'*-*°. Secondly, in terms of economic society, researchers have assessed the sustainable development capacity of regional economies by using the Water Footprint of Economic Society model”!””. Finally, in terms of ecological environment, researchers have quantified the value of regional ecosystem services using the InVEST model to assess the health of regiona ecosystems”*-*5. Furthermore, some researchers have also paid attention to the synergy and trade-offs among multiple systems such as water resources, economic society, and ecosystems”**, Overall, although the relate studies on water resource utilization efficiency, sustainable development capacity of economic society, health of ecosystems, and coordinated development among multiple systems reflect different aspects of EEWB, they are not comprehensive enough due to the lack of considering their integrated effects. Additionally, the human-water relationship refers to the set of interactions between the human system and water system, and is one of the most fundamental relationships that is eternal and insurmountable”’. Furthermore, the coordination and harmony of the human-water relationship is crucial and an important basis for promoting sustainable socio-economic development and sustainable water utilization*°. Moreover, the competitive relationship of water use between economic society and ecology embodies the human-water relationship in terms of water resources protection and economic society development*!. Therefore, in studying the EEWB, the harmony of the human-water relationship is an essential evaluation criterion that cannot be overlooked. Hence, it is imperative to establish a multidimensional evaluation index for EEWB. Therefore, to select a system of indicators that accurately describes EEWB, at least a few requirements should be met**\"*: (1) indicators addressing water resources, economic society, ecosystems, and the human-water relationship attributes are all taken into account; (2) reduce repetition of indicators evaluation methods to ensure the independence of these indicators from each other; (3) data must be easily accessible and operational; (4) the influence of subjectivity is minimized so that the true state of affairs is more objectively reflected. Firstly, as a natural resource, water resources utilization efficiency is a highly concerned issue. The methods commonly used to measure water resource utilization efficiency include the Data Envelopment Analysis (DEA), hierarchical analysis process (AHP), fuzzy and cluster analyses, among others**. The AHP model and the fuzzy and cluster analysis methods have different degrees of subjectivity, and the correlation constraints are difficult to test*>. DEA, on the other hand, is a non-parametric frontier method to study the input-output efficiency of resources with objectivity and is widely used in the research of water and ecological resource utilization efficiency in various regions***’, Therefore, we chose the Data Envelopment Analysis (DEA) model to calculate the water resources utilization efficiency in the research area**. Secondly, for economic society, the relationship between water resources and their carrying capacity, as well as the degree of coordination between the two, is crucial for achieving high-quality development. Therefore, we adopted the water ecological footprint (WEF) model and proposed a new economic society high-quality development index related to water resources utilization to evaluate its status*®. Thirdly, within the water ecosystem, the InVEST model is used to quantify three water ecosystem services: water yield, water purification, and soil retention. This allows for the quantification of the regional ecosystem’s health status*°. Next, a comprehensive evaluation indicator system of the harmony of human-water relationships are constructed from both the human system and water system perspectives. The “SMI-P” method is employed to quantitatively identify the degree of harmony in the regional human-water relationship“!. Finally, the outputs of the four systems were integrated using Euclidean distances to truly reflect EEWB”.",
    "Based on the above analysis, this study focuses on the complex competitive relationship of water use between economic society and ecology. It clarifies the concept, connotation, and criteria for water use balance between economic society and ecology. A multidimensional and multi-attribute EEWB evaluation method is proposed, which calculates the water resource efficiency index (Ij... w), economic society high-quality development index (Ippwp-ps)> ecology health index (I,,,yp.,), and harmony index of human-water relationship (Ippwp 4) from four dimensions: water resources, economic society, ecology, and the human-water relationship. These indices are then integrated using the Euclidean distance method to calculate the water use balance between economic society and ecology index (I,,,,y,,,), thereby evaluating EEWB in the region. Compared to traditional methods, this approach has the following advantages: (1) it takes into account the four objects of human-water systems and the four attributes of water resources utilization and can reveal EEWB comprehensively; (2) the application of the DEA technique, water ecological footprint (WEF) model, InVEST model, SMI-P method, as well as Euclidean distance eliminates the subjectivity in indicator selection and weight calculation; (3) the data is easily accessible, the calculation method is simple, and it can also be applied to studies at different scales. Lastly, a case study is conducted using Henan Province and its 18 subordinate cities as the research area to demonstrate the scientific applicability of this method. Economic society water use aims to meet the needs of human society’s economic activities and production, such as agricultural irrigation, industrial production, and domestic water supply. It supports economic development and improves people’s living standards through efficient water use. Ecology water use aims to maintain the health and stability of ecosystems, such as dilution and purification, water use by riverine biota, and aquatic plants. It ensures that the water needs of ecosystems are adequately and reasonably met, ensuring ecological quality and mitigating ecological risks. There is a bidirectional feedback loop of competition and coordination between economic society water use and ecology water use. From a competitive perspective, they mutually restrict and conflict with each other. The rapid development of economic society can encroach upon ecology water use, leading to environmental pollution and ecological degradation. On the other hand, a large amount of ecology water use can impact or restrict the development patterns and industrial layout of the economic society. From a collaborative perspective, they support and promote each other. Economic society development can optimize the ways and efficiency of water resources development and utilization, enhancing the ability to restore and rotect ecosystems. Simultaneously, the health and stability of ecosystems contribute to reducing the risk of water-related disasters and is an essential aspect of high-quality economic society development. At present, the relationship between economic society and ecology in the development and utilization of water resources is characterized by sharp competition and contradictions. Coordinating the water demands of economic society development with the protection of the ecology, improving water resources carrying capacity, and promoting regional sustainable development all face significant challenges. In this context, researching water use balance tween economic society and ecology holds important research value and is a crucial aspect of achieving regional water balance. In economics, balance typically refers to a relatively stable state among various elements such as supply and demand relationships, price levels, and resource allocation within a market or economic system. Zuo et al.** highlight that Balance is a stable, harmonious, and sustainable state under specific conditions, where all articipating parties and the overall system benefit. Therefore, the balance between economic society and ecological water use entails the development and utilization of water resources in a way that not only maintains the positive development of the economic society as much as possible but also maximally protects the ecological system, achieving a favorable state acceptable to both the economic society and the ecological system. Based on the above analysis, this study provides the following definition for water use balance between economic society and ecology (Fig. 1): water use balance between economic society and ecology (EEWB) refers to a state that considers water resources, economic society, ecosystems, and the human-water relationship as research subjects, with water cycle as the link. It aims to achieve efficient water resources utilization, ensure high-quality development of the economic society, maintain the health and stability of ecosystems, and promote a harmonious evolution of the human-water relationship. The summary is as follows: ance between the two requires efficient utilization of water resources, with the latter being an important task and fundamental premise of the former. Optimal allocation of water resources seeks to harmonize the needs of different water users within the limits of limited water resources. The balance between economic and ecological water use adheres to principles of effectiveness, fairness, and sustainability. It involves the scientific allocation of limited and diverse forms of water resources on the economic and ecological fronts through both engineering and non-engineering measures.",
    "Based on the theoretical analysis above, we specify that the research object of EEWB should include subsystems in four dimensions (i.e., water resources, economic society, ecology, and human-water relationship). These four subsystems correspond to the four connotations of the EEWB (i.e., efficiency, development, health, and harmony). Therefore, this study proposes efficiency, development, health, and harmony indicators from the subsystems of water resources, economic society, ecology, and human-water relationship, and subsequently introduces water use balance between economic society and ecology index (I,,,y,) to measure EEWB. Consequently, an assessment framework for EEWB has been developed (Fig. 2). The specific steps are as follows: (1) Calculate the sub-system indices. Firstly, within the water resources subsystem, Water consumption, employed population, and Fixed assets investment are selected as input indicators, while GDP serves as the output indicator. The DEA model is then employed to calculate the water resources efficiency index (I;pwp w)- Secondly, within the economic society subsystem, the WEF model is used to calculate the economic society high-quality development index (Ip,.,y,5 p5)- Thirdly, within the ecology subsystem, based on the InVEST model, the quantification of water ecosystem service value is conducted to calculate the ecology health index (I,,,,yp ,)- Next, within the human-water relationship subsystem, an evaluation indicator system for human-water relationship is constructed, and the SMI-P method employed to calculate the harmony of the human-water relation index (Ij,\\p 4,)- (2) Calculate the composite index, based on the four subsystem indices, the Euclidean distance approach is introduced to derive water use balance between economic society and ecology index (I,,,.,y,,). (3) Example Application. The research focuses on conducting an assessment of the EEWB, with Henan Province in China selected as the research object. Data Envelopment Analysis (DEA) is a linear programming model used in operations research and the study of economic production frontiers. It can be employed to evaluate the relative efficiency between multiple input and output indicators**. Among them, the input-oriented Constant Returns to Scale (CCR) model, which assumes a constant scale of production, is commonly used for measuring and evaluating resources utilization efficiency. Therefore, the DEA-CCR model is often employed in research on measuring and evaluating water resources utilization efficiency*’. Therefore, this study utilizes this model to calculate the regional water resources utilization efficiency, and the calculation formula is as follows: where 0 is the relative efficiency value of the DUM, denoted WEI in our work. j is the number of DMUs; x and y are input and output indicators respectively; A is the weighting factor; S— and S+ are slack variables. j, is deemed to be DEA valid if 6=1 and S” =S+ =0; j, is deemed to be weakly DEA valid if @=1 and S” =0 or S+ =0; jy is deemed to be DEA invalid if @<1. In addition, referring to relevant studies*®, this study selected Water consumption, employed population, and Fixed assets investment as input indicators, while GDP was chosen as the output indicator. The input-output indicator system for the water resources efficiency index (I, ) can be found in Table 1. ‘EEWB-W: The water ecological footprint refers to the land area of water resources required to sustain the population’s production and consumption of water in a region, quantifying the water resources demand for regional economic society development*”“*. It includes water usage for production, domestic use, and ecological use. The calculation formula is as follows: where WEF represents water ecological footprint, hm’; y represents the global balance factor for water resources. In this study, a value of 5.19 for the global balance factor is adopted from the calculation conducted by the World Wildlife Fund in 2000. W is the total water consumption in the region, 100 million m; P is the global average water production capacity. Based on multiple research findings, the global average water production capacity is commonly adopted as 3140m3/hm?. The water carrying capacity can be described as the maximum supply of water resources in a specific area during a certain period, considering the sustainable development capacity provided to the resources, environment, and society of that area’?. The calculation formula is as follows: where WEC is water carrying capacity, hm’; P, is the regional water production per unit area, also known as the water production modulus, 10,000 m?/km?; Q is the total water resources in the region, 100 million m*.",
    "The water ecological pressure index is the ratio of water carrying capacity to water ecological footprint, used to measure the capacity of regional water resources to sustain the economic society”. The calculation formula is as follows: where WEST is the water ecological pressure index. When WESI> 1, it indicates that the regional water resources can support economic society development, and the water resources are in a sustainable state. When 0 < WESI<1, it indicates that human activities have exceeded the threshold of water resources carrying capacity, and the water resources are in an unsustainable state. When WESI=1, it indicates that the regional water resources are at a critical state between sustainable and unsustainable conditions. A smaller WESI value implies a poorer water resources carrying capacity, which is less favorable for the high-quality development of the regional economic society. The water economic society coordination index reflects the degree of coordination between regional economic society development and water resources utilization”. The calculation formula is as follows: where WECI is the water economic society coordination index, which has a value range of [1, 1.414]. When WECI is closer to 1.414, it indicates a higher degree of coordination between regional economic society development and water resources utilization. When WECT is closer to 1, it indicates unsustainable regional economic society development. When employing the WEF model to assess regional water resources sustainability and economic society development, commonly used evaluation indicators include the WESI and the WECI°!~°*. This study considers that ensuring the high-quality development of the economic society through water resources utilization should involve both the carrying capacity of water resources and the coordination between water resources and economic society. Therefore, this paper combines the water ecological pressure index and water economic society coordination index to calculate the economic society high-quality development index (Ip,wp_ps)- Since WESI and WECI have different units and value ranges, they are normalized using the Min-Max Normalization method, following relevant studies**. The calculation formula is as follows: where I), 5 is an economic society high-quality development index, which has a value range of [0, 1]. When Tewp-ps 18 Closer to 1, it indicates that water resource utilization is more conducive to high-quality economic society development. a; and a are the weights for WESI and WECI, respectively. In this study, it is considered that ensuring high-quality economic and social development requires equal importance to be given to both the carrying capacity of water resources and the coordination between water resources and the economy and society. Therefore, aj=a= 1/2. Water ecosystem service value refers to the various economic, social, and environmental benefits provided by regional water bodies and their surrounding ecosystems to human society and the natural environment. It reflects the level of support and contribution of the ecosystem to the economic society, and natural environment*. Therefore, the results of the evaluation of water ecosystem service value are often used to characterize the sustainability of regional water resources utilization and the balance of regional ecological health. Drawing upon relevant literature, When conducting regional ecosystem service value assessments, commonly employed ecosystem service value types include water yield, water purification, and soil retention®. this study utilizes the InVEST model to calculate three water ecosystem service functions: water yield, water purification, and soil retention. These functions are further integrated through weighted averaging to obtain an ecology health index, which comprehensively reflects the level of regional ecology health. The InVEST model is widely used in ecosystem service assessment research”. Compared to other methods, this model has clear mechanisms and is highly sensitive to environmental factors such as elevation and slope within the evaluation area. Additionally, the model takes into account meteorological and land cover factors, making it suitable for simulating ecosystem services in large-scale areas with significant variations in topography and landforms**’. Therefore, this study chooses to utilize the InVEST model to separately calculate the three water ecosystem services: water yield, water purification, and soil retention. The model’s operational parameters were determined by referencing relevant literature and the INVEST model user manual®. The calculation formulas are as follows: The water yield module of InVEST was utilized to assess the yield of water. It considers factors such as land use types, maximum rooting depth of the soil, annual precipitation, plant available water capacity (PAWC), annual potential evapotranspiration, and watershed characteristics to calculate the water yield in the study area°!. The formula is as follows: where Y(x) is the annual water yield of grid unit x in the study area, mm; AET(X) is the annual actual evapotranspiration of grid unit x in the study area, mm; P(x) is the annual precipitation of grid unit x in the study area, mm; PET(X) is the potential evapotranspiration of grid unit x in the study area, mm; w(x) is the non-physical parameter of natural climate and soil properties for grid unit x; ET,(x) is the reference crop evapotranspiration of grid unit x in the study area, mm; K, is the crop coefficient for specific land use/cover types of vegetation in grid unit x of the study area; AWC(x) is the available water capacity of the soil in grid unit x of the study area, mm; D, is the soil depth, mm; D, is the root depth, mm; PAWC(X) is the plant available water capacity of grid unit X in the study area, mm.",
    "The present study applied the nutrient retention component of InVEST to assess the capacity for water purification®**, The principle is based on studying the removal capacity of vegetation and soil for nitrogen and phosphorus pollutants in runoff to estimate their water quality purification ability®*“*. The calculation formula is as follows: where ALV(x) is the adjusted load value of grid unit x in the study area, kg; HSS(x) is the hydrological sensitivity of grid unit x in the study area; pol(x) is the output coefficient of grid unit x in the study area. The sediment delivery ratio module of InVEST was utilized to assess soil retention. Based on the potential soil erosion equation, the soil retention quantity (SD) is calculated as the difference between the potential soil erosion (RKLS) and the actual soil erosion (USLE)°~®’. The calculation formula is as follows: where R is the rainfall erosivity factor, MJ-mm/(hm*-h); K is the soil erodibility factor, t-hm?-h/(MJ-hm?-mm); L is the slope length factor; S is the slope steepness factor; P is the engineering measures factor; C is the cover and management factor of vegetation. Building upon this foundation, researchers often integrate calculated results to represent regional ecosystem health and incorporate them into comprehensive assessments of coupled regional systems. After quantitatively assessing water yield, water purification, and soil retention separately, the various water ecosystem services are further integrated. Firstly, the nondimensionalization method is applied to normalize each ecosystem service. Then, the ecology health index (I,,,.., ,,) is calculated using a weighted averaging method to comprehensively quantify the level of ecology health in the study area. The calculation formula is as follows: where I).,4, ; is the ecology health index, which has a value range of [0, 1]. When I,,,y, , is closer to 1, it indicates a higher level of ecological health in the study area. 8; is the weight of the i-th water ecosystem service. Considering the equal importance of water yield, water purification, and soil retention to the health of the water ecosystem, they are all assigned a value of 1/3. WESV, is the evaluation result of the i-th water ecosystem service. In this study, the Min-Max Normalization method is employed to normalize the values and make them dimensionless. The competitive relationship of water use between economic society and ecology embodies the human-water relationship in terms of water resources protection and economic society development”’. Therefore, when studying the EEWB, the harmony of human-water relations is an essential aspect. In this study, representative indicators were selected from the dimensions of the human system and water system to construct an assessment indicator system for the harmony of human-water relationship. The evaluation method of single index quantification, multiple index synthesis, and poly-criteria integration (SMI-P) was used to quantitatively assess the degree of harmony of human-water relations in the region. This study refers to relevant research””-””, and follows the principles of scientific, timeliness, representativeness, comprehensiveness, and data availability. Considering the dimensions of the human system and water system, 18 indicators related to water resources were selected to construct an evaluation indicator system of the harmony of human-water relations. The specific indicators and their attributes are shown in Table 2. Based on the construction of the evaluation indicator system of the harmony of human-water relationship, this study quantitatively assesses the degree of harmony of human-water relationship using the method of “SMI-P”, which mainly consists of three steps: single index quantification, multiple index synthesis, and poly- criteria integration. The calculation formulas are as follows: The single index quantification utilizes the piecewise linear membership function method to normalize each evaluation indicator. The calculation formula is as follows: where ES,, is the single index quantification result of the q-th indicator in the p-th feature layer, p=1,2; q=1,2,3......,93 a,» b yc ” d 7” and e 4 respectively is the worst value, poor value, passing value, good value, and best value of the q-th indicator in the p-th feature layer; Xpq is the value of the indicator. ‘The single index quantification results are combined and comprehensively integrated into the feature layer based on the weights assigned to each indicator. The weights represent their contribution to the respective feature layer, and the harmony index of each feature layer is calculated using a multi-index weighting method. The calculation formula is as follows: where I, is the harmony index of the p-th feature layer; w,, is the weight of the q-th indicator in the p-th feature pst “f 3 og Y i ' layer. Referring to relevant research,*! the entropy weight method is used to calculate the indicator weights.",
    "Based on the results of multiple index synthesis, the harmony indices of each feature layer are further integrated to obtain a comprehensive evaluation of the degree of harmony of human-water relations. This study uses a weighted averaging method to calculate the harmony of the human-water relationship index (Ippwp 4))> reflecting the degree of harmony in the region. The calculation formula is as follows: where I,,,yp ), is the harmony index of the human-water relationship; y, is the weight of the p-th feature layer. Considering the equal importance of the human system and water system to the degree of harmony of human- water relationship, they are both assigned a value of 1/2. By calculating the evaluation indicators of each subsystem in Section \"Subsystem research method\", the states of EEWB are quantified. On this basis, the Euclidean distance method is introduced to further integrate the results of each subsystem, thereby calculating water use balance between economic society and ecology index (I,,yp)’s which comprehensively evaluates the status of regional water use balance between economic society and ecology. In addition, considering the optimal values of the four indices as [1, 1, 1, 1] and a maximum Euclidean distance of 2, the general expression formula for I), is as follows”*: where, I,,,y, has a value range of [0, 1], and it is classified according to the grading criteria mentioned in the relevant literature. The classification is presented in Table 3. To further identify the contribution of Inpws.w Ipewe-ns, Ippws-z, 224 Lepwp.y to EEWB, the individual distance between the actual value of an index and its optimal value is calculated first (i.e., the actual value of the other three indices is the optimal value). Secondly, the comprehensive distance from the actual value of the four indices to the optimal value is calculated. Finally, the ratio of the two is defined as the imbalance contribution rate of that index. The mathematical formula is as follows: where IWC, IESC, IEC, and IHC respectively represent the contributions of Ippwp.w Tpews-ps° Tepwe-r, and T:wp-y tO the imbalance between economic society and ecological water use, with a value range of [0, 1]. The larger the calculated results of these contributions, the greater the impact on the imbalance between economic society and ecological water use. Henan Province is located in the central-eastern part of China, in the southern portion of the North China Plain and the middle and lower reaches of the Yellow River. The province has 18 cities: Zhengzhou (ZZ), Kaifeng (KF), Luoyang (LY), Pingdingshan (PDS), Anyang (AY), Hebi (HB), Xinxiang (XX), Jiaozuo (JZ), Puyang (PY), Xuchang (XC), Luohe (LH), Sanmenxia (SMX), Nanyang (NY), Shangqiu (SQ), Xinyang (XY), Zhoukou (ZK), Zhumadian (ZMD), and Jiyuan (JY). The region is abundant in rivers, with an annual river runoff of 30.399 billion m+. It experiences distinct four seasons, concurrent rainfall and heat, and frequent and diverse climate patterns. Consequently, Henan Province has abundant water resources, but they are unevenly distributed. Precipitation varies significantly both inter-annually and seasonally. The climate exhibits characteristics of both southern “flood disasters” and northern “drought and low rainfall? forming unique climatic features. In addition, Henan Province is rich in natural resources and serves as an important agricultural and industrial production base in China, with a comprehensive industrial system and a wide range of industries. However, the overall economy of Henan Province is not highly developed, with a predominant focus on traditional high-water-consumption heavy industry. Insufficient investment in water management and low efficiency in water resource development and utilization have been observed. Furthermore, as rapid economic society development, urbanization, and the increasing demand for a better quality of life continue, the demand for water resources keeps growing. This intensifies the competition between economic society water use and ecology water use, posing hidden risks to regional water security and water ecology. The regional location, altitude distribution, and water system pattern of Henan Province, and the full names and abbreviations of cities are illustrated in Fig. 3. Indicators data of Tepwp i the study area were obtained from Henan Provincial Statistical Yearbook, 2010- 2022; Statistical Yearbook of various cities in Henan Province, 2010-2022; Water Resources Bulletin of Henan Province, 2010-2022; Water Resources Bulletin of various cities, 2010-2022; and Statistical Yearbook of Urban Construction, 2010-2022. The data required to build the InVEST model include DEM, land use, precipitation, crop reference evapotranspiration, and soil data. The DEM data is from the Resource and Environmental Science Data Platform (https://www.resdc.cn/); The land use data is from the 30 m annual land cover datasets and its dynamics in China from 1985 to 2022 on Zenodo (http://doi.org/https://doi.org/10.5281/zenodo.4417809); The data of precipitation and crop reference evapotranspiration are from National Earth System Science Data Center (http://www.geodata.cn); The soil data is from National Cryosphere Desert Data center (https://www.crensed.a c.cn/portal).",
    "The I pwp-w results for Henan Province and 18 cities from 2010 to 2022 are calculated using the DEA Solver13, as shown in Fig. 4. Regarding the overall calculation results for Henan Province, the Teewe-w exhibits a trend of initially decreasing and then increasing. Specifically, it decreased from 0.77 in 2010 to 0.59 in 2016, subsequently stabilizing around 0.59 between 2016 and 2018. Thereafter, it displayed an upward trend, increasing from 0.62 in 2019 to 0.65 in 2022. This result stems from the rapid population growth and accelerated urbanization process over the past period, which has led to a sharp increase in water demand. However, the mechanisms for water resources utilization and management in the region are not yet sound, and the issue of declining water resources utilization efficiency has not received sufficient attention. Consequently, the water resources utilization efficiency in Henan Province has been continuously decreasing. Since 2019, Henan Province has adhered to the concept of “defining city, land, population, and production by water” as a water management approach, treating water resources as the most significant rigid constraint. The province has implemented rational planning for population and industrial structure and promoted the transition from extensive to efficient and intensive water use practices”. The implementation of these measures has gradually improved the water resources utilization efficiency in Henan Province. However, the growth trend is still relatively slow. Therefore, it is necessary to further enhance productivity, develop water-saving technologies and industries, and strengthen regional water resources conservation and intensive utilization. In terms of the Tpwe-w rankings for each city, they are as follows: ZZ, JY, XC, KE, ZK, ZMD, AY, LH, LY, PDS, JZ, SMX, HB, SQ, XX; PY, NY, XY. In terms of spatial distribution, the water resources utilization efficiency Fig. 3. Geographic characteristics and water system patterns of Henan Province. Note This was created by ArcMap-GIS, version 10.2. https://www.esri.com/. of cities in the central region of Henan Province is higher than that of surrounding cities. This is because the central region has relatively developed urban economies, while the surrounding cities are comparatively less developed, leading to disparities in water resources development and utilization levels. Furthermore, cities such as PDS, NY, and ZMD have relatively abundant water resources, but the I, w calculation results show a continuous decline. The reason behind this is that these cities have relatively outdated water-saving technologies, high population numbers, and large water consumption, resulting in a mismatch between water resource consumption, labor input, and urban economic levels, leading to lower water resource utilization efficiency. While, the majority of the remaining cities exhibited a trend of initially decreasing and then increasing. Specifically, the I... w displayed a decreasing trend from 2010 to 2018, and transitioning to an upward trend from 2019 to 2022. Therefore, the government should implement comprehensive measures from aspects such as industrial structure, water-saving technologies, and human resources management to make concerted efforts to improve the water resources utilization efficiency of cities. e Ls nwp-es results for Henan Province and 18 cities from 2010 to 2022, calculated based on the WEF model, are shown in Fig. 5. Regarding the overall calculation results for Henan Province, the Iw» p¢ exhibits a fluctuating trend of \"decrease-rise-decrease.\" The calculated results range from 0.58 to 0.82. The results indicate that Henan Province has achieved a relatively high level of economic society development, and the development and utilization of water resources have played a significant role in supporting and coordinating regional economic and social development’®. However, there are significant fluctuations between years. The main reason for this result is the uneven distribution of precipitation in Henan Province, which leads to significant fluctuations in the total water resources. As a result, the per capita water resources carrying capacity within the province fluctuates greatly. It is necessary to adjust relevant water resources management measures to optimize the current economic society development situation. In addition, regarding specific years, both 2019 and 2022 show a significant decrease in I,,,.p ys There are two main reasons for this phenomenon. Firstly, there was less precipitation in Henan Province in 2019. Secondly, the impact of the COVID-19 pandemic resulted in high water consumption but lower economic benefits in Henan Province during 2019-2022”. Therefore, in the future, the government should adjust the structure of high water-consuming industries, strengthen water management, enhance public awareness of water conservation, and promote the sustainable utilization of water resources. These measures will contribute to achieving higher quality economic and social development in Henan Province.",
    "For each city, the ranking of I,,yp ps from high to low is as follows: XY, ZMD, SMX, NY, PDS, LH, ZK, LY, JY, SQ, JZ, XC, AY, KE, XX, HB, ZZ, PY. In terms of temporal perspective, the I,wp.ps for the cities exhibited a fluctuating trend of “decrease-rise-decrease’. Specifically, it reached a trough around 2019, followed by a peak in 2021, and subsequently declined again in 2022. In terms of spatial distribution, the southern region of Henan Province has a higher level of economic society development compared to the northern region. This is because cities like XY, ZMD, and NY are located near the Yangtze River Basin, where water resources are relatively abundant. Additionally, SMX has improved its economic society development level by optimizing industrial structure and reducing redundant water resource inputs. On the other hand, cities in the northern region such as AY, HB, and PY are located in the Yellow River Basin, which has relatively poor water resources endowment, resulting in lower levels of economic and social development. It is necessary to adjust water resources management models or increase water transfers to improve the unsustainable water resources situation and coordination in these cities. Furthermore, central cities such as ZZ, KF, and XC have high economic benefits. However, due to high population numbers and industrial water consumption, their rankings in terms of economic society development are lower. The government should make full use of market and policy tools to strengthen water conservation efforts in urban areas, actively transform high water-consuming industries, and promote high- quality economic society development in cities. ‘The results of Leewe-r for Henan Province and its 18 cities from 2010 to 2022, calculated based on the InVEST model, are shown in Fig. 6. For the overall calculation results of Henan Province, I,,,w» , exhibits a \"fluctuating trend,\" with values ranging from 0.33 to 0.57. The lowest point, 0.33, occurred in 2012, while the peak, 0.57, was reached in 2021. These results indicate that the ecological health level of Henan Province is relatively fragile, reflecting significant pressure on water resources and considerable impacts on the ecosystem. The high ecological vulnerability and instability of the ecosystem are also revealed. This result is primarily attributed to the severe ecological damage caused by urban expansion and construction in the early stages of development in Henan Province, leading to water scarcity and water pollution in the ecological environment. Starting in 2013, Henan Province has implemented the strictest water resources management system to control water consumption and water pollution. This has gradually improved the ecological health level of various cities in the region. However, the calculated I... , results are still relatively low, indicating that the ecological health level of the cities in Henan Province remains poor. Local governments need to place greater emphasis on ecology protection and high-quality development in the Yellow River Basin while improving management systems and strengthening regulatory measures. It is necessary to enhance the protection of ecological source areas, increase water quality monitoring efforts in water functional zones, optimize regional land resource allocation, and promote coordinated economic and ecological development in the region. For each city, the ranking of I,,wp,_; from high to low is as follows: XY, ZMD, NY, LH, ZK, PDS, SQ, XC, KE, ZZ, LY, PY, HB, JZ, XX, AY, SMX, JY. In terms of spatial distribution, The ranking of IEEWB-E among cities in Henan Province reveals a distinct spatial pattern, with southern cities such as XY, ZMD, NY, and ZK exhibiting higher levels of ecological health compared to their northern counterparts. This disparity is primarily attributed to the more favorable water resources and lower levels of water pollution in the south, coupled with less intensive human activity due to smaller populations and lower economic development in these areas. In contrast, central cities like ZZ, LH, PDS, and SQ, despite facing greater ecological pressures from higher urbanization and population density, maintain a moderate ecological health level owing to better economic resources and established conservation measures. However, the relatively low evaluation results underscore the need for more balanced regional policies to enhance both ecological and economic outcomes. Meanwhile, northern cities along the Yellow River, including PY, HB, and JZ, struggle with lower ecological health due to their reliance on water-intensive, coal-based industries, which have historically degraded the environment. The geographical disadvantages of these cities further impede economic support for environmental protection, necessitating urgent strategic initiatives focused on industrial transformation, resource conservation, and enhanced environmental oversight to foster sustainable development and improve ecological health.",
    "Based on the harmonious evaluation system of human-water relations and using the SMI-P method, the I.wp yy results for Henan Province and its 18 cities from 2010 to 2022 are calculated and shown in Fig. 7. This upward trajectory reflects the impact of national initiatives such as the “Twelfth Five-Year Plan” and “Thirteenth Five- Year Plan,’ alongside regional economic development and improvements in water resource management. Despite this progress, the peak value of 0.65 suggests only a relatively harmonious state, highlighting the need for further advancements in water resource productivity and management. Enhancing technological innovation, optimizing industrial and water consumption structures, and strengthening ecological supervision are essential steps to foster the high-quality development of water resources and improve the harmony in the human-water relationship. For each city, the degree of harmony in the human-water relationship shows an upward trend. The ranking of Ispywp.y from high to low is as follows: ZZ, LY, JY, JZ, XC, HB, LH, PY, XX, PDS, AY, XY, KE, SMX, ZMD, NY, ZK, SQ. the degree of harmony in the human-water relationship across Henan Province’ cities has shown an upward trend. In terms of spatial distribution, with the highest rankings observed in ZZ, LY, JY, and JZ. Spatially, northwestern cities display a higher degree of harmony compared to their southeastern counterparts. This is largely due to the northwestern region's relatively disadvantaged water resources, which have prompted local governments to prioritize the coordinated development of urban economy, society, and ecology, leading to better harmony in human-water relations. Conversely, despite abundant water resources, southeastern cities struggle with increasing water consumption that is not matched by corresponding economic and urbanization benefits, resulting in poorer harmony levels. Particularly in ZZ and LY, the emphasis on balanced development between human and water systems has led to higher harmony levels, illustrating that enhancing the human- water relationship requires not only water conservation and ecosystem protection but also robust economic and social development to optimize water resource utilization, efficiency, and ecological restoration. Thus, comprehensive measures are essential for local governments to promote the coordinated development of resources, environment, and economic society, ultimately achieving ecological protection and high-quality development in Henan Province. By using the Euclidean distance method, the evaluation results of each subsystem are further integrated to calculate the Laws results for Henan Province and its 18 cities from 2010 to 2022, as shown in Figs. 8 and 9. From Fig. 8, it can be observed that the overall I,,,..,,, calculation results for Henan Province demonstrate a fluctuating trend of initially decreasing and then increasing. The results reached a trough of 0.53 in 2013 and peaked at 0.65 in 2021. This result indicates that during the early stage of rapid economic society development, the rapid economic growth and regional urbanization expansion led to a significant increase in water demand for economic society purposes. However, according to the data from the “Planning for simultaneous management of water resources, water ecology, water environment, and water disasters in Henan Province (2021-2035)” issued by the General Office of the People’s Government of Henan Province and related research results, Henan Province failed to properly recognize the interdependence between economic society water use and ecology water use, resulting in a severe encroachment on ecology water use, serious water pollution problems and damage to the ecological functions of regional rivers””~”. This outcome also restricts the level of high-quality economic society development in Henan Province, ultimately leading to a continuous decline in the water use balance between economic society and ecology in the region. Since 2014, with the comprehensive implementation of the strictest water resources management system, the “Three Red Lines” have effectively regulated regional water use behavior, improved the ratio of economic society water use to ecology water use, and thereby had a positive impact on water use balance between economic society and ecology. Especially in 2019, with the introduction of the strategy of ecological protection and high- quality development in the Yellow River basin, ecological environmental protection has been placed in a more important position. Along with the development of regional economic society, there has been a noticeable improvement in the way water resources are developed and utilized, as well as an enhanced awareness of harmonious human-water relations among residents. Under the influence of various factors, there has been a significant improvement in EEWB in Henan Province.",
    "In addition, the Laws calculation results fall within the range of [0.53, 0.65], indicating a state of near imbalance. There has been no significant improvement during the study period, and influenced by the epidemic and natural water conditions, there was a rebound in the balanced state in 2022. This indicates that although Henan Province has made efforts to improve EEWB, the regional EEWB is still in a relatively poor and fragile state due to the influence of natural and human factors. The government still needs to prioritize ecological protection, optimize industrial structure, reduce inefficient water consumption, and optimize the operation of water conservancy projects to improve EEWB. The I, calculation results for each city can be found in Fig. 9. The changing trend of EEWB in each city is similar to the overall trend in Henan Province. This indicates that after experiencing a decline in the water use balance between economic society and ecology, each city has recognized the importance of coordinating the water demand of the two aspects and improving the balance state to enhance the overall level of regional economic society development and improve the quality of residents’ lives. Regarding the balance state, the cities can be divided into three categories: relative balance, including XY and ZMD; proximity imbalance close to relative balance, including LH, ZK, NY, XC, PDS, ZZ, SQ, KF; proximity imbalance close to relative imbalance, including XX, LY, AY, JZ, AY, JY, PY, SMX. In terms of spatial distribution, XY and ZMD are located in the southern part of Henan Province, where the regional river network is abundant and natural water conditions are favorable. Therefore, it is relatively easier to coordinate the water demand between economic society and ecology. For cities like ZZ, LH, and XC in the central and southern regions with relatively developed economies, the balance results are lower compared to the aforementioned cities. The main reason is that these cities, in pursuit of economic development, failed to recognize the interdependence between economic society development and ecology protection. As a result, ecology water use has been encroached upon, limiting the overall balance state of these cities. As for industrial cities in the northern region such as AY, XX, and JY, the balance results are poorer due to geographical location factors and the water demand from energy industries, resulting in severe water resources constraints. It is crucial to improve the water resources supply-demand relationship through measures like water diversion projects. The government also needs to adjust the regional industrial structure and development pace to adapt to the requirements of high-quality development. Among them, SMX has the worst calculation result, mainly due to improper operation of water conservancy projects and increased water consumption, resulting in a significant encroachment on ecological water use and damage to river ecological functions. To get to the bottom of the main reasons for low I,,y,, the contribution of Iypwp w Leews-2g Leews-z, 294 Leewa.n to imbalance was calculated and the results were shown in Fig. 10. For most cities in Henan Province, the IEC calculation results are above 70%, indicating that the poor level of ecological health is the main factor limiting water use balance between economic society and ecology. Therefore, local governments must prioritize the importance of regional ecological environmental protection, adhere to rigid constraints on water resources, adjust urban industrial structure, limit high-pollution and high-water-consumption industries, and ensure ecological water use. This will gradually achieve synergy between economic society development and ecology protection. In terms of specific cities, XY has the highest IWC calculation result, indicating that water resources utilization efficiency is the main factor affecting the EEWB of the city. The local government needs to further improve productivity, promote water-saving technologies, and control agricultural water consumption. ZMD has the highest IHC calculation result, indicating that the human-water relationship is the main factor influencing the EEWB of the city. The government should adhere to the simultaneous development of the human system and water systems, enhance residents’ water-saving awareness, and strengthen the efficient and intensive use of resources to enhance the harmony between the two. Lastly, both NY and SQ cities have significant contributions to the four indicators. Therefore, it is necessary to alleviate water scarcity and ecological insecurity by formulating effective water resources planning and ecology restoration projects. At the same time, adjustments should be made to the structure and pace of economic society development to enhance the coordinated development among water resources, economic society, ecology, and human-water relationship in the region.",
    "This study addresses the strategic needs of regional water balance and national water network construction by introducing the concept of water use balance between economic society and ecology and developing a comprehensive EEWB assessment framework encompassing four dimensions: water resources, economic society, ecology, and the human-water relationship. Unlike traditional research, this paper emphasizes the intricate interplay between economic society and ecology water use, offering novel perspectives for regional water resource management. The proposed evaluation framework is logically coherent, with easily accessible data and straightforward calculations, thus overcoming the limitations of traditional indicator systems. Moreover, it is applicable to various scales, such as city, province, and basin, demonstrating strong general applicability. The EEWB status of Henan Province has exhibited fluctuations in proximity imbalance levels. Since 2019, the Tspws has shown a rapid growth trend. However, natural water conditions and the COVID-19 pandemic caused a rebound in EEWB status in 2022. Among the four indicators, the I,,p.p is the lowest, indicating that despite efforts to enhance environmental protection in Henan Province, human production activities and significant natural resource consumption have substantially diminished the regional ecological system's functional capacity, resulting in poor ecological health. As demonstrated in Section \"IW, w in water resources subsystem\", water resources endowment significantly influences water resource utilization efficiency, which is a key indicator for assessing the EEWB. Additionally, findings from Sections \"I,,,.w, ,, in ecology subsystem\" and \"Contribution analysis of subsystems\" highlight that the poor level of ecological health is the main factor limiting EEWB in Henan Province, while water resources endowment plays a crucial role in driving regional variations in ecology health. Based on these findings, water resources endowment is a crucial factor influencing IEEWB calculation results. However, abundant and high- quality water resources do not inherently yield positive outcomes. The presence of ample water resources can sometimes lead to neglect of issues such as water resource utilization efficiency, water pollution, and the human-water relationship, resulting in excessive resource consumption. Consequently, water resources can become a constraint on EEWB. Therefore, the government should establish and enhance long-term planning and emergency management systems for water resources to bolster regional water security while strengthening comprehensive water resources management to ensure efficient utilization in water-rich areas and meet demands in water-scarce regions. This study constructed a comprehensive evaluation framework for assessing the water use balance between economic society and ecology and provides a multi-dimensional quantitative analysis of the regional EEWB status. While the proposed approach is more complete and holistic than previous research, there remain areas for improvement: (1) The connotation and criteria for EEWB require further refinement. (2) The assessment of the ecological subsystem relies solely on ecosystem service values without considering ecological water use risks in evaluating ecological health. Future research can explore more scientific indicators of ecosystem health. (3) This study, adopting a systems perspective, proposes a quantitative method for assessing the EEWB and analyzes the evolutionary characteristics of each system within the context of water resources development and utilization. This study proposes a quantitative method for assessing the balance between economic and ecological water use, analyzing the evolution of each system within water resource development. However, it acknowledges a limitation in exploring the intricate interactions between subsystems, such as the relationship between the ecological system and the economic society system. Future research should delve deeper into the interconnected mechanisms between these subsystems to gain a more comprehensive understanding of the interplay driving the EEWB. This will enable more scientific and accurate assessments of regional equilibrium, providing valuable technical support for managing the competitive relationship between economic and ecological water use. (4) Existing statistics show that recycled water accounts for less than 10% of regional water consumption®’. While in the context of rapid economic growth and increasing population, promoting the virtuous cycle and reuse of water resources is crucial for mitigating the conflict of water use between human activity and ecological requirements and fostering sustainable urban development*!. However, current research lacks robust methods for quantifying the economic and ecological benefits of water reuse. Further exploration is necessary in future studies to refine the EEWB quantitative assessment method. Overall, this study offers new perspectives and methods for assessing the water use balance between economy, society, and ecology. Future research should focus on refining the conceptual foundations, optimizing the indicator system, and deepening the analysis of influencing factors, to better serve regional water resource management and environmental governance.",
    "This paper interprets the water use balance between economic society and ecology from four dimensions: water resources, economic society, ecology, and the human-water relationship, and constructs the water use balance between economic society and ecology index (I,,,y,) using DEA, WEE, InVEST, indicator system of the harmony of human-water relationship, and Euclidean distance, which quantitatively assesses the EEWB across 18 cities in Henan Province from 2010 to 2022. The results indicate that: The data that support the findings of this study are available from the National Key Research and Development Program of China (No. 2021 YFC3200201), which were used under license from the National Key Research and Development Program of China for the current study, and so are not publicly available. Data are, however, available from the corresponding authors C. Z. upon reasonable request and with permission from the National Key Research and Development Program of China (No. 2021YFC3200201)."
]