[
    "Since entering the twenty-first century, global warming has continued to escalate, and the frequency of rainfall occurrence during the wheat maturity period has increased significantly, which has seriously threatened the yield of wheat. In this study, based on the rainfall data and a variety of remote correlation factors during the wheat maturation period in Henan Province from 2000 to 2022, we comprehensively explored the spatial and temporal characteristics of wheat maturation rain and its drivers in Henan Province by using the Pettitt method, the Morlet wavelet method, the center of gravity model, and cross-wavelets. The results show that: (1) the wheat maturation rain in Henan Province shows an upward trend, the mutation point is mainly concentrated in 2013, and the cycle change is characterized by a small scale; (2) The multi-year averages of total rainfall, maximum daily rainfall and rainfall intensity in the southern part of Henan Province during the wheat-yellow period were all the highest, and the number of rainfall days also showed a significant upward trend; (3) In 2013 wheat maturation rain in Henan Province, the center of gravity of daily rainfall was mainly concentrated in northwestern Henan Province, and the typical rainfall event mainly experienced five processes of occurrence-intensification-dissipation-re-intensification-dissipation; (4) Total rainfall, maximum daily rainfall and rainfall intensity had the highest correlation with sunspot, and overall sunspot had the greatest impact on wheat maturation rain. By analyzing the spatial and temporal characteristics of wheat maturation rain and further revealing its driving mechanism, it is of great significance to understand the ability of wheat to adapt to climate change and ensure food security. The Sixth Assessment Report of the Intergovernmental Panel on Climate Change (IPCC) states that there is a clear global warming trend!. In the context of this warming, there has been a marked increase in the frequency of rainfall, which has not only altered regional climatic characteristics but also posed a serious threat to local natural ecosystems and food security’. Warmer temperatures increase the maximum amount of water vapor that can be carried in the atmosphere, the water cycle is accelerated, and the spatial and temporal distribution characteristics of rainfall change*. In recent years, the study of rainfall changes in the context of global warming has become a hot research topic at home and abroad**. Against the background of global climate change, scholars at home and abroad have conducted a lot of research on the spatial and temporal changes of rainfall in different countries and regions”!°. Chen et al. analyzed the characteristics of seasonal precipitation changes in Central Asia from 1901 to 2013 based on the GPCC V7 precipitation dataset, and found that precipitation in Central Asia showed an increasing trend in spring and winter, and a decreasing trend in summer and winter!!. Applying data from 183 weather stations from 1973 to 2005, Jung et al. found that precipitation in Korea increased significantly in summer, decreased in spring and winter, and did not change significantly in fall!”. Luis et al. used MOPREDAS precipitation data to analyze the characteristics of seasonal precipitation changes in the Iberian Peninsula from 1946 to 2005, and 1School of Water Conservancy, North China University of Water Resources and Electric Power, Zhengzhou 450046, China. 2Yinshanbeilu Grassland Eco-Hydrology National Observation and Research Station, China Institute of Water Resources and Hydropower Research, Beijing 100038, China. *Institute of Water Resources of Pastoral Area Ministry of Water Resources, Hohhot 010020, China. “email: ghengzhi@163.com found that precipitation in the Iberian Peninsula decreases in spring, summer, and winter, with an increasing trend in fall precipitation!’. There are also many scholars who have carried out a lot of research on the changes of precipitation in different seasons in China. Wang et al. used the empirical orthogonal function metho: to analyze the precipitation data from 1840 meteorological stations from 1960 to 2010, and found that there is a developmental change of negative trend of annual precipitation on the eastern side of North China an Northwestern China, while the western side of Northwestern China region shows a remarkable positive Tren evelopment changes'*. Zhang et al. collected daily precipitation data from 590 stations in China and analyze the time series composed of them, and the results showed that the precipitation extremes varied significantly in different regions of China!>. Sun et al. collected and collated long-series rainfall station data and analyze the precipitation events in China through the Earth System Model (ESM), summarized the changing pattern of precipitation and simulated the spatial pattern distribution of precipitation through the results of the analysis!°. Zhao et al. obtained that rainfall in Henan Province has slightly decreased in fluctuation over the past 54 years, with an increase in rainfall in the central and eastern part of the province and a significant decrease in rainfall in the northwestern and southern part of Henan Province!”. Although previous studies have examined the spatial and temporal distribution of rainfall in Henan Province from different perspectives, there has been no study of rainfall during the maturation period of wheat!*!°. Wheat is one of the most important food crops in the world. However, its production is highly dependent on water supply and is a water-intensive crop. The temporal an spatial distribution of precipitation during the wheat maturity period directly determines the stability of yield. With climate change intensifying precipitation variability, traditional irrigation systems and variety layouts are facing severe challenges, and there is an urgent need to optimize water management strategies based on precise precipitation characteristic analysis”. Therefore, analyzing the non-stationarity of precipitation changes during the wheat maturity period and its agricultural impact is of great significance for ensuring the sustainability of wheat production.",
    "Remote correlation factors, as strong signals affecting climate change, are one of the important factors influencing rainfall, and many studies have been focusing on the relationship between rainfall and remote correlation factors”!-*4, For example, Qiao et al. showed that the rainy season can be divided into three stages, and the most relevant remote sensing factors are not the same for each stage’. Cui et al. showed that the anomalous location and intensity of the Western Pacific Subtropical High Pressure (WPSH) led to rainfall anomalies during the rainy season in the prune season”®. Li et al. explored the potential relationships between annual and seasonal maximum daily precipitation and local temperature, global surface temperature and ENSO in the Yangtze River Basin, showing that local temperature and ENSO had no significant effect on annual maximum daily precipitation, while there was a significant negative correlation between winter maximum daily precipitation and ENSO”’. Zhang et al. show that water vapor transport from the Indian monsoon region and the western Pacific region contributes the most to extreme precipitation in 2020\". However, there are few studies on the rainfall impact mechanisms in Henan Province. Therefore, six remote correlation factors, namely, Pacific interdecadal variability (PDO), Arctic Oscillation (AO), North Atlantic Oscillation (NAO), Western Pacific-type telecorrelation (WP), El Nifto-Southern Oscillation (ENSO), and sunspot, are selected in this paper to study the rainfall driving force of the region. Wheat maturation rain, i.e. widespread continuous rainy weather encountered during the maturing period of wheat, leading to sprouting and germination of seeds on the ears, thus seriously affecting the normal harvest of wheat”®°. This paper defines the “wheat maturity period” as the time window from the middle stage of grain filling to the physiological maturity period, which usually lasts for 2-3 weeks and is a key stage determining grain weight and quality. After consulting materials and conducting on-site investigations, it is known that the multi- year average maturity period of wheat in Henan Province is from May 20th to June 10th.As a large agricultural province, Henan Province accounts for more than one-fifth of the country’s total wheat production, ranking first in the country, and is closely related to food security in China*!. Currently, there are relatively few studies on rainfall during the wheat maturity period, but with the intensification of climate change, wheat maturation rain is causing more and more serious damage to wheat. Therefore, it is necessary to study wheat maturation rain in Henan Province. To this end, based on the wheat maturation rain dataset and various remote correlation factors in Henan Province from 2000 to 2022, this study selected four rainfall indices, namely, total rainfall, rainfall days, maximum daily rainfall and rainfall intensity, and adopted the Pettitt method, the improved Mann-Kendall method, and the Morlet wavelet method, focusing on the spatial and temporal variation rules of the wheat maturation rain, and utilized the center of gravity model to The center of gravity model is used to reflect the evolution of rainfall events and reveal the spatial differences and changes in rainfall, and then the Pearson correlation analysis and cross-wavelet method are used to reveal the remote correlation between the remote correlation factors and wheat maturation rain, so as to comprehensively investigate the spatial and temporal characteristics of the wheat maturation rain in Henan Province, and its relationship with the remote correlation factors. The study and analysis of wheat maturation rain in Henan Province can provide a theoretical basis for the study of climate change and the prevention and control of wheat maturation rain disasters in the region, so as to guarantee wheat yield and food security, and firmly hold the initiative of food security. Henan Province is located in the central part of China, in the southern part of the North China Plain and the middle and lower reaches of the Yellow River, with an east-west direction of 580 km and a north-south direction of 550 km. The total area of the province is 167,000 square kilometers and the population is 107.22 million. The topography of Henan Province is high in the west and low in the east, with the Taihang Mountain Range, the Fuyushan Mountain Range, the Tongbai Mountain Range and the Dabie Mountain Range to the north, west and south, and the Huanghuaihai Alluvial Plain in the center and east, with a total area of more than 80,000 square kilometers, which accounts for nearly 50% of the province’s total area, and the Nanyang Basin in the southwest, which has a complicated topography. The arable land in Henan Province covers more than 110 million mu, which is mainly planted with grain crops, with wheat production ranking high in the country. An overview map of the study area is shown in Fig. 1.",
    "The rainfall information used in this paper comes from the 1961-2022 China daily rainfall dataset from the National Tibetan Plateau Science Data Center, with a spatial resolution of 0.25° and data units of millimeters. This dataset was evaluated for accuracy based on the interpolated daily rainfall data from about 40,000 high- density stations across China from 2015 to 2019, and the results show that the spatial variability of rainfall can be better characterized*?. Data on the five atmospheric circulation factors used in this paper were obtained from the Earth System Research Laboratory, Physical Sciences Division, National Oceanic and Atmospheric Administration (https://w ww.esrl.noaa.gov/psd/data/climateindices/list/), and sunspot data were obtained from the Royal Observatory of Belgium (https://www.sidc.be/SILSO/datafiles). The data sources are detailed in Table 1. In this paper, the research area was firstly cropped to Henan Province using R language, and the day-by-day rainfall during the wheat maturity period in Henan Province from 2000 to 2022 was extracted, and then the wheat maturation rain dataset of Henan Province was obtained. After that, the wheat maturation rain dataset of Henan Province was processed using Mathworks Matlab R2022b to obtain four rainfall index data: total rainfall, rainfall days, maximum daily rainfall, and rainfall intensity. The rainfall indices and definitions are shown in Table 2. Pettitt’s method is a nonparametric test for identifying hydrologic sequence mutation points, which assumes that there is a mutation point m in the sample volume, the moment of mutation tp, and uses Mann-Whitney’s statistic Uz,,n to test whether there is a significant difference in cumulative distributions between the two subsamples {x1, 22, see Bt, } and {ip +1, Bt +2, see tn} before and after the mutation point in the sample sequence*’. The statistic Uz,,,n is calculated using the following formula: where @t,, 2; are the random variables for hypothesis testing; n is the length of the data series; K is the maximum statistic of Ut,» occurring at tp moments; if the probability P<0.05, then point m is a significant mutation point. Compared with the Mann-Kendall test, the MMK trend test can eliminate the autocorrelation component in the time series, which makes the trend test results more reliable and widely used in hydrometeorological research, the detailed calculation steps are given in*°, Morlet wavelets can be used to analyze the periodic characteristics of hydrological time series, and are widely used in analyzing the periodic variation characteristics of hydrological time series*°. The wavelet transform function is: where Wy (a, b) is the wavelet function; a is the scale factor; b is the translation factor; f (t) is the time function; @ * is the complex conjugate function. In this paper, we use the center of gravity model to analyze the center of gravity pattern of wheat maturation rain in a typical year, and analyze the degree of change and the characteristics of the change*”. The formula is as follows: where X and Y are the coordinates of the corresponding centers of gravity in the region, respectively; and Gi is the value of wheat maturation rain in the region. Pearson correlation analysis describes how closely two variables are related by analyzing the magnitude of the linear relationship between them. When the value of the correlation coefficient is greater than 0, the two variables are positively correlated and when the correlation coefficient is less than 0, they are negatively correlated. An absolute value of the correlation coefficient close to 1 indicates a strong correlation between the two variables, while a correlation coefficient close to zero indicates a weak correlation, and a correlation coefficient of 0 indicates that there is no linear relationship*®. Crossed wavelet transform is proposed on the basis of wavelet transform, which can be used to reveal the degree of correlation between two signals in the time-frequency distribution, and the larger the amplitude value, the more significant the degree of correlation between the two signals*®. Assuming that the continuous wavelet transforms of two time series X = (x,, X,, ....X,) and Y = (y,, y,,... y,) are W;; (s) and W,t (s), the cross wavelet transform between them is: The temporal trends of total rainfall, rainfall days, maximum daily rainfall and rainfall intensity of wheat maturation rain in Henan Province are shown in Fig. 2. From the figure, it can be seen that the linear propensity ratio of all four rainfall indicators is greater than 0, which are 5.63/10a, 0.27/10a, 2.47/10a and 0.25/10a, respectively, and all of them show an upward trend. Specifically, the temporal trends of total rainfall, maximum daily rainfall and rainfall intensity are more consistent, with a roughly fluctuating upward-declining-upward- fluctuating-downward trend, and they all reached their maximum values in 2013, with a minimum occurring in 2012; whereas, the trend of the number of rainfall days is different from that of the other three rainfall indicators, with a maximum value in 2016 and a minimum in 2007.",
    "In addition, in this study, total rainfall, number of rainfall days, maximum daily rainfall and rainfall intensity were tested for mutation using Pettitt’s method and the results are shown in Fig. 3. The results show that the total rainfall, maximum daily rainfall and rainfall intensity were mutated in 2013 and the number of rainfall days was mutated in 2004. Combined with the time trend analysis of each rainfall indicator, total rainfall, maximum daily rainfall and rainfall intensity were at their minimum values in 2012, and then directly increased to their maximum values in 2013, proving the authenticity of the mutation points. In this paper, the Morlet wavelet method is used to calculate the real part contour plots and variance plots of wavelets for different rainfall indices, which are shown in Figs. 4 and 5, respectively. The extreme points in Fig. 5 represent the main cycle and the highest point is the first main cycle. From Fig. 4a,c,d, it can be seen that the contour plots of total rainfall, maximum daily rainfall and rainfall intensity are relatively similar in character, with the lower half of the contours being relatively dense and high- frequency, which corresponds to oscillations in the 5-10-year cycle, and the upper half of the contours being relatively sparse and low-frequency, which corresponds to oscillations in the large-scale cycle. From Fig. 4b, it can be seen that the rainfall days are characterized by the oscillation of the 5-15 year cycle. It can be seen that the wheat maturation rain changes in general are characterized by small-scale features. From Fig. 4a,c,d, it can be seen from Fig. 5a that there exist master cycles of 6 and 15 years for total rainfall, where the first master cycle is 6 years; from Fig. 5b that there exist master cycles of 4, 10 and 26 years for maximum daily rainfall days, where the first master cycle is 10 years; and from Fig. 5c that there exist master cycles of 5 and 15 years for maximum rainfall on a single day, where the the first main cycle is 5 years; from Fig. 5d, rainfall intensity exists in main cycles of 6 and 15 years, where the first main cycle is 15 years. The spatial distribution of the multi-year means of total rainfall, rainfall days, maximum daily rainfall and rainfall intensity is shown in Fig. 6. From Fig. 6a, it can be seen that the total rainfall mean value is the largest in the southern part of Henan Province, and the mean value is the smallest in the northern part of Henan Province, which shows the characteristic of decreasing from south to north. From Fig. 6b, it can be seen that there are more rainfall days in the western and southern regions of Henan Province, and fewer rainfall days in the central and eastern regions. From Fig. 6c, it can be seen that the region with the largest average value of maximum daily rainfall is the southern region of Henan Province, which indicates that the probability of extreme rainfall is higher in this region. From Fig. 6d, it can be seen that the rainfall intensity is the highest in the southern part of Henan Province and the smallest in the northern part, showing a strong south and weak north trend. In addition, from Fig. 6d, it can be seen that the value of rainfall intensity in the southern part of Henan Province is greater than 7 mm/d, which leads to the wheat in this region being prone to sprouting and blackening, thus defining the area with rainfall intensity greater than 7 mm/day as a high value area, which needs to be heavily guarded against, and emergency harvesting needs to be carried out if necessary to safeguard food security. The wheat harvest window is very short, however, as can be seen from Fig. 6, the long rainfall duration, total rainfall intensity, and high rainfall intensity of the wheat maturation rain in the southern part of Henan Province, and the high degree of overlap between the rainfall process and the wheat maturity period, which can easily lead to waterlogging in the wheat field, which is not conducive to the harvesting operation, and thus to the emergence of the phenomena of wheat collapse, mildew, blackness, sprouting of grains, and sprouting of spikes, which leads to a reduction in wheat yield.",
    "Figure 7 shows the spatial trend distribution of total rainfall, rainfall days, maximum daily rainfall and rainfall intensity. Through the calculation, the average MMK values of each rainfall index were obtained as 0.56, 029, 0.41 and 0.52, respectively, which means that all rainfall indices showed an upward trend as a whole. Specifically, the total rainfall, maximum daily rainfall and rainfall intensity trends are relatively consistent, with the areas showing a significant upward trend mainly concentrated in the central and eastern parts of Henan Province, while the areas showing a significant upward trend in the number of rainfall days are mainly concentrated in the southern part of Henan Province, which also coincides with the obvious “northward rise and northward expansion” feature of China’s rainfall belt. This also coincides with the rainfall belt in China showing a clear “north upward and northward expansion” characteristics, indicating a significant increase in the likelihood of a wide range of persistent rainy weather during the wheat ripening period, seriously affecting the normal harvest of wheat. Based on the temporal trend and mutation test of wheat maturation rain from 2000 to 2022, it can be seen that the total amount of wheat maturation rain in 2013 was large, the number of days was high, and the intensity was high, so 2013 was selected as a typical year of wheat maturation rain to be studied and analyzed. The total rainfall, number of rainfall days, maximum daily rainfall and rainfall intensity of wheat maturation rain in Henan Province in 2013 are shown in Fig. 8. From Fig. 8a, it can be seen that the total rainfall in the southern part of Henan Province was the largest, the total rainfall in the northeast of Henan Province was the smallest, and the total rainfall in the western part of Henan Province was larger and more centrally distributed. From Fig. 8b, it can be seen that the number of rainfall days was higher in all parts of Henan Province in 2013, with the most serious in northwest Henan. From Fig. 8c, it can be seen that the maximum daily rainfall in the western and northern regions of Henan Province was smaller, and the maximum daily rainfall in the central, eastern and southern regions was larger. From Fig. 8d, it can be seen that the southern part of Henan Province has the highest rainfall intensity, which is the area of high intensity, and the areas with lower rainfall intensity are concentrated in northeast Henan. The day-by-day precipitation evolution of the 2013 wheat maturation rain in Henan Province is shown in Fig. 9. As can be seen from the figure, the 2013 wheat maturation rain can be divided into two rainfall events, the first one is from May 20 to June 4, which is a more complete rainfall process and selected as a typical rainfall event; the second one is from June 5 to June 10, which is not fully represented due to the study period. The daily rainfall centers of gravity and migration paths for the two rainfall events are shown in Figs. 10a,b, respectively. As can be seen from Fig. 9, the first rainfall event lasted for a longer period of time and involved a wide range of areas with large amounts of rainfall. This rainfall event initially occurred in a small area in the northern part of Henan Province, and then developed rapidly on May 22, covering half of Henan Province; from May 23 to May 29, the whole of Henan Province was cloudy and rainy, with the highest amount of rainfall on May 26, which was most hazardous; on May 30, the rainfall in the northern part of Henan Province stopped a little bit, but the rainfall covered the whole of Henan Province on May 31, and then slowly dissipated until the end. It began to dissipate slowly until the end, mainly experiencing five processes: occurrence-intensification-dissipation-re- intensification-extinction. The second rainfall event started on June 5, and then developed rapidly on June 6, covering the whole Henan province on June 7; there were signs of dissipation on June 8, but it was immediately followed by a re-intensification process, resulting in still cloudy and rainy weather over the whole Henan province on June 10th. However, due to the study period, the second rainfall event lacked the rainfall extinction process, but the first four steps of the rainfall process were consistent with the first rainfall event, which shows By calculating the day-by-day rainfall center of gravity for the 2013 wheat maturation rain, the dynamic evolution pattern of the rainfall event can be effectively described. As shown in Fig. 10a, the daily rainfall center of gravity of the first rainfall event was mainly distributed in the western and northern regions of Henan Province, with an overall counterclockwise migration and rotation characteristic. the center of gravity of rainfall on May 23 was located in the western part of Henan Province, and then migrated eastward, indicating that rainfall in the eastern part of the region was higher than in the western part of the region in this stage; the center of gravity migrated westward from May 27 to 30, which, combined with Fig. 9, indicates that the western part of the region in Henan Province had the highest rainfall in this stage The center of gravity of rainfall migrated from east to northwestern direction from May 31 to June 3, indicating that the rainfall in northern Henan was elevated during this period.",
    "As can be seen from Fig. 10b, the center of gravity of the daily rainfall of the second rainfall event was more scattered, characterized by counterclockwise migration and rotation. the center of gravity of the rainfall on June 6 was located in the central region of Henan Province, and then first migrated to the south-west and then to the east, and then to the north-west on June 8-10, which is consistent with the day-by-day rainfall charts, indicating that rainfall in the north-western region of Henan Province was heavy on June 9th and June 10th. Remote correlation factor, as a strong signal affecting climate change, is one of the important factors influencing rainfall. Exploring the remote correlation between the remote correlation factors and wheat maturation rain helps to explore the response of wheat maturation rain to the changes of the remote correlation factors, and is also of great significance for the prediction of wheat maturation rain. In this study, the correlation between wheat maturation rain and remotely related factors was analyzed using the Pearson correlation coefficient method, and the results are shown in Fig. 11. As can be seen in Fig. 11, PDO and NAO showed positive correlations with all four rainfall indices; AO showed negative correlations with all four rainfall indices; WP showed positive correlations with total rainfall, rainfall days and rainfall intensity, and negative correlations with maximum daily rainfall; and ENSO showed positive correlations with total rainfall and rainfall days, and negative correlations with maximum daily rainfall and rainfall intensity; sunspot was positively correlated with the number of rainfall days and negatively correlated with total rainfall, maximum daily rainfall and rainfall intensity. For individual rainfall indices, total rainfall, maximum daily rainfall and rainfall intensity had the highest correlation with sunspot, with correlation coefficients of — 0.332, — 0.193 and — 0.398, respectively; and the number of rainfall days had the highest correlation with ENSO, at 0.107. In this paper, the cross-wavelet transforms of PDO, AO, NAO, WP, ENSO, and sunspot with rainfall indices are used to reveal the effects of the remote correlation factors on wheat maturation rain. Because the Pearson correlation coefficients between AO, NAO, WP, and ENSO and each rainfall index are not significant enough, only the cross-wavelet energy spectra of wheat maturation rain with PDO and sunspot are presented in Fig. 12. ‘The cross-wavelet energy spectrum reflects the correlation between the two in the high-energy region. Figure 12a shows that there is a significant resonance cycle of strong correlation between total rainfall and PDO, a 3-5 year cycle from 2009 to 2019, with a negative correlation between the two. Figure 12b shows that there is no significant resonance cycle between rainfall days and PDO. The maximum daily rainfall and PDO are mainly negatively correlated with a 3-6 year cycle of significance resonance for the period 2009-2017. From Fig. 12d, it can be seen that there exists a significant resonance cycle between rainfall intensity and PDO for the 3-5 year cycle of 2009-2017 with negative correlation. From Fig. 12e it can be seen that there is a significant resonance cycle between total rainfall and sunspot for a 2-6 year cycle of 2005-2017 having a significant positive correlation. The cross-wavelet cohesion spectrum of rainfall days with sunspot is shown in Fig. 12f, and there exists a significance cycle for the 1-6 year cycle of 2003-2015 with a previous positive correlation between the two. A significance resonance cycle exists between maximum daily rainfall and sunspot as shown in Fig. 12g for Fig. 6. Multi-year average spatial distribution of wheat maturation rain in Henan Province, 2000-2022. It was drawn by ArcGIS 10.6.1 (https://desktop.arcgis.com/zh-cn/desktop/index.html). (a) Total rainfall (b) Rainfall days (c) Maximum daily rainfall (d) Rainfall intensity. a 2-6 year cycle from 2006 to 2016 with a significant positive correlation. From Fig. 12h) it can be seen that there is a significant resonance cycle between rainfall intensity and sunspot for the 2-5 year cycle of 2007-2017 with significant positive correlation. According to Figs. 11 and 12, it can be seen that sunspot has the strongest correlation with wheat maturation rain and has the greatest influence on it, followed by PDO and ENSO, and previous studies have also shown that remotely correlated factors have an influence on rainfall‘. Qi et al. found that rainfall in Zhengzhou is significantly correlated with sunspot number, and rainfall can be predicted from sunspot observations, which is consistent with the results of this paper*’. By studying the effects of solar activity on precipitation in central North China, Zhai found that cyclical variations in solar activity may affect atmospheric circulation and ocean-atmosphere coupling, thereby influencing precipitation patterns in the region**. By analyzing the remote correlates of fall precipitation anomalies in Southeast Asia, Le et al. found that ENSO affects its rainfall amount and rainfall days*®. Several other papers have explored the scientific relationship between remote correlation factors and rainfall in Henan Province, showing that changes in remote correlation factors can significantly affect rainfall patterns in Henan Province, especially during extreme rainfall events'®“°. Therefore, it is suggested that sunspots and ENSO should be used as predictors so as to improve the prediction ability of wheat maturation rain in Henan Province.",
    "Previous studies have analyzed the spatial and temporal distribution of rainfall in Henan Province from seasonal and interannual perspectives, but no relevant studies have been conducted on wheat maturation rain, which cannot accurately and comprehensively analyze the spatial and temporal evolution of wheat maturation rain. In this paper, the Pettitt method was used to identify the mutation points of wheat maturation rain in Henan Province, and the Morlet wavelet method was used to identify the periodicity of wheat maturation rain, so as to analyze the temporal change characteristics of wheat maturation rain in Henan Province, which can help to improve the accuracy of predicting the future wheat maturation rain events***”. Furthermore, by analyzing the multi-year average spatial distribution and trend distribution of the wheat maturation rain, it is helpful to reveal the changing characteristics of the spatial pattern of the wheat maturation rain in Henan Province, formulate climate change adaptation strategies, and thereby reasonably adjust the wheat harvest time“*. It is worth noting that the potential impact of precipitation changes on yield cannot be ignored. Adjusting the variety layout and Fig. 7. Spatial trend distribution of wheat maturation rain in Henan Province, 2000-2022. It was drawn by ArcGIS 10.6.1 (https://desktop.arcgis.com/zh-cn/desktop/index.html). (a) Total rainfall (b) Rainfall days (c) Maximum daily rainfall (d) Rainfall intensity. optimizing irrigation scheduling based on the precipitation characteristics during the wheat maturity period can effectively avoid agricultural disaster risks and provide a scientific basis for disaster prevention and mitigation”. Guo et al. concluded that the center of gravity model can calculate the location of the geometric center of gravity of rainfall in a region, which intuitively and graphically reflects the spatial variation of rainfall, and this paper uses this method to analyze the spatial and temporal evolution of the wheat maturation rain event, revealing the pattern of rainfall change”. However, there are still some improvements to be made in this paper. Firstly, the spatio-temporal distribution of the wheat maturation rain is analyzed based on precipitation data from the past 20 years, and the results may be uncertain. For instance, it is difficult to accurately distinguish between long-term trends and cyclical changes, or the frequency and intensity of extreme precipitation events are underestimated. Secondly, the spatial resolution of the daily precipitation raster data is 0.25°x0.25°, which can roughly identify the rainfall conditions at each location in the study area and may deviate from the actual situation. Furthermore, in this study, a fixed time window based on the historical average phenological period was adopted when analyzing the precipitation at maturity. However, with climate warming, the maturity of wheat shows an earlier trend, and the fixed window may lead to misjudgment of the actual precipitation period at the maturity of wheat*!. Finally, although this paper explores the driving role between remotely related factors and wheat maturation rain, related studies have shown that greenhouse gas emissions, land use changes, and other human activities also cause climate change, which leads to the occurrence and changes of wheat maturation rain>**>. In addition, this paper focuses on historical precipitation analysis and has not included future precipitation predictions under climate change scenarios such as CMIP6. To some extent, this limits the guiding value of the research conclusions for long-term agricultural adaptation strategies°*°°. Nevertheless, the results of this paper still provide a theoretical basis for climate change research and wheat maturation rain disaster prevention and control in the study area, which can help to ensure food security. This paper analyzes the spatial and temporal characteristics of wheat maturation rain in Henan through four rainfall indices and reveals the driving factors of wheat maturation rain based on the rainfall data and remotely correlated factor data during the wheat maturation period in Henan Province from 2000 to 2022. The main conclusions of this paper are as follows: Fig. 8. Spatial distribution of wheat maturation rain in Henan Province in 2013. It was drawn by ArcGIS 10.6.1 (https://desktop.arcgis.com/zh-cn/desktop/index.html). (a) Total rainfall (b) Rainfall days (c) Maximum daily rainfall (d) Rainfall intensity. Fig. 9. Day-by-day rainfall evolution of wheat maturation rain in Henan Province in 2013. It was drawn by ArcGIS 10.6.1 (https://desktop.arcgis.com/zh-cn/desktop/index.html). Fig. 10. Migration path of rainfall center of gravity on wheat maturation rain days in Henan Province in 2013. It was drawn by ArcGIS 10.6.1 (https://desktop.arcgis.com/zh-cn/desktop/index.html). (a) Daily rainfall center of gravity migration for the first rainfall event. (b) Daily rainfall center of gravity migration for the second rainfall event.",
    "Conceptualization, Z.Z. and H.G.; data interpretation and methodology, Q.Q. and K.E; validation, W.Z. and EW; software, X.L. and J.L.; original draft preparation, Z.Z. and H.G.; funding acquisition, K.F. All authors have read and agreed to the published version of the manuscript. Open Access This article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article’s Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article’s Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit http://creativecommo ns.org/licenses/by-nc-nd/4.0/."
]