[
    "Assessing the eco-health of regional reservoirs is essential for sustainable water resource utilization and water security, particularly in water-scarce areas. This study constructed a Benthic Index of Biotic Integrity (B-IBI) based on the community characteristics of macrobenthos in ten large and medium- sized reservoirs across four major river basins in Henan Province, China. A total of 90 taxa were identified, representing 3 phyla, 6 classes, 17 orders, 45 families and 81 genera. The B-IBI was derived from five key metrics: the number of crustacean and mollusca taxa, Intolerant %, the BI index, the BMWP index, and the Shannon-Wiener index. The B-IBI scores across 44 sites in the ten reservoirs ranged from 0.35 to 3.99. The assessment classified two reservoirs (QTH and HKC in the Yellow River basin) as poor, whereas one reservoir (OP in the Huai River sbasin) was classified as excellent. The B-IBI index effectively distinguished impaired sites from reference sites, supporting its suitability for eco- health assessments of reservoirs in Henan Province. Reservoirs play a vital role in sustaining regional social, economic, and environmental functions, including flood control, agricultural irrigation, water supply, sediment reduction, hydroelectric power generation, tourism, climate regulation, navigation, transportation, biodiversity, and environmental flows'. Human reliance on reservoir storage for water demands is increasing”. Reservoirs account for approximately 10% of the global natural freshwater storage capacity in lakes, and their contribution to global water security and sustainable development is becoming increasingly crucial, particularly in regions experiencing water scarcity and variability*. However, the intensification of anthropogenic activities and climate change has resulted in varying degrees of decline in ecological health of reservoirs*-*. Therefore, the development and implementation of effective tools to assess reservoir ecosystem health is increasingly essential. Such tools can aid reservoir managers in making informed policy and regulatory decisions for the scientific use of water resources and the maintenance of water security. The health of reservoir ecosystems is characterized by a complex and dynamic equilibrium of diverse biotic and abiotic components that work together to maintain the integrity and resilience of the system?!”. Although abiotic indicators derived from multiple physicochemical parameters, i.e., the trophic state index and water quality index (WQI), have been extensively utilized, they do not always accurately reflect the ecological health of reservoirs!*!4, One limitation is the difficulty of measuring individual pollutant concentrations, whereas another is that some pollutants can influence biome distribution and ecosystem functionality even at very low levels!°. Biological indicators, on the other hand, have the potential to offer comprehensive insights into the overall conditions of aquatic ecosystems through rapid and cost-effective biomonitoring'®. Consequently, there is a growing global demand for biological indicators to monitor and assess the health of aquatic ecosystems. A multimetric index (MMI), which combines multiple biological metrics into a single assessment, is now used worldwide to evaluate the ecological health of various water bodies!®!*!”, This index reflects a range of ecological information, including composition, richness, diversity, abundance, and functionality’. The first biological MMI, known as the index of biotic integrity (IBI), was proposed by Karr (1981) and compares the integrity of communities found in test sites with those in reference sites where minimizing human disturbances!°”°, It integrates responses of various metrics to different types of human impacts and relies on 1College of Fisheries, Henan Normal University, Xinxiang 453007, Henan, China. *Observation and Research Station On Water Ecosystem in Danjiangkou Reservoir of Henan Province, Nanyang 474450, Henan, China. 3Center of Hydrology and Water Resources of Henan Province, Zhengzhou 450003, Henan, China. “’email: gaoyn@htu.cn reference conditions”!~**, The metrics of the IBI include multiple aspects of a community, including its diversity and composition in terms of taxonomy, taxa adaptability, and functional groups”. With the rising issues of eutrophication and algal blooms in reservoirs wor! based IBI approaches have been developed to indicate ecological health status dwide, plankton community- in these bodies of water®?®?7, Earlier studies have focused on bioindicators based on fish communities in reservoirs”*. The first IBI approaches based on macrobenthos were used to assess the ecological health of rivers an evaluate biological conditions in lotic waters, such as rivers and streams, rather t reservoirs*®*°, Three IBIs—those based on phytoplankton (P-IBI), zooplankton (; have been comparatively employed to evaluate the ecological health of the Qingyi that the scores of the three IBIs were lower than that of the WQI (p< 0.01), with tl sensitivity!>. Although the utility of benthic macrobenthos as indicators of biologi in tropical reservoirs, their application in other reservoir systems remains largely have been widely applied to an in lentic waters, including Z-IBI), and benthos (B-IBI)— River Basin. Findings indicate e B-IBI exhibiting the highest cal quality has been confirmed unexplored’°.",
    "Comparatively, macrobenthos are the most commonly utilized assemblages among freshwater organisms in bioassessment efforts worldwide”°*!~**. This is largely due to their bottom-dwelling lifestyle, relatively long lifespan, high diversity, and sensitivity to various disturbances. As a result, macro enthos have become essential for river ecological monitoring and evaluation in numerous countries, including China**~**, However, biological assessments based on macrobenthos in reservoirs require further attention and development!”. Henan Province is unique in that it spans the Yangtze, Huai, Yellow, and Hai Rivers in China. However, the region faces significant water scarcity issues, both regionally and temporally. In response, more than 2,500 reservoirs have been constructed to ensure a continuous water supply and maintain the province's water security. The aquatic environment in Henan has been greatly impacted by human activities and rapid socio-economic development. Although individual reservoirs are monitored and evaluated ecologically’’, there is a lack of operational monitoring and evaluation of the ecological health of most reservoirs, highlighting an urgent need for relevant work. Therefore, ten large and medium-sized reservoirs distributed across four basins in Henan Province were selected to develop a B-IBI based on the characteristics of the macrobenthos, thereby assessing their ecological health. This initiative aims to provide an effective method for evaluating the relatively long- term effects of human disturbance on reservoir ecosystems. This study is expected to be a pioneering effort in establishing a B-IBI for monitoring and comparing the ecological health of reservoirs across the four major river basins. total of 90 taxa belonging to 3 phyla, 6 classes, 17 orders, 45 families, and 81 genera were identified across the ten reservoirs. Among these, 55 taxa classified under the Class Insecta were identified, primarily from the families Heptageniidae, Libellulidae, and Chironomidae. Nineteen taxa, mainly from the families Planorbidae, Lymnaeidae, and Bithyniidae, were identified in the Class Gastropoda. Additionally, six taxa from the Class Bivalvia, four taxa from the Class Crustacea, four taxa from the Class Oligochaeta, and two taxa from the Class Clitellata were recorded. The reservoirs located within the Huai and Yangtze River basins exhibited significantly higher overall taxa richness compared to those in the Yellow and Hai River basins. Notably, the QP in the Huai River basin and the YHK in the Yangtze River basin showed particularly high taxa richness, with up to 17 taxa identified at specific sampling sites. Additionally, the XX, also situated in the Yangtze River basin, displayed a relatively diverse overall taxonomic composition. In contrast, the reservoirs in the Yellow and Hai River basins demonstrated a less diverse taxonomic composition, with some sites harboring as few as two identified taxa (Fig. 1a). At the family level, analysis across all 44 sampling sites within the 10 reservoirs revealed Chironomidae (Class Insecta), Palaemonidae (Class Crustacea), and Tubificidae (Class Oligochaeta) as the dominant taxonomic groups, with Chironomidae being the most widely distributed, present at 35 of the sampling locations (Fig. 1b). The abundance of the Phyla Arthropoda and Mollusca was higher across all reservoirs compared to Phylum. Annelida, which was notably absent in the XLD Reservoir (Fig. 2). The Class Insecta within Phylum Arthropoda was dominant in Reservoirs XX and YHK in the Yangtze River basin, QTH in the Yellow River basin, CSD in the Huai River basin, and BQ in the Hai River basin. In contrast, the Class Crustacea, also belonging to Phylum Arthropoda, was prevalent in Reservoirs GX and XLD within the Yellow River basin. The Classes Insecta (Phylum Arthropoda) and Gastropoda (Phylum Mollusca) showed dominance in Reservoirs QP, SYH, and CSD within the Huai River basin (Fig. 2). Among the 30 candidate metrics of macrobenthos, eight metrics demonstrated robust discriminatory capability between 11 reference sites and 33 impaired sites (IQ > 2, Fig. 3). These metrics include the Number of taxa (M1), Number of Crustacean and Mollusca taxa (M6), Number of Intolerant taxa (M13), Intolerant % (M15), Tolerant % (M16), the BI index (M17), the BMWP index (M18), and the Shannon-Wiener index (M27). Spearman correlation analyses revealed strong correlations between M1 and M27, M13 and M15, as well as M16 and M17. Consequently, metrics M1, M13, and M16 were excluded due to their stronger correlations with other parameters. The remaining five metrics—M6, M15, M17, M18, and M27—were selected for the construction of the B-IBI due to their low correlation (r < 0.75) with one another.",
    "The B-IBI index exhibited a normal distribution across all sampling sites, with significant differences (IQ > 2) in the B-IBI scores observed between the reference and impaired sites, thereby confirming the reliability of the assessment index (Fig. 4). Fig. 1. The taxa number (a) and relative abundance at family levels (b) of macrobenthos across 44 sampling sites in ten reservoirs in Henan Province. Notes: BQ: Baoquan Reservoir, QTH: Qingtianhe Reservoir, HKC: Hekoucun Reservoir, XLD: Xiaolangdi Reservoir, GX: Guxian Reservoir, XX: Xixia Reservoir, YHK: Yahekou Reservoir, QP: Qianping Reservoir, SYH: Suyahu Reservoir, CSD: Chushandian Reservoir. The B-IBI scores of the 44 sites across ten reservoirs ranged from 0.35 to 3.99. The assessment results indicated that 12 sites were classified as excellent, 11 as good, 12 as fair, 6 as poor, and 3 as very poor (Fig. 5a). According to the median B-IBI scores for each reservoir, only one reservoir (QP in the Huai River basin) achieved an excellent classification, whereas four reservoirs (GX and XLD in the Yellow River basin, XX in the Yangtze River basin, and CSD in the Huai River basin) were classified as good. Three reservoirs (SYH in the Huai River basin, YHK in the Yangtze River basin, and BQ in the Hai River basin) received a fair classification. Two reservoirs (QTH and HKC in the Yellow River basin) were categorized as poor, with no reservoirs rated as very poor (Fig. 5b). Based on the median B-IBI scores of sites within each basin, the reservoirs in the Huai and Yangtze River basins were classified as good, whereas those in the Yellow and Hai River basins were categorized as fair (Fig. 5c). The B-IBI exhibited a negative correlation with total nitrogen (TN) and electrical conductivity (EC) (p <0.05). TN also demonstrated significant negative correlations with the B-IBI metrics M15, M18, and M27 (p<0.05). Specifically, M15 showed a positive correlation with pH but a negative correlation with EC and TN (p<0.05). Furthermore, M18 displayed negative correlations with water temperature (TEMP) and total nitrogen (TN), whereas showing positive correlations with turbidity (TURB) and ammonia nitrogen (NH,*-N). Lastly, M27 exhibited a positive correlation with pH but was negatively correlated with TN (Fig. 6). The macrobenthos in the studied reservoirs were predominantly from the phyla Arthropoda and Mollusca, which are also commonly found in other freshwater lotic and lentic ecosystems*”“°. The intolerant taxa identified in the reservoirs were all members of these phyla. Taxa belonging to the phylum Annelida are known for their high pollution tolerance*!~**. The absence of Annelida in Reservoir XLD, alongside the high richness and/or relative abundance of intolerant taxa in Reservoirs GX, XLD, XX, and QP, collectively suggest that these reservoirs may experience minimal pollution pressure. The B-IBI index assessed their health status as good or excellent, indicating a strong alignment between the community characteristics of macrobenthos and the health assessment. Crustacea were predominant in the reservoirs of the Yellow River Basin, whereas Insecta were the dominant group in the Yangtze and Hai River basins. Additionally, both Insecta and Gastropoda were prevalent in the Huai River basin. This indicates that community structures exhibited significant differences among the investigated reservoirs across the four basins at the higher taxonomic level. However, we did not find statistically significant differences at the lower taxonomic level. The B-IBI metrics selected for this study are based on taxonomic richness and the relative abundance of lower taxa. The similarity of benthic animal community structures across various water bodies at lower taxonomic levels should be a critical criterion for developing and implementing a standardized evaluation system*”“*“*, Therefore, we propose that the B-IBI evaluation system constructed in this study can be effectively applied to reservoirs in multiple river basins within Henan Province, and potentially throughout the Central Plains of China. The application of multi-metric indices to assess biological condition has been widely adopted globally due to their effectiveness in integrating diverse biological metrics across various levels of ecological organization. The primary challenge lies in distinguishing natural variability from anthropogenic impacts when developing and applying these multi-metric indices“*“’. Reference sites are essential in the construction of a useful IBI. However, locating anthropogenically undisturbed sites is rare. Consequently, the least-disturbed reference condition is most commonly utilized. Water quality and land use variables are the primary criteria employed to determine the reference condition'*. A notable disparity was observed between the reference and impaired sites, despite their location within four different river basins characterized by varying hydrology, geomorphology, and biogeochemistry.",
    "Five metrics including M6, M15, M17, M18, and M27, were screened and combined into B-IBI index to assess the health conditions of the 10 reservoirs in Henan Province. The metrics, particularly M6, M17, M18 and M27, are widely utilized in B-IBI in lotic and lentic aquatic ecosystems'*. Typical responses of macrobenthos to environmental stress include a reduction in taxa richness, an increase in the abundance of tolerant taxa, a decline in the diversity and density of sensitive taxa, and a simplification of food webs‘*. Taxa within the Crustacea and Mollusca groups are primarily found in habitats with lower to intermediate levels of disturbance. The number of Crustacean and M6 is particularly responsive to changes in water quality, making it a common component in assessment methodologies*’. The number of Crustacean and M6 in reference sites was significantly higher Fig. 3. Discriminatory power of eight attributes in macrobenthos communities between reference and impaired sites. Notes: The range bars depict the maximum and minimum values of non-outliers, while the boxes represent the interquartile ranges (from 25 to 75the percentiles). The bold bars indicate the medians, and any outliers are denoted by squares. M1: Number of taxa, M6: Number of Crustacean and Mollusca taxa, M13: Number of Intolerant taxa, M15: Intolerant %, M16:Tolerant %, M17: BI index, M18:BMWP index, M27: Shannon-Wiener index. Fig. 5. The B-IBI scores and grades of 44 sites (a) in 10 reservoirs (b) across the four river basins (c) in Henan Province of China. Notes: In panels (b) and (c), identical colors represent the same river basin. Dashed lines indicate threshold values for different ecological health levels, ranging from “Very Poor” to \"Excellent.\" BQ: Baoquan Reservoir, QTH: Qingtianhe Reservoir, HKC: Hekoucun Reservoir, XLD: Xiaolangdi Reservoir, GX: Guxian Reservoir, XX: Xixia Reservoir, YHK: Yahekou Reservoir, QP: Qianping Reservoir, SYH: Suyahu Reservoir, CSD: Chushandian Reservoir. than in the impaired sites, indicating that M6 serves as a sensitive indicator for assessing environmental stress in this study. The M27 is commonly used in biological assessments of macrobenthos”>*°. It quantifies diversity by accounting for both the number and relative abundance of taxa present!®*!. In this study, the M27 shows a significant correlation with taxa richness (r=0.827, p< 0.01). However, taxa richness is less frequently included in bioassessment approaches, as maximum richness often occurs at intermediate disturbance levels in most ecosystems”. A significantly lower M27 was observed at the impaired sites. Additionally, taxa composition at the impaired sites predominantly consisted of pollution-tolerant taxa, such as the Family Tubificidae, whereas pollution-intolerant sensitive taxa, like Ephemeroptera and Trichoptera, were considerably less abundant. Sensitivity and tolerance indices emerged as the most reliable category of metrics“‘. Additionally, three retained metrics relate to the richness and relative abundance of tolerant or intolerant taxa in response to environmental pollution. The M15 denotes the proportion of more sensitive benthic species relative to the total abundance of macrobenthos at each sampling site. The M18 incorporates the sensitivity values of taxonomic Fig. 6. Correlation matrix illustrating the relationships between the B-IBI, core indicators, and water quality parameters across 44 sampling sites in 10 reservoirs in Henan Province. Notes: * indicates significant correlation at the 0.05 level. M1: Number of taxa, M6: Number of Crustacean and Mollusca taxa, M13: Number of Intolerant taxa, M15:Intolerant %, M16: Tolerant %, M17: BI index, M18: BMWP index, M27: Shannon-Wiener index, TERB: Water temperature, DO: Dissolved oxygen, EC: Conductivity, COD,,,: Potassium permanganate index, TURB: Turbidity, NH,*-N: Ammonia nitrogen, TN: Total nitrogen, TP: Total phosphorus. units at the family level and applies less stringent criteria for taxa classification”. In contrast, the M17 considers the tolerance values of taxa and imposes stricter requirements on taxa classification, which demonstrated the most robust associations with environmental factors®. The correlation coefficients for the three metrics are below 0.75, with significant differences observed between reference and impaired sites. The B-IBI index exhibits a strong capacity to discriminate between reference and impaired sites, indicating its suitability for assessing regional reservoirs in Henan Province. Furthermore, it effectively distinguishes among different sites within an individual reservoir. Notably, all reservoirs, except for HKC, contain sites classified as excellent or good. Interestingly, the eco-health status of the four reservoirs in the Yellow River basin ranges from poor to good, highlighting their relative dependence. This disparity may be due to the fact that, with the exception of XLD, which is a channel-type reservoir on the Yellow River, the other reservoirs lack direct connectivity with the main water body of the basin®*. Compared to reservoirs in the central and southern parts of Henan Province, the ecological status of those investigated in the north, such as HKC, QTH, and BQ, were significantly worse. Water scarcity in the northern region is more severe than in other areas of Henan Province”, underscoring the urgent need for water quality management in these northern reservoirs.",
    "TN concentrations were negatively correlated with scores of the B-IBI index and several core metrics, including M15, M18, and M27. In the Jincheng region of the Qin River, specifically in the upstream area of the HKC reservoir, nitrogen and ammonium were identified as key drivers influencing macrobenthos community characteristics*’. Increased concentrations of nitrogen favored tolerant taxa®°. The average TN concentration in HKC, QTH, and BQ was 4.06 mg L\"!, significantly higher than that of the other six reservoirs (1.87 mg L’!). Responsiveness to anthropogenic pressures is considered a critical factor for evaluating method performance. The B-IBI index and its core metrics exhibited strong correlations with environmental variables, particularly for TN, thereby validating the robustness of the B-IBI. Henan Province is located in the east-central region of China, with geographical coordinates ranging from 110.35° to 116.65°E and 31.38° to 36.37°N. Covering a total area of 167,000 km’, the province predominantly experiences a temperate monsoon climate. With a population exceeding 99 million, Henan Province is a significant agricultural area. Effective management of reservoirs is crucial for supporting both human livelihoods and agricultural productivity. In August 2021, we conducted a sampling study at 44 sites across 10 large and medium-sized reservoirs in Henan Province. The sampling sites were strategically selected to represent the inlet, center, and outlet of each reservoir, ensuring comprehensive coverage of the water body (Table 1, Fig. 7). At each site, three subsamples were collected using a modified Peterson grab sampler (0.0625 m?). The mud samples collected were washed on-site with a 60-mesh sieve, and the remaining contents containing macrobenthos were promptly placed into labeled plastic bags and transported under -4'C. The sieved samples were transferred to white porcelain plates within 12 h to thoroughly pick out all macrobenthos, which were then preserved in 100 mL plastic bottles filled with 95% ethanol prior to identification. The macrobenthos specimens were identified to the lowest possible taxonomic level (typically to species or genus) using a dissecting microscope (CX21FS1, Olympus Cor-poration, Tokyo, Japan) and a compound microscope (SMZ800N, Olympus Cor-poration, Tokyo, Japan) according to the Chinese manuals*”~®, The benthos collected from each site were carefully enumerated to calculate the density of each taxonomic unit of macrobenthos per unit area. Data on physicochemical parameters were also gathered for each sampling site. Water temperature (TEMP), pH, dissolved oxygen (DO), and Conductivity (EC) were measured in situ using a portable multiprobe meter (YSI 6600, YSI Inc., Yellow Springs, Ohio, USA). Additional water samples were collected for laboratory analysis of turbidity (TURB), Total nitrogen (TN), ammonia nitrogen (NH,*-N), permanganate index (COD,,,), and total phosphorus (TP). These water samples were stored below 4°C and transported to the laboratory within 24 h to ensure sample integrity. The analysis of these indicators adhered to the guidelines outlined in the “Environmental Quality of Surface Water in the People’s Republic of China\" (GB3838-2002). Under ideal conditions, reference sites should experience minimal disturbance from anthropogenic activities!”°”, However, due to the high population density and the significant agricultural production and mineral resource extraction in Henan Province, identifying reference sites that strictly meet the definition of being undisturbed poses challenges. In this context, water quality and local habitat conditions were primarily utilized to filter potential reference sites. The selected reference sites adhered to the following criteria: (1) Water quality meets Class III or higher standards as defined by the Environmental Quality Standards for Surface Water (GB 3838-2002); (2) There is minimal human impact, with no dams, agricultural land, residential areas, or roads within a 500-m radius; (3) Vegetation cover is equal to or greater than 30%; (4) The presence of sensitive taxa is confirmed®!. The development of the B-IBI involved screening 11 reference sites. The study identified a total of thirty candidate metrics for benthic macrobenthos assemblages, further categorized into seven distinct groups: taxa composition, community composition, pollution tolerance, trophic status, nutritional structure, habitat, and diversity index (Table $1)!5°°. The candidate metrics underwent ox and whisker plot analyses. The degree of inter-quartile overlap (IQ) in the boxplots was used to evaluate Table 1. The basic information of the 10 reservoirs in Henan Province. Notes: 1, water supply; 2, agricultural irrigation; 3, flood control; 4, sediment reduction; 5, hydroelectric power generation; 6, tourism. Fig. 7. Locations of 44 sampling sites in 10 reservoirs in Henan Province, China. Triangles and Circles indicate reference and impaired sites, respectively. Notes: BQ: Baoquan Reservoir, QTH: Qingtianhe Reservoir, HKC: Hekoucun Reservoir, XLD: Xiaolangdi Reservoir, GX: Guxian Reservoir, XX: Xixia Reservoir, YHK: Yahekou Reservoir, QP: Qianping Reservoir, SYH: Suyahu Reservoir, CSD: Chushandian Reservoir.",
    "the discriminatory power of each metric (Figure S1). Metrics were retained if they displayed significant discriminatory ability (IQ>2) between reference and impaired sites. The retained metrics were then subjected to Spearman correlation analysis to assess metric redundancy, applying a criterion of a minimum correlation coefficient of 0.75 (p<0.05, Table $2). Subsequently, the Kruskal-Wallis test was utilized to more accurately evaluate the discriminatory power of the redundant metrics between reference and impaired sites, retaining only the metrics with the higher chi-squared value®’. The key measurements exhibited a wide range of raw values, necessitating the standardization of each metric to a score using the ratio technique*'. The score values were scaled between 0 and 1, with any metric value exceeding 1 being capped at a maximum of 1(Table $3). For metrics that decrease with disturbance, the anticipated value (V95%) for all samples was assigned as the standardized value based on the 95th percentile of the assessment metric, following Eq. (1). Conversely, for metrics that increase with disturbance, the anticipated value (V5%) was determined from the standardized value derived from the 5th percentile of the evaluation metric, as specified in Eq. (2): Herein, Bin represents the calculated standardized value of an assessment metric, Vi denotes its actual measured value, and Vmax signifies the maximum among all samples considered in the study. The final B-IBI score at each site is determined by summing the calculated index scores, with the 25th percentile of the B-IBI value at reference sites defined as \"excellent.\" B-IBI values falling below this threshold are categorized into four equal grades, resulting in four additional classifications. The B-IBI score for each reservoir and river basin is derived by computing the median value of B-IBI scores across all monitoring sites within each respective reservoir and river basin. The distribution map of sampling sites and the results map were generated using ArcMap 10.8 software. The ggplot2, vegan and circlize packages in R v4.2.2 were utilized to visualize and analyze the spatial distribution of macrobenthos. Origin 2023 software was employed for graphical and descriptive analysis of other data. IBM SPSS Statistics 26 software was used to perform Spearman correlation analysis. The community characteristics of macrobenthos were examined in ten large and medium-sized reservoirs spanning four river basins (the Hai, Yellow, Yangtze, and Huai Rivers) in Henan Province during August 2021. The B-IBI index was established, incorporating five core metrics: the number of crustacean and molluscan taxa, intolerant percentage, the BI index, the BMWP index, and the Shannon-Wiener index. A total of 90 taxa were identified across three phyla, six classes, 17 orders, 45 families and 81 genera at 44 sites within the ten reservoirs. Although the dominant class in the reservoirs varied across the four basins, the community structure at lower taxonomic levels did not exhibit significant differences. The total B-IBI score for the 44 sites among the ten reservoirs ranged from 0.35 to 3.99. The assessment results categorized 12, 11, 12, 6 and 3 sites into excellent, good, fair, poor, and very poor levels, respectively. Two reservoirs (QTH and HKC in the Yellow River basin) were classified as poor, whereas only one reservoir (QP in the Huai River basin) was rated as excellent. The B-IBI index demonstrates a strong capacity to differentiate between reference and impaired sites, indicating its suitability for assessing regional reservoirs in Henan Province. Additionally, a significant inverse correlation was noted between TN levels and B-IBI scores, suggesting that the B-IBI effectively reflects the impact of nitrogen pollution. Management efforts for reservoirs, particularly those located in northern Henan Province, should prioritize the reduction of nitrogen pollution inputs."
]