[
    "In recent years, the survival and development of traditional villages in China have been serious challenges. Rural tourism is regarded as an important way to solve rural problems, and the combination of rural culture and tourism has become a new power point for rural development. Therefore, it is necessary to explore the spatial distribution structure between traditional villages and rural tourism. In this paper, rural tourism was represented by the rural tourism characteristic village (RTCV), and Henan Province, China, was taken as a study area to analyze the distribution pattern and spatial correlation of rural tourism and traditional village (TV) and discuss the relationship between the spatial correlation and regional natural environment and socioeconomic factors. The results show that the coupling of the spatial correlation between RTCVs and TVs in Henan was clear. They could be divided into 5 regions based on geographical factors. In addition, the research summarized 4 typical spatial structures between TVs and RTCVs in Henan based on the regional symbiosis theory, and the spatial pattern formation mechanism of TVs and RTCVs was discussed based on three driving mechanisms. The spatial structure of the two can provide reference value for other developing countries and regions to achieve sustainable rural development. Traditional villages (TVs) are an important component of the country space system. It is not only an important carrier of regional traditional culture and folk customs but also carries many historical memories, humanistic ecology, architectural aesthetics and social development tracks, known as the “living fossil” of the countryside’. However, with the acceleration of urbanization, traditional villages have been facing severe challenges, and revitalization work has become extremely urgent‘. At the same time, rural tourism is regarded as an impor- tant way to solve rural problems, which promotes handicraft production in the agricultural sector, improves living conditions and protects cultural heritage and folk customs by using local natural resources and human resources™®, It has been on the agenda of many local, regional and national policy makers’ and promoted as a tool to enhance the versatility of rural areas*’. On the other hand, as a countryside with a symbiotic relationship with tourism”, the diversity and uniqueness of rural culture provide rich resources for the development of rural tourism. Rural culture can form a unique tourism resource for the tourism industry by developing the ancient architectural culture of the village into a rural characteristic landscape. The combination of rural culture and tourism has become a new power point in the countryside'. Therefore, it is of great significance to explore the spatial structure type between traditional villages and rural tourism to achieve the sustainable development of rural tourism and the revitalization of traditional villages. Currently, there is a lack of consensus on the definition of rural tourism!*\". In this paper, rural tourism is represented by the rural tourism destination—rural tourism characteristic village (RTCV), which is the prod- uct of the Henan provincial government implementing the national rural revitalization strategy, with a total of 471\", Relevant studies have shown that traditional village and rural tourism destinations are regions interwoven with economic and social activities and have obvious comprehensive and regional characteristics'*\". Therefore, from the perspective of regional symbiosis theory, exploring the spatial structure of traditional villages and rural tourism destinations is necessary. The concept of symbiosis was first proposed and used in the field of biology in 18791”. After the 1950s, the idea of symbiosis penetrated many fields of society'*~°. The symbiotic system includes School of Architectural and Artistic Design, Henan Polytechnic University, Jiaozuo 454000, China. ?School of Liberal Arts and Law, Henan Polytechnic University, Jiaozuo 454000, China. UJiyang College, Zhejiang A&F University, Zhuji 311800, China. “email: yxzh17@hpu.edu.cn three elements: the symbiotic unit, symbiotic mode, and symbiotic environment. Its core content is the symbi- otic relationship composed of diverse symbiotic units”’, which reveals the phenomenon of mutual cooperation, mutual benefit, coexistence and common development among units”*. In China, with the deepening of research in recent years, an increasing number of scholars have applied symbiosis theory to ancient village tourism”’, rural tourism™*”®, cultural tourism integration” and so on. As the decisive features in rural development”’, symbiosis theory was used in the research on the mechanism of promoting the common prosperity of traditional villages, and rural tourism will be a meaningful practice. In this paper, the symbiotic unit specifically refers to the TVs and RTCVs. Symbiotic environments are external conditions for the analysis of symbiotic relationships between TVs and RTCVs, including natural, economic, and social environments. The symbiosis mode of traditional vil- ages and rural tourism destinations will be analyzed from the geographical perspective.",
    "Meanwhile, some spatial results on TVs and RTCVs have been obtained**”’. However, most studies are imited to the spatial distribution of TVs or RTCVs themselves*”*!, studies on the correlation between the spatial distribution of ancient villages and tourism development elements*, and studies on rural tourism in typical TVs**-**. In addition, there are some similarities in the spatial distribution between historical villages and overty-stricken villages*®. Thus, research on the spatial structure and coupling of TV and RTCV can provide a clearer understanding of the economic situation in different rural areas, and a more precise rural development strategy will be implemented. The symbiotic spatial structure of the two can be applied to other developing countries and regions to provide an effective reference value for the sustainable development of rural tourism. The research area of this paper is Henan Province, which is the largest agricultural province and one of the rovinces with a large population in China’’. In terms of population size, geographical area and economic out- ut, it is comparable to medium-sized countries on the European continent, such as Sweden**”. In addition, Henan has complex and diverse topography and is rich in tourist resources and cultural diversity, with a similar spatial distribution of traditional villages and rural tourism destinations*”“'. This paper aims, first, to study the spatial distribution modes of TVs and RTCVs and to explore the relationships between the spatial distribution characteristics of villages and the multidimensional impact factors at the provincial level. Furthermore, their ernel density coupling relationship at the township level was revealed using spatial correlation. Finally, accord- ing to the analysis results, the spatial structure of rural tourism characteristic villages and traditional villages are discussed based on the theory of regional symbiosis. The research results can provide a reference for the sustainable development of traditional villages and rural tourism. Study area. Henan Province was named Yuzhou in ancient times and is known as ‘the hinterland of ancient China and the thoroughfare of ten provinces. It is one of the important cradles of the Chinese nation and an important comprehensive transportation hub and information flow logistics center in China. Henan Province is bounded between 31° 23’ N-36° 22’ N and 110° 21' E-116° 39’ E with a total area of 167,000 km? and is in the transition area of the second and third steps in central China (Fig. 1). It is surrounded by mountains on three sides with high terrain in the west and low terrain in the east. The northern border is the Taihang Mountain region, the western border is the Funiu Mountains region, and the southern border is the Ta-pieh Mountains. The farming culture and geographical characteristics have created a fully preserved ancient village culture and rural tourism resources. The Henan Provincial government announced 6 batches of 1019 provincial-level TVs and 4 batches of 471 provincial-level RTCVs by 2022. Data sources. To study the spatial correlation between the distribution of TVs and RTCVs in Henan Province, this paper took 1019 TVs (see Supplementary Table $1 online) and 471 RTCVs (see Supplementary Table S2 online) as the objects identified by the Henan People’s Government. They were abstracted as points by calibrating longitude and latitude via the Baidu API. QGIS 3.30, GeoDa 1.20, and other analytical tools were used to analyze the role of environmental factors and social factors. Relevant data sources include (1) the topo- graphic information of Henan Province DEM raster data with a resolution of 30 m and river data derived from the resource and environment data cloud platform of the Institute of Geographical Sciences and Resources, Chinese Academy of Sciences (https://www.resdc.cn/); (2) the administrative region (points) data were derived from the National Basic Geographic Information Center (http://www.ngcc.cn/); (3) the list of A-level scenic spots (see Supplementary Table $3 online) came from the Henan General Office of Culture and Tourism; and (4) data on population, per capita disposable income of all residents, road mileage and others were obtained from the national economic and social development statistical bulletin of relevant cities and prefectures in Henan Province in 2021 (the data, such as Henan Province 30 m DEM raster data, river system data, administrative region (points) data, population, per capita GDP data of county or city and road mileage. see Supplementary Data Collection D1 online).",
    "Methods and procedures. _ In this study, a series of spatial statistics and analysis techniques were applied to conduct a quantitative analysis of TVs and RTCVs in Henan. First, the longitude and latitude of TVs and RTCVs were obtained via the Baidu API, and data were entered and cleaned in Excel 2019 (Microsoft Corp, USA). Then, kernel density estimation and nearest neighbor index analysis based on QGIS 3.30 were employed to evaluate the spatial distribution of analysis points (Figs. 2a, 3a), and the quantity distribution diagrams of TVs and RTCVs in various urban areas were obtained through mathematical statistics in Excel 2019 (Figs. 2b, 3b). Finally, the spatial correlation relationship between the TV density index and the RTCV density index at the township level (Fig. 4) was analyzed by the bivariate spatial autocorrelation model based on GeoDa 1.20 (which is an open source, free software that can be used to analyze spatial statistics based on the spatial autocorrelation Figure 1. Spatial distribution of TVs and RTCVs in Henan Province, China. Note The basic map of China is derived from the standard map service website (http://bzdt.ch.mnr.gov.cn) with approval number GS(2022) 4316 produced by the Ministry of Natural Resources of the People’s Republic of China, and the base map has not been modified. A spatial distribution map of TVs and RTCVs in Henan Province was created by the authors using QGIS 3.30 (Geographic Information System, Open Source Geospatial Foundation Project. http://www. qgis.org/) based on digital elevation model (DEM) data from https://www.resdc.cn/. Figure 2. Distribution and kernel density of traditional villages in Henan Province (a) and quantity distribution diagram of traditional villages in various urban areas of Henan Province (b). Figure 2a was created with the Open Source software QGIS (version 3. 30—http://www.qgis.org/en/site/). Figure 3. Distribution and kernel density of rural tourism characteristic villages in Henan Province (a) and quantity distribution diagram of rural tourism characteristic villages in various urban areas of Henan Province (b). Figure 3a was created with the Open Source software QGIS (version 3. 30—http://www.qgis.org/en/site/). Figure 4. The LISA cluster diagram of the distribution of traditional villages and rural tourism characteristic villages (a) and the LISA cluster diagram of the distribution of traditional villages and rural tourism characteristic villages under topographic conditions (b). (a) and (b) were created with the Open Source software QGIS (version 3. 30—http://www.qgis.org/en/site/). principle, download at http://geodacenter.github.io/). All layers were added to the WGS 84/UTM ZONE 51 N, EPSG code: 32651 Flat Coordinate Reference System. Vectorized natural and socioeconomic factors. The DEM data were harnessed to derive slope in degree and topographic relief (the difference in elevation between the highest and lowest points in the area). The scope of river, city-county and scenic spot radiation was determined by buffer zone tools. Moreover, according to the data of the Seventh Population Census of China (http://www.stats.gov.cn/) and the Statistic Yearbooks of Henan of 2021 (https://tjj-henan.gov.cn/), using road length, population and economic income, road network density and per capita GDP were calculated for each county or city. All of the above factors were reclassified into dif- ferent intervals based on the reclassification tool by table in QGIS. The number of TVs and RTCVs in different intervals of each influencing factor was counted by using count points in polygons, and the histogram and line chart were obtained by Excel 2019 mathematical statistics (Figs. 5, 6, 7 and 8b). The main methods of this study are as follows: Kernel density estimation. To visualize the spatial dispersion and the location, shape and size of TV and RTCV aggregations, kernel density estimation can calculate the sample density distribution of the entire region accord- ing to the value of the input point elements and their distribution, and the result is a continuous raster diagram*. The expression is: where f(x) is the kernel density estimation of villages, larger values indicate that the distribution of villages is dense; n is the number of villages; x- xi is the estimated distance from point x to sample xi; h>0 is the bandwidth (search radius), users can set the appropriate values; and k is a spatial weight function. Figure 5. Distribution of villages around elevations in Henan Province (a) and distribution of villages around rivers in Henan Province (b).",
    "Figure 6. Distribution of villages around the central country or city in Henan Province (a) and distribution of villages around road network kernel density in Henan Province (b). Figure 7. Distribution of villages around the population density of counties and cities in Henan Province (a) and distribution of villages around the per capita GDP of counties and cities in Henan Province (b). Nearest neighbor index analysis. In geographical space, the nearest neighbor index can represent the proximity of point objects*’. The villages were abstracted in the study area into a series of geographical points as follows: $1=(X1, Y1), $2=(X2, Y2), ..., Sn=(Xn, Yn), where Sn is the observation event serial number*!. Then, the index was used to analyse the global distribution pattern of TV and RTCV in Henan Province. The average nearest neighbor ratio in a region is: Figure 8. Spatial distribution of villages around the class A scenic area in Henan Province (a) and distribution of villages around class A scenic areas in Henan Province (b). (a) were created with the Open Source software QGIS (version 3. 30—http://www.qgis.org/en/site/). where R is the nearest neighbor point index, 77 is an average value of the distance (r,) between the nearest points, and 7¢ is the nearest neighbor distance in theory. When R<1, the village tends to be concentrated in space; when R>1, the village is uniformly distributed in space; and when R = 1, the village is randomly distributed in space. The formula of 7¢ is: where A is the area value of the study area and n is the number of villages in the study area. Spatial correlation analysis. Spatial correlation among geographically related data can be analyzed through spatial statistics*’. In this paper, the bivariate local spatial autocorrelation method was used to reveal the kernel density coupling relationship between TVs and RTCVs in Henan Province, and a local indicator of spatial asso- ciation (LISA) diagram was used to reflect the significance level of local spatial autocorrelation. The formula is: where a=1, 2... and B=1, 2, ..., Ya is the bivariate local spatial autocorrelation coefficient; xt is the value of the kernel density of the TVs in the township; X’, is the value of the kernel density of the RTCVs in the township; Xz, is the average value of kernel density in TV, Xg is the average value of kernel density in RTCV; 6,, 5g is the variance of a, 8; and Wij is the spatial weight matrix between spatial units i and j. Spatial distribution of TVs and RTCVs in Henan Province. The nearest neighbor index of TVs in Henan was 0.539 by QGIS 3.30, indicating that the spatial distribution of TVs was clustered. Then, the spatial distribution of TVs was significantly different and tended to be clustered in space by kernel density analysis (Fig. 2a). At the provincial level, the distribution characteristics of TVs in Henan were as follows: the spatial distribution of TVs was denser in the northern, central and southern regions. According to the degree of aggre- gation of TVs, they were in the administrative junction of Hebi, Xinxiang, and Anyang cities in northern Henan, the junction area of Zhengzhou, Pingdingshan, and Xuchang cities in central Henan, and the southern area of Xinyang in southern Henan. The TVs in other cities were generally distributed in a low-density and discrete pat- tern. As shown in Fig. 2b, the top three cities with the largest number of TVs were Pingdingshan (171, 16.78%), Xinyang (126, 12.37%), and Luoyang (103, 10.11%). The common feature of the top three cities was that they have precious historical monuments and rich cultural heritage, such as Pingdingshan city“ and Xinyang city*®. The nearest neighboring index of RTCVs in Henan Province was 0.656, which demonstrates a cluster-type distribution in space. We analyzed the kernel density of RTCVs and found that the distribution of RTCVs in Henan Province was a multikernel clustering belt type (Fig. 3a). Similar to the distribution of TVs, RTCVs were mainly distributed in two linear regions and two core regions. The first linear distribution region was Anyang- Hebi- Xinxiang- Jiaozuo and Jiyuan cities; the second linear distribution area was Puyang- Xinxiang- Kaifeng- Xuchang- Luohe and Pingdingshan cities; and the other two concentrated distribution areas were the intersection of Xinxiang, Hebi, Anyang and the administrative junction of Pingdingshan and Xuchang. The average number of villages in each city was approximately 30 or less than 30 units, and the number of RTCVs in Pingdingshan ranked first, totaling 47 (Fig. 3b).",
    "Spatial correlations of TVs and RTCVs in Henan Province. Ninety-four compound villages (CVs, with characteristics of both traditional villages and tourism villages) were found by the spatial analysis function of QGIS 3.30 to overlap the spatial distribution of TVs with RTCVs, which accounted for 6.31% of the total village sample, 9.22% of all TVs and 19.50% of all RTCVs. This indicated that 1 out of every 10 TVs in Henan Province was a village with tourism characteristics, and 1 out of every 5 villages with tourism characteristics was a traditional village. Subsequently, as shown in Fig. 4a, the red area indicates that the density of TVs and RTCVs was high in this township; the blue area indicates that the density of TVs was low and the density of RTCVs was high in this township; the green area indicates that the density of TVs and RTCVs was low, and the white area indicates no correlation between TVs and RTCVs. The results showed that the high-density cluster types of TVs and RTCVs (referred to as high-high, meaning the other two types are TVs in front and RTCVs in behind) were distributed at the borders of cities, such as Jiyuan and Luoyang and Nanyang and Pingdingshan. The low-high types were mainly concentrated at the border of Luoyang, Nanyang, and Zhumadian. The rest of the region was sparsely distributed; the high-low type presented a scattered distribution in 18 states, where the largest number was distributed in Luoyang, Nanyang, Xinyang, and Shangqiu. In Fig. 4b, high-high type areas were in the Ta-pieh- Tongbai Mountain area, and the mountainous and hilly clustered village area of western Henan was observed by observing the results spatially superimposed with the DEM from Henan Province. Nanyang Basin, with inconvenient transportation and a backward economy, is surrounded by mountains on three sides. There are many TVs and a few RTCVs, which form a gathering place of high-low types. In the Tongbai Mountain area, low-high type agglomeration areas formed, and Ta-pieh Mountain became an area mixed low-high types with high-low types. In the Huang-Huai-Hai Plain region, there are mainly high-low type and low-high type mixes. The most distributed areas are Pu yang, Kaifeng, and Shangqiu city. Due to the limitation of topography, the LISA of distribution shows that TVs and RTCVs cluster in mountainous and hilly areas, and patterns of villages tend to be random and scattered in the plain area. The spatial distribution of TVs and RTCVs is significantly influenced by the natural environment, the level of economic development, and social conditions**“*. In this study, we identified the factors that affected the distribution of TVs and RTCVs. Then, 9 factors were chosen, including 4 natural environmental factors and 5 socioeconomic factors. Finally, the spatial distribution characteristics of the villages were analyzed by mathemati- cal statistics. The natural environmental factors were elevation, slope, topographic relief, and distance from the river. The socioeconomic factors were road network density, the population density of county and city (Popula- tion Data from the Seventh Chinese Census), per capita GDP in the county and city, distance from the county and city, and distance from the A-level scenic spots. The results were as follows: Elevation and topography. The geographic environment is one of the important factors affecting the distribution of villages, which not only provides development space for villages but also restricts the spatial lay- out of villages. Based on QGIS 3.30, the reclassification function was used to divide the raster map of the DEM from Henan Province into nine elevation bands: — 135 to 100, 100-202, 202-336, 336-495, 495-618, 618-892, 892-1125, 1125-1410, and 1410-2387; five slope ranges: 0-15, 15-30, 30-45, 45-60, and 60-75; and six topo- graphic undulating height ranges: 0-15, 15-30, 30-45, 45-60, 60-75, and>75. Mathematical statistical analysis methods were used to count the number of villages in each interval (Table 1). The results indicated that the three types of villages showed the same distribution pattern: Relationship with rivers. Water has been the source of life since the earliest human civilization was born along the river. In early agricultural society, people took the water source as an important reference condition for village site selection. In modern society, the river system is also an indispensable tourism resource. In this study, the rivers were abstracted into a series of geographical line elements, and parallel strip polygons were set up at 1 km, 3 km, 5 km, 7 km, 9 km, and>9 km from the line element as the central axis. As shown in Fig. 5b, 30.87% of TVs, 33.76% of RTCVs, and 33.69% of CVs were distributed within 3 km of the river. The location selection of rivers was crucial to not only the formation of TVs but also the development of RTCVs and CVs. In addition, another interesting phenomenon was found: most villages were distributed in the intervals of >9 km, account- ing for 26.89%, 22.19%, and 27.65%, and the intervals of 1-3 km followed, accounting for 17.17%, 20.38%, and 24.46%.",
    "According to the relevant literature review, the reason might be that Henan is the only province that crosses the Yellow River, Haihe River, Huaihe River, and Yangtze River systems in China. There are many rivers, and the flat terrain is fertile soil in this region, benefiting the development of agriculture and forming early human settlements. However, with human activities, the soil erosion of the Loess Plateau in the middle reaches of the Yellow River is serious and leads to serious flooding and frequent dike diversion’’. As a result, low-altitude plain areas, such as Puyang, Shangqiu, Kaifeng, Zhoukou, and other areas, were affected by floods, which made people intentionally homeless. Therefore, ancient villages near rivers were not suitable for preservation, and most human settlements were far from rivers. Central county or city and road traffic. Thiinen developed the theory of agricultural location and believed that geographical location had important guiding significance for agricultural production layout®. In modern society, the road traffic network is closely related to the regional economic development level and has become the booster for the transformation of traditional villages into modern villages*'. In addition, road traf- fic is the channel between the tourism destination and the tourism source area™’. In view of the above, without regard to the other obstacles, the main highway buffer zone was established using radii of 5 km, 10 km, 15 km, 20 km, 25 km, 30 km, 35 km, and 40 km and provided spatial overlay analysis for the villages and buffer zones. The road network density within the region was calculated by kernel density valuation. Then, spatial overlay analysis was used to superimpose the correlation between road network density and the distribution of villages. The specific results are shown in Fig. 6. As shown in Fig. 6a, villages were mainly distributed in the 1 h highway traffic circle, concentrated 10-20 km away from the central countries and cities, which was beneficial for people to carry out tourism and leisure activities. The number of villages in each interval showed a trend of rising first and then decreasing significantly. The number of TVs peaked in the range of 15-20 km and then decreased step by step. However, RTCVs were slightly better than TVs, whose number peaked in the range of 10-15 km and then declined stage by stage. The peak of the number of CVs moved to the right, reached 20-25 km, and then declined. According to the above findings, the government and planners can formulate relevant strategies to promote the coordinated development of rural tourism and traditional villages and revitalize traditional villages in this range. In Fig. 6b, the number villages gradually decreased with the increasing kernel density of the road network, and more than 60% were distributed in the low density of the road network. The peaks of TVs, RTCVs, and CVs were 21.53-45.43 and then decreased gradually. The Chinese government continues to optimize the regional road network to solve the ‘last kilometer’ problem in the countryside. Population and economy. As shown in the pictures, the TVs and RTCVs were mainly distributed in the interval of fewer than 944 people per 1000 square meters (Fig. 7a). The numbers of TV and RTCV reached peak values of 690-944 and then were 86-244 and 541-690, respectively. The numbers of TV and RTCV were the lowest in the interval of 244-409, approximately 10% and 5%, respectively. In terms of per capita GDP (Fig. 7b), the distribution quantity of the two types of villages was totally scattered. The number of villages distributed in each interval was generally low, less than 15%. The problem was that the abnormal value of village number dis- tribution was concentrated in the range of 35,771-42,476, and the quantity percentage was similar, accounting for approximately 28%, whose reasons need to be further explored. All above, the distribution of TVs and RTCVs had a certain synchronization in population and economy. Areas with higher per capita GDP or population generally had fewer TVs and RTCVs, which meant that the distribution of TVs and RTCVs had obvious characteristics of economic marginalization. The unification and coordination of the cultural and economic values of traditional villages played a vital role in the sustainable development of traditional villages*’. Therefore, local governments should prosecute their duties effectively, develop relevant preferential treatment strategies, organically combine the protection of traditional village culture with regional economic development and poverty alleviation, attract young people to return to their hometowns to start businesses, and increase the speed of capital return. Maximize the cultural vitality and development potential of traditional villages.",
    "Scenic spot resources. ‘Tourism resources are the material support of space competition in tourism regions™. A-level and above scenic spots not only have rich tourism resources and tourism attractions but also support the development of rural tourism areas in China. Their spatial distribution affects the spatial distribu- tion of rural tourism areas”. Relying on favorable terrain and profound cultural deposits, there were 15 5A scenic spots, 190 4A scenic spots, 271 3A scenic spots, 103 2A scenic spots, and 1 A scenic spot, with a total of 580 A-level or above scenic spots in Henan Province. The scenic spots were abstracted into a series of geographical points as the center, and the buffer was con- structed as radii of 5 km, 10 km, 20 km, 30 km, and 40 km for the spatial overlay analysis. As Fig. 8 shows, the spatial distribution of TVs and RTCVs had the typical characteristics of depending on scenic spots; the farther the distance from scenic spots, the fewer the number of villages. In addition, most of the scenic spots were in the mountains and rivers, which coincided with the distribution area of traditional villages. Among natural factors, different geographic carriers and regional spaces affect or restrict human activities”. Relevant studies have also shown that the spatial distribution of TVs and RTCVs was negatively correlated with altitude and elevation’**'. However, as shown in Fig. 5a, the percentage of traditional villages peaked in the elevation range of 100-202, indicating that in Henan, the elevation has a nonlinear relationship with the number of traditional villages, and it is not that the lower the altitude is, the more suitable it is for the development of traditional villages”’. Historically, the eastern plain of Henan Province has been disturbed by the bursting of the Yellow River floods for a long time (there were 42 floods between 1901 and 1948 alone*’). Thus, compared with the conclusion that most traditional villages are distributed along the river**°°, the spatial distribution of TVs in Henan Province should be analyzed specifically due to natural factors. Relatively speaking, as the product of modernization, the potential value of RTCVs was more likely to be stimulated by low-altitude plain areas and appropriate river distances. For socioeconomic factors, backward economic and transportation conditions provide a favorable envi- ronment for the protection of TVs”. In contrast, an increase in income may cause conflicts of interest and an imbalance in “rights relations’, which will affect rural resources and further lead to a lack of “rurality” and hinder the development of rural tourism”. Thus, the distribution of TVs and RTCVs had obvious characteristics of eco- nomic marginalization. Furthermore, the scenic spots had a certain radiation effect on the surrounding area. The famous case was the symbiotic development between the ancient villages of Hui Zhou and Huangshan Mountain. According to a survey, 67.1% of tourists visited the Huangshan Scenic Area or plan to visit the Huangshan Scenic Area before visiting Xidi village”. Therefore, the coordinated development of rural tourism regions would be promoted through the unified and indivisible tourist destination image established in the minds of tourists by rational planning of the tourist routes of villages and scenic spots. spatial type villages lages. The symbiotic model is the way symbiotic units interact and is also the combination of the symbiotic organizational model with the behavior pattern’. According to the degree of organization, symbiosis can be divided into four models: point symbiosis, intermittent symbiosis, continuous symbiosis and integrated symbio- sis. According to the behavior model, it can be divided into four models: parasitic, partial symbiosis, asymmetry and symmetric reciprocal symbiosis. In this part, the spatial distribution structure with the integrated and mutu- ally beneficial symbiotic model between TVs and RTCVs could be classified into 4 types according to the spatial pattern characteristics of each geographical region (Fig. 9): (1) natural attractions as the center, RTCVs as the nodes and activation of the TVs, (2) multicore central RTCV place distribution mode, (3) integrated corridor of RTCVs and TVs, and (4) central city distribution mode. Thus, the natural attractions were taken as the center to make RTCVs the nodes under the mountain natural attractions to influence several TVs on the plains. However, due to terrain obstructions and limits, RTCVs have difficulty affecting traditional villages at the depths of mountains. The patterns of village distribution presented as an elliptical circle, where TVs radially surrounded the RTCVs. This structure was suitable for mountainous and hilly areas with complex terrain (Fig. 9a).",
    "This structure was common in the low elevation area of the plain (Fig. 9b). The spatial distribution of rural settlements is usually dispersed on plains or in low-altitude hilly regions'®“*. In these areas, two or more RTCVs combine to form a multicore center to integrate their market resources for TVs. Owing to ancient residential buildings, the natural environment, human activities and relics, unique cultural con- notations, and external expression with regional style and art in traditional villages, the comprehensive landscape complex fed tourism feature villages and avoided RTCVs with ‘thousands of villages with the same features. As Fig. 6 shows, most of the RTCVs and TVs were distributed in low traffic network density areas. RTCV and TV locations and transportation advantages should be used to form a spatial pattern along the axes of roads. Central cities or class A scenic spots were located in the center of the distribution pattern, where TVs and RTCVs were distributed along the axes of roads to form an integrated corridor. The RTCVs formed the connecting link in these corridors, where they could reach the maximum service radius (Fig. 9c). Central city distribution mode As shown in Fig. 6, the distribution of rural settlements was intensive around cities. The number of RTCVs was maximum in the range of 10-15 km away from the cities. According to central place theory, RICVs core service areas around the city were established, while the spatial organization structure of cities, RTCVs, and TVs should be optimized and reorganized (Fig. 9d). The city center provided balanced basic services to the surrounding TVs through RTCVs. RTCVs and TVs could receive all kinds of tourists from cities and vice versa, which could achieve win—win results. teristic villages. China has a long history of farming-reading culture. Thus, traditional villages took shape very early. They are rural settlements spontaneously formed in the midst of long-term interactions between mankind and nature™. With the rapid process of economic and social development and urbanization, the sur- vival and development of traditional villages have been restricted and challenged. However, with the proposal of China's traditional village protection policy and the implementation of the rural revitalization strategy, tradi- tional villages have been reborn and revitalized by relying on unique cultural and humanistic values. At the same time, rural tourism is the product of the modern economy, which originated in the Industrial Revolution and flourished by taking advantage of unique natural conditions. Although constrained by social conditions such as the economy and transportation, it still develops steadily with the support of national policies. In summary, the key impact mechanism of the spatial pattern of traditional villages and tourist villages in Henan Province can be refined into 3 categories: basic bearing mechanism, interventional restraint mechanism, and catalytic growth promoting mechanism. The formation and development of the spatial pattern of traditional villages and tourist villages was the result of the joint action and interaction of three driving mechanisms. With the development of the social economy, rural tourism has become an important way to promote the development of traditional villages. In this paper, traditional villages and rural tourism characteristic villages in Henan Province, China, were taken as the research object. GIS analysis methods were used to identify the spatial distribution between TVs and RTCVs. The results show the following: First, the spatial distributions of TVs and RTCVs were similar in Henan Province. They were mainly distributed in three high-density clusters where the terrain was dominated by mountainous and hilly areas: the administrative junction of Hebi, Xinxiang, and Anyang cities in northern Henan Province, the junction area of Zhengzhou, Pingdingshan, and Xuchang cities in the midland of Henan Province, and the southern area of Xinyang in southern Henan Province. Second, the city with the largest number of tourism feature villages and traditional villages was Pingdingshan, followed by Xinyang and Luoyang. These cities had abundant tourism resources and numerous historical monuments in common. Third, the spatial correlation relationship between the traditional village density index and the tourism feature village density index was obvious at the township level. Thus, the spatial distribution of village correlations was divided into 5 regions: Taihang-Wangwu Mountain village clustered area, mountainous and hilly village clustered area in western Henan Province, Nanyang Basin village istribution area, Tongbai-Ta-pieh Mountain village distribution area, and random distribution of villages in the Hang-Huai-Hai Plain.",
    "Then, based on the driving factor correlation analysis and mat typical mutually beneficial and symbiotic spatial structures betwe a geographical perspective. They were (1) natural attractions as th TVs, (2) multicore central RTCV place distribution mode, (3) the (4) central city distribution mode. ematical statistics of TVs and RTCVs, four en TVs and RTCVs were summarized from e center, RTCVs as the nodes to activate the integrated corridor of RTCVs and TVs, and Finally, combining natural, economic and social factors, the s atial pattern formation mechanism of TVs and RTCVs was discussed based on three driving mechanisms: the basic bearing mechanism, the intervention constraint mechanism, and the catalytic growth promoting mechanisms. All data generated or analysed during this study are included in t! information files]. is published article [and its supplementary"
]