[
    "The development of new quality productive forces provides an innovative pathway for China’s high- quality agricultural development and the construction of an agricultural powerhouse. Utilizing panel data from 18 prefecture-level cities in Henan Province, China (2001-2021), this study systematically examines the impact mechanisms and spatial heterogeneity characteristics of new quality productive forces on agricultural green production efficiency through fixed-effects models and threshold regression approaches. The findings indicate that new quality productive forces exerts a significant positive driving effect on agricultural green production efficiency, with conclusions remaining robust across multiple robustness tests. Mechanism analysis reveals that technological innovation capacity plays a substantial mediating role in this relationship. Regional heterogeneity tests demonstrate pronounced promotional effects in Northern Henan and Western Henan, whereas impacts on Eastern Henan and Central Henan lack statistical significance. Threshold models further identify nonlinear enhancement characteristics of the promotional effect when agricultural machinery input intensity crosses specific thresholds, with dual-threshold effects observed. Based on this, some suggestions were put forward to improve the ability of scientific and technological innovation and promote the development of agricultural green environmental protection. Global climate change has emerged as one of the most severe challenges confronting human society. The excessive consumption of fossil fuels and irrational utilization of natural resources have driven a continuous rise in carbon emissions, directly threatening ecosystem stability and sustainable development!. As the largest developing country and carbon emitter worldwide, China faces dual pressures of economic growth and environmental governance. Since the reform and opening-up, China’s agricultural economy has achieved steady growth, with continuous optimization of industrial structure and increasing grain production. However, traditional extensive agriculture’s over-reliance on chemical inputs such as fertilizers and pesticides has led to ecological issues including soil degradation and environmental pollution. These issues not only jeopardize the long-term development of agriculture but also impose severe impacts on human health and ecological balance. Consequently, transforming agricultural production paradigms and enhancing green productivity in agriculture have become urgent imperatives. In recent years, the concept of green agriculture has been gaining increasing attention, aiming to achieve a win-win situation for both economic and ecological benefits through sustainable production methods. In February 2025, the Central No. 1 Document first introduced the concept of “Agricultural new quality productive forces,’ which represents the specific application of the new quality productive forces concept in the agricultural sector. Agricultural new quality productive forces aim to drive the sector toward a green, efficient and sustainable direction. As a major grain-producing region and a national demonstration zone for agricultural modernization, Henan Province achieved a total grain output of 67,193,500 metric tons in 2024, marking a 1.4% year-on-year increase and maintaining production above 65,000,000 metric tons for the eighth consecutive year. However, the use of chemical fertilizer per unit of cultivated land is still higher than the national average, and the growth rate of agricultural green total factor productivity is still lower than the national level. Therefore, advancing the green transformation of agriculture and developing modern agriculture based on local conditions are particularly important. It is imperative to enhance the efficiency of green agricultural production while protecting the ecological environment, as this is an essential requirement for achieving high-quality agricultural development. Global warming has seriously affected agricultural production. Reducing carbon emissions is a key measure Global warming has seriously affected agricultural production. Reducing carbon emissions is a key measure to mitigate climate change. Renewable energy and green growth can jointly promote carbon reduction”. Under Business School, Xinyang Normal University, Xinyang 464000, China. *Dabie Mountain Economic and Social Development Research Center, Xinyang Normal University, Xinyang, China. “email: leixiankai@xynu.edu.cn the dual drivers of China's “dual carbon” goals (carbon peaking by 2030 and carbon neutrality before 2060) and its high-quality agricultural development strategy, new quality productive forces are emerging as a pivotal driver in transforming agricultural production models. The 2025 Government Work Report emphasized developing new quality productive forces through location-specific approaches to accelerate the establishment of a modern industrial system. New quality productive forces represent a new form of productivity shaped by technological progress, industrial transformation, and economic and social development. Their core elements include technological innovation, the application of digital technologies, the promotion of green technologies, and industrial convergence. In essence, they constitute an advanced form of green productive forces. Its essence represents an advanced form of green productivity that prioritizes not only production efficiency but also rational resource utilization and ecological conservation. This paper aims to examine how new quality productive forces affect green production efficiency in agriculture and the variations of this impact under different regional contexts. By analyzing the mediating role of technological innovation, it offers theoretical foundations for advancing agricultural productivity green transformation in a region-specific manner. Details are shown in Fig. 1.",
    "as well as low-carbon and circular industrial models are crucial tasks for expediting the building of China into an agricultural powerhouse. This also represents an essential requirement for promoting the harmonious coexistence between humanity and nature. Under this context, the academic community has produced a relatively abundant body of research on agricultural green production efficiency, primarily focusing on three aspects. First, different methodologies have been employed to measure agricultural green production efficiency. In early studies, most scholars adopted the stochastic frontier analysis (SFA)°. However, the SFA method overlooked the undesirable outputs caused by environmental factors during measurement. Data envelopment analysis (DEA), proposed by Charnes, is a non-parametric statistical estimation method* capable of handling multiple input and output variables simultaneously’. The slacks-based measure SBM model introduced by Tone (2001) partially addressed the slack variable issues in traditional DEA models®, but still faced challenges with decision-making units exhibiting efficiency scores of 1. Consequently, Tone further refined the model. The improved super-efficiency SBM model not only resolves slack variable problems but also incorporates undesirable outputs, emerging as a crucial methodology for calculating green production efficiency’. Second, researchers have analyzed the spatiotemporal evolution of agricultural green production efficiency across different regions. Most studies have focused on the national level, while some scholars have investigated key economic development zones such as the Yangtze River Economic Belt*, Huaihe River Ecological Economic Belt’, Yellow River Basin'®, and major grain-producing regions!!. Nevertheless, there remains limited exploration of internal regional disparities and variation patterns within these areas. Third, analyzing the impact of specific factors on agricultural green production efficiency. Some scholars have studied the impact of the digital economy on agricultural green total factor productivity (GTFP), suggesting that the development of the digital economy can enhance agricultural GTFP. However, rural residents’ income may constrain the development of agricultural GTFP!*. Other researchers have explored the impact of human capital structure changes caused by rural aging on agricultural green total factor productivity from the perspective of population aging!’, Ge et al. (2023) focused on the effect of urbanization development on agricultural green production efficiency, discovering that neighboring cities’ urbanization progress exerts positive spillover effects on local agricultural green production efficiency'*. While existing studies have examined various factors affecting agricultural green production efficiency, there remains a lack of differential analysis regarding the heterogeneous effects of these factors under different regional characteristics. Under the background of rapid global economic development and rapid technological change, General Secretary Xi Jinping put forward the concept of “New quality productive forces”. Scholarly research on new quality productive forces has progressively intensified, primarily unfolding across three dimensions. First, studies focus on conceptualizing its intrinsic characteristics and practical pathways. Representing a qualitative leap in productive forces where technological innovation assumes dominant roles, new quality productive forces is characterized by new technologies, new economic forms, and novel industrial formats. Distinct from traditional high-input, high-energy consumption models, it emphasizes factor quality enhancement and aligns with high-quality development imperatives!-!”. Developing new quality productive forces is a crucial pathway to achieving Chinese modernization. It is imperative to accelerate the realization of greater self-reliance and strength in science and technology and to unblock channels for technology transfer. Steering the development of new quality productive forces with digitalization and smart technologies will facilitate the efficient flow of production factors'®. This requires leveraging local comparative advantages to upgrade traditional industries, cultivate strategic emerging sectors, and foster sci-tech-industry synergies”. The second aspect is measuring the level of new quality productive forces. Mainstream measurement methods include two major categories. One category is based on the perspective of productive forces and production relations. It establishes an evaluation index system from three dimensions: laborers, means of labor, and objects of labor?°. This method measures the level of new quality productive forces at the national level. The other category is based on the theoretical connotation of new quality productive forces. It constructs an evaluation index system for new quality productive forces development. This system covers four dimensions: new quality talent resources, new quality science and technology, new quality industrial forms, and new quality production modes”!. Third, study the enabling role of new quality productive forces. For example, it drives technological advances which create new products and services. This helps promote high-quality economic development”. It fosters advanced industries. This benefits job creation and advances common prosperity”. It is inherently green productive forces. Its green and efficient concepts spur new agricultural production models. This facilitates the green transformation of agriculture. The current academic community has produced a wealth of research findings on new quality productive forces, but there still exist some gaps and deficiencies. These are mainly reflected in the following aspects: Firstly, existing studies predominantly focus on macro theoretical frameworks, lacking targeted analysis in the agricultural sector, with particularly limited research on practical pathways that integrate agricultural green development. Secondly, there is insufficient regional adaptability in evaluation indicator systems. While current evaluation frameworks are primarily constructed at the national level, they inadequately consider the unique characteristics of major agricultural provinces, making it difficult to accurately reflect regional disparities and industrial variations.",
    "Currently, there is limited research green production efficiency, with mos forces in agriculture can promote t on the relationship between new quality productive forces and agricultural t studies being theoretical. Guo and Han found that new quality productive e transition of agricultural green total factor productivity by driving the upgrading of agricultural industrial structure and deepening industrial agglomeration, thereby actively enhancing agricultural green total factor productivity**. From the perspective of the entire industry chain, Zhao and Du discussed the challeng: agricultural green transformation. Thi systems for agricultural green develo) es and pathways through which new quality productive forces influence ey emphasized the need to continuously optimize supporting institutional ment and facilitate the research and transformation of green technology achievements, providing insights for achieving agricultural modernization”®. Xu et al. argued that new quality productive forces possess green characteristics such as efficient resource utilization and environmentally harmonious symbiosis, suggesting that technological progress can improve green development levels”°. In conclusion, existing literature has conducted in-depth explorations on agricultural green production efficiency and new quality productive forces, yielding fruitful results. Building upon prior research, this study employs panel data from 18 prefecture-level cities in Henan Province (2001-2021) to construct a comprehensive evaluation index system and investigate the impact of new quality productive forces on agricultural green production efficiency. The main contributions are as follows: First, by incorporating carbon emissions into the agricultural green production efficiency index system and utilizing the Super-SBM model to measure regional efficiency levels. This research systematically analyzes municipal-level panel data to reveal the intrinsic logic and spatial differentiation patterns of new quality productivity-driven agricultural green transformation. Second, it verifies the mediating effect of technological innovation between new quality productive forces and agricultural green production efficiency at the prefecture-level city scale. Additionally, apply the threshold effect model to explore potential nonlinear impacts, reveal the threshold effect of agricultural machinery intensity, and provide basis for green agricultural machinery policies. Third, integrating the “Dual Carbon Goals” with agricultural green transformation, this work expands the application scenarios of productivity theory in agriculture. Based on empirical findings, it proposes differentiated development pathways for new quality productive forces across various regions in Henan Province to enhance agricultural green production efficiency, offering targeted policy recommendations for regional agricultural modernization. New Quality Productive Forces is a recent political-economic concept proposed in China. Its essence is leaps in workers, tools, objects of labor, and their optimal integration. It uses “New Quality” as an adjective, but in essence, it remains a form of productivity. Driven primarily by technological innovation, new quality productive forces integrates novel technologies, economic models, and business formats to achieve green, efficient, and sustainable transitions in productivity. Theoretically, this concept aligns with international frameworks such as eco-innovation, green growth, and Total Factor Productivity (TFP) enhancement. All emphasize synergistic development between economic growth and ecological preservation through technological advancement. Green innovation aims to enhance environmental management efficiency for ecological protection”. The OECD's “green growth” framework emphasizes improving resource efficiency through tec closely with the core tenets of new quality productive forces—specifically, tools and ecological expansion of labor objects. UNEP’s “eco-innovation” t nological advancement. This aligns intelligent upgrading of production eory focuses on reducing ecological footprints via technological and institutional innovation”®. This resonates with new quality productive forces mechanism of technology-driven green production. Furthermore, new quality productive forces emphasis on Total Factor Productivity (TEP) echoes the neoclassical growth theory”’, which positions technological progress as the engine of economic growth. However, new quality productive forces intensifies this logic by prioritizing New quality productive forces promote the green development of agriculture through three aspects: upgrading workers’ skills, smart transformation of the means of production, and expansion and optimization of the subjects of labor. Firstly, regarding laborers, new-type skilled workers serve as the dominant force in agricultural development. On one hand, new quality productive forces require workers to have higher caliber and more skills. New-type workers apply advanced agricultural technologies and management models. They manage all aspects of agricultural production. For example, automated irrigation systems and precision fertilization techniques are used. These enhance the speed and accuracy of planting. This thereby boosts agricultural productivity*°. On the other hand, the development of new quality productive forces drives workers to enhance their cognitive skills. This shifts production methods toward green models. Instead of pursuing short-term economic gains, it promotes rational use of natural resources for long-term benefits. This thereby steers agriculture toward green and sustainable development*!. Secondly, At the level of the means of labor, new quality productive forces drive the intelligent and green transformation of agricultural tools. Digital agricultural management technologies and big data development enable precise monitoring of crop growth information. This achieves precision fertilization, irrigation, and pest control, improving resource efficiency. The use of green agricultural products like new fertilizers and pesticides directly reduces non-point source pollution in agriculture. Utilizing clean energy cuts dependence on fossil fuels. It lowers agricultural carbon emissions and provides strong support for sustainable agricultural development. Finally, at the level of labor objects, new quality productive forces expand the scope of labor objects. They include digital resources, ecological resources, and scientific materials. This injects new vitality into productive forces development. Through biotechnology and other means, they improve the quality of crop varieties and increase crop yields. Simultaneously, they reduce the demand for fertilizers and pesticides and lower environmental impact. They enhance the resilience of agricultural systems and boost green agricultural productivity. Building on this, this paper puts forward the following hypothesis 1: The continuous advancement of science and technology is profoundly transforming China’ agricultural landscape, enriching farmers and revitalizing rural areas. Technological innovation serves as the primary driver for guiding agriculture toward green production. It can propel the transformation and upgrading of the agricultural sector, making its industrial structure more eco-friendly. While achieving high-quality development in the agricultural economy, it also underpins the building of a strong agricultural nation. Enhancing technological innovation capabilities significantly improves agricultural green production efficiency. Firstly, technological innovation provides critical technical support for green agricultural development*’. Technological innovation empowers agricultural production by enabling the digital and intelligent transformation of agricultural machinery through remote sensing, IoT, and drones. Precision agriculture technologies provide real-time monitoring of soil conditions and crop growth, enabling farmers to access timely information for dynamic management adjustments and reduced resource waste. Additionally, green pest control technologies leverage natural predators to replace pesticides, lowering chemical residue risks and ensuring greener, healthier agricultural products. Advanced biotechnology further cultivates high-yield, disease-resistant, and nutrient-rich crop varieties. Secondly, technological innovation strengthens agricultural ecosystem resilience. Low-carbon and energy-saving technologies effectively reduce greenhouse gas emissions and ecological pollution™. Through ecological restoration and systematic management technologies, damaged ecosystems can be effectively restored, enhancing their self-recovery capacity, stability, and resilience. Moreover, technological innovation helps farmers adapt to climate change challenges. Utilizing meteorological disaster early-warning systems can improve agricultural risk resilience, reduce disaster impacts, and ensure food security. Finally, technological innovation drives the upgrading of the agricultural industrial structure. Using technological innovation to propel industrial innovation, it promotes the digital and green transformation of the entire agricultural industry chain. It overcomes constraints of time and space, broadening the scope and depth of industrial division of labor and collaboration. This enhances the level of industrial chain coordination, fosters the integrated development of primary, secondary, and tertiary industries, and advances the transformation and upgrading of the agricultural industrial structure*®. In summary, enhancing technological innovation capabilities has manifold impacts on agricultural green production efficiency. It not only provides technological support for the green transformation of agriculture and strengthens ecosystem resilience, but also promotes the sustainable development of the agricultural economy, optimizes resource allocation, and advances the formation of green agricultural development models.",
    "The new quality productive forces can drive scientific and technological innovation to empower agricultural green production. The “Quality” of new quality productive forces manifests in achieving high-level sci-tech self-reliance, using original and disruptive innovations to elevate productive forces to new paradigms. On the one hand, new quality productive forces drive the iteration and upgrading of agricultural production technology through technological innovation. For example, smart agricultural machinery, biotechnology breeding, and drone technology improve the levels of automation, intelligence, and precision in agricultural production. Thus, they enhance agricultural production efficiency and resource utilization efficiency, promoting green agricultural production. It emphasizes the deep integration of technological and industrial innovation, accelerating the transformation of scientific achievements through digital-intelligent and green technologies to revolutionize traditional agricultural models*®. On the other hand, science and technology are the primary productive force, and innovation is the primary driving force. Technological innovation serves as a robust foundation for the green transformation of agricultural production methods. The transformation of agricultural production practices is a critical factor influencing agricultural productivity. New quality productive forces, empowered by digital technologies, drive innovative allocation of agricultural production factors, giving rise to new models of agricultural production and management, thereby facilitating the upgrading of industrial structures. Technological innovation has alleviated the conflict between resource scarcity and agricultural production. It has shifted agricultural practices from the traditional model of high pollution, high consumption, and low efficiency to a new model characterized by greening, modernization, and intensification, thereby paving the way for advancing the green transformation of agriculture*’. Therefore, new quality productive forces can enable technological innovation to lead the transformation of agricultural production technologies and optimize the allocation of agricultural resources. By enhancing technological innovation capabilities and transforming agricultural production methods, they improve the efficiency of mechanical operations. Ultimately, this achieves green, low-carbon, and circular development in agriculture, promoting environmentally friendly agricultural production. Building on this, this paper puts forward the following hypothesis 2: Hypothesis 2 Technological innovation plays a mediating role in the impact of new quality productive forces on agricultural green production efficiency. To investigate the impact of new quality productive forces on agricultural green production efficiency, this paper constructs the following baseline regression model: In model (1), Agpeiz is the dependent variable, representing the agricultural green production efficiency value of region i in the t year, Nqpfit is the explanatory variable, indicating the level of new quality productive forces in region i in the t year, Controls, denote a series of control variables that may influence agricultural green production efficiency; ao, @1, 2 represent the intercept term, the coefficient of the explanatory variable, and the coefficients of the control variables, respectively; 6; and ju; denote individual fixed effects and time fixed effects, while ei: represents the random disturbance term. To explore whether technological innovation plays a mediating role in the process through which new quality productive forces affect agricultural green production efficiency, the following model is constructed: In this context, Jnnov;, represents technological innovation. Model (2) primarily examines the impact of new quality productive forces on technological innovation, while Model (3) focuses on the combined effects of new quality productive forces and technology innovation on agricultural green production efficiency. Together with model (1), these models can be used to test the mediating effect of technological innovation. If the coefficient (1 of Nap fit in model (2) is statistically significant and the coefficient 42 of Innovj; in model (3) is also significant, it indicates the presence of a mediating effect. This suggests that new quality productive forces can influence agricultural green production efficiency by enhancing technological innovation capabilities. To explore whether there is a threshold effect in the impact mechanism of agricultural machinery input on agricultural green production efficiency, the following model is constructed. In model (4), defining z as the threshold variable measuring agricultural machinery input intensity, i () is the representational function, and the value can be 0 or 1. If it is true in parentheses, i = 1, otherwise i = 0. This paper employs a Super-SBM model incorporating undesirable outputs to measure the agricultural green production efficiency of prefecture-level cities in Henan Province. The agricultural carbon emissions, as an undesirable output, are calculated using the carbon emission coefficient method proposed by Tian et al. (2014)**. Six measurement indicators are selected: chemical fertilizers, pesticides, agricultural plastic film, agricultural diesel, tillage, and agricultural irrigation. The calculation formula involves summing the products of each carbon emission source's quantity and its corresponding carbon emission coefficient. The specific carbon emission sources and their coefficient values are detailed in Table 2.",
    "Suppose the i-th region has n inputs and r outputs (where r, represents desirable outputs and r, denotes undesirable outputs, with r= r, + r,) in agricultural production during the t-th year. The relevant input-output indicators are shown in Table 3. The Super-SBM model incorporating undesirable outputs is constructed as follows: where 7 denotes the green production efficiency value; m is the number of decision-making units (DMUs); n, r,, r, represent the quantities of input indicators, desirable output indicators, and undesirable output indicators, respectively; z, y°, y@ indicate the slack variables for inputs, desirable outputs, and undesirable outputs, respectively; and A is the weight vector. New quality productive forces represent an advanced paradigm of productivity characterized by technology- driven optimization of production factors, enabling green, efficient, and sustainable development. Drawing on existing research*®, we constructed an indicator system for new quality productive forces based on three dimensions—laborers, objects of labor, and means of labor—and measured their development level using the entropy method, as detailed in Table 4. To mitigate the potential impact of omitted variables on regression results, and drawing on relevant literature’), this study selects the following control variables: (1) Fiscal support for agriculture (Fiscal), measured by the proportion of agricultural fiscal expenditure to total fiscal expenditure. (2) Agricultural production structure (Ags), expressed as the ratio of grain sown area to total crop sown area. (3) Agricultural industry agglomeration (Aia), reflected by the proportion of gross output value of agriculture, forestry, animal husbandry, and fishery to regional GDP. (4) Urbanization level (Urban), represented by the percentage of urban population in tota regional population. (5) Openness level (Open), gauged through the ratio of foreign investment to regiona GDP. (6) Agricultural economic development level (Econ), quantified by the per capita gross output value of agriculture, forestry, animal husbandry, and fishery relative to rural population. (7) Industrialization level (Indus), measured by the share of secondary industry in regional gross output value. To investigate the underlying mechanism through which new quality production efficiency, this study incorporates a mediation effect mo as the mediating varial roductive forces affect agricultural green el. Technological innovation was selecte le, with the number of patent grants per 10,000 people employed as its proxy variable. To explore potential nonlinear relationships between new quality productive forces and agricultural green production efficiency, this study employs a threshold effect model. Agricultural machinery intensity was selecte: as the threshold variable, defined as the ratio of total agricultural machinery power to total crop sown area. Henan Province initiated its agricultural restructuring policy in 2001, and 2021 marked the initial phase of the 14th Five-Year Plan. Considering data availability, this study selects panel data from 18 prefecture-level cities in Henan Province from 2001 to 2021 as samples for empirical analysis, which can reflect the agricultura transformation cycle more completely. All selected data were obtained from the Henan Statistical Yearbook and the CEInet Statistics Database. Due to the absence of R&D expenditure and environmental protection expenditure data in the Henan Statistical Yearbook from 2001 to 2006, and considering that interpolation methods might introduce outliers, we adopted the average annual growth rate method to impute the missing data for those years. All other individual missing values were filled using linear interpolation. The descriptive statistical results of each variable are shown in Table 5. The maximum value and minimum. value of the explained variable agricultural green production efficiency are 1 and 0.3443, respectively. The maximum value and minimum value of the core explanatory variable new quality productive forces are 0.6624 and 0.0074, respectively. It shows that there are significant differences in agricultural green production efficiency and new quality productive forces between different cities. It can be seen from Table 5 that each variable has a certain degree of internal differences, especially the difference between the urbanization level and the level of agricultural economic development in the control variable, and the threshold variable agricultural machinery input intensity. According to the Hausman test results, this study adopts a fixed effects model to analyze the impact of new quality productive forces on agricultural green production efficiency. The baseline regression results are presented in Table 6. When incorporating all control variables and accounting for both time and individual fixed effects, the estimated coefficient of the core explanatory variable (New quality productive forces) shows a statistically significant positive relationship at the 1% level. This provides robust evidence supporting the productivity- Among the control variables, financial support for agriculture exhibits a negative correlation with agricultural green pro: luction efficiency. A possible explanation is that increasing the pro ortion of fiscal support for agriculture may incentivize farmers to use more chemical agricultural inputs, leading to higher agricultural carbon emissions and exacerbating ecol production factors—such as land, labor, green production. The urbanization level shows a significant negative evel. Accelerated urbanization may resul agricultural green roduction efficiency at the 1% logical burdens. The coefficient of agricul statistically significant and positive at the 5% level. Optimizing this structure enab! and capital—thereby enhancing resource-use efficiency and advancing tural production structure is es more rational allocation of correlation with agricultural It in a large outflow of rural labor to cities, reducing labor input in agricultural production. Additionally, the expansion of construction land during urbanization may decrease both the quantity and quality of arable land, furt! luction efficiency. The regression coefficient for agricultural economic development level is 0.178 esting that enhancing agricultural economic development significantly green pro and passes the test at the 1% level, sugg boosts agricultural green production eff agricultural ficiency. In contrast, industrialization leve' green production efficiency at the 1% significance level. On one hand, industrialization generates er undermining agricultural exerts a negative impact on solid waste that pollutes the environment and increases carbon emissions, thereby lowering efficiency. On the other han weakening resource allocation to agricul ultimately inhibiting improvements in efficiency. , rapid industrial development diverts substantial capital and techno ture. This results in insufficient inputs for green agricultural production, logy to the industrial sector, Using principal component analysis (PCA) to re-measure the level of new quality productive forces. The results in Column (1) of Table 7 show that the effect of new quality productive forces on agricultural green production efficiency remains significantly positive at the 1% level, indicating the robustness of the above tests.",
    "To mitigate bias in regression results caused by extreme values, this study applied 1% two-sided winsorization to all continuous variables. As shown in column (2) of Table 7, the direction and significance of the estimated coefficients remain consistent with the original regression results, with only minor fluctuations in coefficient magnitudes. This confirms the robustness of the baseline regression findings. Since the concept of new quality productive forces was introduced relatively recently, its impact on agricultural green production may take time to materialize. Therefore, we applied a one-period lag to nqp and re-estimated the regression model. The results, as shown in Column (3) of Table 7, indicate that even after accounting for lagged effects, the regression remains statistically significant. This further confirms the robustness of our research findings. At the beginning of 2020, the new crown pneumonia outbreak had a huge impact on the economy. To avoid distortions in research results caused by abnormal fluctuations in data during this period, the sample data from 2020 was excluded and the regression was rerun. Column (4) of Table 7 shows the regression results after exclusion. The coefficient of new quality productive forces remained statistically significant at the 1% level, and its sign remained consistent with the baseline regression results. Therefore, it can be considered that the exogenous impact of the new crown epidemic has not brought great deviation to the conclusion of this study. The imputation of missing data from 2001 to 2006 may affect data quality. To address this, we re-ran the regression using the original unimputed data, as shown in column (5) of Table 7. The direction and significance of the regression coefficients for new-quality productivity remain consistent with the benchmark results, indicating that data imputation did not significantly distort the regression outcomes. Endogeneity issues may arise from two potential sources. First, the possible reverse causality between new quality productive forces and agricultural green production efficiency. Secondly, endogenous bias caused by omitted variables. To address these concerns, we employed the instrumental variable (IV) approach by using the one-period lagged new quality productive forces as the instrument in a two-stage least squares (2SLS) regression. As shown in Table 7, column (6), the LM statistic p-values were all less than 0.1, rejecting the null hypothesis of underidentification. Furthermore, the Cragg-Donald Wald F-statistics exceeded the Stock-Yogo critical values at the 10% level, refuting the “weak instruments” hypothesis. These results confirm the validity of our instrument and indicate no significant weak instrument problem in the baseline regression. After accounting for endogeneity, the regression coefficient of new quality productive forces on agricultural green production efficiency remained statistically significant, demonstrating the robustness of our baseline findings. This study employs a mediating effect model to empirically analyze the mechanism through which new quality roductive forces influences agricultural green production efficiency. The regression results are presented in Table 8. Analysis of the data in column (2) shows that the coefficient of new quality productive forces is positive and statistically significant at the 1% level, indicating that new quality productive forces enhances technological Table 8. Mediating effect test results. *, ** and *** indicate significant at the 10%, 5% and 1% levels respectively. Table 10. Threshold effect test results. *, ** and *** indicate significant at the 10%, 5% and 1% levels respectively. innovation capabilities. Analysis of the data in column (3) reveals that the coefficient of technological innovation is significantly positive at the 1% level, demonstrating that technological innovation improves agricultural green production efficiency. In summary, these findings confirm that technological innovation plays a mediating role in the impact of new quality productive forces on agricultural green production efficiency, thereby validating Hypothesis 2. Due to variations in natural resources and agricultural development levels across different regions of Henan Province, the impact of new quality productive forces on agricultural green production efficiency may differ regionally. To further explore the regional heterogeneity of new quality productive forces influence on agricultural green production efficiency, this study divides Henan Province into five regions—Northern Henan, Southern Henan, Central Henan, Western Henan, and Eastern Henan—and conducts grouped regression analyses for each subregion. According to Table 9, the regression coefficients of new quality productive forces are significantly positive at the 1% level in Northern Henan and Western Henan, and at the 5% level in Southern Henan. In contrast, the coefficients for the Eastern Henan and Central Henan regions are statistically insignificant. This indicates that new quality productive forces can significantly enhance agricultural green production efficiency in Northern Henan and Western Henan, whereas it fails to exert a meaningful impact in Eastern Henan and Central Henan. The negative regression coefficient of new quality productive forces in Central Henan may be attributed to higher farmer incomes in this region, which potentially reinforces preference for retaining conventional farming practices rather than adopting green production technologies. Higher income might prioritize short-term economic gains over long-term benefits from green production, thereby suppressing the role of new quality productive forces in improving efficiency. In terms of coefficient magnitudes, the regression coefficient for the Western Henan region is the largest, followed by Northern Henan and Southern Henan. This indicates that new quality productive forces exerts the strongest effect on agricultural green production efficiency in Western Henan, while slightly weaker impacts in Northern Henan and Southern Henan.",
    "To explore whether there is a nonlinear relationship between new quality productive forces and agricultural green production efficiency. This study employed the bootstrap method with 300 replications to sequentially conduct single-threshold, double-threshold, and triple-threshold effect tests. As shown in Table 10, when using agricultural machinery input intensity as the threshold variable, the double-threshold test passed at the 5% significance level. Table 11 presents the regression results of the threshold effect between new quality productive forces and agricultural green production efficiency. When the agricultural machinery input intensity is below the first threshold value of 1.239, the impact of new quality productive forces on green production efficiency is significant at the 10% level, with a regression coefficient of 0.142. When agricultural machinery input intensity falls between the first threshold (1.239) and the second threshold (1.7385), the regression coefficient of new quality productive forces on green production efficiency shifts from positive to negative. When the technological innovation level exceeds the second threshold (1.7385), the regression coefficient of new quality productive forces rises to 2.606 but remains significantly negative at the 1% level. In summary, the impact of new quality productive forces on agricultural green production efficiency is not a simple linear relationship but exhibits a nonlinear dynamic. When the intensity of agricultural machinery input crosses the first threshold, the role of new quality productive forces shifts from promoting to inhibiting agricultural green production efficiency. This reversal may occur because the use of agricultural machinery typically relies on fossil fuels such as diesel and gasoline, which increase energy consumption and carbon emissions, thereby diminishing green production efficiency. As machinery input intensity continues to rise and surpasses the second threshold, two adverse effects emerge. First, it may lead to unreasonable resource allocation, where over- reliance on mechanization neglects critical production factors like green technologies and organic fertilizers, further weakening green efficiency. Second, large-scale mechanized farming can exacerbate soil degradation, reduce biodiversity, and intensify environmental pollution, causing ecosystem damage that ultimately lowers agricultural green production efficiency. Therefore, agricultural machinery input intensity must be maintained within an rational range, and machinery development strategies should be optimized. Accelerating the adoption of clean agricultural machinery (e.g., electric tractors) will maximize productivity gains while enhancing green production efficiency. This study, utilizing panel data from prefecture-level cities in Henan Province, China, investigates the impact mechanism and regional heterogeneity of new quality productive forces on agricultural green production efficiency. The findings reveal that new quality productive forces can significantly enhance agricultural green production efficiency through technological innovation; however, this effect is constrained by a double- threshold effect of agricultural machinery investment intensity and exhibits significant regional heterogeneity. The following analysis integrates international theoretical frameworks with regional characteristics. The positive driving effect of new quality productive forces on agricultural green production efficiency resonates with the international academic theory of “technology-driven sustainable productivity.’ For example, Sanyaolu and Sadowsk demonstrated in agricultural research that precision farming technologies, such as drone fertilization, can reduce fertilizer use while increasing crop yield*’. This confirms the core role of technological innovation in enhancing resource efficiency. This study further reveals that the key distinction of new quality productive forces from single-technology application lies in its systemic transformation of production factors. New quality productive forces fosters a synergistic “technology-ecology” enhancement pathway by upgrading labor skills, enabling intelligent means of labor, and expanding the scope of labor objects. Technological innovation acts as a partial mediator between new quality productive forces and agricultural green production efficiency. This indicates that new quality productive forces not only directly enhance agricultura green production efficiency, but also exert a positive indirect influence by strengthening technological innovation capabilities. This finding aligns with the view that technological innovation is a key factor in agricultural green transformation”. The technological progress and innovation driven by new quality productive forces—such as intelligent agricultural machinery and biotechnological breeding—improve agricultural production efficiency. Crucially, the conversion of granted patents into green technologies is a key process for boosting agricultura green production efficiency. However, the direct impact coefficient of technological innovation on agricultura green production efficiency (6 = 0.084) is comparatively smaller than the direct effect of new quality productive forces (6 = 0.406). This suggests the pathways extend beyond conventional technology transfer frameworks and require further refinement, consistent with the OECD’s theory that “green growth necessitates multi- dimensional coordination across technology, institutions, and industry.’ The observed mediation effect is partial, not complete, indicating other unidentified transmission mechanisms warrant further investigation.",
    "The effects of new quality productive forces exhibit significant regional variations, closely linked to local technological adoption capacity. In Northern Henan, a major grain-producing area with favorable natural conditions and over 85% agricultural mechanization, large-scale operations and leading enterprise clusters reduce new technology adoption costs. This mechanization-first approach aligns with research confirming mechanization as a prerequisite for technology adoption“. Western Henan (an eco-agriculture zone) leverages ecological resources to develop green and organic farming. There, new quality productive forces enhance both ecological value and production efficiency by expanding organic certification areas and increasing carbon sequestration capacity. This pathway resembles Buchanan's (2023) findings on eco-innovation driving sustainable agriculture in South Africa’’. In contrast, Eastern Henan, dominated by scattered smallholders with low agricultural agglomeration and lacking leading enterprises to drive innovation, faces barriers to the large- scale application required by new quality productive forces. This is consistent with Chi et al’s (2022) conclusion that land fragmentation reduces technology adoption efficiency*®. Central Henan has a diversified industrial structure with a higher proportion of secondary and tertiary sectors, diminishing agriculture’s economic role. Consequently, innovation resources favor industry, leading to insufficient technological supply in agriculture. Therefore, the impact of new quality productive forces on agricultural green production efficiency is not significant in Eastern and Central Henan. Compared to prior studies!*”’, this research focuses on Henan Province, providing an in-depth analysis of regional heterogeneity. We find that regional disparities in new quality productive forces are driven more by technological capacity than spatial proximity, highlighting the importance of context-specific policies and offering more targeted insights for developing differentiated strategies in major agricultural provinces of developing countries. The dual-threshold effect of agricultural machinery investment indicates that mechanization significantly enhances green production efficiency when the investment intensity is below 12,390 kW per thousand hectares, aligning with findings from Cui (2023) based on provincial Chinese data’’. However, once this threshold is exceeded, excessive mechanization inputs offset the positive impacts. This negative effect stems from the high carbon emissions and soil degradation associated with traditional diesel machinery, supporting Chi’s (2021) argument that appropriate mechanization promotes green agricultural development*. This study further reveals a “promote then inhibit” effect of mechanization, underscoring the critical importance of promoting green machinery technologies. The findings offer insights for agricultural machinery transition in major agricultural provinces of developing countries: solely pursuing machinery power growth may exacerbate environmental burdens, requiring coordinated efforts to advance the adoption of green agricultural machinery. Improving agricultural green production efficiency is not only an inherent requirement for high-quality agricultural development but also a critical initiative for achieving rural revitalization, ensuring national food security, and safeguarding ecological security. Based on data from 18 prefecture-level cities in Henan Province from 2001 to 2021, this study employs fixed effects models, mediation effects models, and threshold effects models to investigate the impact and mechanisms of new quality productive forces on agricultural green production efficiency. The findings are as follows. First, the development of new quality productive forces significantly enhances agricultural green production efficiency, and this conclusion remains robust after a series of rigorous tests. Second, new quality productive forces not only directly improves agricultural green production efficiency but also indirectly influences it by enhancing technological innovation capabilities, indicating that technological innovation plays a mediating role between new quality productive forces and agricultural green production efficiency. Third, Northern Henan and Southern Henan, as major rice-producing areas and high-quality wheat cultivation zones in the province, are characterized by abundant agricultural resources and relatively high mechanization levels. Central Henan, on the other hand, exhibits advanced agricultural modernization with a focus on high-efficiency and urban agriculture. Due to regional disparities in geographical conditions an resource endowments, the promoting effect of new quality productive forces on agricultural green production efficiency demonstrates spatial heterogeneity. Fourth, agricultural machinery input intensity exhibits a dua threshold effect in the relationship between new quality productive forces and agricultural green production efficiency. After crossing the first threshold value, the role of new quality productive forces shifts from promoting to inhibiting agricultural green production efficiency. Once the second threshold is surpassed, the inhibitory effect intensifies markedly. Based on these findings, this study proposes the following recommendations: To vigorously develop new quality productive forces and enhance their role in promoting green agricultural production efficiency, efforts should focus on three areas: talent development, technological innovation, an policy support. Firstly, enhance talent development. Reform the curricula and specialty structures of loca agricultural universities to cultivate professionals suited for new quality productive forces. Concurrently, attract external high-level talent through policy incentives such as housing subsidies, startup research funds, and tax incentives. Secondly, accelerate technological innovation. Increase R&D investment by provincial research institutions and enterprises in green agricultural technologies, prioritizing key areas that improve resource efficiency and reduce environmental pollution. Establish a robust agricultural technology innovation system, empowering enterprises as primary innovators to stimulate their vitality. Thirdly, strengthen policy support. The Henan provincial government should refine the policy framework supporting new quality productive forces and increase fiscal backing for agricultural technology R&D. Furthermore, expand financial institutions’ credit support for green agriculture projects, ensuring adequate funding for sustainable production.",
    "Furthermore, enhancing scientific and technological innovation capabilities is crucial for promoting sustainable agricultural development. First, the institutional framework for innovation requires improvement. This involves establishing systems tailored to Henan Province’s agricultural characteristics and refining intellectual property protection laws and policies. It is essential to explore novel models of government-market collaboration and substantially increase funding for fundamental agricultural research. Second, optimizing the allocation of innovation resources necessitates a comprehensive consolidation of agricultural R&D resources within Henan to eliminate redundancies and waste. Establishing a unified platform for sharing agricultural science and technology resources—such as research equipment and data—among different innovation entities is critical. Concurrently, evaluation mechanisms prioritizing should be established to foster a conducive research environment. Finally, deep integration of technology an agriculture must be advanced. This entails encouraging collaborative R&D on Intelligent Agricultural Machinery Technologies (IAMT) between agricultural enterprises an upgrading of agricultural machinery. Promoting ecologically sound agricultural technologies based on the province's industrial structure and regional advantages is vital. foreign technologies and equipment will enhance innovation capabilities. innovation quality and practical contributions research institutions to drive the intelligent . Additionally, proactively introducing advance: Finally, considering the regional heterogeneity in the impac green production efficiency, differentiated green agricultural according to regional resource endowments and development levels. In Northern Henan Province, focus should be placed on promoting intelligent agricultural machin from Germany’s “Agriculture 4.0” strategy, regions with mechanization rates exceeding 85% should prioritize precision farming technologies to reduce fertilizer usage. Southern Henan should leverage its rich agricultura resources and cultural tourism advantages to strengthen brand of green agricultural products. For the mountainous terrain of Western Henan, developing compact electric agricultural machinery adapted to local conditions will lower the adoption barrier for farmers. Adjusting crop structures to increase drought-tolerant and low-fertility-tolerant green crops will minimize environmenta damage and achieve coordinated development between agric In the smallholder economy region of Eastern Henan, establis! to collectively procure equipment and provide comprehensive farming services, supplemented by regiona t of new quality productive forces on agricultura development strategies should be formulate: ery and green technologies. Drawing inspiration uilding and enhance the market competitiveness ultural production and ecological conservation. ing agricultural service cooperatives is essentia technical training to improve farmers’ technological literacy. In the highly industrialized Central Henan region, implementing cross-sector R&D where industrial sectors sup develop agricultural robots—is recommended. ort agriculture—such as guiding enterprises to This study has several limitations arising from its research methods and conditions. First, while the findings based on prefecture-level city data in Henan Province demonstrate a positive effect of new quality productive forces on agricultural green production efficiency, the generalizability of this conclusion to other regions requires caution. Henan, a major grain-producing region in China, features large-scale farming systems that differ significantly from smallholder farming regions in Southeast Asia or highly mechanized agricultural zones in Europe and North America; future cross-regional comparative studies are needed to verify the applicability of these findings. Second, although the new quality productive forces evaluation index system was constructed from the dimensions of laborers, labor objects, and labor materials, it may not encompass all relevant aspects. More comprehensive and diverse indicators should be considered in the future for more accurate measurement. Third, regarding data, future research could incorporate micro-level data, such as farm household surveys, to enable deeper validation of the threshold effect mechanisms."
]