[
    "With the advancement of urbanization, there has been a significant reduction in cultivated land, accompanied by soil erosion. Concurrently, the regularity of rainfall in recent years has been erratic, adversely impacting the grain economy and agricultural development in certain regions. Henan Province, spanning the basins of the Yangtze River, the Yellow River, the Huaihe River, and the Haihe River, possesses complex hydrological conditions and serves as a pivotal agricultural zone in China. Therefore, this paper utilizes daily rainfall data collected over 54 years (1969-2022) from 112 rain measuring stations in Henan Province to calculate the rainfall erosivity using the Zhang model and the erosivity model from the first national water survey. Meanwhile, spatial analysis was performed using the Kriging interpolation method in the ArcGIS Geostatistical Wizard, resulting in detailed spatial distribution maps of rainfall and rainfall erosivity. The study also employed Wavelet and Mann-Kendall tests to analyze the abrupt changes, trends and periodicity of rainfall and rainfall erosivity within the target region. The findings indicate that the average rainfall (1969-2022) in Henan province was 718.26 mm, while the average rainfall erosivity (R) was 3213.46 MJ mm/(hm? h). R values are positively correlated with rainfall intensity and volume, displaying an annual upward trend. Spatially, R values increase gradually from northwest to southeast, closely aligning with topographical variations. Additionally, the analysis revealed a predominant periodic cycle of 54 years in the precipitation patterns. These results offer valuable insights for environmental and agricultural management in other regions of central China. Soil erosion constitutes a significant environmental challenge globally and forms a crucial aspect of contemporary climate change research!. The force of rainfall that precipitates soil erosion, termed ‘rainfall erosivity’, is acknowledged as one of the fundamental dynamic factors influencing soil erosion?. This parameter, which delineates the potential of rainfall to induce soil erosion, is extensively applied in various domains, including integrated soil and water conservation management, agricultural production, and ecosystem services valuation. In the context of climate change, pronounced spatial and temporal variations in precipitation are evident across diverse regions. The considerable uncertainty surrounding precipitation volume, intensity, and duration can lead to alterations in rainfall erosivity, subsequently affecting the characteristics of soil erosion*. Elucidating the spatiotemporal dynamics of soil erosion is of paramount importance for the assessment of soil and water management strategies and for offering insightful guidance in the development of soil and water conservation measures‘. Since the mid-twentieth century, the study of rainfall erosivity has become a hot topic in the field of environmental science. In 1959, Wischmeier explicitly proposed for the first time to articulate the use of the product of total kinetic energy of rainfall and the maximum 30-mininute intensity of rainfall as an index for rainfall erosivity. Building on Wischmeier’s pioneering results, scholars refined the indicators of rainfall erosivity. For instance, British scholar Hudson‘ suggested using the total energy of rainfall exceeding 25.4 mm/h as a measure of rainfall erosivity. Fostor® further refined a more accurate and comprehensive indicator by systematically analyzing various rainfall parameters, such as total rainfall, intensity, runoff, and duration, along with their combined effects. As research progressed, computational equations related to this field began to emerge. The notable Universal Soil Loss Equation (USLE), formulated by Wischmeier and Smith in 1965 and revised in 1978, providing a more generalized framework”*. Subsequently, the U.S. Soil Conservation Service introduced a modified version of the USLE, known as the Revised Universal Soil Loss Equation (RUSLE), in 1995°. To date, the methodologies devel loped for studying rainfall erosivity have yielded substantial insights and have significantly contributed to advancing research in this area. Chinese scholars in the fields of soil erosion and geography have conducted extensive systematic research since the 1980s. Zhang Wenbo\"” utilized data from 71 representative meteorological stations across the country to establish a simple algorithmic model for estimating rainfall erosivity based on daily rainfall. This model has been widely applied in the evaluation of rainfall erosivity at the watershed scale!!~!>. After parameter adjustment, it was also used in the first national wat er resources survey for the special survey of water erosion\", The studies by Bian et al.!° and Wu et al.'° has provided methodologies for calculating the distribution of the erosive power of rainfall averaged over many years. jin and Yang further developed these studies by proposing method to assess the evolution of rainfall erosive power and trends in cyclical changes!”'*. As research in this area evolved, various computational models emerged, Li used the RUSLE empirical model combined with “3S” technology to examine soil erosion dynamics\", and articulated the regional distribution of soil erosion intensity. Furthermore, Ji et al.!? analyzed the spatial and temporal variation of erosive power in the Yellow River Basin by using the daily rainfall erosive power calculation model, Their findings indicate a highly significant positive correlation between rainfall erosive power and multiple parameters such as total rainfall, precipitation amount, number of rainfall days, rainfall intensity, and the frequency of heavy rainfall events. Additionally, scholars such as Ling Min-Hua and Liu Bin-Tao have applied the concept of the center of gravity, derived from physics, to elucidate the comprehensive spatial distribution and long-term dynamics of rainfall and its erosive capacity The characteristics of the center of gravity distribution offer substantial guidance for the prevention and management of regional droughts and flood disasters, and for identifying the critical periods of soil erosion. These studies have not only augmented the theoretical framework but also furnished a scientific foundation for the practical prevention and management of soil erosion.",
    "Henan Province, an integral part of the North China Plain, encompasses the basins of the Yangtze River, Yellow River, Huai River, and Hai River, offering unique agricultural conditions conducive to crop growth. Henan Province contributes a quarter of China’s wheat production, earning its moniker as the “Central Plains Granary’. Although Chinese scholars have made significant contributions to the study of rainfall erosivity, existing research predominantly focuses on specific areas. There is a comparative paucity of studies concentrating on crucial regions such as the North China Plain. In this study, long-term (1969-2022) daily rainfall data collected from 112 rainfall stations across Henan Province, were utilized to compute the rainfall erosive force. This computation employed both the Zhang Wenbo Erosive Force Model and the rainfall erosive force model of the first national water conservancy census. Combined with the multi-year average rainfall, the Kriging interpolation method within the ArcGIS geostatistical wizard was applied to generate corresponding spatial distribution maps of rainfall and rainfall erosive force. Analytical techniques such as Wavelets and Mann-Kendall were employed to examine the occurrence of sudden changes, trends and cycles in rainfall and rainfall erosivity within the study area. Addtionally, this research investigated the primary influencing factors of rainfall erosivity in the region. The findings aim to provide scientific for decision-making in the the monitoring and comprehensive prevention of soil erosion locally. Moreover, the methodologies and insights derived from this study are intended to contribute to similar research endeavors in other regions of central China. Utilizing daily, monthly, and annual rainfall data, a variety of simplified computational models for R-values have been formulated. The calculation of R-factors necessitates high-resolution data on rainfall events. Wischmeier and Smith”! posited that for accurate computation of the R-factor, the temporal resolution of rainfall data should be finer than 15 min, and the time series length of the data should extend beyond 20 years. However, not all stations are able to collect such detailed data. In addition, this method of calculation is relatively complex and demands considerable time and labor. Consequently, many researchers have endeavored to develop simpler models that can estimate the R-factors using more readily available rainfall data, such as daily, monthly, and annual rainfall. Among these, Zhang Wenbo model and the rainfall erosivity model derived from the First National Water Resources Census areparticularly advantageous for contexts with limited detailed rainfall records’. Therefore, this paper adopts these two models to calculate rainfall erosivity. In the formula, FR; represents the erosivity value for the i-th half-month period, expressed in [MJ mm/(hm? h)]. The first 15 days of each month designated as as the first half month-period, while the remaining days constitute the other half-month period, dividing the year into 24 such intervals. p; denotes the erosive daily rainfall on the j-th day of the half-month period. The criterion for erosive daily rainfall is that it must be equal to or exceed 12 mm; values below this threshold are considered as zero. This threshold of 12 mm aligns with the standard for erosive rainfall in China. In the Eq. (1), # and f for are undetermined model parameters. The daily rainfall data of each meteorological station involved in the study was estimated to obtain their parameter values. Different In the formula: Piz and Py12 is the daily average rainfall and annual average rainfall with daily rainfall > 12 mm, respectively. In the formula: R represents the average annual rainfall erosion force over many years, expressed in MJ mm/ (hm? h a); Rang represents the rainfall erosion force in the k-th half month, expressed in MJ mm/(hm?h), k=1, 2, ..., 24, which refers to dividing the year into 24 such intervals; i=1, 2, ..., N, refers to the time series from 1969 to 2022; j=0, 1, ... , m, refers to the number of erosive rainfall days (daily rainfall > 12 mm) in the k-th half month of the i-th year. p; ; ,, is the erosive daily rainfall in the j-th half month of the i-th year, mm. If there is no erosive rainfall in a certain half month of the year, ie. j=0, then p, , =0; a as a parameter, in warm season (May to September), a=0.39; in cold season (October to April), a=0.31.",
    "The Kriging interpolation method, as outlined in the ArcGIS Geostatistics Guide, was employed for this analysis. The Empirical semi-variation function, a key tool in this method, provides spatial autocorrelation insights for the data sets analyzed. In this study, 10 function models, including Circle Exponential, Gaussian, K-bessel, and Pore effect, were explored to optimize the semi-variation function. The selection of the most appropriate model for Henan Province was based on a comparative analysis of fitting parameters such as the mean prediction error, root mean square of prediction error, and mean prediction standard deviation. Then aiming to generate the corresponding interpolation map for the spatial distribution of rainfall amounts and rainfall erosivity. During the spatial interpolation process in ArcGIS, various computational models may be employed to enhance the fitting of geographic information data, thereby improving the computational accuracy. The suitability of the selected computational model may be assessed based on several statistical parameters derived from the model outputs. These parameters include the mean prediction error, the root mean square of prediction error, mean prediction standard deviation, standardized mean prediction error, and standardized root mean square of prediction error. The assessment criteria for model selection are as follows: optimal model fitting is indicated by a standardized root mean square prediction error approximating 1, a mean prediction error nearing 0, and minimal values for the other statistical measures. The Mann Kendall trend analysis method, a non parametric test endorsed by the World Meteorological Organization for time series analysis, is adept at effectively discerning whether variations in a natural process are attributable to inherent fluctuations or exhibit a specific directional trend”. ‘The initial hypothesis Ho posited that time series data (1), v2, ..., Z,), consisting of n independents, randomly distributed samples; The alternative hypothesis H; proposed a two-tailed test. stipulating that for alli, 7 < n, the distribution of X; and X; differ. Define statistic S as follows: where sign() is the sign function, when X;—Xj; <0, sign(X;—X;)=~—1, when X;—X;=0, sign (X; — X;) = 0,when X; — X; > 0, sign (X; — X;) = 1. The statistic $ obeys normal distribution, its mean value is 0, and the variance var(S) = n(n — 1)(2n + 5)/18. When values differ, the following conditions apply: In two-tailed test, for a specified confidence level a, if the condition |Z| > Z_/2 met, it suggests that the time series of meteorological elements exhibits a definitive upward or downward trend at the confidence level a. A positive value for Z signifies an increasing trend, whereas a negative value indicates a decreasing trend. When |Z| meets or exceeds 1.28, 1.64, and 2.32, it corresponds to passing significance tests at the confidence levels of 90%, 95%, and 99%, respectively. For meteorological data time series 7, 72, ..., 2», Sy represents the cumulative number of the i-th sample, defining the statistic: Among them, U F, = 0. Given the significance level a, if |UFj,| > Ux (Ux The boundary line), it indicates a significant trend change in the sequence. Reverse P sequence 2, 1, ..., 1,01 represents ©1/,X/,...,Uy/, 7; is the i-th sample the cumulative number of x; > xj(i < j <n). When i/ =n + 1 — 1,7; =1;/, based on this, using the same method to find the inverse sequence U B; of UF): When U F),,U B;, exceeds the critical line range, it is the time zone where the mutation occurs. If UF), =U By. Should the intersection occur between the critical lines, the point in time corresponding to the intersection is identified as the onset of the mutation. The formula for calculating the center of gravity of rainfall erosion force was derived from the referenced literature as follows”*: where X and Y are the centers of gravity coordinate; X; and Y; are the longitude and latitude coordinates of the i-th station; R; is the monthly or annual rainfall erosion force of the i-th station, MJ mm/(hm? h). The analysis conducted using ArcGIS revealed that the semivariogram was optimized through various computational methods, as detailed in Table 1. It was found that compared with other computational models, the Pore effect had the average prediction error value approaching 0. Furthermore, the standardized root mean square of the error value was closest to 1 for the Pore effect. The values of other evaluation indexes of this model are smaller than those of other models. Consequently, the Pore effect was selected as the preferred model for the Kriging interpolation method in subsequent analyses.",
    "Based on the Kriging interpolation method, the spatial distribution of multi-year (1969-2022) average rainfall Henan Province was accurately mapped. Annual rainfall increased from 473 mm in Anyang, Jiaozuo, and Sanmenxia cities, northwestern Henan to 1439 mm in Xinyang City, southeastern Henan (Fig. 1). These findings align with the climatic zoning, where the northwest exhibits a monsoon temperate climate and the southeast a subtropical climate. The variation in rainfall patterns coupled with the diverse topography confirms Henan Province as an exemplary representative for studying central China's climatic and geographical diversity. Accuracy analysis was conducted on the Zhang Wenbo Model and the rainfall erosivity model derived from the first national water conservancy census to identify the most effective algorithm. Results indicated that the J-bessel model exhibited superior performance in semivariogram analysis. with an average prediction error of -10.02 and a standardized root mean square value of 0.89. Additionally, the semivariogram analysis of the first national water conservancy census-based rainfall erosivity model utilizing the Circlar model demonstrated optimal performance. This model achieved an average prediction error of -13.93 and a standardized root mean square value of 0.99. Utilizing the optimal algorithms from the two models along with Kriging interpolation in ArcGIS, multi- year average erosion distribution maps for Henan Province were generated (Fig. 2). The spatial interpolation distribution maps, calculated through two distinct models, both effectively delineate the distribution of rainfall erosivity within the region. Notably, a distinct pattern emerges, characterized by higher values in the southeastern area and a decreasing trend towards the northwestern region. The analysis revealed distinct variations in the spatial distribution of annual average rainfall erosivity across the region, ranging from 901.77 MJ mm/(hm? h) in Sanmenxia City, located in western Henan, to 7995.66 MJ mm/(hm? h) in Xinyang City, situated in southeastern Henan. Generally, there was a noticeable increasing trend in rainfall erosivity from northwest to southeast across the province, with Xinyang City exhibiting the highest levels of rainfall erosivity and Sanmenxia City the lowest. The trends were consistent with the distribution of annual rainfall in Henan province. The root mean square of the prediction error and the average prediction standard deviation were compared between the two models. Among them, the root mean square of the prediction error of the J-bessel semi variogram Zhangwenbo model was 319.47 MJ mm/(hm? h), and the average prediction standard deviation was 378.71 MJ mm/(hm? h). In contrast, for the Circular semivariogram within the first national water conservancy census-based rainfall erosion model, the root mean square of the prediction error was 308.76 MJ mm/(hm’ h), and the average predicted standard deviation was 297.96 MJ mm/(hm? h). The analysis revealed that the rainfall erosivity model of the first national water conservancy census provided greater accuracy in Henan Province. Consequently, this study employed the rainfall erosivity model based on the first national water conservancy census as the research model. The average annual rainfall in Henan Province is recorded at 721.93 mm, with observed values ranging from 510.98 mm to 1060.50 mm. Linear fitting of the annual average rainfall data collected from 112 stations across Henan Province yielded the univariate linear parameters a=0.05 and b=622.57. Over a span of 54 years, the rainfall in Henan Province exhibited a fluctuating upward trend, reaching its maximum in 2003 with 1060.50 mm and its minimum in 1978 with 510.98 mm (Fig. 3). In this study, an increase in rainfall erosivity was observed with the intensification of rainfall. Regression analysis of multi-year average rainfall and rainfall erosivity revealed a positive linear correlation was found between the two parameters. This finding is consistent with similar positive correlations reported in previous studies**?’, Henan Province is divided into four major watersheds: the Haihe River Basin, the Yellow River Basin, the Yangtze River Basin, and the Huaihe River Basin (Table 2). To establish the applicability of this linear correlation across these diverse hydrological regions, trends of annual changes in rainfall erosivity were analyzed for each watershed. Examination of the annual average rainfall erosivity for each station within these watersheds indicated similar trends in annual rainfall (Fig. 4). The results confirmed that the linear positive correlation was suitable for all four watersheds in Henan Province. The slopes of the linear functions representing the relationship between rainfall and erosivity in the Haihe River, Yellow River, Yangtze River, and Huaihe River watersheds were — 0.16, 2.70, 7.27, and 4.15, respectively. Among them, the rainfall erosivity of the Haihe River Basinshowed a decreasing trend, whereas the remaining three watersheds showed an increasing trend in the erosive power of rainfall. The Yangtze River Basin displayed the steepest slope, indicating a significant increase in rainfall erosivity over the past 54 years. Concurrently, this region also recorded the highest average annual rainfall, suggesting a strong influence of rainfall on erosivity in this watershed. In this study, the recorded average annual rainfall and corresponding rainfall erosivity in the four basins were as follows: the Haihe River Basin had an average annual rainfall of 574.77 mm and a rainfall erosivity of 2650.13 MJ mm/(hm’ h); the Yellow River Basin recorded 592.41 mm of rainfall and a rainfall erosivity of 2271.49 MJ mm/(hm? h); the Yangtze River Basin had an average annual rainfall of 783.59 mm with a rainfall erosivity of 3356.30 MJ mm/(hm* h); and the Huaihe River Basin experienced 803.73 mm of rainfall and an a a eae ae ee a a a a a EEERSESRERERAR RAR A SEER ERERERRSEEZEZE ER Year By TR RRR AS ear Fig. 4. Variation in annual mean rainfall erosivity for Haihe River Basin (a), Yellow River Basin (b), Yangtze River Basin (c), Huaihe River Basin (d).",
    "erosivity of 3816.23 MJ mm/(hm? h). These findings robustly confirm the relationships between the multi-year average rainfall and rainfall erosive power across the four watersheds. The multi-year average rainfall in Henan Province was analyzed using Mann-Kendall trend analysis, and the results were shown in Fig. 5. During the periods of 1969-1971, 1977-1978, and 2021-2022, the UF curve was negative during 1969-1971, 1977-1978, and 2021-2022, signifying a decline in rainfall during these specific intervals. Conversely, the UF curve was positive for all other time periods, indicating an increase in rainfall in the periods. In 1970, 2012, 2018, and 2020, tintersections were observed between the UF and UB curves suggesting abrupt changes in rainfall at these specific time points. However, none of these changes reached the 0.05 significance level, indicating that the trends were not statistically significant. Generally, the annual average rainfall in Henan Province from 1969 to 2022 exhibited fluctuations over the years and demonstrated an upward trend over the past 54 years. The Morlet wavelet function, which combines a Gaussian distribution function with a cosine function, is utilized for its fixed frequency characteristics suitable for detecting data periodicity in trends. In this study, the function facilitated the continuous wavelet transformation on the average precipitation data from Henan Province, spanning from 1969 to 2022. The periodic characteristics of rainfall time series and rainfall erosivity time series were analyzed (Fig. 6). The analysis revealed that both the rainfall and the rainfall erosivity time series in Henan Province demonstrated a 54-year periodicity in their variation patterns. Specifically, the analysis identified one center of low rainfall and rainfall erosivity and two centers of high rainfall erosivity. Over the course of this period, three significant oscillations were observed, occurring respectively in the years 1974, 1993, and 2010. Figure 7a presents the wavelet variance map, illustrating the fluctuation energy of the annual rainfall series in Henan Province over time. The data revealed that the most pronounced peak in rainfall variability occurred Fig. 6. Wavelet analysis of yearly average rainfall in Henan Province (a), and wavelet analysis of yearly average erosion force in Henan province (b). every 54 years, signifying that the oscillation period of rainfall changes is most pronounced at 54-year time scale. This cycle was identified the primary period of oscillation. The period from Fig. 7b exhibited a 35-year periodicity. These variations in annual average rainfall in Henan Province from 1969 to 2022 are consistent with the results derived from wavelet coefficient analysis of the rainfall time series. Figure 8 displays the wavelet variance plot, which depicts the fluctuation energy of the annual average rainfall erosivity series in Henan Province over time. This trend exhibits a high degree of similarity to the rainfall series. Thus, it is evident that the inter-annual cyclical changes in rainfall erosivity closely mirror those of the rainfall patterns. To analyze the distribution and migration characteristics of the center of gravity of rainfall erosivity within the four major watersheds of Henan Province, the positions of the centers of rainfall erosivity centers from 1969 to 2022 were identified. Additionally, the distance and direction of center of gravity migration were quantified at five-year intervals. The coordinates of the center of gravity of annual rainfall erosivity in each watershed are presented in Table 3, where ‘x’ and ‘y’ correspond to the decimal coordinate system utilized in ArcGIS. Among the findings, the multi-year average center of gravity of rainfall erosion in Henan Province was pinpointed at the junction of Pingdingshan City and Xuchang City in central Henan province (Fig. 9). While the migration of the center exhibited a circuitous periodicity, the path of this migration displayed no discernible regular pattern. Fig. 7. Wavelet variogram of annual precipitation series in Henan Province (a), time series variation of wavelet coefficients at the 36-year main cycle scale (b). Fig. 8. Wavelet variogram of annual mean rainfall variation of wavelet coefficients at the 36-year main cycle scale (b). erosion force series in Henan Province (a), time series The migration trajectory of rainfall erosivity within each watershed is illustrated in Fig. 10. Each watershed exhibited a periodic migration pattern, with notable movements observed in the Yellow River Basin, where the center of gravity oscillated from northeast to southwest. The span of center of gravity migration in this basin was relatively larger from 1974 to 1979 and from 1989 to 1994 than other periods. In the Haihe River Basin, the migration followed a northeast to southwest trajectory, with significant spans of center of gravity migration occurring from 1979 to 1984 and from 1984 to 1989. The Yangtze River Basin also experienced a migration from northeast to southwest, with substantial spans of center of gravity migration observed from 1979 to 1984, 1989 to 1994, and 2009 to 2014. Similarly, in the Huai River Basin, the migration proceeded from north to south, with significant spans occurring from 1989 to 1994 and from 2009 to 2014.",
    "Fig. 10. Migration of the centre of gravity of rainfall erosion in the four major river basins of Henan province (a), the Yellow River Basin (b), the Hai River Basin (c), the Yangtze River Basin (d) and the Huai River Basin (e). The migration of the center of gravity of rainfall erosion within the Haihe River Basin primarily occurs between Xinxiang City and Hebi City, exhibiting a periodic migration path from northeast to southwest. As delineated in the 2021 topographic map of Henan province Fig. 11, the northern part of the center of gravity aligns with the Taihang Mountains, with the migration path tracking along the mountainous terrain (Fig. 11). The migration of the center of gravity of rainfall erosivity within the Yellow River primarily occurs between Zhengzhou City and Luoyang City, with a small angle of northeast to southwest direction with obvious periodicity. As delineated in the topographic map, it is observed that the center of gravity for rainfall erosivity in the watershed migrated along the periphery of Songshan Mountain, which itself extends in a southwest direction. The migration of the center of gravity of rainfall erosivity within the Yangtze River primarily occurs in Nanyang City, exhibiting a periodic migration path from northwest to southeast. However, the migration path was relatively erratic and the regularity of this movement was not notably discernible. The migration of the center of gravity of rainfall erosivity within the Huaihe River Basin primarily occurs within Zhumadian, characterized by a trend from southeast to northwest and exhibiting a defined periodicity. To the west of the migration path were Wufeng Mountain and Baiyun Mountain. The two mountains were connected in a northwest direction. Additionally, located to the south of the center of gravity of rainfall erosivity is the Suyahu Reservoir, which notably influences the erosivity dynamics in this region. For most watersheds, the migration of rainfall erosivity exhibited a regular pattern. Numerous studies have explored the factors influencing rainfall migration. For instance, Yang et al.”* examined the impact of the Indian Ocean monsoon on rainfall migration and elucidated the correlation between the two phenomena. Taylor et al.” investigated the influence of terrain on rainfall migration and demonstrated a close relationship between terrain features and rainfall migration patterns. Similarly, Xiao et al.*° considered a combination of factors including elevation, terrain, and monsoon influences to study the transfer of rainfall erosivity in Shandong province, China, concluding that these factors significantly affected rainfall erosivity transfer. The above conclusions underscore that the migration of rainfall and rainfall erosivity is intricately linked to topography, terrains and monsoonal patterns. Therefore, based on the topographical map shown in Fig. 11, it can be inferred that rainfall erosivity migration in the study area was affected by the three factors. Additionally, several scholars have conducted relevant studies in areas adjacent to our study region'*!>-!°. In comparison with their findings reveal similar periodic changes, migration rules and distribution rules of rainfall erosivity obtained in this paper were reported. This similarity substantiates the reliability of the current study’s results within the four watersheds of Henan Province. The centers of annual rainfall erosion for the Yellow River, Huaihe River, Haihe River, and Yangtze River watersheds in Henan Province were identified in Luoyang City, Zhumadian City, Xinxiang City, and Nanyang City, respectively. Specifically, the center of annual rainfall erosivity in the Huaihe River Basin exhibited a north— south migration trend. In contrast, the centers of annual rainfall erosivity in the Yellow River, Haihe River, and Yangtze River watersheds demonstrated migration trends from northeast to southwest. Additionally, it was established that rainfall erosivity is positively correlated with rainfall intensity. The results may provide the basis for scientific decision making on soil erosion monitoring, rainfall erosivity prevention, and soil and water conservation. The datasets generated during this study are available from the corresponding author upon reasonable request and within the framework of cooperation agreements and scientific research projects."
]