[
    "The traceability of groundwater nitrate pollution is crucial for controlling and managing polluted groundwater. This study integrates hydrochemistry, nitrate isotope (5‘°N-NO;- and 5*8O-NO,°), and self-organizing map (SOM) and end-member mixing (EMMTE) models to identify the sources and quantify the contributions of nitrate pollution to groundwater in an intensive agricultural region in the Sha River Basin in southwestern Henan Province. The results indicate that the NO;--N concentration in 74% (n = 39) of the groundwater samples exceeded the WHO standard of 10 mg/L. According to the results of EMMTE modeling, soil nitrogen (68.4%) was the main source of nitrate in Cluster-1, followed by manure and sewage (16.5%), chemical fertilizer (11.9%) and atmospheric deposition (3.3%). In Cluster-2, soil nitrogen (60.1%) was the main source of nitrate, with a significant increase in the contribution of manure and sewage (35.5%). The considerable contributions of soil nitrogen may be attributed to the high nitrogen fertilizer usage that accumulated in the soil in this traditional agricultural area. Moreover, it is apparent that most Cluster-2 sampling sites with high contributions of manure and sewage are located around residential land. Therefore, the arbitrary discharge and leaching of domestic sewage may be responsible for these results. Therefore, this study provides useful assistance for the continuous management and pollution control of groundwater in the Sha River Basin. Groundwater, a vital freshwater resource, is crucial for human consumption and human production activities. In China, over 400 cities and the majority of rural areas rely on groundwater as their drinking water source’. However, the rapid modernization of agriculture is increasingly leading to groundwater pollution. For instance, fertilizer usage in China increased from 133.49 x 10° tons in 1981 to 519.1 x 10° tons in 2021. The excessive use of chemical fertilizers is primarily responsible for regional nitrogen increases, which significantly threaten the water environment**. Among nitrogen compounds, NO, is highly mobile and soluble and easily contaminates groundwater by leaching. Once in the aquifer, NO,” can stabilize in an oxidizing environment, accumulating over decades*®. Excessive nitrates pose health risks such as cancer, high blood pressure, and thyroid disease in tHenan Key Laboratory of Water Pollution Control and Rehabilitation Technology, School of Municipal and Environmental Engineering, Henan University of Urban Construction, Pingdingshan 467036, China. 7Henan International Joint Laboratory of Green Low Carbon Water Treatment Technology and Water Resources Utilization, School of Municipal and Environmental Engineering, Henan University of Urban Construction, Pingdingshan 467036, China. *School of Resources and Environmental Engineering, Jiangxi University of Science and Technology, Ganzhou 341000, China. “email: 20171019@huuc.edu.cn; 20171004@ huuc.edu.cn humans and contribute to eutrophication, hypoxia, and biodiversity loss in aquatic ecosystems**. Identifying nitrate sources is thus critical for effective groundwater pollution management. Accurately identifying and quantifying NO; sources is essential for mitigating the damage caused by this pollution. NO; pollution originates from many sources, including domestic sewage, industrial wastewater, fertilizers and manure from agricultural activities, atmospheric precipitation and soil organic nitrogen*”'°. Different NO; sources have unique isotopic signatures; therefore, dual nitrate isotope methods have been widely applied to assess NO; sources and reveal the mechanisms of nitrogen transport transformation in surface water and groundwater'' |”. However, challenges in NO;~ traceability arise from overlapping isotopic signatures and isotopic fractionation during the nitrogen cycle (e.g., nitrification, denitrification, ammonification, volatilization)'*'*. To overcome these limitations, studies have combined nitrate isotopes with hydrochemistry data (e.g., Cl, Na)'°, other isotopes (e.g., 6''B, ®’Sr/**Sr, 5'°N-NH,*, A’’O-NO,; )'*'S, multivariate statistical methods”, and microbiological methods”®”'. This integrated methodology offers a more comprehensive and accurate means of identifying nitrate sources, thereby deepening our understanding of their origins. A variety of methods, including scatter plots and multivariate statistics, have been extensively used to characterize nitrate pollution in groundwater. However, due to their nonlinearity and high dispersion, groundwater hydrochemistry data often result in misinterpretations when analyzed with traditional linear methods such as factor and principal component analysis, which struggle with nonlinearity and nonsmoothness~”*. Therefore, these traditional analysis methods fall short of meeting current research needs. In contrast, a self-organizing map (SOM), an unsupervised neural network model, effectively maps complex nonlinear data into two dimensions, enabling systematic analysis and revealing local intervariable relationships”. Moreover, EMMTE, a new tool for stable isotope analysis of nitrate sources, outperforms conventional MixSIAR, offering higher prediction accuracy, lower root mean square error (RMSE), and reduced relative bias”. Combining EMMTEs with SOM facilitates the shift from qualitative to quantitative analysis, enhancing the understanding and interpretation of groundwater nitrate sources and transformation processes.",
    "The Sha River Basin, which is part of the Huai River Basin in Henan Province, is a significant agricultural area. Extensive research indicates significant shallow groundwater pollution in this region****. However, previous studies have mostly focused on the middle and lower reaches of the Huai River Basin, with limited attention given to the upper reaches, primarily involving qualitative analyses of nitrate pollution and its spatial distribution. Nitrate isotope analysis, which can reveal the sources and contributions of nitrates in this area, has been underutilized. This study aims to identify the sources and quantify the contributions of groundwater pollution by integrating groundwater hydrochemical data and water and nitrate isotope measurements with SOM and EMMTE modeling. This comprehensive approach will systematically explore the sources and evolution of nitrates, providing a detailed and thorough perspective on nitrate pollution, which is crucial for developing effective strategies to mitigate its environmental impact. The objectives of this study are to (1) identify the primary sources and transformation processes of NO; in groundwater, (2) quantify the contribution of each NO; source using the EMMTE model, and (3) make reasonable recommendations for watershed management and protection based on the identified pollution sources. Table 1 presents a statistical summary of the hydrogeochemical characteristics of the groundwater samples. The pH varied from 6.30 to 8.10 (CV =7.4%), averaging 6.71, indicating slightly acidic groundwater. The EC ranged from 227.0 to 1773.0 uS/cm (CV = 44.1%), with an average of 1008.0 us/cm. The TDS values ranged from 115.0 to 887.0 mg/L (CV = 43.9%), with an average of 505.0 mg/L. All the samples had TDS < 1000 mg/L. Thus, the groundwater in the area is mainly fresh water (fresh: < 1500 uS/cm; brackish: 1500-3000 uS/cm; saline: > 3000 uS/cm). The ORP varied from 53.0 to 137.0 mV (CV = 22.7%), suggesting generally oxidizing conditions in the groundwater. While the ORP provides a rough indication of groundwater redox conditions, actual conditions can be inferred from the concentrations of redox-sensitive substances such as Fe, Mn, NO,” and SO,?\". The dissolved Fe and Mn concentrations ranged from below the detection limits to 0.60 mg/L (CV = 220.0%) and 1.70 mg/L (CV = 362.5%), respectively. The high CV values for the SO,’ concentrations suggest varying degrees of redox conditions in the groundwater. The anions in the groundwater were primarily composed of SO,?- and HCO, , while the predominant cations were Ca** and Na*. The abundance of major cations followed the order Ca** > Na* > Mg** >K*, and for anions, the order was HCO; >NO; >SO,? >CI->F-. This suggests that the general groundwater type is Ca-HCO;. Notably, K* (CV = 465.6%), F- (CV =90.9%), and SO,?> (CV = 81.3%) exhibited relatively high coefficients of variation. This high variability indicates diverse groundwater sources in the area. According to the Chinese Standards for Drinking Water Quality (GB 5749-2022), the acceptable limit for NO, -N is 10 mg/L. In this study, 74% of the groundwater samples (n=39) exceeded the NO, -N standard, with a maximum concentration reaching 58.7 mg/L. The mean concentration was 23.1 mg/L, surpassing the acceptable limit of 10 mg/L. The higher concentrations of nitrogen in groundwater and their spatial variability indicate the diversity and prevalence of nitrogen sources. The results in Table 1 indicate significant disparities between the median and maximum values of $O,7, Cl, K* and F’, where the median values exceed one-quarter of the maximum values. This suggests the presence of anthropogenic pollution inputs into the groundwater system**. Furthermore, increases in TDS and Cl correlate with increases in nitrate content (Fig. 1), indicating that high nitrate concentrations result from exogenous Table 1. Statistical summary of the hydrogeochemical characteristics and isotopis compostions of the studied groundwater samples (n= 39). GB 5749-2022 refers to standards for drinking water quality of China. -: guideline value has not been established.D.L.: below the detection limit. pollution sources. This is because nitrate inputs are accompanied by a number of other dissolved solids that enter the groundwater system”. Figure 2 displays the hydrochemical correlation of groundwater in the Sha River Basin, showing a strong correlation between NO;--N and TDS, EC, Mg?*, Ca?*, HCO,\", SO,?- and CI. A significant positive correlation between NO, --N and TDS further confirms that nitrate contamination originates from surface inputs. Moreover, a significant positive correlation between NO; -N and Ca** revealed the effect of fertilizer application on groundwater nitrate levels. The significant positive correlation between NO; -N and Cl and SO,’ suggested that fecal matter and sewage may also be potential causes of high NO; levels“.",
    "In this study, 11 variables from 39 groundwater samples were used as input data for SOM calculations, namely, pH, TDS, Na*, K*, Mg’*, Ca**, HCO;,, F, Cl, SO,\" and NO, -N. Considering the metrics QE (0.88) and TE (0.1), the optimal layout was determined to have 5 rows and 6 columns. Consequently, a total of 30 neurons Figure 2. Correlation diagram between the hydrochemical components of groundwater in the Sha River basin. The units of major ions and TDS are mg/L. Figure 3. (a) Component planes showing the weight vector values of twelve variables. The neurons in each component plane are represented by color codes with blue and red corresponding to low and high values of the parameters, respectively. (b) Pattern of groundwater cluster formation in the Sha River basin. (5x6) were selected. Figure 3 shows the SOM mapping plots for different variables after training. In the mapping plot, the position of each sample within the neurons is denoted by a number. The presence of only three empty neurons confirmed the reliability and applicability of the 30 neurons. Neuron vector values are depicted in different colors, with blue and red representing low and high parameter values, respectively. By comparing the color gradient changes between the plots, the dependencies between variables can be clearly revealed. Similar or identical colors indicate a positive correlation, with greater similarity denoting stronger correlation. Firstly, Cl\", NO;--N and Na* show similar color gradients that increase from the upper right to the lower left, indicating that these ions have the same sources, likely anthropogenic*!. Secondly, Ca?* and SO,?- have similar color gradient changes, suggesting that the dissolution of gypsum may be involved’. Finally, Cl and TDS show similar color gradients, both decreasing from the upper right to the lower left, suggesting groundwater pollution in addition to the potential influence of evaporation”. Table 2 displays the training of DBI values for clusters 1 through 7 to ascertain the optimal number of clusters. Two of the clusters had the lowest DBI values; thus, the groundwater samples were divided into two groups. Each cluster exhibited different specific hydrochemical characteristics. The hydrochemistry of these two groups will be explained in this study through statistical tables. Table 3 presents the mean values and coefficients of variation for 11 parameters in Cluster-1 and Cluster-2. Cluster-1, comprising 31% (n= 12) of the total samples, was characterized by the highest pH and F- concentrations (pH = 6.98, F- =0.2 mg/L). The dominant cation in Cluster-1 is Ca**, followed by Na*, while the dominant anion is HCO,;,, followed by SO,?-. Moreover, the concentration of NO,~-N in Cluster-1 was lower than both the Chinese Standards for Drinking Water Quality and that in Cluster-2. Thus, the groundwater of Cluster-1 can be categorized as low-concentration NO; -N groundwater. Cluster-2, comprising approximately 69% (n=27) of the total samples, had elevated concentrations of most constituents compared to Cluster-1. Specifically, the NO;--N concentrations in Cluster 2 significantly exceeded the Chinese Standards for Drinking Water Quality. Groundwater samples in Cluster-2, primarily from densely populated areas such as towns and cities, may have been influenced by anthropogenic contamination, such as sewage and manure. Groundwater samples from Cluster-2 can thus be classified as high-concentration NO,-N groundwater. The Chadha diagram is a modified version based on the Piper diagram and the Durov diagram, which aims to represent the applicability of water analysis in the simplest way. Chadha diagrams can be used to study various hydrochemical processes, such as base cation exchange, mixing of natural water and other hydrochemical roblems“. The map of the groundwater data acquired via SOM training on a Chadha diagram (Fig. 4) reveals that the majority of the samples in the study area are categorized as recharge water. In Cluster 1, 91% (n= 11) and in Cluster 2, 78% (n=21) of the water samples are of the HCO3-Ca-Mg type, which is indicative of recharge water. This water type typically occurs where minerals containing CaCO; interact with CO). In Cluster 2, 22% (n=6) of the samples demonstrate more advanced chemical evolution, governed by reverse ion exchange. This rocess lowers the Na concentration in pore water, leading to the Ca~Mg-Cl type, characterized by the exchange of Na in solution for Ca on clay surfaces*®. The present study suggested that the elevated Na concentration might result from sewage infiltration, as Cluster-2 represents high-concentration NO; -N groundwater, which may promote this reverse exchange process**.",
    "A Gibbs diagram can be used to illustrate the genesis mechanism of the hydrogeochemical composition (rock weathering, evaporative crystallization and precipitation). As shown in Fig. 5, the ratio of Cl-/(Cl +HCO,°) is less than 0.5, and the TDS concentrations of Cluster-1 and Cluster-2 are not high. This suggests that rock weathering is the main mechanism and is less influenced by evaporation and the atmosphere’’. Stable water isotopes (6D and 5'Oy490) effectively track the water cycle, revealing vapor sources in precipitation and their transformation into groundwater**. However, 5D and §'8Oj0 exhibit regional variations and are influenced by temperature, altitude, humidity, and vapor sources’’. Despite the lack of a Global Network for Isotopes in Precipitation (GNIP) monitoring station in the study area, the nearby Zhengzhou station was chosen ue to its similar climatic and hydrogeological conditions. The local meteoric water line (LMWL) was determined to be 8D =6.755!’Oy9 — 2.7 Figure 6 shows that most groundwater samples, with their 6D and 5'*Oj,, values, align closely with the LMWL, suggesting that precipitation was the primary groundwater source. Linear regression analysis of the groundwater in the area revealed a notably lower intercept than the LMWL, suggesting secondary evaporation luring precipitation infiltration”. Although the isotopic values of 6'°N-NO; and 5'8O-NO, are correlated with the initial source, the nitrogen cycle causes changes in isotopic characteristic values, among which ammonia volatilization, nitrification, and enitrification affect the most obvious changes*»’. Nitrification is a microbial-mediated process that converts ammonia nitrogen to nitrate. During nitrification, approximately 1/3 of the oxygen atoms in the resulting NO, originate from atmospheric O, (23.5%o), while the remaining 2/3 come from the water column*!: The 6'8O-H,O values in the groundwater ranged from — 8.89 to — 3.74 %bo, leading to theoretical 5'80-NO;- values between + 1.90 and + 5.34%o. Figure 7 indicates that most 6!8O-NO,° values fall within the theoretical nitrification range, well below the atmospheric oxygen line characteristic of atmospheric nitrate, suggesting that nitrification is the primary process for dissolved nitrate formation in groundwater™”*. In Cluster-2, two samples had 5'8O-NO,, values slightly higher than the theoretical nitrification line, possibly due to oxygen incorporation from water with high 6'*O-H,O values attributed to soil water evaporation or bacterial respiration™>. Denitrification can significantly change the isotopic composition of NO; , and the remaining 6N-NO, and §'8O-NO, are fractionated and enriched following the Rayleigh fractionation rule. The relationship between §N-NO,; and NO,_ is expressed as: where ¢ is the fractionation factor and 6'°N, and 6'80, are the initial composition values of nitrogen and oxygen isotopes, respectively. If the values of 'SN-NO; and 6'8O-NO,_ are significantly negatively correlated with InNO, -N, it can be determined that denitrification occurred in the groundwater. As shown in Fig. 8, a significant positive linear correlation between 6°N-NO; and InNO,-N in Cluster-1, indicated the absence of denitrification. In Cluster-2, the 55N-NO, and 6'8O-NO, values increase as the NO; -N concentration decreases, while the correlation (R? = 0.16) was not very obvious. Furthermore, the groundwater is mainly distributed in a oxidizing redox environment of 53-137 mV (Table 1), suggesting a generally oxidized state at the sampling points. This oxidized state is not conducive to denitrification, making it less likely to occur in Cluster-2. Additionally, during denitrification, the 5'°N-NO; and 5'*O-NO, values increase as the NO; -N concentration decreases, with ratios typically between 1.3:1 and 2.1:1!9°. The 6!5N-NO;\" and 5!8O-NO;° ratios in both Cluster-1 (— 0.21) and Cluster-2 (0.59) were less than 1.3 (Fig. 10), further indicating denitrification had not predominantly occurred in the groundwater. CI is a conservative ion that is prevalent in natural waters and hence its usefulness in hydrochemical interpretation. The correlation between NO;/CI and Cl can explain various NO,” sources and biogeochemical processes*’. In general, high Cl- and low NO;7/Cl ratios suggest sewage and manure sources, whereas agricultural sources (e.g., chemical fertilizer and soil nitrogen erosion) tend to exhibit high NO, /CI\" ratios and low Cl concentrations. The lack of significant changes in Cl concentrations, coupled with changes in NO,//CE ratios, indicates possible geochemical processes in the water samples”. As shown in Fig. 9, the NO,//CI ratios in the water samples varied from 0.04 to 2.37, suggesting that NO, may have come from multiple sources. The relationship between NO; /CI and Cl in Cluster-1 suggested that the primary NO,\" sources in the groundwater were a mix of agricultural inputs and soil nitrogen. In Cluster-2, higher CF levels and lower NO,7/CI- ratios indicate that domestic wastewater is the primary NO; source.",
    "In addition, the relationship between 5'°N-NO, and 6!8O-NO;° in Fig. 10 offers direct evidence for identifying NO; sources in groundwater. The 5'°N-NO, values ranged from 2.04 to 19.95%o (average 9.85%o + 4.01%o), and the 5'°O-NO,° values ranged from — 5.98 to + 3.87%o (average of -2.53%o + 2.64%o). In general, nitrate from precipitation and NO,\" fertilizer tends to have higher 5'°O-NO,- values. However, the low 5'8O0-NO,° values in groundwater suggest that precipitation and NO; fertilizer are not major NO\" sources. In Cluster-2, almost all the groundwater samples exhibited 5°N-NO,- values above + 7%o, indicating that domestic wastewater was the primary nitrate source in the study area. Considering that nitrification is the main process of nitrogen cycling in groundwater in the area, we suggest that NH,* in untreated domestic sewage undergoes a significant amount of nitrification, resulting in nitrate effluent with a high 6'°N-NO, signature. The EMMTE model employs 5'°N-NO; and 8'8O-NO,_ as tracers to quantify contributions from various nitrate sources. Combined with the analysis of possible nitrate sources in our study and previous references, atmospheric deposition (AD), soil nitrogen (SON), chemical fertilizer (CF), and manure and sewage (M&S) were used as potential nitrate sources in this study. The means and standard deviations of !°N-NO;” and 5'80-NO,° for each source are shown in Table 4. The AD and M&S values were measured in the lower reaches of the Sha River, the CF values were measured in the Nanyang Plain, and the SON values were measured in the North China Plain. The reason for selecting these references in this study is primarily due to the similarity and proximity of the climate and farming practices in the reference areas to our study area. Since denitrification does not occur in groundwater, the fractionation factor C= 0 is used to calculate the nitrate contribution rate of the EMMTE model. The EMMTE model output (Fig. 11) reveals differences in nitrate source contributions between Cluster-1 and Cluster-2. In Cluster-1, the contributions from potential nitrate sources were SON (68.4%), M&S (16.5%), CF (11.9%), and AD (3.3%). In Cluster-2, the contributions were SON (60.1%), M&S (35.5%), CF (3.2%), and AD (1.2%). In both Cluster-1 and Cluster-2, AD contributed minimally, which is consistent with the results in Fig. 10, where no samples fell within the atmospheric deposition zone. According to previous studies, atmospheric nitrogen deposition (TN) in the area ranges from 17.6 to 22.8 kg N/ha year*!. This low AD impact is likely due to microbial nitrification altering most of the AD in soil before it enters the water environment. Therefore, the contribution of AD was very limited”. As a traditional agricultural area, the study region has high nitrogen fertilizer usage, approximately 190 kg N/ha (data from http://www.pds.gov.cn/). In agricultural production, nitrogen fertilizer not absorbed by crops, along with accumulated soil nitrogen, gradually leaches into the groundwater system. Hence, it is unsurprising that considerable NO” loads in Cluster-1 and Cluster-2 (68.2% and 60.3%, respectively) are attributed to soil nitrogen. Notably, in Cluster-2, the contribution from CFs decreases by 8.7%, while M&S contributions increase to second place. This suggests that M&S was the main contributor to the high nitrate concentration in Cluster-2 within the same soil context. Figure 1 shows that most Cluster-2 sampling sites are located around residential land. Given the realities of the study area, the arbitrary discharge Figure 11. Proportional contribution of four potential sources of NO; in the Sha River basin watershed as estimated by EMMTE. AD atmospheric deposition, CF chemical fertilizer, SON soil N, MeéS manure and sewage. and leaching of domestic sewage are responsible for these results. This outcome is unrelated to the application of chemical fertilizers. The EMMTE model used in this study is a random statistical variable model, so the contribution estimates for each source are part of a probability distribution with uncertainty. To analyze the uncertainty in the distribution of nitrate sources, we used an uncertainty index (Ulg9)°. Ugg denotes the difference in the proportional contribution between the 5% and 95% quantiles divided by 0.9 (see detailed information in Wang et al. (2023))!°. The Ulsy index reflects the range of uncertainty in the contribution rate, with higher Ulsy values indicating greater uncertainty in the contribution rate. The results shown in Fig. 12 indicate that AD has the smallest uncertainty in both Cluster-1 and Cluster-2 (UI90 = 0.03, 0.10), suggesting that its contribution is stable with minimal spatial-temporal variation. In Cluster-1, SON has the highest uncertainty (UI90 = 0.67), followed by M&S (UI90 = 0.49) and CF (UI90 = 0.34). In Cluster-2, SON (UI90 = 0.62) shows the highest uncertainty, closely followed by M&S (UI90=0.61). The increased uncertainties in SON and M&S are likely due to the spatial and temporal variability in their isotopic compositions. For example, increased precipitation during the rainy season causes fluctuations in the water table, which alters the redox environment of the soil and groundwater and affects the nitrogen cycle (e.g., nitrification, denitrification, nitrate reduction, etc.). This leads to isotopic fractionation and increasing uncertainty in NO; sources. The high uncertainty in the EMMTE distribution results is unavoidable, stemming from the broad range of potential source proportions, large standard deviations, limited sample size, and absence of field measurements of pollution source isotopes in the study area. Despite this uncertainty, M&S inputs are identified as the main contributors to high nitrate levels; therefore, the improvement and refinement of rural wastewater treatment facilities is a key factor in controlling nitrate pollution in the Sha River Basin. Additionally, to enhance nitrate traceability analysis accuracy, further isotopic measurements of nitrate sources and determination of isotopic fractionation factors during the nitrogen cycle in the study area are needed.",
    "This study employed SOM clustering to downscale and cluster groundwater hydrochemistry indicators in the Sha River Basin. Chadha and Gibbs plots were used to illustrate the hydrochemistry of these clusters. Water isotopes were utilized to ascertain the groundwater source, along with its recharge and discharge conditions. In addition, the distribution, source, transformation and contribution of nitrate in the groundwater system were analyzed using isotope data and the EMMTE model. The results show that the SOM classified 11 hydrochemistry parameters into two clusters, which paired with Chadha plots indicating that the dominant hydrochemistry phases were HCO,-Ca—Mg and Ca—Mg-Cl. The Gibbs plots suggest that rock weathering is the dominant process influencing groundwater hydrochemistry in both clusters. The 5D-H,O and 6'8O-H,O compositions reveal that the groundwater predominantly originates from recent precipitation, with minimal changes due to evaporation. Nitrate isotope analysis indicated that 74% of the groundwater NO,-N content exceeded the national Class III standard limit (20 mg/L). In both Cluster-1 and Cluster-2, denitrification was absent, and nitrification was the primary nitrogen cycle process. According to the results of EMMTE modeling, SON was the main source of nitrate in Cluster-1, followed by M&S, CE, and AD; in Cluster-2, SON was still the main source of nitrate, with significant increase in the contribution of M&S, suggesting that anthropogenic activities are the main cause of nitrate contamination. Given that SON and M&S are the main NO; sources in the groundwater around the Sha River, implementing effective farming practices, enhancing fertilizer use efficiency, improving rural sewage treatment facilities, and uniformly collecting and treating sewage and manure are important ways to reduce NO; pollution in aquifers in watersheds. In this study, by combining SOM modeling and isotope data, we revealed the natural and anthropogenic sources of nitrate, which provides useful information for the continuous management and pollution control of groundwater in the Sha River Basin. Figure 13. Location maps depicting China (a) and the study area (b), along with a land use map, indicating the locations and sampling sites within the study area (c). The map in figure was generated by ArcGIS Desktop 10.7 software (https://www.esri.com/). The study area, which is situated at 112° 50'-113° 15’ E, 33° 50’-35° 40'N, is in southwestern Henan Province, upstream of the Huai River Basin (Fig. 13). The area falls within the temperate continental monsoon climate zone and is characterized by distinct dry and wet seasons. The average annual temperature is 14.9 °C, ranging from a minimum of 1.2 °C in January to a maximum of 27.6 °C in August. The annual rainfall varies between 373.9 and 1361.9 mm, with 70-80% occurring between June and September (data from http://www.weather.com.cn/). The predominant soil types are deep-layered alluvial soils, primarily silty loam in texture. The main land use in the study area is agriculture”. The land use type is dominated by arable land with a cultivated area of approximately 446 kha and fertilizer application of 727 kg/ha. The main food crops include wheat and corn, while the cash crops include cotton, peanuts, rapeseed, and tobacco (data from http://www.pds. gov.cn/). The groundwater in the study area is categorized into four groups: loose rock pore water, carbonate rock fissure karst water, clastic rock fissure pore water and bedrock fissure water. Groundwater recharge primarily occurs through atmospheric precipitation, surface water, and irrigation, while discharge occurs via vertical evaporation, artificial extraction, and lateral runoff’. Field investigations and sampling were conducted in the Sha River basin in August 2021 (Fig. 1). A total of 39 samples were collected from shallow groundwater for geochemical analyses, including in situ physicochemical parameters, major ions and trace elements, along with stable isotope measurements of water and nitrate. All the wells chosen for sampling served domestic and agricultural purposes. The groundwater was pumped before sampling until the physicochemical parameters stabilized. The samples were then stored in high-density polyethylene bottles: one 1.0 L bottle for major ion analysis and four 100 mL bottles for trace element and isotope analysis. On the day of sampling, two samples were filtered through a 0.22 um membrane for stable isotope analysis. For trace element analysis, two samples were filtered through a 0.45 um membrane, with one acidified using HNO,. All the samples were refrigerated at 4 °C until analysis.",
    "The pH, electrical conductivity (EC), water temperature (Tw), total dissolved solids (TDS) and redox potential (ORP) of the water were measured in situ using a portable meter (Kedida CT6021A, China) and (Hanna HI98130, Italy) with detection limit of 0.1 mg/L. Cations such as K*, Ca”, Na*, Mg”*, Fe and Mn were analyzed using inductively coupled plasma (ICP) emission spectrometry (Optima 7000, USA) with an analytical uncertainly of + 1%. Bicarbonate concentrations were determined through acid—base titration. Anions, including F-, NO,, NO; and SO,”, were analyzed by an ion chromatography instrument (MIC 7, Merton, Switzerland) with an analytical uncertainly of + 1%. The above experiments were completed at the Henan Key Laboratory of Water Pollution Control and Rehabilitation. Water isotopes (SD-H,O and 5!8O-H,O) were measured using an isotope ratio mass spectrometer (Finnigan MAT Delta S, Thermo Fisher, USA). The analytical precision was + 0.1%o for 5'$O-H,O and + 1%o for 5D-H,0. Ryample AN Retandara Tepresent the 5D and 5'°O ratios of the groundwater sample and standard, respectively. Nitrate isotope analysis was carried out at the Third Institute of Oceangraphy, Ministry of Natural Resources, China using the bacterial denitrifier method. Groundwater NO; is converted to N,O by denitrifying bacteria and analyzed by an isotope ratio mass spectrometer (MAT 253 Thermo Fisher, USA)*”. An international standard (USGS-32, USGS-34) was used for isotope calibration. The analytical precision for 6!°N and 5'8O were 0.22%o and 0.39%o, respectively. The 5'°N and 5'8O values of NO; are usually expressed in delta notation (6, unit %o) in common with Eq. (1)*!. Reampte ANd Retandara Tepresent the '°N/™N (5™N) and '80/'6O (5!8O) ratios of the groundwater sample and standard, respectively. The self-organizing map (SOM), which is an unsupervised artificial neural network model, was proposed by*. SOM can map high-latitude raw data to a two-dimensional plan preserving the topology of the raw data and the stability of the metric relations, which makes it ideal for nonlinear dimensionality reduction and unsupervised classification’. The main considerations for developing an SOM include its structural design, training algorithm and neighborhood kernel function****. The number of mapping nodes is determined by the following equation®: where m is the number of nodes and n is the number of samples, which affect the accuracy and applicability of the SOM. The quantization error (QE) and terrain error (TE) are used to evaluate the selection of map nodes and the optimal number of nodes**”*. Since the SOM cannot automatically determine the optimal number of clusters, the K-means algorithm is employed to classify the transition boundaries and clusters of the output units. The optimal number of clusters is determined by the the minimum Davies-Bouldin (DBI) value*’. where C;+ Gis the sum of the mean distances from all points to the centroid point of the cluster, and d(C, CG) is the distance between the centroid points of clusters i and j. Lower DBI values indicate that the data are well clustered, with points in each cluster similar to each other but distinct from points in other clusters****. Thus, the minimum DBI of the k-means algorithm is the basis for determining the optimal number of clusters. The present study implemented the SOM algorithm in R (package ‘aweSOM’). This study employed the EMMTE model to ascertain the relative contributions of NO; from various sources. EMMTE is an end-member mixing model tool developed in Excel™”’. The basic principle can be expressed as follows: where 5°N¢,,4) and 6'%O(m,4) represent 6'°N-NO; and 6'*O-NO, values in the groundwater for the k,, sampling, respectively; 8° Neerronk) ANd OO ferror,x) are the residual error between observed and predicted abundances for 6N-NO, and 5'*O-NO,_ at the k,, samplings of the total of K samplings. 5!°N;,,) and 6'O,,,, are 5'°N-NO,- and &'8O-NO, values for the n,, sources. While f,,,,,) indicates the proportion of the n,, source in the k,, groundwater sampling. Relative deviation (RD) is used for screening random samples. More detailed information on the EMMT model can be found in Ref.”*."
]