[
    "The 24 solar terms are a significant component of traditional Chinese culture. Amid global warming climate change, research on the Solar Terms has gained increasing prominence. Identifying the geographical origins of the Solar Terms not only provides evidence for studies on the origins of Chinese agricultural civilization but also serves as a critical foundation for the innovative utilization of traditional culture in the modern era. Previous research has primarily relied on historical records, literature review, and field investigation, often challenged by the vast and complex data, the difficulty distinguishing authenticity, the time-consuming nature of the work, and the need for direct scientific evidence. The STTMD (Solar Terms Typical Meteorological Day) method was used for typifying solar term meteorological data sequences, supplemented by isothermal estimation and clustering analysis. This approach was further validated using key crop germplasm sites, phenological indicators, and phenological observation contour maps. The results derived from statistical methods are cross- referenced with historical documents to infer the geographical origins of the 24 Solar Terms. The findings indicate that: (1)On a larger spatial scale, the Solar Terms originated in the middle and lower reaches of the Yellow River; (2)On a smaller spatial scale, the \"Luoyang-Zhengzhou-Anyang\" triangle is the most probable origin area; (3)The core area of origin is hypothesized to be in present- day Xingyang, Henan Province, or slightly further north. These results are consistent with historical literature and phenological records of crops, offering a novel analysis and transformative insights into the knowledge of Solar Terms. The study provides valuable evidence or methodological inspiration for historical agricultural research in China and offers references for agricultural production and the environmental impacts of global warming. Keywords 24 solar terms, Geographical origin, STTMD method, The middle and lower reaches of the Yellow River (MLYR), Agricultural production, Phenological indicators Climate is a critical factor in the the development of human societies, playing a significant role in shaping the course of human history and social civilization over the long term. Its impact extends across various domains, affecting settlement patterns, agricultural practices, resource management, and cultural development, thereby underscoring its profound significance in the progression of human civilization. Throughout history, humans have observed, understood, utilized, and managed climate, integrating this knowledge into various aspects of production and daily life. These efforts have led to the formation of knowledge systems and adaptive strategies, and the development of climate-related beliefs and institutions, culminating in the creation of diverse climate cultures. The concept of “Solar Terms” originated from the ancient Chinese people’s long-term observations of production and daily life. Its encompasses the Earth-Sun relationship, the calendar system, climatic characteristics, and phenological sequences (Fig. 1). As a representative of traditional Chinese climate culture, the Solar Terms have been inscribed on the UNESCO Representative List of the Intangible Cultural Heritage of Humanity. The Shangshu · Yao Dian provides one of the earliest references to the 24 Solar Terms:\" At midday, the Bird Star signals mid-spring; during the longest days, the Fire Star marks mid-summer; at midnight, the Void Star indicates mid-autumn; and with the shortest days, the Hairy Head Star denotes mid-winter.\" This passage demonstrates that as early as the Western Zhou period, ancient Chinese people were already using the terms spring, summer, autumn and winter to represent seasonal temperature variations1. In the mid-Western Han Dynasty, Sima Qian oversaw the compilation of the Taichu Calendar, which was based on the phenological and climatic changes of the Yellow River basin. This calendar standardized the agricultural time system originating from the middle and lower reaches of the Yellow River across the nation, officially incorporating the “24 Department of Urban and Rural Planning, School of Architecture and Art, Hefei University of Technology, Hefei, AnHui, China. email: june4ni@126.com; 2019111100@mail.hfut.edu.cn Solar Terms” into the state calendar system2. Based on this framework, the “24 Solar Terms” established the fundamental agricultural production patterns, reflecting the agricultural climatic characteristics of the MLYR. This system guided production, daily life, and socio-economic activities in the Central Plains region over the long term for centuries. Subsequently, it was implemented nationwide as a unified agricultural time system, with regional adaptations made according to local geographical, climatic, cultural, and societal traditions. The Solar Terms constitute a significant milestone in ancient Chinese meteorological science, embodying the ecological wisdom of early civilizations that harmonized agricultural activities with seasonal cycles, established early calendar systems, observed astronomical phenomena, and recorded phenological changes to optimize production and mitigate natural disasters. Rooted in the variations of Earth’s solar exposure and its orbital relationship with the Sun, the Solar Terms system serves as the foundational structure of the agricultural timekeeping framework (Fig. 2), ensuring its enduring stability. This system also encapsulates the distinct natural rhythms integral to the traditional Chinese calendar. Ancient ancestors civilizations utilized knowledge of the Solar Terms to summarize and predict climate changes, such as temperature fluctuations and precipitation patterns, to guide agricultural production effectively. This division of climate seasons based on Earth-Sun temporal changes differs slightly from the meteorological classification of climate zones by geographical latitude. It directly identifies patterns in the Sun’s periodic positional changes that influence atmospheric movement, pinpointing the critical factor in seasonal climate variations: the Sun’s periodic position changes, as reflected in temperature fluctuations3. Consequently, each Solar Terms corresponds to specific solar motion characteristics, marking the Sun’s position on the ecliptic and closely linked to seasonal and agricultural activities. This system encapsulates the fundamental laws governing the relationship between the Sun, the Earth, and the atmosphere. Agricultural production in ancient China was heavily dependent on seasonal changes. Given China’s unique geographical location in East Asia, it was crucial for the ancestors to accurately understand seasonal patterns to determine the timing of agricultural activities such as spring sowing, summer cultivation, autumn harvesting, and winter storage. Ancient Chinese closely observed celestial phenomena, natural signs, and temperature fluctuations, using the \"24 Solar Terms\" to track the Sun’s movement relative to Earth. This alignment ensured that agricultural practices were in harmony with seasonal changes. Local communities further refined these timings based on their specific geographic conditions and the impending seasonal weather, thereby determining optimal planting periods and predicting agricultural cycles for the coming year. This accumulated knowledge provided a critical foundation for the development and application of agricultural practices, ensuring their effectiveness and sustainability over time.",
    "The Solar Terms continue to play a significant role in modern agriculture practices and cultural activities. They serve not only as cultural symbols and spiritual markers but also support contemporary developments such as crop planting, rituals, and travel, closely linked to the revival of traditional culture and the strengthening of national identity. However, due to the limitations of ancient meteorological observations and the lack of verification for some recorded data, the scientific accuracy of the solar terms is questionable, and their reliability remains uncertain. This has led to challenges in fully realizing the potential of the \"24 Solar Terms\" in practical applications today. This study employs the STTMD method to corroborate conclusions derived from mathematical and statistical analysis with historical records, aiming to identify the geographical origin of the Solar Terms. Additionally, it examines and validates the feasibility of using “Solar Terms” as historical coordinates to explore the spatial “origin” of cultural development. The findings contribute to the study of China’s agricultural history and offer methodological insights for related historical and cultural research. This research represents an innovate approach to the study and application of traditional culture, while also expanding the use of the STTMD method. The “Isothermal presumption” method is a commonly employed analogy method in meteorological archaeology, used to infer climate conditions of historical periods based on the meteorological characteristics of different eras or recent years. This method aims to approximate the temperature conditions of a historical period by identifying similar temperature environments, thereby enabling the study of that period. In the absence or insufficiency of direct historical meteorological data, recent temperature records and trends are used to estimate the temperature conditions of a comparable historical era. thereby reconstructing the historical climate scenario. The feasibility of the isothermal presumption method has been widely validated by scholars. For instance, Luterbacher et al.4 reconstructed and assessed recent climate trends by referencing spatio-temporal climate changes from 1901- 1960, with subsequent validation of the reconstructed climate results using data from 1961-1990. Similarly, Pfister et al.5 reconstructed the climate characteristics of 1540 using indicators such as temperature, humidity, and precipitation during a documented drought, and compared these with grape phenology data from 1444 to 2011 to accurately reproduce the temperature characteristics of that historical period. The approximate time of the origin of the solar terms can be determined by studying historical documents. Chinese scholar Wan Minwei suggests that the earliest systematic account of the “solar terms” can be traced to the Xia Xiao Zheng, a text originating from the Xia Dynasty and completed during the Spring and Autumn period6. This work, dating approximately from 2070 BCE to 1600 BCE, includes the phrase \"only one awakening of insects7 \". It records, \"At times, the day grows longer; at times, the night grows longer.\" The Zuo Zhuan interprets “growth” as \"elongation,\" and the Lüshi Chunqiu mentions \"the longest day\" and \"the shortest day,\" suggesting early references to the summer and winter solstices8. The ancient text Shangshu · Yao Dian provides the first record of the \"two equinoxes and two solstices,\" with A History of Chinese Astronomy documenting the origins of solar terms:\"morning measurements of the meridian established the winter solstice around 2100 BCE, while evening measurements established the summer solstice around 1000 BCE, at the transition between the Shang and Zhou dynasties.\" The Zuo Zhuan from the Warring States period notes,“equinoxes, solstices, beginnings, and endings must be recorded with meteorological observations for reference”9. Scholar Zheng Yan10 proposed that, at least in the Zhou Dynasty, there was an understanding of the four seasons, which, alongside the development of astronomical calendars, led to the formation of detailed agricultural timing concepts. In conclusion, the origin of solar terms likely coincides with the early stages of astrological observations and ancient calendrical systems8, although this does not pinpoint their geographical origin. To summarize, the origin of solar terms likely coincides with the early stages of astrological observations and ancient calendrical systems, dating back to Based on the findings of Zhu Kezhen11 regarding the \"Five Thousand Years of Temperature Changes in China\" (Fig. 3) and the \"Three Thousand Years of Phenological History in China12. '(Fig. 4), the current global warming trend has resulted in temperature conditions in China, since 1950, that are comparable to those of several historical periods, including 1000 BCE (late Shang to early Zhou), 800 BCE (Spring and Autumn period), 200 CE (Western Han), 400 CE (Eastern Jin), and 1050 CE (Northern Song). By comparing these results with studies on China’s climate and temperature changes by scholars such as Liu Kai13, Tang Guoli14, and Zhang Jishen15, it can be inferred that the present era, with its recorded instrumental data, is the most similar to the climate conditions during the origin of the solar terms since the Northern Song period. This similarity allows for the application of the “isothermal presumption” method to preliminarily define the research period. This approach suggests that current climate conditions are closely analogous to those during the origin of the solar terms (approximately from the late Western Zhou to the Spring and Autumn period), thus providing a basis for using contemporary meteorological data to simulate the climate conditions during that origin period in subsequent analysis.",
    "The concept of the 24 solar terms originated in the middle and lower reaches of the Yellow River in China and represents a unique astronomical and climatic calendar that reflects the fundamental relationships between the Fig. 3. The solid line illustrates the elevation of the snowline in Norway over the past ten thousand years, while the dashed line represents temperature variations in China over the last five thousand years, providing a comparative analysis of climatic trends across these regions9. Fig. 4. The variation in average temperatures across 699 meteorological stations in China from 1951 to 2018, providing a comprehensive analysis of temperature trends over this period11. Sun, Earth, and atmosphere. Each solar term is determined by the Sun’s specific position along the ecliptic. For instance, when the Sun is at 0° longitude on the ecliptic, it marks the Spring Equinox (ST6), and at 180°, it marks the Autumn Equinox (ST18) (Fig. 2). According to the “DingQi”method, a new solar term is established every 15° of solar longitude43. These solar terms objectively represent the dynamic relationship between the Earth and the Sun, with each of the 24 nodes exhibiting distinct solar radiation characteristics. For example, in the Northern Hemisphere, the Winter Solstice (ST24) has the shortest daylight and longest night of the year, while the Summer Solstice (ST12) is the opposite. During the Spring Equinox (ST6) and Autumn Equinox (ST18), day and night are of equal length. In traditional Chinese astronomy, each solar term is spaced approximately 15 days apart and is used to guide agricultural practices and climate prediction. Phenological observations related to agricultural activities have confirmed that these solar terms have high meteorological representativeness in specific regions44,45. Each solar term corresponds to specific solar radiation characteristics that reflect broader climatic patterns in nature, directly influencing plant phenology, such as germination, flowering, and fruiting. Plant phenology represents the response of plants to climatic conditions throughout their growth cycle, and it varies across regions, offering insights into local climate conditions. Plant geography studies how geographical factors impact plant distribution and helps elucidate the relationship between solar terms, climate change, and plant phenology. For instance, the climatic conditions indicated by a particular solar term may lead to different phenological events in various geographical regions, a difference that plant geography can help explain. Consequently, each solar term may be associated with specific bioindicators, but geographical variation can result in different bioindicators for the same solar term in different regions. Overall, regional climatic conditions—such as temperature, precipitation, and sunlight—determine plant distribution and growth cycles. Solar terms, by marking these climatic changes, provide a temporal framework for agricultural activities and phenological studies. Thus, solar terms not only guide agricultural practices but also reflect the plant geographical characteristics of specific regions. Studying the relationship between solar terms and plant geography can improve our understanding of how climate change impacts plant distribution and agricultural production. In recent years, scholars have conducted extensive research on meteorological and phenological changes in the middle and lower reaches of the Yellow River. Wang Zhenhong16 compared temperature and precipitation data around the End of Heat and the White Dew, along with seasonal transitions and plant phenology across nine cities in China, concluding that the 24 solar terms are primarily applicable to the Yellow River basin, particularly aligning with the climatic characteristics of its middle and lower regions. Ji Cuihua et al.17 analyzed the variations in meteorological elements associated with the 24 solar terms in the middle and lower reaches of the Yellow River from 1961 to 2020, revealing significant warming during spring-type solar terms and substantial increases in minimum temperatures during winter-type solar terms under global warming conditions, with over half of the solar terms showing notable temperature increases. Wang Shuixia et al.18 investigated the climatic characteristics of the early 6th century in the middle and lower Yellow River basin using phenological information from the Qimin Yaoshu, including crop sowing times, growth durations, and corresponding solar terms, indicating that such data can infer the region’s historical climate patterns. Although numerous studies, historical records, folklore, proverbs, archaeological sites, and meteorological observations suggest that the solar terms originated in the middle and lower Yellow River region, and many researchers have noted or directly asserted this origin, there remains a lack of scientific evidence and rigorous validation. Despite the presence of numerous related archaeological sites near this area, existing historical documents, literature, and archaeological findings alone are insufficient to definitively confirm the precise geographical origin of the solar terms.",
    "Based on the core principles of solar terms knowledge, Li Junfeng19,21,20 proposed a research method called the \"Solar Terms Typical Meteorological Day\" (STTMD), which involves typifying of meteorological data on solar terms days. The STTMD method combines the traditional Chinese solar terms system with the generation of typical meteorological days, processing long-term hourly meteorological data (≥ 30 years) to create a continuous sequence representing a synthetic meteorological year characterized by the 24 solar terms. This sequence’s strength lies in its hourly data tied to specific time nodes, with solar radiation being the highest-weighted factor in data selection. Consequently, each selected solar terms’ typical meteorological day is tailored to reflect a specific region’s unique solar radiation and corresponding phenological characteristics during a specific period. This method provides stable outputs for describing long-term meteorological features. By incorporating statistical approaches, this method introduces a quantitative dimension to meteorological archaeology, offering new perspectives for studying traditional Chinese meteorological culture, often dominated by qualitative research. The following is the specific application of the STTMD method in the article: The selected meteorological parameters include maximum, minimum, and average dry bulb air temperatures (Tmax, Tmin, Tavg), minimum and average relative humidity (RHmin, RHavg), maximum and average wind speed (Vmax, Vavg), and horizontal daily cumulative solar radiation (SW).The weighting of each meteorological parameter follows the settings outlined in Jiang46–49. For simplification, only the daily cumulative horizontal surface radiation is considered, with a weight assigned at 10/20. The final meteorological parameters and their corresponding weights are presented in Table 1. Hourly meteorological observation data from 1981 to 2010 were used to collect eight meteorological parameters for each of the 24 Solar Terms annually. The daily averages of each meteorological parameter Xi,s,y were then calculated, where i represents the serial number of the meteorological parameter, s represents the Solar Term, and y represents the year. Subsequently, the 30-year (1981–2010) mean value Xi,s and standard deviation Si,s for each meteorological parameter and Solar Term were calculated as shown in Eq. (1): Here,Ki represents the weight of each meteorological parameter (Tab. 1). DS is the aggregated value of the eight statistical parameters, with smaller DS values indicating closer alignment with the long-term average. Consequently, the Solar Term Day with the smallest DS value is selected as the representative day, and the meteorological data for that day are processed into the STTMD dataset. (3) Linking the selected sequence of 24 typical Solar Terms provides a structured framework for analyzing the climatic patterns that influence crop phenology throughout the year. The STTMD method, which derives solar term data from different years, reflects the inherent variability in climate conditions over time. It is essential to consider the conditions from several days before and after each typical solar term to capture the nuances of these climatic patterns. This ensures that the selected solar term data accurately represents the climatic variability directly impacting agricultural cycles, such as planting, growth, and harvest. As a result, the sequence of 24 typical Solar Terms from different years can effectively capture the key climatic features that influence crop development and phenological changes over an extended period, providing valuable insights for agricultural (4) Selection of Typical Solar Term Days: We identified the cumulative annual Solar Term Days with the smallest DS value for each Solar Term from 1981 to 2010. This selection process created a hypothetical meteorological year, providing a set of simplified and representative typical data for Solar Term Days during the 1981–2010 period (Table 2). These selected days serve as a basis for examining the impact of climatic patterns on crop phenology, offering insights into how seasonal variations associated with Solar Terms influence key stages of crop growth and development. Based on the selected Solar Term days and corresponding years, the relevant meteorological elements were extracted from the 1981-2010 observation data. Figure 5 illustrates the annual STTMD data, comprising 24 datasets, using the Zhengzhou [113.5, 34.75] site as an example. These data provide a representative framework for analyzing climatic impacts on crop phenology and can be applied to studies of environmental conditions affecting agricultural practices. Based on the research period determined in the “isothermal presumption” section and the central region map of the Western Zhou Dynasty (Fig. 6), it is evident that the capital cities and other settlement centers during the Western Zhou period were primarily concentrated in the middle and lower reaches of the Yellow River. Most settlements were located on the plains along the Yellow River and its tributaries, with a few situated within ridge lines, corresponding closely with the origins of agrarian civilization. Additionally, drawing on the agricultural development zones of the Western Zhou period delineated by Chen Wenhua22, the study area is preliminarily Fig. 6. Settlement distribution map of the Western Zhou Dynasty23. *Note: The map includes a base layer from ArcGIS Pro 3.0.2 World_Imagery (MapServer52) with additional data such as \"Mountains,\" \"Capitals,\" and “Archaeological Sites” from The Historical Atlas of China23, pages 17-18, showing the central Western Zhou region. The \"Settlement Kernel Density\" analysis highlights densely populated areas based on \"Capital City,\" \"City and Town,\" and “Temporary Capital” data, serving as a reference for selecting meteorological data sampling points divided into seven regions: the Jingwei area of Shaanxi, southern Shanxi, Henan, southwestern Shandong, Hebei, the Jianghuai area of Anhui, and the Jianghan area of Hubei.",
    "The clustering analysis conducted in this study aggregates collections of meteorological data sequences with similar characteristics. Cluster analysis is an unsupervised learning method that divides a dataset into multiple clusters by maximizing intra-cluster similarity and minimizing inter-cluster similarity. The number of clusters is typically determined using the Elbow Method, which analyzes the sum of squared errors as the number of clusters increases, or the Silhouette Score, which assesses the cohesion and separation of the clusters. The resulting centroid curve represents the average trend within each cluster, characterizing its key features and aiding in pattern recognition, classification, and prediction tasks. The clusters most closely aligning with the solar terms features are considered representative of the geographic space where the solar terms likely originated. The analysis comprises three stages: In the first stage, a hierarchical clustering analysis was performed on the meteorological data sequences from 61 representative stations nationwide, with specific attention to identifying and marking stations located in the middle and lower reaches of the Yellow River24. This initial analysis yielded a preliminary climate zoning with solar terms characteristics, which was then compared to the geographical range of the Yellow River basin. In the second stage, based on the initial clustering results and the settlement distribution map of the Western Zhou period, the sampling within the Yellow River basin was refined. A total of 150 sampling points were selected in the densely populated settlement areas. A secondary cluster analysis using k-means was conducted on the daily average temperature data from these 150 sampling points (Fig. 7) to obtain a more precise estimate of the origin area. In the third stage, the meteorological central curve of the origin area was derived from the secondary cluster analysis. This curve represents the most typical climate characteristics associated with the solar terms. The Dynamic Time Warping (DTW)50,51 method was then used to compare the climate characteristics of the 150 refined sampling points against the central curve of the middle and lower reaches of the Yellow River. The DTW distances were analyzed using radial basis function (RBF) spatial interpolation to map the similarity distribution between each sampling point’s climate characteristics and the central curve. The region with the shortest DTW distance indicates closer proximity to the core geographical area of the solar term origin. Phenological verification is a common method in climate archaeology. The phenological calendar, originating in the primitive society during the development of human gathering and hunting economies, served as a critical reference for early agricultural societies alongside astronomical calendars. It provided ancient agricultural communities with a complex biological calendar to track production cycles, guide harvesting and hunting, and adapt to environmental changes. This calendar also offers modern valuable observational data. By using phenological observations to verify the climatic characteristics of the solar terms origin, researchers can accurately determine the temperatures required for key agricultural stages such as sowing and germination, thereby enhancing the validity of the study’s findings. For this study, the primary crops of the Neolithic and Xia, Shang, and Zhou periods were selected as phenological indicators. These were cross-referenced with historical records of crop phenology and scientific research results, using documented phenological patterns as a guide. By comparing these patterns with variations observed around specific solar terms, the climate characteristics of the middle and lower reaches of the Yellow River during the study period were inferred. This process allows for a more accurate verification and estimation of the geographical origin of the solar terms. The study data were sourced from the ERA5 hourly meteorological dataset25. In accordance with the World Meteorological Organization’s (WMO) definition of a standard climate period (30 years), six primary solar term zones were generated based on data from 61 representative stations across China (Fig. 8a). For further analysis, 150 sampling points were selected from Zone IV-3, focusing on areas of dense settlement distribution within a 0.25° latitude-longitude grid. The study utilized hourly meteorological data from 1991 to 2020 for these points. By applying the “isothermal presumption” method, the current meteorological data were used to analogize the climate characteristics of the Western Zhou period, allowing for a deeper examination and analysis of the historical and literary records concerning the origin of the solar terms. The middle and lower reaches of the Yellow River as the primary geographical origin of the Solar Terms on a Utilizing SPSS for cluster analysis(Fig. 8-a), the median clustering method based on squared Euclidean distance was employed, categorizing 61 national stations into six primary clusters (I–VI) and 13 secondary subregions: I-1, I-2, I-3, II-1, II-2, III-1, III-2, IV-1, IV-2, IV-3, IV-4, V-1, and V-2. Region VI contains only a primary region without further subregions.",
    "Further analysis(Fig. 8-b) of the climatic characteristics on the Solar Terms Days within this region reveals that most stations align with the \"Spring Equinox(ST6)\" at the transition from winter to spring, the \"Autumn Equinox(ST18)\" at the transition from summer to autumn, and the \"Beginning of Winter(ST21)\" at the transition from autumn to winter. According to the seasonal division standard defined by GB/T 42074-2022 in China, the timing of seasonal transitions in the IV-3 subregion aligns more closely with the \"Two Equinoxes and Two Solstices\" (Spring Equinox(ST6), Summer Solstice(ST12), Autumn Equinox(ST18), Winter Solstice(ST24)), Fig. 7. Distribution map of research sampling points23. *Note: The map features a base layer from ArcGIS World_Imagery (MapServer) and the \"Large-scale Agricultural Area of the Western Zhou Dynasty\" boundary from22. Base map details like \"Mountains,\" \"Capitals,\" and “Archaeological Sites” come from the China Historical Atlas23. Our original \"Settlement Kernel Density\" analysis identifies densely populated regions, guiding the selection of \"Experimental Sampling Points\" in flat, populated areas. These points, with 0.25° precision, are used to collect hourly meteorological data from 1991-2020 for further analysis using the STTMD consistent with the astronomical definition of seasons. The most representative station in this subregion is Zhengzhou, which aligns with findings in the literature26. The climate change trends observed at most stations within the IV-3 cluster align closely with the seasonal changes described by Qian Cheng et al.27 , highlighting the typicality of Solar-Terms climates in the middle and lower reaches of the Yellow River. On a larger scale, China’s most concentrated and contiguous arable land is primarily located in the North China Plain (including Henan, northern Anhui, Shandong, etc.), corresponding to the Yellow River’s middle and lower reaches. The extensive agricultural activities in this region have fostered the development of Solar Terms based on local meteorological conditions, which have subsequently spread widely. Among all regions nationwide, the IV-3 cluster most comprehensively reflects the primary climatic characteristics of each Solar Terms. Therefore, from a larger spatial perspective, this region can be regarded as the origin of the Solar Terms, a conclusion that fully aligns with findings in the literature7. Fig. 8. (a). Initial Clustering Results53 (b) Annual graph of STTMD for ST Zone IV-3 *Note: Red boxes and arrows indicate the direction of seasonal changes. This graph illustrates that, under global warming, the timing of seasonal transitions in different regions of China deviates to varying degrees, with some seasons advancing or delaying, leading to unequal seasonal lengths.53 A secondary clustering analysis was conducted using K-means based on the initial clustering. This analysis involved 150 refined sampling points within the larger middle and lower Yellow River subregion, selected based on the “isothermal estimation” of the study’s temporal range and referencing the central region of the Western Zhou period. The 24 sets of STTMD data for eight parameters from these 150 stations were analyzed, resulting in a central curve encapsulating the essential climatic characteristics of the middle and lower Yellow River region. a central curve encapsulating the essential climatic characteristics of the middle and lower Yellow River region. Subsequently, the Dynamic Time Warping (DTW) method was applied to compare the STTMD data from each station in the secondary sampling with the K-means clustering central curve. The resulting distances represented the degree of similarity between the climate characteristics of each station and the central curve. Spatial interpolation of the DTW results generated a map of solar term similarity distribution (Fig. 9). In this map, the red areas indicate regions with smaller DTW distances, suggesting a closer alignment of their climate characteristics with those of the middle and lower reaches of the Yellow River. These areas are primarily Fig. 9. Secondary clustering analysis23 *Note:The map features a base layer from ArcGIS World_Imagery (MapServer52) and additional data like \"Mountains,\" \"Capitals,\" and “Archaeological Sites” from the China Historical Atlas23. The \"Origin Similarity Contour\" and \"Origin Similarity Distribution\" are derived from our study. Using the \"Experimental Sampling Points\" from Fig. 7, we applied the DTW method to assess similarity with the central curve from the initial clustering in Figure 8. The contours highlight regions with climate characteristics similar to the hypothesized origin of the solar terms, suggesting these areas as likely origins. in Shaanxi, the junction of the Wei and Luo Rivers in Shanxi, the central-eastern region of Luoyang in Henan, and the southwestern region of Shandong. Notably, the triangular region formed by Luoyang (Fig. 9) exhibits the lowest DTW values, indicating the closest match in climate characteristics to the middle and lower reaches of the Yellow River, making it the most likely origin area for the Solar Terms.",
    "In this triangular area, the region with the smallest Dynamic Time Warping (DTW) values is approximately centred between the Luoyang and Zhengzhou points identified in the initial clustering analysis. The region spans a longitude range of 113.42° to 113.53° and a latitude range of 34.68° to 34.79°, placing it closer to Xingyang City (Fig. 10). Xingyang, located in the western part of Zhengzhou City, lies at the confluence of the Yellow River and the Huai River basins, marking the boundary between the middle and lower reaches of the Yellow River. The Fig. 10. Correspondence between the origin of Solar Terms and Present-day Geographical Locations23 *Note:The map includes data on \"Municipal, Provincial, and Autonomous Region Governments\" and \"Today’s Municipal Government\" from the China Historical Atlas23. The \"Origin Similarity Contour\" and \"Origin Similarity Distribution\" are original results from our study, identifying Xingyang, near Zhengzhou, as the location with the highest origin similarity within current administrative divisions. city is historically significant as one of the early cradles of Chinese civilization, home to the oldest canal source in China, and associated with the Leizu, a legendary figure, as well as the ancestral land of the Zheng family. Scholar Tang Liya et al.28 conducted research on Bronze Age plant and crop sites unearthed in the Central Plains of China. Notably, the Wangjinglou site from the Xia-Shang period in Xinzheng and the Chezhuang site from the Western Zhou period in Xingyang were excavated in Xincheng Town, Xinzheng City, and Chezhuang Village, Guangwu Town, Xingyang City, respectively. These sites are geographically close to each other, with total crop recovery rates of 95.3% and 92.8%, respectively. Flotation analysis indicates that despite belonging to different historical periods, both sites primarily cultivated millet, with some evidence of broomcorn millet. The probability of millet being unearthed was 100% at Wangjinglou and 93% at Chezhuang. Pang Xiaoxia et al.29. noted in their research on the agricultural economy of the Central Plains that millet and broomcorn millet were representative crops of the early dry farming agriculture in the Yellow River basin. Scholar Chen Chaoyun et al.30 conducted research on the Guanzhuang site in Xingyang, which provided evidence of settlement distribution and population migration activities during the Western Zhou period. Additionally, a large Western Zhou residential site was discovered in Jiangzhai Village, Yulong Town, Xingyang, making it the largest early Western Zhou residential remains found in Zhengzhou to date. These findings indicate that Xingyang was a central area for agricultural production in the Central Plains during the Xia, Shang, and Zhou periods. This era was not only crucial for the formation of Chinese civilization but also for the development of agricultural economy, production techniques, farming management, and the agricultural calendar system. The diverse crop system in the Central Plains today can be traced back to this period. The climate characteristics of this region, derived using methods such as STTMD, show a strong correlation with China’s early agricultural civilization, suggesting that this area is likely the core origin of the Solar Terms. While this study uses the “isothermal presumption” to suggest that current temperature patterns are highly similar to those of the Western Zhou period, leading to the hypothesis that the origin of solar terms may be around Xingyang, Henan, there remains a margin of error in this estimation. Considering the north-south temperature gradient, where temperatures decrease with latitude, the current climate has not yet fully matched that of the Xia Dynasty, with a difference of approximately 1.5 °C. Therefore, a more accurate origin may lie further north of Xingyang, Henan. This hypothesis aligns with analyses suggesting that the solar terms likely originated in the \"Luoyang-Zhengzhou-Anyang\" triangular area. Chen Wenhua et al.22 conducted an archaeological study summarizing agricultural development during the Xia, Shang, and Western Zhou periods. Their research categorizes the Western Zhou agricultural regions into eight areas, including the Jing Wei region of Shaanxi,eastern Gansu, and southern Shanxi. The Zhou Li : Zhi Fang Shi recorded agricultural practices in ancient Yuzhou, stating, \"Its livestock includes six types (the six domesticated animals), and its crops include five varieties (millet, broomcorn millet, legumes, wheat, and rice).\" Ancient Yuzhou corresponds to the present-day Henan region. You Xiuling31 studied the origin and spread of millet and broomcorn millet, concluding that these crops were among the earliest domesticated grains in northern China’s primitive agriculture and that the region was a centre origin point for their global cultivation, contributing to the development of Chinese civilization. Millet and broomcorn millet seeds have been found in various pre-Qin archaeological sites, further supporting this origin. This study references the work of You Xiuling31, Jin Guiyun32 , and Tang Liya28 to compare the spatial distribution of millet and wheat remains from the Neolithic, Xia-Shang- Zhou, and Bronze Age periods with the proposed origin of Solar Terms. The alignment of these distributions supports the validity of the hypothesized geographical origin of the Solar Terms. Figure 11 illustrates the spatial distribution of millet and broomcorn millet remains from different phases of the pre-Qin period. Notably, Neolithic millet remains were concentrated in central Henan, centered around Xingyang, while Xia-Shang-Zhou wheat remains are primarily found in the Henan region around Luoyang and Weizhongxian, further confirming the area’s suitable geographical environment and agricultural conditions for the birth of the Solar Terms. Bronze Age crop sites in the Central Plains, such as Chezhuang and Guanzhuang, represent early to mid-Western Zhou agricultural prosperity, with millet and broomcorn millet seeds excavated at rates as high as 93%. These sites are also geographically close to Xingyang. Other contemporaneous millet remains are distributed across nearby areas in central Henan, supporting the hypothesis of the Solar Terms’ origin and validating the research period’s feasibility. Scholars Wei Si33 and He Hongzhong34 have also studied the excavation and prehistoric domestication of millet remains, finding that these sites are primarily concentrated in the middle and lower Yellow River regions, including Shaanxi, Gansu, Henan, and Shandong. This distribution aligns well with the proposed origin In 2003, Professor Martin Jones from the University of Cambridge conducted research in China on the origins of millet, prompted by an archaeological discovery at the Xinglonggou site in Inner Mongolia. Carbonized millet seeds found at this site were dated to 7700–8000 years ago, making them 2700 years older than those found in Central Europe, as confirmed by Harvard and the University of Toronto. This finding suggests that nearly 8000 years ago, ancient Chinese communities were already cultivating millet as a staple food. The Xinglonggou site is now regarded as the cradle of dryland agriculture on the Eurasian continent and was recognized by the United Nations Food and Agriculture Organization in 2012 as a \"Globally Important Agricultural Heritage System,\" solidifying millet’s status as an indigenous Chinese crop. Today, the husked form of millet is referred to as \"guzi,\" while the dehusked form is known as \"xiaomi.\" In the ancient regions of Yuzhou (modern-day Henan), Jizhou (modern-day Hebei, Shanxi, and northern Henan), Yanzhou (western and northern Shandong), and Yongzhou (central Shaanxi and southeastern Gansu), millet and broomcorn millet were widely cultivated35. The Ming Dynasty text Tiangong Kaiwu notes, \"To process millet, one must winnow the grains, pound them to refine, grind them into powder, and then use wind and sieve techniques,\" indicating that early inhabitants had mastered millet processing methods. The Erya: Commentary on Meanings states, \"Millet is called 'guzi,' and its grains are 'xiaomi,'\" while the Erya : Explanation of Plants also notes, \" ‘Ji’ refers to millet.\" The Guoyu : Jinyu records, \" The three grains, millet, rice, and sorghum, are staples; the larger, non-sticky variety of millet is distinct from other grains.\" Wei Si33 asserted that the appearance of grinding stones in the Xiachuan culture signaled the dawn of millet-based culture in China. Therefore, this study selects millet as the indicator crop for verifying the climate Based on the isopleth map of phenological characteristics for key growth stages of millet in the Agricultural Phenological Atlas of China36, this study estimates the sowing, heading, jointing, and harvesting periods of millet in the proposed solar term origin region of Xingyang. By cross-referencing these periods with the temperature Fig. 11. Archaeological sites of millet and broomcorn millet from historical periods23 *Note:The map includes data on \"Shusu Site of the Neolithic Age,\" \"Wheat Remains from the Longshan Period,\" \"Wheat Remains from the Xia, Shang, and Zhou Dynasties,\" and \"Bronze Age Sites in the Central Plains and Surrounding Areas,\" sourced from references28,30–33. The \"Origin Similarity Contour\" and \"Origin Similarity Distribution\" are original results from our study. This figure validates the alignment between our similarity contours and the spatial distribution of historical crop remains, confirming consistency with plant geography principles.",
    "requirements for the same growth stages of millet as detailed in the Encyclopedia of Chinese Agriculture: Crops Volume, the corresponding temperature ranges on the central curve are identified and matched to the relevant solar terms. This process verifies whether the agricultural activities associated with millet during these solar terms align with the traditional agricultural practices represented by the solar terms themselves. A strong match would indicate that the proposed origin location is scientifically plausible and that millet serves as a reliable The Encyclopedia of Chinese Agriculture: Crops Volume37 records the temperature ranges and growth periods required for millet development. Millet prefers warm conditions, with an optimal germination temperature of 15–25 °C, a stem and leaf growth temperature of 22–26 °C, and a grain-filling temperature of 20–22 °C. According to the phenological isopleth maps for millet growth in the Atlas of Agricultural Phenology in China (Fig.12), it is estimated that millet in the Xingyang area is sown around late June (near the Summer Solstice, ST12), begins jointing in early August (around the Beginning of Autumn, ST15), heads in late August (near the Fig. 12. Spatial distribution map of 4 different growth stages of millet36. *Note: This figure displays the spatial distribution of millet during four growth stags—sowing, jointing, heading, and harvesting (from left to right). The distribution data for these stages are sourced from the \"Agro-phenological atlas of China\"36, while the \"Origin Similarity Distribution\" is an original result of our study. The figure uses millet as a climate indicator crop to verify the alignment of solar terms with local climate conditions, assessing the proposed origin’s validity. End of Heat, ST16), and is harvested in mid-September (after White Dew, ST17), with a total growth period of approximately 110 days. When comparing this information with the STTMD temperature characteristics, millet’s germination period aligns with the time between Pure Brightness (ST7) and Grain Rain (ST8) through Grain in Beard (ST11) (approximately mid-April to early June), the stem and leaf growth period corresponds to Lesser Fullness of Summer (ST10) through the Summer Solstice (ST12) (late May to mid-to-late June), and the grain-filling period spans from the Beginning of Summer (ST9) to Lesser Fullness of Summer (ST10) (early May to late May). Although there are slight discrepancies between temperature and solar terms, they closely align with traditional farming proverbs. For instance, Henan region proverbs38 include: \"Rain during Grain Rain (ST8) ensures good millet planting, and rain during Grain in Beard (ST11) ensures a good harvest,\" and \"Plant sesame at Grain Rain (ST8) and millet at Lesser Fullness of Summer (ST10); after the Beginning of Summer (ST9), sow sesame.\" In areas like Fengqiu, it is said, \"Sow millet at Pure Brightness (ST7) and cotton at Grain Rain (ST8),\" while in Nanyang and Jiaozuo, the custom is to sow millet around Grain Rain (ST8). In Xingyang, the saying goes, \"Sow sorghum at Pure Brightness (ST7), flowers at Grain Rain (ST8), and sesame around the Beginning of Summer (ST9).\" In Shanxi, it is said, \"Between Grain Rain (ST8) and the Beginning of Summer (ST9), sow millet first, then sesame.\" These proverbs confirm that spring sowing of millet between Pure Brightness (ST7) and Grain Rain (ST8) is appropriate in Henan, validating the accuracy of the Pure Brightness (ST7) and Grain Rain (ST8) solar terms. Additionally, Lesser Fullness of Summer (ST10) is traditionally associated with the grain-filling period for cereals, while Grain in Beard (ST11) marks the time for sowing cereals. In the Xinxiang region of Henan, the saying \"Sow millet at Grain in Beard (ST11)\" still persists, and this proverb aligns with both phenological and STTMD characteristics, confirming the accuracy of the Grain in Beard (ST11) solar term. Lastly, White Dew (ST17) is recognized as the typical harvest season for cereals. In Nanyang, the saying \"Millet turns yellow at White Dew (ST17), and leaves die after the Autumn Equinox (ST18)\" indicates that millet is ready for harvest at this time, aligning with the phenological isopleth dates and confirming the accuracy of the White Dew (ST17) solar terms. Thus, while the phenological characteristics of millet growth align well with most solar terms, some discrepancies remain. These discrepancies primarily involve the temperature thresholds required to reach certain solar terms, resulting in slight delays in agricultural activities in some regions. Referring to the analyses by Zhu Kezhen and Wan Minwei on the phenological differences between north and south, east and west, and past and present, the likely cause of these discrepancies may be topographical influences. Phenological events differ between mountainous and plains regions; for instance, temperature decreases by 1 °C for every 200 m increase in elevation, leading to delayed phenological phases in mountainous areas. According to Hopkin’s bioclimatic law, phenological events are delayed by four days for every 1° increase in latitude or 400 feet in elevation. As a result, phenomena such as germination and jointing occur later in mountainous regions, although sowing times Therefore, while solar terms remain fixed annually, phenological events are significantly influenced by the climate of a given year, making the relationship between agricultural production and phenology more relevant. It is more practical to time agricultural activities based on phenological cues rather than strictly adhering to solar terms, which may have inherent biases. For example, in Shanxi Heshun, the saying \"Sow millet before sesame between Grain Rain (ST8) and the Beginning of Summer (ST9)\" contrasts with the saying in Nanyang, Henan, \"Sow millet at Grain Rain (ST8) without delay.\" Additionally, global warming and regional climate changes may also impact temperatures, potentially causing deviations in millet growth cycles from traditional solar terms.",
    "Studying the differences in agricultural timing between ancient and modern solar terms helps understand the long-term impact of current climate change on agricultural production. It also allows for a comparison of past and present agricultural practices, production methods, lifestyles, and societal culture, thereby revealing both the differences and commonalities in agricultural methods over time. In modern agriculture, each solar terms are associated with specific seasonal activities. Understanding the meteorological characteristics of key solar terms, such as the Spring Equinox (ST6), Pure Brightness (ST7), Grain Rain (ST8), Lesser Fullness of Summer (ST10), and Grain in Beard (ST11), which are closely related to crop production and development, is of significant practical value. These key solar terms can be used to optimize and plan agricultural activities. The application of the STTMD method allows for a comprehensive understanding of regional climate characteristics, while preserving crucial information about the biological phenology and agricultural activities associated with each solar term. This method enables accurate predictions of crop growth and development, determination of optimal planting and harvesting times, proactive disaster management in agriculture, and improvement of crop yield and quality. It also facilitates the scientific management of agricultural activities and supports the implementation of sustainable agricultural strategies. The Yizhoushu : Shixun Jie records that \"five days make a Hou, three hou make a Qi, and three qi make a Jie,\" reflecting ancient China’s systematic observation and recording of seasonal and meteorological changes. This time division was crucial for agricultural decision-making, seasonal activities, and astronomical predictions. The effectiveness of the STTMD method hinges on its ability to accurately capture the meteorological characteristics of different seasons, which are closely linked to traditional solar terms. These characteristics guide agricultural activities, influence crop growth and development, and affect biological phenomena such as migration, thereby providing scientific support for seasonal agricultural production. The rationality of the STTMD method is validated by identifying key temperature thresholds for various stages of crop growth on the regional climate center curve and matching them with corresponding solar terms. This verification checks whether agricultural activities related to crop development were indeed conducted during the associated solar term. By comparing the meteorological data sequences generated by STTMD with historical phenological observations, the accuracy and applicability of the method can be confirmed, ensuring its regional suitability across different seasons and areas. 1. Interdisciplinary Approach Combining Plant Geography and Historical Phenology Data: By integrating plant geography with historical phenological records, we propose a new method for inferring the geographic origins of historical events based on climate similarity. This interdisciplinary approach is relatively uncommon in existing literature and offers a fresh perspective on the origins of solar terms. 2. Innovative Research Based on Historical Phenology Data: Utilizing historical phenology records, agricultural practices, traditional farming proverbs, and extensive meteorological data, we identify the preconditions and processes for the emergence of solar terms. The scientific validity of these historical observations has been corroborated by plant geography. Previous studies have shown that historical phenology data are crucial for understanding the complex relationships between plant geography and climate, particularly in tracking phenological changes such as flowering and leaf-fall40–42. 3. Application of the STTMD Method for Climatic Feature Extraction: We apply the STTMD method for the first time to extract and typify long-term climatic features in the study area. The results are validated through cluster analysis and DTW similarity analysis, ensuring the accuracy and long-term effectiveness of the findings. This method advances the study of solar term origins and provides a new technical approach for similar historical geographic Research. 4. Study of the Relationship Between Solar Terms and Geographic Conditions: Drawing from plant geography, we emphasize that climatic factors, particularly solar radiation, are critical in determining the distribution of crops. Other factors such as temperature, humidity, microclimates, and altitude also play significant roles. Given the minimal impact of early crop domestication, the historical records retain scientific value, supporting the feasibility of our research method. 5. Technical Pathway: The study initially selects four key climatic factors—solar radiation, temperature, humidity, and wind speed—from long-term meteorological data to extract the region’s climatic features. These features are then typified using the STTMD method, cluster analysis, and DTW similarity analysis to derive more precise geographic spatial distributions. Finally, the reliability of these distributions is verified against historical observations, practical applications, and long-term experiential data.",
    "In the context of global warming and the increasing emphasis on cultural confidence, academic research related to \"solar term days\" has gained importance. This research not only revisits historical and cultural aspects but also explores the modern application and innovative adaptation of solar term knowledge, providing practical references for agricultural production and addressing global warming. The study carries significant social and cultural value. Unlike previous studies focused on solar term meteorology, this research employs the STTMD method and rigorous mathematical and statistical analysis to identify the geographic origin of the solar terms more precisely. The results indicate that the \"Luoyang-Zhengzhou-Anyang\" triangle in the middle and lower Yellow River region, mainly north of Xingyang, Henan, is the most likely origin of the solar terms. This conclusion aligns closely with historical records and phenological observations. This study offers a more precise and comprehensive geographic estimation of the solar term origins, helping to resolve potential ambiguities or inaccuracies in historical documentation. It also provides valuable insights for agricultural practices in the face of global warming, supporting more scientifically informed agricultural scheduling based on solar term knowledge. Additionally, the research demonstrates the unique value and effectiveness of the STTMD method in meteorological archaeology. By analyzing the typified meteorological data associated with solar term days, this study contributes a powerful analytical tool for modern agro-meteorological research and offers new perspectives for related climate and environmental studies. The raw data used for the study were obtained from the ERA5 hourly data on single levels from 1979 to present dataset. The data has been submitted in the “Supplementary Materials”, and the specific data analysis method is derived from the corresponding author of the article. Additional data in the study are available from the corre- sponding author on reasonable request."
]