[
    "In coal mining, coal rock fracturing damage and leakage pose significant challenges. To study the relationship between piezoelectric signals and seepage characteristics during uniaxial compression, and to achieve leakage monitoring based on piezoelectric signals, a coal rock fracturing damage and leakage monitoring experiment was carried out using coal from the Zhaogu Mine in Henan Province. The wavelet packet energy was introduced to investigate the piezoelectric characteristics. The results indicate the relative variation in wavelet packet energy server as a damage index during the uniaxial compression of coal, correlating closely with permeability changes. The wavelet packet energy at the end of the elastic deformation stage was 0.26 V”, similar to the pre-compression value of 0.29 V. Therefore, the overall damage in the compression and elastic deformation stages was approximately 0. Permeability values remained stable, fluctuating from 0.26 x 10-1 m? to 0.11 x 10-16 m2. In the plastic deformation stage, wavelet packet energy decreased while the damage index and permeability rose. Prior to peak stress, wavelet packet energy and damage index plateaued, signaling a precursor to a sudden increase in permeability. Post-peak stress, a marked decline in wavelet packet energy and an increase in the damage index and permeability were observed. This study offers a method for monitoring coal rock leakage, contributing valuable insights for efficient coalbed methane extraction and timely safety alerts. In China, coal remains the main source of energy. Although the proportion of coal consumption has been decreasing annually with the shift in the energy consumption structure towards clean and low-carbon direction! in recent years, its total amount still occupies an important position in energy production** (as shown in Fig. 1). In the process of coal mining, the phenomenon of fracturing and leakage of coal and rock has become a problem that cannot be ignored, which may not only yield favorable results but also lead to serious potential safety hazards. On the one hand, the widespread application of coal rock fracturing technology has significantly improved the permeability characteristics of coal seams, thereby increasing the efficiency of gas extraction. On the other hand, disturbance caused by mining can lead to deformation and damage to coal, resulting in air leakage and increasing the risk of coal spontaneous combustion accidents‘. Effective leakage monitoring can provide a scientific basis for the efficient extraction of coalbed methane and provide timely warnings for otential safety hazards. In previous studies, many experts and scholars have focused on developing nondestructive structural monitoring techniques, mainly utilizing the acoustic, optical, magnetic, electrical, and other characteristics of coal and rock masses*-* to study the fracture and damage evolution characteristics of coal samples. Nondestructive testing techniques based on optical properties mainly include optical microscopy testing’, laser scanning testing!®, laser ultrasonic testing''!*, and infrared radiation technology. Infrared radiation technology is a common non-contact geophysical method in this branch, which has been extensively studied in oth theoretical analysis and experimental research'*-!°, Mainly used for monitoring coal and rock damage!’. Nondestructive testing techniques based on electromagnetic characteristics mainly include electromagnetic wave detection technology'®, magnetic detection technology'®, conductivity detection technology”’, electromagnetic field excitation technology’, and electromagnetic radiation detection technology’. Although this technology as been applied in multiple fields, there are still some shortcomings and challenges in its application in complex environments. Damage monitoring technology based on acoustic characteristics mainly includes 1College of Safety Science and Engineering, Liaoning Technical University, Huludao 125105, Liaoning, China. *Key Laboratory of Mine Thermodynamic Disasters and Control of Ministry of Education, (Liaoning Technical University), Huludao 125105, Liaoning, China. “email: gaoke@Intu.edu.cn Fig. 1. The development trend of coal energy in recent years. (a) Proportion of coal resources in the past decade; (b) Proportion of energy consumption in 2023. ultrasonic detection, acoustic impedance detection, low-frequency acoustic wave monitoring, and acoustic emission monitoring. However, this technology has a high cost, weak signals, and is susceptible to interference. Monitoring technology based on piezoelectric materials is also a common method. Compared with other methods, piezoelectric aggregates have the advantages of simple operation and low cost, as well as real-time an continuous monitoring, with a wide signal response and high frequency spectrum. It is a damage monitoring method based on geophysical methods, first used for observing the internal structure of the Earth, searching for underground energy and earthquake monitoring”, and widely used in the construction industry”*~*° to monitor the damage to cantilever beams”’. Gu’® used piezoelectric aggregates for soil strength monitoring, combine: with low-temperature triaxial tests, to obtain the relationship between soil strength and piezoelectric signal energy under low-temperature conditions. He obtained the variation law of concrete cracks with piezoelectric signals and the influence of aggregate position on the sensitivity of damage identification. Later, it was introduce into mine production by experts and scholars in the coal mining field”? to predict the occurrence of coal rock dynamic disasters. However, research on monitoring coal rock fracture leakage via piezoelectric materials is limited, and further exploration is needed.",
    "Piezoelectric aggregates were made by mixing epoxy resin adhesive, coal powder, and aggregates, an experiments were conducted on the piezoelectric characteristics of coal rock fracturing damage and leakage. Piezoelectric signals are monitored mainly through piezoelectric sensing technology. A piezoelectric aggregate is selected on each end of the coal, with one end serving as the actuator (transmitter) and the other end serving as the sensor (receiver). Through the inverse piezoelectric effect, the actuator converts the excitation voltage into stress waves propagating in the coal, whereas the receiver converts the stress waves containing coal structure information into voltage signals through the positive piezoelectric effect, which are collected by an oscilloscope. By analyzing the mechanical behavior, permeability characteristics, and changes in piezoelectric signals during coal fracturing leakage, the variation patterns of the wavelet packet energy at various deformation stages and the relationships between damage indicators and permeability variation patterns were obtained. The coal sample used in this experiment is from the Zhaogu Mine in Henan Province and has dimensions of approximately 35 cm x 35 cm x 20 cm. In the laboratory, drill holes are created along the vertical bedding direction, and the coal is processed into cylindrical raw coal samples with a diameter of 50 mm and a length of 100 mm. These prepared coal samples comply with international processing standards. Only macroscopically intact coal samples are selected, whereas those exhibiting significant damage or cracks are discarded. The density and longitudinal wave velocity of the samples are tested, and those with roughly equivalent density and wave velocities are chosen for experimentation. The preparation involves establishing the placement for the piezoelectric aggregate, welding the necessary wires, and embedding the piezoelectric ceramic piece into the designated hole. At a specific ratio, a coal powder and epoxy resin adhesive mixture is poured into the hole and left to cure. Before the experiment, the side of the coal sample was coated with Vaseline, and the sample was subsequently loaded into the prepared seepage tank. Figure 2 illustrates the preparation of the sample and the embedding process of lead zirconate titanate (PZT). The coal rock fracturing damage leakage experimental system consists of several parts: a gas supply system, loading system, control system, measurement system, and data acquisition and processing system (as shown in Fig. 3). The gas supply system includes gas cylinders, gas pipelines, pressure reducing valves, pressure gauges, pressure regulating valves, and other parts that are responsible for gas supply and transportation. The loading system applies a load to coal according to requirements through a MAT-type press, with a range of 100 KN. The control system has two control modes for the press, namely, displacement control and pressure control. The measurement system is mainly responsible for measuring the gas flow rate during the coal seepage process. Combined with the gas supply pressure set in the gas supply system, the permeability of coal can be calculated. The data acquisition and processing system is mainly responsible for the acquisition of data in the experiment, including the acquisition of electrical signals at the receiving end of the piezoelectric aggregate, the monitoring of changes in mechanical parameters during uniaxial compression, and the storage of flow data measured by the gauging system. Signal generators, voltage amplifiers and oscilloscopes are the instruments associated with piezoelectric signals. The experimental signal is generated by the DIGITAL signal generator, with a maximum input frequency of 60 MHz and a maximum sampling rate of 200 MSa/s. The signal is amplified by a PINTECH HA-520 high-voltage amplifier, with a magnification of 20, and the output signal acquisition is mainly performed by a Tektronix DPO 2014 oscilloscope, which has a maximum acquisition signal frequency of 100 MHz, the maximum sampling rate of 1 GS/s, the sampling rate in the experiment is set to 0.25 GS/s. To conduct seepage experiments, a sealed seepage tank is designed (as shown in Fig. 4). The seepage tank consists of several parts, including an inlet pressure rod, a side wall, a sealing ring matched with the side wall, and a base with an outlet. The pressure rod is a cylindrical structure with three evenly distributed circular grooves at the bottom, which are matched with rubber sealing rings of the same size to achieve sealing at the top. In terms of design, the inner diameter of the sealed tank is larger than the diameter of the coal, so that lateral deformation can occur during coal compression. The side wall of the sealed tank is composed of a circle of evenly distributed small holes, which facilitates the injection of glass glue into the tank and blocks the pores between the coal and the side wall. The outer part of the small hole was covered with a sealing ring, and there was a small hole in the side wall of the sealing ring. The small hole is aligned with the small hole on the side wall for glass glue injection. The base design is similar to the design of the air inlet pressure rod, consisting of three holes. The middle hole is the air outlet, and the two sides are wire holes, which are responsible for the lead out of the piezoelectric aggregate wire.",
    "In this experiment, a five peak signal modulated by a Hanning window with an excitation frequency of 100 kHz is used as the excitation signal at the transmitting end, and waveform editing is performed via the third-party software Ultra Station. The excitation signal formula is as follows: where fis the signal frequency, Hz, and n is the number of sampling points. The process of generating excitation signals is shown in Fig. 5. The coal sample was buried in the sealed seepage tank, the wire was led from the bottom (as shown in Fig. 6) and sealed with glass glue (as shown in Fig. 7), the sealed seepage tank was then mounted and the experimental setup was connected as depicted in Fig. 8. Before the experiment, a gas-tightness test was performed. To ensure the reproducibility of the experiment, three coal samples were selected for parallel experiments, and then the experimental results of one coal sample were selected for detailed analysis. During the experiment, the inlet pressure was set at 0.5 MPa, while the gas pressure at the outlet was maintained at 0.1 MPa. The axial pressure was applied at a speed of 0.05 MPa/s until the coal sample failed. The stress-strain curve and the piezoelectric signal of the compression process were obtained. The permeability was calculated from Darcy’s law based on the experimentally measured gas flow rate. The permeability of coal samples is obtained through Darcy’s law, and the calculation formula for the gas permeability of homogeneous coal samples is as follows: where k is the permeability of coal, m’; Q is the gas volume flow rate, m*/s; j1’ is the gas viscosity, taken at 1.75 x 10-5 Pa-s at room temperature of 20 °C; L represents the coal length, m; A is coal cross-sectional area, m’; Pa is the atmospheric pressure, taken as 0.1 MPa; p1 is the gas pressure at the inlet, MPa; po is the gas pressure at the exit, MPa; and p is the average gas pressure, MPa. To analyze the mechanical properties of coal under uniaxial compression, the coal is packed into the seepage tank for compression, and the stress conditions corresponding to strains in the range of 0-0.017 are analyzed. In Fig. 9, the stress-strain curve is divided into a compaction zone, elastic zone, plastic zone, and rupture zone according to the coal compression deformation situation. Owing to the lateral constraint effect of the seepage tank, the deformation of coal changes after coal rupture. If an axial force continues to be applied, the coal cannot Owing to the significant attenuation of stress waves after coal rupture, they cannot continue to propagate in the coal. Therefore, piezoelectric signals cannot be measured after coal rupture. Moreover, the permeability of coal increases sharply, exceeding the range of the flow meter, and cannot be further measured. Therefore, this experiment considers only the situation before coal rupture, and does not consider the secondary loading of ruptured coal caused by the constraint effect of the sealed seepage tank. ‘The stress-strain permeability curve can effectively reflect the changes in the gas permeability characteristics of coal during compression failure. To study the stress, strain, permeability characteristics, and piezoelectric properties of coal containing piezoelectric aggregates under uniaxial compression, a coal rock fracturing damage leakage monitoring experiment is carried out according to the steps in section “Experimental scheme’, and the mechanical behavior, permeability characteristics, and piezoelectric signals of coal are monitored. The monitoring results are shown in Fig. 10. The uniaxial compressive strengths and the permeability of the three coal samples in Fig. 10 are different. However, the stress-strain curves of different coal samples exhibit similar developmental trends, all aligning with the mechanical property evolution illustrated in Fig. 9. The compression process can be divided into four distinct stages. Additionally, the permeability of the three coal samples also follows the same development law with strain. The initial compression stage (OA) of coal, also known as the compaction stage, is characterized by an upward concave stress-strain curve. During this stage, the axial force doesn't act on the coal particles, but rather gradually densifies the primary pores and fractures, resulting in a decrease in the number of pores and cracks. Macroscopically, it manifests as a decrease in permeability during this stage.",
    "Elastic stage (AB): With increasing axial stress, the coal sample enters the elastic deformation stage, and the stress-strain curve shows an approximately straight line. In this stage, the pores and cracks are gradually compacted, and the axial force begins to act on the coal particles. The coal matrix begins to undergo compressive eformation under the action of stress. During this stage, as the coal pores and cracks are compacted, the porosity gradually stabilizes. astic deformation stage (BC): Point B is the turning point between elastic deformation and plastic eformation, and is known as the yield point. The stress corresponding to this point is called the yield stress, which is approximately 2/3 of the peak strength. The stress corresponding to the lower boundary of this stage is called the peak strength. In this stage, under the action of loading, microcracks inside the coal sample gradually levelop and converge, forming a certain number of microcracks, accompanied by a cracking sound. As the microcracks expand, the number of gas transport channels gradually increases, increasing the gas passage ability. As cracks expand, their conductivity further improves. Therefore, the permeability in this stage changes from lecreasing to increasing. bal Rupture stage (CD): After reaching point C, owing to the rapid convergence and penetration of microcracks, the coal begins to break and the stress drops sharply. At this stage, obvious macroscopic cracks appear in the coal, and a large amount of permeable gas gushes out along the macroscopic cracks. The ability to conduct gas increases sharply, resulting in a sharp increase in the permeability of the coal sample with cracking. Compared with the initial stage, the permeability increases by multiple orders of magnitude. Figure 10 shows that the permeability doesn’t change immediately with the occurrence of damage, but there is a certain lag. After the coal sample breaks, the stress doesn’t completely return to zero because of the presence ofa certain residual strength, that is, coal has some supporting force. According to the properties of coal samples, the residual strength after rupture varies for different coal samples, resulting in significant differences in the maximum permeability at this stage. Therefore, the main focus is on discussing the changes in permeability an piezoelectric signals before peak stress. When piezoelectric signals propagate in coal, and encounter defects such as cracks, reflection and scattering occur, resulting in attenuation of the piezoelectric signal during propagation. The monitoring of unidirectiona loaded seepage in coal and rock based on piezoelectric aggregates is an extremely complex process that is focused mainly on monitoring changes in coal and rock pores and fractures. By utilizing the positive an negative piezoelectric effects of piezoelectric aggregates, as well as the stress-strain behavior and permeability evolution laws during the uniaxial compression process of coal and rock, the stress and seepage evolution of coal damage changes are monitored. Because the signal during uniaxial compression is a typical nonstationary signal, traditional analysis methods such as FFT are not suitable for processing such signals. Wavelet packet analysis is a method for processing nonstationary signals that can simultaneously characterize the loca characteristics of piezoelectric signals in both the time and frequency domains. It is particularly suitable for analyzing piezoelectric signals, including transient phenomena. Therefore, the collected piezoelectric signals are processed through wavelet packet analysis. In the compression stage, a piezoelectric signal is collected for every 1 MPa stress applied, and the piezoelectric signals of each compression stage are screened. Coal sample No. 3 is used as an example to analyze the piezoelectric characteristics of coal rock fracturing leakage, and the results are shown in Figs. 11, 12 and 13. At the beginning of compression, coal enters the compaction stage. Figure 11 shows the piezoelectric monitoring signals collected during the coal compaction stage. The amplitude of the piezoelectric signals increases as compression progresses during this stage. On the one hand, coal damage slightly decreases during this stage. This is because in the structure of coal itself, there are some unclosed pores in the coal. Under the action of axial stress, these open structural planes slowly close until they are closed and compacted. In the process of compaction, the sizes of the pores and fractures in the coal structure gradually decrease. On the other hand, Fig. 10. The variation curve of stress and permeability with strain (a) Mechanical properties and permeability of coal sample No. 1; (b) Mechanical properties and permeability of coal sample No. 2; (c) Mechanical properties and permeability of coal sample No. 3.",
    "the end effect can also cause changes in the piezoelectric signal. Therefore, the changes in the piezoelectric signal at this stage cannot be attributed solely to damage changes. When piezoelectric signals are used to determine damage, it cannot be simply assumed that the damage has decreased at this stage. As compression continues, the coal begins to enter the elastic deformation stage. Figure 12 shows the piezoelectric monitoring signal collected at the receiving end during the elastic deformation stage. At this stage, there is a significant change in the piezoelectric signal, with an overall decreasing trend for the 4-7 MPa piezoelectric signal and an overall increasing trend for the 7-13 MPa piezoelectric signal. This occurred because during this stage, both unconsolidated areas and micro damaged areas were compacted. The axial force gradually acts on the coal particles, and as the coal continues to compress, the coal sample begins to deform. It compresses in the axial direction, and expands in the radial direction. As the coal expands, microcracks gradually appear, and the piezoelectric signal decreases. However, owing to the constraint of the seepage sealing tank, some coal is compacted, so the piezoelectric signal gradually increases in the later stage. Figure 13 shows the variation trend of the piezoelectric signal during the plastic deformation stage, where the piezoelectric signal significantly decreases and the peak value of the signal shifts horizontally with the compression of coal. This is because during this stage, an increasing number of microcracks are produced by coal fracturing, and as the stress continues to increase, various microcracks gradually begin to converge an penetrate. As the cracks continue to develop, microcracks begin to appear. At this stage, the overall volume of the coal sample begins to increase, causing significant damage to the coal and resulting in a significant decrease in the piezoelectric signal. With the damage and deformation of coal, the signal propagation path undergoes certain changes, so the signal reception time also changes, which is shown in Fig. 13 as the horizontal shift of the received signal peak under different stresses. Compared with the elastic deformation stage, this part of the coa cannot fully recover its shape after the axial pressure is removed. When the pressure applied to the coal reaches its peak intensity, the coal begins to enter the fracture stage. Figure 14 shows the piezoelectric signal collected at the receiving end after coal rock fracture. After the coa reaches its peak strength at this stage, the internal structure of the coal is severely damaged, and the microcracks that accumulate during the plastic deformation stage rapidly develop and interconnect with each other, causing the coal to fracture and resulting in a sharp decrease in stress. The fracture of coal at this stage greatly affects the propagation of piezoelectric signals in coal. At this stage, the coal sample has undergone shear failure, an the coal sample has lost its bearing capacity due to fracture, resulting in severe attenuation of the piezoelectric signal. At this time, the collected signal amplitude is relatively small, and in fact, most of it is background noise in the experimental environment. The rupture stage occurs rapidly, with severe coal rupture occurring in a very short period of time, resulting in a small amplitude of the collected piezoelectric signals. Therefore, in terms of both the acquisition time an the amplitude of the collected signals, very few piezoelectric signals can be collected in this stage. The coa sample after rupture is shown in Fig. 15. Through time-domain analysis of the piezoelectric signals in Figs. 11, 12 and 13, it was found that the waveform variation amplitude was relatively small under some stresses, as shown in Fig. 16d, The amplitudes under stresses of 11 MPa and 12 MPa basically coincided, and the changes in the signal could not be directly obtained through time-domain plots. Owing to the impact of damage, the propagation path of piezoelectric signals changes, and the propagation time from the transmitting end to the receiving end also changes accordingly. In the time domain diagram, this is manifested as a leftward or rightward shift in the waveform, resulting in a disorderly arrangement of waveforms under various pressures, making it difficult to directly compare amplitudes. In addition, when the piezoelectric aggregate is affected by the environment or when there is a major fracture in Fig. 12. Piezoelectric signal curves during the coal-rock elastic deformation stage (a) Receiving piezoelectric signal at 4 MPa; (b) Receiving piezoelectric signal at 5 MPa; (c) Receiving piezoelectric signal at 6 MPa; (d) Receiving piezoelectric signal at 7 MPa; (e) Receiving piezoelectric signal at 8 MPa; (f) Receiving piezoelectric signal at 9 MPa; (g) Receiving piezoelectric signal at 10 MPa; (h) Receiving piezoelectric signal at 11 MPa; (i) Receiving piezoelectric signal at 12 MPa; (j) Receiving piezoelectric signal at 13 MPa.",
    "the coal rock compression process, the propagation of the piezoelectric signal in coal will be greatly affected, and the signal received by the piezoelectric aggregate at the receiving end will also greatly interfere. Some signal peaks may undergo sudden changes. At this time, it is difficult to judge the damage to coal solely on the basis of the time-domain waveform of the piezoelectric signal. Therefore, the use of wavelet packet energy to more reasonably and intuitively evaluate coal damage is proposed. Wavelet packet energy is the energy distribution in each frequency band after the signal is analyzed at multiple scales by wavelet packet transform. Wavelet packet transform is an algorithm that combines decomposition, denoising and reconstruction. The wavelet packet transform can decompose the signal, screen out the noise part, and reconstruct the non-noise part to achieve the purpose of signal denoising. The wavelet packet transform can project the signal to the wavelet base and obtain the corresponding wavelet coefficients. The energy of each frequency band after decomposition can be calculated by squaring the wavelet packet coefficients. In practice, the wavelet packet transform will extract signal features with greater energy and more pronounced spectral components, so the wavelet packet energy can reflect the changes more clearly than the signal amplitude. A more complete analysis of the wavelet packet transform and wavelet packet energy calculation methods have been developed in past studies*’. Based on the past experience*“, Daubechies wavelet function family is selected as the wavelet basis. Compared with other wavelet bases, it has better tight support, smoothness and approximate symmetry, and has been widely used in the acoustic signal processing of coal rock. The decomposition is carried out by the minimum entropy (Shannon entropy) criterion, and the number of decomposition layers is 7. It is possible to carry out the wavelet packet transform and the calculation of the wavelet packet energy directly by matlab. The formula for calculating wavelet packet energy is as follows: Wavelet packet energy reflects the overall characteristics of a signal over time. The higher the sampling rate, the higher the wavelet packet energy accuracy. When the sampling rate is small, the wavelet packet energy reflects the research results with some errors. The sampling rate of the oscilloscope in the experiment is fixed. When the experimental environment has a large impact on the signal, a homogenization method is proposed to eliminate the influence of the sampling rate on the wavelet packet energy which calculates the average energy of a single sampling point instead of the wavelet packet energy in Eq. (5). The improved wavelet packet energy calculation formula is as follows: Figure 16 illustrates the time domain diagram of the piezoelectric signal of coal sample No. 3 and the wavelet packet energy variations for the three coal samples. Comparing Fig. 16a, b and c, it is found that the wavelet packet energies of different coal samples are different in the process of coal rock fracturing leakage, and the wavelet packet energy of coal sample No. 3 is larger than that of the other two coal samples. However, the variation law of wavelet packet energy with stress is the same for different coal samples. At the initial stage, the Fig. 16. Signal time domain diagram and wavelet packet signal (a) The variation of wavelet packet energy with stress in coal sample No. 1; (b) The variation of wavelet packet energy with stress in coal sample No. 2; (c) The variation of wavelet packet energy with stress in coal sample No. 3; (d) 10-13 MPa receiver time-domain waveform. wavelet packet energy increases as the stress increases. As the stress continues to increase, the wavelet packet energy first decreases and then undergoes a disorderly change until the wavelet packet energy approximates the pre-compression wavelet packet energy. Continuing to compress the coal sample, the wavelet packet energy begins to decrease until the coal sample ruptures. Comparing Fig. 16c and d, it can be clearly observed that the variation of wavelet packet energy is more obvious than piezoelectric signal. Therefore, wavelet packet energy is more suitable than signal amplitude for monitoring the coal rock fracturing process**. To better understand the relationships between piezoelectric signals and stress behavior and seepage characteristics during the coal fracturing leakage process, with strain on the horizontal axis and stress, permeability, and wavelet packet energy on the vertical axis, Fig. 17 shows the variations in stress, permeability, and wavelet packet energy with strain. Figure 16 shows that different coal samples have the same variation law of wavelet packet energy during coal rock fracturing leakage, so the study related to wavelet packet energy can be analyzed by choosing only one coal sample fixedly, and coal sample No. 3 is chosen in Fig. 17.",
    "‘The energy of the wavelet packet increases with increasing of strain in the early stage. During this stage, due to the end effect and the gradual compaction of naturally occurring pores and cracks in coal, the overall piezoelectric signal becomes larger, so the received wavelet packet energy gradually increases. This stage is called the compaction stage, which is the result of the combined action of the original structure and the end effect of coal. Therefore, the damage to coal cannot be directly represented by the relative change in energy during this stage. However, the wavelet packet energy shows an increasing trend, and its value is greater than the wavelet packet energy received in coal before compression. This phenomenon can be used as a basis for coal rock deformation in the compaction stage. As the strain increases, coal enters the elastic deformation stage, and the received wavelet packet energy undergoes a “V” shaped fluctuation during this stage. Observations show that after a series of changes in the energy of the wavelet packet during this stage, the final energy value of the wavelet packet is similar in magnitude to the energy value received in the coal before compression. Therefore, when the energy changes of the wavelet packet are studied, the energy of the wavelet packet during the compaction stage and the elastic stage can be regarded as a whole, and it can be assumed that the energy of the wavelet packet during the compaction stage and the elastic deformation stage remains unchanged. The permeability decreases slowly during the compaction stage and elastic deformation stage, with little change in permeability. At the end of the elastic deformation stage, the energy of the wavelet packet changes less than the energy value before compression. Therefore, the permeability changes in these two stages are considered to be consistent with the energy changes in the wavelet packets. As the coal continues to compress, it enters the plastic deformation stage. During this stage, with the continuous increase in stress, not only do more microcracks appear in the coal sample, but the microcracks also interconnect with each other, and larger cracks begin to appear. These cracks cause further scattering and reflection of piezoelectric signals, resulting in significant changes in the coal sample structure and a significant decrease in the wavelet packet energy. At the same time, the stress-strain curve is no longer a straight line. As the energy of the wavelet packet decreases, the permeability begins to slowly increase. ‘The stress reaches its peak during the plastic deformation stage. An examination of the variation in the wavelet packet energy in the plastic part, revealed that with increasing strain, the wavelet packet energy continuously decreased. After the peak stress was reached, the wavelet packet energy decreased to 0.06 V?. At this stage, with the increase of strain, the wavelet packet energy tends to stabilize. This is because during the plastic deformation stage, the energy base is small, so the energy change is also small. At this stage, due to the increase in damage, the permeability begins to increase. The energy of the wavelet packet in this stage shows no significant change with the increase of strain, which can serve as a precursor to the sharp increase in permeability during the fracture stage, as well as a precursor to coal instability and failure. When the stress of the coal sample reaches its peak, as the coal is damaged and ruptured, the stress undergoes severe attenuation. There are not only macroscopic cracks in the coal but also fractures throughout the entire coal sample with the attenuation of stress. Due to the rapid occurrence of this stage, only one set of piezoelectric signals was collected after the rupture. The fracture of coal greatly hinders the propagation of piezoelectric signals, and most of the piezoelectric signals in basic coal cannot propagate to the receiving end sensor through the fracture. Therefore, the energy of the wavelet packet at this stage is extremely small, only 0.002 V7. The permeability increased sharply during this stage. The variation in the wavelet packet energy can reflect only the development trend of damage, but cannot accurately reflect the degree of damage. In Fig. 17, during the plastic deformation stage, as the strain increases, the energy of the wavelet packet decreases continuously, reflecting an increasing trend in coal damage with the loading of coal during this stage. Although the damage during the plastic deformation stage is more severe than that during the elastic deformation stage, the initial change in wavelet packet energy during the plastic deformation stage (0.049 V?) is not as large as the initial change in wavelet packet energy during the elastic deformation stage (0.121 V”). This is because the wavelet packet energy (0.26 V7) is smaller at the yield point (ie., the intersection of the elastic deformation end and the plastic deformation start), indicating a smaller energy base, whereas the wavelet packet energy (0.497 V7) at the intersection point of the elastic deformation stage start and the compression stage end is larger, indicating a larger energy base. Therefore, the initial change in the wavelet packet energy during the elastic deformation stage is greater than that during the plastic deformation stage.",
    "Using the relative change in wavelet packet energy as a damage index for the coal rock fracturing leakage process, the degree of coal damage is reflected through the damage index. Figure 17 shows that there is no obvious pattern of energy change in the wavelet packet during the elastic deformation stage, with both a decrease and an increase. However, the energy value (0.26 V7) of the wavelet packet obtained after the end of the elastic deformation stage is similar in magnitude to the energy value (0.29 V*) received in the coal before compression. Therefore, from the perspective of energy attenuation, the overall damage during the compaction and elastic deformation stages can be approximated as 0. In the plastic deformation stage, the energy of the wavelet packet gradually decreases with increasing damage, so the relative change in energy can be used as a discrimination index for the degree of damage in this stage. Therefore, before the peak stress, the damage index can be expressed as: where £),,; is the energy reference value, which is the energy value of the wavelet packet received in the coal before compression, V?, and where E;,; is the energy value collected during the plastic deformation stage, V2. The variation in the damage index with strain calculated by Eq. (7) is shown in Fig. 18. Compared with the variation of permeability with strain in Fig. 10, the variation in the damage index is consistent with the variation in permeability. In the compaction stage and elastic deformation stage, the damage index is approximately 0, and the permeability slowly decreases, but the decrease is not significant, from 0.26 x 107!6 m? to 0.11 x 107!6 m?. The damage index during the plastic deformation stage begins to increase, and the permeability also begins to slowly increase. The damage index does not change before reaching the peak stress, but after the peak stress, the damage index suddenly increases, and the permeability also increases sharply at this stage. The damage index does not change before reaching the peak stress, which can serve as a precursor to a sudden increase in permeability. On the basis of the relationship between the obtained damage index and permeability, the permeability of coal rock can be determined by monitoring the changes in the damage index obtained from the piezoelectric aggregate during the coal rock compression process, which can be used to monitor the permeability characteristics of the coal rock compression process. The coal is sourced from the Zhaogu Mine located in Henan Province, where a sealed seepage tank has been meticulously designed to facilitate experimental investigations on coal rock fracturing damage and leakage monitoring. The wavelet packet energy calculation methodology has undergone enhancements to elucidate the mechanical behavior, seepage characteristics, and variations in piezoelectric signals that occur during the leakage process associated with coal rock fracturing. These insights are of substantial importance for increasing the efficiency of underground mining operations and refining methods for subterranean disaster prevention. The following conclusions are derived from the research findings: increase. The damage index does not change before reaching the peak stress, but after the peak stress, the damage index suddenly increases, and the permeability also increases sharply at this stage. The damage index does not change before reaching the peak stress, which can serve as a precursor to a sudden increase in permeability."
]