[
    "To study the influence of the thickness of a weak interlayer on the deformation and failure characteristics of composite rock mass. Based on the measured data of sand-mudstone interbedded floor rock mass in the Yima mining area, Henan Province, China. Using quartz sand, gypsum, and cement as similar materials make composite rock-like specimens with weak interlayers. The mechanical properties, deformation evolution process, failure characteristics, and acoustic emission laws of rock samples with different interlayer thicknesses under uniaxial compression were studied using the digital image correlation method and acoustic emission monitoring technology. The results show that: (1) With an increase in the thickness of the weak interlayer, there is a corresponding decrease in the compressive strength of the specimen. When the thickness of the weak interlayer exceeds 5 cm, the compressive strength of the composite rock specimen is even less than that of the single weak rock-like. (2) Under uniaxial compression conditions, the strain concentration zone first appears in the weak interlayer part of the composite rock-like specimen. As the pressure continues to increase, the specimen is the first to fail at the position of the maximum strain concentration zone. (3) The thickness of the weak interlayer is an important factor affecting the failure mode of composite rock- like specimens. With the increase of the thickness of the weak interlayer, the composite rock-like specimens change from overall failure to local failure. (4) With the increase of the thickness of the weak interlayer in the middle of the composite rock specimen, the maximum value of the energy released by the single acoustic emission event and the maximum value of the cumulative acoustic emission energy decrease during the compression failure process. The research results can provide a reference for the manufacture of composite rock mass with a weak interlayer and the deformation and failure analysis of composite rock mass. The lithology of the roadway floor in the Yima mining area of Henan Province is complex, and its structure is mostly layered with overlapping sand-mudstone floors1–4. The mechanical properties and failure characteristics of a layered floor are significantly different from those of a single lithology floor when a floor rock burst accident occurs. In practical engineering, the monitoring and treatment of layered floors should employ methods and measures distinct from those used for single lithologic floors, so it is of great significance to study layered rock It is difficult to obtain unlimited rock samples or enough natural rock materials with a special structure when sampling underground and preparing rock samples in the laboratory5. In experimental studies, rock-like materials often replace natural rock materials6–9. This research method is widely used in the field of geotechnical mechanics’ research. Many experts and scholars have done a lot of experimental and theoretical research on this10–13. Liu et al.14 fabricated composite specimens with different strength combinations using cement, gypsum, and sand as similar materials, and studied the effect of material strength ratio on the mechanical properties of composite specimens under uniaxial compression. Hu et al.15 made layered rock mass using rock-like materials and studied the creep properties of layered rock mass. Tang et al.16 used 3D printing technology to make rock- like specimens with complex joints and studied the influence of joints on rock-like strength. Chai et al.17 studied rock-like specimens’ damage and deformation characteristics in uniaxial compression experiments using the digital image correlation method (DIC). Luo et al.18 fabricated rock-like specimens consisting of alternating soft and hard interbedded layers and investigated the deformation and failure characteristics of these specimens under uniaxial compression. Niu et al.19 used quartz sand, barite powder, and gypsum as similar materials to prepare fractured rock-like samples, and obtained the deformation characteristics of fractured rock mass and the acoustic emission laws of crack propagation under uniaxial compression. Zhang et al.20 prepared rock-like specimens with weak interlayers in different inclination angles and studied the damage characteristics and fracture behavior of the specimens under uniaxial compression. Li et al.21 carried out uniaxial compression and digital image correlation tests on double-layer composite rock-like specimens. They explored the effects of bedding planes and joints on rock-like strength. Landis et al.22 used ultrasonic technology to quantify the attenuation of ultrasonic waves in concrete materials. Some characteristics of the attenuation curve can be related to the degree of inhomogeneity in the material. Lacidogna et al.23 used acoustic emission and dynamic identification techniques to study the stress-dependent damage process of pre-notched concrete beams in four-point bending tests. Aggelis et al.24 use acoustic emission to classify the active cracking mode, which can characterize the current fracturing condition inside the material and issue a warning before the final failure. Lockner25 reviews the successes and limitations of AE studies as applied to the fracture process in rock, emphasizing the ability to predict rock failure. Tandon et al.26 explored the stability of cracks in gel materials by using bending tests of specimens under three-point and four-point loading conditions. Niccolini et al.27 associated material failure with changes in the electrical properties of materials to study the possible critical behavior in the fracture process In summary, scholars have done a lot of research on layered rock mass, but there are few reports on the systematic study of the mechanical properties, deformation evolution characteristics, and acoustic emission law of composite rock mass with weak interlayers. In this paper, the composite rock mass with a weak interlayer is taken as the research object, and quartz sand, cement, and gypsum are used as similar materials to make a composite specimen of a hard-soft-hard three-layer structure composed of two different strength materials. Combined with the digital image correlation method and acoustic emission technology, the influence of interlayer thickness on the mechanical properties, deformation evolution, failure characteristics, and acoustic emission energy of composite rock samples under uniaxial compression was studied.",
    "In this paper, the sand-mudstone interbedded floor in the Yima mining area of Henan Province is taken as the research background. The horizontal interbedded rock mass is mainly studied because the interbedded floor is of slow dip angle. The mechanical parameters of floor sandstone and mudstone measured before the experiment are shown in Table 1, and rock-like specimens are made based on this. In the experiment, P.O 42.5 ordinary Portland cement and quartz sand with particle sizes less than 0.5 mm were selected as sandstone-like materials. P.O 42.5 ordinary Portland cement, quartz sand with particle size less than 0.5 mm, and gypsum were selected as mudstone-like materials. After a large number of previous matching experiments, the final matching scheme is determined as shown in Table 2, and the stress-strain curve of the rock-like specimen is shown in Fig. 128. As shown in Fig. 1 the variation characteristics of stress-strain curves of rock-like materials are very similar to those of typical rocks. The compressive strength and elastic modulus of sandstone-like and mudstone-like materials are within the range of the measured mechanical parameters of the original rock. Therefore, sandstone-like and mudstone-like materials can be used to make sand-mudstone overlapping composite rock mass specimens. The mould for preparing the specimen is a cuboid hard plastic mould with dimensions of 5 cm × 5 cm × 10 cm. In the experiment, sandstone-like materials were selected as hard rock materials and mudstone-like materials were selected as soft rock materials. The composite rock-like specimens with hard-soft-hard three- layer structures were made by layered pouring. The thickness of the interlayers is 2, 3, 4, and 5 cm respectively, The experimental system consists of a loading system, a DIC monitoring system, and an acoustic emission monitoring system. The experimental system is shown in Fig. 4. The loading system is the Meters electronic universal test machine. The displacement loading speed range of the test machine is 0.001–1000 mm/min, and the maximum load is 100 kN. The DIC monitoring system includes four parts: A camera, light source, tripod, and computer. The acoustic emission monitoring system selects the Beijing Soft Island DS5-16B full information 16-channel acoustic emission signal instrument. Before the experiment, an acoustic emission sensor was pasted on the three side surfaces of the unsprayed speckle on the specimen, 30 mm away from the two end surfaces. Each specimen was equipped with six acoustic emission sensors. The position diagram of the acoustic emission sensor is shown in Fig. 5. In the experiment, the acoustic emission sampling frequency is set to 3 MHz, and the threshold value is set to 100 mV, which can ensure that the external noise is shielded. Adjust the position of the light source and the camera until the camera can capture the scattered spots on the surface of the specimen. The test machine first needs to use the force loading control mode when loading the specimen, and slowly load to 10 N. At this time, the upper-pressure head of the press is in contact with the upper surface of the specimen. Then the specimen was loaded at a displacement loading speed of 0.5 mm/min until the specimen was destroyed. Pressure loading, DIC monitoring, and acoustic emission monitoring are carried out at the same time, and the system automatically records the experimental data. Four uniaxial compression tests were carried out on the specimens of each interlayer thickness, and the compressive strength of the specimen was replaced by the specimen closest to the average compressive strength. Figure 6 shows the stress-strain curves of composite rock-like specimens with different interlayer thicknesses. As shown in Fig. 6 the stress-strain curves of the composite rock specimen are similar to the stress-strain curves of the typical rock. During the compression process, the specimens experienced four stages: initial compaction stage, elastic deformation stage, plastic deformation stage, and failure stage. At the initial stage of loading, the composite rock-like specimen is in the initial compaction stage, and the stress-strain curve is concave downward. At this time, the primary pores and cracks inside the rock gradually close under the action of compressive stress. With the increase of the thickness of the weak interlayer, the plasticity of the layered composite rock becomes stronger, and the duration of the curve compaction stage increases. With the increase of axial pressure, the specimen enters the elastic deformation stage. The stress- strain curve of the rock-like specimen at this stage is approximately an inclined straight line. As shown in Fig. 6 the slope of the straight line decreases with the increase of the thickness of the interlayer. In other words, the elastic modulus of composite rock decreases with the increase of interlayer thickness. As the loading progresses, the specimen enters the plastic deformation stage. At this time, the stress-strain curve of the specimen is upward convex, and the slope of the curve is decreasing. New cracks and fissures are generated inside the rock, and the plastic deformation generated at this stage is irreversible. Finally, the load on the specimen reaches its peak stress, and the specimen enters the failure stage. The specimen begins to fail from the inside, but the outside remains intact. The specimen still has a certain degree of bearing capacity. The specimen is destroyed completely as the loading continues.",
    "The compressive strength changes of composite rock-like specimens with different interlayer thicknesses are shown in Fig. 7. When the interlayer thickness is 0 cm, 2 cm, 3 cm, 4 cm, and 5 cm, the average compressive strength of the corresponding composite rock-like specimens is 28 MPa, 26 MPa, 21 MPa, 18 MPa, and 14 MPa, respectively. It shows that when the rock specimen contains a weak interlayer, the composite rock specimen’s compressive strength decreases with the increase of interlayer thickness. The thickness of the weak interlayer of the composite specimen is negatively correlated with its compressive strength. Combining the above analysis to When the thickness of the interlayer is 2 cm, the average compressive strength of the composite rock specimen is 26 MPa, which is close to the hard rock (sandstone-like) compressive strength. When the thickness of the interlayer is 4 cm, the average compressive strength of the composite rock specimen is 18 MPa, which is close to the compressive strength of the soft rock (mudstone-like). When the thickness of the interlayer is 5 cm, the average compressive strength of the composite rock specimen is 14 MPa, which is less than the soft rock (mudstone-like) compressive strength of 16.9 MPa. From the above analysis, it can be seen that the thickness of the weak interlayer in the composite rock specimen has an important influence on the compressive strength of the composite specimen. When the thickness of the weak interlayer exceeds 5 cm, the compressive strength of the composite specimen is even smaller than the strength of the single weak rock-like. When the thickness of the weak interlayer increases to 5 cm, the fracture of the rock-like first appears on the contact surface of the soft and hard rock strata. Then the fracture rapidly expands to the weak interlayer, which causes the failure of the specimen. At this time, the load on the specimen does not exceed the compressive strength of the soft rock. From the above analysis, the interface effect of the weak interlayer is the main reason why the compressive strength of the composite rock specimen is less than the compressive strength of the soft rock. The deformation evolution characteristics of composite rock-like specimens under uniaxial compression were analyzed by the digital image correlation method. Figure 8 shows the strain cloud diagram in the vertical direction when the peak strength is 30%, 60%, 90%, and 100%, respectively. It can be seen from Fig. 8(a) that when the axial load is loaded to 30% of the peak strength, the strain of the interlayer of the composite rock-like specimen with 2 cm interlayer is larger, and the average value is about 1.5 × 10− 3. The strain at both ends of the specimen is small, and the strain value at the upper end is greater than that at the lower end. When the axial load reaches 60% of the peak strength, the compressive strain of the whole specimen increases, and the maximum strain value in the middle of the specimen reaches 2.8 × 10− 3. When the axial load is loaded to 90% of the peak strength, an obvious strain concentration zone appears at the 2 cm interlayer in the middle of the specimen, and the maximum strain reaches 6.3 × 10− 3. When the load increases to the peak strength, a strain concentration zone with an inclination angle of 45 degrees appears in the middle interlayer, where the strain is the largest, and the middle interlayer is the first to fail. According to the analysis of Fig. 8(b), when the interlayer thickness is 3 cm and the load value reaches 30% of the peak strength, the strain concentration zone first appears in the middle of the specimen slightly below the position. The scope of the strain concentration zone continues to increase as the loading progresses. When the As shown in Fig. 8(c) when the thickness of the interlayer increases to 4 cm, the strain concentration zone first appears in the upper part of the specimen. When the load value reaches 60% of the peak strength, the strain concentration zone is evenly concentrated in the middle of the specimen. When the load value reaches 90% of the peak strength, the strain in the middle of the specimen reaches 8.6 × 10− 3. When the load increases to the maximum peak strength, a strain concentration zone with an inclination angle of 45 degrees appears in the middle of the weak interlayer, and the specimen fails along this.",
    "According to the Fig. 8(d) when the thickness of the interlayer increases to 5 cm, the strain concentration zone is mainly concentrated near the upper and lower contact surfaces of the soft and hard rock layers. As the loading progresses, the strain concentration zone shrinks to the right, and the maximum strain value increases. When loaded to the peak strength of the rock, the shape of the strain concentration zone is similar to a triangle, which is located in the middle of the specimen on the right side, and the specimen seriously failed at this position. In summary, under uniaxial compression, the composite rock-like specimen with a weak interlayer first appears to strain the concentration area in the weak interlayer part. With the increase of the thickness of the weak interlayer, the strain concentration zone appears more obvious, and the strain value of this part is larger than that of other positions. The weak interlayer reaches its maximum load capacity as the pressure continues to increase. At this time, the strain value of the weak interlayer reaches the maximum, and the specimen first failed in the position of the maximum strain concentration zone. The elastic modulus and compressive strength of soft rock are lower than those of hard rock, while the deformation under the same pressure is greater for soft rock. Additionally, soft rock reaches its compressive limit before hard rock, making it more prone to failure. When the thickness of the interlayer is large, the specimen is first broken on the contact surface of the soft and hard interlayer, so that the specimen is destroyed when the compressive strength of the soft rock is not reached. The changing image of the composite rock-like specimen during the compression process is captured in real time using a camera. The failure characteristics of the specimens are shown in Fig. 9. When the thickness of the weak interlayer in the specimen is 2 cm and 3 cm, similar failure characteristics are observed. Take an example with a weak interlayer thickness of 2 cm. From the analysis of Fig. 9(a). With the increase of axial load, the expansion phenomenon occurs in the weak interlayer position, and then cracks occur in the middle of the specimen. As the axial pressure continues to increase, the crack expands to both ends of the specimen. When the axial pressure continues to increase, macroscopic cracks go through the entire specimen. When the thickness of the interlayer is 4 cm and 5 cm, the failure characteristics of the specimens are similar. So take an example with a weak interlayer thickness of 4 cm. According to the analysis of Fig. 9(c), it is evident that under the action of uniaxial compression, the deformation of the interlayer position in the middle of the Fig. 9. Failure characteristics of specimens. (a) Thickness of interlayer 2 cm (b) Thickness of interlayer 3 cm. (c) Thickness of interlayer 4 cm (d) Thickness of interlayer 5 cm. specimen increases, showing an obvious expansion phenomenon. As the loading progresses, cracks are first generated near the contact surface of the soft and hard interlayers. When the axial pressure continues to increase, the crack begins to expand rapidly to the weak interlayer and its vicinity, and the specimen is destroyed along the crack direction. The failure of the specimen is concentrated in the weak interlayer position of the specimen, and the hard rock part at both ends is slightly failed. The crack does not penetrate the whole specimen. From the above analysis, it can be seen that when the thickness of the weak interlayer is relatively small, the weak interlayer and the upper and lower hard rock strata tend to be whole, resulting in penetrating cracks and the overall failure of the specimen. When the thickness of the weak interlayer is relatively large, the mechanical properties of the weak interlayer are more prominent. The specimen is seriously failed in the weak interlayer, and the rest is slightly failed. The compressive strength of the specimen increases when the proportion of weak interlayer is small. A large amount of elastic energy is accumulated in the weak interlayer during uniaxial compression. When the load reaches the compressive limit of the weak interlayer, the energy stored in the weak interlayer is suddenly released. The energy is transmitted to the remaining rock strata in the form of stress waves so that the remaining rock strata fail when they do not reach their compressive limit. When the proportion of weak interlayers is high, the compressive strength of the specimen decreases, resulting in a reduced accumulation of elastic energy within the weak interlayer. The energy release is not enough to make the rest of the rock strata fail when they do not reach their compressive limit. Therefore, when the thickness of the weak interlayer accounts for a large proportion, local failure occurs in the specimen. In summary, the proportion of weak interlayer is a key factor affecting the failure characteristics of composite rock specimens.",
    "During the compression process of rock-like materials, the change in the internal structure of the materials will release elastic waves of different frequencies and different energies, which is called rock-like acoustic emission29. By monitoring the acoustic emission of rock-like specimens during compression, it can gain insights into the internal failure mechanisms of these specimens and provide a comprehensive explanation of the entire process of rock-like failure30–33. Acoustic emission energy is the energy carried by sound waves generated by phenomena such as deformation or fracture inside the material during the acoustic emission process. The schematic diagram of the acoustic emission energy principle is shown in Fig. 10. During the compression process of specimens with different interlayer thicknesses, the curves of stress, acoustic emission energy, and cumulative acoustic emission energy with time are shown in Fig. 11. The analysis of Fig. 11 reveals a consistent acoustic emission energy evolution law among composite rock-like specimens with varying weak interlayer thicknesses under uniaxial compression. According to the distribution characteristics of acoustic emission energy, the evolution process of acoustic emission energy can be divided into the following three stages: I, the quiet period of acoustic emission energy, II, the steady growth period of acoustic emission energy, III, the burst period of acoustic emission energy. The above three stages have a good corresponding relationship with the compaction stage, elastic-plastic deformation stage, and failure stage of the specimen in the compression process. During the initial loading stage, the specimen undergoes an initial compaction process. Under axial pressure, the internal pores and cracks gradually compacted without any occurrence of new cracks. At this stage, there are no or only a few acoustic emission events, and the energy of a single acoustic emission event is small, the cumulative acoustic emission energy is at a low level, and the acoustic emission energy is in a quiet period. With the increase of axial pressure, the specimen enters the elastic- plastic deformation stage. At this stage, new cracks and fissures are generated inside the specimen, and acoustic emission events occur frequently. The energy of a single acoustic emission event increases, the cumulative acoustic emission energy continues to increase, and the cumulative acoustic emission energy increase is greatly improved compared with the quiet period of acoustic emission energy. The acoustic emission energy enters a stable growth period. As the pressure continues to increase, the specimen enters the failure stage. The pores and cracks inside the specimen are connected and penetrated to each other, and macroscopic cracks are generated on the surface of the specimen. When loaded near the ultimate compressive strength of the specimen, acoustic emission events occur frequently and the energy of a single acoustic emission event increases greatly. When loading to the ultimate compressive strength of the composite rock-like specimen, the specimen is destroyed and accompanied by high-energy acoustic emission events. The value of single acoustic emission energy reaches the maximum, and the cumulative acoustic emission energy curve has a surge point at this time. In the failure stage of the specimen, the acoustic emission energy of the specimen enters the burst period. Figure 11(a)-(d) shows the relationship between acoustic emission energy, cumulative energy, stress, and time when the thickness of the weak interlayer in the middle of the composite rock-like specimen is 2 cm, 3 cm, 4 cm, and 5 cm. The maximum acoustic emission energy of a single acoustic emission event in the compression process of specimens with different interlayer thicknesses is 18,900 mV·ms, 14,466 mV·ms, 12,113 mV·ms, and 9697 mV·ms respectively, and the maximum cumulative energy of acoustic emission is 84,570 mV·ms, 76,717 mV·ms, 70,318 mV·ms and 64,795 mV·ms. The comparative analysis shows that with the increase of the thickness of the weak interlayer in the composite rock-like specimen, the maximum value of the single acoustic emission event release energy and the maximum value of the cumulative acoustic emission release energy during the compression failure process of the specimen is reduced. The thickness ratio of the weak interlayer has an important influence on the energy release of the specimen during uniaxial compression. Based on the research background of the sand-mudstone overlapping floors in the Yima mining area of Henan Province, we made composite rock-like specimens with weak interlayers. The mechanical experiments of specimens under uniaxial compression were carried out by using the digital image correlation method and acoustic emission monitoring technology. The conclusions were as follows.",
    "In this paper, we only study the influence of single interlayer thickness on the deformation and failure of composite rock mass with weak interlayer. The research on multi-layer interlayer and different interlayer dip angles for composite rock mass is not involved, which will be the direction and focus of our future research work."
]