[
    "2School of Civil Engineering and Architecture, Zhengzhou University of Aeronautics, Zhengzhou, China 3Key Laboratory of Watershed Environmental Management, Zhengzhou, China The evaluation of drinking water source security in the area of large-scale urbanization is conducive to maintaining urban security and human health. A comprehensive quantitative evaluation method has been established based on TOPSIS. Twelve indicators from three aspects, water quantity, water quality, risk warning and emergency response capability, are included in the evaluation index system. The weight of these indicators are calculated by AHP. TOPSIS is used to obtain the security index in different periods, and GIS method is used to draw the spatial distribution map of security grade. The evaluation method is applied to the security evaluation of urban drinking water sources in Henan Province, China. The results show that the overall safety of drinking water sources has improved, but it is still at the “basic safety” level. The security level of each city is closely related to watershed characteristics, water resources allocation and industrial layout. The paper puts forward some suggestions to enhance the safety of urban drinking water source. Urban drinking water sources refer to centralized water sources that provide water for urban residents and public facilities such as governments, hospitals and schools, as well as surrounding land and water areas within a certain range that meet the requirements of water source protection. Urban water supply is closely related to the normal operation of the city, and drinking water security is highly concerned by the society. Cities are now home to 55% of the world’s population. By 2050, at least 2.5 billion people are expected to sweep into cities, making up 68% of the population. Therefore, there is a great significance to maintain the security of urban drinking water sources for the protection of urban safety and human health. Water quality safety is the primary goal of urban drinking water source protection. In order to maintain normal physiological activities of human body, humans need water source with stable amount of water, so water demand is also an important index of drinking water source safety. With the process of large-scale urbanization, the problem of insufficient water supply per capita in cities of China, India and other developing countries has become increasingly prominent, and water resource has become an important factor restricting urban development [1, 2]. Due to rapid industrial development and agricultural non-point source pollution, the safety of drinking water is constantly threatened by sudden environmental events such as hazardous chemical leaks, heavy metal wastewater discharge accidents and algae outbreaks [3-5]. The concept of security also contains the meaning of risk, mainly reflected in whether there is emergency ability to resist risks. This paper constructs a set of comprehensive indicator system, calculates the security index by TOPSIS method, and selects Henan Province in China as the research object to carry out evaluation, in order to provide beneficial exploration for the study of urban drinking water source security under the background of large-scale urbanization. Twelve evaluation indicators are selected from three categories of water quantity, water quality, risk warning and emergency response capacity to construct an evaluation indicator system of urban drinking water source security. Studies on the security of urban drinking water sources are mostly carried out from the single perspective of water resources quantity, water environment quality or risk prevention, mainly focusing on the effects of climate change, urban sewage discharge and urban expansion on water sources safety [6, 7], analysis of water quality change trend [8], risk identification and assessment of water supply system [9, 10], etc. The research contents need to be integrated. Cities are the product of urbanization process, and We should attach great importance to the security of drinking water sources from the perspective of urbanization, so as to maximize the advantages and avoid the disadvantages in the early planning and construction stages of cities. There are three indicators of water quantity, including development and utilization rate of water resource, engineering water supply load, urban domestic water pressure. Development and utilization rate of water resource (S1) is a widely recognized indicator reflecting the degree of artificial control of water resources [11], which is related to the natural distribution characteristics of water resources, the planning and layout of water conservancy projects, the level of economic development and other factors. Engineering water supply load (S2) is the ratio of actual water supply and designed water supply, which comprehensively reflects the guarantee ability of urban water source engineering, water purification engineering and pipe network engineering to drinking water source safety, and involves the whole process of urban water supply. The larger the indicator value is, the weaker the water supply ability is. Urban household water pressure (S3) = 1- urban household water consumption/actual water supply. It is closely related to urban water use structure and can reveal the characteristics of urban industrial structure to a certain extent [12]. The larger the indicator value is, the worse the elasticity of urban water supply available for daily use is, and the more significant the domestic water is squeezed by the production water of high-consumption industries.",
    "In terms of water quality of intake, key surface water and urban groundwater, one index of water quality meeting the standard rate is set up respectively. Comprehensive water quality compliance rate of the intake (S4) is determined by the actual water supply ratio of groundwater and surface water and the water quality compliance rate, which directly reflects the actual water quality status of the current water source. Water quality compliance rate of key surface water (S5) reflects the water quality of large reservoirs and rivers with water supply function in the region where the city is located. Water quality compliance rate of urban groundwater (S6) is obtained from the water quality data of long-term monitoring Wells in urban built-up areas. In order to deal with the problem of huge groundwater depression cone, the Chinese government is actively reducing groundwater exploitation in North China and carrying out large-scale water source replacement projects in the cities of the study area [13]. The potential water supply capacity of large reservoirs and rivers can only be realized by means of special water conveyance projects, and water purification projects also need to be reformed due to the change of water source, and the construction process often takes a certain period of time. It can be seen that these two indicators reflect the water quality of reserve water source in the region where the city is Six indicators are selected in terms of risk warning and emergency response capability. Density of chemical industry park (S7) and density of key discharge units (S8) reflect the density of risk sources in the region where the city is located, and belong to the risk source evaluation indicator, focusing on the “accident risk” evaluation before the accident, so as to control the occurrence of accidents and mitigate the impact of accidents from the source [14]. The higher the value of these two indicators is, the higher the risk level of drinking water source being threatened by pollution is and the more unsafe the water source is. Proportion of automatic monitoring stations for surface water (S9) and density of monitoring points for urban groundwater (S10) focus on the evaluation of risk diffusion routes, reflecting the monitoring and early warning ability of water quality changes. The larger the indicator value is, the stronger the perception ability of water pollution is. Population density of urban domestic water (S11) and vulnerable groups density of urban domestic water (S12) are the evaluation indicators of receptors. Once the water source security is threatened, it is easy to affect vulnerable groups such as children aged 0-14 years and elderly over 65 years old [15-17]. The larger the indicator value is, the more vulnerable groups are affected by environmental risks and the worse the water security situation is. Referring to the theoretical framework and practical experience in the field of environmental risk assessment, this study carries out evaluation from three aspects: risk source, diffusion path and recipient object, among which S7 and S8 are risk source evaluation indexes, S9 and S10 are diffusion path evaluation indexes, and S11 and S12 are recipient object evaluation indexes [18, 19] . The ideal point method can arrange all the schemes according to the distance between each scheme and the ideal point [20]. This point represents a hypothetical scenario consisting of the optimal level of each indicator. The best alternative is the one closest to the ideal point. Technique for Order Preference by Similarity to Ideal Solution (TOPSIS) is used to calculate the distance between each scheme and the ideal point to determine the best alternative scheme [21]. TOPSIS is widely used in water resources evaluation and Water environmental security evaluation [22, 23]. The estimated influence of schemes on each indicator is formed into matrix D and the corresponding weight vector W given by: where xij is the value of indicator, i represents the city, j represents indicator, and wj represents each indicator’s weight. There are a total of m regions and n indicator. Weights is determined by the AHP method. Indicator values are aggregated via x x − p min ij = in which , where xmin is the minimum x x − ij max min value, xmax is the maximum value of column vector j, where j = 1, 2…, n. For each indicator j, an ideal point M1j and a negative ideal point M2j are defined according to the attribute of the indicator.",
    "increasingly prominent. Compared with the Yangtze River Delta, Pearl River Delta and other regions with higher urbanization rates in China, the study of Henan Province is more valuable. where Ti ϵ[0,1]. Ti is the security index of urban drinking water source obtained by evaluation. The higher the Ti value is, the higher the security of the drinking water source of the city is. Henan province, with an area of 167,000 km2, is a traditional agricultural area in Chinese history. According to Hennan Statistics Bureau, the region is in the stage of high-speed urbanization in recent years, with 1.1% annual growth. However, the rural population of 51.24 million is still huge, and the agricultural employment population is still 22.7743 million. In the future, the endogenous demand for urbanization is still strong. The total water supply population of 18 cities in the study area is 20.2 million, and the city types are diverse, including 1 super-large city, 15 medium-sized cities and 3 small cities. According to the UN World Urbanization Outlook (2014 edition), which predicts 71% of China’s urbanization rate in 2035, it is estimated that the region will add about 20 million urban population. The process of large-scale urbanization is bound to be accompanied by the rapid growth of urban water consumption and industrial pollution discharge, and the security of urban drinking water sources will become The evaluation indicator data of each year come from the publicly released data of Henan Province Government. Analytic Hierarchy Process (AHP) method is adopted to obtain the weight of each indicator, which is listed in Table 1 [24]. AHP compares each index by constructing a pairwise comparison matrix [25]. The relative importance value of each indicator in the pairwise comparison matrix is calculated by mathematical method, which is the index weight [26]. The matrix data are obtained from professional consultations with 15 experts in water resource and water environment. These experts invited by this study all have rich practical experience and high theoretical level, including 3 experts in water resources planning, 4 experts in water resources protection, 5 experts in water quality monitoring and evaluation, and 3 experts in water supply and water purification technology. According to Formula (4), the security index Ti and ranking order of each city are calculated and divided into four levels: unsafe (Ti≤0.5), basic safe (0.5<Ti≤0.6), relatively safe (0.6<Ti≤0.75) and safe As can be seen from Table 2, the drinking water source security status of Puyang and Shangqiu is at the level of „unsafe”, 8 cities are at the level of „basic safety”, 8 cities are at the level of „relatively safe”, and no city is at the level of „safe”. Generally speaking, the security of urban drinking water sources in Henan province is at a low level. Among the two cities in the „unsafe” level in the study area, Puyang city has a large number of chemical enterprises, dense distribution of risk sources and great environmental risk threat, and its urban drinking water source security index is the lowest. Due to the influence of geochemical conditions, the regional groundwater environmental quality is poor in Shangqiu city, and some water quality factors of the urban underground water source exceed the standard for a long time, resulting in the lowest level of security. Among the top two cities, Luoyang is located in the Funiu Mountain area, with rich water resources and forestry resources. Its surface water environmental quality and drinking water intake quality are good, and its security index is the highest. The natural environment features of Sanmenxia are similar to those of Luoyang, and the security index is also at a high level, ranking as „relatively safe”. Henan province spans four major river basins in China, including haihe River Basin, Yellow River Basin, Huaihe River Basin and Yangtze River Basin from north to south. There are obvious differences in natural resources and economic development level of each basin. According to the analysis in Table 5, cities in Haihe River Basin have the lowest drinking water source security index, the highest output value of secondary industry, and relatively developed industry. Anyang, Hebi, Jiaozuo and other cities in this basin are typical industrial cities, whose economic development has long depended on steel, coal, chemical and other industries with high water consumption and high pollution. The urbanization level and proportion of non-agricultural employed population are also the highest. The massive discharge of industrial wastewater and domestic sewage brings great pressure to the water environment. In contrast, the Yangtze River Basin has the largest drinking water source security index, the long-term economic development is dominated by agriculture, and the secondary industry output value accounts for the lowest proportion. A large number of people are still engaging in agriculture, and the urbanization rate is also the slowest. It can be seen that there is a certain correlation between the security of urban drinking water sources and the industrial structure of the basin and the level of urbanization.",
    "The analysis of historical evolution characteristics is helpful to explore the causes of the current situation of drinking water security. In this study, the above- mentioned method is used to calculate the security index of urban drinking water sources in different periods, and Arcgis software is used to draw the spatial distribution map of security grade. Comparing the security index of the four periods, it can be seen that the overall situation of urban drinking water source security in the whole region tends to be better, and the number of cities in the “unsafe” level also decreases from 6 to 2. The safety of drinking water sources deteriorated to a certain extent during 2011-2014, and improved during 2017-2020 and 2014-2017, especially during 2014-2017, when the security index changed the most significantly. drinking water source safety situation of Zhengzhou, Xinxiang and Jiaozuo has improved greatly, and the security index increased in the top three, with the most obvious increase period from 2014 to 2017. These changes may be related to the South-to-North Water Diversion project. Since the project was put into operation at the end of 2014, it has provided sufficient and excellent drinking water sources to cities along the route, laying a foundation for replacing local water sources that frequently exceed the standard, and greatly improving the security of drinking water supply and quality in cities along the route. Five cities in the region saw their security index decrease, and Sanmenxia, Puyang and Luoyang ranked first and third. The rapid development of petrochemical and chemical industries with high water consumption aggravated the water shortage and water environmental pollution in Puyang, and the safety of urban drinking water sources has been in an “unsafe” state for a long time. Although Sanmenxia and Luoyang are abundant in water resources, with the expansion of coal chemical and metallurgical industries, the drinking water safety levels are reduced from “safe” to “relatively safe”, which needs to be paid attention to as soon as possible and countermeasures should be taken in advance to avoid further deterioration of the safety situation. In order to improve the security level of urban drinking water sources, the following countermeasures can be taken. First, we should optimize the allocation of regional water resources and strengthen the management of water source projects, water transport projects and water purification projects. Secondly, scientific basin planning and industrial distribution should be carried out to coordinate the relationship between economic and social development and ecological protection. Third, we should strengthen water ecological restoration. According to the estimated data of the United Nations in 2018 in the next three decades, the urban population of India, China and Nigeria will increase the most, reaching 416 million, 255 million and 189 million respectively. In the process of large-scale urbanization, traditional agricultural regions such as Asia and Africa also face similar problems of urban drinking water safety as China. Therefore, the evaluation method adopted in this paper can provide relevant references. Based on TOPSIS, a comprehensive and quantitative evaluation method for urban drinking water source security is proposed and applied to Henan Province, China , which is undergoing large-scale urbanization. The evaluation index system is established including three aspects of water quantity, water quality, risk warning and emergency response capability, and the index weight is calculated by AHP. TOPSIS is used to obtain the security index of urban drinking water sources in different periods, and The spatial distribution map of safety level is constructed by GIS method. The safety of urban drinking water sources in Henan province tends to improve on the whole, but it is still in the “basic safety” level. Cities in the Yangtze River basin had the highest security index, while those in the Haihe River basin had the lowest. From 2014 to 2017, the safety of drinking water sources improved significantly. The security index of Zhengzhou, Xinxiang, Jiaozuo and other cities increased significantly, which was closely related to the South-to-North Water Diversion Project. The rapid expansion of high water consumption industry has aggravated the shortage of water resources and water environment pollution, and Puyang city has been in an “unsafe” state for a long time. It is suggested to improve the safety level of urban drinking water sources through rational allocation of water resources, scientific basin planning and industrial layout.",
    "This research was supported by Henan Province Science and Technology Attack Plan Project (212102310069), Natural Science Foundation of Henan Province (222300420577), National Innovation and Entrepreneurship Training Program for College Students (202110485010) and Postgraduate Education Innovation Program Fund Project of Zhengzhou University of Aeronautics (2021CX56)."
]