[
    "1Department of Surveying and Planning, Shangqiu Normal University, Shangqiu 476000, China 2College of Geography and Environmental Science, Northwest Normal University, Lanzhou 730070, China 3School of Geography and Ocean Science, Nanjing University, Nanjing 210000, China 4Shangqiu Environmental Monitoring Station, Shangqiu 476000, China High concentrations of particulate matter with diameters less than 2.5 μm (PM2.5) have seriously affected the sustainable economic and social development of Henan Province. Analysis of the temporal and spatial distribution of PM2.5 and source analysis can provide a scientific basis for local pollution prevention and control. Using data from 17 atmospheric monitoring stations from 2016 to 2018, the spatiotemporal evolution of PM2.5 concentrations and source apportionment of Henan Province was explored using spatial autocorrelation analysis, empirical orthogonal function (EOF), potential source contribution factor (PSCF) analysis, and concentration weight trajectory (CWT) analysis. The PM2.5 concentration demonstrated varied annual, seasonal, monthly and daily characteristics from 2016 to 2018. The annual average concentrations decreased each year at an average rate of 5.3 μg/m3. The seasonal variation was “low in spring and summer while high in autumn and winter”. The monthly average and daily average over-standard rates exhibited a U-shaped pattern, with low values in the summer and high values in the winter. The daily average presented a pulse-type fluctuation. The areas with high concentrations of PM2.5 were primarily distributed in the central and northern parts of Henan Province, while the areas with low values were primarily distributed in the southern part of Henan Province. PM2.5 concentrations were negatively correlated with temperature, with the highest concentration at 0-5ºC, and strongly positively correlated with relative humidity in winter, with the highest PM2.5 concentrations between 80% and 90% relative humidity. Overall, the most important pollution transmission in winter came from southern Shanxi and northern Shaanxi, followed by Anhui and Shandong, again from the Beijing-Tianjin-Hebei region, and the smallest transmission came from Hubei. The area within Henan Province was also a significant contributor. less (PM2.5) has become a global problem [1]. PM2.5 is one of the main pollutants in urban areas and is solid or liquid matter suspended in the atmosphere. High concentration of PM2.5 not only weakens urban and regional air quality but also negatively impacts human health and increases disease incidence and mortality rates [2-3]. In addition, haze consisting of PM2.5 affects transportation and tourism, leading to economic losses [3]. PM2.5 sources include automobile exhaust, industrial production, road dust, coal burning, and secondary aerosol generation. Meteorological factors have significant impacts on the diffusion or accumulation of PM2.5 [4-5], thus resulting in different spatiotemporal distributions and pollution levels. Precipitation amounts had negative correlation with PM2.5 levels for wet sedimentation of PM2.5, notable reducing of dust and fugitive dust which previously suspended in the atmosphere and inhibit entrainment of surface dust from roads and fields [4-5]. Higher wind speed can favor plume spread and dilution which is conducive to the diffusion of PM2.5, cause in lower concentrations of PM2.5 [5]. Different regions have different geographical and meteorological conditions, which affect the PM2.5 pollution conditions [6]. Understanding the spatiotemporal variation patterns of PM2.5 can provide comprehensive insights for scientific and effective With rapid economic development, industrial expansion, and urbanization in China over the past three decades, haze and smog episodes characterized by high concentrations of PM2.5 have occurred more frequently in China [5] and has become one of the most serious environmental issues in China. China has carried out studies on the PM2.5 concentration at the national [7], regional [8-9], and local [3, 10] scales. Previous studies have conducted extensive and in-depth research on PM2.5 on its spatiotemporal pattern [9, 11], influencing factors [4, 12], transport pathways and potential sources [8, 10]. However, there are still some problems for the exsting researches. For instance, the research on transport pathways and potential sources focused mainly on the PM2.5 concentrations during winter [8, 10], which could not provide information about other seasons. Another shortcoming is that many studies have focused only on three hotspots of China, namely, Beijing-Tianjin-Hebei [12-13], the Yangtze River Delta [4, 14] and the Pearl River Delta [11]. There is little concern on central China that also is experiencing serious PM2.5 pollution. Central China mainly includes six provinces, Shanxi, Anhui, Jiangxi, Henan, Hubei, and Hunan (Fig. 1), accounting for more than one-quarter of the country’s population. Central China is a developing region undergoing rapid urbanization and industrialization and is now facing serious atmospheric pollution-related problems [8, 10]. Therefore, understanding the spatiotemporal evolution patterns and formation mechanisms in Central China is important to draft effective pollution control. In addition, there is little researche conducted at the provincial scale in this important region.",
    "Henan Province is a region with one of the highest PM2.5 pollution in China. For example, the average mortality caused by PM2.5 from 2001 to 2017 at Henan was the highest among all the provinces of China [15], the health loss values in cities of Henan increased during 2015-2017 [16]. According to an evaluation of the comprehensive environmental air quality index, among the 169 cities in China, 4 of the 20 cities with relatively poor ambient air quality are located in Henan Province [17]. PM2.5 was the primary pollutant in the atmosphere of Henan Province from 2016 to 2018 [18, 19]. The research carried out in Henan Province is of great help in understanding the status and causes of pollution in Henan Province [8, 10] and China. However, the use of data from only one year [8] or only one city [10] may have certain limitations for understanding the spatiotemporal patterns and formation mechanisms of pollution in Henan Province. In this article, we uses daily ground monitoring data from 17 cities in Henan province during 2016-2018, to comprehensively explore the spatiotemporal characteristics of the PM2.5 concentrations in this province. The objectives of this paper are to (1) explore the spatiotemporal patterns of PM2.5 concentrations from 2016-2018 in Henan Province using the EOF approach; (2) quantitatively assess the correlations between PM2.5 concentrations and meteorological factors; and (3) reveal the transport pathway of PM2.5 and the potential source contribution in Henan Province at different seasons. This article will help to improve the understanding of the temporal and spatial characteristics and the mechanisms of air pollution in Henan Province and can provide scientific and technical references for air pollution research and effective control of urban air pollution in Henan Province. Henan Province is located in the warm temperate and subtropical zone and is characterized by a humid and semi-humid monsoon climate, featuring a cold winter with little rain and snow, a dry spring with frequent wind and blowing sand, a hot summer with abundant rain and a clear autumn with sufficient daily sunlight [20]. Henan Province lies to the south of the Beijing-Tianjin-Hebei region, to the west of Shandong and Jiangsu provinces, to the north of Hubei Province and to the east of Shanxi Province (Fig. 1). Henan is a developing province in Central China that is large in terms of population and agricultural land, and this province faces the challenge of balancing development ecology. Henan Province is one of China’s largest energy-consuming provinces, with coal as its main energy source. The industrial, energy consumption, and transportation structures all generate a large amount of PM2.5 emissions [15]. In addition, Henan Province has a large agricultural volume, and planting and agriculture are important sources of pollution. In 2015, the average PM2.5 compliance rate from 17 cities in the province was only 57.16% [8]. Observational daily concentration data on PM2.5 and meteorological data (temperature and relative humidity) from 1 January 2016 to 28 February 2019 were obtained from the Zhenqi network (https://www.zq12369.com/). Because of the failure of some monitoring stations during certain periods, individual or continuous null PM2.5 values occurred, and the average value of the two days before and after was used to fill the null data. For the convenience of analysis, the seasons were divided into spring (March-May), summer (June-August), autumn (September-November) and winter (December- February of the following year). The monthly, seasonal, and annual averages were calculated from the daily data. The meteorological forcing data used for the backward trajectory analysis were the NECP reanalysis data, which can be downloaded from the NOAA website (https://ready.arl.noaa.gov/archives.php). The EOF approach, also known as eigenvector analysis, is an analytical method that can reduce the complexity of spatiotemporal data and extract the main feature quantity [9, 21]. EOF analysis decomposes a space-time φ field into a time-weighted matrix U and spatial eigenvector Z: ...where i = 1,…, m; j = 1,…, n, m is the number of spatial variables (sites or grids), and n is the length of the time series. φij represents the ith component of the jth random vector for the centralized and normalized data, and Uki is the weight coefficient representing the contribution of the ith site in the kth component. Zkj is the time-dependent function of the kth component of expansion. The eigenvectors of the data covariance matrix whose elements are formed from the difference between observations and their long-term means represent the EOFs, and the associated eigenvalue of any individual EOF indicates the relative importance to the total variance in the field [22]. The time coefficient represents the temporal variation characteristics of the spatial distribution form, a positive time coefficient means that the year is consistent with the distribution TrajStat, a follow-up software developed by HYSPLIT users, integrates trajectory clustering analysis, potential source contribution factor (PSCF) analysis, and concentration weight trajectory (CWT) analysis [14]. Zhengzhou city (34°75’N, 113°63’E) in Henan was chosen as the representative of cities in Henan. Using the above method, this study combines MeteoInfo (Java version) and a TrajStat plug-in component to identify the possible PM2.5 source regions of Zhengzhou city during the sampling period. The starting height for the backward trajectory analysis simulation was set to 500 m, which can reflect the average flow field of the atmospheric boundary layer in the study area [10], and the simulation time was set to 72 h. The study used Beijing time 08:00 (UTC time is 00:00) to calculate the backward trajectory of the arrival point during 2016-2018.",
    "Backward trajectory clustering is based on the spatial similarity of the air mass trajectory (i.e., transmission speed and direction) and the grouping of all the trajectories by calculating the spatial dissimilarity (SPAVR) pairs of each pair of trajectory combinations [14, 24]. All the air mass trajectories reaching the mode were subject to group clustering through the angle distance algorithm. Cluster analysis was conducted using MeteoInfo Software by examining the total spatial variance (TSV) [24]. Both the PSCF and CWT methods can be used to identify the potential sources of atmospheric pollutants through airflow trajectories [14]. The PSCF identifies the source region based on a conditional probability function. This method calculates the ratio of the number of pollution trajectories (nij, i.e., the daily average PM2.5 concentrations are greater than 75 μg/m3) of the ijth cell to all the trajectories (mij and describes each grid’s contribution to the pollution of the study area. The PSCFij values for the ijth cell were calculated by nij/ mij. However, the PSCF is influenced by the total number of trajectories in the grid. That is, the smaller the total number of trajectories is, the larger the error is. To eliminate this error, an arbitrary weight function, Wij, was assigned to multiply the PSCFij values. However, the PSCF can reflect the contribution rate of only the potential source area, and it is difficult to reflect the pollution level of the potential source area. Therefore, the CWT method was introduced to calculate the degree of pollution in different trajectories with the application of Wij (i.e., WCWT). In this study, the domain was in the range of 20-60°N, 90-130°E, with a resolution of 0.5°. Details of the PSCF and CWT methods can be found in reference (Zhu et al., 2016). Wij is defined as The basic principle of the kriging spatial interpolation method (OKM) is to use a variogram to explain the internal relationship of regionalized variables to estimate the value of spatial variables based on the values of adjacent variables. The results obtained by the OKM method have high accuracy, low volatility, good continuity, and thus, they can accurately simulate the spatial distribution characteristics of PM2.5. Kriging interpolation was implemented in this study using Surfer 11 software. Consistent with the decreasing trend of the national annual average PM2.5 concentrations, the concentrations of 17 cities in Henan Province from 2016 to 2018 decreased at a rate of 5.3 μg/m3. Specifically, compared with the PM2.5 concentrations in 2016 (72.8 μg/m3), the PM2.5 concentrations decreased by 6.1 μg/m3 in 2017 (66.7 μg/m3), and the concentrations continued to decrease to 62.2 μg/m3 in 2018, which were 1.5 times higher than that of the national level I standard (35 μg/m3). Overall, the concentration of PM2.5 in Henan Province showed a decreasing trend, and the abnormally high values were significantly reduced. The PM2.5 concentrations of the cold (October- March) and warm seasons (April-September) in Henan were significantly different. The PM2.5 concentrations fluctuated greatly, and the average value was high in the cold season but low in the warm season. This pattern also applies to the over-standard rate. Furthermore, the interannual variability in the PM2.5 concentrations and the over-standard rate in the cold-warm seasons were different. Both these indices showed a yearly decline in the warm season, but first decreased and then increased in the cold season. The patterns of the concentration and over-standard rate of PM2.5, both showing the feature of “lowest in summer, steady in spring and autumn, and highest in winter”. The seasonal averages of the PM2.5 concentrations during 2016-2018 in spring, summer, autumn and winter were 59.3, 38.8, 60.8 and 116.3 μg/m3, respectively. In winter, the increase in PM2.5 concentrations in northern China was caused by coal combustion and biomass burning [25]. Winter is the period when many northern urban areas use central heating, while in rural areas, a large amount of bulk coal is burned, and these activities emit substantial amounts of PM2.5. In addition, owing to low precipitation and temperature, the boundary layer may form at a low altitude (easily forming an inversion layer, which is conducive for the accumulation of pollutants), and if calm or weak wind is encountered, a long duration and wide range of PM2.5 pollution processes will occur [26]. In summer, due to increase in temperatures, rain, and strong convection, PM2.5 pollution from the atmosphere settles and diffuses easily. High air humidity in spring and a relatively stable atmospheric structure make it difficult for particles to diffuse [27]. Compared to summer, autumn is sunny, the temperature is low, and precipitation is reduced. Moreover, autumn is the harvest period of the main crops in Henan Province, and large-scale crops are harvested, which causes severe soil disturbance. In addition, a certain amount of straw burning and coal burning at the beginning of the heating season leads to higher PM2.5 concentrations in autumn than in summer. The over-standard rate of PM2.5 in winter, which was 71.6% (2016), 62.6% (2017), and 67.4% (2018), far exceeded the sum of spring, summer and autumn, indicated that winter was a high- risk period in term of PM2.5 pollution.",
    "with those in January, the average PM2.5 concentrations in May decreased from 126.1 μg/m3 to 45.3 μg/m3, and the daily average over-standard rate decreased from 74.2% to 9.7%. The average concentrations from June to October ranged from 36.7 μg/m3 to 50.5 μg/m3, and the daily average exceeded the standard rate of less than 12%. The lowest values in June, July and August, with a compliance rate of 100%. The excellent days were concentrated in this period. The average concentrations in November and December were 89.3 μg/m3 and 115.0 μg/m3, respectively, and the daily average over- standard rates were 55.6% and 68.8%, respectively. Overall, PM2.5 pollution decreased each year. Compared with 2016, the largest declines in PM2.5 concentrations in January, April and December 2018 were 29.8, 36.4, and 41.0 μg/m3, respectively. The daily average over-standard rate decreased by 22.6, 33.3, and 35.5%, respectively. In October alone, the PM2.5 concentration increased by 11.5 μg/m3, and the over-standard rate increased by 16.1%. The daily average values of PM2.5 in 17 cities in Henan Province from 2016 to 2018 were calculated and simulated with smooth curves (Fig. 3). Fig. 3 shows that the daily average PM2.5 values over the years showed a “pulse-like” fluctuation. In general, the fluctuation cycles were short in winter and spring, with a high frequency and large fluctuation amplitude; the fluctuation cycles were long in summer and autumn, with low frequencies and small fluctuation amplitudes. The PM2.5 in Henan Province showed obvious monthly distribution characteristics [8]. The monthly average PM2.5 concentrations showed a decreasing trend from January to May, a relatively low value with minor fluctuations between June and October, and a clear increasing trend from November to December. The variation pattern showed a “U”-shape, which was similar to that of the daily average over-standard rate for the month (Fig. 2). In the three years, compared The ranges of the daily PM2.5 concentrations in the province from 2016 to 2018 were 18.1-396.3, 16.2-240.4 and 12.2-259.2 μg/m3, respectively. The national level II (75 μg/m3) of daily PM2.5 was used for further evaluation. The number of good days (<75 μg/m3) in 2016, 2017 and 2018 was 248, 268 and 280 days, accounting for 67.8, 73.4 and 76.7% of 2016, 2017 and 2018, respectively. In addition, the days with heavy industries such as coal, metallurgy and steel that are mainly concentrated in the central and northern cities (Anyang, Luoyang, Pingdingshan, Jiaozuo, etc.). The unreasonable utilization of energy, inadequate government supervision, and “extensive” management models exacerbate this situation. Fig. 4 illustrates the spatial distribution of the annual average PM2.5 concentrations from 2016 to 2018 in Henan Province. Compared with 2016, in 2018, there were four cities with daily PM2.5 concentrations that decreased by 15 μg/m3 or more, namely, Xinxiang, Hebi, Jiaozuo and Luoyang. An additional four cities had daily PM2.5 concentrations that decreased by 10-15 μg/m3: Shangqiu, Luohe, Zhengzhou and Anyang. Most of the smaller changes were observed in southern and western Henan (hereinafter collectively referred to as low-value areas). Although the downward trends of the central and northern cities were obvious, the PM2.5 concentrations were still higher than those of the low-value area. The overall appearance is that the PM2.5 concentrations in the north were higher than those in the south. This result occurred because of Statistical analysis of Henan’s PM2.5 pollution from 2016 to 2018 was performed using the kriging spatial interpolation method to explore the seasonal spatial variation of PM2.5. The results are shown in Fig. 5. The PM2.5 pollution levels in all cities in Henan Province were the most severe in winter and the lowest in summer, while in spring and autumn the levels remained steady and showed different spatial distribution characteristics. High PM2.5 concentrations in spring was mainly distributed in western Henan, while it was distributed in central and northern Henan in autumn. The probable cause for this distribution was that the strong wind in spring had little dilution effect on the PM2.5 concentration in the western Henan region, which is dominated by mountains [28]. In autumn, after the crops are harvested, the cultivated land lacks vegetation cover and is easily blown away by wind to form dust, and straw burning further promotes PM2.5 pollution. Summer and winter are mainly affected by local emissions. The high-value cities were mainly industrial cities, such as Luoyang, Jiaozuo, Zhengzhou, Anyang and Puyang, which are located in central and northern Henan.",
    "concentrated in areas such as central Henan and northern Henan, with a range of 20 μg/m3. Overall, the PM2.5 concentrations in Henan showed a decreasing trend, but individual cities tended to show the opposite trend, and these cities were spatially dispersed. The likely causes for these differences may be local policies and energy structures, and the reasons for the increased in PM2.5 concentration of each city need to be further studied. All the 17 cities in Henan showed a decreasing trend of PM2.5 concentrations in spring, with an average decrease of 5.3 μg/m3, of which Luohe, Shangqiu, Xinxiang and Zhoukou decreased by more than 9 μg/m3. The decline in summer and autumn was small, 2.7 μg/m3 and 1.0 μg/m3, respectively, because some cities had increasing trends, such as Kaifeng, Shangqiu, Nanyang, and Zhoukou, which increased by 2-8 μg/m3. The decline in winter was 5.6 μg/m3. The largest decrease and the largest increase occurred during this period. The northern and central cities, such as Anyang, Hebi, Jiaozuo, Xinxiang, Zhengzhou, and Luoyang, had the largest declines, with a range of more than 13 μg/m3, of which Anyang decreased by 24.8 μg/m3, and some cities showed an increasing trend (1.2-3.5 μg/m3), of which Nanyang had the largest increase (13.7 μg/m3). The PM2.5 concentrations in the winter of 2017 were the lowest in the same period of the three years. In 2018, there was a clear rebounding trend. The 17 cities all increased to varying degrees. The areas with increases in high values were mainly Because the monthly value is more stable than the daily value, the EOF analysis of the monthly PM2.5 concentrations in this study yielded better results than the EOF analysis of daily PM2.5 concentrations. Thus, the two-dimensional vector matrix composed of the monthly PM2.5 concentrations in 17 cities of Henan (i.e., from 2016 to 2018) was created. EOF decomposition was performed to obtain the first three modal variance contributions (i.e., 92.6%, 3.5% and 1.4%), their eigenvectors (Fig. 6a), and the corresponding time coefficients (Fig. 6b). The contribution rate of the first mode variance was 92.6%, which was obviously higher than that of the other modes, indicating that it could reflect the average state of the PM2.5 concentrations during 2016- 2018. As shown in Figs 6a) and 6b), the first eigenvector is positive, indicating a synchronous spatial variation in the PM2.5 concentrations in Henan and revealing the sensitive area (i.e., the higher the value is, the stronger the sensitivity is) of PM2.5 pollution. The highest value of the first modal feature vector is located in the northern part of the province (i.e., Anyang), and the second appears in Zhengzhou. In general, PM2.5 pollution is most severe in the northern and central parts of Henan and gradually decreases toward the periphery. The first- time coefficient, as the weight of the feature vector, reflects the contribution of different times to this spatial distribution. The value of the first-time coefficient has distinct periodic oscillation characteristics and is greater than 0 in the cold season, less than 0 in the warm season, and shows an annual decreasing trend. The variation characteristics of the first-time coefficient are consistent with the curve of the monthly average Meteorological factors affect the dilution, diffusion, migration, and transformation of pollutants in the atmosphere, among which wind speed, precipitation, temperature and relative humidity are the main meteorological parameters that affect the concentration of atmospheric pollutants [4, 8, 10]. In this paper, the temperature and relative humidity were selected to explore the correlation with the PM2.5 concentrations. The statistical results are shown in Table 1. At the seasonal scale, there was a weak negative correlation between temperature and PM2.5 in the spring and autumn, and the correlation coefficients were -0.253 (P<0.01) and -0.294 (P<0.01), respectively. However, in the summer and winter, due to the small temperature change, a weak correlation between temperature and PM2.5 appeared. The relative humidity and PM2.5 concentrations had a weak positive correlation in spring, a weak negative correlation in summer, and a moderate positive correlation in winter (r = 0.488, P<0.01). On the long-term scale (3 years), the correlation coefficient between temperature and PM2.5 concentrations was -0.460 (P<0.01), while that between relative humidity and PM2.5 was nonsignificant. The daily temperature data for 17 cities during 2016-2018 were statistically grouped to reveal the PM2.5 concentrations at different temperature levels. The statistical results are shown in Fig. 7a). The PM2.5 concentrations and temperature shared an inverted- U-shaped curve relationship. When the temperature was below 0ºC, the PM2.5 concentrations increased with increasing temperature. The concentrations were the highest (112.4 μg/m3) at 0-5ºC and then decreased with increasing temperature. Beyond 30ºC, the concentrations declined to the lowest level (37.6 μg/m3). The main reason for this trend is that as the temperature rises, the vertical convection of the air is strengthened, the diffusion rate of atmospheric pollutants increases, and the concentrations decrease. Clearly, PM2.5 is mainly concentrated in the low-temperature season (<10ºC). Coal burning for heating during low temperatures is an important source of emissions, which is an important reason for the significant difference in pollution between summer and winter.",
    "in relative humidity and gradually transform into the accumulation mode (0.05-2.00 μm) to form fine particles causing an increase in PM2.5 concentration [29]. Daily relative humidity data of 17 cities in the winter of 2016–2018 are statistically grouped to reveal the PM2.5 concentrations. The statistical results are shown in Fig. 7b). The PM2.5 concentrations are the lowest (59.2 μg/m3) when the relative humidity is below 40% and the highest (165.9 μg/m3) when it is 80-90%. A high humidity environment is conducive to the generation of secondary aerosols through physical and chemical changes in gaseous pollutants [29, 30]. However, when relative humidity is greater than 90%, the air is moist and it easily precipitates, and PM2.5 formation is hindered, and its concentration decreases, thereby exhibiting an inverted-U-shaped curve in the relationship. airflow from the north in spring had a low concentration of PM2.5 (<61 μg/m3). The possible reason for the high concentration of PM2.5 of Class 3 and Class 4 is that the airflow trajectory is short, the residence time is long, and it is easy to carry suspended particulate matter. The low concentration of PM2.5 in the summer and autumn may be because the meteorological conditions during this period promote the diffusion of pollutants and there are few anthropogenic emission sources. Overall, the most important pollution transmission in winter came from southern Shanxi and northern Shaanxi, followed by Anhui and Shandong, again from the Beijing-Tianjin-Hebei region, and the smallest came from Hubei. The local government can carry out joint defense and joint control with relevant provinces based on the actual situation. In spring, such measures should be taken up jointly with Anhui and Hubei. In autumn, straw burning in the agricultural areas of the Huang- Huai-Hai Plain has an important contribution [7, 31]. Therefore, controlling straw burning in Henan and neighboring provinces is important. In summer, PM2.5 pollution is relatively light. Through cluster analysis of each season in Zhengzhou, the simulated backward trajectories were divided into four main categories. The results of cluster analysis are shown in Fig. 8, and arithmetic averaging was performed on the PM2.5 concentrations corresponding to various types of trajectories to characterize the atmospheric pollutant concentration levels under the influence of different airflows. The four seasons exhibit pattern differences. The pollution values of the four main transmission paths in winter exceeded the national level II standard. The number of trajectories from the northwest (Class 1) and northeast (Class 2) in the winter accounted for 69.3%. Although the proportion of airflow from the south was relatively low, it carried a high concentration of PM2.5. The situation was similar in spring and winter, but the Airflow trajectory analysis can be performed to identify the characteristics of trajectories affecting Zhengzhou city. However, it is difficult to analyze the contributions of different potential sources to PM2.5 pollution. Therefore, we performed weight-based potential source contribution factor (WPSCF) analysis and weight-based concentration weight trajectory (WCWT) analysis, as shown in Fig. 9. In the winter, the WPSCF and WCWT analyses exhibited the broadest ranges of high values; inner Henan, central and eastern Shaanxi, northwestern Hubei, southern Shandong, southern Hebei, and northern Anhui contributed a great deal to the PM2.5 pollution in Zhengzhou; specifically, Zhengzhou itself, Nanyang, Luoyang, Kaifeng, northern Anhui and the surrounding areas contributed the most to the PM2.5 pollution in Zhengzhou. In the spring and autumn, the high values of PM2.5 were generally concentrated in the vicinity of Zhengzhou, and the small values of PM2.5 were distributed at the outer periphery. The summer WPSCF and WCWT values were the lowest due to the active airflow during the high-temperature season, which is conducive to the dilution of pollutants, while the anthropogenic emission sources in the summer were the lowest within the year. In general, the contribution of exogenous PM2.5 pollution was not obvious in spring, summer and autumn, but it became more evident in winter. The airflow from the south in winter does not account for substantial proportion, but this airflow is slow and do not contribute to the spread of pollution over Henan Province. If the atmospheric pollutants from the north have not dissipated in winter, the southern airflow will begin to affect Henan Province, and the pollutants moving to the south of Henan Province will be pushed back northward. In addition, the blocking effect of the Taihang Mountains to the north makes it difficult for the pollutants to spread. Therefore, severe, or even serious pollution occurs and more attention should be given to the southern airflows to prevent heavy pollution.",
    "In regard to the temporal variation, in line with other regions [12], pollution is mainly concentrated in periods of low temperature. Relevant departments in Henan Province must focus on preventing and controlling PM2.5 emissions in winter and spring. Governments at all levels have enforced a series of preventative measures during this period, such as limiting vehicle usage and temporarily terminating factory production. The improvement of fuel quality and the replacement of coal with cleaner renewable energy sources (e.g., solar energy, hydrogen fuel, biomass energy) are the most effective means of reducing PM2.5 emissions [5]. Regional central heating and reducing bulk coal combustion are very important for such a populous province. Moreover, it is urgent to take measures to strictly forbid straw burning in farmland during late autumn [5]. From a spatial perspective, the focus of pollution p revention and control should be on the central and northern regions, and contiguous pollution should be The limitations of this study are as follows. This study initially divides PM2.5 pollution into three types but does not delve into the characteristics of each type. This topic is reserved for future research. In addition, the study of the backward trajectory is based on Zhengzhou, and it has not been extended to the entire province. It is difficult to provide an objective description of the backward trajectory, and the research method needs to be improved in the future. The Environmental Pollution Control Campaign of Henan Province began in 2016. This study examines the changes in PM2.5 levels in Henan in the last three years from a relatively macroscopic perspective. The PM2.5 pollution in Henan exhibited significant temporal variations. The annual average concentrations decreased from 72.8 μg/m3 in 2016 to 62.2 μg/m3 in 2018, and the fluctuation significantly decreased. Each month, the PM2.5 concentrations and the daily average over-standard rate showed U-shaped variations, with high values in the beginning and low values in the middle. The PM2.5 concentrations were low in spring and summer while high in autumn and winter, and the over-standard rate was similar. The air quality has improved significantly, but the pollution is still relatively high. The proportions of good days in 2016, 2017, and 2018 were 69.7, 75.6, and 78.9%, respectively. The number of days with above-moderate pollution was 64 (17.5%), 51 (14.0%), and 45 days (12.3%). The number of days with heavy pollution has decreased. There is an obvious spatial variation in PM2.5. The high concentrations of PM2.5 are concentrated in northern Henan, and those in the southern part are relatively low. The mitigation of PM2.5 pollution in various regions of Henan varied with time (season), especially in winter. EOF analysis supported this trend. The PM2.5 concentration is negatively correlated with temperature. At 0-5ºC, the concentration is the highest. The PM2.5 concentration and relative humidity share a strong, positive correlation in winter. Coal burning for heating during low temperatures is an important source of emissions. When the relative humidity is 80-90%, the concentration is the highest. Overall, the most important pollution transmission in winter comes from southern Shanxi and northern Shaanxi, followed by Anhui and Shandong, again from the Beijing-Tianjin-Hebei region, and the smallest comes from Hubei. The proportion of the airflow flowing from the south in winter is not large, but under the influence of special seasons and special geographical environments, serious pollution can easily form. This research was supported by the National Natural Science Foundation of China (41671072) and Key Research Projects of Henan Higher Education Institutions (20A610008)."
]