[
    "Abstract: With the continuous development of the social economy, carbon emissions from various buildings are increasing. As the most important category of building carbon emissions, the rapid peaking of public buildings is an important part of achieving carbon peak and carbon neutrality. This paper is based on the industrial background of the energy consumption structure of Henan Province, a central province in the developing country of China. Firstly, the energy consumption intensity of buildings and public buildings in Henan Province from 2010 to 2020 was calculated according to the energy balance sheet. The Kaya-LMDI decomposition method was also used to analyse the carbon emissions of public buildings, determining the impact of each influencing parameter on public buildings. Secondly, the scenario prediction model Monte Carlo was run 100,000 times to set the stochastic parameters of the variables in the model to predict the time of carbon peak and carbon emissions. The analysis results indicated that: @ Carbon emissions in Henan Province have exhibited a steady growth trend, increasing from 1533 t in 2010 to 6561 t in 2020; @ The primary factors influencing carbon emissions of public buildings in Henan Province were urbanization rate, public floor area per capita, and energy intensity per unit of public floor area; and @) Carbon emissions of public buildings in Henan Province followed an inverted U-shaped distribution and are expected to peak at approximately 7423 t by the year 2035. The research method in this paper can guide the simulation study of peak carbon emission prediction in Henan Province based on the influencing parameters of carbon emission from different types of buildings. Moreover, the results of this paper can provide a reference for a more precise study of building carbon reduction in similar regions of developing countries. Citation: Li, H.; Zheng, Y.; Gong, G.; Guo, H. A Simulation Study on Peak Carbon Emission of Public Buildings—In the Case of Henan Province, China. Sustainability 2023, 15, 8638. https://doi.org/ 10.3390/su15118638 Since the 21st century, rapid economic growth and yearly increase in energy consump- tion have led to a dramatic increase in overall CO2 emissions, resulting in a series of climate hazards [1–4]. As a global consensus, “carbon peaking and carbon neutrality” [5] is also a major strategy to implement the concept of developing a green economy worldwide. As a responsible country, China has committed to peaking its carbon emissions by 2030 and achieving carbon neutrality by 2060, making energy conservation and emission reduction an urgent task. Copyright: © 2023 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). The achievement of the “Double Carbon” goal requires the concerted efforts of all industries. Some studies have shown that carbon emissions from buildings account for a large proportion of total emissions. In China, the whole process of building energy consumption is high, and carbon emissions account for more than half of the national total. The total construction scale of China ranks ﬁrst in the world. The existing total urban building stock is about 65 billion square meters, and the new construction area is expected to be about two billion square meters every year. Carbon emissions show a rising trend. At the same time, with the acceleration of the urbanization process, due to the continuous expansion of the construction scale, the construction of energy consumption and carbon emissions are increasing, and the high energy consumption, high emissions problems are becoming more serious [6]. Therefore, the low-carbon development of the construction industry is closely related to the realization of the “two-carbon” goal. Carbon emissions from public buildings [7–9] are the most dominant category of building carbon emissions, mainly from ofﬁce buildings, hotels, shopping malls, health care centres, educational institutions, and other buildings, so its peak research is the key link in our “double carbon” work. There is a signiﬁcant gap in the development speed between the coastal regions and the central and western regions of China. In order to achieve nationwide carbon emission reduction [10], each province needs to accurately identify the current status of energy consumption and analyse the factors affecting carbon emissions. In addition, various analysis models need to be adopted to accurately predict the carbon peak of each province for a proper transformation of the industrial structure.",
    "Henan Province has the largest population in China, with a resident population of 98.72 million and a population density of about 595 inhabitants/km2. Its public building construction has the highest CO2 emissions in the country [11]. Therefore, it is important to accurately identify the factors affecting the carbon emissions from public buildings in Henan Province and predict the carbon peak. Accurate prediction is key to deploying the emission-peaking path for public buildings in Henan Province and maintaining synergistic carbon reduction and economic development, providing implications for other similar regions around the world. According to the existing studies, the calculation of building energy consumption [12,13] mainly focuses on: Wholesale, Retail Trade, Accommodation and Catering Services; Others; Residential Life Consumptions. In the study of the factors influencing carbon emissions of buildings within China and its provinces [14–16], the methods mainly used by researchers are EKC curve analysis, the Kaya equation [17–20], and the LMDI (Logarithmic Mean Divisia Index) model. For the prediction of carbon emission, the frequently used methods are the STIRPAT model, LEAP model, and scenario prediction. By using the STIRPAT model, Zhao et al. [21], Wu et al. [22], and Ma et al. [23] demonstrated that Henan province is also the priority for the future reduction of household CO2 emission, and the potential for energy climate change mitigation depends on the emission factors and changes in energy structure. The LEAP model was a “bottom-up” model proposed by Zou et al. [24] for analysing the CO2 emissions and CO2 peaks in Shanxi Province for 2019–2035 under different scenarios. The time to peak CO2 emissions under different reduction measures was analysed. In addition, Dong et al. [25,26] conducted a scenario prediction analysis of China’s carbon emissions to characterise the future development of carbon emissions in Jiangsu Province (a coastal province in China). The obtained data were more accurate than that of the LEAP model, offering some implications for China’s central and western regions. However, these carbon emission prediction models only considered variables such as energy consumption intensity, population, and energy emission coefficient. The uncertainties of variables such as GDP per capita and urbanisation level were not considered. Therefore, the measurement of carbon emissions and the study of emission reduction pathways have certain limitations. This paper focuses on the peak carbon emissions of public buildings in Henan Province, a central province in China’s developing country. The energy consumption intensity of buildings and public buildings from 2010 to 2020 was calculated using an energy balance sheet, and factors inﬂuencing carbon emissions during this period were analyzed. The Kaya–LMDI [27–29] decomposition method was employed to compute the carbon emis- sions of public buildings in Henan Province. By conducting 100,000 Monte-Carlo [30,31] dynamic and static simulations, the timing of carbon peak and carbon emissions from public buildings in Henan Province were accurately predicted. Finally, an analysis was conducted on the carbon emission factors of public buildings in Henan Province with corresponding peak and off-peak interval distributions. On this basis, the potential for reducing carbon emissions in the construction industry of Henan Province was estimated. Furthermore, the future carbon emission trajectories of public buildings in Henan Province were predicted to address gaps in existing research and provide theoretical references for making emission reduction decisions in other regions worldwide In most studies on public building carbon emission, the parameters mainly include energy consumption intensity, population [32,33], energy emission factors, etc. Inﬂuencing factors, such as GDP per capita and urbanisation level, are not considered. Wang et al. [34] constructed a decomposition model of macroscopic carbon emission factors to identify the main driving factors affecting the change in carbon emission from public buildings in China. Based on the decomposition results, a system dynamics model was further constructed to predict the peak carbon emissions from public buildings in China. Based on existing public buildings in the hot-summer and cold-winter regions of China, Huang et al. [35] identified the best combination of energy efficiency strategies through global sensitivity analysis and dynamic simulation. The optimal solution for energy saving and emission reduction was obtained using a time-of-use tariff strategy. Liu et al. [36] analysed existing public buildings based on GBRS and proposed 15 measures in six areas: materials, energy, management, innovation, facilities, and water. Among these measures, energy and materials were the most important measures, accounting for 18.3% and 17.7%, respectively. Nevertheless, all of the above scholars mainly considered the impact of energy intensity on energy saving and emission reduction in public buildings, while ignoring other driving factors that inhibit the growth of carbon emissions from public buildings.",
    "The Kaya equation proposed by Japanese scholars expressed four factors (social, economic, energy, and carbon emissions) in a simple mathematical equation, with the advantages of strong explanatory power for determinants, simplicity of form, and no de- composition residuals. This equation has become the basis for the IPCC (Intergovernmental Panel on Climate Change) emission scenarios [37]. Based on an open discussion of China’s medium- and long-term economic and social development goals, Liu et al. [38] developed models of energy consumption and associated CO2 emissions. The trends for the main drivers of CO2 emissions were also analysed. The results indicated that continued energy ef- ﬁciency reforms, industry restructuring, and energy restructuring are the three main drivers for achieving carbon neutrality. Different scenarios for 2020–2060 were predicted based on the Kaya constant equation. In 2019, Peng et al. [39] analysed the share of construction and construction-related carbon emissions in the total carbon emissions of Chinese society, with construction carbon emissions accounting for 16%. Due to the size and high energy consumption per unit area, the consumption of public buildings accounted for 38% of all building energy consumption or 8% of the national total energy consumption. The Kaya model based on different types of public buildings/municipalities with improved energy efﬁciency and full use of renewable energy can contribute to reducing carbon emissions in China’s construction industry. However, using only the Kaya model to detect changes in carbon emissions makes it difﬁcult to determine the actual impact on total emissions, and differences in economic and social trends cannot be accurately described. Chen et al. [40] calculated energy consumption and carbon emissions in the construc- tion phase of large public buildings based on an improved STIRPAT (Stochastic Impacts by Regression on Population, Afﬂuence, and Technology) model. Multiple inﬂuencing factors related to energy consumption and carbon emission during the construction process were identiﬁed, and the effects of population and engineering machinery performance on energy consumption and carbon emission intensity were analysed. Based on the results of the STIRPAT model for environmental pollution and carbon emissions in Fujian Province, Zhao et al. [41] developed a 3E system model to simulate three development scenarios in Fujian Province and explore the EKC (Environmental Kuznets Curve). The results of the STIRPAT model showed that population, economic structure, and energy structure were the main inﬂuencing factors of environmental pollution and carbon emission in Fujian Province. However, the STIRPAT model overemphasises the role of energy structure and fails to explain the impact mechanism of GDP per capita and urbanisation level on the environment in more detail. Raza [42] used the LMDI model to analyse the factors affecting carbon emissions. The key drivers were examined in three main aspects: First, the LMDI between population, activity, electricity intensity, total electricity, generation mix, energy efﬁciency, and fuel emission factor effects was used to measure CO2 emissions from the electric power sector. Second, the relationship between electricity CO2 emission and the economy was analysed through the Tapio decoupling index. Third, a decoupling index for each factor was analysed to provide references for the green economy and policy. Chen et al. [43] analysed the coupled coordination of carbon emissions and the ecological environment in China. The coordination of carbon emissions and the ecological environment from 2009–2015 were examined. In addition, LMDI was used to identify the key factors affecting the coordination. Different scenarios were simulated to show the impact of changes in government priorities on the level of coordination. However, the separate use of the LMDI model still has shortcomings in the elasticity analysis. This study considers the effects of energy consumption intensity, population, energy emission factor, GDP per capita, urbanisation level, and tertiary industry. The new Kaya– LMDI model is constructed based on the Kaya constant equation and the LMDI model to analyse the CO2 emissions in Henan Province. Henan Province is located in the central region of China (see Figure 1), which is rich in mineral resources. It has the largest population, with a resident population of 98.72 million and a population density of about 595 inhabitants/km2. Its unbalanced industrial structure leads to a more prominent energy consumption, with CO2 emissions accounting for about 5% of the country’s total relevant carbon emissions and an emission intensity about four times that of Beijing.",
    "Carbon emission is a prerequisite for peak prediction. For the prediction of carbon peak, this study calculates carbon emissions from public buildings in Henan Province by retrieving data from the China Energy Statistical Yearbook and the Henan Provincial Statistical Yearbook. The research in this paper relies on long-term and continuous time series data for building energy consumption and carbon emissions. By comparing two accounting meth- ods for building energy consumption, it is found that the top-down energy balance sheet splitting method provides easily accessible and authoritative data, as well as a continuous time series. The energy consumption and carbon emission data obtained through this method are deemed reliable and highly comparable, making it the preferred source of data for this paper. The end-use energy sectors are divided into seven categories in China’s energy balance sheet: Agriculture, Forestry, Animal Husbandry and Fisheries; Industry; Construction; Transportation, Storage and Postal Services; Wholesale, Retail Trade, Accommodation and Catering Services; Others; and Residential Life. Since there are no detailed statistics on building energy consumption, the building energy consumption was ﬁrst separated based on China’s energy balance sheet in the statistical yearbook. The building energy consumption is mainly calculated based on Wholesale, Retail Trade, Accommodation and Catering Services, Others, and Residential Life consumptions after deducting part of the transportation energy consumption (consumptions of gasoline and diesel [44]). Energy consumption generated by industry and construction is not considered here. Building energy consumption [45] can be generally expressed by the following equations: Based on previous studies and historical data, the energy consumption of public buildings in Henan Province is analysed, and a basic measurement model can be obtained. Currently, three methods are commonly used to calculate building energy consumption. In this study, the calculation is based on a statistical yearbook, which contains authori- tative and reliable data that can be accurately accessed. However, this method requires extracting the scope involved in the energy consumption of public buildings. Therefore, the energy consumption of public buildings in this study is based on Wholesale, Retail Trade, Accommodation and Catering Services, and Others, excluding Residential Life Consumption. Since most areas in Henan Province are centrally heated [46], the heating energy consumption is corrected to be equal to the difference between the heat from central heating and the heat consumption from Wholesale, Retail Trade, Accommodation and Catering Service and Others in the energy balance sheet. In this study, the calculation method of energy consumption in public buildings in Henan Province is based on the theoretical analysis method summarised by Ma et al. [22], Cai et al. [47], and Xie et al. [48]. The energy consumption in public buildings can be generally expressed by the following equations: In Equation (4), EW indicates the energy consumption of Wholesale, Retail Trade, Accommodation and Catering Services; EO indicates the energy consumption of Others; E2 indicates the corrected heating energy consumption. In Equation (5), Ec T indicates the coal consumption in the building energy consumption of transportation and storage; Eeb T indicates the electricity consumption in the building energy consumption of transporta- tion and storage. The total energy consumption of public buildings in Henan Province from 2010 to 2020 [49,50] was calculated based on the energy balance sheet (Table 1). Since the data in the energy balance sheet are physical quantities, they need to be converted using energy conversion factors. The converted standard coal coefﬁcients for various energy sources are shown in Table 2. The calculation results in Table 1 show that the energy consumption of buildings is increasing every year. The emergence of new buildings, such as ofﬁce buildings, hotels, and shopping malls, led to a rapid increase in energy consumption. In addition, the pursuit of a more comfortable living environment also increased energy consumption. In 2017, the People’s Government of Henan Province issued a comprehensive work plan on energy conservation [51] and emission reduction for the 13th Five-Year Plan, resulting in a slight decrease in energy consumption in public buildings. The carbon emission research institute of public buildings primarily employs models such as Kaya, STIRPAT, and LMDI. The Kaya equation is the basis of current CO2 analysis, with the advantages of the strong explanatory power of determinants, simple form, and no decomposition residue. The LMDI model also has good symmetry and simplicity. While some researchers have utilized the STIRPAT model to calculate energy consumption and carbon emissions during the construction phase of large public buildings, it falls short of providing a detailed analysis of how per capita GDP and urbanization levels impact the environment. Similarly, the inadequacy of elasticity analysis is also evident when using the LMDI model separately to establish an analysis of China’s carbon emission and ecological environment coupling and coordination. Combining the advantages of these two models, the Kaya–LMDI model was constructed to analyse the inﬂuencing factors of CO2 emissions in Henan Province.",
    "where C—carbon emissions from public buildings; i—carbon emission factors for energy in public buildings; e—energy consumption intensity per unit of public ﬂoor area; s—public ﬂoor area per capita; u—urbanisation rate; p—non-urban population. The carbon emission process of a building has a complete life cycle, which can be broadly divided into four stages: production stage, construction stage, operational stage, and dismantling stage. Some scholars conducted a quantitative analysis of the carbon emissions of buildings in Henan Province and proposed emission reduction countermeasures. In this way, the total carbon emissions of public and residential buildings in Henan Province from 2010 to 2020 were obtained [52]. The calculated energy consumption of buildings and the carbon emissions of buildings in this study are mainly for the operational stage. The LMDI decomposition method includes LMDI-I and LMDI-II. LMDI-I decom- position method is the most widely used method with the advantages of convenient decomposition of the form, no residuals on decomposition results, independent analysis path, and uniqueness of analysis results. Based on the Kaya constant equation and LMDI decomposition method for energy consumption and CO2 emissions in the building life cycle, this study investigates the factors that reduce the carbon emission intensity of public buildings in Henan Province and the contribution of each factor to the change of building carbon intensity. The factor decomposition of LMDI based on the additive form for the time interval [0, T] can be expressed by Equation (8): where ∆C represents the sum of the inﬂuencing factors; CT represents the total public building emissions generated in period T; C0 represents the total public building emissions generated during the initial period. Speciﬁcally, each parameter on the right side of Equation (8) can be further expressed to reﬂect the contribution of inﬂuencing factors: Public buildings are a major part of the building system. Therefore, controlling emissions from public buildings is an important part of reducing the overall growth of CO2 emissions from buildings. The total historical emission reduction and emission intensity of public buildings in the time interval [0, T] can be expressed by Equations (14) and (15), respectively: where CM |0→T indicates historical carbon emissions from public buildings; CMintensity |0→T indicates historical carbon intensity of public buildings; ∆C contains ∆Ci, ∆Ce,∆Cs,∆Cu,∆Cp, ∆C |0→T< 0. Table 3. Analysis results of the Kaya–LMDI decomposition method for carbon emissions of public buildings in Henan Province from 2011 to 2020. Uncertainty analysis and Kaya analysis of public buildings in Henan Province show that the energy intensity of each public building and the public ﬂoor area per capita is closely related. In the statistical yearbook, there is a lack of directly available data on the public ﬂoor area. In addition, public buildings include various types of buildings, such as ofﬁce buildings, shopping malls, hotels, cultural and educational buildings, and healthcare buildings. Therefore, the calculation of public ﬂoor area is critical for the subsequent analysis of public ﬂoor area per capita. According to previous studies, there are two main methods for calculating the public ﬂoor area [55,56]. This study measured the public ﬂoor area per capita in the service industry. The public ﬂoor area depends on the number of personnel in the service sector and the public ﬂoor area per capita. The number of personnel is closely related to GDP per capita, and the public ﬂoor area per capita is closely associated with the tertiary industry. In general, the expansion of the service sector directly causes rapid growth in the number of public buildings. Based on the above analysis, this study used the public building calculation model developed by McNeil [57] and Hong [58] to estimate the area of public buildings in Henan Province, thus calculating the public ﬂoor area per capita. t denotes the public ﬂoor area in year t; Pt and at denote the number of personnel in year t and the public ﬂoor are per capita in year t, respectively; ε value is set as 40 m2; I is deﬁned as GDP per capita, γ,θ is determined as −1.1285 × 10−4,1.5, respectively. GDP per capita and the number of personnel in the service sector can be found in the statistical yearbooks for the relevant years. By using the ratio between the carbon emission of public buildings and the energy consumption of public buildings in Henan Province from 2010 to 2020, the energy emission coefﬁcient of Henan Province each year can be obtained. The inﬂuencing factors of carbon emissions from public buildings in Henan Province are shown in Table 4.",
    "Scenario analysis [59] refers to the process of identifying and assessing the potential impact of possible future scenarios under uncertainty [60] and then optimising the future direction through the analysis results. In this study, the scenario analysis method includes a static scenario analysis model and a dynamic scenario analysis model. The dynamic analysis model can better analyse the future trend of carbon emissions in Henan Province and the potential peak distribution [61] by determining the changes in the probability distribution of individual parameters. From a national perspective, 2030 is a critical moment for carbon peaking [62], with several factors contributing to the change in building carbon emissions. This result demonstrates the importance of scenario analysis prediction. The static scenario analysis model is a relatively traditional method, which focuses on assigning a deterministic value to each variable that inﬂuences the carbon emissions of public buildings. In this paper, three scenarios were set for predicting the peak carbon emissions of public buildings in Henan Province: low carbon scenario; baseline scenario; high carbon scenario. Firstly, the values of 2030 and 2050 were set based on literature research [63]. Secondly, the data for the intermediate years were complemented based on polynomial ﬁtting. After obtaining the parameters for each year, the parameter values in the model are replaced to predict the total carbon emissions from public buildings. Finally, the predicted carbon emissions of public buildings in Henan Province under different static scenarios are obtained (Table 5). The dynamic scenario analysis adopts the method of Monte Carlo simulation based on the baseline scenario in the static scenario analysis. The core of a Monte Carlo simulation is the random assignment of values to each explanatory variable in the model. The dynamic simulation focuses on the peak time and analyses the key factors affecting the peak by varying the probabilities among the variables, providing a reference for achieving the “Double Carbon” goal in Henan Province. The speciﬁc steps for dynamic scenario design are as follows: The simulation results for predicting the future carbon emission changes of public buildings are mostly normally distributed. In addition, the following rules are set for the values of the normal distribution on σ for random parameters of different variables at the 95% conﬁdence level: future changes for each variable in the model should be in the ±2σ interval. According to the above rules, the variable results for total carbon emissions from public buildings can be obtained, as shown in Table 6. By investigating carbon emissions of public buildings in Henan Province from 2010 to 2020 under three static scenarios (low carbon scenario, baseline scenario, and high carbon scenario), the development trend can be identiﬁed. It can be seen from Figure 3 that the variation in carbon emissions exhibits an inverted U-shaped curve. Currently, carbon emissions in Henan Province continue to grow and are expected to peak after 2035, with a slow decline after that. The changes in carbon emissions from public buildings in Henan Province from 2010–2050 are plotted in Figure 3. Carbon emissions with different probabilities are simulated by scaling up the original curves and using different levels of error bands. In this study, 100,000 simulations were conducted using a Monte Carlo model to determine dynamic scenarios of future peak levels and peak times of CO2 emissions. Based on the simulation results, the corresponding “Double Control” objectives are adopted. As shown in Figure 4a, the carbon dioxide emissions from public buildings in Henan province peaked at about 74.23 million tons of carbon dioxide. Figure 4b shows that the peak time of public buildings in Henan province is about 2035 (±3). Moreover, the results of the dynamic scenario analysis can verify the rationality of the static scenario analysis model. Since all simulated peak times are normally distributed at the 95% conﬁdence level. The future peak interval for carbon emissions from public buildings in the building sector, excluding industrial buildings, is 2035–2040. If the peak is in 2037, the country may also meet the “Double Carbon” goal by 2030, even if the peaks of the construction sector are later than the country’s 2030 carbon emissions target [64]. In response to the current situation, active measures should be taken to optimise the energy structure and promote transportation and various low-carbon technologies.",
    "According to the sensitivity analysis in Figure 5, the peak carbon emission and the peak time of public buildings in Henan Province are signiﬁcantly inﬂuenced by the public ﬂoor area per capita, with a contribution rate of about 57%. The urbanisation rate has a minimum impact of about 0.2%, and the energy intensity of public buildings and the population size have a moderate impact. This result indirectly reﬂects the focus on construction emission reduction in Henan Province. Figure 5. Sensitivity analysis of the uncertainty of peak carbon emission and peak emission time of public buildings in Henan Province. (a) The uncertainty of peak carbon emissions; (b) The uncertainty of peak carbon emission times. As the largest developing country, China is actively implementing The Paris Agree- ment, striving to peak CO2 emissions by 2030 and achieve carbon neutrality by 2060, demonstrating China’s determination to combat climate change. In January 2021, the China Development and Reform Commission (CDRC) announced six aspects of China’s effort to achieve the “Double Carbon” goal at a press conference, including adjusting the energy structure; promoting the transformation of industrial structure; improving energy utilisation efﬁciency; facilitating the research and development of low-carbon technology; improving the institutional mechanism for low-carbon development; increasing ecological carbon sinks. As the most populous province in China, Henan has an expanding scale of ofﬁce buildings, shopping malls, hotels, and other public buildings, which has become its future development trend. Therefore, it is essential to save energy and reduce carbon emissions from public buildings. This study can provide new ideas for making a green and low-carbon transition and developing an effective emission reduction path for public buildings in Henan Province. Furthermore, it can guide similar regions in other countries around the world and help to achieve the “Double Carbon” goal in a concerted manner. (such as the renovation of heating, lighting, cooling, and other facilities) should be implemented to stop energy-intensive industries and promote “Double Carbon” goals (carbon peak and carbon neutrality). Author Contributions: Methodology, H.L.; Software, G.G.; Writing—original draft, Y.Z.; Writing— review & editing, H.G. All authors have read and agreed to the published version of the manuscript. Funding: This work was supported by the Nanhu Scholars Program for Young Scholars of XYNU and Youth Sustentation of Xinyang Normal University (Grant No.2022-QN-043)."
]