[
    "Citation: Ren, X.; Zhang, M.; Qian, J.; Li, S.; Wang, J.; Du, J. Analyzing Spatio-Temporal Change in Ecosystem Quality and Its Driving Mechanism in Henan Province, China, from 2010 to 2020. Sustainability 2022, 14, 11742. https://doi.org/10.3390/ su141811742 Abstract: Henan Province is an important ecological barrier in the middle and lower reaches of the Yellow River. It is of great signiﬁcance to study its ecosystem quality and the driving mechanisms behind this in order to realize ecological conservation and high-quality development in the Yellow River Basin. In this study, from the perspective of physical elements, socioeconomic elements, and policy adjustments, multi-source data on land use, population density, forestry engineering, and other indicators were selected to construct an index system of the driving factors of ecosystem quality in Henan Province. The characteristics of spatio-temporal change and the formation mechanism of ecosystem quality in Henan Province from 2010 to 2020 were analyzed by comprehensively using the gravity center analysis method and a geo-detector tool. The results showed the following: (1) The ecosystem quality of Henan Province in 2020 has increased by 27.7% compared with that in 2010, and the center of gravity of ecosystem quality continued to move to the northwest of Henan Province. The quality of ecosystems in the hilly region of Western Henan, Tongbai, and Nanyang was better than that in the northern Loess Platform Hilly Area and the Yellow River Plain, and it presented a spatial pattern in which the quality of the south was higher than that of the north, while the east and west were equal; (2) From 2010 to 2020, the average GDP and population density in Henan Province were the most important factors affecting the quality of its ecosystem. The effect of land-use diversity on ecosystem quality in the hilly region of Henan Province was stronger than that in the central and eastern plains; and (3) The interactions among the driving factors were mainly nonlinear enhancement and double factor enhancement, in which the interaction between socio-economic elements and natural environmental elements was the dominant interaction mode and could enhance the impact on the quality of the regional ecological environment. The results of this study indicate that attention should be paid to generating targeted industrial economy layout and land use policies in different natural domains. Moreover, forestry protection engineering policies should be further Copyright: © 2022 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). With the intensiﬁcation of global climate change, the problem of the ecological environ- ment has become an important challenge for the sustainable development of human society, and it has become the focus of academic and government departments [1,2]. Since the 1990s, with the rapid development of China’s national economy and the increasingly prominent ecological and environmental problems, China has implemented a series of ecological construction projects, including the construction of national key ecological function zones and projects such as returning grain-growing land to forestry and grasslands. However, the process of urbanization and industrialization in China is developing rapidly, and the imbalance between protecting the ecological environment and socioeconomic development is still serious. Therefore, it is of great practical importance to examine the temporal and spatial variations in ecosystem quality and their inﬂuencing mechanisms with regard to maintaining ecological security, promoting sustainable development, and increasing human well-being. At present, ecological environment problems represent a research hotspot. Some schol- ars concerned about the impact of economic activities on the social ecosystem, while others mainly focus on the analysis of regional ecological environmental change mechanisms. For example, Alexandrescu et al. [3] and Rîs,teiu et al. [4] studied the impact of mining pollution in Romania on depopulation and social risk. Haq et al. [5] and Cretan et al. [6] analyzed the driving mechanism of foreign direct investment (FDI) on the regional ecosystem and urban development. Meanwhile, several studies focus on the impact of global climate change on the survival rights of the urban poor in countries such as Hungary, the Philippines, and Nigeria [7–9]. In these studies, a quantitative analysis of regional ecological environment changes was carried out to evaluate a certain ecological index in the region, which can be constructed via statistical methods and operational research [10–13]. Generally, the index is constructed by the analytic hierarchy process [14–16] and principal component analysis [17,18]. For example, Zhong et al. selected topography, temperature, GDP, and other indicators to establish an evaluation index system and evaluated the spatio-temporal variations in the ecological environment’s quality in Yunnan Province based on principal component analysis [17]. The Ministry of Ecology and Environment of China used the analytic hierarchy process (AHP) or the entropy weight method to develop an important environmental index (EI) to evaluate the regional ecological environment. Since vegetation plays an active role in the Earth’s environmental system [19–21], the ecological index can also be realized via remote sensing or GIS methods. For example, some studies have pro- posed remote sensing and the use of net primary productivity (NPP) [22], the normalized difference vegetation index (NDVI) [23], the enhanced vegetation index (EVI) [24] and the re-mote sensing-based ecological index (RSEI) [25] to measure the variations in regional ecosystems. Yang et al. constructed the RSEI through principal component analysis to analyze the spatio-temporal evolution trends of the eco-environmental quality in the Yellow River Basin in China [26]. Quantitative evaluation of ecological indicators can be based on models summarized from different perspectives [27–30]. Taking quantitative analy- sis of ecosystem service functions as an example, the InVEST and RUSLE models have been widely used to assess the spatio-temporal dynamics of ecosystem services or habitat According to related studies, the methods used to determine the driving mechanisms of ecological environment changes can be classiﬁed into two categories: non-spatial regres- sion models and spatial regression models. The non-spatial regression category includes the stepwise regression model [35], scenario analysis [36], constrained ordination tech- nique [37], curve estimate method [38],and ordinary least squares (OLS) [39]. The spatial regression category mainly includes the geo-detector method (GD) [40], geographically weighted regression (GWR) [41], and spatial lag model [42]. Compared with non-spatial regression models, spatial regression models consider the spatial heterogeneity of the driving factors by constructing local regression equations for each region [43,44], which is impossible in non-spatial regression models. Therefore, spatial regression models are widely used in ecological environment research. For example, Zhang et al. selected evalua- tion indicators such as soil, topography, and night light data in the arid region of northwest China and used the geo-detector model to analyze ecological vulnerability [45].",
    "Henan Province is located in the middle and lower reaches of the Yellow River in China. It is an economic agglomeration area along the Yellow River and forms part of the important support belt of the ecological barrier of the Yellow River Basin. In 2019, the Chinese government proposed an ecological conservation and high-quality development strategy for the Yellow River Basin, and it holds an important strategic position in China [2,46]. Henan Province assumes great responsibility for the ecological protection and high-quality development of the Yellow River Basin. However, currently, the research on the mechanisms of ecological environment change in Henan Province are few and how speciﬁc measures should be drawn up is still unclear. Thus, clarifying the driving mechanisms is critical to designing policies and coordinating the relationships between economic development and ecological environment protection. Therefore, this study focused on Henan Province to analyze the spatio-temporal changes in ecosystem quality from 2010 to 2020. Based on the spatial regression model, the ecological driving mechanisms in different natural domains were explored by constructing an index system that is suitable for the development of Henan Province. Based on the research, corresponding environmental protection measures were proposed for the rapid healthy development of Henan Province. Our research can provide a reliable reference for regional sustainable development in China. Henan Province is located in the central part of China, with a continental monsoon climate in the transition from the northern subtropical zone to the warm temperate zone. The average annual precipitation in Henan Province is about 500–900 mm, and the average annual temperature is 12–16 ◦C. There are many mountainous areas in the south and west; the temperatures are high in the east and low in the west, and they are high in the south and low in the north. Due to the differences in heat and moisture between the north and the south of Henan Province, as well as the corresponding soil types and the dimensional zonal differences in biological processes, Henan Province is divided into seven natural domains, namely, the Taihang Mountain and Hill Area (TMHA), the Loess Platform Hilly Area (LPHA), the Yellow River Plain Area (YRPA), the Western Henan Mountain and Hill Area (WHMHA), the Huai River Plain Area (HRPA), the Nanyang Basin Area (NYBA), and the Tongbai Mountain and Hill Area (TBMHA). Moreover, according to the administrative unit division standards of Henan’s statistical yearbook of 2020, the county units of Henan Province in 2010 and 2015 are shown in Figure 1. The data involved in the study were as follows: relief amplitude data were obtained from the Chinese Academy of Sciences Resource and Environmental Science Data Center (http://www.gscloud.cn/ (accessed on 10 June 2022)); Land-use diversity data were ob- tained from the Chinese Academy of Sciences Resource and Environmental Science Data Center with the spatial resolution of 1 km × 1 km; Rainfall and temperature data were obtained from the meteorological station data provided by the China Meteorological Infor- mation Center (http://data.cma.cn/ (accessed on 10 June 2022)). The data were mainly based on the ArcGIS software platform, and kriging interpolation was used to spatially interpolate the station data with the spatial resolution of 1 km × 1 km; then averaging was used to obtain the spatial distribution data of the annual average temperature and annual average rainfall of county units in Henan Province in 2010, 2015, and 2020. Population and GDP data were obtained from the statistical yearbooks of the cities in Henan Province, including the resident population and gross domestic product of each county and city at the end of 2010, 2015, and 2020. Forestry project data were gathered from the ofﬁcial website of the Henan Provincial Forestry Bureau and Henan Provincial People’s Government, and they were used to count the number of continuously implemented national forestry projects in Henan Province’s county units in 2010, 2015, and 2020, including turning farmland into forests, natural forest protection projects, and shelter forest projects. The data on fractional vegetation cover, leaf area index, and gross primary productivity were from the Institute of Remote Sensing, Chinese Academy of Sciences, with the spatial resolution of 1 km × 1 km; they were used to calculate the ecosystem quality index (EQI) of county units in Henan Province. From 2010 to 2020, there were a few changes in the county administrative units in Henan Province. Therefore, the population, GDP, and regional area data of the county units in 2010 and 2015 were reprocessed according to the division standards of the county administrative units in Henan Province in 2020. According to the locations of the central coordinates of each county administrative unit, we determined the domain to which each belonged.",
    "The spatial distribution of ecosystem quality is generally the result of multiple fac- tors [47,48], including physical elements and human elements. Physical elements are innate factors that affect the quality of the ecological environment. Human society can optimize, interfere with, or disrupt the regional ecological environment through a series of activi- ties. By consulting the relevant research results and following the principles of scientiﬁc investigation, comprehensiveness, and independence, this study selected different factors from the three aspects of the physical elements, the socioeconomic elements, and policy adjustments in order to construct an index system of the driving factors of changes in ecosystem quality in Henan Province. See Table 1 for the speciﬁc indicator system. Physical elements are the basis for the formation of the spatial patterns of ecosystem quality. In this study, four indices covering topography, climate, and land use were selected to reﬂect the differences in the region’s natural conditions. Topographic development is slow, but it is an important factor affecting the spatial patterns of ecosystem quality. Therefore, relief amplitude was selected to measure the effects of topography on the distribution pattern of ecosystem quality. Climate factors are the most direct and sensitive factors that affect the regional changes in the ecological environment. The average annual rainfall and average annual temperature play a decisive role in driving the evolution of ecosystem quality at the spatiotemporal scale. Land use diversity was used to reﬂect the intensity of interference of human activities in the changes in natural surface elements. The impact of social economy on ecosystem quality is the most ﬂexible. This study chose population density and average GDP to reﬂect the intensity of human activities. At the same time, national or local policy adjustments have an important impact on the evolution of ecosystem quality. Therefore, in order to systematically study the evolutionary mechanism of ecosystem quality in Henan Province, this study selected programs of turning farmland into forests, natural forest protection programs, and shelter forest programs to analyze their impacts on changes in the ecological environment and to measure the effectiveness of policy regulations in the evolution of ecosystem quality. All the data in this study use the individual counties of Henan Province as the statistical unit to build the index database. Through the use of the ArcGIS10.3 software, the quantitative and spatial evolution of ecosystem quality in Henan Province were realized. In order to verify whether there was redundant information in the driving factors, this study used SPSS to diagnose any collinearity between the independent variables. The variance inﬂation factor and tolerance were used to perform multivariate collinearity tests among the indicators. When the collinearity of the index is strong, the variance expansion factor is larger. A value of less than 10 indicates that the collinearity is not obvious, and a score above 10 indicates that the collinearity is obvious. Tolerance is the reciprocal of the variance inﬂation factor, so it is bounded by 0.1. The smaller the tolerance, the stronger the collinearity. By extracting the driving factor indices and EQI of 123 county units in Henan Province for the collinearity test, the results show that there was no collinearity among all driving factors, and the selected indices are scientiﬁc and reasonable (see Table 2). The ecosystem quality index reﬂects the general situation of vegetation and ecosystem in a region, referring to the ecosystem quality assessment standards issued by the Ministry of Ecology and the Environment of China [49]. This study constructed the ecosystem quality index based on the relative density of the remote sensing ecological parameters, namely, the vegetation coverage index (FVC), leaf area index (LAI), and gross primary productivity (GPP), to calculate the ecosystem quality index (EQI) of Henan Province. According to the National Ecological Function Zoning legislation issued by the Min- istry of Ecology and the Environment of China, the vegetation coverage, leaf area index, and relative density of gross primary productivity in Henan Province were calculated for four types of vegetation: forests, shrubland, grassland, and farmland. The value range of each index was converted into the range of 0–1 through normalization; see Equation (1): where RVIi,j,k is the relative density of the kth vegetation parameter in the jth area in the ith year; Fi,j,k is the ecological parameter value of the kth vegetation parameter in the jth area in the ith year; Fmaxi,j,k is the maximum value of the ecological parameters of the kth vegetation parameter in the jth area in the ith year.",
    "where EQIi,j is the environmental quality of the ecosystem in the jth zone of the ith year; LAIi,j is the relative density of the ecological leaf area index in the jth zone in the ith year; GPPi,j is the relative density of the total gross primary productivity of the ecosystem in the ith year and the jth zone. After we calculated the ecosystem quality index, according to the technical speciﬁca- tions for the investigation and assessment of national ecological status, the environmental quality of the ecosystem was divided into ﬁve grades, namely, very low, low, moderate, high, and very high, as shown in Table 3. By reviewing the related references, this study adopted the concept of the physical center of gravity to calculate the spatial movement characteristics of ecosystem quality in Henan Province. In general, improvements or deterioration in the ecosystem quality make the gravity center of ecosystem quality constantly change. The movement track of the gravity center of ecosystem quality can effectively reveal the spatial trajectory of the evolution of the regional ecological environment. This is calculated as follows: where EQIij represents the ecosystem quality index of unit j at time t, Xi and Yj represent the geographical center coordinates of unit j, and Xt and Yt represent the central coordinates of regional ecosystem quality at time t. The geo-detectors model is a spatial detection model that is widely applied in the social, economic, and ecological ﬁelds, and it is a statistical method that is used to explore the laws of spatial differentiation and reveal the driving forces. It is mainly used to measure the importance of independent variables relative to dependent variables [50]. In this study, factor detection and interaction detection via the geo-detectors model were used to quantitatively analyze the driving factors of ecosystem quality changes in Henan Province and explore the possible interactions among different factors. where q is the detection index of the impact of driving factors on ecosystem quality; j = 1, . . . , i; i is the classiﬁcation or partition number of the dependent variable or the independent variable; Nh and N are the number of units of the corresponding layer or class and the number of units of the whole research area, respectively; σ2 h and σ2 are the ecosystem quality variance of the sub-region and the whole region, respectively. The value range of q is [0, 1], and when q = 0, this indicates that the ecosystem quality presents a random distribution. The larger the value of q, the stronger the explanation of the change in ecosystem quality by the independent variable factor and the stronger the spatial heterogeneity of ecosystem quality. According to the calculated ecosystem quality index, the spatial and temporal distribu- tion patterns of ecosystem quality in Henan Province from 2010 to 2020 were obtained, as shown in Figure 2. From the perspective of spatial distribution, the quality of ecosystems in southern Henan Province was generally stronger than that in the central and northern regions. Speciﬁcally, the high-value areas of ecosystem quality were mainly concentrated in the southwest of the mountainous and hilly areas in Western Henan and the north of the mountainous and hilly areas in Tongbai. The low-value areas of ecosystem quality were mainly distributed in the Yellow River Plain, especially in the surrounding cities with Zhengzhou as the center. An evaluation of the county-level ecosystem quality in Henan Province from 2010 to 2020 showed that in 2010, there were no “very high” counties in Henan Province, and only three categories of ecosystem quality were found, namely, “low”, “moderate”, and “high”, accounting for 6.62%, 61.47%, and 31.92% of the area of Henan Province, respectively. In 2015, the ecosystem quality in Henan Province was divided into four categories: “low”, “moderate”, “high”, and very high”, accounting for 2.75%, 35.11%, 52.78%, and 9.35% of the area of the province, respectively. In 2020, the counties with “low”, “moderate”, “high”, and “very high” ecosystem quality levels in Henan Province accounted for 2.19%, 36.95%, 53.27%, and 7.59% of the area of the province, respectively. By measuring the change trend of ecosystem quality in Henan Province from 2010 to 2020, it can be seen that the quality of ecosystems in Henan Province showed a trend of slow improvement (Figure 3). From 2010 to 2015, the ecosystem quality index of Henan Province increased signiﬁcantly. The ecosystem quality index in 2015 increased by 26.6% compared with that in 2010, which was related to the implementation of the projects of turning farmland into forest in Henan Province during this period. From 2015 to 2020, the quality of ecosystems in Henan Province showed a comprehensive interaction process between two forms of continuous regional improvement and deterioration. In 2020, the ecosystem quality in Henan Province only increased by about 0.7% compared with that of 2015. The ecosystem quality index of Henan Province basically remained stable; although it slightly improved, it was not signiﬁcant. During this period, Henan Province entered a period of rapid development in terms of urbanization and industrialization. A large amount of arable land was used for industrial and transportation construction, and deforestation and reclamation further caused conﬂicts in the relationship between humans and the land. The changes in the quality of ecosystems in different regions showed signiﬁcant instability.",
    "According to Equations (3) and (4), the center of gravity of ecosystem quality in Henan was calculated. The results show that, from 2010 to 2020, the center of gravity of ecosystem quality in Henan Province was basically stable (Figure 4). From 2010 to 2020, the center of gravity of ecosystem quality of Henan Province was mainly distributed in Xuchang City and continued to move to the northwest of Henan Province. From 2010 to 2015, the center of gravity of ecosystem quality of Henan Province moved 1.16 km to the northwest compared with 2015–2020, and from 2015 to 2020, the center of gravity of ecosystem quality of Henan Province continued to move 1.86 km to the northwest, indicating that the ecosystem quality in the northwest of Henan Province continued to improve, while the ecosystem quality in the southeast of Henan Province decreased slightly. Further analysis of the changes in the ecosystem quality of the seven domains of Henan Province showed that the center of gravity of ecosystem quality in the Taihang Mountain and Hill Area in northern Henan and the Yellow River Plain in central Henan changed the most from 2010 to 2015. The center of gravity of ecosystem quality in the Taihang Mountain and Hill Area moved 6.1 km to the northeast, and the center of gravity of ecosystem quality in the Yellow River Plain moved 11.87 km to the northwest. The center of gravity of ecosystem quality in the other domains changed little from 2010 to 2020, and slowly moved to the northwest. Among the different areas, the Yellow River Plain is the most important population and economic region in Henan Province and is the leading zone of urban development. The center of gravity of ecosystem quality in the Yellow River Plain shifted signiﬁcantly, indicating that, during the period from 2010 to 2015, the improvement in eco-system quality in the northwest of the Yellow River Plain was the most signiﬁcant. In order to further explore the spatial evolution characteristics of ecosystem quality in Henan Province from 2010 to 2020, this study used the global Moran index to analyze the spatial changes in ecosystem quality in Henan Province. The results showed that Moran’s index of ecosystem quality in Henan Province in the periods of 2010–2015 and 2015–2020 was 0.572 and 0.481, respectively, and the Z score was 10.52 and 9.51 (p = 0), indicating that the changes in ecosystem quality in the 123 counties in Henan Province had strong spatial aggregation. Combined with the changes in ecosystem quality in Henan Province from 2010 to 2020, the values of the dependent and independent variables were extracted from county-level administrative units, and the driving factors were quantitatively evaluated according to the different domains to which they belonged. First, we selected the ecosystem quality index EQI as the dependent variable; then, the seven normalized driving factors were used as independent variable factors. The index levels of the driving elements were divided on the basis of the natural breakpoint method of ArcGIS so that the index quantity value was converted into a type value. Finally, the degree of inﬂuence and mode of action of the driving factors on the changes in ecosystem quality in Henan Province were analyzed and evaluated by using the Geo-detectors model. Factor detection was used to detect the impacts of different driving factors on the ecosystem quality of Henan Province. When we used the factor detector to test the sig- niﬁcance of the evaluation index and the ecosystem quality index, the p values were all 0, indicating that the driving factors selected in this study have sufﬁcient explanatory power for ecosystem quality in Henan Province. The research results showed that the ecosystem quality of Henan Province was compre- hensively affected by physical elements, socioeconomic elements, and policy adjustments from 2010 to 2020, and the different driving factors showed regional differences and overall consistency, as shown in Figure 5. In the seven domains of Henan Province, the explanatory power of socioeconomic factors for ecosystem quality was always the greatest, followed by that of physical elements, and the explanatory power of forestry engineering factors regulated by policies was the weakest. According to the analysis of the speciﬁc attributes of the driving factors, among the socioeconomic factors, the effect of GDP per square kilometer on ecosystem quality in Henan Province was slightly stronger than that of population density. Especially in the Taihang Mountain and Hill Area and the Loess Platform Hilly Area in the northern part of Henan Province, the effect of GDP per square kilometer on the regional ecosystem quality was particularly signiﬁcant. Henan Province is located in the plain area of China, and the levels of economic development and population agglomeration are the main factors affecting the quality of the regional ecosystem.",
    "The natural environmental factors included relief amplitude (X1), land-use diversity (X2), temperature (X3), and rainfall (X4). Among these, the effects of relief amplitude and land-use diversity were signiﬁcantly stronger in the mountains, hills, and basins than in the plains. From 2010 to 2020, except for the Yellow River Plain, the effect of terrain relief on the other regions’ ecosystems quality continued to increase, and its effect was the weakest in Nanyang Basin, reﬂecting the complexity of the terrain in Henan Province, which has a certain protective effect for maintaining the relative stability of regional ecosystem quality. The diversity of land use showed obvious regional differences. In the Taihang Mountain Area and the Loess Platform Hilly Area in the north of Henan Province, and the hilly areas in the west and south of Henan Province, its inﬂuence was much stronger than on the Yellow River Plain and the Huai River Plain. In addition, for the plain areas, the impact of land-use diversity on ecosystem quality was second only to the average GDP and population density. This indirectly indicates that during 2010–2020, the urban development of Henan Province strongly disturbed the land cover in the mountains and hilly areas, which showed greater vulnerability to human land-use activities than in the plain areas. Throughout Henan Province, the annual average temperature had a stronger impact on the ecosystem quality than the annual average precipitation, and its inﬂuence increased steadily. From 2010 to 2020, forestry projects had obvious impacts on the Yellow River Plain, the Taihang Mountain and Hill Area, and the Loess Platform Hilly Area, indicating that the forestry engineering in Henan Province played an important role in alleviating the deterioration in ecosystem quality in the north-central parts of Henan Province. At the same time, the inﬂuence of forestry projects on ecosystem quality in the whole province showed a trend of increasing gradually, indicating that the series of ecological protection projects implemented in Henan Province had the weakest impact on improving the regional ecosystem quality but still played a positive role. Interaction detection was used to evaluate whether two factors would enhance the explanatory power of ecosystem quality in Henan Province when they acted together, that is, the intensity of the interactive effect on the ecosystem changes in Henan Province. The relationships between the two factors can be divided into several categories, as shown in Table 4. According to the interactive detection results of the geo-detectors from 2010 to 2020 (only part of the factor interaction results are listed in Table 5), the interactions between the inﬂuencing factors of ecosystem quality in the seven domains of Henan Province were dominated by nonlinear enhancement and two-factor enhancement. The interaction value of each ecological factor was greater than the maximum value of the action of a single factor. The results show that the ecosystem quality in different domains of Henan province was the result of a combination of driving factors. Although the ecosystem quality of the seven domains in Henan Province was affected by multiple factors, including natural environmental factors, socioeconomic factors, and policy adjustments, the interaction between physical elements and economic elements was more prominent, indicating that the two factors could co-enhance the effects on ecosystem quality. From 2010 to 2020, the interaction detection results of all the driving factors in Henan Province were relatively stable. Among the interactions of various factors, the interaction between GDP per square kilometer and other driving factors had the greatest impact on ecosystem quality in Henan Province, and its q values were all greater than 0.5, which was higher than those of the interactions between other factors. In addition, the interactions of the natural environmental factors of land-use diversity and relief amplitude with other factors were also stronger, second only to the interactions of GDP per square kilometer and population density with other factors. In the Taihang Mountain and Hill Area, the Loess Platform Hilly Area, Nanyang Basin, and the Western Henan Mountain and Hill Area, the interaction degree of land-use diversity and other factors ranked third, while in the Yellow River Plain and the Tongbai Mountain and Hill Area, the interaction degree of the relief amplitude and other factors was stronger than that of land-use diversity. Among the seven domains in Henan Province, although the interactions between forestry engineering factors and other factors were the weakest, those in the Loess Platform Hilly Area, Nanyang Basin and the Taihang Mountain and Hill Area in the mountains and the hilly area were signiﬁcantly higher than those in the Yellow River Plain and Huai River Plain, indicating that the forestry policy regulations and other factors could co-enhanced the impact on the ecosystem in the mountainous and hilly areas of Henan Province.",
    "The study explores the impact of physical elements, socio-economic elements and policy adjustments on the ecosystem quality based on remote sensing data and statistical yearbook data. Due to the limited availability of data, there is still a lack of comprehensive consideration for socio-economic factors and land use policies. In future research, the impact of trafﬁc network density, nighttime light data and land use morphological changes on the ecosystem quality will be comprehensively considered. Moreover, most of the current methods for evaluating the evolution of the ecological environment were carried out based on a static perspective or time equal interval research [51]. However, the evolution of the regional ecological environment is a process of continuous and dynamic change, so ecosystem quality indicator and explanatory power of the driving factors will also change greatly over time. The index system of driving factors needs to be continuously improved according to the actual social development situation. In the future, it will be necessary to strengthen the trend analysis of the spatio-temporal evolution of ecosystem quality, which holds practical signiﬁcance for theoretical research into the driving mechanisms of ecosystem quality and the guidance of the optimization of the government’s protective response measures. Identifying the EQI changes and the spatial heterogeneity of driving factors provided scientiﬁc information about key factors for effective management. Therefore, we provide the following suggestions to improve quality of life and to achieve sustainable development in Henan Province: Based on the available multi-source data for 2010, 2015, and 2020, this study used the gravity center analysis method and the geo-detectors model to explore the spatial differences and inﬂuencing mechanisms of Henan’s ecosystem quality. This effectively revealed the mechanism processes of each driving factor affecting the quality of Henan’s ecosystem. Our research provides useful examples for regional sustainable development in China. The speciﬁc research results are as follows: of Henan Province, the inﬂuence of the interaction between forestry engineering and other factors was higher than that in other regions, indicating that the continuous promotion of forestry engineering in Henan Province has produced good results. In the central plains area, because of the large differences in natural conditions, such as the terrain, precipitation, and temperature, compared with those in the mountains and hills, the effects of forestry projects were relatively weak. Author Contributions: Methodology, X.R. and M.Z.; formal analysis, X.R. and J.Q.; data curation, M.Z. and J.W.; supervision: S.L. and J.D. All authors have read and agreed to the published version of the manuscript. Funding: Henan Province Science and Technology Research Key Project, grant number 212102310422; The research was funded by Remote Sensing Survey and Evaluation Project of Ecological Status Changes in Henan Province from 2015 to 2020, grant number 2021410105000293; Distinguished Researcher Program of Henan Academy of Sciences, grant number 220501003. Outstanding young talents training project of Henan Academy of Sciences, grant number 220401007."
]