[
    "As a major agricultural center in China, Henan Province is highly dependent on ground- water resources for its socioeconomic development. However, under the triple pressure of intensive agricultural irrigation, surging industrial water demand, and accelerating urbanization, the sustainable use of groundwater resources has become a key issue for regional development. This paper utilizes GRACE satellite data and the Global Land Data Assimilation System (GLDAS) assimilation model from 2003 to 2023 to invert alterations in terrestrial water storage (TWS) and groundwater storage (GWS) in Henan Province. We examine the factors influencing these changes and compare the spherical harmonic coeffi- cient (SH) data with Mascon data, integrating precipitation and soil moisture data. Using the GRACE Mascon data as a reference, GWS in Henan Province exhibited a stable trend from January 2003 to October 2010, with a rate of −0.060 cm/month. From October 2010 to June 2020, GWS demonstrated a declining trend, with a rate of −0.121 cm/month. Con- versely, from June 2020 to December 2023, GWS revealed a significant upward trend, with a rate of 0.255 cm/month. The TWS and GWS of the inverse performances of the Centre for Space Research (CSR) SH data and the CRS Mascon data exhibited a similar trend, albeit with differing values. Additionally, the precipitation data, soil moisture, and GLDAS data demonstrated significant seasonal variations, with a lag of approximately two months between changes in precipitation and GWS. Declining GWS could be related to climatic and anthropogenic factors. The changes in groundwater in Henan Province studied in this paper can provide a reference for the sustainable utilization of groundwater resources in the region. Citation: Xu, H.; Liu, D. Study on Groundwater Storage Changes in Henan Province Based on GRACE and GLDAS. Sustainability 2025, 17, 6316. https://doi.org/10.3390/su17146316 Copyright: © 2025 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https://creativecommons.org/ licenses/by/4.0/). Water is a valuable resource in modern societies, both for economic development and crop cultivation. In the current context of water scarcity, how to monitor water resources has become a top priority. TWS as an important water resource includes soil moisture content, snow water equivalent, canopy water, and groundwater, etc., and it plays a vital role in the hydrological cycle [1]. GWS as an important component of freshwater resources is necessary for economic development, crop cultivation, and daily life. The lack of protection of groundwater resources in the past has led to the over-exploitation of groundwater in many areas. Over-exploitation of groundwater resources can lead to the depletion of water resources, which can have significant impacts on ecosystems, the economy, food, health, and social development [2]. In light of the above, the observation of groundwater changes is an important aspect of ensuring the rational use of water storage, normal economic development, and food security. This requires reliable methods for monitoring the changes in TWS and GWS [3]. Conventional groundwater monitoring techniques, on the other hand, are labor-intensive, rely on data collected from ground observation stations, and have limitations when it comes to geographical distribution and temporal coverage, for example, when groundwater observation wells are not evenly distributed [4]. Because of this, it is challenging to reliably predict how GWS will evolve across expansive regions [5]. Therefore, in recent years, scholars in various countries have searched for methods to efficiently monitor changes in GWS by using new technologies, such as gravity satellites and hydrological modeling. Launched in 2002, the GRACE twin satellites measure the Earth’s mass redistribution through high-precision gravitational field monitoring. Gravitational variations—driven by global hydrology, ice sheet dynamics, and oceanic mass fluxes—reveal key processes governing water cycle evolution, glacier retreat, and ocean mass distribution. Operating with 200 km separation, the satellites continuously track inter-satellite distance fluctua- tions via microwave ranging. Surface mass changes induce gravitational anomalies that proportionally alter satellite separation distances. Distance changes are analyzed to obtain anomalies in the Earth’s gravitational field, thus inverting changes in the Earth’s water storage [6]. GRACE data can be used to analyze changes in TWS, monitor water resources in droughts and floods, calculate the melting of ice caps, and project the rate of sea level rise, among other things. GRACE data are mainly provided in the form of traditional SH and Mascon data [7]. The SH data requires the replacement of low-order terms, the removal of noise and strip errors, ice rebound correction, leakage error correction, etc., while the CSR Mascon data do not require complex processing.",
    "Many researchers have analyzed changes in TWS in different watersheds and regions. Examples include the changes in TWS in the Lancang-Mekong River Basin in 2003 to 2016 [8], the changes in TWS in the Yellow River Basin in 2003 to 2015 [9], the changes in TWS in 2002 to 2017 based on GRACE data [3], changes in TWS in the Indian Peninsula, TWS in the Ethiopian region during 2003 to 2011 [10], TWS in the Lake Baikal region during 2003 to 2020 [11], and the Himalayan River Basin during 2003 to 2014 [12]. The GLDAS is a collaborative data assimilation framework created by the National Aeronautics and Space Administration (NASA) and the Goddard Space Flight Center (GSFC), delivering high-resolution global land hydrological data through the integration of satellite observations, ground-based monitoring data, and modeling techniques. GLDAS provides reliable terrestrial data for climatology, hydrological forecasts, and water resources management [13]. The GLDAS assimilation model provides global, high-resolution data on soil moisture content, snow water equivalent, canopy water, etc., which can provide complementary information for the analysis of changes in GWS. With the widespread use of GLDAS, researchers discovered that GWS changes can be estimated by combining GRACE-derived TWS data with the GLDAS model. This approach has led to numerous studies on regional groundwater variations. Changes in GWS are obtained by combining the changes in TWS extracted from GRACE’s Mascon data with the changes in surface water storage from GLDAS data, e.g., Western Cape, South Africa [14], Saskatchewan River Basin [15], Poland [16], southern Poland to the Swedish Arctic [17], Gangetic-Brahmaputra Basin, India [18], Afghanistan region [19], Ordos Basin [20], Tarim River Basin [4], and Songnen Plain [21]. Some other scholars have combined the GRACE SH data to extract the TWS changes with the surface water storage changes from the GLDAS data to obtain the corresponding GWS changes, e.g., the Arabian Peninsula [22], the Shanxi-Gansu-Ningxia region [23], and the North China Plain [24]. The majority of scholars selected either single data or Mascon data to address GWS changes using associated hydrological models, while limited research has utilized a combination of SH data and Mascon data alongside GLDAS data to investigate GWS changes and examine the similarities and differences between the two approaches. This paper addresses the need for research on alterations in TWS and GWS in Henan Province by employing CSR SH data, CSR Mascon data, GLDAS assimilation system data, and precipitation data. The study quantitatively assesses correlations between GWS changes and these datasets, thereby facilitating the management of groundwater over- exploitation, promoting its judicious utilization, and supporting high-quality development in Henan Province. Henan Province is bordered by Shandong to the east, Shaanxi to the west, Hubei to the south, and Hebei to the north, with a total area of about 167,000 km2, spanning 31◦23′ to 36◦22′ N and 110◦21′ to 116◦39′ E (Figure 1). Henan Province lies in a transitional climatic zone, bridging the warm temperate and subtropical regions, with an average annual precipitation of about 400 to 1300 mm [25]. The province’s multi-year average total water resources are 40.35 billion cubic meters, ranking 19th in China, with a per capita water resource of 381 cubic meters and an average water resource of 340 cubic meters per mu of arable land, accounting for about 1/5 and 1/4 of China’s per capita and per mu water resources, respectively [26]. The CSR SH data and CSR Mascon data released by the Center for Space Research of the University of Texas were used in this research. We selected the CSR Mascon data to verify the reliability of the CSR SH data. The CSR SH data has a spatial resolution of 1◦ × 1◦ and a temporal resolution of 1 month, and the CSR Mascon data has a spatial resolution of 0.25◦ × 0.25◦ and a temporal resolution of 1 month (Table 1). Singular Spectrum Analysis (SSA) bridged observational gaps between GRACE and GRACE-FO missions. The study period covered January 2003 to December 2023 (252 months), with 32 months of missing data, representing 12.7% of the total period. GLDAS integrates four land surface models: Mosaic, Noah, CLM, and VIC. This framework enables long-term soil moisture trend analysis, hydrological extreme monitoring (droughts/floods), watershed-scale water resource assessments, and the detection of GWS anomalies when combined with GRACE observations. In this study, four layers of soil moisture, snow water equivalent, and canopy water data with a spatial resolution of 1◦ × 1◦ were used, in contrast to the 0.25◦ × 0.25◦ resolution offered by the Noah version of GLDAS [27]. The selected parameters in the GLDAS Noah model at each resolution are provided in Table 2.",
    "The Global Precipitation Climate Center (GPCC), as an international institution sup- ported by the World Meteorological Organization (WMO), aims to collect, integrate, and disseminate global precipitation data from ground-based observations, satellite inversions, and the reanalysis of the data. Ground-based observations are primarily obtained from meteorological stations worldwide. Precipitation is also estimated using satellite data from missions such as TRMM and GPM and is further refined through reanalysis datasets from sources such as the Global Land Evaporation Dataset and the Global Terrestrial Evapotran- spiration Dataset. The GPCC dataset comes in multiple resolutions (1◦ × 1◦ vs. 0.5◦ × 0.5◦) and multiple time scales (annual, seasonal, and monthly) [13]. The data has a large time span from 1901 to the present, which is suitable for long-term climate analysis. GPCC data provides appropriate climate reference data for extreme weather analysis, climate model validation, and national and even global climate issues. GPCC data can be used to analyze long-term changes in precipitation, monitor climate extremes, help decision- makers optimize water allocation in agriculture, and monitor flood and landslide risk assessments. Through the fusion of diverse data sources and meticulous cross-validation, GPCC has emerged as a standard for global precipitation data, trusted by researchers and institutions worldwide. It plays an important role in monitoring weather extremes, disaster preparedness, research on global water resources, and sustainable development. GPCC Landsurface Monitoring Monthly Product 1◦ data from GPCC was selected for this study. When TWS changes, it causes variations in the Earth’s gravitational field. TWS anomalies can be obtained by converting changes in the Earth’s gravity into equivalent water height variations [28]. Equivalent water height is the change in vertical thickness (∆h) of a homogeneous layer of liquid water corresponding to the change in water storage (mass change) per unit area of surface in a given region. The formula for the inversion of TWS anomaly is as follows: where Ah is the equivalent water height (EWH), Aq is the change in surface density, pw is the density of water (taken as 1000 kg/ m’), a is the Earth’s radius, Pave is the Earth’s average density (taken as 5517 kg/ m’), k; represents the load Love number of the /-th degree, Pin (cos 6) denotes the normalized associated Legendre functions, and AC;,, and AS}, are the disturbing potential coefficients, while 6 and ¢ represent the colatitude and ongitude, respectively. The GRACE gravity field model contains noise, banding errors, and other artifacts. In this paper, we reduced the noise and banding errors by utilizing a combination of filtering methods, i.e., Swenson decorrelation filtering and Gaussian filtering at 300 km. Gaussian filtering mitigates noise-induced inaccuracies in GRACE data by differentially weighting various orders of spherical harmonic coefficients, achieved by directly diminishing the weights of higher-order components for effective denoising [28]. The expression of Gaussian filtering is as follows: The decorrelation filter, proposed by Swenson [29], employs sliding window polyno- mials to remove correlations between spherical harmonic coefficients. For a given spherical harmonic coefficient, sliding window polynomial fitting is applied separately to the odd- degree and even-degree sequences of AC), and AS},,. The fitted values AC}, and AS}, are treated as correlated errors. By subtracting these correlated errors from the original sequences, the decorrelated spherical harmonic coefficients ACI and AS; Im are obtained. The expression for the decorrelation filter is as follows: The impact of applying different filtering methods to the CSR SH data is examined, including a combined Gaussian and Swenson filter with a 300 km radius (Figure 2a), no filtering (Figure 2b), a single Gaussian filter with a 300 km radius (Figure 2c), and a single Swenson filter (Figure 2d). Comparison reveals that combined filtering is more successful; thus, further tests employ the integration of Gaussian filtering with a radius of 300 km and Swenson filtering to analyze the CSR SH data. The GRACE satellite data can be inverted to obtain the changes in TWS, including surface water and GWS. Surface water data were obtained from the GLDAS assimila- tion model, which encompasses soil moisture, canopy water, and snow water equivalent data [30]. Changes in GWS were also obtained through the water balance equation, which is as follows: where SWE is the snow water equivalent, SMS is the soil moisture storage, and CWS is the canopy water storage. These three data can be extracted from the GLDAS model in the form of EWH representing the changes in GWS. All measurements are in centimeters (cm); time resolutions are monthly [20].",
    "To bridge the gaps caused by missing data in GRACE and GRACE-FO satellite obser- vations, this study applies SSA, offering a robust interpolation method that preserves the underlying trends and seasonal signals [31]. At its core, it maps the original signal onto a high-dimensional space through the singular value decomposition of the trajectory matrix and then extracts meaningful information through reconstruction. CSR Mascon data using SSA with a window length of 24 and using the first 6 components to reconstruct the signal has a root mean square error (RMSE) of 5.41 cm for the period of July 2017 to May 2018 and an RMSE of 2.29 cm for the rest of the missing months. CSR SH using SSA with a window length of 84 and using the first 4 components to reconstruct the signal has an RMSE of 5.41 cm for the period of July 2017 to May 2018 and an RMSE of 2.29 cm for the rest of the missing months. RMSE for the period of July to May 2018 was 1.90 cm, and the RMSE for the remaining missing months was 0.79 cm. The core steps are as follows: where Xi = λiUiVT i , λi represents the singular spectrum of the sequence X, with the largest singular value corresponding to the eigenvector that captures the dominant trend in the signal. V is a K × K column orthogonal matrix. where ω = L, L < k ≤ K N − k + 1,K < k ≤ N , and Xr ij denotes the element in the i-th row and Linear regression using least squares is a mathematical optimization technique used to find the best-fitting straight line for a set of data points by minimizing the sum of squares of the residuals between the fitted and observed values. To fit a trend line for water storage changes, linear least squares is employed, defined as f(x) = β0 + β1x. Where β0 is the intercept, and β1 is the slope. To minimize S, partial derivatives of S with respect to β0 and β1 are taken and set to zero. Solving the resulting equations yields the linear least squares formulas for β0 and β1: In order to study the changes in GWS in Henan Province, this study firstly investigates the changes in TWS using CSR SH data and CSR Mascon data and analyzes the trend with the least-squares method. During 2003 to 2023, TWS changes in Henan Province showed an overall stable trend, followed by decreasing and then increasing trends. In order to disperse the impacts of multiple drought events on a certain time period, this study partitions the 2003 to 2023 period based on the 2009 to 2010 drought event [35] and the 2019 drought event [36]. This led to the periods January 2003 to October 2010, October 2010 to June 2020, and June 2020 to December 2023. We then analyzed the changes in TWS and GWS in Henan Province via the least-squares method. From January 2003 to October 2010, the CSR SH data indicate a relatively stable trend in TWS changes, with a slight increase at a rate of −0.008 cm/month. Between October 2010 and June 2020, the trend shifts to a decline, with a rate of −0.037 cm/month. This is followed by an increasing trend from June 2020 to December 2023, with a rate of 0.082 cm/month (Figure 4). Similarly, the CSR Mascon data show a stable TWS trend from January 2003 to October 2010, with a rate of −0.047 cm/month. A more pronounced decreasing trend is observed from October 2010 to June 2020, at −0.125 cm/month. From June 2020 to December 2023, the TWS trend reverses, showing an increase at a rate of 0.216 cm/month (Figure 5). GWS was calculated using the water balance Equation (7), and the CSR SH data were compared to the changes in TWS, changes in GWS, and GLDAS data derived from the CSR Mascon data. In most cases, TWS and GWS exhibited analogous trends, as the GLDAS data is limited and generally aligns with TWS. Consequently, the trends of GWS and TWS are typically congruent. However, during certain extreme periods, the GLDAS data may experience significant fluctuations, resulting in discrepancies between GWS and TWS (Figures 6 and 7).",
    "Figure 6. Comparison of CSR spherical harmonic coefficient data inversion for TWS (TWS SH), GLDAS data, GWS data (GWS SH), and precipitation. Soil moisture data from each layer in the GLDAS dataset were extracted and ana- lyzed, revealing that soil moisture content varied across the different layers. SMS1 is the soil moisture data at 0–10 cm, SMS2 at 10–40 cm, SMS3 at 40–100 cm, and SMS4 at 100–200 cm (Table 2). The soil moisture content in GLDAS exhibited seasonal variations, with a significant decline observed during the summer months. A Y-axis offset was made to facilitate the observation of soil moisture changes in each layer. The soil moisture data exhibited a consistent trend across various spatial resolutions while the values varied (Figures 8 and 9). The water balance Equation (7) is applied to estimate changes in GWS in Henan Province from 2003 to 2023, and the trend is analyzed using the least-squares method. From 2003 to 2023, GWS changes in Henan Province closely mirror those of TWS, show- ing an overall pattern of stability, followed by decline, and then recovery. According to CSR SH data, GWS remained stable from January 2003 to October 2010, with a slight decline rate of −0.013 cm/month. From October 2010 to June 2020, it decreased at a rate of −0.038 cm/month, then increased from June 2020 to December 2023 at 0.119 cm/month (Figure 10). Similarly, CSR Mascon data show a stable trend from January 2003 to October 2010 at −0.060 cm/month, a sharper decline between October 2010 and June 2020 at −0.121 cm/month, and an increase from June 2020 to December 2023 at 0.255 cm/month (Figure 11). Based on the time series data generated from the CSR SH data and CSR Mascon data described above, the rates of change in TWS and GWS were calculated for the three periods, which represented an indicator of how quickly water storage is increasing or decreasing over the time period. As the data are subject to seasonal fluctuations, the values vary widely, resulting in larger confidence intervals. The TWS and GWS values for the CSR SH data are similar across the three periods, as are those for the CSR Mascon data, with both datasets exhibiting consistent trends of an increase or decrease. However, the values of TWS and GWS for the CSR SH data were different from those of TWS and GWS for the CSR Mascon data. The rates and confidence intervals of change for specific TWS and GWS are shown in Table 3. The comparison of GLADS with its associated SMS data and precipitation reveals substantial seasonal variations in both GLDAS and SMS data. Notably, there is a marked decline in GLDAS and SMS data during the summer months despite the prevalence of rainfall during this period. Drought conditions are more evident, and the reduction in GLDAS and SMS data is particularly pronounced, especially in years when precipitation levels were not as elevated as in 2006, 2015, and 2019. In cases of sufficient rainfall, the reduction in GLDAS with SMS appeared to be significantly moderated, such as 2007, 2017, 2021, etc. The values of GLDAS data at different spatial resolutions varied, with GLDAS data at 0.25◦ spatial resolution having a minimum of greater than −100 mm and GLDAS soil moisture data having a minimum of greater than −50 mm (Figure 12), while GLDAS data at 1◦ spatial resolution had a minimum of lower than −30 mm and GLDAS soil moisture data had a minimum of greater than −10 mm (Figure 13). Although the overall trends are consistent, both the GLDAS and soil moisture data exhibit seasonal fluctuations, with most of the values in the GLDAS data contributed by the four soil moisture layers. Soil moisture peaks do not occur at the same time as rainfall peaks. Instead, the increase, and even the peak, in soil moisture usually lags behind the increase in rainfall and its peak by about two months. This is a result of the lag between soil moisture and rainfall. After rainfall reaches the surface, it takes some time to infiltrate into the soil and eventually recharge the GWS. Upon comparing the CSR SH data with the GWS data derived from the CSR Mascon data, discrepancies are evident; however, the trends align (Figure 14). Furthermore, when integrated with precipitation data, it is observed that GWS exhibits seasonal variations, with a lag of approximately two months in the alterations of precipitation and GWS.",
    "In Henan Province, the TWS in the period January 2003 to October 2010 showed a stable trend in general. Spatially, the deficit was the most severe in the north, while the south exhibited a stable trend. The annual rate of change in the northern region was the lowest, exhibiting a progressively diminishing distribution from southeast to northwest, with the northwest identified as the primary area of loss. The most severe loss is approximately −3 cm/year, and the region of TWS reduction constitutes half of the province’s total area (Figure 15a). The northern region had the most serious loss from October 2010 to June 2020, with values exceeding −5 cm/year. The central area exhibited a deficit of around −2 cm/year, whereas the southern region seemed to be stabilizing. The rate of change exhibited a stepwise distribution that diminished from south to north, with the northern region identified as the primary deficit area, and the region of TWS reduction comprising three-quarters of the province’s total area (Figure 15b). From June 2020 to December 2023, a general upward trend was evident, with the northern region exhibiting a significant increase, potentially exceeding 5 cm per year. The central region demonstrated a modest increase, while the southern region remained relatively steady. The northern region was the primary area of increase, with the annual rate of change in TWS exhibiting a declining distribution from the northern to the middle and southern regions. The TWS over the entire province had a generally growing tendency (Figure 15c). In terms of spatial distribution, the changes in GWS and TWS are consistent. The overall trend of GWS change in Henan Province during January 2003 to October 2010 showed a stable trend. In terms of spatial distribution, the northwestern region showed a decreasing trend, while the southeastern region remained stable. The annual rate of change showed a gradually decreasing distribution from southeast to northwest. The northwestern region was the primary area of loss, with the most severe decline reaching approximately −3 cm/year. GWS reduction affected about one-third of the province’s area (Figure 16a). During October 2010 to June 2020, the overall groundwater condition was in a deficit state, and the rate of change showed a stepwise distribution with a gradual decrease from the south to the north. The northern region exhibited the most severe deficit trend, exceeding −5 cm/year, whereas the middle region experienced a minimal decline of approximately −1 cm/year, and the southern region maintained stability (Figure 16b). During June 2020 to December 2023, the GWS showed a generally significant increasing trend. The annual rate of change displayed a gradient from north to south: the northern region experienced increases exceeding 5 cm/year, while the central region also showed a rising trend, with the southern region exhibiting a decreasing pattern. The southern region showed a stable trend (Figure 16c). TWS and GWS are indicators of freshwater availability, which plays a crucial role in quantifying water resources. The time series plot of TWS and GWS indicates that from 2003 to 2023 the TWS in Henan Province exhibits a general trend of stabilization, followed by a reduction, and subsequently an increase. The water resources of Henan Province suffered from a major drought event in the North China Plain region during 2009 and 2019. To isolate the effects of multiple drought events over time, and by performing an STL trend analysis of the results of the data, this study segments the 2003–2023 period based on the major droughts of 2009–2010 and 2019. The resulting time intervals—January 2003 to October 2010, October 2010 to June 2020, and June 2020 to December 2023—are then used to analyze TWS and GWS changes in Henan Province. The observed patterns are closely linked to climatic conditions, environmental factors, and human activities. From January 2003 to October 2010, the TWS and GWS of Henan Province exhibited a generally stable trend. The subsequent rapid decline from October 2010 to June 2020 can be attributed to Henan’s accelerated economic development, which necessitated the establishment of numerous factories, intensified agricultural practices, and elevated living standards. This growth was compounded by a lack of environmental awareness, climatic changes, and recurrent droughts, leading to the over-exploitation of groundwater resources [9]. Between June 2020 and December 2023, legislation to curb groundwater over-extraction (for example: Henan Province Groundwater Management Mea- sures (2022) and Regulations on the Protection of Drinking Water Sources for South-to-North Water Diversion in Henan Province (2022)), coupled with steady economic growth, effec- tively reduced water demand. Improved climatic conditions and the South-to-North Water Diversion initiative then further accelerated groundwater recharge. The South-to-North Water Diversion Project passes through Henan Province, playing a vital role in replenishing the region’s groundwater resources [24]. In particular, the “7.20” rainstorm event in 2021 caused a significant increase in rainfall, which greatly supplemented the TWS and GWS in Henan Province [37]. Henan Province faces the challenge of balancing economic growth with agricultural demands, especially in rapidly developing areas like Zhengzhou. With its large population and location on the plains, the city relies heavily on crop cultivation.",
    "are numerical differences between the two (Figures 4 and 5). It is mainly because of the differences in the resolution of the two datasets, where CSR SH data is generated with a spatial resolution of 1◦, while the CSR Mascon data has a spatial resolution of 0.25◦. The same reasoning applies to the different spatial resolutions of GLDAS, namely the 1◦ and 0.25◦ datasets. The decrease in soil moisture is accompanied by an increase in GWS due to moisture infiltration, which is part of the hydrological cycle. However, declining soil moisture and rainfall have led to an increased reliance on GWS extraction for irrigation. This extraction can itself contribute to a decline in GWS. Henan Province, being a major agricultural region, utilizes GWS extraction extensively for farmland irrigation. Consequently, despite decreasing rainfall and GWS, irrigation can lead to an increase in soil moisture. Furthermore, as rainfall increases, soil moisture does not respond immediately; a lag exists between the two phenomena. In 2010, the soil water was saturated probably due to the fact that the area was in a prolonged period of drought and the soil was in an extremely dry state prior to the rains, which resulted in most of the water being adsorbed by the soil after the rains, resulting in saturated soil water. In 2022, the soil was close to being saturated due to the rainfall event of 2021, resulting in the soil water remaining in a positive state throughout the year 2022 (Figures 6 and 7). Additionally, the processing methods for CSR SH data and CSR Mascon data vary. While both datasets display similar trends, noticeable differences exist in their respective values (Figures 4 and 5). The processing of CSR Mascon data differs significantly from that of the SH data. The latter undergoes selective Gaussian filtering, decorrelation filtering, and leakage error correction, whereas processing methods contributes to the numerical discrepancies observed between the two datasets [27]. Subsequently, the numerical difference between the SH data and the Mascon data can be reduced by examining the methods to mitigate the scalability issue of the CSR SH data. This leads to a discrepancy in the calculated rate of change between the CSR SH data and the CSR Mascon data, although the overall trend remains consistent. The results of our current study do not distinguish between the CSR SH and CSR Mascon data due to the lack of support from actual well data. We will continue to explore this issue by employing relevant techniques in subsequent studies. In the future, we will verify the advantages and disadvantages of the two based on the measured data and verify the reasonableness of the groundwater change scenarios in conjunction with more relevant economic, policy, and demographic activities. The climate of Henan Province is characterized by warm and rainy summers and cold and dry winters, which is typical of temperate monsoon climates. The comparative analysis of GWS and rainfall data shows that although rainfall peaks during the summer, GWS typically reaches its lowest point at the same time. This decline aligns with the peak agricultural water demand for crop growth. During droughts, when rainfall is scarce, increased groundwater extraction helps mitigate drought impacts. Conversely, GWS tends to recover following periods of increased precipitation. An increase in precipitation typically leads to a rise in GWS; however, this response is delayed by approximately 1 to 2 months due to the time required for water to infiltrate and recharge aquifers [8], which is correlated with the soil infiltration rate (Figure 14). The variation in soil moisture inversely correlates with precipitation; soil moisture is plentiful in winter and significantly deficient in summer, whereas precipitation is scarce and less frequent in winter and copious in summer. Nevertheless, during periods of substantial precipitation, the soil moisture deficit is significantly mitigated, as evidenced by the precipitation levels in July 2021, which were the highest in over two decades (Figures 12 and 13). Conversely, during the summer months when precipitation is limited, a severe soil moisture deficit emerges, adversely impacting groundwater levels and resulting in a persistent decline in GWS during that timeframe. TWS, GWS, and soil moisture content showed seasonal fluctuations. Since GLDAS values were lower than those of GRACE, the seasonal fluctuations in TWS, GWS, and soil moisture led to a reduced difference between TWS and GWS, resulting in similar Due to the lack of relevant measured well data and topographic data of the area, this study is unable to accurately determine the GWS value of the area and can only analyze the variation in the GWS. Based on this, we need relevant actual well data and related content and to analyze the GWS value with topographic data. The above data will be used to find a simple and accurate hydrological model to determine the GWS value in future studies.",
    "Compared to previous studies that rely solely on either Mascon data or SH data to an- alyze GWS, this study integrates both datasets to examine their similarities and differences, thereby enhancing the completeness and reliability of the analysis. By identifying common patterns between the two, the study strengthens the credibility of the results, while also investigating the underlying causes of any discrepancies. Furthermore, GRACE data are combined with precipitation records and GLDAS outputs to explore the characteristics of GWS changes. These changes are then linked to climate, soil conditions, and other environmental factors to provide a comprehensive understanding of their driving forces. This integrated analysis will enhance the predictive capabilities for GWS dynamics in Henan Province, enabling optimized water resource allocation and evidence-based plan- ning for agricultural and economic development. Furthermore, the spatial classification of groundwater distribution equips policymakers with actionable insights to design region- specific management strategies. Ultimately, these advances promote sustainable water In this study, GRACE data, GLDAS data, and precipitation data were used to investi- gate the TWS and GWS of Henan Province from 2003 to 2023. (1) The CSR SH data and CSR Mascon data have differing values owing to variations in resolution and processing techniques; nonetheless, the pattern of change remains consistent in both datasets. (2) In terms of the overall time series of Henan Province, the GWS shows stable, decreasing, and then increasing changes. (3) Next, in terms of the spatial distribution of GWS in Henan Province, the northern part of the province shows changes from decreasing to increasing, while the southern part of the province shows a more stable situation. (4) Finally, the soil moisture and GLDAS data showed obvious seasonal fluctuations. In Henan Province, GWS significantly decreases during summer, but excessive rainfall can moderate or even increase soil moisture levels, potentially leading to regional flooding. Author Contributions: Conceptualization, H.X. and D.L.; Methodology, H.X. and D.L.; Software, H.X. and D.L.; Validation, H.X. and D.L.; Formal Analysis, H.X.; Investigation, D.L.; Resources, H.X.; Data Curation, H.X.; Writing—Original Draft Preparation, D.L.; Writing—Review and Editing, H.X.; Visualization, D.L.; Supervision, H.X.; Project Administration, H.X. All authors have read and agreed to the published version of the manuscript."
]