[
    "School of Geoscience and Technology, Zhengzhou University, Zhengzhou 450001, China; wangyalin@gs.zzu.edu.cn (Y.W.); liujianzhong@zzu.edu.cn (J.L.); zhangyinbao@zzu.edu.cn (Y.Z.); wangyb1108@gs.zzu.edu.cn (Y.W.); edmundzhou@gs.zzu.edu.cn (S.Z.); zjw111@gs.zzu.edu.cn (J.Z.) Abstract: Foreign trade is an important part of the national economy. Promoting the development of foreign trade can regulate the optimal allocation of resources, raise the level of domestic productivity, and accelerate economic development. As a traditional inland agricultural province, Henan Province has inherent disadvantages in developing foreign trade due to its geographical location. However, it has characteristic advantages in terms of population and transportation, so it is necessary to study the pattern of foreign trade and the factors affecting it in this region. In this research study, statistical data were assessed with methods such as the foreign trade dependence, geographical detector, and gravity models to analyze the trade scale, pattern, spatio-temporal variation characteristics, and foreign trade mechanisms in Henan Province. The results show that the trade pattern of Henan Province from 2002 to 2021 has evident spatial and temporal heterogeneity, with a relatively homogeneous overall commodity structure, weak competitive advantages, and a high degree of dependence on US trade. Innovation and transportation are essential internal factors, while the external factors are positively affected by the GDP of both Henan Province and the trading countries, FTAs, trade openness, and the population in the long run and are negatively impacted by distance. This study provides suggestions and decision support for formulating foreign trade policies for Henan Province. It also provides a research basis for related corresponding studies of other regions with similar characteristics. Citation: Wang, Y.; Liu, J.; Zhang, Y.; Wang, Y.; Zhou, S.; Zhang, J.; Zhang, X. Analysis of the Evolution of Foreign Trade Patterns and Inﬂuencing Factors in Henan Province from 2002 to 2021. Sustainability 2023, 15, 15341. https://doi.org/10.3390/ su152115341 Copyright: © 2023 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). Foreign trade is an indispensable and essential part of the national economy, which can not only directly promote economic growth but also indirectly impact the economy through consumption, government expenditure, investment, and other ways [1]. To address the regional foreign trade problem, much work has already been conducted by scholars around the world, including in France [2], Brazil [3], the Czech Republic [4], and other regions [5–7]. Foreign trade is also a vital driving force for China’s economic development [8], espe- cially the Belt and Road policy, which promotes China’s economic growth, promotes the economic development of the countries along the route [9], and contributes to the sustain- able development of the local economy [10,11]. China formally acceded to the WTO on 11 December 2001, and has gradually formed a pattern of opening up to the outside world: “special economic zones-open coastal cities-open coastal economic regions-the mainland.” Within in-depth studies of China’s foreign trade issues, more and more scholars have begun to pay attention to regional (provincial administrative regions) foreign trade issues. Explor- ing regional (provincial administrative regions) foreign trade issues is not only related to an increase in the scale and level of regional import and export trade but will also profoundly affect the transformation and upgrading of local development. Improving the international influence of regions and increasing their opportunities for opening up and cooperation can promote the sustainable development of regional economies [12–15]. Existing studies have mainly focused on coastal areas [16–23] and border provinces [24–29], with less attention paid to central inland areas [30–32]. For example, Song et al. used the RCA index, inter- regional input–output model, and other methods to analyze the evolution of Hainan’s foreign trade pattern and its economic linkages with domestic provinces, autonomous regions, and municipalities [17]; Liu et al. used the concentration index, positional change index, and HM index to analyze changes in the trade pattern and characteristics of the three northeastern provinces in relation to countries along the “Belt and Road” route [27]; Gao et al. used the comprehensive trade share index and HM index to analyze the de- gree and symmetry of trade dependence between Jiangxi and countries along the “Belt and Road” [30]. Henan Province, a representative of the central region, has long needed to catch up with foreign trade. In 2021, the import and export volume of Guangdong Province, China, amounted to USD 1298 billion, while that of Henan Province only amounted to USD 127 billion, signiﬁcantly lagging behind in the degree of opening up to the outside world. Henan ranks 10th in the country regarding import and export trade (Table 1), with the vast majority of the top nine being coastal provinces such as Guangdong, Jiangsu, and Zhejiang. An important factor contributing to this situation is that Henan (Figure 1), a traditional inland agricultural province, has an inherent disadvantage in foreign trade development due to its geographical location. However, as the third largest province in China in terms of population, an essential national comprehensive transportation hub, and a critical grain conversion and processing province, Henan’s economy and foreign trade have been developing continuously for a long time. Therefore, it is necessary to study the pattern of foreign trade and the factors inﬂuencing it in this region, which lacks the basic conditions for foreign trade but has characteristic advantages.",
    "Most studies on foreign trade in Henan Province are qualitative [33–37], with fewer quantitative analysis studies [38–41]. For example, Ren et al. qualitatively proposed to deal with the challenges brought by the “Belt and Road” to Henan Province in terms of transportation, logistics, and cross-border trade [33]; Yi found that the problems faced by the high-quality development of Henan’s foreign trade in terms of sustainability are mainly the lack of structural efﬁciency and foreign trade professionals [36]; Feng et al. utilized trade integration, competition, and complementarity of foreign trade in Henan Province to study the development of Henan’s foreign trade [40]; Cui et al. used principal component analysis to analyze a constructed index system for the evaluation of open-door competitiveness [41]. Therefore, adopting a suitable and reliable methodology for this study is essential. The geographical detector model is a powerful tool for driver and factor analysis [42–47], and trade gravity models are mainly used to analyze speciﬁc commodities’ evolution and inﬂuencing factors [48–51]. Therefore, this study analyzes the trade scale, pattern, and characteristics of spatial and temporal changes in Henan Province by using various statistical data and combining foreign trade dependence, RCA (revealed comparative advantage index), HM (hubness measurement index), and TII (trade intensity index). Subsequently, the geographical detector and gravity models are used to conduct a more in-depth study of the factors and mechanisms inﬂuencing the trade pattern of Henan Province from both internal and external perspectives. This study will provide decision support for further opening up and optimizing trade relations in Henan Province, as well as providing a research basis for other corresponding regions with similar characteristics. The geographical detector model is used to explore the internal factors affecting the foreign trade pattern of each city in Henan Province in terms of economics, industrial structure, innovation ability, and transportation conditions. The trade gravity model is used to analyze the external factors affecting foreign trade in Henan Province in terms of distance, economics, openness, population, and export structure. Foreign trade dependence is an indicator of the degree of dependence of a country or region on foreign markets [52]. The greater the degree of foreign trade dependence, the closer the region’s economic development is to the international market. The formula for calculating foreign trade dependence is: where F represents Henan’s foreign trade dependence; Ii represents Henan’s total import trade; Ei represents Henan’s total export trade; G represents Henan’s GDP. The RCA index indirectly reﬂects the trade structure of a region by calculating the export of goods, which can reﬂect the main advantages of the region’s goods to a greater extent [53]. It is used in the study to calculate the outstanding products of Henan’s exports. The formula for the RCA index is: where Xij denotes the export value of product j from Henan Province; Xi means the total export value of all commodities from Henan; Xj is the Chinese export value of product j; and X is the total export value of all commodities in China. RCAij > 1, indicating that the export of j products in Henan is relatively concentrated and has a strong comparative advantage in the domestic market. HM is an important indicator used to measure the degree of trade interdependence and to analyze the degree of market dependence of a region’s exports on its trading partners [54]. where Eij denotes the export amount from Henan province to country j; Ei denotes the total export amount of Henan province; Iij denotes the import amount of Henan province from country j; Ij denotes the total imports of country j. HM means the degree of dependence of Henan province’s goods exports on the trade market of country j. The value of HM lies in the interval (0, 1). The closer the value of HM is to 1, the more dependent Henan province’s exports are on the trade market of country j [55]. The trade intensity index is used to measure the closeness of trade linkages between countries or regions and was proposed by the economist Brown [56]. where TII denotes the trade intensity index of Henan Province to country j; Eij denotes exports from Henan Province to country j; Ei denotes the total exports of Henan Province; Ij denotes the total imports of all goods in country j; Iw denotes the total imports of all goods in the world. The larger the trade intensity index between two regions, the more closely they trade with each other.",
    "The geographical detector method is used to analyze the spatial divergence patterns of geographic phenomena and detect their inﬂuencing factors [57]. In the geographical detector method, factor detection can express the extent to which factor X explains the spatial heterogeneity of attribute Y. In the given equation, k = 1, ..., M represents the classiﬁcation of variable Y or factor X; Nh and N represent the number of cells in layer k and in the entire area, respectively; σ2 σ2 denote the variances of Y values in layer k and in the whole area, respectively. Variable q takes values in the range [0, 1], with larger values of q indicating more pronounced spatial heterogeneity in Y. When stratiﬁcation of Y is due to independent variable X, it can be assumed that the larger the value of q, the stronger the ability of independent variable X to explain attribute Y, and vice versa. h and In practical situations, where a single factor does not determine the distribution of attributes, interaction detection by the geographical detector can help us to detect interactions between different risk factors. The driving factors may be independent of each other or may act together, and the results of interactions between factors fall into four categories (Table 2). It is expected that the q-value of the geographical detector and interaction detection be used to indicate the extent to which the proposed inﬂuencing factor explains the foreign trade of Henan Province. Combined with the evaluation indicators proposed by previous scholars, the internal influencing factor indicators of foreign trade in Henan Province were created [28,42–47,58,59]. The interpretation of the geographical detector indicators is shown in Table 3: Applying the gravity model to the geoeconomic ﬁeld, it can be considered that the trade volume of two countries is directly proportional to the size of their respective economies and inversely proportional to geographical distance. where Tij denotes the trade volume between the two countries; Mi and Mj are the total import and export trade between economies i and j; and Dij represents the distance between the two economies. Linnemann adds population and preferential trade agreements to the endogenous variables, after which other trade cost factors other than physical distance can be added to the traditional gravity model to optimize model estimation, taking the natural logarithm on both sides of the equation, resulting in a new gravity model approach [60]: where ag is the constant term; a~a4 are the regression coefficients of each variable; M; and M; represent the gross products of economies i and j, respectively; Di represents the distance between the two economies; X; represents other possible variables affecting the two trades; ej is the random interference term. In the age of globalization, trade is constantly changing dynamically, inﬂuenced by many factors and complex mechanisms. A signiﬁcant proportion of these factors cannot be quantiﬁed. These factors also have different coverage times and may not be reﬂected in the changes in regional trade patterns immediately. So, this study selected the long- lasting quantiﬁable factors that may have played a role in the whole study period, such as economic freedom, FTAs, population size, and other 12 variables [8,12,15,26,28], and explored the speciﬁc mechanism of their role through the gravity model. LnYjj = a9 + a\\1nDIST; + aglnHGDPy + aglnGDPy + aglnRATE;, + aslnTOj, + aglnEFWit +a7FTAj + aglnHPEOj}t + aglnPEOje + ayo n FUEL jt + ayilnICT;¢ + ay2InMMTL}t + €:; where Y;j is the total import and export or export value of Henan Province and its trading countries; ag is the constant term; a,~a12 are the regression coefficients of each variable; e, is the random disturbance term. Explanatory notes for the remaining variables are shown in Table 4. Since China formally joined the WTO on 11 December 2001, the study period for all data in this paper began in 2002. The data sources and related information used in the study are shown in Table 5. According to Figure 2, the total import and export of Henan Province is growing gradually, and export is developing rapidly. The development of foreign trade in Henan Province can be roughly divided into four stages: (1) the starting period (2002–2010, S1)— China’s accession to the WTO in 2001; after the rapid growth of foreign trade, Henan’s foreign trade development due to its inland location is subject to limitations, in general, with a slow growth rate far worse than the overall trend in China; (2) the rapid development period (2011–2015, S2)—with the recovery of the global economy and the implementation of the “Belt and Road” policy, the trend of Henan’s foreign trade is basically in line with China’s general trend; foreign trade has grown signiﬁcantly and rapidly, with the total import and export amounts increasing from USD 35.585 billion in 2011 to USD 77.148 billion in 2015; (3) the period of stable growth (2016–2018, S3)—the global economic growth rate is slowing down, and China’s import and export trade begins to experience negative growth, but Henan Province is not signiﬁcantly affected and still shows a stable and improving trend; (4) the period of restored growth (2019–2021, S4)—affected by the global economic situation and COVID-19, China’s import and export trade declines slightly; Henan Province is also affected in this period, but it slowly recovers to reach USD 127.009 billion in 2021.",
    "A greater value of foreign trade dependence indicates that a region’s economic devel- opment depends more on its connection with the international market and on a stronger sense of participation in the international division of labor and competition. Data on foreign trade dependence (Figure 3) show that Henan’s foreign trade dependence is low, with a slow growth trend; the ﬁnancial crisis of 2008 and COVID-19 have a relatively small impact on Henan’s foreign trade dependence, suggesting that Henan’s trade potential with the international market is good and that it has a certain level of risk resistance. China has a closer relationship with the global market, while Henan’s foreign trade dependence is lower than China’s. However, since 2012, Henan’s foreign trade dependence has experienced the opposite trend from China’s overall foreign trade dependence. According to Figure 4, the commodity structure of imports from Henan Province changed drastically over the study period, while the overall commodity structure of China changed relatively little. Figure 4. Structure of import and export commodities in Henan Province and China from 2002 to 2021. (a) Export commodity structure of Henan; (b) import commodity structure of Henan; (c) export commodity structure of China; (d) import commodity structure of China. In 2002, the commodity structure of Henan Province’s exports was dominated by base metals and their products (T15, 21.45%), textile raw materials and textile products (T11, 18.15%), chemical products (T6, 11.15%), and stone products, ceramic products, and glass products (T13, 9.42%). Since then, the top-ranked share of T15, although rising until 2008, continued to decline to a meager share; T11, T6, and other high-share commodities also fell sharply. By 2021, only machinery, electrical equipment, audio equipment, and their parts (T16) accounted for as much as 66.75% of total exports, followed by chemical products (T6, 4.72%) and special deals (T22, 3.47%). This result shows that the export structure of Henan Province changed from labor-intensive products to high-tech products, and the structure was obviously optimized. Over the same period, the overall structure of China’s export commodities was highly stable, with T16 accounting for a very high proportion of commodities. The imports of Henan Province from 2002 to 2021 were mainly dominated by machinery, electricalequipment, audioequipmentandparts(T16), andminerals(T5). T16didnotundergo any significant changes in its share from 2002 to 2010 and then rose rapidly to 41.25% in 2011. T5 also experienced more obvious fluctuations, with its share falling after rising to a peak of 39.56% in 2010 and recovering slightly since 2017. During the same period, the overall structure of China’s export commodities was relatively stable, with T16 accounting for the highest percentage in the long term, while T5 showed a significant upward trend. A detailed product classification and description are shown in the Table A1 (Appendix A). Overall, Henan Province’s foreign trade commodity pattern is relatively homogeneous, dominated by the import and export of machinery, electrical equipment, audio equipment, and their parts, and its export advantage of animal and plant products is weak. This pattern shows that Henan Province may have obvious trade risks and has yet to fully exploit its advantages as a central grain province. Due to the special nature of weapons, ammunition, and their parts (T19) and of artworks (T21), as well as the meaninglessness of unclassiﬁed goods (T22), they will not be analyzed. The RCA index (Figure 5) indicates the competitive advantage of commodities. Henan’s animal and vegetable oils and waxes (T3) showed a strong export advantage from 2004 to 2019. Precious jewelry and coins (T14) also established a strong competitiveness in the early stage, faltering slightly in 2012–2016 before recovering to the level from the earlier part of the study period after 2017. Movable and animal products (T1), chemical products (T6), and base metals and their products (T15) had a strong lead in the early part of the period and then their share decreased all the way through. Plant products (T2) maintain a more stable advantage. Machinery, electrical equipment, audio equipment, and their parts (T16) began to have a speciﬁc advantage since 2012, indicating that high-tech products in Henan Province saw a remarkable development. Nevertheless, the RCA index of vehicles, aircraft, ships, and related transportation equipment (T17), medical equipment (T18), and other high-precision products never exceeds 1, indicating that Henan’s science and technology level still has more room for improvement.",
    "Table 6 shows that Henan Province has been trading closely with the United States, the Netherlands, Japan, the United Kingdom, South Korea, and Germany for a long time. It is worth mentioning that Henan’s dependence on the US is the highest and increases year by year, and the latest data show that this dependence reaches 33.39%, much larger than that of other countries and regions. Against the backdrop of the trade war between China and the United States, this dependence may adversely affect the sustainable development of Henan’s foreign trade. As can be seen in the regional distribution (Figure 6), the African region and Henan Province had close trade relations. For example, African countries such as Benin, Gambia, Guinea, Djibouti, Liberia, and Nigeria had profound trade exchanges with Henan for many years. Brunei, Myanmar, North Korea, Vietnam, Laos, and other Southeast Asian countries also had a high trade intensity index with Henan Province. After the implementation of the “Belt and Road“ strategy, the export trade cooperation between Henan Province and Luxembourg, the Netherlands, Venezuela, Yemen, Saudi Arabia, Uzbekistan, Kyrgyzstan, and other countries also increased signiﬁcantly. Still, the trade intensity index of Henan Province with European countries such as Switzerland, Austria, France, Denmark, and Finland was at a low level for many years. In the study of the foreign trade scale of prefecture-level cities in Henan Province dur- ing the period S1–S4, the results (Figure 7) show that there is apparent spatial heterogeneity in its distribution: the foreign trade scale of Zhengzhou, the capital of the province, is much larger than that of the other cities, and the foreign trade scale of the cities in the west is generally larger than that in the east. Based on this, the import and export volume between Henan Province and each trading country is the dependent variable, and the 12 independent variables (Table 3) are divided into four categories: the economy, industrial structure, transportation, and innovation. The geographical detector method was used to study the internal inﬂuencing factors of Henan Province’s foreign trade from 2002 to 2021. The results (Figure 8) show that the different factors passed the signiﬁcance test at all stages but with different levels of expressiveness: the top three dominant factors in S1 were, in order, innovation investment (x10), consumption (x2), and the number of patents (x9); in S2, innovation investment (x10), foreign investment (x6), and the number of patents (x9); in S3, consumption (x2), highways (x7), and innovation investment (x10); and in S4, foreign investment (x6), the number of patents (x9), and tertiary industry (x5). Foreign investment (x6), the number of patents (x9), and innovation investment (x10) show strong driving forces, among which innovation investment (x10) is prominent in the early stages, while foreign investment (x6) is prominent throughout. The explanatory power of secondary industry (x4) and tertiary industry (x5) show contrasting trends, with x4 playing a more signiﬁcant role in the early stage of Henan Province’s foreign trade, followed by a gradually weakening performance, and x5 showing the exact opposite trend. In addition, the driving roles of GDP (x1) and consumption capacity (x2) are volatile, showing a stronger inﬂuence in S1 and S3 and a weaker one in the other periods. The order of dominance of the four single-factor categories for 2002–2021 is innovation capacity, the economy, industrial structure, and transportation conditions. The results of the factor interaction test (Figure 9) show that the interaction between any two factors has a more important driving force than the individual factors, indicating that inﬂuencing factors are not independent but work together. The dominant factor interactions in S1 are tertiary industry x5 ∩ innovation invest- ment x10 (0.933), innovation investment x10 ∩ education investment x11 (0.928), sec- ondary industry x4 ∩ innovation investment x10 (0.927), GDP x1 ∩ innovation investment x10 (0.926), and consumption x2 ∩ innovation investment x10 (0.912). The dominant factor interactions in S2 are consumption x2 ∩ highways x7 (0.956), foreign investment x6 ∩ highways x7 (0.950), GDP x1 ∩ highways x7 (0.928), urbanization rate x3 ∩ highways x7 (0.917), and consumption x2 ∩ foreign investment x6 (0.898). The dominant factor interactions in S3 are highways x7 ∩ railroads x8 (0.955), GDP x1 ∩ highways x7 (0.948), secondary sector x4 ∩ foreign investment x6 (0.945), GDP x1 ∩ sec- ondary sector x4 (0.935), and highways x7 ∩ number of patents x9 (0.924).",
    "The dominant factor interactions in S4 are tertiary industry x5 ∩ foreign investment x6 (0.950), foreign investment x6 ∩ innovation investment x10 (0.919), consumption x2 ∩ sec- ondary industry x4 (0.887), GDP x1 ∩ tertiary industry x5 (0.885), and foreign investment x6 ∩ number of patents x9 (0.872). From the above results, the interaction effect of innovation investment (x10) in S1 is obviously more remarkable than that of other factors. The factors with the most apparent interaction effects in S2, S3, and S4 are highways (x7), consumption (x2), and tertiary industry (x5), respectively. In addition, railroads (x8) have little explanatory power based on the results of the single-factor test alone (2011–2018). However, the results of the interaction test show a clear explanatory role for the interaction of railroads with most of the factors. Henan Province traded with 213 countries and regions during the study period, and due to data deficiencies, 2314 valid data were obtained after cleaning using Stata 17 software. Sample size estimation was performed using G-Power 3.1 software before regression. Random testing and multiple linear regression modeling was conducted using the EXACT method, choosing a two-tailed test, assuming that the 12 selected variables are within the 95% conﬁdence interval; H1 assumed that the selected variables can explain 70% of Henan’s foreign trade, and H2 assumed that the explanatory power of the selected variables is not more than 50%. At this point, the number of required sample data is 133. The data of this study can fully meet this condition. Table 7 shows the statistics of the data. In addition, the variables were tested in order to avoid disturbances caused by multi- collinearity in the model. After stepwise regression using SPSS 27.0.1 software, HPEO and FUEL were excluded. Correlation analysis (Table 8) and collinearity tests (Table 9) were performed on the remaining variables. The VIF of each variable after treatment was less than 5, proving that the model does not have serious multicollinearity [61]. Based on the basic gravity model, the indicators of economic freedom, FTAs, and population were added (Table 9), and the total amount of import and export between Henan Province and the trading countries was substituted into the model as the dependent variable, which was analyzed with Stata software. Post hoc tests were performed after obtaining the regression results. Using G-Power 3.1 software (t-test post hoc for linear multiple regression, ﬁxed model), the effect size was 0.772. For a two-tailed test with a sample size of 2314, the result was 1, which reaches the permissible value [62,63]. As for Henan’s foreign trade development data, the analysis of internal inﬂuencing factors was divided into four stages. In order to verify the scientiﬁc validity of this division in the analysis of the gravity model, a Chow test was conducted. The results show that there were structural changes before and after 2010. Considering the sample size and the results of the Chow test (Table 10), 2010 was taken as the time point in analyzing external factors, and S2–S4 (2011–2021) were analyzed together. In the analysis of external factors by period, the same methodology was used as in the analysis of the overall data: a collinearity test (Table 11) was performed ﬁrst, and stepwise regression eliminated some of the factors and analyzed them. All remaining variables passed the signiﬁcance test. In 2002–2010, HPEO and FUEL were excluded; in 2011–2021, HPEO, FUEL, EFW, and ICT were excluded. Regression results (Table 12) show that S1 has the most variables passing the signiﬁ- cance level test, which is the same as in 2002–2021; distance, GDP, FTAs, exchange rate of trade country, trade openness, and population all pass the signiﬁcance test. S2–S4 have the best ﬁtting results. R2 is signiﬁcantly higher than that of the other periods. In summary, most factors, except for geographical distance, positively contribute to foreign trade, with the GDP of the trading countries having a signiﬁcant impact. The results of geodetector calculations show that economic development and inno- vation capacity are the dominant factors contributing to the unbalanced development of foreign trade in the cities of Henan Province. For different development periods of Henan Province as a whole, innovation input provides the driving force for the development of the region’s foreign trade, which deter- mines the starting height of its development. Then, with the development of the scale of foreign trade, the transportation capacity of highways provides an essential guarantee of the region’s long-term development. After entering a period of steady growth, consump- tion represents the region’s economic development level, and a high level of consumption is conducive to foreign trade. Finally, the development of tertiary industry shows that demand, supply, industry, and division of labor in the region are reﬁned, and tertiary industry can promote the development and improvement of the market system and create favorable conditions for foreign trade.",
    "Innovativeness is notable in Henan Province (factor x10), but the commodity structure shows that the high-tech aspect’s core content is yet to be formed. Therefore, Henan Province should vigorously develop high-tech industries and emphasize cultivating and importing talents so that innovation inputs can play a more signiﬁcant role. The strong interaction effect of the highway and railroad factors suggests that they play an indispensable role in the development of Henan’s foreign trade, which is consistent with the current situation of Henan’s land transportation: although as an inland province, it has a natural geographic disadvantage in terms of foreign trade, it has a comprehensive transportation network with a mileage of 280,000 km. Several cities in Henan are national transportation hubs, and Zhengzhou, the provincial capital, is a comprehensive interna- tional transportation center. Therefore, transportation factors should continue to play a critical role in Henan Province’s foreign trade. In addition to the above quantitative analysis results, some qualitative factors, such as policy factors, should be considered. Policy conditions, for example, the “One Belt, One Road China-EU Liner” and the “Zhengzhou-Luxembourg Air Silk Road”, should also be fully utilized by Henan Province to promote its industrial transformation and economic development, which will promote the development of foreign trade. Zhengzhou and Luxembourg’s “Air Silk Road” cargo trade covers over 200 cities in 24 European countries. Over the past ten years, the cargo volume of Luxembourg Cargo Airlines in Zhengzhou Airport has reached 1 million tons. The China–Europe liner (Zhongyu) covers a network of more than 40 countries and 140 cities in Europe, ASEAN, and Asia–Paciﬁc. By the end of August 2023, the total cumulative cargo value of the China–Europe liner (Zhongyu) was about CNY 235 billion, and the cargo weight was about 5.9 million tons. Moreover, supported by Henan government policies, the province’s cross-border e-commerce has more than 46,000 enterprises on record, 206 overseas warehouses in 47 countries and regions, and trade covering more than 200 countries and regions. The province’s cross-border e-commerce import and export volume rose from less than CNY 100 million in 2014 to CNY 221 billion in 2022. In terms of culture, the province concluded 125 sister city agreements with 51 countries. The government of Henan has built seven centers in Zambia, Ethiopia, Eritrea, and other countries, including the Chinese Traditional Medicine Center, China Trauma Treatment Center, and China Maternal and Child Health Center, which have treated more than 7 million people in the recipient countries. “Shaolin Kungfu”, “Taiji Culture” and other cultural and tourist features have also greatly enhanced the advantages of our province’s open channels. Policies have greatly inﬂuenced, all in all, the development of foreign trade in Henan Province. One of the strong negative effects is geographical distance [64]. However, with the continuous development of transportation, the negative effect of the distance factor on foreign trade is gradually reduced. With Henan’s transportation advantages, further promotion should be made to strengthen ties with the rest of the world through good transportation [65]. In addition, ICT also shows a weaker negative impact. Henan Province has processed and exported a large number of ICT products and competes with countries that are high exporters of ICT products, which is not favorable in terms of trade. The factors that play a positive role in the long run are foreign and domestic GDP, the exchange rate of the target trade country, FTAs, trade openness, and population. Among them, the target trade countries’ exchange rates do not play a signiﬁcant role. It is generally believed that the higher the level of GDP in Henan Province, the more it attracts foreign investors to trade with it. The GDP of the target country, on the other hand, reﬂects the economic level of the target country (high-economic-level countries are more willing to conduct foreign trade), which is consistent with the data in Section 3.3.2, and the strength of the role of the GDP of the target country is the most prominent in S2–S4. Therefore, the development of the regional economy should be the focus of Henan, driving the development of foreign trade and then forming a positive cycle of foreign trade to feed the regional economy pattern. Trade barriers between Henan Province and trading countries can be eliminated by signing FTAs, so foreign trade can be signiﬁcantly facilitated by establishing FTAs [66]. Furthermore, the calculation results show that these advantages are fully utilized by Henan Province to develop in-depth cooperation with FTA partner countries. In addition, the role of FTAs is relatively weakened during periods of high trade openness, with high openness in trading countries outweighing FTA capacity. Therefore, Henan Province should actively rely on national policies and carry out foreign trade activities in a targeted manner.",
    "In addition, this study has a few limitations. Firstly, the types of research methods used can be deepened. The interpretation of some data needs to be revised, such as the interpretation of Henan Province as a large population province. However, its population factors have not passed the signiﬁcance test, and their role still needs to be clariﬁed. Secondly, the impact of major political and economic events on the pattern of foreign trade is yet to be fully interpreted and analyzed. In the next step of the research program, the research methodology will be deepened to provide a better interpretation of the data, increase the analysis of signiﬁcant events, increase the in-depth study of countries that trade closely with Henan Province, and try to obtain the reasons for the formation of such stable foreign trade patterns in order to make better suggestions for the development of foreign trade in Henan Province. Author Contributions: Conceptualization, methodology and software, Y.W. (Yalin Wang); validation, formal analysis and investigation, Y.W. (Yabo Wang) and S.Z.; resources and data curation, Y.W. (Yalin Wang) and J.Z.; writing—original draft preparation, writing—review and editing, Y.W. (Yalin Wang), J.L. and X.Z.; visualization, Y.W. (Yabo Wang); supervision, project administration and funding acquisition, J.L. and Y.Z. All authors have read and agreed to the published version of the manuscript. Funding: This research was funded by the National Social Science Fund of China—“Theory and Method of Geo-Environmental Analysis in the Era of Big Data”, grant number 20&ZD138. Acknowledgments: We thank all the participants involved in the project for their contribution to our research. At the same time, we thank the editors and reviewers for their valuable comments."
]