[
    "Citation: Bai, Q.; Gao, M.; Lyu, H.; Zhang, L.; Zhang, J. Spatial Distribution Characteristics and Influencing Factors of Tangible Cultural Heritage in Henan Province, China: A Watershed Perspective. Sustainability 2024, 16, 8979. https:// doi.org/10.3390/su16208979 Abstract: Henan Province, a significant cultural heritage province in China, has abundant tangible cultural heritage resources distributed across the region. Watersheds are the fundamental geographi- cal units that have consistently supported human production and subsistence activities from ancient times to the present. Analyzing the spatial distribution characteristics and influencing factors of tangible cultural heritage resources of the watersheds in Henan Province is of great importance for its macro-level preservation, value promotion, and sustainable development. This research focuses on the 421 major historical and cultural sites protected at the national level in Henan Province, utilizing GIS spatial analysis techniques such as kernel density estimation, nearest neighbor index, Thiessen polygons, spatial auto-correlation analysis, and geographically weighted regression to investigate the spatial distribution characteristics and influencing factors of tangible cultural heritage across different watersheds in the province. The results indicate the following: (1) The cultural heritage sites in Henan Province exhibit an overall clustered distribution. Within specific watersheds, such as the Jindihe River, Huaihe River, and Baihe River, the cultural heritage distribution is relatively sparse, displaying a random distribution pattern. (2) The cultural heritage distribution forms two high-density centers and one high-density distribution belt, exhibiting a tendency to align along lower-grade rivers. (3) The distribution of cultural heritage shows significant spatial auto-correlation, with high-value areas (hotspots) concentrated at the watershed intersections of the Yiluohe River, Weihe River, and Yinghe River. (4) Elevation, precipitation, GDP from the tertiary sector, museum density, and proximity to the nearest historical and cultural cities are the primary factors influencing the spatial differentiation of cultural heritage within each watershed. Moreover, there is significant spatial heterogeneity between different watersheds. Lastly, specific strategies for the sustainable preservation and utilization of cultural heritage in Henan Province are proposed, including differentiated preservation approaches, strengthening the preservation of water-related cultural heritage, promoting sustainable cultural Copyright: © 2024 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). Tangible cultural heritage resources are a crucial component of Chinese culture, act- ing as physical carriers that document human life, social productions, politics, economy, and cultural activities. The tangible cultural heritage resources in this study refer to the immovable cultural heritage that are preserved in the original locations. Henan Province, a major cultural heritage province in China [1], has a wide distribution of cultural her- itage resources. Conducting in-depth studies on the spatial distribution patterns of these tangible cultural heritage resources is crucial for the scientific preservation, utilization, and sustainable development of Henan’s cultural heritage. Specifically, researching the spatial variability in the distribution of cultural heritage aids managers in formulating differentiated protection and utilization strategies, ensuring more accurate and effective cultural heritage conservation measures. Furthermore, it supports the creation of cultural exhibition areas or themed tourist routes based on the distribution patterns of cultural heritage, thus driving local socio-economic development. At present, there is abundant research on the spatial distribution characteristics of cultural heritage. The subjects of this study mainly include the following: The factors affecting the distribution characteristics of cultural heritage generally include the natural environment and human environment. Natural factors typically con- sider elements such as rivers, mountains, and elevation [37,38]. The human environment usually takes into account factors like economic development, per capita GDP, and cultural aspects [39]. These studies show that the spatial distribution characteristics of cultural heritage are closely tied to these two types of influencing factors, which also provide a theoretical foundation for our research. In conclusion, studies on the spatial distribution of cultural heritage mainly concentrate on specific types of heritage, such as villages, industrial heritage, agricultural heritage, and intangible cultural heritage. Moreover, there are thematic studies that cover diverse research perspectives, including human-environment interactions, tourism development, the origins of civilizations, and model construction. Overall, this field of research is characterized by fragmentation and a lack of systematic approaches. Previous studies suggest that the spatial distribution of cultural heritage reflects mate- rialized ancient human–environment relationships [22,23]. The creation of cultural heritage represents traces left by human activities of production and living centered around rivers. River-centered watersheds tend to be geographically enclosed, which results in spatial cultural heterogeneity [40]. For example, the development of the four ancient civilizations was all based on large river systems, and the environmental differences among these water- sheds contributed to cultural diversity. Henan Province spans several watersheds, each with distinct natural environments and varying socio-cultural conditions. Past studies typically use administrative divisions as the basic unit, which fails to fully reveal how differences in watershed environments influence the distribution of cultural heritage [41,42]. This research focuses on Henan Province, the core area of China’s civilization origin and development, and it divides the area into seven major watersheds based on the river sys- tems. Furthermore, the research object is subdivided into smaller watersheds. Through GIS spatial analysis techniques, this research examines the spatial differentiation of the 421 major historical and cultural sites protected at the national level across different watersheds in Henan Province and investigates the factors driving these patterns. As deducted from the literature review, there is a need to lay groundwork for the future protection, utilization, and sustainable development of material cultural heritage in Henan Province.",
    "Henan Province spans 530 km from north to south and 580 km from east to west. It borders Anhui and Shandong to the east, Hebei and Shanxi to the north, Shaanxi to the west, and Hubei to the south, positioning itself as a key region linking the north to the south and connecting the east to the west (Figure 1). The province covers a total area of 167,000 square kilometers, making up 1.73% of the nation’s total land area. The topography of the province is characterized by higher elevations in the west and lower in the east, with the Taihang, Funiu, Tongbai, and Dabie Mountains forming a semi-circular arc along the northern, western, and southern borders. The central and eastern regions are dominated by the Yellow Huaihai Alluvial Plain, while the southwestern part is home to the Nanyang Basin (Figure 2). Plains and basins make up 55.7% of the total area, with mountains covering 26.6% and hills 17.3% (Source: Henan Provincial Government Website http://m.henan.gov.cn/2023/06-13/2760283.html, accessed on 8 August 2024). Utilizing GIS hydrological analysis tools, the research area was divided into seven basins: the Baihe River Basin, the Yinghe River Basin, the Yiluohe River Basin, the Guohe River Basin, the Weihe River Basin, the Huaihe River Basin, and the Jindihe River Basin. Additionally, based on previous research, the river basins were further divided into smaller sub-basins, with the streamflow threshold set to 3000. Under this threshold, a total of 2134 small sub-basins were identified (Figure 2). The cultural heritage data used in this research were derived from eight batches of national-level cultural heritage preservation lists published by the National Cultural Her- itage Administration of China, with a total of 421 sites. Using their latitude and longitude information, the data were loaded into a GIS platform for vectorization and visualization (Data source: http://www.ncha.gov.cn/, accessed on 10 August 2024). Elevation data were obtained from the publicly available data on the Geographic Spatial Data Cloud website of the Chinese Academy of Sciences (Data source: https://www.gscloud.cn/, accessed on 12 August 2024). GIS tools play a vital role in spatial analysis, integrating various data and offering a rich set of spatial analysis tools that help users identify relationships between datasets. Its robust data processing power and intuitive visualization capabilities make it widely applied in spatial analysis [43]. Using GIS tools, these data were further processed to generate slope and hydrological data. Economic data were sourced from the publicly available data of the Henan Bureau of Statistics (Data source: https://tjj.henan.gov.cn/, accessed on 15 August 2024). The research process was structured into four parts: a. data preparation and processing; b. analysis of the watershed characteristics in the spatial distribution of cultural heritage; c. analysis of influencing factors; and d. cluster preservation and development strategies of watershed cultural heritage. Initially, the data were collected to construct a comprehensive database, including DEM data, cultural heritage resource location, slope, cultural heritage coordinates, temperature and rainfall for different regions in Henan Province, cultural industry GDP, and museum coordinates. Based on DEM data, GIS hydrological analysis tools were used to divide Henan Province into seven major watersheds and multiple small watersheds. Second, the spatial distribution characteristics of cultural heritage within the river basins were examined. The kernel density estimation method was employed to analyze the spatial distribution density of cultural heritage across each basin. The nearest neighbor index was utilized to assess the types of spatial distribution (including clustered, random, and uniform) within each basin. Moran’s I was applied to evaluate the spatial auto-correlation of cultural heritage in each basin, while the Thiessen polygon method was used to determine the service areas of cultural heritage sites within each basin. Additionally, a GIS spatial statistical analysis was performed to investigate the relationship between different basin levels and the distribution of cultural heritage. Then, a stepwise regression model was applied to identify the optimal influencing factors, which was followed by the application of a geographically weighted regression (GWR) model to examine the spatial heterogeneity of these factors. Finally, based on the research findings, strategies and recommendations were proposed for the sustainable spatial conservation and utilization of cultural heritage in Henan Province (Figure 3). Kernel density estimation calculates the density of point features surrounding each raster cell, visually representing the distribution of discrete measurements across a con- tinuous area. In this study, cultural heritage was treated as point features, and kernel density estimation served as the methodological foundation for investigating the spatial distribution of these heritage points. The application of kernel density estimation can reflect the spatial density of cultural heritage distribution. The kernel density value indicates the density of cultural heritages. A higher kernel density value represents a denser distribution of cultural heritage sites. The kernel density estimation is the probability of the density function f at point x [44,45]. The calculation formula is shown as Formula (1): ) is the kernel function, h represents a search radius greater than 0, and h x − Xi represents the distance between the estimated point x and the event Xi (km).",
    "The nearest neighbor index reflects the spatial distribution type of cultural heritage and the proximity values of each cultural heritage site within the study area. The criteria for classifying the spatial distribution types of point features are the following: if the nearest neighbor index is less than 1, the spatial distribution type is clustered; if the nearest neighbor index equals 1, the spatial distribution type is random; if the nearest neighbor index is greater than 1, the spatial distribution type is uniform. Where r1 represents the average distance between nearest points, rE represents the average distance of nearest points in a random distribution pattern, and D represents the point density. Finally, the nearest neighbor index R is calculated [46]. The calculation formula is shown as Formula (2): The Thiessen polygon, also known as the Voronoi diagram, consists of a continuous set of polygons formed by the perpendicular bisectors of lines connecting two neighboring points. The Voronoi diagram connects two adjacent generators and constructs the perpen- dicular bisectors of the connecting line segments. The intersections of these perpendicular bisectors form polygons, dividing the entire plane into several sub-regions. Each sub-region contains only one generator, and the properties of the generator within the sub-region can represent the properties of that sub-region. Furthermore, the average level of the generator in the region can be inferred using the area of the sub-region as a weight [47]. This study constructed the Voronoi diagram of Henan Province’s tangible cultural heritage resources. The area of each Thiessen polygon reflects the service range of each cultural heritage site. The larger Thiessen polygon area indicates that the cultural heritage resources in that region are scarcer. The spatial auto-correlation analysis can be used to represent the spatial clustering characteristics of cultural heritage. Global spatial auto-correlation describes the spatial clustering of attribute values in research units across the entire region, effectively indicating whether cultural heritage in different river basins in Henan Province demonstrates signif- icant clustering patterns. Global spatial auto-correlation was quantified by the Moran’s I index, and the formula for calculating the global spatial auto-correlation Moran’s I is as follows: In Formula (3), n represents the number of geographical units; xi and xj are the values of units i and j, respectively; x is the mean of all units; and wij is the spatial weight matrix element, where wij equal to 1 when i and j are spatially adjacent, and wij equal to 0 when they are not. When the Moran’s I index is greater than 0, the cultural heritage in the river basins shows positive spatial correlation; if less than 0, it shows negative spatial correlation; and if equal to 0, it indicates a random distribution of cultural heritage [48]. However, global spatial auto-correlation cannot capture the correlations between specific small river basins. It is often combined with a local spatial auto-correlation analysis to further examine correlations among small regions. In this research, hot spot analysis is employed to further investigate the spatial auto-correlation characteristics among small river basins, aiming to analyze the distribution features of clustering and dispersal areas. Hot spots refer to areas with high data values, meaning the observed values in these areas are significantly higher than those in surrounding regions. Cold spots refer to areas with low data values, indicating that the observed values are significantly lower compared to surrounding areas [49,50]. The calculation formula is as follows: In Formula (4), xi and xj denote the concentration of cultural heritage in basins I and j, respectively; Wij is the spatial weight function; E(Gi) represents the expected value; and Var(Gi) is the coefficient of variation. A stepwise regression analysis allows for the gradual inclusion and exclusion of variables to find the optimal combination of variables. The basic approach of stepwise regression analysis is to sequentially introduce each variable into the regression equation. Variables are added based on F-tests (significance tests), and insignificant variables are removed. Additionally, explanatory variables already included may lose significance and importance when new explanatory variables are introduced, necessitating t-tests to decide whether to remove them from the regression equation. This action ensures that, before introducing new variables, the regression equation only includes variables that have a significant effect on the dependent variable. This process is repeated until no significant new variables need to be included, and no insignificant variables need to be removed [51].",
    "The geographically weighted regression (GWR) model is a regression model with geographic variation parameters that adheres to the “first law of geography.” It uses spatial relationships as weights in the calculations, enabling the quantification of spatial heterogeneity. The fundamental principle involves using the location of each explanatory variable to measure spatial distances point by point within a certain range, with the weights of explanatory variables changing according to distance [52]. The calculation formula is as follows: In Formula (5), yi represents the dependent variable; xik represents the observation values of the independent variables; (µi,vi) represents the geographic coordinates; β0(µi,vi) represents the constant term; βk(µi,vi) represents the regression coefficient; and εi represents the random error term. This research selected seven explanatory variables covering natural, socio-economic, and cultural aspects: average elevation (calculated using GIS software ArcGIS Pro 3.0 through zonal statistics of elevation values in small basins), average slope (calculated using zonal statistics of slope values in small basins), annual average precipitation (calculated via zonal statistics of annual precipitation in small basins), annual average temperature (calculated through zonal statistics of annual temperature in small basins), museum density (calculated as the ratio of the number of museums to the area of small basins), tertiary industry GDP (calculated by zonal statistics of tertiary industry GDP in small basins), and distance to the nearest historic city (calculated by measuring the straight-line distance from each small basin to the nearest historic city). The cultural heritage count in each small basin serves as the dependent variable, analyzed through the GWR model to evaluate the spatial heterogeneity of these factors. Henan Province has a total of 421 major historical and cultural sites protected at the national level, with 410 of them located in the seven river basins defined by this research. The Yinghe River Basin is the largest and contains the most heritage sites, making up 42.4% of the total, while the cultural heritage sites in the Guohe River Basin account for only 2.4% of the total. The statistics on the number of heritage sites in each river basin indicate significant differences in the spatial distribution of cultural heritage across the basins (Table 1). By applying the nearest neighbor index method, this research finds that the actual average nearest neighbor distance for cultural heritage sites in Henan Province is 6150.3 m, while the theoretical average nearest neighbor distance is 11,742.8 m. The nearest neighbor index (R) is 0.52, with a significance level of less than 0.01, suggesting a spatial clustering pattern (Table 2). Further analysis examines the spatial distribution patterns of cultural heritage within each river basin. The results reveal that cultural heritage in the Weihe River, Yiluohe River, Yinghe River, and Guohe River basins demonstrates a clustered distribution pattern, whereas in the Jindihe River, Baihe River, and Huaihe River basins, the results exhibit a random distribution pattern (Table 3). The kernel density analysis reveals that two high-density clusters of cultural her- itage are concentrated in the Yiluohe River and Yinghe River basins, while an extended high-density distribution belt is observed in the Weihe River Basin. Cultural heritage in other basins appears relatively dispersed, lacking significant high-density clusters or belts. Additionally, the high-density clusters are primarily located at the intersections of river basins, suggesting an overall spatial distribution pattern of “two cores and one belt” in Henan Province (Figure 4). The appearance of high-density cultural heritage clusters and distribution belts supports comprehensive protection and planning, ensuring that dispersed cultural heritage sites do not lack thorough and effective protection. Moreover, it helps maximize the cultural industry cluster effect within the region and facilitates the creation of cultural heritage protection and development corridors based on their spatial distribution characteristics. The Thiessen polygon analysis results indicate that the minimum polygon area is 0.47 km2, and the maximum is 3179.2 km2, highlighting a stark contrast. The polygons in the central and northwestern regions of Henan Province, particularly in the Yiluohe River and Yinghe River basins, are generally smaller, whereas those in the surrounding basins are generally larger. This difference suggests that cultural heritage resources are relatively concentrated in the Yiluohe and Yinghe River basins. In comparison, the Huaihe River, Baihe River, Guohe River, and Jindihe River basins have fewer cultural heritage resources, necessitating that individual sites serve broader areas (Figure 5).",
    "The calculation shows that the global spatial auto-correlation Moran’s I is 0.09, with a p-value of 0. It demonstrates that the statistically significant spatial auto-correlation is a positive correlation, and there is a clustering trend in the distribution of cultural heritage across the river basins. A hot spot analysis further uncovers the local spatial auto-correlation among smaller basins. The analysis results indicate that hot spots are concentrated at the confluence of the Yiluohe River, Weihe River, and Yinghe River basins, with no cold spots detected in the study area, and other smaller basins show non-significant local spatial auto-correlation, suggesting a relatively dispersed distribution of cultural heritage (Figure 6). A GIS spatial statistical analysis shows that a total of 274 cultural heritage sites are located in the basins of primary rivers, comprising 66.8% of the total; 79 sites are in secondary river basins (19.3%), 35 sites in tertiary river basins (8.5%), 21 sites in quaternary river basins (5.1%), and only 1 site is in the quinary river basin (0.2%). This trend indicates that the number of cultural heritage sites decreases with increasing river rank, with most sites concentrated along the lower-order tributaries (Figure 7, Table 4). The major historical and cultural sites protected at the national level represent the highest level of preservation for immovable cultural heritage, as authorized by the State Council of the People’s Republic of China. The application principles for designation as major historical and cultural sites should prioritize the value, emphasize the key informa- tion, ensure the quality, and maintain the authenticity and integrity. The cultural heritage eligible for this designation must have substantial historical, artistic, and scientific value, along with exceptional social and cultural significance (Source: http://www.scpc.gov.cn/, accessed on 20 August 2024). Therefore, the primary factors influencing the designation of major historical and cultural sites are historical and socio-economic elements. Historical factors encompass the natural environment and cultural history underpinning the formation of cultural heritage. A stepwise regression model was employed to manage the explanatory variables, based on the number of cultural heritage sites per sub-watershed as the dependent variable, excluding those with multicollinearity. The findings indicate that slope and temperature were removed due to multicollinearity, while elevation, precipitation, tertiary industry GDP, distribution density of museums, and the distance to the nearest historic city exhibited statistically significant correlations with the research objective (Table 5). This study employed a geographically weighted regression (GWR) model to analyze the spatial variations of influencing factors across different basins. The dependent variable was the number of cultural heritage sites in each sub-basin, while the explanatory variables included average elevation, annual precipitation, tertiary industry GDP, museum density, and the distance to the nearest historic city. The results reveal considerable differences in the impact of these factors across various basins, indicating significant spatial heterogeneity (Figure 8). Figure 8. Spatial distribution of regression coefficients of influencing factors. (a) Average elevation. (b) Annual average precipitation. (c) Tertiary industry GDP. (d) Distribution density of museums. (e) Distance to the nearest historic city. This study utilized GIS spatial analysis techniques to explore the spatial distribu- tion characteristics and influencing factors of tangible cultural heritage resources in Henan Province. The choice of this methodology allowed for an effective examination of spatial dis- tribution factors, including natural geography, historical culture, and economic development. By focusing on geographic features, this study mitigated the limitations associated with regional characteristics and cultural heterogeneity, thereby providing insights for more effective tangible cultural heritage preservation strategies and avoiding the homogenization of heritage preservation and utilization. Moreover, applying GIS spatial analysis techniques to this study of tangible cultural heritage distribution introduced a new perspective to the research on heritage spatial distribution. Observations derived from the cultural geographic information model regarding influencing factors were crucial for guiding the preservation and sustainable development of tangible cultural heritage in Henan Province. However, this study had several limitations. First, the proposed strategies were gen- eral and did not account for the unique characteristics of individual sites. Future research will employ cluster analysis to more precisely categorize cultural heritage resources, thereby developing more specific and targeted strategies for the preservation and development of different types of tangible cultural heritage within Henan Province. Additionally, while this study provided a macro-level analysis of distribution characteristics and determining factors, it did not delve into the dynamic driving forces at the micro level, i.e., investi- gating the high-density distribution of cultural heritage within certain geographic blocks, identifying the underlying drivers of such aggregation, and examining the micro-level interactions between these heritage sites and their surrounding geographic environment. Further research will also explore specific cultural heritage and tourism resources within geographic cultural regions and develop targeted preservation and development strategies. Addressing these issues is critical for the future preservation and development of cultural heritage within heritage cultural zones and should be a focus of subsequent research.",
    "Although this study revealed multiple influencing factors affecting the spatial distri- bution of cultural heritage, it also exposed several issues in heritage preservation. First, the concentration of cultural heritage in some basins made it vulnerable to risks such as damage or loss due to external environmental changes (e.g., natural disasters, urban expansion). Second, due to economic imbalance, preservation efforts for cultural heritage in some remote areas were relatively weak, lacking sufficient funding and technical support. Moreover, the spatial heterogeneity of cultural heritage suggested that a one-size-fits-all preservation strategy might not meet the practical needs of different regions, necessitating the development of more flexible preservation plans based on local conditions. Through this study, the cultural heritage protection strategies we proposed were demonstrated in existing cultural heritage protection cases, further supporting this research. For instance, in Guangdong Province’s overall plan for the protection and utilization of the Nanyue Ancient Road cultural route, the distribution characteristics of cultural heritage and its relationship with the water system were taken into account. The plan developed corresponding cultural tourism routes and proposed linking cultural heritage protection with economic development, using historical and cultural conservation to promote village tourism, thereby achieving rural revitalization and stimulating village economic growth. (Data source: https://mp.weixin.qq.com/s/p9WFOaVdmvphXaOvfXok1w, accessed on 18 August 2024). This study, focusing on the 421 major historical and cultural sites protected at the national level in Henan Province, employed GIS spatial analysis techniques—including ker- nel density estimation, nearest neighbor index, Thiessen polygons, spatial auto-correlation analysis, and geographically weighted regression—to investigate the spatial distribution characteristics and influencing factors of tangible cultural heritage within various basins in Henan Province. The main conclusions were as follows: Finally, targeted sustainable preservation and utilization strategies for cultural her- itage in Henan Province were proposed, including differentiated preservation strategies, strengthening the preservation of water system cultural heritage, promoting the sustainable development of cultural tourism, and establishing a cross-regional cooperation mechanism. Author Contributions: Conceptualization, H.L.; Methodology, M.G.; Software, L.Z.; Resources, J.Z.; Writing—original draft, Q.B.; Writing—review & editing, Q.B.; Supervision, M.G. All authors have read and agreed to the published version of the manuscript. Funding: This research was funded by [Major Project of Basic Research on Philosophy and So- cial Sciences in Universities of Henan Province] grant number [2023-JCZD-30] and [General Re- search Fund of Philosophy and Social Sciences of Henan Province University Scheme] grant number [2025-ZZJH-354]. Data Availability Statement: The original contributions presented in the study are included in the article, further inquiries can be directed to the corresponding author."
]