[
    "Abstract: Given the increasing complexity of transportation systems and the critical need for effective safety oversight, this study aims to evaluate and improve the transportation safety supervision (TSS) system in Henan Province, China. Based on questionnaire data from relevant units in Henan Province, China, a three-level index system of the effectiveness of TSS consisting of 4 criterion-level indicators and 25 factory-level indicators is established. By combining the analytic hierarchy process (AHP) and grey system theory, a hierarchical grey evaluation model is constructed to evaluate the current situation of TSS in Henan Province. The results show that the evaluation index system and the weights of each index are reliable. The comprehensive evaluation value of the TSS system in Henan Province is 3.08, indicating that the effectiveness of the system is at level 2; thus, the current situation of TSS in Henan Province is good. Based on the calculated evaluation values of the first- and second-level indicators, suggestions are put forward to strengthen the management of the TSS by supervision units at all levels. Citation: Zhang, X.; Li, S.; Liu, X.; Jian, S.; Li, S.; Yue, J. Research on the Establishment and Application of a Transportation Safety Supervision Evaluation System Based on Grey Analytic Hierarchy Process. Sustainability 2024, 16, 10600. https:// doi.org/10.3390/su162310600 Copyright: © 2024 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). With the rapid development of the social economy, new demands for safety production have been made. The transportation industry is the foundation of economic growth, and safety is the top priority in transportation and transit systems [1]. Despite recent improvements in traffic safety in China, including decreases in the numbers of accidents and fatalities, the problem of traffic safety remains severe [2], and there are many concerns about ensuring efficiency, low accident rates, and smooth transportation services. Safety has been at the forefront of transportation planning for over a decade and will continue to play an essential role [3,4]. Recent years have witnessed notable advancements in safety evaluation, due in part to the widespread adoption of sophisticated evaluation methodologies [5]. Lomakinet et al. proposed a method for the evaluation of traffic safety rooted in multi- criteria evaluation [6]. This approach enables the development of a structured, hierarchical system for the assessment of traffic safety levels in various regions, thereby facilitating a more comprehensive understanding of traffic safety dynamics. Chandrasekaran et al. explored the environment of the road transport system from several perspectives [7]; they pinpointed critical factors within the road environment that significantly influence road transport and proceeded to craft a sophisticated safety evaluation model. In order to evaluate urban road traffic safety, Wang et al. selected several major influencing factors, such as pavement condition, traffic isolation, monitoring Settings, congestion degree, accident rate, and tunnel Settings [8]. Luo et al. established an evaluation model for the safety state of urban traffic using a fuzzy algorithm with people, vehicles, roads, and the environment as evaluation indices [9]. Li established the multi-level safety evaluation index system based on expressway linearity and established the expressway linear comprehensive safety evaluation model based on extension theory; additionally, the entropy weight method was used to determine the weight of each index and classify the safety level [10]. Based on driving behavior data, Min uses the AHP and fuzzy comprehensive evaluation method to determine the safety state of road traffic [11]. Mbakwe et al. used Delphi technology and a Bayesian network (BN) model to evaluate national highway traffic safety [12]. Mohan et al. and Wang et al. studied the evaluation method of urban traffic safety based on accident rate [13,14]. While these studies have made significant strides in researching and analyzing safety evaluation methods, additional research that focuses explicitly on evaluation systems for transportation safety supervision (TSS) is required. TSS comprises the various measures and systems adopted to ensure that the trans- portation industry complies with relevant laws and regulations in the production process. The goals of TSS are to prevent personal injury, property damage, production accidents, and various hazards, and to ensure the safe production of enterprises and the regular operation of transportation facilities. TSS represents a multifaceted and dynamic system comprising numerous interacting factors. To accurately gauge its regulatory effectiveness, pinpoint existing weaknesses and hidden risks, and develop targeted strategies for their mitigation, correction, and prevention, it is imperative to establish a comprehensive evaluation system that thoroughly accounts for these diverse factors. The efficacy of TSS can be adeptly assessed via these qualitative indicators.",
    "Presently, the most commonly employed techniques in safety evaluation include the AHP, fuzzy mathematics, and grey system theory [15–17]. Fuzzy mathematics has emerged as a robust and efficient mechanism for knowledge reasoning in scenarios fraught with uncertainty [18]. Grey system theory excels in navigating uncertain information systems and is particularly effective in modeling contexts where data are scarce or incomplete. The AHP stands out as a versatile decision-making approach that facilitates the relative prioritization and assessment of various options across multiple criteria [19]. Since its inception, the AHP has found widespread applications across virtually all decision-making domains [20], making it a multi-criteria decision-making instrument of broad utility [21]. The AHP has found widespread application in the field of transportation. In 2009, Turan Arslan [22] proposed a hybrid model combining fuzzy logic and AHP for evaluating public transportation projects. In the same year, A. Awasthi et al. [23] introduced a mixed method based on AHP and belief theory to evaluate sustainable transportation solutions. In 2010, Henrikas Sivileviˇcius et al. [24] utilized the AHP method to establish standards and grades for the quality of railway passenger transport. Also in 2010, Jeffrey Shelton et al. [25] presented a simplified approach for prioritizing transportation projects using an integrated multi-criteria decision-making (MCDM) process, accommodating differing opinions from multiple decision-makers. Mohammad Hemati et al. [26] proposed an empirical method based on integrated Kano and fuzzy analytic hierarchy processes in 2011, collecting customer opinions through questionnaires and implementing this approach in a case study of actual transport planning. In 2014, Mesut Kumru et al. [27] applied the AHP model to select the most suitable transportation mode between two locations in Turkey for a logistics company. Also in 2014, Omkarprasad Vaidya [28] used the AHP to assess the relative performance of public transport organizations across 26 cities in India. In the same year, Özge Nalan Bili¸sik et al. [29] employed fuzzy AHP to specify and weight various criteria for garage location selection, determining optimal maintenance and repair activities for Istanbul’s public transit system. Michelle R. Oswald Beiler et al. [30], in 2015, utilized an integrated GIS (Geographic Information System) and AHP to determine sustainability indicators addressing environmental, economic, and social factors within transportation projects such as rail or public transit networks. Jacek ˙Zak et al. [31] conducted multi-level evaluations with multiple criteria for urban transportation projects in 2015, using methods including AHP and power line III/IV combination techniques. Saul Germano Rabello concerning Brazil’s transportation infrastructure by applying the AHP. An T. Nguyen et al. [33] identified six key components of complexity in transportation projects: social and political, environmental, organizational, infrastructure, technical, and scope complexity. The project weights and complexity parameters were determined using the fuzzy AHP in 2015. In 2016, Polat Yaliniz et al. [34] utilized the AHP method to assess parking and ride- sharing systems, as well as other relevant scenarios. Yavuz Ozdemir et al. [35] investigated the procurement of airplanes by Turkish Airlines using fuzzy numbers and conducted an evaluation employing multi-criteria decision-making techniques such as a fuzzy ANP and Choquet integral; the results were compared using the fuzzy AHP in 2016. In 2017, Omer Soner et al. [36] proposed a hybrid approach integrating the AHP method with VIKOR technology for application in the maritime transport industry. In 2018, Rajesh Kr. Singh et al. [37] introduced a hybrid model combining the fuzzy AHP and fuzzy TOPSIS for selecting suitable third-party logistics providers to outsource logistics activities for perishable products. Also in 2018, Luyuan Chen et al. [38] proposed an improved method based on the AHP and Dempster–Shafer evidence theory (DS theory) for evaluating the impact of transportation measures on urban sustainability. In their approach, the AHP was used to determine sustainability criteria weights, while DS theory was employed for data fusion during sustainability assessment. Erkan Celik et al. [39], in 2018, developed an integrated MCDM method based on interval type-2 fuzzy sets (IT2FS) for selecting suitable shiploader types in marine transportation. This method combines the IT2FS environment with the AHP and technique for order preference by similarity to ideal solution (TOPSIS) to address uncertainty in judgments and expressions of multiple experts in decision-making. In 2019, Szabolcs Duleba et al. [40] investigated the Pareto optimality of real data pair comparison matrices obtained from a survey using the AHP for public transportation analysis. In 2019, Haocheng Zheng et al. [41] introduced a data-driven approach based on driving state information collected from the road transportation industry to explore driving behaviors that impact safety and energy efficiency. They also constructed an integrated driving safety evaluation index system using the AHP. In 2020, Qian Zhang et al. [42] developed an AHP model to assess the potential likelihood and impact of landslides on traffic network vulnerability. Also in 2020, Mouhamed Bayane Bouraima et al. [43] applied a combination of the SWOT matrix and the AHP to evaluate priority factors and used these in formulating a development strategy for the railway transportation system. In 2021, Aoonrot Choosakun et al. [44] developed an evaluation framework for intelligent public transportation systems in the Bangkok metropolitan area using the fuzzy AHP. Ertugrul Ayyildiz et al. [45], also in 2021, employed the Pythagorean fuzzy AHP to identify critical risk factors and their weights for hazardous material transport operations. In 2022, Nezir Aydin et al. [46] proposed an integrated fuzzy MCDM method that combines the interval type-2 fuzzy AHP and interval type-2 fuzzy weighted aggregation and product assessment (WASPAS) to select the optimal location for a new transportation hub on the Anatolian side of Istanbul. In 2023, Vali Sarsangi et al. [47] prioritized risk factors associated with road In addition, the AHP has seen new developments in recent years. Sarbast Moslem [48] developed a novel simplified AHP, known as P-AHP, within a spherical fuzzy environ- ment to provide sustainable and efficient solutions for improving the public bus transport system in Dublin, Ireland. This method integrates P-AHP and spherical fuzzy sets (SF sets) within a unified framework, offering a more robust approach to addressing complex urban transportation issues. By introducing spherical fuzzy sets, decision-makers can express their preferences and uncertainties more comprehensively, thereby enhancing the reliability and accuracy of decision-making. The P-SF-AHP model is scalable and suitable for addressing larger-scale and more intricate urban transportation planning problems. However, using the P-SF-AHP model requires decision-makers to understand and apply concepts and methods related to spherical fuzzy sets, which may necessitate learning and adaptation. Additionally, the P-SF-AHP model may demand higher levels of accuracy and decision-makers. Sarbast Moslem, Danish Farooq et al. [49] employed a novel spherical decision model to assess the degree of preference separation among driving behavior factors associated with road traffic accidents. In the study, the researchers utilized the AHP and spherical fuzzy sets (SFSs) based on fuzzy logic to evaluate driver behavior preferences. The use of spherical fuzzy sets allowed for the representation of drivers’ preferences for different behavioral factors, considering the distribution of preferences on a circular scale. This evaluation method enhances our understanding of the relationship between driver behavior and road safety. By quantitatively assessing driver behavior factors, we can determine the extent of drivers’ preferences for different behavioral factors, which aids in understanding their focus and priorities regarding road safety. Moreover, employing spherical fuzzy sets improves the accuracy of evaluations and provides a better reflection of drivers’ preference distributions, further strengthening our comprehension of the re- lationship between driver behavior and road safety. Sarbast Moslem, Yakup Çelikbilek et al. [50] introduced a comprehensive grey AHP-MOORA model for improving the quality of public transportation services. The study utilized the grey AHP method to assess the importance of primary criteria and sub-criteria and employed the grey MOORA method to evaluate various alternative solutions for public transportation services. The grey MOORA method addresses multi-objective optimization problems by comparing and ranking differ- ent alternative solutions to identify the optimal one. However, it should be noted that the results of the grey AHP-MOORA model are presented as grey numbers, which may add complexity and pose challenges for interpretation. The model developed in this study can support strategic decision-making plans aimed at enhancing urban transport systems and has potential applicability to public transportation systems in other countries and cities as well. Sarbast Moslem, Muhammet Gul et al. [51] employed a method that combines the best–worst method (BWM) and triangular fuzzy sets to rank and prioritize critical driving behavior guidelines. Initially, the F-BWM model was used to assess driving behavior factors and calculate weight scores. Subsequently, the reliability of the prioritization crite- ria was validated by examining consistency within the F-BWM framework. Throughout this process, fuzzy reference comparison and fuzzy preference were utilized to identify the most and least important factors. Following this, a nonlinear constrained model was applied to compute optimal fuzzy weights for all primary factors. Ultimately, consistency ratios were computed to evaluate result coherence. This integrated approach, utilizing the BWM and triangular fuzzy sets for ranking and prioritization, helps to reduce evaluation time and comparison frequency while enhancing overall model efficiency. However, it is worth noting that the BWM may become intricate and challenging when dealing with large decision problems. Additionally, these methods require suitable data inputs and parameter selection, and the BWM’s effectiveness relies on decision-makers’ professional knowledge and experience. Insufficient expertise or experience among decision-makers could potentially impact decision accuracy. Consequently, careful consideration in selecting these methods, along with thorough result interpretation and integration with real-world contexts, is imperative during application. In the study conducted by Muhammed Ordu and Oguzhan Der [52], the AHP was effectively utilized for selecting manufacturing ma- terials for flexible pulsating heat pipes (FPHPs). A multi-level decision-making model was established to decompose the material selection process into a structured hierarchy considerations of environmental sustainability. By employing this methodology, the study not only enhanced the transparency of the decision-making process but also ensured the rationality and effectiveness of the final outcomes. In their 2024 study, Bulut, M.S., Ordu, M., Der, O., and Basar, G. [53] introduced a systematic approach to selecting thermoplastic materials for hybrid vehicle battery packs by leveraging comparative MCDM methods. To ensure that the selected materials met both technical requirements and sustainability goals, the SWARA method was employed to determine the importance weights of the eval- uation criteria. SWARA allocated these weights by systematically comparing the relative significance of each criterion against others, thus providing a robust quantitative frame- work for material selection. In the decision-making phase, three MCDM methods—ARAS, EDAS, and TOPSIS—were applied to evaluate and rank the thermoplastic materials. The ARAS method established a direct link between the utility functions of alternatives and the influence of primary criteria, while the EDAS method assessed alternatives based on positive and negative distances to an average solution. TOPSIS evaluated the alternatives by measuring their proximity to the ideal best and worst solutions. The adoption of these methods was motivated by their effectiveness in addressing complex decision-making chal- lenges, particularly those involving multiple and often conflicting criteria. By holistically considering performance, safety, and sustainability, the study provided valuable insights for manufacturers in material selection and laid a solid foundation for future research into emerging materials and decision-making frameworks. Furthermore, the proposed approach contributes to the sustainable development of hybrid vehicle technologies, with significant implications for material selection in the automotive industry.",
    "While previous research has explored various multi-criteria decision-making methods (such as the AHP, fuzzy logic, and grey system theory) in transportation projects, there has been limited application of these methods specifically to the evaluation of transportation safety supervision effectiveness. The main contribution of this research lies in the devel- opment of a comprehensive evaluation index system, incorporating both criterion-level and factor-level indicators. By combining grey system theory with AHP, a hierarchical grey evaluation model is constructed, offering a novel approach to systematically assess transportation safety supervision. This study provides a validated, quantifiable framework that can be applied in future evaluations, along with practical suggestions for improving safety supervision practices based on the empirical findings. This study addresses the evaluation of TSS, an important but underexplored area in transportation research. As transportation networks become increasingly complex, effective safety supervision is critical to ensure public safety and efficient operation. While much of the existing research has concentrated on transportation project planning and prioritization, there has been a lack of systematic evaluation specifically targeting the effectiveness of safety supervision. This study fills that gap by developing a tailored evaluation model based on the grey AHP for assessing TSS in Henan Province. The proposed framework not only provides a quantitative tool to measure the performance of safety supervision but also helps identify areas of weakness in the current system. The necessity of such an evaluation is clear: ensuring safety supervision is not only vital for public protection but also for optimizing resource allocation in regulatory practices, especially in the face of evolving transportation challenges. The grey AHP, which integrates grey theory with AHP, facilitates a comprehensive consideration of multiple evaluation indicators and mitigates the influence of expert subjective judgments on outcomes. Utilizing the grey AHP for assessing the traffic safety supervision system involves incorporating grey processing into weights and decision matrices while accounting for uncertain factors during the evaluation process. This approach helps to reduce subjectivity in evaluations and enhance the reliability of assessment results. The grey AHP is adept at synthesizing disparate information into weighted vectors that represent various degrees of uncertainty, thereby converting them into a unified format. This method has demonstrated considerable efficacy in system evaluation and analysis, providing valuable insights in complex evaluative contexts [54]. Approaching from a systems engineering perspective, the present research delves into the many factors critical for the evaluation of TSS. Drawing on the real-world context provided by a safety supervision survey questionnaire completed by transportation industry authorities of Henan Province, China, the AHP is utilized to devise an evaluation model for TSS. This model includes a comprehensive set of indicators that influence the assessment of the current state of TSS. Furthermore, the TSS landscape in Henan Province is exhaustively evaluated by integrating the principles of grey system theory. This thorough examination offers vital insights and a substantial reference for the evaluation of, and decision-making processes in, TSS. The comprehensive evaluation of TSS via the grey AHP and the mathematical thinking process can clarify the analysis process and improve the scientificity of the results. The remainder of this paper is organized as follows: Section 2 introduces the methods and models used for evaluating the transportation supervision system and establishes the evaluation framework. Section 3 presents a case study, including the calculation and analysis of the evaluation results. Section 4 provides a discussion of the evaluation results and offers recommendations based on the findings. Finally, Section 5 concludes this study by summarizing the key outcomes. The construction of the evaluation index system for TSS is predicated on an in-depth understanding of the actual state of safety production in the transport sector, which is intertwined with established theories of safety supervision and evaluation. Adhering to the principles of systematicity, scientificity, objectivity, and comprehensiveness [55], this system not only facilitates a rational analysis of the TSS system, but also ensures that the selection and determination of evaluation indicators comprehensively encapsulate the impact of a multitude of objective factors. To comprehensively reflect the status quo of TSS in Henan Province, the overall status quo of TSS supervision units at all levels, the status quo of the supervision subjects, the status quo of the production base, the level of supervision, and the status quo of the safety production service capacity are investigated. According to a survey, the overall situation of the TSS by supervision units at all levels mainly includes the commendation situation, the safety hidden danger situation, and overall self-rating. The current situation of the main body of supervision mainly involves the organization, the supervision content, personnel and equipment funding problems, the management level, etc. The basic component of safety production mainly consists of the number of transportation enterprises, the standardization of safety production, the situation of full-time safety personnel, and the occurrence of accidents and casualties in the transportation field. Finally, the supervision level and safety production service ability mainly include the responsibilities of safety management, problems in safety supervision performance assessment methods, and key considerations.",
    "The primary respondents of this questionnaire survey were transportation bureaus from prefecture-level cities and directly administered county-level cities in Henan Province. The survey covered various unit types, including safety management departments, trans- portation management departments, construction management departments, and other related entities, reflecting the core functional areas of transportation authorities. Of the respondents, 50% were from safety management departments, while over 38% represented transportation management departments. A total of 25 questionnaires were distributed, yielding 24 valid responses, with an effective response rate exceeding 95%. Respondents included 9 unit directors, 7 safety management leaders, 4 department heads, and 4 general staff members, with an average age of 35 years. Notably, department heads and safety management leaders comprised more than 65% of the total respondents. Therefore, the content of the questionnaire is not only accurate and reliable, but also has strong authority. This has a guiding effect on the construction of the TSS evaluation index system while avoiding the emergence of impractical evaluation indicators or evaluation requirements Based on the AHP, with reference to the Production Safety Law, via data research and expert consultation, and in comprehensive consideration of the actual situation of the TSS system, the status of TSS was taken as the target layer. Four primary indicators, namely, the overall status of TSS by units at all levels, the status of the supervision subjects, the base of production at the grassroots level, and the supervision level and status of production safety serviceability, constituted the criterion layer. Finally, 25 secondary indicators constituted the factor layer. This index system, as shown in Table 1, can be used to reasonably and effectively conduct a comprehensive evaluation of TSS. The established TSS evaluation system is divided into three levels. According to the principle of the AHP, each group, as a hierarchy, forms a three-layer evaluation index system based on the combination of the objective layer (A), the criterion layer (Bi, i = 1, 2, 3, 4), and the factor layer (Cij, i = 1, 2, 3, 4; j = 1, 2, 3, . . ., ni) [56,57]. S is the comprehensive evaluation value of the evaluated object, while B represents the set of criterion-layer indicators Bi, denoted as B = {B1, B2, B3, B4}. Finally, Ci (i = 1, 2, 3, 4) represents the set of factor-layer indicators Cij, denoted as Ci = {Ci1, Ci2, Ci3, . . ., Cin}. Figure 1 shows the steps of the grey AHP. The proposed grey AHP method used in this study is introduced step by step below. In the evaluation of the current situation of TSS, because Cij is a qualitative indicator, a unified evaluation standard has yet to be formed. Therefore, after assigning a score value, the evaluation indicator Cij is comprehensively compared and evaluated by formulating a scoring grade index. The judgment matrix is established according to the AHP; its consistency is then tested, and the eigenvector is calculated after the normalization of the matrix. Second, the weight coefficient WA of Bi and the weight coefficient Ni of Cij are determined via the AHP. Suppose that the number of experts participating in the evaluation is k (k = 1, 2, 3, . . ., q), i.e., q experts are organized to participate in the assessment and scoring of various indicators according to the actual situation and the experience of the questionnaire. The evaluation matrix of the experts is then established. According to the evaluation results of the eval- uation experts, i.e., according to the rating dijk given by the K-th expert on the indicator Cij of the evaluated object, the evaluation sample matrix D of the evaluated object can be obtained. The number of grey evaluation levels, the grey numbers, and the whitening weight function of grey classes for the evaluation indicators are among the factors that determine the evaluation of grey classes [58]. In the present study, the relevant parameters are determined according to the analysis of the actual evaluation problems. According to the evaluation grade index, four grey evaluation classes are adopted. The grey serial number is denoted as e; e = 1, 2, 3, 4, which, respectively, represent the four grades of “excellent”, “good”, “medium”, and “poor”. The corresponding grey numbers and whitening weight functions are as follows: The first grey class is “excellent” (e = 1). The grey number is set as ⊗1 ∈ [d1,∞] and the whitening weight function is f1(˙). The expression is as follows: The second grey class is “good” (e = 2). The grey number is set as ⊗2 ∈ [0,d2,2d2] and the whitening weight function is f2(˙). The expression is as follows: The third grey class is “medium” (e = 3). The grey number is set as ⊗3 ∈ [0,d3,2d3] and the whitening weight function is f3(˙). The expression is as follows: The fourth grey class is “poor” (e = 4). The grey number is set as ⊗4 ∈ [0,d4,2d4] and the whitening weight function is f4(˙). The expression is as follows: For the indicator Cij in the evaluation system, the evaluation coefficient of Cij be- longing to the e-th grey evaluation class is denoted as Xije. The total number of grey evaluations belonging to each grey evaluation class can be denoted as Xij. Then, the following equations hold: In this research, there are four grey evaluation classes, namely, e = 1, 2, 3, 4. Therefore, the grey evaluation weight vector rij of the evaluation indicator Cij of the evaluated object for each grey class can be obtained as follows: After synthesizing the grey evaluation weight vectors of the evaluation indicator Cij for each evaluation, the grey evaluation weight matrix Ri of Cij for each grey evaluation class can be obtained as follows.",
    "The comprehensive evaluation results can be obtained from the weight coefficient Ni of the evaluation indicator Cij and its grey evaluation weight matrix Ri for each grey evaluation class, as follows: The grey evaluation weight matrix R of the target-layer indicator A for each grey evaluation class can be calculated from the comprehensive evaluation result Mi of the criterion-level indicator Bi, as follows: Based on the comprehensive evaluation results U, the vector V can be obtained by assigning values to each grey class according to the “grey level”. In this research, V is set to V = (4, 3, 2, 1), so the comprehensive evaluation value S can be calculated as follows: The validity qualification of evaluating TSS is determined as S0. If S ≥ S0, it indicates that the evaluation of TSS is effective; if S < S0, it indicates that the results of the TSS evaluation model are invalid. After calculating the comprehensive evaluation value, the evaluation value of each level of the evaluation index is calculated. The evaluation values of the secondary indicators are calculated with the grey weight matrix and the grey equal- ization vector, after which the evaluation values of the primary indicators are calculated. Based on the questionnaire on the current state of TSS in Henan Province, hierarchical grey theory was applied to evaluate the effectiveness of TSS. The evaluation indicator Cij is divided into four grades, namely, excellent, good, medium, and poor, which are, respectively, assigned 4, 3, 2, and 1 points. When the evaluation index is between two adjacent levels, the corresponding assigned scores are 3.5, 2.5, and 1.5. The specific grade criteria are determined by each participating expert based on experience and in combination with the questionnaire. To reduce the influence of subjective factors on the evaluation system, hierarchical analysis was utilized to determine the eigenvectors, which in turn allowed for the determi- nation of the weight coefficients of the evaluation indicators Bi and Cij. First, the judgment matrix was established according to the hierarchical analysis method. Second, the matrix consistency was checked by MATLAB R2014b software, and the normalized eigenvectors were derived [59]. Finally, the weight vectors of each evaluation index were obtained as below. The weights of indicators at all levels are presented as bar charts, as depicted in Figures 2 and 3. Ten esteemed specialists in the realm of TSS were invited to conduct a thorough evaluation and scoring of the indicators pertinent to Henan Province’s current TSS system. By utilizing the expert rating forms completed by these professionals, a sample matrix was generated for the indicators of the evaluation system. This structured approach ensures a comprehensive and expert-driven assessment of the effectiveness of the system. The first grey class is “excellent” (e = 1), the grey number is ⊗1 ∈ [4,∞], and the whitening weight function is f1. The second grey class is “good” (e = 2), the grey number is ⊗2 ∈ [0,3,6], and the whitening weight function is f2. The third grey class is “medium” (e = 3), the grey number is ⊗3 ∈ [0,2,4], and the whitening weight function is f3. Finally, the fourth grey class is “poor” (e = 4), the grey number is ⊗4 ∈ [0,1,2], and the whitening weight function is f4. For the evaluation indicator C11, the grey evaluation coefficient X11e for the e-th grey evaluation class in the evaluation system is as follows: X111 = ∑10 k=1 f1(d11k) = f1(3)+f1(3) + f1(2.5) + f1(3.5) + f1(3.5) + f1(3) + f1(2.5) + f1(3)+ f1(3) + f1(2.5) = 3/4 + 3/4 + 2.5/4 + 3.5/4 + 3.5/4 + 3/4 + 3/4 + 2.5/4 = 7.375 Similarly, the grey evaluation coefficients and the total grey evaluation coefficients of the other indicators within the evaluation system were obtained, as reported in Table 2. Taking the evaluation indicator C11 as an example, the grey evaluation weight vector r11 corresponding to the total grey evaluation coefficients X11 (e = 1, 2, 3, 4) belonging to each grey evaluation class of this TSS system is as follows: Grey vectors representing assessment weights may also be obtained for other evalua- tion indicators inside the assessment system. The grey evaluation weight matrices R1, R2, R3, and R4 corresponding to each indicator Bi (i = 1, 2, 3, 4) in the criterion layer of this evaluation system were derived according to the grey evaluation weight vector of each indicator as follows: The results of the integrated evaluation of indicator Bi were obtained as Mi = Ni × Ri = (bii1, bii2, bii3, bii4) as follows: The comprehensive evaluation results were calculated from the total grey evaluation weight matrix R = [M1, M2, M3, M4]T of this evaluation system as follows: The hierarchical evaluation vector of each grey evaluation class was set as V = (4, 3, 2, 1), and the comprehensive evaluation value of the effectiveness of this evaluation system was calculated as follows: If all the participating scoring experts believe that each evaluation indicator Cij is 2, then the effectiveness of the evaluated system is qualified as S0 = 2.777; if all the experts believe that each evaluation indicator Cij is 3, then the corresponding effective value is S0 = 3.111; if all the experts believe that each evaluation indicator Cij is 4, then the corresponding effective value is S0 = 3.600. Therefore, for the qualified evaluation object, the comprehensive evaluation range is 2.777 ≤ S ≤ 3.600, as shown in Table 3.",
    "According to the comprehensive safety assessment value obtained in the previous step, the current TSS system in Henan Province can be judged as being in overall good condition. However, in actual production, decision-makers must know not only the overall safety level of the evaluation system, but also which aspects of the entire system are sufficient, and which aspects could be stronger. It is necessary to know the evaluation values of indicators at all levels to determine the advantages and weaknesses of the current TSS system in Henan Province, and ultimately to take corresponding rectification measures to improve the safety status. The evaluation values of the secondary indicators were calculated by using the grey weight matrix and the grey equalization vector of the secondary indicators as follows: Similarly, according to the preceding steps, the evaluation results of the correspond- ing primary indicators were obtained based on the calculation of the other second-level indicators, as reported in Tables 4–8. The results demonstrate that the overall evaluation of the effectiveness of the current TSS system in Henan Province is level 2, indicating a good state. The results show that under the current transport supervision system, the TSS departments at all levels in Henan Province perform their duties well; thus, the current form of TSS in the province is in a safe state. However, some aspects still exhibit deficiencies. The TSS departments in some counties and cities in Henan Province are not clear about the division of the supervision content with their neighboring cities and counties, indicating a vague scope of work. Furthermore, the annual safety funding and equipment of the TSS departments of some areas of Henan Province do not meet the needs of daily supervision work. Therefore, the TSS departments should increase the annual safety production funds of each unit and improve vehicles and other equipment to meet these needs. By calculating the evaluation values of the primary and secondary indicators, the evaluation value of each index is obtained. From the result table, it can be observed that the overall situation of TSS at all levels of unit B1 scores higher than that of unit B2. According to Table 4, the evaluation value of unit B1 is the highest among the primary indicators, while the evaluation value of unit B2 is lower. This indicates that although the overall situation of traffic safety supervision and management at all levels of the units is good, there is still a need to strengthen the management of TSS subjects at all levels. The evaluation values of each secondary indicator in Table 5 are relatively high. From Table 6, it can be seen that the evaluation values of C21, C213, and C22 are lower, suggesting that the traffic safety supervision units at all levels should establish a safety production committee and hold regular safety meetings. This approach enhances the management and supervision of safety production in the transportation field, improving the ability to prevent accidents and respond to emergencies. Regular safety meetings facilitate the prompt dissemination of relevant policies, regulations, case studies, and the latest safety technology information, promoting the sharing of experiences and learning among industry peers. Additionally, regular safety production work conferences should be held to review safety production reports from relevant units. The content of these meetings includes, but is not limited to, checking and summarizing the safety responsibilities of each department and position, analyzing recent accidents and hazard elimination and rectification situations, and discussing and formulating the next stage’s safety goals and measures. As shown in Table 7, the evaluation results of C35 and C36 are relatively low. Therefore, relevant departments should strengthen traffic supervision by increasing inspection and enforcement efforts, improving traffic management facilities, and comprehensively enhancing the supervision and management of road traffic safety. Targeted monitoring and control of areas with high accident rates can be achieved by setting up warning signs, optimizing road design, and improving road conditions to reduce the accident and casualty rates. Furthermore, with the support of science and technology, advanced technological means such as intelligent traffic monitoring systems and vehicle active safety assistance systems can be promoted to improve the efficiency and level of road traffic management. By comprehensively applying various measures and continuously improving them, it is anticipated that the accident rate and casualty rate of road traffic accidents will be effectively reduced, thereby ensuring social public safety and maintaining order stability. As shown in Table 8, the evaluation value of C42 is relatively low. Therefore, it is necessary to strengthen the management of the performance evaluation and appraisal process within the supervision and management of transportation safety to ensure the objectivity and fairness of the evaluation. Efforts should be made to enhance the tracking and analysis of the implementation of various supervisory measures to promptly identify and address problems effectively. Transparency and openness in information should be emphasized in the management process, allowing for all sectors of society to understand relevant policies, data, and outcomes, and to provide oversight and feedback. The ultimate goal is to achieve a sustained and stable improvement in safety within the transportation sector, providing more reliable, convenient, and safe assurances for public travel. As depicted in Figure 4, the evaluation values of C26, C23, C25, C27, and C212 are also relatively low. Therefore, the traffic safety supervision department should initiate a special rectification campaign and issue an official document outlining This study employs the grey hierarchical analysis model to research the transportation safety supervision system. This approach not only provides valuable reference experience for various countries and cities but also fosters cross-regional and cross-industry coop- eration and exchange. The grey hierarchical analysis model is a multi-factor, multi-level decision-making method with broad applicability in transportation safety supervision. This model enables the systematic and scientific evaluation and analysis of various factors in- volved in transportation safety supervision. By conducting in-depth research and analysis of the actual situations in different regions and integrating the scientific evaluation methods offered by the grey hierarchical analysis model, we can identify and address numerous issues in the field of transportation. The establishment of the transportation safety supervi- sion evaluation system and the selection of indicators in this study can serve as a reference for relevant departments. Transportation safety remains a prominent societal issue. With the acceleration of urbanization, the increasing number of vehicles, and the expansion of road construction, traffic management faces increasingly complex and severe challenges. Therefore, establishing a scientific and reasonable transportation safety supervision evalua- tion system is of paramount importance. In practice, relevant departments can refer to the methods and experiences proposed in this study and make appropriate adjustments based on local characteristics and actual conditions before implementing them. The evaluation results of the grey hierarchical model for the transportation safety supervision system offer valuable insights for relevant departments, aiding them in identifying the shortcomings of the current transportation supervision system and formulating targeted improvement mea- sures. Additionally, this study can encourage relevant departments to enhance information sharing, communication, and cooperation mechanisms, fostering a multi-party linkage and comprehensive governance approach. This approach will contribute to achieving smooth roads, orderly traffic, and safe pedestrian travel, and to establishing a more effective and sustainable transportation management system.",
    "This study developed a grey hierarchical analysis evaluation model, exemplified it via specific cases, and identified the indicators and factors within the model, which is characterized by a well-defined hierarchy and clear structure. The following conclusions were drawn from the findings: Via the evaluation of the primary and secondary indicators, the weak points of the TSS system were revealed, and the results indicate that the management of the TSS bodies at all levels should be strengthened. Author Contributions: Conceptualization, X.Z. and X.L.; Data curation, X.L.; Formal analysis, X.Z. and S.L. (Shuangqing Li); Funding acquisition, S.L. (Shuren Li); Investigation, S.L. (Shuren Li); Methodology, X.Z. and J.Y.; Project administration, S.L. (Shuren Li); Supervision, S.J. and J.Y.; Validation, S.L. (Shuangqing Li); Writing—original draft, X.Z.; Writing—review and editing, S.L. (Shuangqing Li) and S.J. All authors have read and agreed to the published version of the manuscript. Funding: This research was funded by the Project of the Henan Provincial Department of Transporta- tion, grant number 2018G11 and the Key Science and Technology Project of Henan Province, grant number 212102310937."
]