[
    "Abstract: Black carbon (BC) aerosols are important for absorbing aerosols, affecting global climate change and regional air quality, and potentially harming human health. From March to May 2023, we investigated black carbon aerosol levels and air pollution in Beijing. Employing methods such as linear regression, Potential Source Contribution Function (PSCF) and Concentration-Weighted Trajectory (CWT), we analyzed the characteristics and sources of black carbon aerosols in the region. Results indicate that the light absorption coefficients of BC and BrC decrease with increasing wavelength, with BrC accounting for less than 40% at 370 nm. Daily variations in BC and PM? 5 concentrations exhibit similar trends, peaking in March, and BC displays a distinct bimodal hourly concentration structure during this period. Aethalometer model results suggest that liquid fuel combustion contributes significantly to black carbon (1.08 + 0.71 ug-m~°), surpassing the contribution from solid fuel combustion (0.31 + 0.2 yg-m~3). Furthermore, the significant positive correlation between BC and CO suggests that BC emissions in Beijing predominantly result from liquid fuel combustion. Potential source area analysis indicates that air masses of spring in Beijing mainly originate from the northwest (40.93%), while potential source areas for BC are predominantly distributed in the Beijing— Tianjin—Hebei region, as well as parts of the Shandong, Shanxi and Henan provinces. Moreover, this study reveals that dust processes during spring in Beijing have a limited impact on black carbon concentrations. This study’s findings support controlling pollution in Beijing and improving regional air quality. Citation: Lei, W.; Li, X.; Yin, Z.; Zhang, L.; Zhao, W. Pollution Characteristics and Source Apportionment of Black Carbon Aerosols during Spring in Beijing. Toxics 2024, 12, 202. https:// doi-org /10.3390/toxics12030202 Copyright: © 2024 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). In recent years, widespread atmospheric aerosol pollution characterized by significant spatial variation and complex chemical composition has emerged as a pressing global concern. This issue affects both China and the world at large [1], influencing global and regional climate dynamics and posing risks to public health [2]. Consequently, aerosols have garnered substantial attention within the field of atmospheric science. Among these aerosols, BC is a dominant anthropogenic source and plays a pivotal role in shaping the global atmospheric climate [3]. Black carbon aerosols primarily originate from the incomplete combustion of carbon- containing fossil fuels and biomass, which can be classified into natural and anthropogenic sources. While natural events such as volcanic eruptions and forest fires constitute sig- nificant natural sources of black carbon emissions, their sporadic occurrences contribute minimally to long-term background concentrations of black carbon in the atmosphere [4]. In contrast, anthropogenic sources release black carbon on a broader and more persistent scale. BC, often a component of PM) 5, possesses chemical inertness, typically exists at sub-micron sizes, and has an extended atmospheric lifespan. Thus, BC serves as a valuable indicator of human impact on the atmosphere and facilitates the tracking of polluted air masses originating from diverse source regions. Moreover, due to its small particle size and suspension capabilities, BC can directly infiltrate human respiratory tracts and alveoli, leading to a range of health issues and posing a significant threat to public well-being [5-7]. and suspension capabilities, BC can directly infiltrate human respiratory tracts and alveoli, leading to a range of health issues and posing a significant threat to public well-being [5-7]. While atmospheric BC concentrations are generally low and exhibit uneven global dis- tribution, BC exerts a potent solar radiation absorption effect across the visible and infrared spectra. By absorbing and scattering light at varying wavelengths, black carbon alters local atmospheric stability and vertical structures, thereby influencing regional weather patterns and global atmospheric circulation [8]. Current research, both domestic and international, has predominantly explored temporal variations in BC concentration, key influencing actors, source analyses, as well as the radiative forcing and climatic implications of BC aerosols. Analyzing BC concentrations across different locations in Mexico, Peralta et al. [9] ‘ound a strong correlation between BC and CO concentrations in urban areas, with the correlation being more pronounced than in suburban and high-altitude regions. Similarly, Barman and Gokhale [10] used BC data obtained from 2016 to 2017 in Guwahati, India, ‘o study the deposition of BC concentration under different meteorological conditions, and applied the mixed single-particle Lagrangian integral trajectory (HYSPLIT) model ‘0 analyze the area and source distribution of BC possible deposition. Furthermore, Li et al. [11] conducted continuous BC and BrC measurements during the heating season in Beijing. They employed trajectory calculations via the HYSPLIT model and employed he Concentration-Weighted Trajectory (CWT) model, as well as the MODIS fire point map, to analyze potential pollution sources. Several studies have highlighted the role of black carbon aerosols in impeding the development of the atmospheric boundary layer by altering surface radiation energy balances and heating the boundary layer top, thereby exacerbating severe haze pollution in urban centers [12-14]. Given its status as one of the world’s major black carbon emission centers [15,16], China plays a pivotal role in shaping global atmospheric conditions and climate dynamics. Beijing, as China’s political, cultural and technological epicenter and the core city of the Beijing—Tianjin—Hebei economic zone, is characterized by extensive industrial development, a substantial population and a high volume of motor vehicles. The substantial consumption of fossil fuels has led to increased BC aerosol emissions [17,18]. Moreover, Beijing’s warm temperate monsoon climate, char- acterized by minimal spring rainfall and dry, windy conditions, exacerbates the occurrence of pollution-related weather events [19]. Therefore, a comprehensive analysis of BC aerosol pollution characteristics and potential sources in the atmosphere of Beijing’s urban area during spring holds profound significance for improving regional atmospheric conditions. In this study, we employed observational data, encompassing BC concentrations, to scrutinize the optical characteristics of aerosols and the concentration patterns of BC during the spring season in Beijing’s urban area. We conducted linear regression analyses In this study, we employed observational data, encompassing BC concentrations, to scrutinize the optical characteristics of aerosols and the concentration patterns of BC during the spring season in Beijing’s urban area. We conducted linear regression analyses correlating BC concentrations with atmospheric pollutants (NO2, CO, O3). Subsequently, we applied the Potential Source Contribution Function (PSCF) and CWT methods to delineate the potential source regions of BC and assess whether dust weather exerts an influence on BC concentrations in Beijing.",
    "The instrument was positioned on the third-floor platform of the experimental building at Beijing Capital Normal University (39.9302° W, 116.3034° E). It is situated at an elevation of approximately 10 m above ground level. The sampling site (Figure 1) is surrounded by residential areas and schools, with its eastern side in close proximity to the main road. To a considerable extent, the data collected from this monitoring site serves as a representation of the atmospheric black carbon aerosol pollution levels within Beijing’s urban area. In this research, a black carbon meter (AE33, Magee Scientific, Berkeley, CA, USA) was employed to measure the light absorption and the corresponding aerosol absorption concentration at seven distinct wavelengths (370, 470, 520, 590, 660, 880 and 950 nm). About the instrument, adopts two parallel point measurement technology and dynamic zero-point calibration, which provides almost real-time compensation for point loading effect. The detection limit is less than 0.005 ug-m-$ per hour, the detection accuracy of 0.03 ug-m-$ per minute and the concentration resolution of 0.001 ug-m-3, The measurements were conducted at a constant flow rate of 5 L/min and a temporal resolution of 1 min. Given that the absorption effect of BC dominates and the absorption efficiency of other aerosols can be disregarded at the 880 nm wavelength, the BC concentration was determined by monitoring the attenuation of the aerosol beam as it passed through a quartz fiber filter at 880 nm. Data collection occurred during the spring season of 2023, spanning from March 1 to May 22. After eliminating data recorded during special meteorological conditions, power outages and other factors, a total of 78,840 min of valid data was retained for analysis. The daily and monthly mean values of BC, PM)5 and PM) are calculated from the hourly mean data. Meteorological parameters such as temperature (°C), wind speed (m/s) and wind direction were measured using the automatic weather observation equipment (CAWS600, HuaYun Group, Beijing, China) situated at the campus weather station. Concentrations of air pollutants (PMj9, PM25, NO2, O3, CO) were sourced from the automatic observation instrument (MW600, HuaYun Group, China) set up near the campus automatic weather station, and the time resolution is 1 h. Of these, the error range of PM5 and PM)p is less than 10%, and the error range of CO, O3 and NO; is less than 3%. These instruments are only 300 m away from the sampling site. In the formula, ¢,;, represents the mass absorption cross-section. Measured ¢;;, values at seven different wavelengths (370, 470, 520, 590, 660, 880 and 950 nm) are as follows: 18.47, 14.54, 13.14, 11.58, 10.35, 7.77 and 7.19 m?-g-!, respectively. Maca) denotes the black carbon mass concentration specific to a given wavelength, ng-m~?. Assuming negligible light absorption by dust, Abs(A) can be separated into BC ab- sorption and BrC absorption. Given the dominant absorption effect of BC at 880 nm and the negligible absorption efficiency of other aerosols, Absgc(A) and Absg,c(A) at other wavelengths can be estimated using the following formulas. Absgc (A) signifies the light absorption attributable to BC at a particular wavelength A, while Absg;c(A) represents the light absorption contribution of BrC at the same wavelength. AAEBC refers to the Angstrom index, which characterizes the spectral dependence of BC. In this study, a value of 1.1 was employed based on previous research [11]. Some scholars [20] contend that the incomplete combustion of liquid fuels (e.g., traffic emissions) and solid fuels (e.g., coal and biomass) are the two primary sources of black carbon aerosols in the atmosphere. The total absorption coefficient of BC at a specific wavelength can be expressed as follows: In this equation, Abs(A) liquid and Abs(A) solid Tepresent the black carbon absorption coefficient resulting from liquid fuel and solid fuel emissions, respectively. Additionally, AAEjiguiq and AAEsojiq are the wavelength exponents of the BC absorp- tion coefficients associated with liquid fuel and solid fuel. Based on the findings of Jing et al. [18], this study adopts the assumptions AAE liquid = 1.0 and AAE,o);q = 2.2. Conse- quently, the mass concentration of BC generated by liquid fuel and solid fuel emissions can be calculated using the above formula. CWT model is a method used to compute the potential pollution source regions for air pollutants and assess the degree of pollution along specific trajectories [21]. This approach involves the calculation of weighted concentrations for each grid point, taking into account the trajectories passing through the grid and the corresponding black carbon (BC) concentrations associated with each trajectory.",
    "Cij represents the average weighted concentration at grid point (i, j). N stands for the total number of trajectories passing through the grid (i, j), while C; denotes the BC mass concentration linked to the trajectory labeled as “!” that passes through the same grid and nj Tepresents the residence time associated with the ‘I-th’ trajectory as it passes through the grid. PSCF model is computed based on a spatial grid and is defined as the ratio of the number of endpoints (mij) of pollution air trajectories passing through a specific grid (ij) in the study area (when the feature values exceed a set pollution threshold) to the total number of endpoints (nij) passing through that grid. As PSCF is a conditional probability function, the uncertainty of PSCF values increases when the airflow residence time within each grid is short (indicating smaller mij values). Therefore, it is necessary to introduce an empirical weighting function, W(nij), for interval weighting and error reduction. The weight function, W(nij), is defined as follows: During CWT and PSCF analyses, air trajectories are divided into a 0.2° x 0.2° grid. Different colors represent the size of the weighted concentrations and weighted contribution functions within each grid cell. The results of both methods are visualized. PSCF and CWT analyses were calculated using Meteinfo Map 3.7.0 software. Meteorological parameters used by the software are sourced from NOAA's website (ftp:/ /arlftp.arlhq.noaa.gov /pub/ archives/gdas1 (accessed on 20 October 2023)), and fire point data are obtained from NASA's website (FIRMS—Creating Archive Download Request (nasa.gov) (accessed on 21 October 2023)). Figure 2a presents a box plot of the aerosol optical absorption (Abs) coefficient within the wavelength range of 370-950 nm. It is evident that the Abs value is highest at 370 nm and decreases as the wavelength increases. This trend has been confirmed in numerous pre- vious studies [11,22]. The average absorption coefficients for the seven wavelengths were as follows: 38.34 + 33.39 Mm~! (370 nm), 27.33 + 22.66 Mm! (470 nm), 22.51 + 8.05 Mm7! (520 nm), 17.89 + 13.12 Mm~! (590 nm), 15.69 + 11.52 Mm~! (660 nm), 11.1 + 8.17 Mm~! (880 nm) and 10.28 + 7.52 Mm! (950 nm), respectively. Figure 2b displays Absgc and Absprc at various wavelengths, showing a consistent gradual and steady decrease from ultraviolet to visible light, with Absprc being virtually non-existent at 880 and 950 nm. Consequently, previous studies have generally considered Absgc at 880 nm as pure BC absorption, while Absp;c at 370 nm represents BrC absorption [23,24]. The Absgc at 880 nm and Absg;c at 370 nm in spring were 10.82 + 6.8 Mm! and 11.47 + 10.87 Mm\", respectively. Figure 3 illustrates the daily average proportion of BrC and BC at 370 nm. Throughout the study period, the proportion of Absp,c, 370 nm was consistently less than 40%, with only a few exceptional days exceeding this threshold. The average proportion during spring was 28.57% + 5.47%, a result consistent with the spring online monitoring findings in Lanzhou [22]. Additionally, changes in aerosol sources, such as shifts in solid fuel combustion, may contribute to variations in Abs values [25,26]. Figure 4a illustrates the temporal evolution of daily average concentrations for BC and PM) 5 in Beijing during the spring of 2023. The daily average BC concentration stands at 1.39 + 0.87 ug-m-3, with a concentration range spanning from 0.36 to 3.83 ug-m79. In comparison, the daily average concentration of PM) 5 is recorded at 29.23 + 29.19 ug-m73, fluctuating between 2.62 and 141.88 ug-m-3 . Overall, the temporal trends in the daily average concentrations of BC and PM)5 exhibit a notable alignment. This coherence is attributed to the characteristic particle size of black carbon, ranging from 0.001 to 1.000 um, he BC which predominantly adsorbs onto PM) 5 particles. The linear analysis (Figure 4b) estab- lishes a statistically positive relationship between the hourly mean concentration of t! and the PM) 5 (r = 0.544), indicating that the trend of their concentration changes over time is basic consistent. Moreover, this study aggregates BC concentration data from diverse domestic and international cities during the same temporal window (Table 1). In contrast to Lanzhou, where BC concentrations in spring mirror those observed in Beijing, cities such as Xuzhou, Nanjing, Chongqing and Mexico City exhibit springtime average BC concentrations sur- passing 3.0 ug-m-3, Notably, in New Delhi, India, characterized by heightened pollution levels, BC concentrations during spring reach a peak of 6.33 ug-m->. This underscores that, relative to global urban centers, Beijing experiences relatively subdued levels of BC pollu- tion during the spring, underscoring the efficacy of implemented atmospheric pollution control measures.",
    "Figure displays monthly average changes PM 5 Beijing’s urban area during the spring of 2023. It is evident that the average concentration of BC and PM) 5 was highest in March, while the average concentration of BC remained relatively stable in April and May. This pattern is linked to the prevalence of dust events in Beijing during March, with external dust transport indirectly contributing to elevated PM) 5 concentrations. Figure 5b reveals a distinct bimodal structure in the hourly mean BC concentration, consistent with previous research [4,30,31]. The morning peak buildup commences at 6 o'clock, peaks at 9 o’clock and subsequently declines rapidly. This gradual accumulation of BC corresponds to increased traffic volume during the morning commute to work, coupled with the development of surface inversions a few hours after sunrise, leading to the reduced vertical mixing of primary pollutants [32,33]. Moreover, the diurnal variation in BC concentration manifests lower values during the afternoon period from 14:00 to 16:00. This phenomenon is attributable, firstly, to the diurnal fluctuations in boundary layer activity. As solar radiation intensifies over the course of the day, ground temperature gradually ascends, fostering heightened atmospheric turbulence and an elevation in the atmospheric boundary layer. Simultaneously, a marginal increase in wind speed facilitates the vertical transport and dispersion dilution of BC. Secondly, during this timeframe, a discernible reduction in vehicular traffic is observed in comparison to the morning and evening peak hours. In the evening, spanning from 17:00 to 23:00, BC concentrations exhibit a gradual ascent, stabilizing from 23:00 to 05:00 with a slight decline. This shifting trend is ascribed to lower nighttime temperatures, inducing an inversion in atmospheric conditions. Additionally, the influence of evening rush hour traffic contributes to the accumulation of BC within the boundary layer. During the nocturnal period until early morning, marked by diminished human activities, BC undergoes a settling process, resulting in a marginal reduction in its concentration [31,34]. In this study, the aethalometer model was employed to estimate the contributions of solid fuel (coal and biomass combustion) and liquid fuel (traffic emissions) to total BC emissions. As depicted in Figure 6, the concentration of BCjiquia during spring in Beijing was 1.08 + 0.71 pg-m73, exceeding that of BCojiq (0.31 + 0.2 ug-m~>). The BC, oi / BC ratio was consistently less than 40%, a finding consistent with the results presented in Figure 3, indicating that liquid fuel combustion is the primary source of black carbon during spring in Beijing. According to the Beijing Municipal Bureau of Statistics (https: / /tjj-.beijing.gov.cn/ (accessed on 30 October 2023)), as of the end of 2022, Beijing had 7.128 million motor vehicles, with less than 10% being new energy vehicles. Diesel and gasoline are the primary liquid fuels, with transportation being their largest consumer [35,36]. This further supports the idea that urban BC emissions primarily originate from liquid fuels. Moreover, the heating season in Beijing has ended, resulting in reduced coal consumption, and significant biomass burning activities that typically occur in spring, such as forest and grassland fires, as well as the burning of uncultivated and cultivated fields, have been rigorously controlled in the surrounding areas of Beijing. Figure 6. The characteristics of BC concentration by solid fuel and liquid fuel produced, as well as the trend of BC,ojiq /BC ratio in spring in Beijing urban area. The sources of black carbon emissions in urban areas are generally stable, primarily stemming from industrial fossil fuel combustion and traffic-related emissions. However, estimating black carbon emissions on a monthly or daily scale presents various challenges and uncertainties, including the determination of emission factors, maintaining emission inventories and the lack of monthly energy consumption data. Therefore, this study employs the correlation between hourly mean concentration of the BC and the atmospheric pollutants (NO2, 03, CO) to elucidate the potential sources of black carbon emissions in Beijing (Figure 7). The relationship between black carbon mass concentration and other pollutants can, to a certain extent, reflect the characteristics of emission sources. In general, the higher the correlation coefficient, the greater the similarity of emission sources [18,37]. The primary sources of CO in atmospheric pollutants are automobile exhaust emis- sions, while the primary source of NO) is industrial sources and traffic sources [9,18,38,39]. These two gaseous pollutants also exhibit a positive correlation with black carbon. How- ever, the correlation coefficients for CO (r = 0.812) with black carbon aerosols are larger than that of NO) (r = 0.436), suggesting that automobile exhaust significantly influences the concentration of black carbon in Beijing.",
    "In contrast to other pollutants, O; demonstrates a negative correlation with BC, al- though this correlation is not statistically significant (r = —0.134). This is due to the fact that O3 reacts with NOx in the atmosphere. When NOx concentrations are high, there is greater O3 consumption in the chemical reaction. Conversely, when NO, concentrations are low, O3 consumption is minimal, resulting in an inverse correlation between the concentration trends of nitrogen oxides and ozone [40]. Therefore, O3 is mainly produced by NO, during atmospheric photochemical reactions driven by solar radiation intensity, which differs significantly from the source of BC, leading to a lack of a significant correlation. In addition to local source emissions, black carbon emissions from surrounding areas are also significant factors influencing black carbon concentration within Beijing’s urban areas. To assess the impact of regional transport on air pollution in Beijing, we employed the HYSPLIT model to compute air quality trajectory data for Beijing during the spring of 2023. Trajectories were calculated every hour, extending up to 500 m above ground and backtracked for 48 h. Subsequently, we clustered these trajectories (Figure 8a). The analysis revealed that three clusters (7.56%, 22.64%, 10.73%) originated from Mongolia and Siberia in the north and northwest of Beijing: one cluster (9.47%) was traced back to Shanxi and Inner Mongolia to the west of Beijing; another cluster (20.43%) was attributed to Shandong and Anhui in the south of Beijing; and one more cluster (29.17%) was linked to the Beijing— Tianjin—-Hebei region near Beijing. This distribution is due to Beijing’s classification under a warm temperate monsoon climate, with the primary spring monsoon wind direction being northwest, followed by south winds (Figure 8c). Figure 8b presents the CWT analysis results for BC during the spring season in Beijing. The potential source regions for BC during this period are predominantly concentrated in the Beijing—Tianjin—Hebei region, as well as parts of Shanxi, Shandong and Henan provinces. Shanxi provinces, being a pivotal mineral-producing region in China, hosts significant coal and iron ore mines. In contrast, Hebei, Shandong and Henan provinces exhibit high population density, a substantial number of motor vehicles and relatively advanced industrial activities. Furthermore, notably elevated CWT values in the Tianjin and Bohai Bay areas are observed. This phenomenon is attributed to Tianjin’s strategic role as a vital transportation hub in North China, with Tianjin Port ranking as the largest trade port in the northern part of the country. Additionally, the Bohai Bay experiences intensive maritime traffic, where the combustion of liquid fuels from maritime sources significantly contributes to BC concentrations. During the spring of 2023, Beijing confronted the implications of recurring dust weather events. This study systematically investigated three representative dust events occurring in the spring season (dust event a: 3.21-3.22; dust event b: 4.9-4.11; dust event c: 5.19-5.21; https: / /yjglj-beijing.gov.cn/col/col2472/index.html (accessed on 28 November 2023)). Utilizing the PSCF model, an in-depth analysis of the potential source regions of BC associated with these dust events was conducted (Figure 9). Concurrently, a comprehensive examination of concentration trends for BC and PM) during these events was carried out (Figure $1). The primary objective was to elucidate the impact of dust weather on the concentration of BC in Beijing. Figure 9a elucidates that during dust event a, the predominant potential source areas of BC (PSCF > 0.7) are predominantly situated in the southern regions of Beijing, encom- passing Hebei and Henan province. Conversely, contributions from the northern and northwestern directions of Beijing manifest negligible levels of black carbon. Insights gleaned from the research of Chen et al. [41] suggest that the primary sources of spring dust in northern China emanate from the deserts of Mongolia and the Taklamakan in Xinjiang. Furthermore, observations derived from Figure S1a illustrate that as PMj9 concentration experiences a rapid increase, BC concentration undergoes a gradual descent. In dust event b (Figure 9b), the principal potential source areas of BC are identified in the southwestern direction of Beijing, encompassing regions such as Hebei Baoding and Shanxi Datong. Interestingly, this direction does not align with the primary sources of dust, and the concentration trends of PM10 and BC are notably consistent with those observed in dust event a. Concerning dust event c (Figure 9c), the principal potential source areas of BC are concentrated within the Beijing area. Notably, dust event c encompasses two distinct dust processes (Figure Slc). During both of these episodes, PMj9 concentrations exhibit marked variability, while BC concentrations tend to remain stable, with a marginal increase during the intervals separating the two dust processes.",
    "In conclusion, contrary to expectations, springtime dust event does not result in an escalation of BC concentrations in Beijing. Instead, the heightened wind speeds during dust events contribute to an accelerated dispersion of pollutants. Utilizing data obtained from the multi-wavelength aethalometer, coupled with me- teorological and atmospheric pollutant datasets, our study provides a comprehensive investigation into the optical absorption properties, concentration dynamics and potential sources of BC in Beijing during the spring of 2023. Our findings reveal that both Absgc and Abspg;c exhibit maximal absorption at 370 nm, diminishing with increasing wave- length. The values for Absiggonmypc and Abs@7onm)src are reported as 10.82 + 6.8 Mm! and 11.471 + 10.87 Mm“!, respectively, with Abs(37onm)prc accounting for less than 40% throughout the study period. The average concentration of BC during spring is documented as 1.39 + 0.87 ug-m-3, concurrently with PM) 5 registering an average concentration of 29.23 + 29.19 pgm, both reaching their zenith in March. Furthermore, their concentration trends exhibit a basic consistency, establishing a positive correlation (r = 0.544). The diurnal variability of BC in Beijing manifests as a distinctive bimodal structure. Aethalometer model outcomes suggest that BC concentration from liquid fuel combustion (1.08 + 0.71 ug-m~3) significantly surpasses that from solid fuel combustion (0.31 + 0.2 ug-m-), BC demon- strates a substantial positive correlation with NO» (r = 0.436) and CO (r = 0.813), while its correlation with O3 (r = —0.134) lacks statistical significance, underscoring liquid fuel com- bustion as the predominant source of BC in Beijing. Trajectory cluster analysis reveals that the primary air mass trajectories in Beijing originate from the northwest. Simultaneously, CWT analysis highlights that external sources of BC in Beijing during spring predominantly concentrate in neighboring cities and regions, as well as parts of the Henan, Shandong and Shanxi provinces. Importantly, dust processes do not engender drastic fluctuations in BC concentrations in Beijing. This study contributes pivotal data on the daily average concentration, optical characteristics and source distribution of BC in Beijing during the spring, thereby laying a solid foundation for climate change simulations, public health impact assessments and studies pertaining to relative emission reductions. Supplementary Materials: The following supporting information can be downloaded at: https://www. mdpi.com/article/10.3390/toxics12030202/s1, Figure S1. The Mean hourly concentration trend of BC and PM)jp in the three dust events (a) 0:00, 21 March-23:00 22 March; (b) 12:00, 9 April-13:00, 11 April; (c) 19:00, 19 May-7:00, 22 May. Author Contributions: W.L.: writing—original draft preparation, investigation and methodology. X.L.: conceptualization, supervision and writing—review and editing. Z.Y.: data curation. L.Z.: supervision, formal analysis. W.Z.: project administration and funding acquisition. All authors have read and agreed to the published version of the manuscript. Acknowledgments: We would like to express our sincere gratitude to the editors and reviewers who have put considerable time and effort into their comments on this paper."
]