[
    "School of Geoscience and Technology, Zhengzhou University, Zhengzhou 450001, China; iezhtian@zzu.edu.cn (Z.T.); zry_2021yjs@gs.zzu.edu.cn (R.Z.); wangyongji@zzu.edu.cn (Y.W.); yangjinjin@gs.zzu.edu.cn (J.Y.); caodi@gs.zzu.edu.cn (D.C.) Abstract: Climate change, population growth, and socio-economic transformations present multi- faceted challenges to the water resource systems in the four major river basins of Henan Province. Consequently, to gain a comprehensive understanding of water security within the study area, a quantitative assessment of water resource vulnerability (WRV) is imperative. In this investigation, the vulnerability scoping diagram (VSD) model serves as the analytical framework, subdividing vulnerability into three critical subsystems: exposure, sensitivity, and adaptive capacity. Utilizing a comprehensive evaluation index system, this study assesses WRV in Henan Province’s four primary watersheds. Temporal variations and spatial patterns of WRV from 2000 to 2020 are systematically examined through the standard deviational ellipse (SDE) and GeoDetector methods. The findings indicate that vulnerability within these river basins is shaped by the interactions among exposure, sensitivity, and adaptive capacity. Moreover, exposure and sensitivity are found to be more influential than adaptive capacity. Although there are indications of future improvements in the system’s re- silience against water resource vulnerability, the overarching scenario remains precarious, particularly within the Hai and Yellow River basins. Considering the diverse characteristics of the watershed, it is recommended that adaptive management strategies be implemented. This study enhances the understanding of WRV dynamics in Henan Province, thereby aiding more effective decision making in sustainable water resource management. Citation: Tian, Z.; Zhang, R.; Wu, L.; Wang, Y.; Yang, J.; Cao, D. Spatiotemporal Evaluation of Water Resource Vulnerability in Four River Basins of Henan Province, China. Water 2024, 16, 149. https://doi.org/ 10.3390/w16010149 Copyright: © 2023 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). The dynamic interplay of climate change, population growth, and socio-economic advancement has led to an increasing imbalance between water supply and demand, resulting in the degradation of water quality and ecological health. These vulnerabilities manifest in various water-related challenges, encompassing water scarcity, contamination, and disruptions to ecological balance [1]. This makes the conflict between humans and the environment a central issue constraining the sustainable development of water resources and society [2]. Water resource vulnerability (WRV), initially grounded in disaster science, defines “vulnerability” as the degree to which a system succumbs to adverse effects when a disaster occurs [3]. The Intergovernmental Panel on Climate Change (IPCC) integrates water vulnerability with climate change factors and exposure, thereby transforming the concept into an analytical framework that explores the consequences and evolutionary paths of climate change, extreme events, human interventions, and other variabilities on water resource structures and operations [4,5]. Given the influences of global climate alterations and human endeavors, the imperative of water resource security has ascended to encompass economic, ecological, and national dimensions [6]. Research predominantly centers on quantitative models when examining water re- source vulnerability. This includes primary methodologies such as functional assessment combination of quantitative methods to assimilate extensive multi-source data of varying characteristics from natural, economic, and cultural domains into their models [1,10]. When datasets are larger and encompass more extracted features, they facilitate a more thorough multidimensional data analysis, thus enhancing model accuracy [11,12]. However, the complexity of such functional approaches can render the interpretation of results chal- lenging [13,14]. For example, Wei et al. [15] and Xia et al. [16] used system dynamics (SD) models and scenario analysis methods, respectively, to assess water resource vulnerability under various scenarios in their study areas, proposing tailored adaptive management strategies. In contrast, index-based methods [17] find more frequent application due to their enhanced flexibility, well-defined system architecture, seamless model integration, and the facile choice of influential parameters. In the realm of index-based vulnerability assessments, the formulation of evaluation metrics is crucial [18–20]. Present-day studies on vulnerability assessment theories and methodologies exhibit an absence of uniform and objective criteria, prompting researchers to devise evaluation indicator frameworks from varied angles [9,21]. For instance, Chen et al. [22] introduced an assessment schema focusing on water scarcity, contamination, and related natural calamities. Haak et al. [23] categorized metrics into socio-economic, water distribution, and socio-environmental groups, underscoring the complex interaction between urban water consumption patterns and socio-economic factors. To address this issue, considering theoretical frameworks, Polsky et al. [24] proposed the vulnerability scoping diagram (VSD) to coordinate the issues of diverse data, indicators, and information. Polsky et al. decomposed vulnerability into three dimensions: exposure, sensitivity, and adaptive capacity, providing a clear and com- prehensive method for vulnerability assessment. In terms of practical application, Frazier et al. [25] developed the spatially explicit resilience-vulnerability (SERV) model to address the issues of spatial inconsistency and indicator dependency. Chen et al. [26] applied this model in the semi-arid region of Yulin City, integrating the VSD framework with the SERV model. This combination, featuring diverse data organization and a distinct indicator system, enhances understanding of the spatiotemporal disparities and characteristics of vulnerability in water resource systems.",
    "A watershed represents a sophisticated confluence of natural and economic systems spanning multiple regions, covering vast expanses, and implicating broad water security concerns [10,27,28]. Consequently, there is a growing emphasis on its water resource vul- nerability (WRV). Pandey et al. [29] explored the susceptibility of freshwater resources in Nepal’s expansive and intermediate river basins to environmental shifts. Chen et al. [30] forecasted the WRV for the Huang-Huai-Hai River basin under diverse socio-economic human activities and climatic shifts. The VSD framework is an important method for comprehensively characterizing the multiple risks and multi-factor indicators of regional WRV [8,15]. However, to our knowledge, there is still limited research on the compre- hensive evaluation and analysis of WRV from the perspective of different basins within a region, although these methods have played a crucial role in quantifying water resources. Research conducted at scales beyond the basin level, encompassing cross-basin and re- gional dimensions [31], offers a more comprehensive understanding of water resource vulnerability within a broader spatial framework. In particular, when addressing WRV management across basin boundaries, reducing vulnerability contributes to regional col- laboration, peaceful resolution of transboundary disputes, and strengthened emergency response mechanisms for local authorities [32,33]. Additionally, this approach supports the integration of WRV studies with regional sustainable development objectives [16,28], aligning with the goals of regional adaptive management. Implementing adaptive manage- ment in the assessment of water resources as a part of WRV [34–36] enables researchers to evaluate the effectiveness of current water management policies and practices. For instance, through quantitative analysis of trends and primary factors influencing regional water resource values, adjustments can be made in the allocation of protected ecosystem This article delves into a case study centered on four basins within Henan Province, China, specifically the Huang-Huai-Hai-Yangtze River basin. Positioned in China’s central- eastern region, Henan Province is pivotal for bolstering national economic growth and agricultural outputs. Nonetheless, it grapples with challenges like limited water resources, demand–supply disparities [39], and pronounced basin variances [40]. This research seeks to enrich comprehension of spatiotemporal fluctuations in WRV across these four basins from 2000 to 2020. The investigation progressed as follows: (1) Constructing a WRV as- sessment model compartmentalized into exposure, sensitivity, and adaptive capability subdomains grounded on the VSD evaluation index system. (2) Gauging the WRV met- ric for the stipulated zone between 2000 and 2020 via a comprehensive index approach. (3) Charting the spatiotemporal trajectories of WRV using centroid and standard deviational ellipse (SDE) techniques. (4) Probing determinant elements via the GeoDetector method- ology. (5) Initiating recommendations for adaptive management in the four principal river basins. Located in the central-eastern region of China (110◦21′ E–116◦39′ E; 31◦23′ N–36◦22′ N), Henan Province spans 167,000 km2 and comprises 18 prefecture-level cities. With an annual water resource averaging 40.35 billion m3, the province experiences an approximate aver- age temperature of 14.8 ◦C and a mean annual precipitation of 771.3 mm. In 2020, Henan’s permanent population was recorded at 99.3655 million. The climatic and geographical conditions favor the cultivation of diverse crops, yet the province is endowed with limited water resources. The per capita water resource stands at around 440 m3, merely one-fifth of the national average and one-twentieth of the global figure, marking severe water scarcity by international benchmarks [41–43]. The province exhibits a west-to-east declining ter- rain. The Taihang Mountains, Funiu Mountains, and the confluence of Tongbai and Funiu Mountains encircle the north, west, and south, respectively, shaping pivotal watersheds for the Yellow, Huai, and Yangtze River systems. Three primary heavy rainfall centers are recognized: the Dabie Mountains in the south, the Tongbai-Funiu Mountains in the west, and the Taihang Mountains to the north. The brief hill-to-plain transition, devoid of a substantial buffer capacity, means intense rainfall episodes channel floodwaters into these river systems. This leads to overflows into the plains, triggering significant flood- ing [44–46]. Moreover, Henan’s precipitation displays spatiotemporal disparities, with localized droughts being recurrent annually and province-wide droughts manifesting spo- radically, impacting economic and social progression. The image’s watershed delineation methodology is attributed to Zhang et al. [40], as delineated in their research. A watershed represents a sophisticated confluence of natural and economic systems spanning multiple regions, covering vast expanses, and implicating broad water security concerns [10,27,28]. Consequently, there is a growing emphasis on its water resource vulnerability (WRV). Henan Province uniquely spans the Huang-Huai-Hai River basin, holding a pivotal role in China’s water network configuration. Notably, there are distinct variations in regional development, ecological conservation, and resource exploration and utilization among different basins within the province, leading to pronounced imbalances in basin development. In the present study, while referring to prior research findings and drawing from the “Planning for the Integrated Governance of Water Resources, Water Ecology, Water Environment, and Water Disasters in Henan Province (2021–2035)”, the four basins within Henan Province are primarily delineated using the surface watershed area, also taking into account the coherence of administrative boundaries (as depicted in Figure 1). The data for this research are bifurcated into two segments: water resource data and socio- economic metrics. The former are sourced from the “Henan Province Water Resources Bulletin” spanning 2000–2020, while the latter are derived from the “Henan Statistical Yearbook” covering 2001–2021. Data not readily available underwent computations or extrapolations using relevant formulas or connotations.",
    "This study employed a tripartite decomposition of vulnerability into exposure, sensitiv- ity, and adaptive capacity to encapsulate the intrinsic characteristics of the socio-ecological system. Guided by the fundamental principles of the VSD vulnerability assessment frame- work [20,24,47–52], the entire data curation and result simulation process was orchestrated (as illustrated in Figure 2). Inspired by the SERV model’s approach to indicator selec- tion [17,25,53], a holistic array of quantifiable vulnerability assessment metrics was devised. Drawing from the water resource data across the four river basins in Henan Province and annual statistical records from various municipalities, pertinent and applicable indicators were subsequently identified. The SERV model was utilized to assess the WRV of these river basins, with associated weights determined through both the analytic hierarchy pro- cess (AHP) and the entropy weight method (EWM) [54–56]. The standard deviational ellipse method [57–59] facilitated an examination of spatiotemporal dynamics and overar- ching trends. In conclusion, the GeoDetector method [60–62] was harnessed to probe the determinants influencing WRV. Uncertainties and ambiguities are frequently encountered in conventional approaches to risk assessment when forming evaluation criteria [20,47]. Addressing this, the VSD model, influenced by the comprehensive framework of the U.S. Public Space Plan [24], cate- gorizes vulnerability into three facets: exposure, sensitivity, and adaptability. This division allows for the wholesale delivery of a comprehensive map showing how vulnerability has its many faces (spatiotemporally), with changes and characteristics that are expressed by sociohydrological susceptibility [48–52]. The VSD model has demonstrated its effectiveness as a methodology for conduct- ing vulnerability assessments, attributed to its robust design and structure. The model exhibits the following key features: (1) Three-dimensional assessments: VSD emphasizes exposure, sensitivity, and adaptability, maintaining clear distinctions and a strict hierar- chy of data evaluation [17] (criterion layer—element layer—indicator). Refer to Figure 3, which synthesizes the various aspects of this organizational network, providing a com- prehensive overview of the vulnerability of our human–environment system to specific hazards [24]. (2) Defined exposure units: VSD necessitates the explicit specification of potential hazards and consequences, discouraging superficial treatment in favor of detailed evaluation. Through the delineation of spatial and temporal scopes, VSD facilitates the identification and assessment of variations among exposure units across different locations and times [54,63]. (3) Scope delineation and adjustment: the model employs preliminary scope delineation in initial assessment stages, allowing iterative refinement and enhance- ment in subsequent evaluations [21,64]. This approach mitigates oversimplification and enhances assessment quality. (4) Comprehensive measurement: VSD accommodates both quantitative measures, such as precipitation differentials, and qualitative assessments, like political relations. This versatility enables the model to encompass a broad spectrum of data types [8,15]. These design elements collectively bestow upon VSD a comprehensive and adaptable framework that is crucial for effectively discerning subtle variances in vulnera- bility. Consequently, researchers can achieve a profound understanding of vulnerability traits in human–environment systems under diverse conditions. Counteracting the constraints of earlier vulnerability studies, the SERV model amal- gamates indicators from natural environments, socio-economic factors, spatial attributes, and location-specific criteria to evaluate regional vulnerability [53]. This integration forges a direct bridge between theoretical constructs and disaster risk studies, sidestepping the pitfalls of relying on generic data markers and tackling the concerns of spatial disparity and indicator dependency. The model emphasizes the selection of indicators that capture the interactive effects between sensitivity and adaptability, recognizing the connectivity among vulnerability components [25]. Importantly, the SERV model posits that vulnerability hotspots might not invariably overlap with exposure zones, shedding light on strategic resource allocation and adaptive strategy development at a regional scale. By recalibrating the perspective on spatial vulnerability determinants, the SERV model aids in the concep- tion of bespoke disaster mitigation tactics and orchestrates their rollout [17]. Leveraging both the VSD framework and the SERV model, this research amplifies the precision and spatial relevance of vulnerability evaluation, propelling a deeper comprehension of water resource vulnerabilities. where WVIi, EIi, SIi, and AIi are the water resource vulnerability, exposure, sensitivity, and adaptive capacity indices for the first evaluation target, respectively. EIi, SIi, and AIi can be obtained by multiplying the standardized values of the indicators by the corresponding indicator weights; rE,ij, rS,ij, and rA,ij are the standardized values of the indicators in the three dimensions; ωE,j, ωS,j, and ωA,j are the final weights of the different indicators in the different dimensions.",
    "Informed by the VSD model, this research constructs a water resource vulnerability assessment model, distinguishing it into three pivotal dimensions, exposure, sensitivity, and adaptability [24], each encapsulating its unique attributes and nuances. The focal point of this water resource vulnerability assessment is the intertwined system of water resources and socio-economic variables. Perturbations mainly stem from climate change and human-induced activities [17,52]. Specifically: A heightened degree of exposure and sensitivity escalates vulnerability scores, signify- ing augmented vulnerability. Conversely, robust adaptability is indicative of diminished vulnerability scores and consequential vulnerability reduction [25,53]. In light of principles emphasizing the scientific rigor and impartiality of indicator selection, combined with data accessibility, a compendium of 32 indicators was curated to establish the water resource vulnerability metric for the quartet of river basins in Henan Province (refer to Table 1) building on extant scholarly contributions. Notes: (1) The metric “water resource development and utilization rate” (X4) quantifies the magnitude of water resource exploitation and utilization within a delineated region or watershed. Typically, it is articulated as the quotient of cumulative water consumption over the entire pool of accessible water resources. (2) The metric “water production modulus” (X13) is calculated by dividing the aggregate water resources of the study area by its total land area. The examination of this metric enables us to comprehend the volume of water resources accessible per unit area, facilitating the evaluation of the abundance of water resources in the specified region. (3) “Water quality excellence rate in watershed” (X14) designates the fraction of surface water within a specific watershed that aligns with or surpasses the water quality criteria stipulated in the National Standard for Surface Water Environmental Quality (GB 3838-2002). This encompasses Class I (excellent water), Class II (good water), and Class III (slightly polluted water). This metric’s foundation is in the “assessment method for surface water environmental quality”, where the proportions of water entities conforming to various water quality designations are determined using monitoring data. (4) The metric “water production coefficient” (X17) signifies the ratio between total water resources and rainfall volume, elucidating the degree to which rainfall contributes to comprehensive water resources. (5) As per the Henan Provincial Water Resources Bulletin, the “proportion of rainfall in the flood season” (X19) pertains exclusively to the interval spanning June through September annually. To guarantee data availability, it is essential to perform an effectiveness test for the indicators. Given the prevalent high correlation among socio-economic data, this study employs the commonly used redundancy degree (RD) [67,68] to assess the independence and redundancy of the indicators. The formula for calculating the RD is as follows: Lower values of RD indicate reduced redundancy and increased independence among indicator data. Given that socio-economic data relationships in empirical research are not entirely separable, an RD value less than 0.5 is deemed satisfactory for research purposes. Upon calculation, the RD of the selected indicators in this study falls within the range of 0.128 to 0.150, meeting the criterion of RD < 0.5. Consequently, this suggests the data are suitable for use. To guarantee data quality and availability, this study utilized information obtained from the Henan Province Water Authority [69] and the Henan Province Bureau of Statis- tics [70]. The data for this research are bifurcated into two segments: water resource data and socio-economic metrics. The former were sourced from the “Henan Province Water Resources Bulletin” spanning 2000–2020, while the latter were derived from the “Henan Sta- tistical Yearbook” covering 2001–2021. Data not readily available underwent computations or extrapolations using relevant formulas or connotations. Due to the varied dimensionality of indicator data, comparability was impacted. To ensure data consistency in the vulnerability assessment of water resource systems, standardization through dimensionless processing was required. Accordingly, the min– max method [71,72] was utilized. It is crucial to acknowledge the distinct effects of positive and negative indicators on the evaluation outcomes. For positive indicators, a larger value indicates a higher degree of WRV, whereas for negative indicators, the relationship is inverse. In this study, the VSD model was employed to select three criteria, ten factors, and thirty-two indicators. Given the varying significance of each indicator, it became imperative to assign appropriate weights. To facilitate this, we integrated the analytic hierarchy process (AHP) with the entropy weight method (EWM) [54]. Through this approach, both subjective and objective weights were computed. The comprehensive weight was then derived by invoking the principle of minimum information entropy, aligned with the Lagrange mean value theorem.",
    "It is crucial, during the weighting of indicators, to account for the inherent statistical patterns and the authoritative significance of the data. By amalgamating AHP and EWM, which synergizes subjective with objective weighting strategies, the constraints associ- ated with singular weighting methodologies are surmounted. This conjoined weighting technique is termed the combination weighting method. The equation to determine the combined weight is presented subsequently [55,56]. In the equation, φj and uj represent the weights assigned to the j-th indicator, derived using the AHP and the EWM, respectively. The term ωj denotes the comprehensive weight for the j-th indicator. The standard deviational ellipse (SDE) stands as a spatial statistical technique shedding light on the multifaceted characteristics of geographic features from both a comprehensive and spatial standpoint. In the context of this study, we deployed the SDE to delineate the spatial distribution and directional traits of WRV across the four prominent river basins within Henan Province [58]. The SDE critically assesses the holistic spatial distribution features and their spatiotemporal evolution via its foundational elements, encompassing distribution range, centroid, major axis, minor axis, and orientation angle [57]. The SDE method illustrates the evolutionary trend and directional pattern of the spatial distribution of WRV. By analyzing the centroid movement and variations in the orientation angle of the SDE, a more intuitive comprehension of the spatial dynamic characteristics of WRV is attained. This facilitates the identification of underlying causes and trends of changes. The distribution range within the SDE encapsulates the degree of concentration or dispersion inherent to a geographic feature’s spatial spread [59]. The centroid serves as the gravitational midpoint of this distribution, pinpointing the relative locus of the feature’s spatial distribution. Conversely, the major and minor axes demarcate the extent of feature dispersion along the primary and secondary trajectories, respectively. A pronounced dis- crepancy between these axes signifies a marked directional attribute within the geographic feature. The orientation angle elucidates the predominant directional trend of development. where xi and yi are the coordinates for feature i, {x,y} represents the median center for the features, and n is equal to the total number of features. Geographic phenomena, characterized by their spatial variations, are frequently mod- ulated by either natural determinants or socio-economic conditions [61]. The quest to understand the underlying mechanisms of their genesis and to scrutinize the contribut- ing factors is of paramount importance. While classical statistical methods offer insights, GeoDetector stands out, addressing the pervasive concerns of multicollinearity and endo- geneity within these factors. Unlike traditional statistical models that confine themselves to multiplicative interactions, GeoDetector innovatively leverages spatial overlays to jux- tapose the metrics of individual factors against their compounded values. This approach not only renders it resilient to multicollinearity but also adeptly mitigates the endogeneity issue [60,62]. Within the scope of this investigation, our emphasis lies in harnessing GeoDetector’s factor detection modality to dissect the variables at play. Factor detection aims to illuminate the explanatory prowess of these variables over the spatial fluctuation contours of the dependent variable, quantified through the q value. GeoDetector effectively evaluates the explanatory power of various factors on WRV, thereby identifying the key determinants influencing WRV. This analysis assists in discerning which factors are spatially critical, offering guidance to decision makers in prioritizing aspects for consideration. The compu- tational schema for the q value is delineated below [61]: where n is the stratum count in the x-layer, N is the number of mapping units in the study area, σ2 i is the variance of R in the ith stratum, and σ2 is the variance of R in the entire area. Large values of the index q indicate a large contribution of the x-layer to landslide occurrence. From 2000 to 2018, the exposure index of the four river basins exhibited a fluctuating upward trend. Notably, the Yellow River basin achieved the highest exposure index value of 0.1313 in 2012, surpassing all other basins throughout the study period. From 2018 to 2020, the exposure markedly declined in all four river basins, reaching their lowest values in 2020. Precisely, the Huai River basin exhibited the lowest exposure, measuring 0.0478. Sensitivity experienced an initial decrease from 2000 to 2004, followed by intermittent fluctuations until 2020. Specifically, the Hai River basin experienced the most substantial fluctuation, while the Yellow River basin had the least. The four river basins exhibited a pattern of initial increase followed by a decrease from 2000 to 2006, and after 2006, they consistently maintained an upward trend. The Hai River basin had the most significant increase, while the other basins experienced relatively similar increases. The vulnerability of each basin fluctuated from 2000 to 2020, indicating an overall decreasing trend. The Hai River basin recorded the highest average vulnerability value, and the average vulnerability rankings of the four basins were as follows: Hai River basin > Yellow River basin > Yangtze River basin > Huai River basin.",
    "This study investigated the temporal evolution characteristics of water resource vul- nerability within Henan Province’s four river basins. Analyses focused on representative years: 2000, 2010, and 2020. Water resources systems across 18 cities in Henan Province were ranked according to their exposure, sensitivity, adaptability, and vulnerability into five categories: high, medium high, middle, medium low, and low. The gravity center standard deviational ellipse model was utilized to trace the center of gravity migration of these water systems for the aforementioned years (Table 2). In the context of WRV across these basins, “migration of centroid” denotes the directional movement and displacement of the centroid of water resource nodes [57,58]. This movement is quantified through a centroid-focused standard deviational ellipse, offering a perspective into the spatial vulnerabilities’ evolu- tion. Figures 4 and 5 details the temporal and spatial dynamics of the exposure, sensitivity, adaptability, and vulnerability of these water systems in the province’s four river basins. Correspondingly, Figures 6 and 7 depict the migration trajectories of their gravity centers. (a) Exposure: From 2000 to 2020, Zhengzhou City remained the gravitational center of water resource exposure across Henan Province’s four river basins. This center shifted 976 km westward and 1128 km northward. Table 2 illustrates the direction angle of the standard deviational ellipse for water resource adaptation capacity within these basins. The predominant orientation progressed from the north(east) to the south(west). Over the twenty-year span, the orientation angle consistently grew, transitioning from eastward to westward, aligning with the province-wide spatial pattern of exposure. Distinctly, the Yellow River and Hai River basins exhibited greater exposure spatial characteristics than the Huai River and Yangtze River basins. This discrepancy was pronounced in 2020, particularly in cities within the Yellow River basin, such as Zhengzhou, Jiaozuo, Xinxiang, Kaifeng, and Puyang, and Anyang City within the Hai River basin. Figure 4. Temporal change chart of water resource exposure, sensitivity, adaptation capacity, and vulnerability index for four river basins of Henan Province. (b) Sensitivity: From 2000 to 2020, the centroid representing water resource sensitivity in the four river basins of Henan Province was identified in Zhengzhou City. This centroid migrated 784 km westward and 194 km southward. As detailed in Table 2, the orientation angle of the standard deviational ellipse representing water resource adaptation capacity in these river basins shifted from north(east) to south(west). Over the two-decade span, this angle consistently increased, transitioning from east to west, mirroring the province’s spatial trend of “high north to low south”. Such data underscore that the sensitivity in the Hai River and Yellow River basins surpasses that in the Yangtze River and Huai River basins. Figure 7. Centroid migration path and standard deviational ellipse of WRV for four river basins of Henan Province from 2000 to 2020. Note: Black triangles along the black lines represent the direction of centroid migration. (c) Adaptation capacity: Our analysis from 2000 to 2020 investigated the centroid of water resource adaptability across the four river basins of Henan Province. Originally posi- tioned in Zhengzhou City, this centroid shifted 907 km westward and 474 km southward over the study period. The standard deviational ellipse for the adaptation capacity of water resources in these river basins exhibited a distribution transition from the northeast to the southwest. Between 2000 and 2020, there was a progressive increase in the orientation angle, shifting from east to west. This aligns with the spatial distribution characterized as “low northeast and high southwest”. Predominantly, regions demonstrating height- ened adaptability were located in the Yellow and Huai River basins, with Zhengzhou, the provincial capital, standing out in particular. From 2000 to 2020, the vulnerability index depicted a discernible spatial pattern characterized as “high northeast and low southwest” throughout the province (Figure 5). Notably, the Hai River basin and the Yellow River basin displayed pronounced vulnerability. Figure 7 delineates the standard deviational ellipse and the trajectory of the vulnerability centroid for water resources across the four river basins in Henan Province over the two- decade span. Situated in Zhengzhou City within the Yellow River basin from 2000 to 2020, this centroid was proximal to both Xuchang and Kaifeng, which are integral to the Huai River basin. Concurrently, the centroid coordinates underwent a shift of 867 km westward and 188 km northward, indicating a drift toward the middle reaches of the Yellow River. The directional distribution of the standard deviational ellipse for water resource vulnerability in the aforementioned basins transitioned from the northeast (leaning eastward) to the southwest (leaning westward). Over the period from 2000 to 2020, there was a consistent increase in the orientation angle, evolving from eastward to westward, mirroring the “high northeast and low southwest” spatial configuration.",
    "The water resource system’s vulnerability within the four river basins was shaped by a multitude of determinants. This study investigated the ramifications of exposure, sensitivity, and adaptability on water resource vulnerability, grounded in the aforemen- tioned classification. Analyses were conducted for three distinct years, 2000, 2010, and 2020, utilizing the natural discontinuity method for discretizing the influential factors [61]. Table 3 shows the results of the factor detector, where the q value represents the explanatory power of the influencing factor on the vulnerability of water resources. In the mid-2000s, among the four basins, the highest sensitivity q value was observed at 0.74, followed by the adaptive capacity at 0.54, and the lowest exposure q value at 0.44. This highlights that the system’s sensitivity played a pivotal role in influencing the vulnerability of the four basins, while exposure impacts remained minimal. By 2010, the hierarchy of influencing factors shifted to exposure > sensitivity > adaptive capacity, emphasizing the amplified impact of exposure on WRV during this phase. In 2020, the q values for exposure and sensitivity were closely aligned at 0.73 and 0.74, respectively, whereas adaptive capacity lagged at 0.3. These data underscore the pronounced impact of both exposure and sensitivity on the basins’ water resource vulnerability compared to adaptive capacity. From 2000 to 2020, a discernible surge in exposure was juxtaposed against a decline in sensitivity, marked by a cumulative elevation of 0.29 in exposure q values over this two-decade span. The GeoDetector analysis revealed that all 32 indicators across the three subsystems influenced the spatial distribution pattern of WRV, as illustrated in Figure 8. In the exposure category, the water resource development and utilization rate (X4), with a q value of 0.27, markedly impacted WRV. This was followed by population density (X1) with a q value of 0.25, suggesting that areas with a higher population density and greater water resource development and utilization rates are more susceptible to increased exposure of the water resource system. Concerning sensitivity, the water quality of urban centralized drinking water source (X15) exerted the most significant impact, evidenced by a q value of 0.39, indicating that deteriorating water quality notably heightened WRV sensitivity. Water resources per capita (X11), with a q value of 0.22, also substantially influenced sensitivity, implying that a reduction in regional water resources amplified sensitivity to changes in water resources. Regarding adaptability, the urban wastewater treatment rate (X25), with an explanatory power of 0.47, emerged as the most influential, denoting that higher urban wastewater treatment rates enhanced regional adaptability to WRV. Furthermore, water consumption per 10,000 yuan of GDP (X23), with a q value of 0.45, significantly affected adaptability, reflecting greater efficiency in water resource utilization. Exposure, being the foremost determinant, witnessed a marked escalation between 2000 and 2018. A significant demographic influx coupled with urban land expansion pre- dominantly drove this trend. Yet, the advent of the novel coronavirus pandemic between 2018 and 2020 catalyzed an unexpected dip in exposure across these basins. This dip was attributable mainly to the interim cessation of urban industrial [73] and agricultural [74] en- deavors within these river territories. Especially notable are Zhengzhou, Jiaozuo, Xinxiang, Kaifeng, and Puyang in the Yellow River basin, with Anyang in the Hai River basin ex- hibiting particularly pronounced performance. These metropolitan regions, characterized by dense populations, advanced urbanization, industrial concentrations, and significant urban hubs, consequently reported a surge in their exposure indices [63,66]. Figure 8 illustrates that the primary driving factors for WRV were the water resource development and utilization rate (X4) and population density (X1). A high population density escalates water demand, whereas an increased water resource development and utilization rate signifies extensive exploitation of water resources, rendering the region more vulnerable to WRV impacts. Moreover, industrial wastewater discharge (X5) also contributed to WRV, intensifying the degree of exposure. Recurring meteorological calamities like floods and droughts plague the Yellow River basin [27,44,75]. Its unique topographical features, where riverbeds occasionally stand elevated compared to urban and agrarian zones, render it prone to flooding. Furthermore, certain cities and river stretches in this basin fail to adhere to flood prevention benchmarks, intensifying flood management challenges. Similarly, the Hai River basin often contends with intense rainfalls and flash floods, culminating in recurrent water-related crises [16,76]. These basins identify meteorological catastrophes as their dominant external disruptors. Specifically, the extreme rainfall episodes in 2016 and 2021 induced acute flooding [77]. Such climatic adversities profoundly impacted both the Yellow and Hai River basins, under- scoring the imperative for robust flood countermeasures and bolstered disaster resistance. Conversely, the Huai River and Yangtze River basins demonstrated comparatively subdued exposure. Even with extant flood hazards, these basins encountered diminished meteoro- logical disaster threats relative to their counterparts [78,79], attributable to their infrequent encounters with flash floods and torrential rains. Moreover, concerning the water usage structure, agricultural water utilization exceeded 50% in the Huai River basin, Hai River basin, and Yangtze River basin. The inefficient use of agricultural water was another factor influencing exposure.",
    "The subsequent component, sensitivity, initially descended from 2000 to 2004 and thereafter oscillated until 2020. This variability emanated from the government’s renewed focus on nurturing ecological civilization, with an accent on water resource sustainabil- ity [80,81]. However, enduring challenges like water-related calamities, over-exploitation of water assets, pervasive contamination, and associated dilemmas persistently influenced the river basins’ dynamics. The analysis conducted using GeoDetector revealed that WRV was significantly influenced by the water quality of urban centralized drinking water source (X15). A decline in the quality of water sources escalated the sensitivity of the water resource system, thereby heightening the populace’s vulnerability to WRV. Furthermore, a reduction in water resources per capita (X11) potentially increased the region’s sensitivity to changes in water resources, amplifying WRV sensitivity. Similarly, a decrease in ground- water resources per capita (X12) may lead to heightened dependency on water resources, consequently increasing the sensitivity to WRV. Cities within the Hai River basin, such as Anyang City and Hebi City, along with Xinxiang City, Jiaozuo City, Kaifeng City, Shangqiu City, and Puyang City in the Yellow River basin, are distinguished by a high population density and expansive cultivated land, as shown in Figure 9. Consequently, the demand for water resources in these regions is heightened. Yet, factors like scarce annual rainfall, extensive groundwater extraction, and suboptimal water quality accentuate the sensitivity of these basins [75,78]. Conversely, Zhumadian City, Pingdingshan City, Xuchang City, and Zhoukou City situated in the Huai River basin, and Nanyang City in the Yangtze River basin, can adequately meet their consumption and residential water needs owing to local rainfall and water resource reserves. Their water resource sensitivity was comparatively diminished. The Huai River and Yangtze River basins, rich in total water resources and with a commendable per capita water resource allocation, exhibited decreased sensitivity to water resource supply instabil- ities [82,83]. While the Huai River basin confronts challenges like excessive groundwater extraction and a disparity between water supply and demand [41,42], and the Yangtze River basin contends with inefficient water consumption [79,84,85], the general water re- source provision remained fairly stable. This stability shielded these basins from severe perturbations triggered by external determinants. The GeoDetector results demonstrate that the adaptability of WRV was predomi- nantly influenced by the urban wastewater treatment rate (X25) and water consumption per 10,000 yuan of GDP (X23). A high urban wastewater treatment rate signifies robust sewage treatment infrastructure, thereby enhancing the region’s adaptability to WRV. Con- versely, low water consumption per 10,000 yuan of GDP indicates elevated water resource utilization efficiency, contributing to improved adaptability. Furthermore, a higher per capita disposable income of urban residents (X22) suggests greater capacity for residents to implement adaptive measures, thus affecting WRV adaptability to a notable degree. In brief, the progressive strides in scientific and technological frameworks, refined water resource management, augmented urban sewage treatments, and bolstered government financial injections into water conservation collectively fortified the resilience across these river basins [30,64]. Consequently, the overarching water resource vulnerability within these basins persistently dwindled annually. This propitious descent in vulnerability emanated from the synchronized synergy of exposure, sensitivity, and adaptive mechanisms, cumula- tively diminishing the water resource system’s proneness to assorted perturbations [17,24]. As depicted in Figure 10, cities within the Yellow and Huai River basins exhibited higher GDPs. Notably, the provincial capital, Zhengzhou, significantly outpaced other munici- palities in terms of GDP. These locales, marked by thriving economies, impressive GDPs, substantial fiscal revenues, competent governmental response mechanisms, and robust water resource protection measures, exhibited superior adaptability [83,86]. Figure 10. The industrial composition of the gross domestic product (GDP) in the 18 cities of Henan Province in the year 2020. Conversely, the Hai River basin, despite its economic stature and size, demonstrated reduced adaptability in comparison to the other basins. This reduced adaptability can be attributed to challenges like extensive groundwater extraction and flood management. The Hai and Yangtze River basins overall manifested reduced vulnerability concerning water resources. Yet, the Hai River basin, given its finite water resource availability coupled with intensive urbanization [76,77], displayed diminished adaptability. In contrast, the Yangtze River basin, enriched with vast water resources and adaptive supply frameworks [82,84,87], showcased superior adaptability. From 2000 to 2020, the four river basins in Henan Province witnessed a significant decrease in the vulnerability index of water resources. The decline in vulnerability resulted vulnerability (WRV). Table 3 reveals that in the mid-2000s, the highest sensitivity (q value: 0.74) significantly influenced vulnerability, followed by adaptive capacity (q value: 0.54), and exposure had the lowest impact (q value: 0.44). By 2010, factors influencing WRV shifted to prioritize exposure > sensitivity > adaptive capacity. Such a trend can be largely ascribed to China’s meteoric economic ascension and burgeoning urbanization rates [88], intensifying water resource demands for domestic, industrial, and agricultural purposes, thereby magnifying the vulnerability in the basins. This finding aligns with the research of Qin et al. [31], which suggests that the swift economic development in China has led to escalating demand for water resources and intensified development efforts, thereby exacerbating the discrepancy between water supply and demand. Human activities are increasingly becoming the primary factor influencing water resource changes. In several Chinese basins, the dominant factors affecting water resource variations have transitioned from climatic changes to the progressively significant influence and control exerted by human activities. In 2020, exposure and sensitivity exhibited similar q values (0.73, 0.74), while adaptive capacity lagged at 0.3. This emphasizes the substantial impact of exposure and sensitivity on WRV compared to adaptive capacity. Over 2000–2020, exposure surged, and sensitivity declined, leading to a cumulative 0.29 increase in exposure q values. This implies that factors such as water demand, along with variations in water quality and quantity within the four basins, outweighed concerns about water resource conservation. While the government consistently instituted measures to combat water pollution and de- velop protective infrastructures [89], the tangible outcomes of these endeavors necessitated extended durations to manifest, elucidating the subdued influence of adaptive capacity.",
    "bility, primarily due to the complex interaction between exposure and sensitivity factors. Initially, these basins faced elevated exposure levels, consistently encountering meteoro- logical adversities such as floods, droughts, and intense precipitation events [75,90,91]. Such climatic extremities frequently induced variability in the water supply, jeopardizing the stability of the basins’ water resource frameworks [91,92]. Such climatic extremes often induce variability in the water supply, threatening the stability of the basins’ water resource frameworks. Secondly, the prominent sensitivity in these basins emerged from limitations in total water availability, in conjunction with high population densities, rapid urbanization, and vigorous industrial activities. This intersection aggravated the water supply–demand nexus. In the Yellow River basin, complexities were amplified by chal- lenges such as over-extraction of groundwater, diminished water quality, and ecological conservation issues [78,83]. Simultaneously, in the Hai River basin, legacy industrial bases additionally jeopardized water quality and availability [77,91,92]. In stark contrast, the Huai River and Yangtze River basins exhibited reduced water resource vulnerability ow- ing to their comparatively abundant water reserves and subdued sensitivity dynamics. Within the Huai River domain, substantial total water assets and favorable per capita water availability alleviated sensitivity to supply disruptions [90,93]. Although concerns regarding over-exploitation of groundwater and supply–demand imbalances lingered, the overall water supply balance remained relatively stable. In the Yangtze River catchment, its plentiful water reserves, coupled with considerable annual water conveyance capabilities, provided resilience against significant external supply deviations [84,85]. Despite chal- lenges in water utilization efficiency, the comprehensive water supply framework remained relatively stable and less vulnerable to external perturbations. Previous studies have shown that measured ranking of WRV is an important basis for adaptive management of water resources (Figure 1), and thus, the evaluation must re-main objective [1,38]. There is much to be learned from this study about the weak spots and strengths of Henan Province’s water infrastructure. It makes the trends of WRV clear and provides a scientific basis for decision making about water resource management in Henan Province. The results can provide decision makers with an overall picture of risks to and challenges for water resources in the various basins, so that problems may be anticipated proactively and appropriate remedial measures taken. This is particularly the case when it comes to factors such as population growth and urbanization, where the works of other scholars have indicated a relationship [31]. The study also provides direction for long-term water resource planning and flood prevention measures. Considering multiple basins, the comprehensive assessment reveals regional variations in WRV, allowing for the formulation of more targeted, basin-specific management policies that cater to the diverse environments and development statuses of each basin. This approach is pivotal in progressing towards a water secure future for the region, ensuring the well-being of its populace, and fostering the sustainable development of both economic and ecological aspects. In our previous analyses, we undertook a comprehensive examination of water re- source vulnerability and its underlying determinants within Henan Province’s four primary river basins: the Huai, Yellow River, Hai, and Yangtze. Adapting our methodology to the distinct characteristics of each basin, we delineated a set of strategies and measures designed to attain equilibrium between water supply and demand, propel hydraulic devel- opment, fortify environmental safeguards for water ecosystems, and institute a resilient governance framework for effective basin management (Table 4). This study focused on the Huai River, Yangtze River, Hai River, and Yellow River basins in Henan Province, undertaking a comprehensive evaluation of WRV utilizing the VSD model. The assessment incorporated indicators of exposure, sensitivity, and adaptability to determine water security and sustainability in these regions, particularly in the context of population growth, urbanization, and other key determinants. By employing techniques such as the composite weighting method, SDE model, and GeoDetector, the research investigated the spatiotemporal evolution characteristics and influencing factors of WRV from 2000 to 2020. The findings of the study reveal: In summation, these findings possess profound ramifications for water resource plan- ning and regional sustainable development. By grasping the spatiotemporal intricacies of water vulnerability and its influential drivers, it enables policymakers to tailor strate- gies bolstering water security, attenuating potential threats, and endorsing environmental conservation. Such initiatives are quintessential for ensuring a resilient water future for Henan’s river basins, propelling socio-economic growth in the province.",
    "Author Contributions: Conceptualization, Z.T.; Data curation, R.Z.; Formal analysis, R.Z., Y.W. and J.Y.; Funding acquisition, Z.T.; Investigation, R.Z.; Methodology, L.W. and Y.W.; Project administration, Z.T.; Supervision, Z.T. and L.W.; Validation, R.Z.; Visualization, R.Z., J.Y. and D.C.; Writing—original draft, R.Z. and L.W.; Writing—review & editing, R.Z., L.W. and Y.W. All authors have read and agreed to the published version of the manuscript. Funding: The research received funding from the Central Guided Local Science and Technology Development Funds Program under grant number 211201004 and the Joint Fund of Henan Province Science and Technology R&D Program under grant number 225200810057. Data Availability Statement: For the publicly available data, interested parties can access them through the Henan Province Water Authority (https://slt.henan.gov.cn/bmzl/szygl/szygb/—accessed on 23 October 2022) and the Henan Province Bureau of Statistics (https://tjj.henan.gov.cn/tjfw/tjsj/—accessed on 23 October 2022)."
]