[
    "Citation: Wang, S.; Cai, T.; Wen, Q.; Yin, C.; Han, J.; Zhang, Z. Spatiotemporal Dynamics of Ecosystem Water Yield Services and Responses to Future Land Use Scenarios in Henan Province, China. Water 2024, 16, 2544. https:// doi.org/10.3390/w16172544 Abstract: Water yield (WY) service is the cornerstone of ecosystem functionality. Predicting and assessing the impact of land use/land cover (LULC) changes on WY is imperative for a nation’s food security, regional economic development, and ecological environmental protection. This study aimed to evaluate the water yield (WY) service in Henan Province, China, using high-resolution (30 m) remote sensing land use monitoring data from four study years: 1990, 2000, 2010, and 2020. It also utilized the PLUS model to predict the characteristics of LULC evolution and the future trends of WY service under four different development scenarios (for 2030 and 2050). The study’s results indicated the following: (1) From 1990 to 2020, the Henan Province’s WY first increased and then decreased, ranging from 398.56 × 108 m3 to 482.95 × 108 m3. The southern and southeastern parts of Henan Province were high-value WY areas, while most of its other regions were deemed low-value WY areas. (2) The different land use types were ranked in terms of their WY capacity, from strongest to weakest, as follows: unused land, cultivated land, grassland, construction land, woodland, and water. (3) The four abovementioned scenarios were ranked, from highest to lowest, based on the Henan’s total WY (in 2050) in each of them: high-quality development scenario (HDS), business-as-usual scenario (BAU), cultivated land protection scenario (CPS), and ecological protection scenario (ES). This study contributes to the advancement of ecosystem services research. Its results can provide scientific support for water resource management, sustainable regional development, and comprehensive land-use planning in Henan Province. Copyright: © 2024 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). Water resources are crucial for human survival and socioeconomic development. Over the past decades, the rapid development of human society and the expansion of the global economy have led to the deterioration of water environments. The resultant and increasingly prominent conflicts between water supply and demand have, in turn, hindered food production and energy development across the world [1]. Nowadays, many nations are grappling with severe (and worsening) water scarcity challenges [2,3]. In ecological studies, regarding numerous ecological service functions, water yield (WY) holds considerable value. WY influences various ecological functions such as biomass, carbon cycling, and sediment output; it [4] is instrumental in maintaining human production and livelihoods while simultaneously promoting regional sustainability [5,6]. WY is influenced by various factors, including land use/land cover (LULC) change, climate [7], hydrological processes [8], human activities [9], and ecosystem degradation [10]. Among these, LULC change is a key factor that impacts an ecosystem’s WY service. Generally, the LULC changes caused by human activities affect (directly as well as indi- rectly) a region’s natural environment, ecological processes, water resource utilization, sustainability of water production, and soil and water conservation. These changes also affect the availability of food and water with respect to socioeconomic growth. The question of how a region’s WY may respond to future changes in its LULC is an extensively debated topic in contemporary research in the fields of geography and ecology [11]. Thus, one must study the changes in the spatial and temporal patterns of WY in various regions of the world under different scenarios; such studies will help predict the future output of various water resources, formulate corresponding coping strategies for their utilization and protection, and promote their sustainable utilization and management. Currently, research on WY primarily employs evaluation methods based on value or physical quantities [12]. Value-based evaluation methods are subjective when one con- siders the role of ecosystem services in the environment. Thus, they are unsuitable for a comprehensive assessment of WY. On the other hand, physical quantity assessment objectively evaluates ecosystems by considering their structure, functions, and ecological processes [13]. Moreover, with the rapid advancement of hydrological models, recent studies have started utilizing modeling and simulation methods to analyze and evaluate re- gional WY capabilities quantitatively as well as visually. Such hydrological models include the InVEST model [14], the SWAT model [15,16], and the ARIES model [17]. Among them, the InVEST model is used to quantify ecosystem services and simulate the hydrological cycle in various ecosystems. It assesses the production and distribution of water resources and is characterized by the simplicity of its model parameters as well as the relatively small amount of requisite data. Hence, lots of studies have used the InVEST model to conduct quantitative assessments of water production in regional ecosystems. These assessments include studies on the spatiotemporal distribution changes of WY [18], the impact of LULC on WY services [19], analyses of the effects of urbanization on WY under economic de- velopment [20], and evaluations of the driving factors of WY [21–23]. Such studies have validated the applicability of the InVEST model in different geographical contexts, thus providing strong support for water resource management in the global ecosystem.",
    "Changes in LULC affect the watershed’s hydrological cycles, evaporation, infiltration processes, and water retention patterns, thereby profoundly impacting its WY [22,24]. Therefore, the accurate prediction of a region’s future LULC changes and the modeling of its WY response are integral to the rational use and conservation of water resources and the promotion of its ecosystem’s sustainable development. In this respect, the commonly used LULC prediction models include the cellular automaton (CA)–Markov [25,26], the CLUE-S model [27,28], and the FLUS model [29]. However, these models are limited in their simulation of the spatiotemporal evolution of different LULC types, especially at the patch scale; they make it difficult to effectively simulate changes at the patch level [30]. The PLUS model, on the other hand, possesses the advantages of high simulation accuracy and rapid data processing, enabling the effective simulation of complex evolution processes of multiple land cover types [31]. Scholars have begun to combine the InVEST model with the PLUS model to conduct quantitative research on regional WY across different historical and future periods [32–34], thus understanding and accurately assessing the potential impacts of socio-economic development, climate change, and LULC change on ecosystem WY services. This approach addresses the limitations of the single InVEST model, which cannot effectively simulate and predict WY across different future periods, thereby providing a basis for land-use planning and future water resource management. However, long-term, large-scale studies are still relatively scarce. To elaborate on the study area, Henan Province is situated in the central-eastern part of China and in the southern region of the North China Plain. It is located in the middle and lower reaches of the Yellow River and is a crucial component of China’s national strategy for ecological protection and high-quality development in the Yellow River Basin [35]. As the main grain-producing area in China, Henan grapples with acute human-land conflicts. It faces severe water shortages, with only 381 m³ of water per capita in this province [36]. Here, the rising demand for water in agriculture, industry, and daily life has made the disparity between water supply and demand more pronounced. In addition, the province frequently faces threats from natural disasters such as floods and droughts. In this context, the 2021–2035 land space plan of Henan Province highlights the need to improve water conservation functions, enhance biodiversity protection measures, and preserve the province’s diverse ecological spaces for the benefit of future generations. Thus, a study of Henan’s WY is integral to the sustainable development, ecological protection, and disaster risk management in this province. In the future, with the implementation of “comprehensive land consolidation” and the “high-quality development” strategy, land use in Henan Province is bound to undergo significant changes. These changes will impact the hydrological cycle, thereby affecting WY and increasing the uncertainty and complexity of future hydrological cycles and WY responses. Therefore, there is an urgent need to study the spatial and temporal differentiation of WY in Henan Province and the response of WY to different future development scenarios. At present, current relevant studies are limited to specific areas regarding spatial characteristics of water conservation at the provincial, county, and watershed levels for specific years. There is still a lack of dynamic, long-term, and quantitative research considering future economic and social changes. This study, focusing on Henan Province, utilizes the China annual land cover dataset in conjunction with the InVEST and PLUS models to simulate and analyze the province’s LULC changes and the corresponding WY responses over the 1990–2050 period. It elu- cidates the spatiotemporal evolution characteristics of WY in Henan, further providing scientific insights that can enhance its ecosystem WY services and promote the utilization and conservation of water resources in this province. The main objectives of this study in- clude the following: (1) revealing the spatiotemporal evolution characteristics of WY service in Henan Province over the 1990–2020 period; (2) setting different development scenarios to predict the LULC in Henan in 2030 and 2050; (3) conducting simulated assessments of WY service levels in Henan in 2030 and 2050 under various development scenarios. and longitudes 110◦21′–116◦39′ E, covering a total land area of 167,000 km2 (Figure 1). The terrain is surrounded by mountains on three sides, with higher elevations in the west and south, and lower elevations in the east and north. The Funiu, Tongbai, and Dabie Mountains form a semicircular distribution along the provincial border. The elevation ranges from 20 to 2386 m, with an average elevation of 283 m [37]. Most of the province is in the warm temperate zone, whereas its southern part has a continental monsoon climate, transitioning from a subtropical to a warm temperate zone. Precipitation is unevenly distributed in the province throughout the year; the precipitation it receives in summer is relatively more than its winter precipitation [38]. During the period from 1990 to 2020, the province’s average annual precipitation is 625 mm, its average annual evapotranspiration is 395 mm, and its average multi-year water resources add up to 403.5 × 108 m3. The soil types found in Henan mainly include luvisols, cambisols, and primosols; broad-leaved forests are deemed the dominant vegetation type throughout the province. Henan’s primary land use type is cultivated land, which accounts for 65.69% of the province’s total land area. Thus, Henan is an important grain-producing region in China that contributes 10% of its national grain output. Forest land and construction land follow, accounting for 17.87% and 14.17% of the total land area, respectively. By the end of 2023, the total population of Henan Province was 98.72 million (ranked third nationwide), and the GDP was 6.134505 trillion yuan (ranked fifth nationwide). As an important province in central China and the lower reaches of the Yellow River and upper reaches of the Huai River, Henan plays a crucial role in national environmental protection and sustainable economic development. Therefore, conducting studies on WY services and responses to future land use change scenarios in Henan Province is both typical and necessary.",
    "Table 1 presents the LULC data relevant to this study, obtained from the China Annual Land Cover Dataset provided by Wuhan University. In this study, Henan Province’s LULC types were classified into six groups: cultivated land, woodland, grassland, water, construction land, and unused land. The biophysical parameters reflecting LULC and vegetation cover characteristics in the study area—LULC code, crop root depth, and crop evapotranspiration coefficient—were obtained from various sources, including existing research findings [39], crop reference values from the Food and Agriculture Organization of the United Nations (FAO), and parameters recommended by the InVEST model. These data were preprocessed using ArcGIS 10.2; the preprocessing phase involved cropping (based on the study area extent) and defining projections to generate datasets for four distinct study years: 1990, 2000, 2010, and 2020. The technical roadmap of this study is depicted in Figure 2. Considering the cumula- tive effects of LULC changes over time, this research uses a 10-year interval, selecting 1990, 2000, 2010, and 2020 as the specific study years to reveal the spatiotemporal distribution patterns of WY in Henan Province. First, the WY in Henan Province in 1990, 2000, 2010, and 2020 were evaluated by combining the study area’s meteorological, LULC, and soil data with the WY module of the InVEST model. The study’s subsequent analysis aimed to delineate the spatiotemporal variations in WY across Henan, encompassing the hori- zontal and vertical distribution, temporal dynamics, and comparative assessment of the province’s WY across different LULC types. Following this assessment, the PLUS model was employed to simulate the province’s LULC patterns in 2030 and 2050. Regarding the simulation, this study set up four different development scenarios: business-as-usual (BAU) scenario, cultivated land protection scenario (CPS), ecological scenario (ES), and high-quality development scenario (HDS). The temporal and spatial changes in WY under these future LULC change scenarios were analyzed using the LULC data derived from the respective simulations for 2030 and 2050. Finally, this study revealed the degree of autocorrelation in the province’s WY using the global Moran’s I index and a local hotspot analysis (Getis-Ord Gi* method). The InVEST model is used to quantify ecosystem services, simulate hydrological cycle processes within ecosystems, and evaluate a region’s WY and its allocation. Its WY module simulates WY according to the Budyko hydrothermal coupling formula and the water balance principle. Subtracting the actual evapotranspiration from the precipitation in each grid within a region, it obtains the corresponding WY of each grid. The formula for WY calculation is outlined as follows [40]: where Yxj represents the annual WY of grid cell x in LULC type j, Px is the annual precipi- tation of grid cell x, and AETxj is the actual annual evapotranspiration of LULC type j on grid x, calculated as follows: where Rxj is the Budyko drying index (defined as the ratio of potential evapotranspiration to precipitation) of grid cell x in LULC type j, wx is a dimensionless non-physical param- eter representing the soil properties under natural climatic conditions, and AWCx is the vegetative effective water content of grid x. Moreover, Z is the Zhang coefficient used to characterize seasonal precipitation. In Equation (4), kxj is the vegetation evapotranspiration coefficient of grid x in LULC type j, and ET0x denotes the reference evapotranspiration of grid x. Further, Ds is the soil depth, Dr is the rooting depth, and PAWCx is the vegetation available water of grid cell x. To elaborate, the Zhang coefficient is a climatic seasonal factor that reflects the precipi- tation and hydrological characteristics of an area [41]. Its value can range from 1 to 30. By adjusting the Z value (Zhang coefficient), the InVEST model parameters can be fine-tuned to take the simulated values closer to the measured values. In this light, after repeatedly debugging the model parameters, this study found that when the Z factor was 16.5, the average runoff depth in Henan Province was 232.49 mm over many years (as simulated by the InVEST model for the 1990–2020 period). Importantly, the relative error with the average runoff depth of 239.07 mm, measured over many years, was found to be only 2.7%. This finding emphasized the reliability of the results that were obtained using the InVEST model. The PLUS model is an enhanced version of the CA model that builds on the FLUS model framework. Operating at the patch level, the PLUS model integrates policy-driven and guidance roles to achieve precise predictions of LULC types [30]. In this model, the initial LULC data from two distinct periods undergo formatting adjustments, which is followed by the extraction of initial LULC expansions toward the final cover within the land expansion analysis strategy (LEAS) module. To that end, this study meticulously selected 12 spatial driving factors in the Henan Province—including DEM, slope, aspect, gross domestic product (GDP), and population (POP), among others—considering the various factors encompassing natural landscapes, socioeconomic dimensions, and accessibility metrics (Figure 3). After each driving factor was input into the system, the random forest algorithm computed and output their development probabilities and contribution levels across diverse LULC categories. Concurrently, the CA random seeding (CARS) module was leveraged to simulate forthcoming land patterns by recognizing water bodies as constraining factors.",
    "Different land use types have different conversion rules under various scenarios, as shown in Table 2. Among them, 1 indicates that the land use type is allowed to be converted to other categories; 0 indicates that the land use type is not allowed to be converted to other categories. Note: a, b, c, d, e, and f represent cultivated land, woodland, grassland, water bodies, unused land, and construction land, respectively; rows in the matrix represent conversion out, and columns represent conversion in. Taking 2000 as the initial year and 2010 as the final year, based on the study area’s LULC data in these two years, this study simulated and predicted its LULC changes in 2020. Subsequently, it verified the accuracy of the simulation results with regard to the province’s actual LULC situation in 2020 (Figure 4). The Kappa coefficient of the PLUS model’s calculated output was found to be 0.838, with an overall accuracy of 0.916. This finding indicated that the model’s simulation accuracy was high and its results were credible. Thereafter, considering 2020 as the initial year and based on the LULC data in this year, simulated and predicted Henan’s LULC situation in 2030 and 2050. Figure 4. (a) The 2020 real map of LULC in Henan Province; (b) 2020 simulation of LULC in Henan Province. Global spatial autocorrelation allows an analysis of the correlation between different spatial locations within a study area [42]. Hence, this study used global Moran’s I to analyze the overall spatial correlation of WY in its study area; standardized Z-values were used to test the significance of this correlation. Thus, a |Z|score > 1.96 indicated significant spatial autocorrelation among spatial units. Moreover, a value of Moran’s I > 0 indicated a positive spatial autocorrelation, revealing significant aggregation. The following formulae were used to calculate spatial autocorrelation [43]: where I is the global Moran’s I; n is the number of grid cells in the study area; xi and xj are the WYs of the ith and jth study areas, respectively; E(I) and VAR(I) refer to the expected value and variance of Moran’s I, respectively; wij is the spatial weight matrix; and x is the mean value of the study area. Local spatial autocorrelation, on the other hand, is the correlation between each spatial unit in a study area in terms of its location and its neighboring spatial units [42]. It reflects the agglomeration and difference between local spatial units. In this study, a local hotspot analysis (Getis-Ord Gi∗ method) was conducted to outline the spatial aggregation characteristics of WY in the study area at the local level; the spatial aggregation locations of high and low values of WY were identified in terms of cold and hot spots. To this end, the following formulae were used [44]: where n denotes the number of grid cells in the study space, xi and xj are the WYs of the ith and jth study areas, respectively, and wij is the spatial weighting matrix; x and s are the average and standard deviations of the study area, respectively; higher G* i index values indicate a closer aggregation of high values, while lower G* i index values indicate the clustering of low values. The simulation results of WY in Henan Province from 1990 to 2020 are shown in Table 3. The average WY depth ranged from 210.65 mm to 260.09 mm, with the total WY ranging from 398.56 × 108 m3 to 482.95 × 108 m3, showing an initial increase followed by a decrease. Among the four study years of 1990, 2000, 2010, and 2020, the highest WY was in the year 2000, at 48.295 × 108 m3, while the lowest was in 2020, at 39.856 × 108 m3, a difference of 17.47%. From 1990 to 2020, the WY depth first increased and then decreased, with the highest depth recorded in 2000 at 260.09 mm, an increase of 75.91 mm from 1990. The lowest depth was recorded in 2020 at 210.65 mm, a decrease of 49.44 mm from 2000, which represents a reduction of 19.01%. From the analysis of the inter-annual changes in spatial patterns (Figure 5), it can be seen that from 1990 to 2000, the average WY depth in Henan Province mainly increased, with the increased area accounting for 82.62% of the total study area. In 47.76% of the region, the WY depth growth rate was less than 10% (Figure 5a). The increase in WY was higher in the southeast and lower in the northwest of the study area, showing a strip-like pattern increasing from north to south. In the southeastern part, the increase exceeded 100 mm, making it the area with the highest WY increase. Areas with a decrease in WY depth were mainly located in the western and northern parts of the study area, with a decrease of less than 50 mm.",
    "Figure 5. Spatial pattern of inter-annual difference in WY in Henan Province from 1990 to 2020. (a) 1990–2000, (b) 2000–2010, (c) 2010–2020, (d) 1990–2020. (Note: The data in the figures represent the water yield of the ending year minus the starting year; for example, 1990–2000 is WY2000–WY1990). From 2000 to 2010, the WY depth significantly decreased, and the WY reduced. The area with reduced WY depth covered about 66.88% of the total study area, with 21.14% of the region experiencing a reduction in depth greater than 100 mm (Figure 5b). The areas with reduced WY were mainly distributed in Xinyang City Prefecture and Zhumadian City Prefecture in southern Henan, as well as Zhoukou City Prefecture, Kaifeng City Prefecture, and Shangqiu City Prefecture in eastern Henan. The reduction magnitude increased from southeast to northwest, with the southeastern region experiencing a reduction in depth greater than 100 mm. The areas with increased WY depth were located in the western part of the study area, with an increase mostly less than 50 mm. From 2010 to 2020, the overall trend in water production depth continued to decrease (Figure 5c). Areas with decreased WY depth accounted for 63.06% of the total area, with 14.03% of the areas experiencing a reduction rate higher than 15%. These reduction areas were mainly located in the central, northern, and western parts of Henan Province within the study area, with the reduction rate increasing from east to west. Areas with increased WY depth were primarily distributed in the southeastern part of Henan Province within the study area, accounting for about 36.94% of the total area, with increases ranging from 0 to 300 mm. Overall, from 1990 to 2020, 63.39% of the study area experienced a decrease in WY depth, while 36.61% saw an increase, with WY depth generally decreasing from the southeast to the northwest (Figure 5d). The WY depth in Henan Province from 1990 to 2020 shows a similar spatial distribution pattern, generally characterized by higher values in the south and east and lower values in the north and west (Figure 6). In 2020, the high-value areas of WY were mainly located in the southern part of Henan, particularly in Xinyang City Prefecture. Secondary high- value areas were mostly distributed on the north and south sides of the high-value areas, including the southern part of Nanyang City Prefecture, and the eastern parts of Zhoukou City Prefecture and Shangqiu City Prefecture. Medium-value areas were often band- shaped and found in the central part of Xinyang City Prefecture, the southeastern part of Zhumadian City Prefecture, and from the northeast to the northwest of Zhoukou City Prefecture. Additionally, there were patchy distributions in the northern parts of Anyang, Xinxiang, and Sanmenxia cities, as well as the western part of Zhengzhou City Prefecture. Secondary low-value areas were mainly located on the periphery of the medium-value areas, with spatial positions similar to those of the medium-value areas. Low-value areas had the largest distribution, primarily concentrated in the western, mid-western, and northeastern parts of Henan Province, including Sanmenxia City Prefecture, the southeastern part of Luoyang City Prefecture, the northwestern part of Jiyuan City Prefecture, the northwestern part of Pingdingshan City Prefecture, the southern part of Anyang City Prefecture, the eastern part of Xinxiang City Prefecture, the southern part of Puyang City Prefecture, the northwestern part of Shangqiu City Prefecture, and the northeastern part of Kaifeng City Prefecture. The degree of aggregation in these areas increased significantly compared In the vertical direction, the average WY depth was statistically analyzed at 100 m intervals to represent the changes in water production capacity of Henan Province along the vertical gradient. The results showed that with the increase in altitude, the overall water production capacity exhibits a decreasing trend (Figure 7). Below an altitude of 400 m, the WY depth remains at a high level, with land use in this region mainly comprising cultivated land and construction land. Above an altitude of 400 m, as the altitude increases, the proportion of forest and grassland areas gradually expands, while the proportion of cultivated land decreases. The average evapotranspiration significantly increases, leading to a reduction in WY depth. At an altitude of 1300–1400 m, the WY depth reaches its lowest value, within this range, cultivated land and construction land virtually disappear, and both factors jointly control the changes in WY at different altitudes. Beyond this altitude, as the altitude increases, the WY depth increases, with woodland accounting for more than 98%.",
    "From the perspective of spatial correlation, the WY in Henan Province demonstrated robust positive spatial autocorrelation from 1990 to 2020. In the province, the global Moran’s I indices were 0.916, 0.950, 0.902, and 0.940 for the four specific years under study, with the Z-scores for all the years exceeding 1.96 and p-values being less than 0.001 (indicating that the test had been passed at a 95% confidence level). This finding suggested that WY services in Henan Province exhibited spatial dependency and strong positive spatial autocorrelation in their distribution over the examined period. Moreover, the hot spot analysis results (Figure 8) unveiled notable shifts in the distribution of hot and cold spots across Henan Province over the past three decades. Specifically, hot spots were predominantly clustered in the province’s southern regions, encompassing cities such as Xinyang, Zhumadian, and Nanyang, while cold spots primarily emerged in its western and northern regions. By 2010, the number of cold spots in the province increased notably, concentrated in the western, northern, and central regions, while sporadic hot spots emerged in its central and eastern zones. By 2020, the southern and eastern regions of Henan Province became hot spot areas, and the distribution of cold spots in the province displayed a distinct spatial pattern as compared with those in the two preceding decades. Utilizing ArcGIS to statistically analyze the water-producing capacity of various land use types (Figure 9). The total WY varies greatly among different land use types, related to the average water-producing capacity per unit area and the distribution area. The water- producing capacity of land use types from strongest to weakest is unused land, cultivated land, grassland, construction land, woodland, and water. Cultivated land, woodland, and construction land are the main land use types in Henan Province, accounting for 65.69%, 17.87%, and 14.17% of the total area, respectively, and have relatively high WY per unit area. Therefore, cultivated land, woodland, and construction land are the main contributors to WY in Henan Province, accounting for 72.54%, 15.09%, and 10.93% of the total WY in the study area, respectively. Due to their small areas, unused land and grassland contribute only 1.44% of the total WY. The changes in WY depth and total WY across different land use types in the study area from 1990 to 2020 generally followed a similar pattern. Except for woodland and grassland, most areas showed a significant increase from 1990 to 2000, a decrease from 2000 to 2010, and a slight increase from 2010 to 2020 (Figure 9). The WY of various land use types was generally higher in 2000 and 1990, and relatively lower in 2010 and 2020. Figure 9. Changes in WY depth and total WY of different land use types from 1990 to 2020 in Henan Province. Utilizing the PLUS model, the spatial distribution of land use in Henan Province for the years 2030 and 2050 was obtained under four scenarios: BAU, CPS, ES, and HDS (Figure 10). Compared with 2020, the land use structure in Henan Province under the four scenarios shows varying degrees of change (Tables 4 and 5). Table 5. Changes in the area covered by each land type in Henan Province from 2020 to 2030 and 2050 under four scenarios (km2). In 2030, under the BAU, the areas of cultivated land, grassland, and unused land decreased by 4200.74 km2, 495.76 km2, and 0.28 km2, respectively, with reduction rates of 3.86%, 26.13%, and 10.49%, respectively. The areas of construction land, woodland, and water increased by 3799.82 km2, 801.4 km2, and 95.57 km2, respectively, with growth rates of 16.19%, 2.71%, and 4.77%, respectively. Under the CPS, the areas of cultivated land, grassland, and unused land decreased by 1921.64 km2, 487.65 km2, and 0.26 km2, respectively, with reduction rates of 1.77%, 25.71%, and 9.74%, respectively. Compared with the BAU, the CPS showed an increase of 2279.1 km2 in cultivated land area, effectively protecting cultivated land, while the increase rate of construction land significantly slowed, increasing by only 6.24 km2. The changes in water bodies were similar to those under the BAU. Under the ES, woodland area increased significantly by 1411.84 km2, the highest increase among the four scenarios, while the increase rate of construction land slowed considerably, increasing by 949.39 km2, the smallest increase among the four scenarios. Under the HDS, the areas of cultivated land and grassland decreased by 3572.43 km2 and 486.46 km2, respectively, with reduction rates of 3.29% and 25.65%, respectively. The areas of construction land, woodland, and water increased by 2583.82 km2, 1359.35 km2, and 115.98 km2, respectively, with growth rates of 11.01%, 4.59%, and 5.79%, respectively.",
    "In 2050, under the BAU, the areas of cultivated land, grassland, and unused land decreased by 12,071.17 km2, 923.91 km2, and 0.38 km2, respectively, with reduction rates of 11.11%, 48.71%, and 14.32%, respectively. The areas of construction land, woodland, and water increased by 10,843.21 km2, 1874.14 km2, and 278.1 km2, respectively, with growth rates of 46.21%, 6.34%, and 13.88%, respectively. Under the CPS, the areas of cultivated land, grassland, and unused land decreased by 9964.92 km2, 916.41 km2, and 0.36 km2, respectively, with reduction rates of 9.17%, 48.31%, and 13.48%, respectively. The areas of construction land, woodland, and water increased by 8685.43 km2, 1911.5 km2, and 284.76 km2, respectively, with growth rates of 37.01%, 6.46%, and 14.21%, respectively. Although the cultivated land area showed a decreasing trend, it slowed compared to the BAU, and the expansion of construction land was significantly restricted. Under the ES, the areas of woodland and water increased by 2390.5 km2 and 300.08 km2, respectively, with growth rates of 8.08% and 14.98%, respectively, the highest increases among the four scenarios. Under the HDS, the areas of cultivated land, grassland, and unused land decreased by 12,774.44 km2, 928.28 km2, and 0.57 km2, respectively, with reduction rates of 11.76%, 48.94%, and 21.35%, respectively. The areas of construction land, woodland, and water increased by 11,648.52 km2, 1856.12 km2, and 198.54 km2, respectively, with growth rates of 49.64%, 6.27%, and 9.91%, respectively. To predict changes in the ecosystem WY services in Henan Province under different future scenarios, this study input LULC data for 2030 and 2050 (simulated using the PLUS model) along with 2020 precipitation and evapotranspiration data into the InVEST model to obtain the WY for the study area in 2030 and 2050. The spatial distribution of WY depth in the province under these four scenarios is illustrated in Figure 11. The spatial pattern continues the characteristic distribution from 1990 to 2020; the high-value WY zone will remain in the province’s southern and southeastern boundaries, while the low-value WY zone will be concentrated in its western and northern parts. As shown in Tables 6 and 7, under the BAU scenario, the predicted WY in Henan Province for 2030 is 401.42 × 108 m3, and the predicted WY depth is 212.54 mm, which are 2.85 × 108 m3 and 1.89 mm higher than those in 2020, respectively. The WY from cultivated land decreases by 23.02 × 108 m3, while the WY from construction land increases by 27.49 × 108 m3. For 2050, the predicted WY in Henan Province is 407.78 × 108 m3 and the predicted WY depth is 216.88 mm, which are 9.21 × 108 m3 and 6.23 mm higher than those in 2020, respectively. The WY from cultivated land decreases by 39.62 × 108 m3, while the WY from construction land increases by 49.32 × 108 m3. Under the CPS scenario, the predicted WY volume in Henan Province for 2030 is 399.85 × 108 m3, and the predicted water production depth is 211.23 mm, which are 1.28 × 108 m3 and 0.58 mm higher than those in 2020, respectively. The WY from cul- tivated land decreases by 8.46 × 108 m3, while the WY from construction land increases by 18.63 × 108 m3. For 2050, the predicted water production volume in Henan Province is 399.98 × 108 m3, and the predicted WY depth is 211.31 mm, which are 1.41 × 108 m3 and 0.66 mm higher than those in 2020, respectively. The water production volume from cultivated land decreases by 6.78 × 108 m3, while the water production volume from construction land increases by 17.82 × 108 m3. Table 6. Predicted WY in Henan Province for 2030 and 2050 and changes of WY between prediction for 2030 (2050) and 2020 under different scenarios. Table 7. Mean WY of different LULC types in Henan Province for 2030 and 2050 under different scenarios (108 m3). Under the ES scenario, the predicted WY in Henan Province for 2030 is 398.1 × 108 m3, and the predicted WY depth is 210.5 mm, which are 0.47 × 108 m3 and 0.15 mm lower than those in 2020, respectively. The WY from cultivated land decreases by 19.74 × 108 m3, while the WY from construction land increases by 19.95 × 108 m3. For 2050, the predicted WY in Henan Province is 406.65 × 108 m3, and the predicted water production depth is 216.11 mm, which are 8.08 × 108 m3 and 5.46 mm higher than those in 2020, respectively. The WY from cultivated land decreases by 38.51 × 108 m3, while the WY from construction land increases by 45.75 × 108 m3.",
    "UndertheHDSscenario, thepredictedWYinHenanProvincefor2030is402.52 × 108 m3, and the predicted water production depth is 213.19 mm, which are 3.95 × 108 m3 and 2.54 mm higher than those in 2020, respectively. The WY from cultivated land decreases by 25.32 × 108 m3, while the WY from construction land increases by 31.18 × 108 m3. For 2050, the predicted WY in Henan Province is 408.89 × 108 m3, and the predicted WY depth is 217.51 mm, which are 10.32 × 108 m3 and 6.86 mm higher than those in 2020, respectively. The WY from cultivated land decreases by 41.09 × 108 m3, while the WY from construction land increases by 51.88 × 108 m3. For 2030, the global Moran’s I indices for WY in Henan Province under the BAU, CPS, ES, and HDS are 0.933, 0.932, 0.934, and 0.934, respectively. Similarly, for 2050, these indices under the same scenarios are 0.933, 0.932, 0.934, and 0.932, respectively. For both 2030 and 2050, these results indicate a certain level of spatial autocorrelation in the distribution of WY across different scenarios in Henan Province. Moreover, the results of the hotspot analyses (Figure 12) show that the distribution characteristics of cold/hot spots regarding WY in Henan Province will have similar distribution characteristics in 2030 and 2050; hot spot areas will be mainly located in the southern and southeastern parts of the province, whereas cold spot areas will be distributed in its central, western, and northeastern regions (with a more sporadic distribution). The annual average WY and annual average WY depth in Henan Province exhibited a pattern of initially increasing and then decreasing between 1990 and 2020. The WY depth in 2020 decreased by nearly 19% compared to 2000, which is related to the hot climate and strong evapotranspiration intensity in 2020. Spatially, the high WY areas in Henan Province were mainly distributed in the southern regions, as these areas have a subtropical climate with precipitation often exceeding 800 mm, while evapotranspiration is relatively low. In contrast, the western and northern parts of Henan, due to their relatively higher elevation and warm temperate continental climate, with most rainfall between 560–600 mm and vigorous evapotranspiration, had lower water yield than the southern areas. This finding is consistent with the conclusions from the study on the spatial distribution of water conservation in Henan Province by Xiao Juncang and others [45]. Vertically, the WY depth in the study area generally decreased with increasing elevation, primarily influenced by land use types, vegetation characteristics, and evapotranspiration intensity. This finding is consistent with the conclusions of Lu et al. [46]. In fact, Henan Province is the only province in China that spans four major river basins (Figure 13); hence, changes in its WY service will directly affect the water resources in the respective river basins. Over the past 30 years, the WY depth in the southern part of the Henan section of the Haihe River Basin has decreased, while it has increased in the northern part, with an overall increase in total WY. This is related to the reduction in precipitation and increase in evapotranspiration intensity in the southern part of the basin, as well as ecological protection and vegetation restoration measures in the northern mountainous areas [47]. In the northwest and central parts of the Henan section of the Yellow River Basin, the WY depth has slightly increased, but the overall WY has decreased. This is due to the implementation of ecological restoration projects such as returning farmland to forests and afforestation, which have increased vegetation cover and enhanced water conservation capacity. However, due to the overall reduction in precipitation across the basin, the WY still shows a declining trend [48]. In the Henan section of the Yangtze River Basin, the WY depth has generally decreased, mainly influenced by factors such as rising temperatures in the basin and the increase in agricultural land area, leading to greater evapotranspiration intensity [49]. In the southern and southeastern regions of the Henan section of the Huaihe River Basin, the WY depth has increased, benefiting from the humid subtropical climate, well-protected vegetation, and increased government investment in soil and water conservation. However, the WY depth has decreased in the northeastern and northwestern parts of the basin, possibly due to climate change and suboptimal land use and management practices [50].",
    "Different land-use types exhibit significant differences in evapotranspiration capacity, soil moisture content, water-holding capacity, and canopy interception, which in turn result in notable variations in their WY capacity [51]. In this study, the WY capacity was ranked from highest to lowest as follows: unused land, cultivated land, grassland, construction land, woodland, and water bodies. The WY capacity of land-use types is inversely proportional to the evapotranspiration capacity of their vegetation; the higher the evapotranspiration, the lower the WY value [52]. Unused land, with its poor precipitation interception ability, filters only a small portion of water, allowing precipitation to directly infiltrate the ground or form runoff [5], which makes it the most effective in terms of WY capacity. Cultivated land and grassland, despite having shallow root systems and relatively weak interception effects, exhibit lower evapotranspiration, resulting in relatively better WY performance. Most construction land comprises impermeable surfaces that lack vegetation for precipitation interception, and its relatively low evapotranspiration has a positive effect on WY, which is consistent with existing studies [53]. Woodland, on the other hand, has strong evapotranspiration due to its canopy cover and robust interception by the litter layer, which may lead to a comparatively lower WY [54]. Water bodies, with their strong evapotranspiration capacity, have the lowest WY compared to other land types [31]. Furthermore, differences in the area occupied by each land type also influence their total WY. Cultivated land, with its high WY capacity and extensive area, contributes the most to the total WY in Henan Province, while grassland, despite its good WY performance, contributes less due to its limited distribution. Furthermore, changes in land use types not only affect water yield capacity but may also lead to significant changes in other ecosystem services, such as soil erosion and carbon storage [35,55]. Unused land and cultivated land, due to their low vegetation cover and loose soil structure, are more prone to soil erosion, especially in areas with high-intensity rainfall [56]. This not only reduces soil fertility but may also lead to water eutrophication, thereby affecting regional water quality [57]. In contrast, woodland and grassland can effectively reduce soil erosion and maintain soil structure stability through their root systems and surface vegetation [55]. Additionally, woodland can sequester atmospheric carbon dioxide through photosynthesis, storing it in biomass and soil [58], while the root systems of grasslands can sequester carbon deep in the soil. Changes in land use, particularly the conversion of woodland and grassland into cultivated land or construction land, may result in the release of large amounts of carbon, thereby exacerbating climate change [59]. Changes in land use types are not simply about area and type conversion; their impacts on ecosystem services are complex and multidimensional. Future research can further explore the complex interactions between land use type changes and ecosystem services under different scenarios. Considering that it is China’s main grain-producing region, food security in Henan Province is a necessary foundation on which China can achieve stable development. In this regard, adequate water resources are the cornerstone of food security. However, Henan Province currently faces enormous water-related challenges. First, it faces an increasing demand for water resources in agriculture, industry, and urban life. The disparity between water supply and demand and ecological environment protection is one of the most prominent problems encountered by Henan. Such an issue has intensified the competition for water resources, which may consequently lead to the uneven distribution of resources and even water supply tension in the province. Second, the geographical location and climatic conditions of Henan Province impact the distribution and utilization of its water resources. Its “high in the west and low in the east” terrain conditions result in some areas being more arid and others being prone to flooding. Such conditions frequently render Henan Province vulnerable to the threat of natural disasters such as floods and droughts. Natural disasters also result in the loss of the water resources, in addition to seriously impacting the agricultural production, urban life, and socioeconomic progress of the province. In particular, they pose a substantial threat to China’s food security. These factors have pointed to the urgency and importance of water resources management in Henan Province in light of the following issues: increased competition for resources, complexity and difficulty of holistic water resources management, and water supply constraints. In this context, based on this study’s investigation of the characteristics of water resource distribution and the future changes in Henan Province’s WY, the following three strategies First, effective water resources control and distribution mechanisms must be imple- mented to ensure the rational use of water resources in Henan Province. Stakeholders in its southern part, which receives abundant precipitation and has a high water production capacity, should focus on protecting its water resources, strengthening the protection of water source culverts, and ensuring the fulfillment of their role as important water resource production areas. In fact, Henan Province should establish a quantitative water resources management system so that it can reasonably allocate water resource quotas according to the demand and actual situation of each region, in addition to strengthening the su- pervision and punishment of illegal water withdrawal. It should also strengthen water resources management cooperation with neighboring provinces, especially communication and coordination with the upstream provinces, such that stakeholders can jointly protect cross-regional water resources.",
    "Second, the Henan administration should guide high-quality development, promote a water-saving society, and enhance ecological protection and restoration. Among different scenarios, high-quality development can increase the province’s WY to the greatest extent. In addition, Henan must adopt a sustainable development model focusing on the develop- ment of frugal and environmentally friendly industries. Only then will it be able to reduce the unchecked consumption and pollution of its water resources as well as encourage water-saving measures in all fields—including agricultural, industrial, and urban areas—to improve the overall efficiency of water resource utilization, e.g., promoting water-saving irrigation technology and strengthening water recycling and reuse [60]. The administration must also try to control the scale of construction land expansion to avoid the loss of water resources and the ecological damage caused by excessive development [61]. The natural protection capacity of Henan’s water resources can also be improved to reduce soil erosion and enhance water quality through ecological restoration, vegetation protection, and other relevant measures. Third, Henan should strengthen related scientific and technological support, develop a sound water resources monitoring and early warning system, and seek to reduce the losses caused by natural disasters. To this end, it must achieve an in-depth understanding of the distribution, changing patterns, and sustainable use potential of its water resources [62]. The administration in Henan must consolidate scientific and technological support for water resources management and promote the application of both water-saving irrigation technology and comprehensive water resources utilization technology. Fortunately, Henan has already established a robust water resource monitoring and early warning system to ensure timely warning of natural disasters (such as droughts and floods) and create a scientific basis and support for concomitant disaster response. This study evaluated the WY changes in Henan Province using the InVEST model and the PLUS model, providing a valuable case study that could aid future water resource protection and management in the province. However, this study had some limitations. First, although the InVEST model widely used in ecosystem valuation [63] can fail to incorporate the complexity of terrain and is susceptible to the influence of model parameters and input data, leading to a certain degree of uncertainty [64]. Second, while this study considered four different development scenarios regarding the simulation of future LULC changes, its results might not have fully represented all actual change situations. To establish more comprehensive development scenarios, various development plans and related policies should be considered by future studies. Further, although this paper selected 12 driving factors to evaluate future LULC changes, the actual impacts of LULC changes would be presumably more complex. To enhance the accuracy of their LULC change predictions, future studies should thoroughly consider the many potential factors influencing LULC change in conjunction with Henan’s local government’s development plans and policy orientations. This study employed the InVEST and PLUS models to simulate and analyze land- use changes and water yield (WY) service functions in Henan Province from 1990 to 2050, leading to the following key conclusions: The ecosystem WY in Henan Province first increased and then decreased from 1990 to 2020. The average WY depth ranged from 210.65 to 260.09 mm, and the average total WY ranged from 398.56 × 108 m3 to 482.95 × 108 m3. Among the four selected study years, the highest WY service level was in 2000, with an average WY depth of 260.09 mm, and the lowest WY capacity was in 2020, with an average water yield depth of 210.65 mm. Significant spatial disparities in WY were observed across Henan Province, with higher values in the southern and southeastern regions and lower values in the western and northeastern regions. The high-value area was located in the southern part of the province, particularly in Xinyang City Prefecture, while the low-value areas were mainly concentrated in the western, central, and northeastern regions. There was a strong positive spatial correlation in WY across the years, with hot spots primarily located in southern Henan and cold spots concentrated in the western and northern regions. The WY capacity of land-use types was ranked from strongest to weakest as follows: unused land, cultivated land, grassland, construction land, woodland, and water bodies, with cultivated land being the primary source of WY services in Henan Province, accounting for 75% of the total WY. Under the four scenarios, the total WY in Henan Province in 2030 ranked from highest to lowest as follows: HDS, BAU, CPS, and ES. By 2050, the ranking was HDS, BAU, ES, and CPS. Compared to the WY in 2020, the average WY depth in 2030 is projected to increase by 3.95 mm, 2.85 mm, and 1.28 mm and decrease by 0.47 mm under the HDS, BAU, CPS, and ES scenarios, respectively. In 2050, these values are expected to increase by 10.32 mm, 9.21 mm, 1.41 mm, and 8.08 mm, respectively. Henan Province should prioritize the protection of areas with the strongest WY functions, particularly in the southern regions and the topographically complex northwestern areas. A quantitative, cross-regional water resource allocation and management system should be established. Measures such as implementing high-quality development, promoting water-saving irrigation technologies, building a water-saving society, protecting cultivated land, restoring ecosystems, and establishing robust water resource monitoring and early warning systems should be undertaken to improve water resource utilization efficiency and achieve regional sustainable development.",
    "This study’s findings hold practical and policy implications, emphasizing the impor- tance of further investigating ecosystem WY services in Henan Province. It offers significant policy recommendations and encourages future studies to make further advances by ad- dressing model simplification and undertaking a more comprehensive consideration of LULC changes in the province. Moreover, it provides insights into planning for LULC changes and ecosystem service functions in similar regions across the world. Further, it of- fers substantial support toward the achievement of concomitant scientific decision-making and sustainable development goals. Author Contributions: Conceptualization, S.W. and Q.W.; data curation, S.W. and C.Y.; formal analysis, S.W.; funding acquisition, Q.W.; investigation, S.W.; methodology, S.W.; project adminis- tration, Q.W.; resources, S.W. and T.C.; software, S.W.; supervision, J.H. and Z.Z.; validation, Q.W.; visualization, S.W.; writing—original draft, S.W.; writing—review and editing, S.W. All authors have read and agreed to the published version of the manuscript. Data Availability Statement: The original contributions presented in the study are included in the article; further inquiries can be directed to the corresponding authors. Acknowledgments: The original contributions presented in the study are included in the article, further inquiries can be directed to the corresponding authors."
]