[
    "Citation: Zuo, Q.; Li, W.; Zhao, H.; Ma, J.; Han, C.; Luo, Z. A Harmony-Based Approach for Assessing and Regulating Human- Water Relationships: A Case Study of Henan Province in China. Water 2021, 13, 32. https://dx.doi.org/10.3390/ w13010032 Abstract: The conﬂict of the human-water relationships (HWR) has further increased the water- related risks, such as water environment deterioration, water shortages, and even regional violent conﬂicts for obtaining usable water resources. Knowing how to evaluate and regulate the discordant HWR to form a balanced growth between sustainable socio-economy and water resources protection has become a critical issue in water resources management. The harmony theory method, which provides a new perspective for solving the conﬂict between humans and water, has been widely used in current studies. However, this method focuses less on the quantitative study of the balance status of HWR. This study proposes a harmony theory-based HWR evaluation method that contains a systematic process of harmony assessment, indicator identiﬁcation, harmony balance constraints, and harmony regulation for assessing and regulating the discordant HWR. The Henan Province of China, which has a complicated HWR, was selected as a case study to apply and verify the approach proposed in this study. The results indicated that (1) Henan Province showed a poor harmony status. The human–water harmony degree of 18 distinctions in the province varied from 0.41 to 0.76, showing an increasing trend from 2006 to 2018, indicating that the HWR was gradually improving in recent years. (2) The human–water harmony degree showed that HWR in the southwest part of Henan Province, with less human activities, was better than that in its northeast part, which had faster social development. Sanmenxia City, located in the west part of the province, had the highest human–water harmony degree because of the recent water control projects implemented in the city, indicating that human production measures could effectively help improve HWR. (3) At present, Henan Province has serious discordant indicators in these three aspects (water system health, humanistic system development, and human-water system coordination), which proves that it is still facing pressure from both socio-economy sustainable development and water resources protection. Our results provide insight into water resources management in Henan Province and other similar Copyright: © 2020 by the authors. Li- censeeMDPI,Basel,Switzerland. This articleisanopenaccessarticledistributed under the terms and conditions of the CreativeCommonsAttribution(CCBY) license(https://creativecommons.org/ licenses/by/4.0/). Water resources are a vital substrate and precondition to human development and eco- environmental protection [1]. However, due to rapid increase of population, widespread economic growth, rapid urbanization and industrialization, low efﬁciency of water con- sumption, improper water management and insufﬁcient water storage infrastructure [2], the human-water relationships (HWR) in many regions over the globe is facing and will continue face severe disharmony [3–8]. Water scarcity and related eco-environmental issues have become key factors to restrict socio-economic development in these regions. Accord- ing to a prediction report of the united nations, the world population will reach 9.7 billion by 2050, which leads to the number of people with insufﬁcient water up to 4 billion[9]. The serious human-water contradiction has posed a great challenge to water resources protection and socio-economic development. Therefore, it is urgently needed to assess and regulate the disharmony HWR, realize a virtuous cycle of coordination between the humanistic system and the water system, that is, provide long-term support and guarantee for human survival and sustainable economic and social development under the premise of continuous improvement of the self-sustaining and renewal ability of the water system [10]. In the literature, the study of HWR has always been a hot topic with academic concern. Since 1987, the World Commission on Environment and Development (WCED) ﬁrst pro- posed the concept of “sustainable development”, and then many studies have been carried out to explore the path of sustainable human and water development relationship [11]. Therefore, human-water sustainability, which is deﬁned as “harmony”, has become the focus of water resources management. Many international seminars have been held on this theme to discuss the countermeasures of discordant HWR, such as the International Sympo- sium on Sustainable Management of Water Quality and Quality, the Academic Conference on Sustainable Management of Water Resources with Increased Uncertainty, and the Inter- national Conference on Water Resources Planning in a Changing World [12–14]. Therefore, the early research about this topic is mainly focused on the qualitative exploration of the theory and concepts of how to achieve a sustainable HWR. For example, Lesparre et al. (2020) [15] believed that the human-water relationships should be focused on the interrelationship between the human economy and the earth’s hydrological system; Allan (2003) [16] proposed a “human-water” integrated water resources management framework; Haruvy (1997) [17] studied the current state of the world’s water resources, showing that water use is closely related to agriculture, the environment, and social changes.",
    "Based on the qualitative exploration, a variety of methods have been proposed to quantitatively assess and regulate the discordant HWR, such as the commonly used Ana- lytic Hierarchy Process method [18], fuzzy comprehensive evaluation method [19], multi- objective analysis method [20], regression analysis method, and Drive force-Pressure-State- Impact-Response (DPSIR) method and socio-hydrological models. [21,22]. For example, the Analytic Hierarchy Process method is commonly used to calculate the weights of indicators for assessing HER [23]. Multi-objective Models are often used to analyze the integration and optimization of water systems, and to coordinate the relationship between the humanistic system and the water system [24]. The drivers, pressure, state, impact and response (DPSIR) framework is an important method for identifying the interaction relationship between indicators of human-water system [25,26]. However, to our best knowledge, there is no or limited studies about assessment and regulation of HWR from a harmonious perspective, although these methods play an important role in quantifying HWR. However, to our best knowledge, there are no or limited studies about assessment and regulation of HWR from a harmonious perspective. Studying HWR from the perspective of harmony is urgently needed, because the im- provement of human development and the protection of water resources are both important foundations for human–water sustainability [27]. Compared to the current commonly used methods for the assessment of HWR mentioned above, the concept of harmony focuses on the mutual adaptation processes among stakeholders, rather than one party adapting to others. Therefore, only a high level of human development or only a well-protected water system is not a harmonious development of HWR, but if both are in good status, they are in a state of balance [28]. The harmonious assessment and regulation of HWR can provide a scientiﬁc basis for the formulation and implementation of water resources development and utilization strategies. In recent years, the application of harmony related methods to water resources management has received attention in academia. In particular, harmonious strategies are used in water resources related production management [29]. For example, Luo et al. (2019) [30] introduced the harmony theory method into the evaluation of river ecosystems, and then innovatively proposed a new method for assessing river ecosystem health based on human service needs and ecosystem integrity; Oliveira (2017) [31] showed that accurate short-term water demand forecasting is crucial to the decision-making process of water management, and applied the harmony search to the parameter estimation of the Arima model; Zuo Qiting et al. (2017) [32] proposed the harmony theory method focusing on the multiple adaptation and development of HWR, from aspects of the humanistic system and the water system. So far, the method has formed a relatively complete and mature theory and quantitative method system, including harmony assessment, harmony identiﬁcation, and harmony regulation [33,34], and has been widely used in water quality evaluation, social and economic development evaluation, cross-border water diversion, and other related ﬁelds [35–38]. Although there have been many researches on the evaluation and regulation of human-water relationships, there is still no method to systematically study the process of evaluation and regulation of human-water relationships from the perspective of harmonious balance. In this paper, we propose a harmony-based approach that contains a systematic pro- cess of the harmony assessment, indicator identiﬁcation, harmony balance constraints, and harmony regulation for assessing and regulating the discordant HWR. The proposed method was applied to the densely populated Henan Province (Nearly 100 million resi- dents) for assessing and regulating its discordant HWR. Henan Province is an important grain production base in China, and its grain output exceeds one-tenth of the national total. However, due to intense human activities, Henan Province is facing severe dishar- mony HWR. Studying HWR can provide guarantee for the sustainable development of Henan Province. The speciﬁc objectives of this study include: (1) To proposes a harmony theory-based approach to assess and regulate the discordant HWR; (2) To analyze the spatiotemporal variation of the discordant HWR in Henan Province based on the proposed method; (3) To identify the main factors that affect disharmony HWR in Henan Province. The paper was organized as follows. In the ﬁrst section, we introduced the main research methods of harmony theory. Then, the framework showing the steps and the relationships between methods used in this study was then described for evaluating and regulating HWR. Finally, the case study area of the Henan Province was introduced. The results for the Henan Province as the case study were summarized in Section 3. Conclusions were listed in Section 4. The results of this study can provide insight into the comprehensive management of water resources in Henan Province and other similar regions.",
    "The widely used method of SMI-P [33] was employed for assessing HWR. First, the harmony degree of the single index was calculated using the single indicator quantiﬁcation method. The piecewise fuzzy membership analysis method in Equation (1) was used to map each index to [0,1] (normalization). Due to different units, dimensions and magnitudes of indicators in the index system reﬂecting human-water system, they are normalized using a piece-wise fuzzy membership function for ensuring the reliability of the results. Whereas, the normalization using this method by setting the ﬁve note values for each indicator can more accurately reﬂect the importance of these indicators contributing to the harmony of human-water relationships. The piecewise function of each index was divided into six sections by ﬁve note values, i.e., (a) the worst value, (b) the worse value, (c) the medium value, (d) the better value, and (e) the optimal value. The different harmony degrees of these ﬁve notes were assigned as 0, 0.3, 0.6, 0.8, and 1, respectively. The speciﬁc values of these ﬁve representative notes were determined according to the following principles: the optimal value was determined based on the national optimal level and then plus a suitable percentage; the medium value was determined based on the multi-year average of the indicator in the study area; the worst value was determined by the worst value of the indicator over many years in the study area; the worse value and the better value The calculation of the harmony degree for each indicator was as follows (the left part for a positive indicator and the right part for a negative indicator): where SHDi denotes the single index harmony degree and SHDi ∈ [0,1]; i denotes the i-th index; and a, b, c, d, and e denote the representative node values for each index. Second, the harmony degrees of the three dimensions of HED, DED, and COD were calculated using the multi-index synthesis method, by the weighted summation of the corresponding single index harmony degrees (see Equations (2)–(4)). where HED is the health degree of the water system, HED ∈ [0,1]; DED is the development degree of the humanistic system, DED ∈ [0,1]; COD is the coordination degree of human– water system, COD ∈ [0,1]; n1, n2, and n3 are the number of quantization indicators of the three principle layers; and wi is the weight of each indicator, determined by the analytic n ∑ wi = 1; other symbols are the same as before. hierarchy process and entropy method, i=1 Finally, the harmony degree of humans and water was calculated by integrating the harmony degrees of the three dimensions, as follows: where HD is the harmony degree of humans and water, HD ∈ [0,1], the higher the HD value (closer to 1), the higher the harmony degree; β1, β2, and β3 are the weights of dimension levels, β ∈ [0,1], and β1 = β2 = β3 = 1/3; other symbols are the same as before. Harmony balance refers to a state of balance that is relatively static and temporarily acceptable to all parties concerned, done by stakeholders considering their respective inter- ests and overall harmony goals [40]. The development and utilization of water resources must not impair the natural circulation of water systems, so as to achieve sustainable use of water resources. In fact, this requires a harmony balance between humans and water, which is explained as the improvement in the expected economic and social development, and the protection of water resources at the same time. It is worth noting that this state of balance is continuously changing along with climate change and human intervention. Therefore, the harmony balance mentioned in this study is the expected harmony goal between humans and water in the near future, based on their current situation. Therefore, harmony balance constraint can be expressed as follows: where HD0 is the expected minimum harmony target value for the balance of human development and water resources protection, and HD_ and HD— are the lower and upper limitations of the harmony target value, respectively. Harmony identiﬁcation was used to identify the contribution of each indicator to the harmony degree of humans and water. There are many different methods that can be used for harmony identiﬁcation, such as modeling identiﬁcation methods and non-modeling identiﬁcation methods [41]. In this paper, the non-modeling identiﬁcation method was used to identify the key inﬂuencing factors affecting human–water harmony, as follows [42]: where r0i is gray the correlation degree, r0i ∈ [0,1]; x0(k) and xi(k) are the reference sequence composed of the dependent variable and the comparison sequence composed of the independent variable, respectively; ∆ 0i(k) is the difference sequence; ξ is the resolution coefﬁcient, ξ ∈ [0,1]; k is the number of indicators.",
    "The harmony regulation model was used to regulate the disharmony HWR. The model is based on harmony balance theory. The introduction of the parameter of water demand satisfaction in this model characterized the respective interests of stakeholders and optimized this as the model’s limiting conditions for improving the level of human-water harmony balance. The harmony regulation calculation model was as follows: where X is the decision vector; HD(X) is the harmony degree of humans and water; HD0 is the threshold of harmony target; i = 1, 2, 3, or 4 represents agricultural water use, industrial water use, domestic water demand, and ecological water demand, respectively; ηi is the water demand satisfaction degree of each participant; ηi0 is the water demand satisfaction limit of the participants; Ws is the total amount of water that is utilized for economic and social development; Gs is the maximum amount of available surface water; and WG is the maximum amount of groundwater available. We is the total amount of water used for the ecological environment, and Weco is the minimum water demand for the ecological environment. SI and SD are the discharge of important pollutants from industrial sewage and domestic sewage, respectively, and SRN is the sewage capacity of the water functional area where the river is located. Figure 1 is the framework for the harmonious assessment and regulation of HWR based on the harmony theory method. The speciﬁc steps of this framework are summarized as follows. dimensions of water system health, humanistic system development, and coordination of the human-water system (Table 1a–c). In the table, the candidate indicators were selected from three dimensions, water system in Table 1a, humanistic system in Table 1b, and the coordinated human-water system in Table 1c, for quantifying HWR. In order to avoid information overleap between indicators, correlation analysis method was employed to select mutually independent indicators to avoid the overlap of information between the selected indicators based on previous studies [43]. For each indicator, a simple explanation was added for helping understand the meaning and calculation method of the indicator. The indicators were selected and numbered based on the following consideration. The index numbers start with X, the ﬁrst digit is the criterion level number (1 for HED, 2 for DED, 3 for COD), the second digit is the classiﬁcation level number corresponding to the criterion level, and the third and fourth digits are the index numbers in each classiﬁcation level. For example, the number X1101 means the indicator 01 in the ﬁrst classiﬁcation level of water system. The indicators for reﬂecting the water system were considered from aspects of water resources (X1101–X1104), water environment (X1201–X1203), and the water ecological (X1301–X1302) status. The indicators of humanities system development were considered from social development (X2101–2109), economic development (X2201–X2207), and technology progress (X2301–X2306). The indicators for reﬂecting the coordinated human-water system were considered from water supply (X3101–X3104) and protection and management (X3201–X3205). The ﬁve letters from “a” to “e” are the node values of each indicator in the quantitative calculation of single index harmony degree. They are described in detail in Section 2.4. The symbol “+” in the last column represents positive indicators, indicating that the harmony degree of these indicators increases with the increases of the Note: \\ = dimensionless; a = worst value; b = poor value; c = qualiﬁed value; d = better value; e = the optimal value; + = positive indicator; − = negative indicator. Second, the method named “the single index quantization-multi index synthesis-multi criteria integration method” (SMI-P) was employed to calculate the harmony degree of humans and water [33]. The method included the following three processes: (1) A piece- wise fuzzy membership function was used to map each index to [0,1], and then the harmony degree of each single index in Table 1 was calculated by comparing the measured and corresponding note values of each index (see Equation (1)); (2) the multi-index synthesis method in Equations (2)–(4) was used to calculate the sub-harmony degree of human– water dimensions, i.e., the health degree (HED) of the water system, development degree (DED) of the humanistic system, and the coordination degree (COD) of the human–water system [41]; and (3) the multi-criteria integration method was used to calculate the harmony degree of humans and water for quantifying HWR (see Equation (5)).",
    "Third, a minimum harmonious balance threshold was used to determine whether the harmony degree of humans and water met the deﬁned threshold constraint (see Equa- tion (6)). In this study, we considered that the harmony of HWR was mainly determined by whether the harmony degree of HWR met the minimum harmonious balance threshold constraint. If the constraint was met, the HWR in the region was considered harmonious. Otherwise, the region is considered disharmony and the main affecting factors needed to be identiﬁed and the regulation schemes should be formed to achieve a satisfactory harmo- nious status of HWR in the region. The key factors that affect human–water disharmony were identiﬁed using the harmonious identiﬁcation method in Equations (7)–(9), and then the harmonious regulation method was employed to regulate the disharmony HWR (see Equation (10)). Finally, steps two and three were repeated until the harmony degree of humans and water in the region met the minimum threshold of harmonious balance. Henan Province, located in the central and eastern part of China, is situated at 31°23'~36°22! N and 110°21’-116°39’ E (Figure 2). It has an area of 165,500 km?2, accounting for 1.74% of the total area of China. The province is mainly affected by the monsoon climate, with four distinct seasons, showing a more precipitation in summer [44]. There is more precipitation in the southeast, and less in the northwest. The annual precipitation, which is unevenly distributed, is mainly concentrated in the summer, accounting for 45-60% of the total precipitation. The instability of precipitation easily causes droughts and floods. In the past few years, the rapid economic and social development in Henan province has brought more serious damage to the water resources that were already in short sup- ply. Problems such as water environment deterioration and ecological degradation in the province have gradually emerged. Therefore, to evaluate and regulate the discordant WHR in the province is very important for its sustainable development. The economic and social data in Henan Province from 2006 to 2018 used in this paper were mainly provided by Henan Statistical Yearbooks [45] and Statistical Yearbooks of Urban and Rural Construction [46]; the water resources data from 2006 to 2018 were mainly provided by Henan Water Resources Bulletins and Municipal Water Resources Bulletins [47]. Figure 3 shows the changes of human-water harmony degree over 18 cities in Henan Province from 2006 to 2018. We select the city as a unit in this study mainly due to the limitations of available data. Because the indicators used in this study in Table 1a–c can only obtained from the government websites with the city units. Otherwise, there is no more detailed government public data available. In addition, the interpolation method will bring greater uncertainty, although they can obtain a ﬁner available data. Therefore, to ensure the accuracy of this research, we chose the city as the research unit. However, if ﬁner mesh-based data can be obtained, our method can be applied to the study of human-water relationships at a more reﬁned spatial scale. As the Figure 3 shows, the values of human-water harmony in most cities of Henan Province showed an increasing trend. The single-factor ANOVA analysis was employed to test the increasing trend of human-water harmony degree. For the method, if the signiﬁcance factor is equal to or less than 0.05, the trend change is signiﬁcant. The results showed that the increasing trend of human-water harmony degree in 18 cities of the Henan Province was signiﬁcantly with their values of p < 0.05. By comparing the mean values of harmony degree in 2018 with the value of 0.61 and 2016 with the value of 0.53, the HWR in Henan Province have increased obviously. This is due to the rapid development of China’s recent water conservancy industry. In particular, the ﬁrst comprehensive document on water conservancy was issued in the No. 1 Document of the Central Committee of the Communist Party of China in 2011 [48], which clariﬁed China’s water conservancy development strategy in the new era and determined the policy initiatives, goals and tasks for accelerating water conservancy reform and development. The Henan Provincial Party Committee and the Provincial Government actively responded to the country’s water conservancy construction requirements and an important document for laying the foundation of water conservancy development in Henan, “Implementation Opinions on Accelerating Water Conservancy Reform and Development”, was issued in the same year. The document systematically planed the new ideas and measures for implementing water conservancy reform and development in Henan Province [49]. Since then, large-scale water conservancy construction for solving water issues and protecting water ecology has been carried out. This may be the reason for the improvement of the harmony degree between humans and water in Henan Province.",
    "Among 18 cities in Henan Province, Anyang City has the greatest improvement in human-water harmony degree from 2016 to 2018. On the one hand, Anyang City had the worst human-water harmony in 2006, meaning the greatest potential for improvement. On the other hand, Anyang City has beneﬁted from the massive investment in water conser- vancy construction in recent years. For example, the Sanmenxia Water Conservancy Project constructed in Anyang City is China’s ﬁrst large-scale water conservancy project. The project has played a huge role in ﬂood control, ice prevention, silt reduction, energy conver- sion, emission reduction income, water supply, greening, transportation and recreation [50]. The difference of human-water harmony degrees between cities was also shrinking year by year, indicating that the HWR between cities in Henan Province is developing towards a spatially balanced direction. The results are consistent with the results of temporal and spatial changes of population-water-economic-society in Henan province carried out by Guo et al., (2015) [51]. However, it is worth noting that although the HWR in Henan has been greatly im- proved in the past 13 years, the overall level is still very low. Only less than half of the cities have a human-water harmony degree greater than 0.7, which is the acceptable threshold. No city has a harmony degree greater than 0.8. Figure 4 is the spatial distribution of harmony degree between human and water in Henan Province from 2006 to 2018, which shows that the harmonious relationship between human and water was unevenly distributed, and the southwest cities of the Henan Province is better than the northeast cities. The result of the single factor ANOVA test indicated that the difference of harmony degree among 18 cities in Henan Province was signiﬁcant with the analysis p < 0.05. Water resources showed the characteristic of more water in the hilly areas of southwest Henan Province and less water in the plain areas of its northeast regions. The spatial distribution of water resources was obviously not balanced with water demand of the Henan Province. The plain areas in eastern and northern regions of the province, which is an important grain production base in China, were densely populated and dominated by grain-producing. However, the severe water shortage in these regions directly restricts the sustainable development of the local national economy. According to statistics from Henan Provincial Statistical Yearbooks and Water Resources Bulletins, the population of the 10 cities in the northern and eastern Henan plains (Anyang, Hebi, Puyang, Xinxiang, Zhengzhou, Kaifeng, Shangqiu, Xuchang, Luohe, Zhoukou) accounted for 54.6% of the total population of the province (at the end of 2015). However, the area of these regions occupied 40% of the total area of the province. Among them, 43.4% are arable land (at the end of 2014). Water resources in these regions were 12.34 billion m3, which accounts for about 30.6% of the province’s total available water resources. The remaining 8 cities in the southern and western hilly areas (Xinyang, Zhumadian, Nanyang, Sanmenxia, Luoyang, Pingdingshan, Jiaozuo, Jiyuan) of the Henan Province has amount of water resources about 28.01 billion m3, which accounts for about 70% of the province’s total water resources. In 2006, among the 18 cities in Henan Province, there are three cities with a human- water harmony degree lower than 0.45 (red area in the ﬁgure), namely Puyang, Anyang, and Kaifeng. This may be caused by the low precipitation in these regions, leading to serious water shortage. According to the Henan Provincial Water Resources Bulletin in 2006, the precipitation was low in these regions. Among them, Puyang has the largest precipitation deviation compared with the multi-year average precipitation with the value of 22.4%, followed by Anyang City with the value of 12.8%. In 2018, the level of human- water harmony in almost all 18 cities of the Henan Province has been signiﬁcantly improved. The degree of human-water harmony in all cities reached the value above 0.6. During this period from 2006 to 2018, the implementation of a lot of water conservancy management policies in Henan Province such as the construction of water ecological civilization, river chief system, and water ten regulations played an important role in the improvement of human-water harmony. In order to determine the main inﬂuencing factors affecting the level of human-water harmony in each city, we carried out in-depth analysis from different dimensions and indicator levels of human-water harmony.",
    "Figure 5 shows the human-water harmony degree of the three dimensions (HED, DED, and COD) from 2006 to 2018. It can be seen from the ﬁgure that HED showed unstable ﬂuctuations with small changes over time, while DED and COD showed a gradual increasing trend. Therefore, it can be concluded that DED and COD are the main driving forces to improve the harmonious HWR in Henan province in the past 13 years. and water ecology, which are affected by both natural and human factors, showed a low human-water harmony degree with a value below 0.6 in most cities. This is also the main factor that affects the discordant HWR in Henan Province. In addition, it is found that the HED in the south is signiﬁcantly better than that in the north, which is reﬂected in three aspects. In terms of water resources, according to the previous analysis, the water resources condition in the South has obvious advantages over those in the North, but the conditions are affected by natural factors, so it is difﬁcult to effectively improve them. In terms of water environment, according to the Henan Provincial Ecological Environment Bulletin, among the four major river basins from north to south in Henan Province, only the Yangtze River Basin in the south has excellent water quality, and the other three major river basins (Haihe River Basin, Yellow River Basin, Huaihe River Basin) are all lightly polluted. The overall water quality of rivers in the province is poor, and the potential for improvement of water environment quality is great. Therefore, improving the water environment is a key point to improve the level of human-water harmony. In terms of water ecology, according to the “Eco-environmental Status Evaluation Technology According to the Regulations (HJ192-2015), the overall ecological environment quality of Henan Province is rated as “average”. Only the southern areas of Pingdingshan, Sanmenxia, Xinyang, Nanyang and other southern areas are rated as “good”, and other regions are rated as “average”. Aquatic ecology mainly reﬂects the ecological functions of the water system, which is difﬁcult to ﬁgure out related index data. In this study, the green coverage rate of the built-up area and the degree of satisfaction of the ecological environment water demand are used as substitutes for characterization. The inter-annual changes of these two indicators are small and it is difﬁcult to improve. Being the central hinterland of China, Henan Province is an important transportation hub connecting the east to the west and the north to the south. It is also a large agricultural and populous province in China. Economy and technology in Henan province are also constantly developing and improving. This is also the reason why DED has shown a con- tinuous increasing trend in the past 13 years. The DED in Henan Province has continuously increased from the level below the medium value in 2006 to the level close to the better value in 2018. Judging from the development potential of Henan Province, DED still has the potential for further improvement. COD consists of water supply and management and protection subsystems. The reason why COD is also increasing is the result of the continuous adaptive adjustment of the water supply structure and the more complete water management and protection work. In terms of water supply, it is difﬁcult to make effective adjustments in the short term due to the adjustment of the industrial structure. In terms of management and protec- tion, China has promulgated and implemented many policies related to water resources management and protection (including the Most Stringent Water Resource Management System, Construction of Water Ecological Civilization, Ten Policies of Water Resources Management and River Chief Management System, etc.), and continue to explore and advance on the road to improve HWR. In order to further clarify the speciﬁc indicators that cause the disharmony of HWR, based on the analysis of the various dimensions of HWR, we compared and analyzed the single-index harmony degree under each dimension in 2018, as shown in Figure 6. In the ﬁgure, the greener the area corresponding to the indicator of each city in Henan Province, the greater the positive effect of the indicator on the city’s human-water harmony degree. On the contrary, the redder the area, the greater the negative effect on human-water harmony degree in the city. After analysis, we found that there are many main indicators that affect human-water harmony degree. For example, X1101, X1102, X1104 in HDE; X2202, X2204, X2205, X2306 in DED; and X3102, X3104 in COD have a greater negative effect on human-water harmony degree compared with other indicators. In addition, the same indicator has different effects on human-water harmony in different cities. For example, X2204 has a positive effect on human-water harmony in Zhengzhou, but it has a negative effect on human-water harmony in Hebi, Xinxiang and Jiaozuo. However, according to the analysis above, we can see that there are some indicators that are difﬁcult to intervene and adjust, such as water resources related indicators and water ecology related indicators. After excluding these uncontrollable indicators, combined with the harmony identiﬁcation method, we ﬁnally screened out the indicators that are more sensitive to HWR and easy to improve. They are: HDE(X1201, X1202, X1203); DED(X2204, X2205, X2301); COD(X3203, X3204, X3205).",
    "In HDE, the indicators of X1201, X1202, and X1203 all belong to the water environment subsystem. This is because human activities have the most direct and strong impact on the water environment, and the source control of pollutants can effectively improve the water environment. In DED, the indicators of X2204 and X2205 reﬂect the industrial structure of a region. It can be seen from the table that the industrial structure of Henan Province is not very healthy. The GDP of most cities is still highly dependent on industrial development, while the proportion of the tertiary industry is relatively small. There is still much room for the adjustment of the overall industrial structure. In addition, the water consumption per 10,000 yuan of GDP in Henan Province still has the potential for further compression compared with developed regions. In HDE, the water supply structure is difﬁcult to change and adjust in a short period of time, while water management and protection are relatively easier to improve and advance. According to the previous description of harmony balance, the harmony regulation model put forward in 2.7 was applied to regulate HWR in Henan Province, based on the reference level of the human-water harmony degree in 2018. The target threshold and constraint conditions for the harmony balance were determined for each city of the province. Because of the serious pollution in Henan Province [52], the minimum target threshold of human–water harmony was set to be 0.7 in 2018. When each city reached this threshold, a satisfactory level of harmony balance was considered to have been achieved, which means the status of the HWR in the city is “harmony”. Through the harmony identiﬁcation in Section 3.4, the following indicators with a low harmony degree needed to be regulated: X1201, X1202, X1203, X2204, X2205, X2301, X3203, X3204 and X3205, all of which are of great signiﬁcance. Therefore, the regulation of the human–water relationship in Henan Province was mainly focused on the above-mentioned aspects. After determining the above content, we adopt a step-by-step optimization method [53] to set different control scenarios (change the index value with a ﬁxed step) within a reasonable range of indicators to achieve a dynamic evaluation of human-water harmony. After simulating through constant replacement of the control scenarios, and a control scenario that meets the target setting is ﬁnally found. The regulation results are shown in Table 2. According to the regulation results, it was found that Luoyang, Pingdingshan, Sanmenxia, Nanyang, Shangqiu, Xinyang, Zhumadian, and Jiyuan are areas that do not need to be regulated, and other regions are regulated according to key inﬂuencing factors. Through regulation and control, the human-water harmony degree of each city has reached the expected harmony level, which proves that the level of human-water harmony in Henan Province still has a large room for improvement, and also veriﬁes the effectiveness of the human-water harmony control ideas mentioned in this article. Note: \\ = dimensionless; the variables with numerical values are the values of the variables after regulation, and the variables without numerical “/” indicate that no regulation is required. In fact, many existing methods can be used to or help to further improve our proposed framework. For example, (1) As an alternative to the indicator selection method used in this study, the DPSIR method may be able to better identify evaluation indicators. Because the method focuses on supposed causal relationships in a clear way that appeals to policy actors and can be used to analyze socio-economic and ecological issues. (2) The social hydrological model has advantages of obtaining social hydrological index with long time series and high temporal and spatial resolutions. Therefore, this kind of method may be able to combine with our proposed research framework from the following two aspects. First, solving no gauge observations or low spatial and temporal resolution problems of indicators in the indicator system used in this study. Because social hydrological models can be used to obtain the complete indicator data with complete time series and high spatial and temporal resolutions. Second, it can be used to the harmony regulation in our proposed framework. Because the introduce of a social hydrological model can help to connect the relationship between the main impact indicators and their affecting factors such as meteorological and topographical factors. (3) Many regression analysis methods can be applied to identify the main inﬂuencing factors, which is critical to regulate the discord HWR. (4) The method of qualitative system dynamics can help to study the interdependence of various factors within the human-water system. Based on the indicators selected by DPSIR method, combining with qualitative system dynamics and correlation analysis methods, the preliminary selection indicators can be further selected, and indicators with high importance and low relevance can be set as the ﬁnal evaluation and regulation in accordance of the harmony degree of HWR.",
    "In order to better apply the framework and method proposed in this article to water resources management, our further research will mainly focus on: (1) Further exploration of the selection of indicators and node values, and better application of different levels of human activity impact and needs for water system protection; (2) Further research on the setting and quantiﬁcation of the target value, so as to make the setting of the target value of harmony balance theory more reasonable and quantiﬁed. Thus, to reduce the inﬂuence of human factors; (3) Explore how to apply more methods of studying the HWR in the research framework proposed in this article. The purpose of the study is to propose a harmony-based framework for assessing the harmony of HWS. A clear process for harmony assessment and regulation of HWS is described in the framework, including index system construction, harmony assessment, identiﬁcation of main affecting factors, and harmony regulation of HWS. The proposed framework is applied to Henan Province in China for assessing and regulating the harmony development of HWS in the Province. The results showed that: The method proposed in this article can quantitatively evaluate and regulate the harmonious relationship between human and water, but there are still some problems that need to be further considered. First, the construction of the evaluation index system for human-water harmony may vary from person to person. How to build a uniﬁed and perfect index system involves further effort. Second, in the single-index quantitative calculation, the selection of each index node value is considered subjective. How to avoid this problem needs to be further studied. Author Contributions: Conceptualization, Q.Z.; methodology, C.H.; software, W.L.; validation, C.H.; formal analysis, C.H.; investigation, W.L.; resources, H.Z.; data curation, J.M.; writing—Original draft preparation, W.L.; writing—Review and editing, Z.L.; funding acquisition, Q.Z. All authors have read and agreed to the published version of the manuscript. Funding: This research was funded by the National Natural Science Foundation of China, grant number U1803241, 51779230 and 51909091, and the China Postdoctoral Science Foundation, China (No. 2019M660329 and 2020T130017)."
]