[
    "Abstract: Urban renewal is a crucial strategy to address issues such as inefficient land use, aging infrastructure, and environmental pressures in the process of rapid urbanization. Zhengzhou, the capital of Henan Province in central China and a key economic hub in the Central Plains region, faces challenges including low land utilization, deteriorating community environments, and insuf- ficient public spaces. Micro-space renewal, as a cost-effective urban renewal approach, can enhance urban vitality and optimize residents' living conditions. This study focuses on micro-space renewal practices in Zhengzhou, employing a mixed research approach, including case studies, GIS spatial analysis, and surveys to assess micro-space utilization and gather stakeholders' input. The research combines cultural preservation with functional optimization, proposing strategies that integrate green design and digital technology. The findings demonstrate that optimized micro-space renewal can significantly improve public space quality, residents' well-being, and overall urban vitality, of- fering valuable insights for urban renewal in other medium-sized cities. Zhengzhou, as a key city in central China, has undergone profound changes in its urban spatial structure against the backdrop of rapid economic development. However, the city’s swift expansion has also led to challenges such as land resource waste, frag- mented functional spaces, and inadequate public facilities. This is especially evident in the utilization of micro-spaces, which face issues like low utilization rates, poorly de- signed spaces, and disconnect from residents’ needs [1]. Micro-spaces typically refer to small public areas in urban environments, such as corner plots, street corner green spaces, and idle vacant land. Despite their small size, these spaces play a crucial role in supple- menting urban functions and enhancing residents' quality of life [2]. Copyright: © 2024 by the authors. Submitted for possible open access publication under the terms and conditions of the Creative Commons Attribution (CC BY) license (https://creativecommons.org/license s/by/4.0/). Urban renewal, as a comprehensive approach to optimizing both the function and image of a city, not only focuses on large-scale infrastructure development but increas- ingly emphasizes refined governance at the micro-level. Through the proper renewal of micro-spaces, communities can be revitalized, urban environments improved, regional cultures preserved, and resources utilized more efficiently. Therefore, exploring the prac- tical path for micro-space renewal in Zhengzhou is of significant importance for promot- ing sustainable urban development and improving residents' well-being. The theory of urban renewal originated in the mid-20th century from the modern urban redevelopment movement, which emphasized the optimization of functional areas, the renovation of deteriorating communities, and ecological design to achieve urban re- newal [3]. For instance, the United Kingdom focuses on \"bottom-up\" community partici- pation in its renewal projects, while Japan emphasizes integrating local culture and green design during the renewal process. In contrast, urban renewal practices in China have primarily centered on the redevelopment of shantytowns and the upgrading of old resi- dential neighborhoods. In recent years, however, there has been a shift toward more re- fined and detailed approaches to urban renewal. Research on micro-spaces in China is still in its early stages, with existing literature mainly focusing on the reuse and functional activation of urban edge spaces. For example, some studies highlight the value of \"pocket parks\" for residents’ leisure and urban green- ing [4]. However, there is a lack of systematic theoretical frameworks and practical path- ways for micro-space renewal. Furthermore, several common issues in micro-space re- newal have been identified: A. Disconnection between planning and implementation, leading to resource waste. B. Neglect of the actual needs of community residents, resulting in low post-renewal usage rates. The objective of this study is to explore the theoretical foundations and practical path- ways for micro-space renewal in Zhengzhou. The focus is on how to optimize the effi- ciency of micro-space utilization in the context of rapid urban development, integrating regional culture and green design concepts to propose actionable renewal strategies. The specific research objectives are as follows: Urban renewal theory is a systematic approach to addressing the inefficiency of old spaces and resources in urban development. Its core focus is on optimizing urban func- tions and enhancing community vitality. The functional space optimization theory em- phasizes improving land-use efficiency and functional layout to enhance the overall coor- dination and practicality of urban spaces. The community vitality theory posits that urban renewal is not merely a physical transformation of spaces but also a reconstruction of so- cial relationships. By enhancing resident participation and promoting community inter- action, micro-spaces can serve as a crucial link to stimulate social vitality [5].",
    "Micro-spaces refer to small, scattered areas in urban environments, such as street cor- ner green spaces, vacant lots, and pocket parks. These spaces are characterized by their small size and dispersed distribution, but they have significant functional potential. The importance of micro-spaces in urban renewal can be summarized in the following aspects: C. Community Cohesion: Micro-spaces provide low-cost, accessible areas for daily social interactions, contributing to a stronger sense of community belonging. Micro-space renewal requires a multidimensional approach that integrates ecological planning, sociology, and spatial design. Ecological planning focuses on green design and sustainability, promoting the development of low-carbon cities by incorporating environ- mentally friendly practices into the renewal process. Sociology emphasizes understand- ing residents' needs and fostering community interaction, ensuring that the renewal ef- forts address the diverse requirements of different social groups. Spatial design, on the other hand, involves creative layouts and landscape optimization to enhance the function- ality, attractiveness, and utilization of micro-spaces. By combining these disciplines, mi- cro-space renewal can not only improve the physical environment but also strengthen social cohesion and contribute to sustainable urban development [6]. By reviewing relevant domestic and international literature on urban renewal and micro-space research, this method systematically summarizes existing theoretical achievements and practical experiences. It also identifies gaps in current research, provid- ing theoretical support and methodological basis for this study. This study selects representative communities, neighborhoods, and urban villages in Zhengzhou for case analysis. The selection criteria include various functional types (e.g., commercial streets, residential communities) and different scales of micro-spaces (e.g., pocket parks, small street nodes). The objective is to summarize the successful experiences and lessons learned from these typical cases, providing practical insights for the develop- ment of micro-space renewal strategies. This study employs GIS technology to analyze the distribution and utilization effi- ciency of micro-spaces in Zhengzhou. Data sources include the Zhengzhou Planning Bu- reau, publicly available geographic data, and field survey data. The analysis focuses on the distribution characteristics of micro-spaces, their service coverage, usage density, and the relationship with surrounding functions. The findings, presented through visualized analysis, provide scientific support for spatial renewal planning. This study uses surveys and in-depth interviews to understand the needs and atti- tudes of various stakeholders, including community residents, developers, and urban planners. The survey design covers topics such as micro-space usage frequency, satisfac- tion, and renovation needs. Interviewees include residents, community managers, and experts in urban renewal. The aim is to ensure that the renewal strategies accurately ad- dress practical needs, enhancing the effectiveness of post-renewal usage. As the capital of Henan Province, Zhengzhou has faced multiple challenges resulting from rapid urbanization, including economic development and population growth. In re- cent years, the city has actively promoted urban renewal, with a focus on projects such as the redevelopment of urban villages (chengzhongcun) and the renewal of old industrial areas. Urban village redevelopment is a key component of Zhengzhou's urban renewal strategy. With the city's expansion, many urban villages have been surrounded by urban areas, leading to outdated infrastructure and poor living conditions, which have become major challenges for urban governance. In recent years, the city has adopted a combina- tion of government-led initiatives and market forces to drive redevelopment, achieving some success in improving land-use efficiency, such as the transformation of villages around the Science Avenue in the High-tech Zone. However, due to financial pressures and issues with interest distribution, some projects have progressed slowly or even stalled, with ongoing challenges such as difficulties in land acquisition, demolition, and insuffi- cient supporting infrastructure. Zhengzhou's traditional industrial areas, such as some industrial lands in Guancheng District, have lost their vitality due to industrial transformation. These areas commonly face issues like idle land and dilapidated factories. In response, the government has used policy guidance to convert certain industrial areas into cultural and creative parks or in- novation incubators, such as the transformation of the Cultural and Creative District in Zhengdong New Area, which has injected new economic vitality into the city. However, some market renewal projects, such as the renovation of old wholesale markets, have failed to adequately consider the needs of nearby residents in their planning and design, leading to high vacancy rates and limited social benefits post-renewal [7].",
    "Micro-spaces, as small public areas or scattered zones within urban environments, play a significant role in the urban renewal of Zhengzhou. However, their utilization re- mains problematic in the following areas: Many micro-spaces, such as street corner green spaces, small plazas, or abandoned factory areas, suffer from inefficient use or prolonged vacancy due to a lack of compre- hensive planning and insufficient maintenance. This inefficiency not only wastes valuable urban resources but also fails to meet the residents' needs for improved living environ- ments. In some already-renovated micro-spaces, there remains a significant gap between the design of facilities and the actual needs of residents. For example, while some pocket parks in the Erqi District have high green coverage, they lack amenities such as play- grounds for children or spaces for elderly activities, leading to low usage rates. Addition- ally, the absence of essential infrastructure, such as nighttime lighting and security moni- toring, further limits the frequency of use and overall user experience. In order to deeply understand the current situation and problems of micro-space re- newal in Zhengzhou, this paper selects the typical areas of Erqi District and Guancheng District for analysis: Erqi District has implemented several pocket park projects in recent years to improve the living environment of residents. Successful cases, such as the small green space renewal project along the Jinshui River, which greatly improves the satisfac- tion and utilization rate of residents by adding walking trails, fitness equipment and night lighting. However, there are also some failure cases, such as some pocket parks are not designed to fully consider the age structure of the surrounding population and have sin- gle facilities, leading to low utilization of children and elderly groups [8]. The objective of micro-space renewal is to achieve a balance between urban function- ality, cultural value, and the needs of residents. In the context of rapid urban development, many micro-spaces have been neglected or inefficiently utilized. Through proper renewal, these spaces can better serve both the city and its inhabitants. For example, transforming abandoned street corners into small parks not only increases the city’s green space but also provides a recreational area for residents, thereby enhancing urban functionality. At the same time, by integrating local cultural elements, such as the architectural style of historical buildings or the display of traditional crafts, the renewal process helps to pre- serve and promote regional cultural values, while meeting residents' demands for a higher quality living environment. A. Green Sustainable Development: This principle emphasizes the importance of eco- logical protection and the rational use of resources in the process of micro-space renewal. For example, the use of permeable paving materials can facilitate natural water infiltration, thereby reducing surface runoff. The planting of native species not only lowers mainte- nance costs but also enhances ecological stability. Additionally, utilizing renewable en- ergy technologies, such as solar-powered lighting, can help reduce energy consumption. B. People-Centered Approach: The renewal of micro-spaces should start with meet- ing the needs of residents. During the design process, the diverse needs of various user groups should be fully considered. For instance, accessible facilities should be provided to facilitate the mobility of the elderly and people with disabilities, while children's play areas should be included to cater to the recreational needs of children. Comfortable seat- ing and shading facilities should also be incorporated to offer residents spaces for relaxa- tion and social interaction. C. Multi-Stakeholder Participation: Micro-space renewal involves various stakehold- ers, including the government, communities, businesses, and residents, and should en- courage the participation of all parties. The government can play a key role in providing policy guidance and financial support. Communities can organize residents to participate in the planning, design, and construction processes. Businesses can contribute technical and financial resources, while residents can offer their needs and suggestions and actively participate in the maintenance and management of the renewed spaces. A. Activation design of the street micro-space: Increasing green space in street micro- spaces not only enhances the aesthetic appeal of the environment but also improves air quality and regulates the microclimate. These areas can be landscaped with flowers, shrubs, and trees, providing a visually attractive space throughout the seasons, while also serving as places for residents to relax and interact. Additionally, optimizing pedestrian pathways by using colorful paving materials and clear signage can enhance safety and comfort, separating walking areas from vehicle traffic. Ensuring sufficient width for pe- destrian pathways helps accommodate flow, preventing congestion and enhancing mo- bility.",
    "B. Multi-Functional Configuration of Community Public Spaces: Convenience facili- ties, including trash bins, public toilets, and bicycle parking stations, should be integrated into community public spaces to support residents' daily needs. Additionally, charging stations and vending machines can be added to cater to diverse requirements. Activity spaces, such as basketball courts, badminton courts, and fitness areas, should be provided based on residents' needs, offering opportunities for exercise and recreation. Organizing community events, such as sports competitions and cultural performances, can further strengthen community cohesion and promote social interaction. A. Preservation and Continuation of Regional Culture: During the micro-space re- newal process, it is essential to focus on the protection and continuation of regional culture. This can involve the restoration and preservation of historical buildings and traditional neighborhoods, maintaining their original appearance and characteristics. Additionally, integrating regional culture into micro-spaces through cultural exhibitions and artistic B. Integration of Cultural Landmarks into Micro-Space: Cultural landmarks should be integrated into micro-spaces to create culturally distinctive areas. For example, the sur- rounding micro-spaces of cultural facilities such as museums and libraries can be reno- vated to include cultural squares, art promenades, and other features that foster a strong cultural atmosphere. Moreover, these cultural landmarks can attract tourists and stimu- late the development of the surrounding economy. Encouraging residents to actively participate in the micro-space renewal process is essential for establishing a resident co-construction model. This can be achieved through community meetings, surveys, and other methods to gather residents' needs and opinions. Residents should be involved in the planning, design, and construction stages, allowing them to become the main contributors to the renewal of micro-spaces. Additionally, es- tablishing a resident supervision mechanism will help ensure the quality and effectiveness of the micro-space updates. A. Policy Guidance: Relevant policies should be developed to encourage social par- ticipation in micro-space renewal. For instance, land policies can be introduced to allow enterprises and social organizations to utilize vacant land for micro-space renewal. Addi- tionally, planning policies can incorporate micro-space renewal into the broader urban planning framework. B. Financial Support: A dedicated fund for micro-space renewal should be estab- lished to reward and subsidize exemplary renewal projects. Furthermore, the government can guide social investments into micro-space renewal through mechanisms such as gov- ernment procurement of services. In summary, micro-space renewal is a vital initiative for achieving sustainable urban development. By defining clear renewal goals and principles, adopting effective strategies, and strengthening community participation and policy support, it is possible to create well-functioning, culturally distinctive, and environmentally friendly micro-spaces, en- hancing the quality of urban life and residents' well-being [9]. This study uses Zhengzhou as a case study to explore the theoretical foundations and practical pathways of urban micro-space renewal, and derived the following key conclu- sions: Micro-spaces, as an essential component of urban renewal, enhance spatial efficiency and improve community living quality and residents' well-being through functional op- timization and resource integration. The practices in Erqi and Guancheng districts demon- strate that effective micro-space renewal can increase regional attractiveness and promote the synergistic development of urban economy and social activities. Micro-space renewal should not only focus on the physical transformation of the en- vironment but also deeply integrate regional cultural characteristics. The combination of cultural preservation and functional innovation enhances the uniqueness and lasting ap- peal of the updated micro-spaces, while also increasing residents' cultural identity and participation. This approach not only revitalizes urban spaces but also strengthens com- munity engagement and social cohesion. This study has certain limitations in terms of case selection and data analysis. For example, the number of selected cases is limited, making it difficult to fully reflect the micro-space renewal situation across different regions of Zhengzhou. Additionally, the sample coverage of the questionnaire survey is relatively narrow, which may affect the applicability of some conclusions. Furthermore, the evaluation of renewal outcomes lacks long-term follow-up, failing to comprehensively reflect the sustained impact of micro- space renewal. A. Integrating Big Data and GIS Technology: By collecting more comprehensive spa- tial usage data, the accuracy of the study could be improved. B. Applying AI Technology: AI tools could assist in analyzing resident behavior and needs, optimizing renewal planning and design proposals. C. Strengthening Long-Term Impact Assessment: Conducting long-term follow-up evaluations of renewal outcomes would help generate more valuable practical insights and improve the effectiveness of micro-space renewal projects [10].",
    "With the advancement of smart city construction, micro-space renewal is expected to play an increasingly important role in enhancing urban resilience and livability: Future micro-space renewal projects could incorporate more smart technologies, such as intelligent lighting, real-time monitoring, and interactive devices, to improve the functionality and convenience of these spaces. Micro-space renewal will not only contribute to urban functional improvement but can also be integrated with ecological conservation and cultural industry development, creating multi-dimensional synergies that provide sustainable momentum for urban growth. By learning from the micro-space renewal experiences of advanced international cit- ies, and adapting them to local conditions, Zhengzhou can explore an update model that blends global vision with local characteristics, helping the city become a more attractive and modern urban hub."
]