[
    "Abstract: Since the 1990s, Foreign Direct Investment (FDI) has played a more and more important role in the economic development of Henan Province. Especially in recent years, FDI has always played an important role in the technological progress and economic transformation of Henan Province. This article uses a combination of theoretical and empirical methods. The first step analyzed the relevant domestic and foreign research situation, at the same time demonstrated the article's empirical analysis ideas and analysis methods, and analyzed the current situation of the current FDI introduction in Henan Province, using the entropy method to quantify the status of independent innovation capability in Henan Province. In the empirical study, we selected data from Henan Province for 10 years, selected the comprehensive evaluation value of independent innovation capability of Henan Province as the dependent variable, FDI and foreign trade dependence degree as two main independent variables to conduct linear regression analysis and examine them through cointegration test. The causal relationship between. The research results show that: FDI has a positive effect on the development of independent innovation capability in Henan Province. The article finally proposes corresponding policy recommendations based on the previous theoretical and empirical research. As the process of global economic integration accelerates, innovation has become the soul of the knowledge-based economy. It plays a crucial role in the prosperity of a society and even a country. Since our country entered a new stage of development, the role of scientific and technological innovation and technological progress in improving our economic development, enhancing our competitiveness and comprehensive national strength internationally has become increasingly significant. Enhancing innovation capabilities not only meets the external demands of building an innovative country but also achieves the intrinsic goal of enhancing our comprehensive competitiveness. Therefore, continuously improving our country's independent innovation capabilities is one of the important ways to achieve long-term and stable economic development in our country. immediate attention. This paper will conduct empirical research in Chapter 3 to explore the impact of FDI on Henan Province's independent innovation capabilities and the ways in which FDI and its technology spillover effects affect Henan Province's independent innovation capabilities. The final chapter of this paper will propose independent innovation capability enhancement strategies that are in line with Henan Province's development strategy, taking into account the reality of FDI and independent innovation in Henan Province. It will also provide practical and actionable recommendations to improve Henan Province's independent innovation capabilities and enhance its comprehensive development. In light of the current development situation, this paper further explores the relationship between foreign investment in Henan Province and its independent innovation capabilities. With a more open attitude towards economic transformation and the development of an innovative society, Henan Province has attracted an increasing number of foreign capital and foreign enterprises due to its superior transportation conditions and abundant human capital. In 2021, the actual utilization of foreign direct investment (FDI) in Henan Province reached 21.073 billion US dollars. The technology spillover effects of FDI have received increasing attention. Through the inflow of foreign capital or advanced technology, promoting the region's own technological development through the internal digestion of the host country or region has become one of the important ways in which FDI influences the innovation capacity of a region. The scale of FDI expansion on a global scale has attracted significant attention. How Henan Province seizes opportunities, fully utilizes and better utilizes FDI to promote its economic development and technological innovation, and how to minimize the risks that FDI may bring while enjoying its benefits are all important issues that deserve research and ; Independent innovation, also known as endogenous innovation, refers to the process whereby an organization utilizes its internal knowledge assets and capabilities to create novel products and services, leveraging its own intellectual Property rights and core technologies [1]. Independent innovation has garnered significant attention im China. Chinese scholars have primarily focused their research on independent innovation in three areas: 1. Factors influencing independent innovation capabilities: Chinese scholars have conducted extensive research on the factors that influence an organization or region's independent innovation capabilities. These studies typically focus on three key stages: innovation input, transformation, and output. Xie, et al., (2019) explore the key factors of the governance of S&T Innovation Platforms, and discuss the logical relationship between the factor [2][3][4].",
    "capabilities: Scholars have also explored the development of evaluation systems to assess and measure independent innovation capabilities. Different scholars have proposed various evaluation indicators and methodologies, resulting in a diverse range of evaluation frameworks [5][6][7]. 3. Empirical analysis of independent innovation capabilities: Scholars have conducted empirical analyses to examine the relationship between independent innovation capabilities and various outcomes, such as economic growth, productivity, competitiveness, and technological advancement [4] [8]. impact of FDI on technological innovation activities. The empirical results indicated a positive promotion effect of FDI on independent innovation [11]. 2. FDI technology spillover has a negative effect on independent innovation capability. Aitken & Harrison (2000) also proposed, while studying the case of Venezuela, that foreign direct investment has a negative impact on the development of host country enterprises [12]. According to the research conducted by Kokko (2001), the effects of technology transfer and technology diffusion are largely determined by the market characteristics and mutual influences between international companies and domestic enterprises [13]. The impact of FDI on independent innovation capability is specifically manifested through the technology spillover effects of FDI and its influence. The main viewpoints regarding the impact of FDI technology spillover effects on independent innovation capability can be categorized into the following three directions: 1. FDI technology spillover has a positive effect on independent innovation capability. Since Mac Dougall first raised the issue of FDI spillover effects, the technology spillover effects of FDI have attracted extensive theoretical and empirical research. Blomstrom (2001) proposed that competition effects, imitation effects, personnel training and mobility effects, as well as backward and forward linkages, are the main pathways through which FDI spillover effects impact independent innovation capability [9]. Caves was the first to employ econometric methods in studying FDI spillover effects. After analyzing data from the Australian industry, he concluded that there was a positive correlation between the share of foreign direct investment in industry assets and the productivity of local firms, indicating a positive effect of FDI in that industry in Australia [10]. Cheun (2004) measured regional innovation capability using patent applications from different regions and empirically tested the 3. The impact of FDI technology spillover on independent innovation capability requires a comprehensive analysis. Kavita (2003) and Dieter (2010) have empirically demonstrated that if we aim to promote the innovation capability of local firms through the utilization of FDI, it is essential to consider not only the type of FDI being introduced but also factors such as the strength of local intellectual property protection, economic development conditions, and the human capital of local enterprises. These factors play a significant role in the impact of FDI on independent innovation capability. 1. Independent innovation capability (Y;). This study comprehensively considers the macroeconomic and social environment and constructs an evaluation index system for independent innovation capability in Henan Province. It includes three primary indicators: innovation input, innovation spillover, and innovation output, with a total of 3 primary indicators and 11 secondary indicators. 2. FDI(FDI,). The selection of independent variables should consider the relationship between various indicators and the dependent variable, and then make the selection from them. As the core variable in this empirical analysis, FDI is the most important indicator. Therefore, the actual utilization 3. Human capital stock (HC;). This study selects two indicators, namely, the human capital stock and foreign trade dependence, which are widely recognized in domestic and foreign literature, as independent variables that affect the FDI spillover effects. Based on the theory of human capital and \"development thresholds\" by Borenztein, Gregorio, and Lee in 1998, the interaction between foreign direct investment and human capital is considered an important factor in measuring whether FDI will have an impact on independent innovation capability. 4. Foreign trade dependence (F7D,). Foreign trade dependence is commonly expressed as the ratio of total import and export trade volume to the Gross Domestic Product (GDP) of a country or region during a certain period. This indicator can reflect the degree of outward orientation of a region. Therefore, in this study, the foreign trade dependence of Henan Province over the years will be included as a variable in the empirical model. Based on the constructed evaluation index system for independent innovation capability and the empirical model, this study selects time-series data from Henan Province for the years 2012 to 2021 as the sample. All indicator data in this study are sourced from \"China Statistical Yearbook (2013- 2022),\" \"Henan Statistical Yearbook (2013-2022),\" and \"China Science and Technology Statistical Yearbook (2013- 2022),\" ensuring the scientific and effective nature of the data.",
    "Based on the established model, the organized data will be subjected to empirical analysis using statistical software. Following the empirical research method, the first step is to conduct a stationarity test on the model. Based on the results displayed in the table, it can be determined that the series used for empirical analysis are all second-order integrated series, indicating that all the series are stationary. With the characteristic of stationarity confirmed, we can proceed with further empirical research. Based on the previous section's results of the stationarity test for each variable series, we will now use the EG cointegration test to examine whether there is a cointegration relationship between the dependent variable and the independent variables. The first step is to perform an OLS regression on the original model to obtain the residual series. Then, a stationarity test is conducted on the residual series, and the results are shown below: From the OLS regression equation, it can be observed that in the 10-year time series results, the values of the regression model exceed 0.9, indicating a relatively high goodness of fit for the model. The regression coefficient for the explanatory variable FDI is 0.56, and the absolute value of the t-statistic for the regression coefficient is greater than the critical value of to.05/2(10-2)=2.3 1. The significance of the regression results indicates that the role of FDI in promoting the development of independent innovation capability in Henan Province is significant. The regression coefficient for the explanatory variable \"human capital stock\" is 0.2928, and the absolute value of the t-statistic test for the regression coefficient exceeds the critical value of toos2(10-2) = 2.31. The significant regression results indicate that the human capital stock has a significant impact on the dependent variable Y. In theory, export dependency should have a promoting effect on the improvement of independent innovation capability. However, empirical results indicate that this explanatory variable does not have a significant impact on enhancing independent innovation capability. The reason for this result is partially attributed to the limited data collected, with only a few decades of data available. Additionally, the single model used may not accurately capture the complex relationship between factors such as total import and export trade, GDP, and independent innovation capability in the region. The stationarity test of the residuals rejects the null hypothesis, indicating the rejection of the hypothesis that there is no cointegration relationship. It accepts the hypothesis that there is at least one cointegration vector, suggesting the presence of a cointegration relationship between the selected dependent and independent variables. Although this equilibrium relationship may experience fluctuations, these fluctuations are temporary. In the long run, there is still an equilibrium relationship between the variables. Firstly, foreign direct investment (FDI) does indeed have a certain degree of impact on enhancing the independent innovation capability in Henan Province. However, the level of regional economic development and other locational factors also influence the region's ability to absorb foreign irect technology. This study only examines the impact of FDI on the independent innovation capability in Henan Province. Different regions have variations in economic levelopment level, economic openness, infrastructure, human capital, and economic structure, which affect their investment attraction, absorption capacity, and innovation capability. The inflow of FDI generates different technology spillover effects in terms of direction and intensity among ifferent regions, leading to varying effects on the pace of technological progress in domestic sectors. Secondly, the stock of human capital in a region also has a certain influence on independent innovation capability. The flow effect of human capital is one of the important means through which FDI's technology spillover effect affects regional independent innovation capability. The impact of human capital flow is reflected when foreign-invested enterprises in the recipient region provide training to local employees, which enhances their skills, promotes labor productivity, and increases the company's profitability. This is known as the human capital effect brought about by FDI. Human capital is one of the decisive factors in determining whether a company can gain an advantageous position in market competition. When employees of the invested enterprise become familiar with foreign companies’ management methods, production technology, and product research and development skills, the company gains the ability to fully utilize the technology spillover effect. This indicates that FDI has a certain \"development threshold\" when influencing regional independent innovation processes. The stock of human capital is one of the important indicators that form this threshold. Whether a region possesses an abundant stock of human capital is a crucial indicator for assessing its ability to absorb FDI and thereby influence Finally, the empirical results indicate that the impact of export dependency on independent innovation capability in Henan Province is not significant. Theoretically, the degree of a region's openness has a certain influence on its independent innovation capability. This suggests that the level of import- export trade and economic development in Henan Province still needs to be further improved. GDP can be used to evaluate a region's economic development. Regions with higher economic development have sufficient human and material resources to support innovation activities, naturally driving continuous improvement in innovation capability. Additionally, import-export trade is directly related to a region's degree of openness and serves as an important factor in promoting technological development. Based on the empirical analysis results, it can be concluded that to enhance a region's independent innovation capability, the first step is to focus on improving the region's economic level. Only then can the region's GDP provide adequate support in terms of human, material, and financial resources required for independent innovation activities."
]