[
    "Aim: This study utilizes the Slippery Slope Framework (SSF) to examine the impact of information technology (IT) on tax compliance among SMEs in Henan Province, China. Findings: The findings indicate that the widespread application of IT significantly promotes tax compliance through both direct and indirect effects. However, the influence of tax authorities' power on tax compliance is weaker than the influence of taxpayers' trust in tax authorities. Therefore, tax authorities should continue leveraging IT and place greater emphasis on building trust, improving services, and reducing compliance costs to enhance the relationship between tax authorities and taxpayers, ultimately improving tax compliance. Conclusions: This study addresses the gap in previous research by integrating IT as a comprehensive evaluation metric, correcting the overemphasis on technology and the lack of theoretical connection. However, it does not consider the potential risks of IT and the differences in IT application effects across regions. Taxes constitute the primary source of national fiscal revenue, enabling governments to redistribute resources and regulate the economy effectively. Ensuring tax stability is a fundamental budgetary objective for all nations. Nonetheless, tax evasion remains a pervasive issue globally. Tax evasion undermine the government's fiscal capacity to fund public services, leading to Li, Y., Paino, H., Zin, N., M. (2024) The Intermediaries in the Relationship Between Information Technology and Tax Compliance: Power and Trust imbalances in the tax structure and negatively affecting the fair distribution of tax burdens and economic outcomes (Slemrod and Yitzhaki, 2002). Consequently, enhancing taxpayer compliance is vital for the economic and social prosperity of a country (Al-Maghrebi et al., 2022). The study of tax compliance initially emerged with the economic deterrence theory. In recent years, there has been a growing emphasis among scholars on taxpayer behavior and psychological factors. Furthermore, the advent of information technology has led numerous countries to incorporate IT into their tax management systems. The application of information technology is reshaping the nature of the accounting profession (Atayah & Alshater, 2021), and may have a significant impact on taxpayer compliance in the future. Thus, a deeper exploration of this field of knowledge is necessary. a phenomenon particularly pronounced among small and medium-sized enterprises (SMEs). To enhance tax administration and improve compliance, the Chinese government initiated the Golden Tax Project in 1994. The implementation of the third phase of the Golden Tax Project in 2016 has significantly strengthened the role of IT in China's tax management. The new system allows tax administrators to track economic activities of enterprises from various sources and assists auditors in estimating the real tax burden of enterprises, promptly identifying tax violations. Additionally, user-friendly software reduces compliance costs for taxpayers and improves the quality of service provided by tax authorities. Furthermore, transparency of information and standardization of processes regulate the behavior of tax officials, promoting tax fairness. The rapid development of IT in China's tax administration is subtly transforming the relationship between tax authorities and taxpayers. Recently, the research on the impact of IT on tax compliance primarily focuses on the role of specific technology in reducing tax evasion. For example, block chain technology is utilized to enhance third-party verification capabilities and improve tax compliance (Adelekan et al., 2024; Fatz et al., 2019). However, many governments are attempting to establish comprehensive information reporting systems rather than relying on a single technology, and Li, Y., Paino, H., Zin, N., M. (2024) The Intermediaries in the Relationship Between Information Technology and Tax Compliance: Power and Trust there is scant evidence showing the impact of integrated IT adoption on tax compliance (Li et al., 2020). Moreover, scholars have concentrated more on the deterrent effect of IT applications in tax administration on taxpayers, with insufficient research on how IT can improve the relationship between taxpayers and tax authorities and promote voluntary tax compliance. Additionally, some studies place excessive focus on technology and models without adequately connecting them to tax compliance theories (Bassey et al., 2022), which restricts the theoretical understanding of tax compliance behavior. This paper, based on the Slippery Slope Framework (SSF), treats IT as an integrated concept to study its overall impact on the governance capacity of tax authorities and the relationship between taxpayers and tax authorities. Specifically, the paper explores the direct and indirect effects of IT on tax compliance from two perspectives: the impact on the governance capacity of tax authorities and the impact on taxpayers' trust in the government. By analyzing survey data, this paper provides causal evidence of the impact of IT on the tax compliance of small and micro enterprises (SMES). Understanding these dynamics enables tax authorities to better design tax policies, not only enhancing tax governance capacity but also fostering taxpayers' sense of integrity, thereby achieving stable fiscal revenue.",
    "power of authorities in fostering overall tax compliance (Kastlunger et al., 2013; Kirchler et al., 2008). Enforced compliance is determined by power, while trust determines voluntary compliance. Enforced compliance refers to taxpayers who comply due to the fear of penalties or losses after weighing the potential benefits of evasion against the potential costs. The primary methods of enforced compliance include tax audits and penalties. When the probability of audits is higher and penalties are more severe, it signifies greater power of tax authorities. According to the SST, there is a positive correlation between the power of tax authorities and tax compliance. Voluntary tax compliance refers to taxpayers who voluntarily disclose their income, accurately calculate their taxes, and file tax returns on time. This implies that taxpayers generally perceive tax authorities as well-intentioned and beneficial, leading to a sense of moral responsibility and an intrinsic motivation to fulfill their tax duties Li, Y., Paino, H., Zin, N., M. (2024) The Intermediaries in the Relationship Between Information Technology and Tax Compliance: Power and Trust (Hanifah, 2019). The higher the taxpayers' trust in the government, the higher their voluntary tax compliance, showing a positive correlation between the two. Thus, it can be seen that tax compliance has a positive correlation with both the power of tax authorities and taxpayers' trust in the tax authorities. influences the control of tax avoidance and tax risk. On the one hand, IT enhances tax authorities' ability to identify tax bases by increasing information transparency, thereby improving efficiency and accuracy (Okunogbe & Santoro, 2023; Alaimo Di Loro, Scacciatelli, and Tagliaferri, 2023; Politou, Alepis, and Patsakis, 2019). Simultaneously, modern data analysis tools enable automatic cross-checking with other data sources, enhancing tax authorities' supervision and enforcement capabilities (Okunogbe & Santoro, 2023; Abedin et al., 2020; Kumar, Singh, Handa, and Shukla, 2020). The immense potential of IT in detecting tax fraud is evident through the transparency of information and the advanced predictive tools provided by big data analysis. Therefore, the application of information technology in tax administration increases the power of tax authorities, enhances their governance capabilities, and deters taxpayers On the other hand, the widespread use of IT has optimized and standardized tax procedures, improving taxpayer services, reducing compliance costs (Edmond Ofori, 2020; Huiskers-Stoop & Gribnau, 2019), and reducing opportunities for collusion between tax officials and taxpayers (Putra & Setiawan, 2020); (Edmond Ofori, 2020), which promotes tax fairness. This fosters a more harmonious relationship between taxpayers and tax authorities, thereby increasing tax compliance. Furthermore, IT facilitates effective information exchange between businesses, tax authorities, and auditors, thereby enhancing tax services (Fatz, Hake, and Fettke, 2019). Therefore, the application of tax information technology systems had a positive and significant effect on taxpayer compliance (Sentanu & Budiartha, 2019). Based on the above analysis, we propose the following hypotheses: Li, Y., Paino, H., Zin, N., M. (2024) The Intermediaries in the Relationship Between Information Technology and Tax Compliance: Power and Trust This research was conducted in Henan Province, China. The reason for choosing this location is that China's transition from a phase of rapid economic growth to high-quality development requires tax compliance to ensure fiscal revenue and an increased standardization of tax administration to cultivate taxpayers' awareness. As a developing country, China faces low tax compliance, however, IT represented by the GTP is rapidly being applied to various aspects of tax administration. Which is bound to have a significant impact on the future landscape of tax compliance. Henan has similar economic development situation with China. In 2023, it ranked sixth in total GDP, and twenty-fifth in per GDP, with significant variations between different cities. The population of this study is the small business owners in Henan Province, China. Small and medium-sized enterprises (SMEs) represent a weak link in China's tax compliance management. On one hand, taxpayers have a low awareness of tax obligations; on the other hand, due to the large number of SMEs, it is challenging for tax authorities to comprehensively oversee all of them. The data collection method used in this study is the questionnaire. The design of the questionnaire items is based on existing scales. Data obtained is from the results filled out by EMSe taxpayers, including perceptions of the Li, Y., Paino, H., Zin, N., M. (2024) The Intermediaries in the Relationship Between Information Technology and Tax Compliance: Power and Trust application of information technology in tax administration and self-assessment of the impact of information technology on their tax compliance behavior.",
    "The data analysis technique used in this study is PLS-SEM (Partial Least Squares Structural Equation Modeling). The main reasons include: i) Exploratory Nature of the Study: This study adds two variables based on the SSF framework and the model also differs from SSF. The primary purpose is to explore and develop a new research framework. PLS-SEM is more suitable for exploring new theories. ⅱ) Non-Normal Data: PLS-SEM has fewer assumptions about data distribution, making it more flexible and suitable for non-normally distributed data. In cases where the data does not meet the assumption of multivariate normality, PLS-SEM is more robust and does not require this assumption, making it a better choice (Hair et al., 2019). For the analysis tools, we used the SmartPLS 4 software (Ringle et al., 2005). To ensure the credibility and validity of the research findings, this study first examined reliability and validity. Cronbach’s α was measured to test whether the questionnaire has good internal consistency (Henseler et al., 2009). The value of Cronbach’s α ranges from 0 to 1, with higher values indicating greater internal consistency of the questionnaire. According to the proposed threshold value for confirmatory research, Cronbach’s α should be greater than 0.700, but values must not be lower than 0.600. Additionally, this study conducted tests for convergent validity and discriminant validity. Convergent validity refers to the degree to which the measures of similar constructs are highly correlated. It indicates how strongly different indicators of a latent variable are correlated. Higher convergent validity means that these indicators collectively reflect the same latent variable. In contrast, discriminant validity refers to the degree to which the measures of different constructs are not highly correlated. It indicates how well a latent variable can be distinguished from other latent variables. Li, Y., Paino, H., Zin, N., M. (2024) The Intermediaries in the Relationship Between Information Technology and Tax Compliance: Power and Trust Specifically, the evaluation of convergent validity includes the following assessment indicators in this study: ⅰ) Factor Loadings: These are the standardized coefficients between latent variables and observed variables in the measurement model, indicating the extent to which observed variables reflect latent variables. High factor loadings indicate that the observed variables reflect the latent variables well. Each indicator's standardized factor loading on the latent variable should be greater than 0.70 and significant at the 0.050 level (Chin, 1998). ⅱ) Composite Reliability (CR): This measures the consistency of all observed variables within a latent variable (or construct). The CR value ranges from 0 to 1, and a value greater than 0.70 is typically considered acceptable, indicating good internal consistency of the latent variable. ⅲ) Average Variance Extracted (AVE): This is one of the indicators used to assess the consistency and validity of latent variables (or constructs). The AVE value ranges from 0 to 1, and a value greater than 0.50 is typically considered acceptable. It indicates that the observed variables in the construct explain more than half of the variance, demonstrating good convergent validity (Fornell and Larcker, 1981). The evaluation metrics for discriminant validity also include three indicators: ⅰ) Fornell-Larcker Criterion: According to the Fornell-Larcker standard, the AVE of each latent variable must be higher than the square of the correlation with all other latent variables (Henseler et al., 2009). ⅱ) Cross Loadings: The factor loading should be greater than the cross loading. ⅲ) Heterotrait-Monotrait Ratio (HTMT): HTMT value should be less than 0.85 to ensure discriminant validity. As shown in Table 1, the Cronbach's alpha for each variable is greater than 0.7, and the CR values for all variables exceed 0.7, with AVE values greater than 0.5. The R²values reflecting the explanatory power of the independent variables on the dependent variables are 0.369, 0.208, and 0.247, respectively. Table 2 shows the outer loadings, which reflect the strength of the relationship between observed variables and latent variables. The factor loadings for the majority of items are greater than 0.7, although some items have loadings between 0.6 and 0.7. Discriminant validity was evaluated by calculating the values of HTMT, Cross Loadings, and the Fornell-Larcker Criterion. As shown in Table 3, all HTMT values are less than 0.85. In Table 4, the factor loadings highlighted in red are greater than their corresponding cross loadings, indicating that the loading of each indicator is higher for its designated construct than for any of the other constructs, and each of the constructs loads highest with its own items (Chin, 1998). Table 5 presents the AVE for each latent variable, which is higher than the square of the correlation with all other latent variables, indicating that the Fornell-Larcker criterion is met. Cross-loadings also allow us to assess the discriminant validity and indicate if an item has a higher correlation with its latent variable compared to the remaining latent variables in the model (Henseler et al., 2009).",
    "include: Coefficient of Determination (R²), Path Coefficients, Effect Size (f²), and Predictive Relevance (Q²). R² measures the explained variance of a variable relative to its total variance, with values of approximately 0.670 considered substantial, around 0.333 moderate, and around 0.190 weak (Chin, 1998; Ringle, 2004). Path coefficients are standardized coefficients used to measure the strength of the causal relationship between latent variables, reflecting the size and direction of the direct impact of one latent variable on another, and should be analyzed in terms of their algebraic sign, magnitude, and significance (Huber et al., 2007). f² is an effect size indicator that reflects the relative contribution of a latent variable in the predictive model. It measures the impact on the target latent variable's explained variance when a latent variable is removed from the model. f² values of 0.020, 0.150, and 0.350 indicate the predictor variable’s low, medium, or large effect in the structural model, respectively (Cohen, 1988; Chin, 1998; Ringle, 2004). The Q² statistic measures the predictive relevance of a block of manifest variables, with higher Q² values indicating more predictive relevance. Model modifications are evaluated by comparing Q² values. The proposed threshold value is Q² > 0, and positive Q² values indicate that the PLS model has better predictive performance than using the mean as a predictor. Additionally, Variance Inflation Factors (VIF) values were calculated to check for collinearity. VIF < 3.3 indicate that the collinearity test is passed for the inner model matrix (Kock & Lynn, 2012). By running Bootstrapping with 5000 resamples, the stability and significance of the path coefficients were evaluated. Table 6 summarizes the relationships between latent variables, displaying R², f², and Q² values. It shows that the path coefficients from IT, power, and trust to tax compliance are 0.314, 0.147, and 0.294, respectively. The path coefficients from IT to power and trust are 0.456 and 0.497, respectively. The P-values are all less than 0.05. The f² values for IT, power, and trust to tax compliance are 0.103, 0.027, and 0.102, respectively, and the f² values for IT to power and trust are 0.262 and 0.329, respectively. All Q² values are greater than 0, and all VIF values are less than 3.3. Table 7 shows that the impact of IT on tax compliance (COM) is significant, with an effect coefficient of 0.314. The impact of IT on power is significant, with an effect coefficient of 0.456. The impact of IT on trust is significant, with an effect coefficient of 0.497. The impact of power on tax compliance (COM) is significant, with an effect coefficient of 0.147. The impact of trust on tax compliance (COM) is significant, with an effect coefficient of 0.294. The presence of mediation effects can be determined by calculating the special indirect effects. Special indirect effects refer to the indirect effects transmitted through specific mediating variables. In simple terms, it indicates the impact of an independent variable on a dependent variable through one or more mediating variables. When the T-value is greater than 1.96 or the P-value is less than 0.05, it signifies significance, indicating the presence of mediation effects. Tables 8-10 show that the total effect of IT on tax compliance (COM) is 0.527, and the total indirect effect is 0.213. Specifically, the special indirect effect of IT on COM through power is 0.067. This effect can be decomposed into the impact of IT on power (0.456) and the impact of power on COM (0.147). Additionally, the special indirect effect of IT on COM through trust is 0.146. This effect can be decomposed into the impact of IT on trust (0.497) and the impact of trust on COM (0.294). The P-values are all less than 0.05, indicating that the path effects are significant. Model Fit is an indicator used to assess the consistency between the fitted model and the actual data. Model fit helps researchers determine to what extent their theoretical model reflects the structure of the observed data. This study selected the Standardized Root Mean Square Residual (SRMR) and Goodness of Fit (GOF) to evaluate the model fit. SRMR represents the difference between the observed correlation matrix and the model correlation matrix. An SRMR value less than 0.08 indicates a good model fit. An SRMR value between 0.08 and 0.10 may indicate a moderate model fit, which is acceptable but requires cautious interpretation of results. An SRMR value greater than 0.10 is generally considered a poor model fit, necessitating improvements to the model.",
    "Goodness of Fit (GOF) is a measure of the overall fit of the model, combining the quality of the measurement model (through Average Variance Extracted, AVE) and the quality of the structural model (through R²values). The formula for calculating GOF is: GOF= . When GOF is less than 0.1, it indicates very poor model fit, requiring significant modifications to both the measurement model and the structural model. A value between 0.1 and 0.25 Li, Y., Paino, H., Zin, N., M. (2024) The Intermediaries in the Relationship Between Information Technology and Tax Compliance: Power and Trust indicates low fit, suggesting that the model fit is low and improvements may be needed for some measurement indicators or path relationships of latent variables. A value between 0.25 and 0.36 indicates moderate fit, meaning the model fit is average; although acceptable, there is still room for improvement. A value greater than 0.36 indicates high fit, demonstrating that the model has a good fit, explaining and predicting the data well, and researchers can have high confidence in the model's results and conclusions. From the table 11, it is shown that the SRMR value is 0.086, which does not meet the requirement of being less than 0.08. Other indicators of model fit need to be tested to assist in the judgement. Therefore, this study calculated the GOF value, which is 0.403. Through measurement model assessment, it can be seen that Cronbach's alpha values are all greater than 0.7, indicating a high degree of consistency among the items in measuring their respective latent variables. Both CR and AVE meet the requirements, also indicating good internal consistency and high correlation between the observed variables and latent variables. Additionally, most outer loadings also meet the requirements. Although some indicators are below the threshold, the AVE, Cronbach's alpha, and CR values are all within acceptable limits and close to the threshold. Therefore, we retained these items. From the above analysis, it can be concluded that the measurement variables are highly correlated with the latent variables, and the measurement variables can effectively reflect the latent variables, with each latent variable having good internal consistency. Conversely, the results from the Fornell-Larcker criterion, HTMT, and cross-loading indicate the presence of discriminant validity among different constructs. According to these three criteria, it can be inferred that the models' Li, Y., Paino, H., Zin, N., M. (2024) The Intermediaries in the Relationship Between Information Technology and Tax Compliance: Power and Trust constructs differ sufficiently from one another, meaning that the latent variables are independent of each other. Therefore, the measurement model has good discriminant validity. The predictive ability of the measurement model can be assessed using R², f², and Q². An R² value greater than 0.33 for IT on tax compliance is considered to have moderate explanatory power, while an R² value greater than 0.19 for IT on power and trust is considered to have a certain degree of explanatory power. The results of f² indicate that IT, power, and trust have a predictive effect on the tax compliance model, but the predictive effect is small. Additionally, IT has a predictive effect on both power and trust, with a medium effect size. Furthermore, the Q² values indicate that the prediction errors of the PLS model are smaller than those obtained by using the mean, suggesting that the model has predictive ability. Therefore, it can be concluded that the model has predictive capability. Additionally, this study utilized VIF to demonstrate that the model does not have multicollinearity. Regarding the evaluation of model fit, since the SRMR value is between 0.08 and 0.09, it is not possible to directly determine the model fit, and other indicators need to be considered. GOF, as a supplementary fit index, emphasizes the overall explanatory power of the model, while SRMR emphasizes model fit and residual issues. Using both together can provide a more comprehensive assessment of model fit. By calculation, GOF=0.403. Therefore, the model has good explanatory and predictive power, and the research results are credible and valid. Path coefficients and mediation effect results indicate that all paths have P-values less than 0.05, representing significant paths. Specifically, the positive regression coefficient of information technology (IT) on tax compliance among SMEs in Henan Province is 0.527, demonstrating that the widespread application of IT can significantly enhance tax compliance. This finding is consistent with previous research (Didimo et al., 2020; Tian et al., 2016). More specifically, the direct effect of IT on tax compliance is 0.314, and the indirect effect is 0.213. The indirect effect of IT through trust is 0.146, and through Li, Y., Paino, H., Zin, N., M. (2024) The Intermediaries in the Relationship Between Information Technology and Tax Compliance: Power and Trust power is 0.067, both with P-values less than 0.05, indicating the presence of significant mediation effects. However, the mediation effect through the power of tax authorities is relatively weak.",
    "The limited mediation effect of power on tax compliance can be attributed to varying views on its impact. While many scholars argue that power is a crucial factor influencing tax compliance and have empirically demonstrated a positive correlation between the two (Wahl et al., 2010; Batrancea et al., 2019), others contend that excessive power can undermine taxpayers' trust in tax authorities, potentially reducing tax compliance (Mas' ud et al., 2019). Our findings show a positive correlation between power and tax compliance, with an effect coefficient of 0.147, which is lower than the effects of trust and IT on tax compliance. Additionally, trust may enhance taxpayers' intention to comply with the tax system, aligning with previous research findings (Mas' ud et al., 2019; Batrancea et al., 2019). This could be because, with the reform of the tax system, more taxpayers seek respect and better service experiences, thereby increasing voluntary compliance. In contrast, the acceptance of coercive compliance through deterrence is low. In recent years, the rapid implementation of the GTP in China has significantly altered taxpayers' processes and experiences. The widespread promotion of the GTP by the government, media, and tax service intermediaries has also influenced taxpayers' expectations of tax administration, thereby changing their tax compliance behavior. Our study results show that IT has a direct impact on power with a coefficient of 0.456 and on trust with a coefficient of 0.497, both of which are significant. This aligns with previous research that indicates the use of IT can enhance the power of authority , emphasizing enforced compliance (Bing-xi et al., 2022; Li & Wang, 2022). IT promotes compliance by improving tax administration departments' ability to identify tax bases or tax pools and by automatically cross-checking self-reported tax obligations with other data sources, significantly enhancing the departments' oversight and enforcement capabilities (Zhang et al., 2020). This has led to improved tax compliance (Bing-xi et al., 2022; Li & Wang, 2022). Additionally, IT optimizes processes, improves service quality, reduces compliance costs, and promotes fairness. The application of tax administration Li, Y., Paino, H., Zin, N., M. (2024) The Intermediaries in the Relationship Between Information Technology and Tax Compliance: Power and Trust technology also helps to standardize enforcement actions, reducing opportunities for collusion between tax officials and taxpayers (Bing-xi et al., 2022; Yan et al., 2020), thereby enhancing taxpayer trust (Okunogbe & Santoro, 2023). In summary, the widespread application of information technology directly impacts tax compliance. It also has an indirect impact by influencing the authority of tax agencies and taxpayers' trust in these agencies, consistent with previous research findings. However, the traditional view that power is the most important factor influencing tax compliance is evolving. Taxpayers seem to value their experiences and relationships with tax authorities more. Moreover, the significant impact of information technology on tax administration has notably influenced taxpayers' behavior. Through the analysis, it can be concluded that the research hypotheses of this study are supported, as detailed in the table below. This paper, based on the Slippery Slope Framework (SSF), treats IT as an integrated concept to study its overall impact on the governance capacity of tax authorities and the relationship between taxpayers and tax authorities. The study explores the impact of IT on tax compliance among small and SMEs in Henan Province, China. The analysis of path coefficients and mediation effects Li, Y., Paino, H., Zin, N., M. (2024) The Intermediaries in the Relationship Between Information Technology and Tax Compliance: Power and Trust indicates that IT significantly enhances tax compliance. Specifically, IT has a direct positive effect on tax compliance, with a coefficient of 0.314, and an indirect effect of 0.213, mediated by trust (0.146) and power (0.067). These effects are statistically significant, with P-values less than 0.05. power of tax authorities and enhances taxpayers' trust, with path coefficients from IT to power and trust being 0.456 and 0.497, respectively. These results align with previous research suggesting that IT can enhance the authority of tax agencies and promote enforced compliance. However, in this study, the effect of tax authorities' power on tax compliance is relatively small, while the influence of taxpayer trust on tax compliance is more substantial. This shift may be due to the reform of the tax system, where taxpayers increasingly seek respect and better service experiences, fostering voluntary compliance. In contrast, the acceptance of coercive compliance through deterrence is low.",
    "These findings indicate that tax authorities need to shift their management strategies. The traditional reliance on audits and penalties may be diminishing in effectiveness. Instead, tax authorities should focus on improving taxpayer services, enhancing perceptions of fairness, reducing compliance costs, and minimizing corruption. By improving relationships with taxpayers, the ultimate goal of increased tax compliance can be achieved. The research supports the hypotheses that IT can directly influence tax compliance and can also indirectly affect tax compliance by influencing the power of tax authorities and the trust of taxpayers. This provides theoretical support for the role of IT in promoting tax compliance, considering the comprehensive effects of IT and addressing the current research gap that often emphasizes the impact of specific technologies without integrating theoretical perspectives. In conclusion, this study enriches the understanding of how information IT impacts tax compliance, highlighting the importance of trust in tax authorities. The findings suggest that tax authorities should focus on building trust to improve tax compliance. Additionally, the evidence on the effects of IT will benefit tax administrations by offering insights into effective tax policy design. By emphasizing the role of trust and leveraging IT, tax authorities can Li, Y., Paino, H., Zin, N., M. (2024) The Intermediaries in the Relationship Between Information Technology and Tax Compliance: Power and Trust While this study primarily focuses on the positive impacts of IT on tax compliance, it does not mention the challenges and risks inherent in IT applications. For instance, data transparency might damage taxpayers' trust if it infringes on their privacy. Balancing the benefits and potential risks of IT applications in tax administration is a crucial area for future research. Additionally, conclusions drawn in different social environments may not be entirely consistent. Considering the potential regional differences, future research should apply this conceptual framework to different countries or regions for comparative analysis. This will provide a deeper understanding of the potential and risks of IT on voluntary compliance from multiple dimensions."
]