[
    "**Country and Area Studies Academy, Beijing Foreign Studies University, Beijing, China ***Institute of Economics, Kyrgyz National University named after Jusup Balasagyn, Bishkek, Kyrgyz Republic Abstract: Rural tourism, as an area of the tourism industry, demonstrates a steady growth trend, highlighting the importance of implementing measures to optimise it for the economic and socio-cultural prosperity of the regions. The purpose of the study is to develop recommen- dations for optimising and strengthening the promotion of rural tourism in Henan Province, which will contribute to the sustainable development of the region, the preservation of its cultur- al and natural legacy, and improving the living standards of the local population. The following methods were used: descriptive, deductive, generalisation and comparative analysis. The results of the study determined that Henan Province, with its rich cultural legacy, historical monu- ments, and nature, has essential prerequisites for the development of rural tourism. The analysis of the current state of this tourism industry in the region has identified the main problems and barriers faced by rural tourism in the process of its improvement. Therewith, it was established that investment difficulties, uneven infrastructure development, lack of qualified personnel in the field of tourism and the lack of effective programmes limit the potential of rural tourism in this region. Strategic recommendations include fostering local investments, implementing digi- tal marketing strategies, and initiating community education programs in tourism basics. Spe- cial attention needs to be paid to optimising approaches to the development of this area at the local level to form a productive regional strategy in the field of tourism, which will contribute to economic growth, create new jobs, form appropriate marketing strategies for promoting tourism products, support environmental initiatives, use digital technologies and improve the well-being of the province in general. The practical importance lies in the possibility of using the results of the study by researchers who study the basics of rural tourism development and specialists in the tourism industry. Rural tourism is on the threshold of global development, providing incredible opportuni- ties for regions seeking to diversify their economies and attract tourists to unique cultural and natural attractions. In recent years, the Chinese government has actively supported the development of rural tourism as one of the key areas of the economy (Wei & Hu, 2022). Considering the rich cultural, historical, and natural legacy of the country, the regions of China provide unique opportunities for immersion in the conventional way of life, complementing classic urban tourism (Zhou, 2021). This not only contributes to the economic development of remote areas but also creates conditions for the preservation of cultural legacy and the strengthening of social ties between cities and villages. However, the development of rural tourism in the regions of China is not without problems and challenges. It is necessary to balance commercial success and sustainability, the preserva- tion of traditions, the introduction of innovations, the needs of the local population, and the expectations of tourists. Henan Province, known for its unique traditional and natural resources, faces the task of determining the optimal way to improve rural tourism. The possibility of diversify- ing the tourist flow, attracting investments, and preserving and promoting cultural legacy – all makes rural tourism an attractive destination for promotion (Mahadevan et al., 2021). However, despite its potential, the development of this industry faces several prob- lems that require careful analysis and competent solutions. There is a question of creating a high-quality infrastructure, developing marketing strategies, attracting investments, and ensuring sustainable development in this area. Henan Province has all the necessary re- sources for the successful development of the leisure industry. But, without competent research and adequate planning, resources for its implementation may be inefficiently used or lost. Therefore, the problem of this study is to optimise the ways of rural tourism development in Henan for the implementation of the socio-economic development plan of the area. Considering the above problems, it is important to look for comprehensive solu- tions adapted to the regional features of the state. There are many papers devoted to the examination of rural tourism in its various as- pects and regions. Thus, Kozhokulov et al. (2019) analyse the level of influence of various factors on the development of tourism. They assess the relationship between this industry and the socio-economic fields of the Issyk-Kul region. Due to the quantitative assessment, the researchers examined the mechanisms of the impact of rural tourism on the general condition of one of the most visited regions of Kyrgyzstan. Usmonova et al. (2022) con- sider all subjects of the tourism industry in the regions. Their study presents an associa- tion of opinions of tourists and stakeholders on the sustainable development of public tourism in Asian countries. The authors identify the components of cooperation on which the socio-economic development of the population in remote areas is based. Aziz (2023) explores the sustainable development of tourism in rural areas. The mechanisms of an alternative paradigm for the development of this industry using the approach of evalua- tion research are reflected. The author focuses on the use of modern methods for analys- ing the effectiveness of the development of the examined area, considering modern tech- nologies and digital capabilities.",
    "In addition, Aidarova et al. (2022) explore financial elements that interact with eco- tourism and management. The researcher emphasises the importance of financing the agricultural sector in tourism for the sustainable maintenance of environmental and other components that rural regions improve. The author notes the effectiveness of rural tour- ism development with careful consideration of seasonal, climatic, natural, biological, agro-industrial, and land factors present in a particular region, considering their condi- tion and the level of investment. Nair et al. (2020) identify the conceptual components of rural tourism. The researchers focus on the responsible development of rural tourism in Asia. They emphasise the concept of harmony, which should permeate all stages of rural tourism development in provincial areas and be considered in all possible initiatives aimed at promoting this industry. However, little has been examined about the current state of rural tourism in China, in particular, in Henan Province, its problems, features, and opportunities that affect the search for optimal ways to promote this activity, includ- ing marketing strategies, infrastructural development, cultural legacy, and involvement of the local population. The purpose of the study is to form optimisation recommendations for the economic and socio-cultural development of regional rural tourism in Henan Province. In this re- gard, the following tasks can be highlighted: The material and methodological basis of the study consisted of the following meth- ods: descriptive, deductive, generalisation and comparative analysis. The descriptive method at the stage of considering the features of Henan province allowed for deter- mining in detail and systematically the current state of rural tourism in this area, considering the parameters and characteristics of the services offered. It helped to identify the key problems and barriers that hinder the development of rural tourism in this region and information on the availability and quality of infrastructure neces- sary for the development of tourism: roads, housing, recreational areas. Its elements determined the allocation of local and natural components, which form the basis of the unique tourist products of the province and the local population. This method allowed for identifying the reaction, the attitude of the local population to the devel- opment of rural tourism, and ways to involve residents in this process to create joint projects. It helped to form theoretical data to assess the economic benefits of rural tourism development and to understand which investments can be justified. The descriptive method allowed a complete and in-depth understanding of the features of rural tourism in Henan province, which became the starting point for further analysis and development of recommendations for its optimisation. The deductive method at the stage of theoretical understanding of rural tourism in Henan province allowed considering general approaches to the development of this industry and identifying basic principles and techniques that can be adapted to spe- cific terrain conditions, considering its unique features. It helped to highlight specific aspects of the development and functioning of rural tourism in Henan based on gen- eral data on tourism in China at the global level. Its elements allowed identifying generally accepted tourism development strategies that are suitable for implementa- tion in the Henan region, considering the cultural, social, and economic characteris- tics of the area. This method allowed the formulation of appropriate hypotheses based on the general principles of tourism development in the rural region and high- lighting their applicability in practice in specific conditions of the province. It helped to conduct a systematic analysis of the situation with rural tourism in Henan Prov- ince, moving from general theoretical knowledge to specific recommendations adapted to the realities of the region. The method of generalisation at the stage of systematisation of information allowed grouping of the collected data, highlighting the main trends and areas of rural tourism development in Henan province. It helped to establish the general principles and patterns characteristic of the development of rural tourism in this area, considering its infrastruc- tural, natural, social, and financial opportunities. This method allowed combining the characteristics of rural tourism in Henan, while emphasising the unique features and prospects of the province for the effective promotion of this industry. Its elements led to the allocation of formulated recommendations for optimising the development of rural tourism in Henan, according to the collected data. It helped to ensure the consistency of the study, enabling the systematic approach to the analysis of the situation and the for- mation of tools that can further improve and accelerate tourism in rural regions, in par- ticular, in Henan Province.",
    "As part of this study, a comparative analysis was conducted to examine the develop- ment of rural tourism in other regions with similar characteristics. These included the Issyk-Kul region of Kyrgyzstan and some rural areas in Southeast Asia. The comparative analysis permitted an evaluation of the principal factors influencing tourism development in these regions, including infrastructure, marketing strategies and community involve- ment. This enabled the identification of potential avenues for the adaptation of best prac- tices in Henan. This approach facilitated the identification of both the strengths and weaknesses of Henan Province in the context of rural tourism development. The tourism industry is undergoing substantial changes, and rural tourism is one of the most dynamic and promising areas. It offers a unique opportunity for tourists to get acquainted with national traditions, land care, and ancient cultural practices. However, for the full development of this area, its optimisation is necessary. Sustain- able and effective development of rural tourism requires scientific planning, demon- stration, investment, and actions at the early stages of promotion (Iannucci et al., 2022). Such activities include the work of the government to attract investors, stand- ardised management of enterprises, construction and operation of enterprises, and productive regulation of relations between the state, organisations, and the local community (An & Alarcon, 2020). Being an important agricultural region in central China, Henan Province is rich in various tourist resources, including historical and cultural sites, natural ecological landscapes and unique local folk culture. Rural tour- ism in this region began to develop in the mid-1990s, starting with the simple opera- For further development and successful competition on the world stage, rural tour- ism requires a serious transformation and modernisation. In the context of Henan Province, optimisation of rural tourism, which is a popular type of recreation, is of great importance since this region is considered the “homeland of Chinese civilisation and nation” (Rosalina et al., 2021). According to the data published by the Ministry of Cul- ture and Tourism of the People’s Republic of China, as in a typical large agricultural area, the resources of rural tourism in Henan account for more than 70% of all the pos- sibilities of the region, where there are 1863 villages and more than 50 thousand villag- es, of which there are 45 key tourist villages and 6 small towns (Henan: Activate rural tourism and help rural revitalization, 2023). Rural tourism is mainly concentrated in large and medium-sized cities and on the outskirts of famous natural scenic spots such as Zhengzhou, Luoyang, Xinxiang, Taihang Mountains, Funyu, Dabi, and Wang. They provide an ecological basis and a rich cultural connotation for the development of this industry (Castro-Arce & Vanclay, 2020). Based on the unique historical and natural features of the region, it is possible to identify its key areas and characteristics of the type of tourism under consideration (Table 1). Therefore, rural tourism in Henan Province is a unique combination of cultural and natural. This makes the region attractive not only for internal but also for inter- national tourists. From the standpoint of spatial distribution, this type of industry is concentrated in two geographical areas. The first is a suburb of large and medium- sized cities, such as the picturesque Cherry Gou district of Zhengzhou, where tourists are most often city employees and working families, whose main goal is to reduce the moral and physical stress acquired at work and home. The second one is connected with the surrounding tourist attractions, such as the picturesque area of South Tai- hang, Luanchuan Chundugou. Such places, as a rule, have beautiful views and pleas- ant climates where tourists can relax among the natural landscapes (Brida et al., 2020). In addition, in well-protected mountainous areas, the government promotes economic advancement by supporting and directing the development of rural tour- ism. Under the dual influence of stimulating tourism consumption and people’s de- sire to return to nature, various investment entities are taking part in the construc- tion of this area. Local governments play an extremely important role in early investment attraction and rural development in Henan Province. However, at present, there is an unreasonable general state planning of rural tourism, unable to coordinate the effective implementation of various policies and to achieve the correct management of investments and marketing processes. Through the standardised construction of the management system, the overall potential of rural tourism remains quite weak, and the involvement of farmers is not high (Liu et al., 2020). Although the management departments of national and local authori- ties allocate special funds every year to support the construction and development of this industry in the region, agriculture, tourism, finance, and other departments lack a unified allocation of financial resources in combination with early state planning. Accordingly, investments and subsequent operations cannot be effectively interconnected, and the lack of rapid response to the infrastructural aspects of Henan Province complicates the process of improving services.",
    "To gain a deeper insight into the position of Henan Province in the context of ru- ral tourism development, it would be beneficial to undertake a comparative analysis with other regions that have encountered comparable challenges and opportunities in this field. By examining the experiences of the Issyk-Kul region in Kyrgyzstan and rural areas in Southeast Asia, it is possible to identify practical solutions and strate- gies that could be adopted by Henan. Table 2 below presents a comparative analysis of these regions across key aspects, including infrastructure, marketing strategies, and community involvement. As illustrated in Table 2, the province of Henan is confronted with several chal- lenges about its infrastructure and the level of community involvement, which could potentially be addressed through the implementation of targeted improvements. For example, the well-developed infrastructure of the Issyk-Kul region, supported by local investment, demonstrates the value of creating incentives for both local and foreign investors in Henan. Similarly, the active social media presence and educational pro- grammes for community involvement observed in Southeast Asia provide a model that could be replicated in Henan to engage the local population and attract a broader range of tourists. This comparative analysis highlights the necessity for Henan to concentrate on stra- tegic enhancements to its tourism strategy, learning from the practices that have been demonstrated to be effective in these other regions. By reinforcing these pivotal elements, Henan can bolster its competitive edge in rural tourism and optimise the advantages for both the region’s economy and its local communities. In areas with developed rural tourism, most of the high-quality resources are in- vested and developed by local organisational groups. Such a process should revolve around regional planning. However, due to the influence of the general level of eco- nomic advancement of Henan Province, this activity for the development of rural tourism is focused on small individual enterprises that organise family stays, campsites, and related research and development. That is, there are not enough large- scale projects for investment in tourism and the development of tourist groups. Ser- vices, products, and the location of picturesque places at the early stages of the devel- opment and construction of rural tourism programmes are quite similar, regardless of the region, and there is no concept of differentiated advertising and marketing, which led to the formation of vicious competition between natural and recreational attrac- tions (Adeyinka-Ojo, 2021). The search for sources of financing, attracting invest- ments, and the development of preferential conditions for local and foreign investors can support the development of infrastructure and the quality of services in the area under consideration. Thus, analysing the current state of rural tourism in the region, it was established that Henan Province has every chance to become one of the leaders in the development of rural tourism in China. Given the wealth of natural and cultural resources and the advantages of geographical location, proper regional planning can lead to long-term economic growth and improve the quality of life of the local population. In addition, it was also established that to achieve this goal, it is necessary to solve several key prob- lems that stand in the way of effective development of this area. Investment issues are the primary obstacles to rural tourism promotion. Despite Henan’s potential, many investors prefer more developed tourist regions. The lack of well-thought-out strategies for promoting this industry makes Henan less attractive to potential tourists. Other areas with various natural and cultural attractions in China are also actively developing rural tourism, which creates additional competition. In general, despite many difficul- ties, with the right approach and planning, Henan has the potential to become the main region of rural tourism in China. Rural tourism in Henan Province has huge potential, but its implementation requires comprehensive and targeted actions fully integrated with local characteristic indus- tries. This will change the conventional model of tourism, which consists of visiting landscapes, eating farm food, harvesting, and fishing (Christou, 2020). It is necessary to stimulate consumption through characteristic industries and increase consumer loyalty, thereby increasing the rate of repeated visits of tourists in rural areas. For example, tourism + cultivation of Chinese medicinal herbs, their deep processing; tourism + sports events; tourism + cultural experience of agriculture; tourism + re- search; tourism + processing of agricultural and related products. Tourism should become a “lever” for the economic development of villages, accompanied by the en- couragement and effective management of related industries, an increase in the add- ed value of agricultural products, improved viscosity and integration between tourism and other areas, and the modernisation of the rural industrial structure. Based on the problems and challenges facing rural tourism in Henan Province, specific measures can be proposed to optimise it (Table 3).",
    "Thus, optimising the development of rural tourism in Henan Province requires an integrated approach, considering many factors and the active involvement of all stakeholders. With the right strategy and support at all levels, this region can become an example of the successful development of rural tourism in China. In addition, it is worth considering that the active involvement of residents in the development of rural tourism contributes to social responsibility and job creation, and the introduc- tion of a programme for the preservation of historical and cultural monuments will stimulate them to this process. Strengthening the construction of rural tourism infra- structure in Henan Province is the key to increasing the attractiveness of the region. In particular, such a process includes the following aspects: preparation of special tourism infrastructure plans, reasonable planning of rural tourism routes and auxilia- ry facilities, increased construction of tourist roads in the province, connection of transport networks and public transport routes, encouragement in the construction and operation of rural boutique hotels and various types of hotels, support in mod- ernisation and transformation conventional farmhouses to improve the accommoda- tion and reception of tourists, environmental restoration, and garbage collection. It is necessary to form a spatial plan for the development of rural tourism in He- nan Province step by step and strengthen the preparation and implementation of appropriate programmes to avoid the need to blindly attract investment to strengthen the leading role of the government in the development of rural tourism. At an early stage of the project, in the process of attracting investments, it is important to strictly and carefully check investment organisations to ensure that tourism enterprises can rationally develop rural tourism opportunities and resources in an orderly, sustaina- ble and scientific manner. This process strengthens the subsequent management and quality of services of tourism enterprises, such as the gradual improvement of rele- vant rules, regulations, and standards; standardisation of the order in the rural tour- ism market; creation of joint law enforcement mechanisms between tourism authori- ties and public security services, industry, trade, planning, and other departments; professional literacy and proper practical training (Ariyani & Fauzi, 2023). However, such mechanisms for optimising rural tourism in Henan Province are possible, pro- vided that the development plan is followed and tourism enterprises are directed to protect rural environmental resources and traditional culture. Among other things, the achievement of ecological rural tourism is a model of sustainable development that reduces the impact on the environment, protects envi- ronmental resources, reduces carbon emissions, and increases resource efficiency. Therefore, environmental sustainability meets the needs of tourists for natural and cultural experiences. As for Henan Province, it is necessary to formulate a scientific environmental plan to avoid large-scale development and overexploitation of re- sources and protect the natural ecological environment of the countryside. Such a process will facilitate the introduction of energy-saving and environmentally friendly building materials and technologies, reduce energy consumption and emissions of pollutants. As part of such an initiative, tourists will be able to use low-carbon transport, reduce carbon dioxide emissions, while creating an effective system of classification and recycling of garbage, and environmental protection and environ- mentally oriented tourism activities (Bakalo & Makhovka, 2024). Optimisation of rural tourism can lead to the creation of new jobs, increase the income of the local population, and stimulate the regional economy. Properly organ- ised and successfully developing rural tourism can become an incentive for the preservation and restoration of historical and cultural sites, which in turn will attract even more tourists (Robina-Ramirez et al., 2023). Effective planning and optimisa- tion of processes to promote this industry can put Henan on the international map as a popular tourist destination. In addition, it is worth considering that the flow of foreign tourists contributes to cultural exchange and increased tolerance between different peoples, and the creation of mobile applications and the introduction of technologies for booking, payment and installation of interactive maps contribute to improving the quality of services, creating new products and expanding the rural tourism market. This suggests that the digitalisation of rural tourism in Henan Prov- ince plays a key role in the modernisation and innovative development of this indus- try, ensuring the sustainable development of the region in the context of globalisation and the digital economy. It not only improves the quality and accessibility of tourist services but also contributes to the economic growth of the region. Modern technolo- gies open up new opportunities for residents, providing them with tools to develop their businesses and attract tourists.",
    "Thus, Henan Province has a huge potential for developing rural tourism. This ar- ea is becoming especially relevant against the background of accelerated urbanisation and the desire of people to relax in a calm, natural environment, far from the hustle and bustle of the city. However, to make the holiday comfortable for tourists and sustainable for the local population and the ecosystem, several optimisation measures are required, and most importantly, the implementation of a comprehensive strategy, which includes investment, training, marketing, and cooperation. These processes are aimed at creating high-quality service, preserving the natural and cultural environ- ment, and economic development. Proper planning and optimisation will allow this area to open up new horizons for the region. Effectively targeted efforts in this area can lead to multiple positive effects that will have a beneficial impact both on the economy of the province and on the lives of its residents in general. Optimisation of rural tourism development processes should seek a balance between the well-being of rural territories and communities and the satisfaction of tourists. Therefore, the planning of tourism activities in remote regions should be based on the analysis of the environment and the assessment of territorial and recreational poten- tials. Chin et al. (2020) believe that all types of planning in the field of rural tourism should be sustainable, integrated with regional characteristics, have a collective charac- ter, and be based on obligations between social and political actors of territorial dis- tricts. Local communities understand that tourism activities provide economic oppor- tunities and the development of a higher quality of life, therefore, in rural areas, this activity is not the only effective way to improve the quality of life. In turn, economic planning of tourism is an activity that combines several phases, such as diagnostics, design, execution, control, and evaluation, which constantly and dynamically interact with each other. There is a common denominator in all rural tourism planning process- es: they are based on an assessment of the territorial tourism potential. The most com- mon observed methodologies begin with an analysis of the situation in the local tourism sector, which includes: supply, demand, competition, and market trends. The data con- sidered by the researchers echo the results obtained, emphasising that for the optimisa- tion and effective development of tourism in rural areas, the planning process is most important, which forms the basis for further analysis of various parameters. The comparative analysis demonstrated that the rural tourism development strate- gy of Henan Province could be enhanced by a greater focus on infrastructure, market- ing, and community involvement. For example, the success of the Issyk-Kul region in investing in quality infrastructure serves to confirm the importance of this aspect in increasing the appeal of tourism, as noted in studies by O. Chernega (2021). The experi- ence of Issyk-Kul indicates that Henan could benefit from the stimulation of local in- vestments and the establishment of public-private partnerships to improve roads and tourist facilities. Furthermore, the utilisation of social media for the promotion of tour- ism in Southeast Asia demonstrates the potential for Henan to develop effective digital strategies, which aligns with the conclusions of Nair et al. (2020) on the significance of digital marketing for sustainable tourism development. It would be advantageous for Henan to engage with the local community like that observed in Southeast Asia, where residents are trained in hospitality. This approach could enhance the authenticity of the tourist experience and support the preservation of cultural heritage. This is to the findings of Castro-Arce and Vanclay (2020), which em- phasize the significance of community participation in the development of sustainable tourism. The implementation of educational programmes for residents in Henan would not only enhance the quality-of-service provision but also facilitate regional economic growth by attracting a greater number of tourists and supporting the preservation of cultural and natural resources. From the standpoint of Kumar et al. (2022), economic planning is the basis for the correct choice of methods for improving and optimising rural tourism. This stage allows preparing final projects considering both public and private sources of financing. Their results are input data for the evaluation and control stage, which identifies deviations between what was planned and what was completed, analyses the causes and makes recommendations for the stage of formulating an optimisation strategy. In the case of tourism, it must be considered that this industry assumes for the client an intangible value generated by the sensations and experiences that the client experiences when visiting a certain place. Therefore, not all methodologies consider the process of devel- oping a tourist product. When creating it, it is important to consider two fundamental elements: the demand of the tourist market (needs, desires, expectations, demographic characteristics, the extent of demand) and the available tourist resources (flora and fauna, environment and landscape, rivers, sea, lagoons, recreational areas). From the combination of these two aspects, the initial idea of the product concept as the main element of rural tourism is formulated, considering factors related to financial, human, and technological resources. The results of this study also focus on the fact that opti- mising the path of rural tourism development involves a whole range of actions that depend on various kinds of features and factors.",
    "According to Lane et al. (2022), optimisation of rural tourism development pro- cesses involves the use of situational analysis methodologies, logical structure and innovations in combination with the economic, cultural, and political components of the country. The attributes on which this type of industry is based relate to the eco- logical, natural, socio-cultural, and administrative characteristics of various territo- ries. The adequate development of tourism requires clearly defined programmes, a consolidated quality system, an empowered population, trained and aware that the collective good is higher than the individual, and dedicated local authorities that contribute to the improvement of tourism through innovation policy. Modern meth- ods of optimising the development of rural tourism allow for effectively managing this activity, considering its decentralisation and the provision of natural and cultural resources to the population. Residents of rural areas know their environment and traditions best, so they are the ones who can transfer this experience to tourists, con- solidating the unique differentiating factors that determine competitive attractive- ness. The multi-criteria process of improving rural tourism is presented as a practical tool for creating effective management processes since it allows evaluating tourist attractions based on technical criteria and allows prioritising actions that contribute to the promotion of individual regions. When analysing the information, it is noted that the correct organisation and implementation of tourism optimisation strategies contribute to the rapid and effective development of rural areas and their attractions. Dwyer (2020) focuses on the fact that the task of optimising and promoting rural tourism is a coordinated effort involving several entities: the state at different levels – central, provincial, municipal; private entrepreneurs, communities, universities, and even tourists themselves. These processes include the development of incentive policies, promotion and dissemination of marketing areas, and ongoing learning processes for the cities and communities involved. Therefore, decentralised governance can be im- plemented only with the availability of financial resources and adequate infrastructure, which the central government and regional administrations must provide. The loss of value is one of the main obstacles in the relationship between rural tourism and devel- opment. It is necessary to apply innovation and clustering models based on local- territorial planning to avoid or minimise the effect of financial leaks, creating favoura- ble conditions for tourism production by institutions, communities and companies, thus building supply chains. Rural space is becoming more and more multifunctional, it conducts a substantial number of diverse types of economic activities, both transfor- mations and services that perform residential functions and several other aspects close- ly related to nature, tourism, and recreation. The new rural area is less “agrarian” but no less dynamic and active. The researcher’s justifications coincide with the results of this study, emphasising the importance of involving the state, tourism organisations and residents to optimise the development of rural tourism. Buckley et al. (2020) emphasise that optimisation from an economic standpoint means a transition from agriculture to the development of agriculture. One way to explain the above is to recognise rural tourism as an important component of the future agricultural sector. In this regard, rural tourism is one of the sectors that has undergone the greatest transformations in response to the need of the international community to establish closer and direct contact with the natural environment. Natu- ral tourism, due to its various forms, including rural tourism, is becoming an alterna- tive to conventional tourism, which is widespread and has a substantial impact on the environment. By the global trends in tourism activity, in recent years, rural tourism has positioned itself as an interesting option for those who are looking for an alterna- tive to beaches and other destinations. Opportunities to explore traditional rural cultures, walk through untouched natural landscapes and rediscover indigenous cus- toms have become options for an important segment of national and foreign tourists, the number of which is increasing every day. Accordingly, rural tourism, in its various manifestations, is at the stage of growth and demonstrates potential as a means of promoting the development and well-being of rural communities. This allows visual- ising, understanding, and evaluating the importance of considering its optimisation elements in practice. The results of the researchers coincide with the conclusions obtained in this study, emphasising the active development of tourism in rural re- gions, considering its economic and social effects for a particular area.",
    "Thus, after analysing the measures to optimise rural tourism and its features, it was established that this activity is a process that clearly shows its multidimensionality with a territorial approach. Proper and effective planning in various contexts of this industry can make a substantial contribution to the understanding of tourism since it is a phenomenon that inherently includes a territorial dimension, which allows analysing the location of tourist resources, the spatial transformation caused by recreation, and the impact on the environment and local culture. It was also identified that rural tourism corresponds to the social, cultural, and natural realities of a particular region, contributing to the develop- ment of the main local activities that are in high demand. Economic planning of this sec- tor is one of the main tasks for the future, representing a certain opportunity to diversify activities that bring income to rural residents. This process can become an important incentive for rural development as the main element of conventional activities, such as agriculture and industry. As a result of the study, it was established that Henan Province, one of the largest and historically saturated regions of China, offers extensive potential for the development of rural tourism. This type of industry is not only an economic but also a social tool that can revitalise the countryside and provide an additional source of income for the local popula- tion. In addition, rural tourism acts as a source of employment, contributing to social and cultural enrichment in harmony with nature. However, the development of this activity faces several obstacles. Among them is the necessary infrastructure (housing, roads, drinking and tap water, communications, electricity, garbage collection), which, as a rule, is unreliable or absent. Another problem is the lack of qualified personnel for all types of tourism-related activities. Tourists of different backgrounds and interests have corre- sponding needs and expectations regarding the activities and services offered in rural areas. Nevertheless, the main barrier to optimising this activity is insufficient institutional support for the development and promotion of tourism, which includes policy, planning, financing, strategies, rules, and organisational structure. The study of optimising the development of rural tourism in Henan province identified many aspects that require attention and correction. Rural tourism is an important tool for stimulating the local economy, preserving cultural legacy and supporting environmental sustainability. How- ever, without the right strategy and methodology for its development, problems in envi- ronmental, economic and socio-cultural contexts are possible. Based on the conducted investigation, it can be concluded that an integrated ap- proach combining economic, environmental and socio-cultural strategies is necessary for the effective development of rural tourism in Henan Province. This is the only way to achieve sustainable development in this area, which will benefit both the local population and the guests of the province. For this potential to be fully realised, it is necessary to consider local specific features, the needs of the population, and the interests of tourists. In the course of investigating the issue of optimising the devel- opment of rural tourism, it became evident that this industry is not only an important area for the diversification of the local economy but also a tool for the preservation and promotion of cultural and natural values of the region. Nevertheless, to achieve the greatest return from rural tourism, it is important not only to attract tourists but also to create conditions for the qualitative and sus- tainable development of this area. This includes investing in infrastructure, educating the local population, preserving the ecological balance, and considering local cultural characteristics. With Henan’s unique features, rural tourism holds the potential for future economic and cultural growth. Accordingly, it can be concluded that the pur- pose of the study has been achieved. There is considerable scope for Henan Province to derive significant advantages from an examination of the experiences of other re- gions. In particular, the investment and marketing strategies that have been success- fully deployed in the Issyk-Kul region and Southeast Asia can be adapted to suit local conditions. The implementation of interactive marketing platforms, community train- ing in tourism basics and the attraction of investors for infrastructure development represent promising avenues for enhancing Henan’s competitiveness in rural tour- ism. However, the examination of modern technologies, environmental strategies, and various international programmes to preserve the natural landscape and mini- mise human impact on nature requires further research to ensure rational optimisa- tion of all processes related to local tourism.",
    "This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution-NonCommercial-NoDerivs 3.0 Serbia."
]