[
    "Nursing staff shortage is an acute issue in health care across the globe and it is no exception in Henan Province, China. As nursing programs have grown, some students question whether they want to pursue a lifelong career in the field. This paper aims to provide a theoretical foundation for understanding how self-efficacy and psychological stress affect career choice intention in nursing students. Based on social cognitive theory, the model suggests that self-efficacy encourages students’ career commitment, and psychological tension may be a moderator. The paper reviews current empirical literature identifies shortcomings of current research, and develops testable conjectures for future empirical study. Implications This framework contributes to both theory and practice by highlighting the importance of confidence building and stress management interventions in nursing education. This research provides a baseline for future inquiry on how to retain students and help them to succeed in a high-stress educational program like nursing. The global healthcare industry is suffering from chronic shortage of nursing professionals, and the problem is being further compounded due to increasing healthcare needs, aging population and the growing complexity of care. The problem is severe in China, especially in the poor provinces, including Henan province, where qualified nurses are recruited and retained. Although the number of nursing students in medical universities has been increasing to fill this shortage, the problem is no longer limited to nursing education; the problem has evolved from training a large number of nurses to the long- term retention of nurses as their careers. There are studies that reveal that nursing students lack motivation and feel ambivalent about considering nursing as a future profession despite years of education and clinical experience (Ye et al., 2020). This worry draws attention to key psychological aspects that impact students' career intention, especially at an early stage in their education (Kong et al., 2016). *Cite this Article: Wang Ya Zhe, Ch’ng Lay Kee (2025). A Conceptual Framework for Understanding Career Choice Intention Among Nursing Students: The Roles of Self- Efficacy and Psychological Stress. International Journal of Social Science and Education Research Studies, 5(7), 698- Of the various psychological variables examined in career development research, two psychological constructs, self- efficacy and psychological distress, have been found to be particularly relevant. Self-efficacy, or individuals’ confidence in their ability to complete tasks and reach goals, is closely related to academic perseverance, motivation, and career motivation (Bandura, 2000). In the nursing education, students’ high self-efficacy is expected to enhance their self-image as competent practitioners to cope with heavy clinical responsibilities and high-stress situations, leading to professional commitment (Bi et al., 2023). Psychological stress, by contrast, comes from high challenging academic workloads, emotionally intense clinical experience and performance expectations that can erode students’ sense of resilience, decrease student academic engagement and disband intention to commit to one’s career (Zhao et al., 2015). Although both are established to affect learning and motivation individually, little research has addressed their combined effect on career intention, especially in the cultural transboundary and stressful educational context of the inland Chinese provinces, such as Henan. This paper proposes a theoretical model of the combined effects of psychological stress and self-efficacy on nursing students' intentions to work as nurses. Based on Social Cognitive Theory as its theoretical framework, a model is proposed for further empirical testing, to respond to the literature void, and to the practical need to better understand the process of nursing students’ career decision-making in underrepresented regional areas. intentions, the literature has shown three major limitations. On the one hand, insufficient research has been undertaken on students in Henan Province, with unique economic and educational features, which are however underrepresented or not even represented in national or international literature (Bi et al., 2023). Second, the self-efficacy and the psychological stress have been explored with an independent theme in previous research, and a gap still exists on how both self- efficacy and psychological stress may interact together in influencing a career choice (Lyu et al., 2022). Third, research results derived from international career development studies may not be applicable to the Chinese, whose career development is infused with cultural norms and heavily influenced by high academic pressure, (Cai 2019; Ki & Resh, 2015), as well as constrained mobility pathways, of which may foster distinct psychological stressors for individual students.",
    "driving element and psychological stress as the impeding barrier on career intention in the nursing education setting, especially in the Chinese inland district (Mei et al., 2022). The model and the hypotheses that are developed will be the basis for future empirical work that tests and extends the relationships suggested in this research. The contribution of this study is its theoretical synthesis and methodological guidance for future work. In theory, the article offers theoretical contribution by creating a model in which self-efficacy and psychological stress are included to career choice intention. In doing so, it expands the scope of application of Social Cognitive Theory in Chinese nursing education, and provides a perspective for demonstrated cognitive and emotional factors interactively influence students' professional aspirations. From a practical perspective, the present notion can serve as a conceptual framework for the future botanical research of psychological factors that predict career retention in nursing. The findings from such it may studies may guide the implementation of interventions in nursing programs—like stress reducing workshops self-efficacy-building techniques and customized career counseling support. Moreover, the model offers a culturally rooted perspective for policymakers and administrators trying to solve the nursing shortage and attrition, respectively, in provinces such as Henan with structural and psychological problems. In light of the challenges identified and the psychological variables under investigation, this study aims to address the following research questions: This paper takes a step in trying to overcome such limitations by suggesting a conceptual model that integrates the currently available theoretical and empirical evidence in this area. It evaluates the importance of considering self-efficacy as the These research questions guide the study’s empirical focus, aiming to determine whether and how these two core psychological factors—psychological stress and self- efficacy—predict students’ willingness to pursue a long-term career in the nursing profession. The answers to these questions Intention of career choice indicates the plan or motivation of a person to work in a particular occupation in future. In nursing education, career choice intention is a very important psychological consequence, which can significantly predict the real entry into the workforce and the sustained professional development (Bi et al., 2023). The proliferation of nursing programs in China in the past two decades has followed growing national healthcare needs, yet it has been reported that the majority of nursing students have a contradictory attitude towards or were unwilling to become a nurse after graduation (Lin et al., 2021). Such reluctance is believed to have been due to burnout of feeling during rotations, status, and future career growth limitedness (Lyu et al., 2022). The impact of excessive psychological stress on student success has been widely reported. High stress is associated with lower academic performance, more burnout and worse mental health. Stress can also interfere with motivation and contribute to disconnection from career pathways. For example, Tsai et al. (2021) reported that nursing students with higher levels of psychological stress tend to report reevaluation of their professional future, exemplified by emotional exhaustion and self-doubt. Consistent with these results, evidence has shown that psychological stress can significantly impact both students’ psychological health and intention for retention in the nursing profession in the Chinese context (Wang et al., 2022). Despite these findings, few studies have examined psychological stress as a predictor of career choice intention. Much of the existing literature has focused on its effect on academic performance or mental health outcomes. This study therefore seeks to bridge that gap by exploring whether psychological stress significantly predicts nursing students’ intention to pursue the profession. In China’s cultural context, especially in provinces of inland parts like Henan, an individual’s career decision-making is not only constrained by personal interests but also by family expectations and social norms. Nursing as an occupation is often seen as “feminized,” dissuading male individuals to enter it or those believing professional success is linked to certain status. As such, it is crucial that the factors that support or hinder nursing students in their decision to engage in this profession and its corresponding education be identified in efforts to address a potential future workforce shortfall. Studies that have attempted to account for the variance in students’ career intentions place focus not only on the role of psychological constructs such as s tress and self-efficacy 10 (Cheng et al., 2025).",
    "Psychological stress is an emotional state that individuals undergo when they appraise that environmental demands exceed bounds of their adaptive capacities (Mohamed et al., 2024). Nursing students are often confronted with stressors that include high level of academic study, emotionally laden clinical practice, competitive examinations and uncertainty about job security and prospects. There in medical universities in China, those stressors are exacerbated by a culture that values achievement, conformity, and adaptability occasionally at the cost of psychological health (Cheng et al., 2023). Self-efficacy, as conceptualized by Bandura (2000), refers to individuals’ beliefs in their capability to execute behaviors necessary to achieve specific performance outcomes. In the educational context, self-efficacy influences not only academic persistence and engagement but also students’ career-related decisions. High self-efficacy has been shown to encourage initiative-taking career planning, greater resilience in the face of challenges, and stronger identification with one’s chosen profession. Self-efficacy is particularly important to nursing students due to the complexity and emotional labor involved in clinical work. Students who possess the self-belief in the sense of competence are able to administer care, manage emergencies, communicate with patients and are more likely to be able to perceive themselves as being successful performing in the field once they graduate. This link between self-efficacy and career choice intention has been supported in empirical research in western and eastern regions. For instance, research of Bi et al. (2023) discovered Chinese nursing students with confidence had a higher level of commitment to nursing as a long-term career. Similarly, Liao et al. (2024) found that self-efficacy was among the strongest predictors of career identity and career intention in Beijing nursing undergraduates. Although self-efficacy is a well-established construct in career development theory, there remains a shortage of studies examining its role in combination with psychological stress in predicting career choice intention. Moreover, the regional focus of most Chinese studies has been on large metropolitan areas, with limited attention paid to students in inland provinces such as Henan. The present study addresses this gap by examining self-efficacy as a key psychological predictor of career commitment among nursing students in Henan’s medical universities. Bandura (2000), which posits that human behavior is shaped by the interplay between personal beliefs, behaviors, and environmental influences. A core construct in SCT is self- efficacy, or the belief in one’s ability to perform tasks successfully. Individuals with high self-efficacy are more likely to set ambitious goals, persevere through challenges, and commit to chosen career paths. In nursing education, self- efficacy enables students to feel competent in clinical and academic settings, increasing their likelihood of pursuing nursing as a profession (Bi et al., 2023). While self-efficacy and psychological stress are often studied independently, their combined influence offers a more comprehensive understanding of how students make career- related decisions. Theoretically, these constructs align with Social Cognitive Theory (Bandura, 2000), which posits that behavior is shaped by the reciprocal interaction of cognitive, emotional, and environmental factors. In this framework, self- efficacy enhances goal pursuit, whereas psychological stress can function as a barrier to action. When applied to career development, these opposing forces may jointly determine whether students feel both motivated and capable of entering the nursing profession. SCT also emphasizes the role of emotional states, such as psychological stress, which can hinder self-regulation and goal pursuit. High stress levels may impair confidence, induce avoidance behaviors, and reduce career motivation. In the high- pressure environment of Chinese nursing schools, students frequently encounter academic overload and emotionally demanding clinical exposure, which can weaken their intention to remain in the field (Lu et al., 2023). By applying SCT, this study examines how self-efficacy acts as a motivating force and psychological stress as a barrier to nursing students’ career choice intention. But there are very few empirical studies that have evaluated these two variables in the same predictive model. The previous literature has emphasized on the positive impact of self-efficacy, but has failed to take account of the negative impact of stress and how they might jointly affect students’ intentions. This boundary is especially true in pressure-laden situations such as those in Chinese nursing education, where students are prone to self-doubt and yet perform confidently in an interactive manner. The present research attempts to address this gap by examining the paths through which psychological stress and self-efficacy jointly impact career choice intention by way of the data collected from nursing students in public medical universities in Henan Province.",
    "Grounded in Social Cognitive Theory (Bandura, 2000), this study proposes a conceptual model examining how psychological stress and self-efficacy influence nursing students’ career choice intention. As shown in Figure 1, self- efficacy is expected to positively predict career intention, as individuals who believe in their capabilities are more likely to pursue and commit to challenging professions. Conversely, psychological stress is posited to negatively impact career intention, as excessive stress may lead to avoidance behaviors, diminished motivation, and doubts about career suitability. This framework is particularly relevant in the context of Chinese nursing education, where students often experience high academic pressure and emotional strain. By integrating these psychological constructs, the model aims to explain how internal beliefs and stress responses jointly shape students’ decisions about entering the nursing profession. relationships among latent variables. As the constructs in this framework—namely psychological stress, self-efficacy, and career choice intention—are well-established in the literature and can be operationalized through validated Likert-scale instruments, a cross-sectional survey design is recommended. Specifically, a mono-method quantitative strategy using Structural Equation Modeling (SEM) is appropriate for evaluating the proposed hypotheses and assessing the measurement and structural properties of the model. This conceptual paper adopts a theory-driven and deductive approach to model development, grounded in Social Cognitive Theory (Bandura). Rather than conducting primary data collection, this study draws on an extensive synthesis of empirical findings and theoretical arguments to propose a framework examining how psychological stress and self- efficacy influence career choice intention among nursing students. The primary aim is to guide future empirical research with a well-structured conceptual model and testable hypotheses. Furthermore, this article proposes that future empirical studies could target undergraduate nursing students from public medical universities in China, particularly those with at least one year of academic and clinical training. These students represent a critical group facing career-defining decisions and are suitable for examining how internal psychological factors shape professional commitment in high-stress learning environments. Purposive sampling is suggested to ensure inclusion of respondents with relevant academic and clinical experiences. This article suggests that researchers may employ a positivist paradigm to empirically validate the proposed model in future studies. The positivist tradition supports the use of structured, hypothesis-driven quantitative methods to investigate causal For future empirical validation, this paper recommends adapting established instruments for each construct: the Student Nurse Stress Index (Jones & Johnston, 1999) for psychological stress, the Writing Essentials Self-Efficacy Scale adapted to nursing education (Driscoll et al., 2020), and validated measures for career choice intention (e.g., Lin et al., 2021; Al Balushi et al., 2022). A pilot study is also advisable to ensure clarity, reliability, and contextual fit of the measurement tools before full-scale implementation. By outlining this proposed methodology, the present study aims to provide a foundation for future empirical investigations that can confirm, refine, or extend the proposed conceptual relationships in diverse educational and cultural contexts. In addition to its theoretical value, this paper has important practical implications for nursing educators, curriculum developers, and policymakers. By identifying psychological stress and self-efficacy as critical determinants of career choice intention, the study suggests that nursing programs must go beyond technical skill development to address the emotional and cognitive needs of students. This conceptual paper offers important contributions to both theoretical understanding and practical application in the context of nursing education and career development. The framework proposed in this paper advances the literature by integrating self-efficacy and psychological stress within a unified model grounded in Social Cognitive Theory (SCT). While previous studies have examined these constructs independently, this paper emphasizes their combined influence on career choice intention, thereby addressing a notable gap in the literature. By theorizing that self-efficacy serves as a motivational driver while psychological stress functions as an emotional constraint, the model highlights the dual pathways through which personal psychological states may shape career decision-making among nursing students. Educators can incorporate self-efficacy enhancement strategies, such as mentorship programs, simulation-based learning, and reflective clinical practice, to strengthen students' confidence in their professional abilities. Simultaneously, institutions should design stress management initiatives that promote psychological well-being, including accessible counseling services, workload adjustments, and supportive peer environments. At the policy level, understanding how psychological factors influence students’ willingness to enter and remain in the nursing profession can inform broader human resource planning in healthcare. Targeted interventions at the university and provincial levels—especially in high-pressure settings like Henan—can help mitigate nurse attrition, enhance workforce stability, and improve long-term patient care outcomes.",
    "Furthermore, this research broadens the generalization of SCT in a regionally not well-explored field, i.e., among nursing students in Henan Province, China, whose cultural patterns, academic demands, and future expectations deviate from those reported in Western areas. The study situates this model within the Chinese sociocultural and educational context and provides a more contextually sensitive use of SCT, and it paves the way for future cross-cultural validation of career conceptual models. The hypotheses proposed provide specific guidance for future quantitative empirical investigation, using methodological approaches, including Structural Equation Modelling (SEM). The framework may be employed by researchers for exploring causal pathways and causal mediators or moderators, for example, the influence of institutional support, professional identity or gender. These inquiries might inform theoretical models and add to the general knowledge of student motivation and career choice in medicine. This conceptual paper set out to examine the influence of psychological stress and self-efficacy on career choice intention among nursing students, particularly within the high- pressure educational environment of Henan Province, China. Drawing upon Social Cognitive Theory, the study proposed a theoretically grounded model that explains how internal beliefs and emotional responses may jointly influence students’ willingness to pursue a nursing career. While self-efficacy is positioned as a positive motivational force, psychological stress is identified as a potential barrier to long-term professional engagement. By integrating these two constructs into a unified framework, this paper contributes to the literature on career development in health education and highlights a gap in current research— namely, the lack of studies that simultaneously consider cognitive and emotional factors in culturally specific settings. The proposed hypotheses offer clear direction for future empirical testing using structured, quantitative methodologies. It is hoped that this model will inspire further research and intervention design to improve student support and nurse retention strategies, especially in regions facing severe healthcare staffing challenges. This paper underscores the importance of addressing both the confidence and emotional resilience of nursing students in shaping their professional trajectories. As the global demand for nursing professionals continues to rise, understanding the psychological foundations of career choice intention remains vital for ensuring a stable, motivated, and well-prepared nursing workforce."
]