[
    "The influence of survival conditions on farmer willingness to participate in non-grain conversions of cultivated land based on the SOR model 1 College of Geography Science, Xinyang Normal University, Xinyang, Henan, China, 2 Key Research Institute of the Yellow River Civilization and Sustainable Development, Henan University, Kaifeng, Henan, China Citation: Fan H, Liu J, Shao X, Sun B, Yang Y, Shi C (2025) The influence of survival conditions on farmer willingness to participate in non-grain conversions of cultivated land based on the SOR model. PLoS ONE 20(2): €0318441. https://doi.org/10.1371/journal. pone.0318441 Peer Review History: PLOS recognizes the benefits of transparency in the peer review process; therefore, we enable the publication of all of the content of peer review and author responses alongside final, published articles. The editorial history of this article is available here: https://doi.org/10.1371/journal. pone.0318441 Non-grain conversions (NGC) of cultivated land pose a great threat to national food secu- rity, and farmers are the direct actors in the NGC of cultivated land. Exploring the influence of farmer’ survival situation on their willingness to convert cultivated land to non-grain land can provide theoretical support for formulating control policies for NGC of cultivated land. Based on the data obtained from 650 questionnaires in Henan Province and using the SOR model as the theoretical basis, this study explored the impact mechanism of the sur- vival situations of two types of farmers, namely, those with agricultural livelihoods (AL) and those with nonagricultural livelinoods (NL), on their willingness to convert farmland into non-grain land through the use of structural equation models. The results are as follows. The perceived benefits (PB) of NGC can improve their willingness to convert farmland to non-grain land, while the perceived risks (PR) of NGC reduce their willingness to convert farmland to non-grain land. The influence of PB and PR on farmer willingness to engage in NGC of cultivated land in the near term is greater than that in the long term. The influ- ence mechanism of perceived income and perceived risk on the willingness of non-grain conversions of cultivated land varies with the livelihood types of the farmers. The influ- ences of internal family situation (IS) and external family situations (ES) on the willingness to engage in NGC of cultivated land differ according to the types of farmer livelihood. There are differences in the influence mechanism of survival situations on different types of farmers’ willingness to non-grain conversion of cultivated land. Copyright: © 2025 Fan et al. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. Food forms the foundation of national prosperity and is one of the key resources for the continuation of civilization. Food security is “the greatest concern of a nation” [1]. Govern- ments around the world have implemented food security as an important strategy. In recent years, China’s urbanization and industrialization have developed rapidly, and remarkable achievements have been made in economic construction. However, these achievements have Data availability statement: All the data related to this study have been included in the paper and its Supporting Information files. Funding: The National Natural Science Foundation of China (Grant number 71904150, 41771438) and General Project of Humanities and Social Sciences Research in Higher Education Institutions in Henan Province (Grant number 2024-ZZJH-039). also brought great challenges to cultivated land protection and food security. The continuous spread of cities has threatened regional food security [2]. The rapid decrease in the scale of cultivated land in China has increased the risks to resources and food security [3]. From a strategic perspective, the Chinese government has the responsibility to ensure the country’s food security and to make food production self-sufficient [4]. The Chinese government has always attached great importance to food security. The Central Rural Work Conference held at the end of 2022 and the No. 1 Central Document of 2023 contain important instructions on food security and cultivated land protection. Currently, food security is facing many chal- lenges, especially the NGC of cultivated land. Research shows that the NGC rate of cultivated land in China is approximately 27%, among which the proportion of NGC of cultivated land in Southwest China is as high as 46% [5].",
    "Abbreviation: NGC, Non-Grain Conversions; SOR, Stimulus-Organism-Response; SEM, Structural Equation Models; WNG, willingness to non-grain conversions of cultivated land; AL, Agricultural Livelihoods; NL, Nonagricultural Livelihoods; PB, Perceived Benefits; PR, Perceived Risks; IS, Internal Family Situation; ES, External Family Situations; RW, Recent Willingness; LW, Long-term Willingness. In recent years, academics have explored non-grain cultivated land in depth and achieved fruitful results. The existing research results mainly include three parts, namely, the spatial distributions, the driving mechanisms and the effects for NGC. First, the spatial distributions of NGC were explored. The NGC rate of cultivated land in western China is relatively high, while it is relatively low in the eastern part of China, with significant spatial differences and aggregation distributions [6]. Sun et al. [7] believe that the lower economic benefits of the planting industry are the most important driving force, leading to spatial differences in NGC of cultivated land. The spatial characteristics of different types of NGC of cultivated land [8]. A new measurement method was used to explore the spatial pattern of NGC of cultivated land in Hubei Province over the past 30 years [9].Second, the driving mechanism of NGC. Economic interests are the most fundamental mechanism to induce NGC on cultivated land [10]. The expansion of areas with NGC in different periods in China is closely related to the attitudes of the central government and local governments [11]. The transformation of NGC of cultivated land has multiple driving forces [12]. Zhang et al. [13] noted that different industrial policies determined the NGC mode at different stages. The driving factors for NGC of cultivated land vary among different land leasing entities [14]. The driving mechanisms for NGC of different types of cultivated land [15]. The driving mechanism of NGC of cultivated land between compensated cultivated land and original cultivated land in mountainous areas [16]. Third, the effects of NGC of cultivated land. Lu et al. [17] explored the impact of NGC of cultivated land on the potential for food production. The NGC of cultivated land has an impact on agricultural carbon supply and demand [18], as well as carbon emission intensity [19]. The NGC of cultivated land is closely related to agricultural subsidies [20], and so does intensive utilization of cultivated land [21]. In addition, The other issues of NGC of cultivated land has also attracted the attention of the academic community. Chen Meiqiu [22] suggested that different types of NGC should be treated and handled differently. The implementation of basic farmland and high-standard basic farmland policies did not stop the NGC of cultivated land but NGC the level o The existing research results provide a basis for the in-depth exploration of NGC of culti- vated land, but there are also some shortcomings. First, the exploration of NGC of cultivated land—farmers—has been ignored. Farmers are the direct actors in the NGC of cultivated land, and they decide whether to convert farmland into non-grain land on the basis of weighing their livelihood security and economic efficiency [23]. Second, there is a lack of cooperative exploration of the macro- and micro conditions of NGC on cultivated land. NGC of cultivated land is a type of land use behavior for farmers under the joint action of macro-conditions (ES) and micro-conditions (IS). ES and IS have an impact on farmers’ willingness to NGC of cultivated land. Third, the analysis of farmer heterogeneity is insufficient. Because of the large size of farmer groups and their different educational levels, family livelihoods, family assets, cognitive levels and other factors, it is necessary to explore the influence mechanism of NGC of cultivated land from the perspective of farmer heterogeneity. The individual char- acteristics of farmers affect their willingness to NGC of cultivated land. There are differences in the behavior mechanisms of NGC of cultivated land among farmers of different ages and working conditions [24]. Family status has an impact on farmers’ NGC of cultivated land. The household life cycle of farmers affects the restraining effect of agricultural subsidies on NGC of cultivated land [20]. Household labor and capital also affect farmers’ willingness to NGC of cultivated land [25]. In this study, the scientific problem is the influence mechanism of survival situations on farmers’ willingness to NGC of cultivated land. Although the types of farmers’ livelihood can be divided from different perspectives, Chinese academic circles usually divide farmers’ livelihood types into agricultural livelihood and non-agricultural live- lihood (Xiao Yang et al., 2024). Based on the above achievements and the actual situation of rural areas in Henan province, the study divides farmers into agricultural livelihood farmers and non-agricultural livelihood farmers from the perspective of livelihood types. Henan Prov- ince is the main grain production area in China, and its grain output has a significant impact on the national food security. The proportion of farmers engaged in agricultural production is high in Henan Province. At present, the phenomenon of NGC of cultivated land is very serious in Henan Province. In 2020, the proportion of NGC of cultivated land is about 30% in the province [26,27]. It poses a major threat to the national food security. Using Henan Province as the research area, based on a questionnaire survey of 650 sample farmers using the SOR model as the analytical framework and adopting the structural equation model (SEM), this study explores the influence mechanism of the ES and IS on farmer willingness levels to convert farmland into non-grain land to provide theoretical support for local governments to formulate control policies for the NGC of cultivated land and to mobilize farmer enthusiasm for grain production. This study aims to explore the uniqueness of the mechanism influencing the willingness to NGC of cultivated land through an in-depth examination of a specific prov- ince, Henan Province, one of the main grain producing areas, to provide theoretical support for the control of NGC of cultivated land in other similar areas.",
    "The Stimulus-Organ-Response (SOR) model provides a theoretical framework for under- standing how environmental stimuli (S) affect the internal state of an organism (O), leading to a behavioral response (R). This model holds that the response of individuals after receiving external stimuli is not mechanical and passive, and people have subjective initiative, and have the ability to process effective information to make rational behavior decisions under stim- ulation. This model is widely used in Marketing, education, health behavior, environmental psychology, For example, team work satisfaction under supervision [28], the relationships between consumer confidence and green purchase intentions [29], the influencing factors of the continuous purchase of fashion products [30], impulse purchases in online broadcasts {31], impulse purchases in omnichannel retail [32], Chinese individual outbound travel [33], and the impact of public climate policy on low-carbon travel [34]. SOR model is mainly used to explain the action willingness of the actor, and the above research proves that it has the strong explanatory power. The research team found in the inter- views conducted in the early stage of the study that farmers’ willingness to NGC of cultivated land followed three stages: external stimulation, information processing and reaction. Therefore, SOR model can be used to explain the mechanism of farmers’ willingness to non-grain conversions. In this study, SOR model was used to explore the factors affecting farmers’ willingness to NGC of cultivated land. Under the background of NGC willingness of cultivated land, the policy, market and the internal situation of peasant families act as the stimulus, and the perception of farmers’ own income and the perception of external economic risk act as the organism, and the decision to NGC of cultivated land is the reaction. Through the application of SOR model, This can deeply understand how the policy incentives affect the farmers’ men- tal process and perception, and then affect their decisions of NGC of cultuvated land. This will help formulate more effective policy measures to promote the rational use of land resources and the sustainable development of agriculture. In this study, IS and ES affecting farmers’ willingness to NGC of cultivated land are discussed in depth. Specifically, at the macro level, this study selected current policy, local government, benefit from cultivation and tillage conditions as the key indicators to reflect ES of farmers. At the micro level, family expenditure, family livelihood, children’s expenses and medical care for the elderly ware selected as the key indicators to reflect IS of farmers. In terms of PB, economic benefits, quality of life, children’s development and other dimensions were selected. In terms of PR, legal punishment risk, natural disaster risk, technical shortage risk, and technical shortage risk ware selected to reflect. The formation of farmer willingness to convert farmland to non-grain land goes through three stages, namely, “stimulus”, “organism” and “reaction’, which are the material stimulation of ES and IS, farmers’ own PB-PR assessments and willingness to NGC (Fig 1). Therefore, the SOR model can be used to analyze problems such as the farmer willingness to NGC and provides a new research perspective for discussing the farmer willingness to NGC. The survival situations of farmers and PB-PR of NGC. First, IS and ES of farmers affect PB and PR of NGC. Macro policies can be understood and transformed into a series of actions by farmers at the micro level [35]. When farmers evaluate PB and PR of NGC, they not only consider the survival situations that exist inside the family but also include the macro survival situations outside the family in their evaluation system. Second, farmer perceptions of PB and PR of NGC are based on their understanding of ES and IS of their families and are not simple conditional responses. When farmers evaluate the PB-PR of NGC of cultivated land, they do not ignore they are not independent of the survival situations inside and outside the family but make PB-PR assessments according to the survival situation of the family. Based on the above theoretical analysis, the following hypotheses are proposed in this study: H1: IS has an impact on PB of NGC by farmers. H2: ES has an impact on PB of NGC by farmers. H3: IS has an impact on PR of NGC by farmers. H4: ES has an impact on PR of NGC by farmer.",
    "PB-PR and willingness to NGC of cultivated land by farmers. The willingness to NGC of cultivated land of farmers comes from the comprehensive measurement of farmers’ PB and PB of NGC. In essence, NGC of cultivated land is an economic behavior. The economic interests is the most fundamental inducing mechanism for NGC of cultivated land [10]. Farmers’ willingness to NGC of cultivated land is a decision after comprehending PB and PR of NGC of cultivated land. Therefore, the following hypotheses are proposed: land. Household livelihoods are the ways in which individuals or families make a living, and they depend on the assets of the individual or family, which the activities they engage in, and the ability to access these assets and activities [36]. The type of family livelihood not only reflects the survival situations of the farmers but also influences the understanding of the farmers’ ES. At the same time, the PB-PR assessments of farmers on NGC is greatly affected by the types of family livelihood, which leads to differences in NGC of cultivated land. Therefore, the following hypothesis is proposed: H7: Farmers with different livelihood types have different evaluations of IS and ES and different perceptions of the PB-PR of NGC of cultivated land, which lead to different intentions for NGC of cultivated land. In conclusion, farmers’ willingness to NGC of cultivated land is influenced by many fac- tors. Based on this, this paper constructs the theoretical framework as follows (Fig 2). Data sources. Henan Province is an important grain-producing area in China. The total grain output of the province was 135.787 billion jin, ranking second in the country in 2022. The problem of NGC of cultivated land in Henan Province will have a serious impact on the national food security. The research group conducted the questionnaire survey in January and February 2024 in southern Henan (Huaibin County, Xinyang city), eastern Henan (Xihua County, Zhoukou city), northern Henan (Linzhou city, Anyang city), western Henan (Yiyang County, Luoyang city) and central Henan (Dengfeng city, Zhengzhou city) (Fig 3). The combination of stratified sampling and random sampling was used to determine a variety of target sample numbers in a county according to the various registered agricultural populations in the county. Then, 3 to 4 townships in each sample county were randomly selected by the numbering method, and 3 to 5 villages in each sample township were also randomly selected for the investigation. The total of 680 questionnaires was distributed in this study, and 650 valid questionnaires were obtained, for the effective response rate of 95.6%. In order to ensure the accuracy of the questionnaire data, a one-on-one survey was used in the questionnaire survey, and questionnaires with missing observation values, options that are not in line with the reality of farmers and other potential problems were eliminated. According to the statistical analysis of the sample farmers, there were no significant differ- ences in gender, age, and distance from the village to township government, or farmland plots per household between the agricultural families and nonagricultural families (Table 1). How- ever, the two types of sample farmers have certain differences in the average cultivated land area per household. The average cultivated land area per household of AL sample farmers (6.1 mu/household) is larger than that of NL sample farmers (4.0 mu/household). The difference between the two types of sample farmers is significant in terms of RW and LW for NGC of cul- tivated land. According to the longitudinal comparison, RW of NGC for the AL sample farmers is high, while LW of NGC for the NL sample farmers is relatively low. The situation for NL sample farmers is exactly the opposite; that is, RW of NGC for the NL sample farmers is low and LW of NGC is high for the NL sample farmers. According to the horizontal analysis, RW of NGC for the AL sample farmers is greater than those of the NL sample farmers. However, LW of NGC for the AL sample farmers is lower than those of the NL sample farmers. According to the above analysis and combined with the research objectives, the initial measure- ment items are formulated. Combined with the results of the pre-survey and interviews and based on the opinions of relevant experts, the individual questions in the questionnaire were optimized to form the final scale (Table 2). The questionnaire uses a five-point Likert scale.",
    "ES and IS have a greater impact on farmers with AL, while the impact on farmers of NL is relatively small (Table 2). According to the statistical index of PB, the income evaluation of NGC of cultivated land by AL farmers is slightly higher than that of NL farmers. The AL farm- ers believe that the PR of NGC of cultivated land is greater. However, the NL farmers think that the PR of NGC of cultivated land is small. In social science research, some concepts (i.e., latent variables) are difficult to measure directly and accurately, but some explicit indicators can be used to measure these latent variables indi- rectly. Previous statistical methods cannot meet the demand of measuring latent variables, but structural equation models (SEM) can measure the latent variables and their related indicators together. SEM consists of a measurement equation and a structural equation. The measure- ment model is expressed as follows: where x is the exogenous observed variable, & is the vector of the exogenous latent variable, and A, is the factor load matrix of the exogenous latent variables and exogenous observed variables. Delta is the residual matrix in Equation (1), y is the endogenous observed variable, 4 is the vector of endogenous latent variables, and A, is the factor load matrix of the observed escape quantity of the endogenous latent variable. ¢ is the error term of Equation (2), B is the coefficient matrix of the endogenous latent variables, and I is the effect of the endogenous latent variable on the endogenous latent variable. ¢ is the error term of the structural equation. Reliability test. This test mainly reflects the internal consistency of the latent variables (Cronbach’s a). Using the reliability analysis function of SPSS 20.0, the consistency coefficients of the four latent variables of the two livelihood types were all greater than the threshold condition of 0.6 (Table 3). Therefore, the reliability test passes. Validity test. The KMO values of each potential variable for the two livelihood types ranged from 0.618 to 0.787 (Table 3), which were greater than the threshold requirement of 0.5 and passed the Bartlett sphere test. This indicates that the model data have high validity. Model fitting and fit test. AMOS 23.0 software was used to test the influencing factors for farmers’ willingness to NGC of cultivated land. In SEM of the AL farmers, two sets of covariant relationships were added, namely, el and e2, e7 and e8, considering the existence of covariant relationships between the observed variables for ES and the observed residuals for IS, which effectively reduced the chi-square value of the model and did not deviate from the theoretical assumptions. Similarly, in SEM for the NL farmers, a set of covariant relations is added, e7 and e8, which effectively reduces the chi-square value of the model and does not violate the theoretical hypothesis. Finally, the fit indices (Table 4), model path diagrams (Figs 4 and 5) and path coefficients (Table 5) of the two types of farmer SEMs were obtained. Through a comparison with all the criteria, it is found that the fit index of the model meets fit evaluation, and the overall fit is good. The constructed structural equation model is suitable for path analyses of the impact of survival situations on farmer willingness to NGC. Model verification results. The path diagram (Figs 4 and 5) and path coefficient table (Table 5) were drawn based on the fitting results of SEMs of the farmers with two types of livelihoods by using AMOS 23.0 software. The results show that the standardized path coefficients (B) of each path that influence the willingness to NGC of arable land for farmers with two types of livelihood pass the significance (P) test. The specific values of the path coefficients, B and P, for AL and NL are analyzed as follows: The coefficients and significances of IS>PB path (the B values of AL and NL were 0.581 and —0.616, respectively; P=0.01 and 0.01, respectively) meet the requirements, and H1 is confirmed. The coefficients and significances of ES>PB path (B: -0.729, 0.414; P: 0.01, 0.01, respectively) confirmed H2. IS>PR path coefficient and significance (B: —0.625, 0.405; P: 0.01, 0.01, respectively) confirmed Hypothesis H3. The coefficients and significances of Es>PR path (B: 0.644, —0.581; P: 0.01, 0.01, respectively) formalizes H4. The path coefficient and significance of PBwillingness to non-grain conversions of cultivated land (WNG) (B: 0.573, 0.332; P: 0.01, 0.01, respectively) confirmed H5. The path coefficient and significance of PR2WNG (B: -0.762, —0.251; P: 0.01, 0.01, respectively) confirmed H6.",
    "The four path coefficients of the two structural equations of AL and NL, namely, IS>PB, ES>PB, IS>PR, and ES+PR, have the opposite signs and different values, indicating that farmers with different livelihood types have different perceptions of the IS and ES and thus have different perceptions of PR and PB of NGC. H7 is confirmed. First, ES is mainly affected by its current income derived from growing grain (ES3). From the analysis of the load coefficients, the largest of the three observed variables in ES is ES3 (0.84), while the load coefficients of ES1 (0.59) and ES2 (0.60) are relatively small. This shows that for the AL farmers, their current crop income is the most important factor for evaluating the ES. Second, IS was affected by two main factors: the type of livelihood (IS2) and the living expenses (IS1). Among the four observed variables of IS, the load coefficients of IS2 (0.86) and IS1 (0.82) are larger than tho: se of IS3 (0.66) and IS4 (0.69). This phenomenon indicates that the daily living expenses and current livelihood types have greater impacts on the farmers. Third, the economic benefits of growing grain (PB1) and improving the quality of life (PB2) are the most important factors ‘or farmers to evaluate the PB of NGC. Among the four observed variables of PB of NGC, PB4 is not significant, and the load coefficient of PB3 (0.62) is relatively low. The load coefficients of PB1 (0.90) and PB2 (0.80) were relatively high. This shows that farmers believe that NGC has a great impact on increasing grain income and improving the quality of life. Fourth, the ris ers assess the PR o of technology shortages (PR2) is the most concerning problem when farm- f NGC. The load coefficient of PR4 is not significant, the load coefficient of PRI (0.67) is not high, and the load coefficient of PR3 (0.66) is not high. This shows that farmers are most concerned about a shortage of technology when assessing the perceived risk of NGC. First, the perceived benefit of the farmers promoted the willingness to non-grain conversion of cultivated land, while the perceived risk decreased the willingness to non-grain conver- sion of cultivated and. According to the standardized path coefficients, the PB (0.57) and PR (—0.76) both affect farmer willingness to NGC of cultivated land. From the perspective of the absolute value of the standardized path coefficient, the influence of PB on the willingness to NGC is greater than that of PB. Second, ES (—0.75) had a negative effect on the PB of NGC for the farmers, while IS (0.58) had a positive effect on farmers’ PB of NGC. The influence of ES is greater than that of IS. Third, ES (0.64) can improve the PR of NGC, while IS (-0.63) can reduce the PR of NGC. At the same time, the impacts of the two methods on the PR of NGC. Fourth, ES has a restraining effect on the WNG of farmers, while IS has an enhancing effect on the WNG. ES can block the PB and enhance the PR of WNG. IS can promote the PB and hinder the PR of WNG. First, ES negatively affects WNG in an indirect way, and the degree of impact is large (Table 6). The total effect of ES on WNG is —0.90. From the perspective of path, ES affects WNG through two paths: the impact effect of PB is —0.42, and the impact effect of PR is -0.48. Second, IS has an indirect positive impact on WNG, and the degree of impact is large. The total effect of IS on WNG is 0.81. From the path analysis perspective, the impact effect of the IS through the PB is 0.33, and the impact effect through the PR is 0.47. Therefore, IS mainly affects WNG through the PR. Third, the PB directly positively affects WNG, but the degree of influence is moderate. The PB directly affects WNG; there is only one influence path, and the effect is 0.57. Fourth, the PR negatively affected WNG in a direct way, but the degree of influence was high. The PR directly affects WNG, there is only one influence path, and the effect is -0.76. First, the income from grain farming (ES3) has the greatest impact on ES. According to the load coefficients of the observed variables, the influence of ES3 (0.79) on ES is greater than those of ES1 (0.73) and ES2 (0.74), while the influence of ES4 on ES is not signifi- cant. Second, IS was mainly affected by farmer livelihoods (IS2). The load coefficient of IS2 is 0.92, which is greater than those of IS1 (0.79), IS3 (0.72), while the impacts of IS4 (0.59) on IS are relatively low. Third, the quality of life (PB2) is the most important factor affecting PB of NGC. According to the load coefficients, the load coefficient of PB2 (0.86) was greater than those of PB1 (0.66) and PB3 (0.69), while PB4 had no significant effect. This shows that the NL farmers believe that NGC of cultivated land will help improve the life quality of those. Fourth, there are no prominent factors affecting the PR of NGC. The load coefficient of PR2 is only 0.60, while the load coefficients for PR3 (0.59) and PR4 (0.50) are lower. In addition, the load efficient of PR1 is not significant. Such farmers are more worried about the risk of technology shortages after NGC of cultivated land.",
    "First, WNG comes from the positive impact of PB and the negative impact of PR of the NGC, and the degrees of impact of both are relatively low. The standardized path coefficient of the PB is 0.33, while that of the PR is —0.25, which indicates that the perceived benefit can pro- mote the willingness to non-grain conversion of cultivated land, while the perceived risk can block the willingness. Second, ES (0.41) can improve PB of NGC, while IS (—0.62) can reduce PB of NGC. Third, ES (-0.58) can reduce the PR of NGC, while IS (0.40) can increase the PR of NGC. Fourth, ES can enhance PB of NGC but reduce PR of NGC. In contrast, IS can reduce PB and increase PR of NGC. First, ES positively affect the WNG in an indirect way, and the degree of influence is small. The total effect of ES on the WNG is 0.28. From the perspective of path, ES affects the WNG through two paths: the effect of PB is 0.14, and the effect of PR is also 0.14. Second, IS neg- atively affects the WNG in an indirect way, and the degree of influence is small. The total effect of IS on WNG is —0.30. From the perspective of path analysis, the influence effect of IS through PB is —0.20, and the influence effect through PR is —0.10. Third, the PB directly positively affects WNG, but the degree of influence is low. The PB directly affects the WNG; there is only one influence path, and the effect is 0.33. Fourth, the PR directly negatively affects the WNG, but the degree of influence is relatively low. The PR directly affects the WNG, and there is only one influence path, with an effect of -0.25. First, among the observed variables of ES, ES3 has a greater impact on farmers with agricul- tural livelihoods. Among the nonagricultural farmers, the influence of ES1 and ES2 is greater than those on the agricultural farmers. At the same time, the influences of ES4 on the farm- ers with the two livelihood types is not significant. Second, among the observed variables of IS, IS2 has a great impact on the NL farmers, while the impact of IS1 for the AL farmers has increased greatly. IS3 and IS4 had no significant impacts on the two types of farmers. Third, the AL farmers pay attention to the PB of NGC, while the NL farmers pay attention to improving the life quality of those. Improving the social status has no significant effect on the PB of the two types of farmers. Fourth, the AL farmers are more concerned about the risk caused by technology shortages, and the impact of natural disaster risk is not significant. For the NL farmers, the risk of being penalized is not significant, and the impacts of natural disas- ter risk, technology shortage risk and capital shortage risk are small. First, for the farmers with both types of livelihoods, PB of NGC can increase the WNG, while PR of NGC can block the WNG. PB and PR have greater impacts on RW than LW of WNG. PR has a greater influence on the WNG for the AL farmers. But PB has a greater influence on WNG than does the perceived risk for the NL farmers. This indicates that there are differences in the main influencing factors of WNG with different types of livelihood. Second, there are signifi- cant differences in the influencing mechanism of PB of WNG of the different livelihood types of farmers. For the AL farmers, ES reduce PB of NGC, IS increase the PB of NGC, and the former has a greater impact. In contrast, for the NL farmers, ES increased the PB of NGC, IS the reduced the PB of NGC, and the degree of influence was similar. Third, the impact mechanism of the PR of NGC on the farmers with different livelihood types is quite different. ES can improve the PR of NGC for the AL farmers while IS can reduce the PR of NGC for the AL farmers. In contrast, ES reduces the PR of NGC, while IS increases the PR of NGC for the NL farmers. First, the effect of ES on the WNG varies according to the types of farmer livelihood. ES can greatly reduce the WNG for the AL farmers, while the observed variable can increase the WNG for the NL farmers, but the degree of impact is low. Second, the effects of sur- vival situations on the WNG vary greatly according to the types of farmer livelihood. IS can enhance the WNG of farmers with AL, but it can block the WNG of farmers with NL. Third, PB of NGC has an enhanced effect on the WNG for the farmers of the two liveli- hood types, but the degrees of impact are different. The PB of NGC has a great effect on the WNG for the AL farmers, but it has a limited effect on the WNG for the NL farmers. Fourth, the PB of NGC can reduce the WNG of the farmers with two livelihood types, but the degree of impact is different. The PB of NGC can reduce the WNG for the two types of farmers, but the reduction in the WNG is greater for the AL farmers than for the NL farmers.",
    "Most of the existing research results explored the NGC of cultivated land from the macro perspectives [13,16]. And this study explored the NGC of cultivated land from the micro perspective, which is from the perspective of farmers. The existing research results do not pay attention to the survival situations of farmers, but these factors are the main influ- encing factors of farmers’ willingness to NGC of cultivated land. In addition, the study incorporated the perceived risk and perceived benefit into the decision-making model of farmers’ willingness to NGC of cultivated land, making the research conclusion closer to reality. Therefore, it can provide more practical theoretical support for local government to carry out the policy reform in the field of NGC of cultivated land. In a word, in terms of the research perspective and research content, this study has a certain role in promoting the exploration of NGC of cultivated land This study still has some limitations. First of all, the Chinese government and academia do not have a clear and strict definition of the connotation of NGC of cultivated land. At present, different scholars have the great differences in the definition of NGC of cultivated land, which make the research conclusions less comparable. Secondly, due to the limitation of data collec- tion, the study only analyzed a single cross section data, which may affect our judgment on the influential mechanism of the willingness to NGC of cultivated land. In the follow-up research, the principle of combining theory and practice to explore the precise connotation of NGC of cultivated land would be focus on. In addition, efforts will made to obtain long-term dynamic data to explore the influential mechanism of survival situations on farmers’ willingness to NGC of cultivated land under the different time periods. PB of NGC of cultivated land can increase the WNG, while PR of NGC of cultivated land can reduce the WNG. The purposes of NGC of cultivated land for the farmers vary according to their livelihood types. The influential mechanisms of PB about NGC vary according to the farmers’ livelihood types. The influential mechanisms of the PR of NGC is different from the livelihood types of farmers. The influences of IS and ES on WNG differ according to the livelihood types of the farmer. These conclusions can provide theoretical support for other major grain-producing provinces in China to improve the policy of controlling the NGC of cultivated land."
]