[
    "The willingness of returning migrant workers to purchase houses has an important impact on local urbanization. At present, there are few researches on the willingness of returning migrant workers to purchase houses. The existing researches mostly focus on the perspective of sociology and economics, and few studies are conducted from the perspective of geography. Based on the survey data of 45 villages in Henan Province of China in 2019, this study used binary logistic method to study the inﬂuencing factors of the willingness of returning migrant workers to purchase houses. The willingness of returning migrant workers to purchase houses is affected by many factors, such as personal, family, village, and returning factors. Among them, age and returning period are negatively correlated with the willingness of returning migrant workers to purchase houses. Factors such as years of education, years of working, and per capita income of village are posi- tively correlated with the willingness of returning migrant workers to purchase houses. Returning migrant workers in plains and hilly areas are more willing to purchase houses than those in mountainous areas. The formation of the willingness to purchase houses is mainly related to economic foundation, age, marital status, and other factors. Returning migrant workers are becoming more willing to purchase houses, and the expected locations are mainly concentrated in the county seats. In the context of China's high density of rural population and rapid urbanization, more returning migrant workers are expected to purchase houses in cities and towns for the sake of employment, marriage, children's education, and access to public services. As a result, there is an extensive market of potential purchasers, which affects the development of the local urban real estate industry and is of great signiﬁcance for returning migrant workers to truly integrate into the cities. However, some returning migrant workers still choose to purchase houses in villages, mainly affected by traditional concepts, living habits, and the better development of villages. Therefore, it is of great practical signiﬁcance to explore the willingness of returning migrant workers to purchase houses, so as to master the ﬂow laws and future behavior of returning migrant workers to purchase houses. Received 13 September 2021; Received in revised form 22 May 2022; Accepted 7 July 2022 Available online 21 July 2022 With the rapid advancement of China's urbanization, house purchases by migrant workers as part of the process of urbanization have attracted increasing attention from various academic ﬁelds (Zhang, 2015; Zhou, 2015). Migrant workers refer to those who are registered in their villages and have engaged in non-agricultural industries in cities or towns for 6 months or more, or those who have entered their counties from other villages and engaged in non-agricultural industries for 6 months or more, or those who are permanent residents in the urban area with the main income from non-agricultural industries (Tao, 2018). Regarding the returning migrant workers, there is currently no speciﬁc deﬁnition, but it is related to the wave of migrant workers returning to their hometowns. The return of migrant workers reﬂects a phenomenon that the distance between the work site and village is signiﬁcantly reduced (Gao et al., 2020). It means that migrant workers who are unable to obtain the expected beneﬁts from the city, then they return to their hometowns and use their skills, knowledge, and accumulated experience to ﬁnd employment in or near their residence, increasing their income and promoting the employment of local farmers (Wang, 2019). Based on the opinions of existing scholars, in this research, returning migrant workers speciﬁcally refer to those who return to their hometowns for various reasons and work in or near their residence. Attention to purchase houses by migrant workers began in 2006 (Meng, 2016). In the existing literature, researchers have mainly focused on the living conditions (Feng et al., 2017; Long et al., 2019), subjective willingness to purchase houses, and inﬂuencing factors of migrant workers (Liang et al., 2014; Xu et al., 2015). At present, the housing forms of migrant workers are mainly rented houses, followed by dormitories and sheds; only a few migrant workers have obtained permanent settlement in cities (Chen and Feng, 2011; Ren and Zhang, 2016), and the living conditions of the ﬂoating population were relatively poor (Lin et al., 2014). This is mainly related to the economic conditions of migrant workers. On the subjective willingness of migrant workers to purchase houses, the researchers have mostly focused on the willingness of migrant workers to purchase houses near their workplaces (Han, 2014; Liang et al., 2014), inter-generational differences in housing behavior, willingness to stay in the city, and willingness to purchase houses (Shao et al., 2018; Li and Wang, 2019). Particular attention has been given to the new generation of migrant workers, especially the willingness of mobile groups to purchase houses in cities and towns. The new generations of migrant workers refer to the agricultural household registration populations who were born after the 1980s, are over 16 years old, and are mainly non-agricultural employment in different places. Because the new generations of migrant workers have strong willingness to take root in the city, they often exhibit a higher willingness to purchase houses. However, the basis and ability for purchasing houses are heterogeneous among different towns and generations (Du and Che, 2019). Factors such as marital status, the number of family members, the number of migrant workers, income levels, working and living conditions, satisfaction with current living conditions, and house price expectations all signiﬁcantly affect the willingness of migrant workers to purchase houses in cities (Cheng et al., 2012). Urban integration factors also have an important impact on the willingness of migrant workers to purchase houses (Liang et al., 2014; Song, 2016). The urban-rural choice of the social security system corresponds to the urban-rural choice of migrant workers to invest their retirement places. Participation in the provident fund system has increased the psychological expectations of migrant workers to settle in the city (Wang and Yang, 2015), and promoted their house purchase willingness, but it was not helpful for their ability to settle (Liu, 2017). Some studies have shown that the motivation of migrant workers to purchase houses are mostly driven by the children's education and marriage (Ma, 2018).",
    "There is no reference to migrant workers abroad to date. Similar terms are “immigrants” (Schnell and Benjamini, 2005; Hamdouch and Wahba, 2015; Gao et al., 2019) and “laborers”, but the difference from the Chinese context is that most of these immigrants or labor move internationally. Regarding the house purchasing behavior of immigrants (or laborers), the relevant researches have mostly focused on the housing experiences, the influencing factors of housing ownership, and the degree of integration of immigrant housing and communities (Mundra, 2020). In terms of immigrants' living experiences, some people fear discrimination from locals regarding house affordability. Solving the immigrant living crisis could depend on the government funding for affordable house construction and supervision and cooperation with developers (Dion, 2001; Teixeira, 2011). The housing cost burden of immigrants varies greatly depending on the countries or original regions (Mcconnell and Akresh, 2010; Hunt, 2011). Immigrants are treated unequally in the housing market and are worse off than locals in terms of house ownership (Krivo, 1995; Haas, 2007). The house ownership of immi- grants is related to local policies. The unfavorable political atmosphere for immigrants often makes immigrants less likely to own a house (Allen and Ishizawa, 2015). Immigrants are much more difficult to purchase houses, largely due to unexpectedly high costs and the immigrants’ unfamiliarity with the housing system (Teixeira and Drolet, 2018). The main problem for immigrants is low housing affordability. According to the survey, almost half of the respondents spend more than 30.00% of their monthly income on housing (Lopez and Teixeira, 2022). Immigrant housing has an important impact on community integration. Adequate, suitable, and affordable houses are necessary for immigrants to integrate into the community (Brown, 2016). At the same time, the opportunity for immigrants to obtain local services is also a key factor for their successful integration into the community. Accordingly, although the relevant domestic and foreign literature has represented research on the purchase behavior and residences of migrant workers (Hui, 2005; Gram-Hanssen and Bech-Danielsen, 2012; Aalbers et al., 2018; Li et al., 2019), the following short- comings still exist. First, the existing literature mostly focused on the willingness of migrant workers to purchase houses near the work site, and there were few studies on the house purchase willingness in labor outﬂow areas after migrant workers returning. Inﬂow and outﬂow areas are completely different spatial concepts, especially in the current context in which there is an increasing trend of returning migrant workers. Thus, more attention should be paid to the research on the willingness of returning migrant workers to purchase houses. Second, the previous literature has mostly focused on analyses from sociology and economic viewpoints and seldom analyzed the perspectives of geography, such as the spatial distance between the work site and purchase site, the terrain of the village, and the accessibility. Based on the household survey data of 45 villages in Henan Province of China, this paper studied the inﬂuencing factors of the returning migrant workers' willingness to purchase houses from a microscopic perspective, in order to master the char- acteristic of migrant workers’ mobility and future house purchase behavior, to enrich the research on the purchase and living behaviors of migrant workers, and to formulate relevant policies as a reference for local governments. This study takes Henan Province (110°21/-116°39/E, 31°23’—36°22'N) as the case area, which is located in central plain of China. It borders Anhui and Shandong provinces in the east, Hebei and Shanxi provinces in the north, Shaanxi Province in the west, and Hubei Province in the south. Henan Province is an important comprehensive transportation hub and an information flow center for people and logistics in China. The terrain is high in the west and low in the east, consisting of plains, basins, mountains, hills, and water bodies. The province is located in a warm temperate zone, with a subtropical zone in the south; it is characterized by a continental monsoon climate with a transition from the northern subtropical zone to the warm temperate zone. According to the geographical position of Henan Province, it can be divided into 5 regions: eastern Henan Province (EHP), western Henan Province (WHP), central Henan Province (CHP), southern Henan Province (SHP), and northern Henan Province (NHP). Generally speaking, with the Beijing-Guangzhou railway Fig. 1. Overview of surveyed villages and the number of surveyed households (value in the parenthesis). EHP, eastern Henan Province; WHP, western Henan Province; CHP, central Henan Province; SHP, southern Henan Province; NHP, northern Henan Province. This map is based on the standard map (GS (2019) 3333) of the Map Service System (http://bzdt.ch.mnr.gov.cn/), and the base map has not been modiﬁed.",
    "line as the boundary, the west of the Beijing-Guangzhou railway line is called WHP, which is mostly mountainous; the east of the Beijing- Guangzhou railway line is EHP, and the terrain is mainly plains. The Yellow River crosses Henan Province. With the Yellow River as the boundary, the north of the Yellow River is called NHP, and the south of the Yellow River is called SHP. Henan Province not only has a huge population, but also has a large number of migrant workers, generally accounting for about 10.00% of the total number of migrant workers in China (National Bureau of Statistics, 2013). In recent years, with the increase in the number of returning migrant workers, this group has gradually become very large. According to preliminary statistics, in 2011, the number of returning domestic workers in Henan Province exceeded the number of exporters from other provinces for the first time (Zhang et al., 2017). According to a sample survey conducted by the Statistics Bureau of Henan Province (2014), the proportion of the workers who worked outside Henan Province dropped from 47.40% to 43.60% during the period of 2012-2014, and the number dropped by approximately 1.40% per year (4.2 x 10° per year). The returning migrant workers have played an active role in the economic development of Henan Province and become the main force in destocking real estate. In this study, the data were from the survey conducted by the research team. From January to March 2019 (around the Lunar New Year), a large number of migrant workers returned to the villages for the Spring Festival. A total 45 trained undergraduates and master students conducted a face-to-face questionnaire survey of returning migrant workers from 45 villages in Henan Province (Fig. 1). In selecting the surveyed villages, the investigators ﬁrst considered whether there were more returning migrant workers in the villages. Second, they considered the distribution of the administrative area, topography, distance, and income. The distribution of surveyed villages is relatively scattered. Although Henan Province is divided into 5 regions, namely EHP, WHP, CHP, SHP, and NHP, but there is no clear standard for the division of regions. The number of surveyed villages in EHP, WHP, CHP, SHP, and NHP is 12, 9, 5, 9, and 10, respectively, and the number of surveyed households in EHP, WHP, CHP, SHP, and NHP is 364, 295, 132, 257, and 352, respectively, totaling 1400 households (one volume for one household). The main contents of the survey include the family, employment, and return situations of returning migrant workers. In addition, through interviews with village cadres, a more detailed understanding of the development of the villages was also attempted. After invalid questionnaires were excluded, a total of 1387 valid questionnaires were obtained. Among the participants, in addition to the house purchasers, there are 1113 non-house purchasers, 828 of these non-house purchasers express their willingness to purchase or not to purchase a house, accounting for 74.40% of the non-house purchasers. This database of 828 households with 86 attributes each is used as the basis of this study, which includes the gender, age, marital status, years of education, years of working, place of employment, labors skills, number of family members, number of labors, number of young children, number of elderly people, amount of arable land, per capita income of the village, economic status in the village, distance between the work site and hometown, the time and reason of returning hometown, and the returning method (intra-province or inter-province), etc. According to the sample statistics, among the surveyed returning migrant workers, females and males are 532 and 296, which account for 64.25% and 25.75% of the total respondents, respectively. The proportions of married and unmarried people are 84.56% and 15.34% of the total respondents, respectively, with the majority being married. In terms of age structure, the respondents are mainly aged 26–45 years old, which account for 51.21% of the total. The interviewees aged lower than 25 years old and higher than 46 years old account for a relatively small number of the total respondents, with the proportions of 17.03% and 31.76%, respectively. In terms of the education level, the respondents with an elementary school education or below account for 19.44% of the total, junior high school education for 50.12% of the total, high school and technical secondary school education for 26.09%, and college education or above for the lowest proportion, only 4.35% of the total. The proportion of skilled migrant workers is slightly higher than that of unskilled, being 53.26% and 46.74%, respectively. Years of working refer to the length of time from the year when migrant workers started working to the time of the survey. The returning migrant workers all have long years of working experiences, with the working experience of more than 10 years accounting for 63.89%, and working experience of less than 10 years accounting for 36.11% (Table 1).",
    "There is no uniﬁed understanding of the concept on the house purchase willingness in the existing literature. Referring to existing researches, house purchase willingness is a subjectively psychological activity before the purchase behavior occurring. Therefore, in this paper, house purchase willingness can be understood as the thoughts or intentions of returning migrant workers before the purchase behavior of real estate, and the personal subjective thinking. In the questionnaire, there is a question: “Do you plan to purchase a house in the town in the next 10 years?”, and the alternative answer was planned and not planned. This is the source of data for this research. Intending to purchase a house and not intending to purchase a house are expressions of willingness. This study uses the binary logistic method to analyze the inﬂuencing factors. The dependent variable (y) is the willingness of returning migrant workers to purchase houses in the place where they returned, in which y ¼ 1 indicates the willingness to purchase a house (intending to purchase), and y ¼ 0 in- dicates no willingness to purchase a house (not intending to purchase). The purchase willingness survey is mainly aimed at the returning migrant workers who had not purchased houses (excluding those who had already purchased houses). The X denotes the various factors that affect the willingness of returning migrant workers to purchase houses. Assuming that a returning migrant worker i intends to purchase a house and that the probability of purchasing a house is Pi, then 1–Pi is the probability that the returning migrant worker does not intend to purchase a house (Liu and Wang, 2015; Gu et al., 2020). The nonlinear model relationship with X is established as follows: In the formula, F(y) is the combined probability of observing n values of y; β0 is the partial regression coefﬁcient; j is the different regions; m is the total number of variables; and the value of βj represents the extent of the inﬂuence of the Xj factor on the willingness of returning migrant workers to purchase houses. The overall quality of the logistic regression model needs to be judged from three aspects. One is the test of the model X2. If the X2 model test is statistically signiﬁcant, it is believed that the information provided by the independent variables helps to better predict the occurrence of the event. The second aspect is the prediction accuracy of the model, that is, the ratio of the predicted results of the model to the actual observed events. The third aspect is the R2-like index, which is similar to the coefﬁcient of the determination (R2) in a linear regression analysis. The value is in the range of 0–1. When the index is larger, the ratio of the independent variables in the description of the dependent variable is higher, and the accuracy of the model prediction is higher too. When the willingness was taken as the dependent variable (with willingness to purchase houses ¼ 0, and without willingness to purchase houses ¼ 1), 15 independent variables were introduced into the logistic model using regression analysis in SPSS 17.0 to obtain the model calculation results. Before introducing the model, a correlation analysis was performed on all variables, and the possibility of a high correlation between variables was excluded. According to survey data, this article summarized the factors that affect the willingness of returning migrant workers to purchase houses into 4 aspects: personal, family, village, and returning factors. The personal factors include gender, age, years of education, marital status, and years of working. Generally speaking, the personal factors had important inﬂuences on the willingness of returning migrant workers to purchase houses. The core views of the concept of human capital are that human resources are the most important resources, and educational investment is the main aspect of human investment. Different individuals have different factors of human capital, and their performance will be very different in the face of major decision-making problems. Family factors include the number of family labors, dependency ratio, amount of arable land, and economic status of families. As a member of the family, one's behavior is often controlled by family factors. From the perspective of family decision-making theory, family decision is often superior to the in- dividual member's decision. On the issue of house purchase, migrant workers who are the core members of the family, the education of future generations, the number of elderly dependents, any intermittent agricultural production, and other factors must be taken into consideration. Therefore, when migrant workers choose to settle down after returning home, they must comprehensively consider various family factors before deciding whether to live in the village or city. The economic status of a farm household was determined by a comparison and judgment of the economic status of the households in the village, which was made by the respondents, since this survey was anonymous, reﬂecting the actual situation. Village factors include village terrain, per capita net income of village, and village labor ratio. Returning factors are returning method, returning period, and spatial distance. The villages and returning factors, which are regarded as external factors, exhibit an impact on the willingness of returning migrant workers to purchase houses. Generally speaking, migrant workers in mountainous and hilly areas are more eager to get rid of the restrictions of trafﬁc conditions, therefore, they are more likely to purchase houses in cities and towns. In villages with better economic development and higher per capita income, people consider purchasing houses in cities and towns. The farther the migrant workers are from their hometown before returning, the less Fig. 2. Flow of the willingness of returning migrant workers to purchase houses. This map is based on the standard map (GS (2019) 3333) of the Map Service System (http://bzdt.ch.mnr.gov.cn/), and the base map has not been modiﬁed.",
    "likely they are integrate into the local social and cultural living environments, and the more likely they have willingness to purchase houses. So, in this study, we selected the variables shown in Table 2. In this survey, 380 respondents clearly stated that they would like to purchase houses, accounting for 45.89% of the total re- spondents. The results of this survey were similar to those of existing literature, that is, whether they are the new generation of migrant workers or the old generation of migrant workers, they have higher willingness to purchase houses (Gao et al., 2015). In addition, there are 448 returning migrant workers who stated clearly that they have no intention to purchase a house, accounting for 54.11% of the total. In order to further grasp the dynamics of their willingness to purchase houses, from August to September 2020, we conducted a further return visit to investigate those who have no willingness to purchase a house. When they answered the two questions: “Is there any plan to purchase a house in the near future?” and “Is there a plan to purchase a house within ten years?”, only a small number of respondents chose to purchase a house with a plan. Most respondents who have no willingness still have no plan to purchase a house in the near or long term. In terms of expected housing location, although the choices of returning migrant workers are diverse, there are generally similar; that is, they all show the characteristics of being mainly concentrated in the county seat (Fig. 2). According to statistics, the proportions of returning migrant workers who choose to build a house in their villages, and purchase a house in the town, in the county seat, in the prefecture-level city, and in the provincial capital city are 15.95%, 3.23%, 64.85%, 12.28%, and 3.69%, respectively. Among them, the county seat shows a signiﬁcant advantage when returning migrant workers choose the location of housing. It should be pointed out that some returning migrant workers still choose village (self-built house) as their residence location. In different regions, the sequence of the willingness of returning migrant workers to purchase houses is as follows: CHP (64.56%)> NHP (51.05%) >EHP (49.28%)>WHP (37.91%) >SHP (15.28%). The returning migrant workers who have and do not have willingness to purchase houses are basically the same in the EHP and NHP, but the difference is that the returning migrant workers who have willingness to purchase houses are slightly more than those who do not have willingness to purchase houses in the EHP, while those who do not have willingness to purchase houses are slightly more than those who have willingness to purchase houses in the NHP. In terms of gender, males in CHP, females in EHP, females in CHP, and males in NHP are more willing to purchase houses, while males and females in SHP have the weakest willingness to purchase houses, consisting with the previous analysis the willingness to purchase houses in SHP is the weakest. Compared with unmarried people, married people are the main force in the housing market, and this is true in all regions of Henan Province. In terms of age structure, returning migrant workers with the ages of <25 years old have a higher proportion of house purchase willingness in NHP compared with other regions. In CHP, returning migrant workers with the ages of 26-45 and > 46 years old have a higher willingness to purchase houses (Fig. 3). In different regions, people with different years of education, years of working, and skill levels expressed different house purchase willingness (Figs. 4 and 5). Personal factors, such as age, years of education, marital status, and years of working, are signiﬁcant with willingness to purchase houses under the 95% conﬁdence interval (P < 0.05; Table 3). Age is signiﬁcantly negatively correlated with the willingness of returning migrant workers to purchase houses. The willingness of returning migrant workers to purchase house decreases by 1.80% with each year of age increase. The years of education is signiﬁcantly positively correlated with the willingness of returning migrant workers to purchase houses. With each additional year of education, the willingness of returning migrant workers to purchase houses increases by 2.80%. Marriage factor is negatively correlated with the willingness of returning migrant workers to purchase houses. The willingness of married returning migrant workers to purchase houses is 0.45 times the willingness of unmarried returning migrant workers. The years of working are positively correlated with the willingness of returning migrant workers to purchase houses. When the years of working are longer, the willingness of returning migrant workers to purchase houses is stronger.",
    "Note: B, regression coefﬁcients; SE, standard error; Wals, a statistic that tests whether an independent variable has an effect on a dependent variable; df, degrees of freedom; Sig., signiﬁcance test; Exp, the explanation of value of the corresponding variable. “-”, more than two categories of independent variables, dummy variables are set automatically. The reference objects of the model are as follows: farmers' economic status is good, terrain is mountainous, marital status is married, gender is male, and migrant workers return from inter-province. X9(1), the variable of poor economic status; X9(2); the variable of medium economic status; X10(1), the variable of plains in the terrain; X10(2), the variable of hills in the terrain. The threshold of the signiﬁcance level is 0.05. The factor of farmers’ economic status reaches a signiﬁcant level. From the calculation results of the model, it can be observed that compared with returning migrant workers with better economic status, the returning migrant workers with a low economic status are more likely to purchase houses. Factors such as the amount of arable land have no signiﬁcant inﬂuence on the willingness of returning migrant workers to purchase houses (P ¼ 0.314). The inﬂuence of the number of family generations on the willingness of returning migrant workers to purchase houses is weak. For example, the number of family generations with and without the willingness of purchase houses are 2.57 and 2.55, respectively, and the difference is very small. The impact of the per capita income of village and terrain on the willingness of returning migrant workers to purchase houses reaches a signiﬁcant level. There is a positive correlation between the per capita income of village and the willingness of returning migrant workers to purchase houses. When the per capita income of villages is higher, the willingness of returning migrant workers to purchase houses is stronger. The terrain has a negative correlation with the willingness of returning migrant workers to purchase houses. Compared with plains or hilly areas, returning migrant workers in mountainous areas are less willing to purchase houses in the future. There is a signiﬁcant negative correlation between the returning period and the willingness of returning migrant workers to purchase houses. That is, when the returning period is longer, the probability of choosing to purchase a house in the future is smaller. The returning method (intra-province and inter-province) and the spatial distance do not reach a signiﬁcant level on the willingness of returning migrant workers to purchase houses. Regardless of whether the returning migrant workers come from outside the province or within the province, there is no basically difference in their willingness to purchase houses. In addition, there is no difference in the willingness to purchase houses among the returning migrant workers from intra-province, i.e., provincial capital cities, prefecture-level cities, county seats, market towns, and other centers of different levels. In the process of rapid urbanization in China, there are many problems during the transformation of migrant workers into urban population, such as housing, employment, children's education, social security, and so on, especially the poor housing conditions of migrant workers (with small areas and simple facilities) and even no permanent homes. The National New Urbanization Plan (2014-2020) promulgated by the State Council (China) in 2014 clearly stated that people-centered urbanization should be promoted, and approximately 1.0 x 10° agricultural migrants should be permitted to settle in cities and towns. In the context of positive macro policies, the key to people-centered urbanization lies in whether migrant workers can cross the economic threshold to achieve “rooting” in cities and towns (Wang et al., 2018), but the returning trend of migrant workers is continuously increasing along with the balanced development of China's regional economy. In this context, exploring the willingness of returning migrant workers to purchase houses is of great practical signiﬁcance to master the law of migrant workers' mobility and future house purchase behavior. Studies have shown that returning migrant workers have become the main force in urbanization process, but “marriage migration” and “education migration” have become a special form of urbanization (e.g., Li and Yan, 2016), which are consistent with the results of this article. After obtaining a certain amount of economic income, the returning migrant workers have a strong desire to purchase houses for reasons such as marriage, children's education, and the improvement of life quality. This is inseparable from the traditional Chinese concept of living and working in peace and contentment. Although this form of urbanization has solved the housing problems of migrant workers in cities, it has not achieved a fundamental transformation in production methods, living conditions, and behavior habits. Moreover, the development of China's urbanization is in a critical period of transition from high speed to high quality, taking the new path of urbanization with Chinese characteristics and the path of people-centered urbanization. It is necessary to guide the benign interaction among “marriage migration”, “education migration”, and urbanization.",
    "Some scholars also believed that in the choice of housing location, most of returning migrant workers’ decisions choose to settle doen in the city near their hometown. Small and medium-sized cities such as county seats and prefecture-level cities are the main places where migrant workers choose to settle down (Liu and Zhou, 2015; Ren and Zhang, 2016). The tremendous pressure brought by the rapid rising of housing prices in big cities has caused small towns to become the main purchase locations for migrant workers (Xia, 2010). Lopez and Teixeira (2022) pointed out that the suburbs have become the main locations for immigrants, but this type of “suburban immigrants” have seriously affected the local housing conditions. This is not completely consistent with the results of this study. County seats usually have lower housing prices and better public service functions, and are close to villages, creating a greater attraction for returning migrant workers. Thus, county seats will become the main breakthroughs for urbanization. Though the prefecture-level cities have more complete public service facilities, nevertheless, only a small number of returning migrant workers choose to settle down in prefecture-level cities due to higher housing prices. Similarly, due to the high housing prices and the long distance of provincial capital city from the villages, only a few or individual returning migrant workers choose the provincial capital city as housing location. In addition, the provincial capital city in Henan Province has implemented a series of restrictions on house purchases in recent years, which has also restricted the house purchase options of returning migrant workers to a certain extent. In contrast, villages are becoming more and more perfect and thus attract some returning migrant workers. The suburbs in China have become housing concentrations for the rich rather than migrant workers (Zhang and Zhu, 2003), due to larger housing area and better living environment. Previous researchers of this group also found that the villages and county seats are the main working sites for returning migrant workers (Gao et al., 2020). Therefore, the preferred areas for returning migrant workers to purchase houses are the villages and county seats. Although the two phenomena are closely related, signiﬁcant differences still exist. Some returning migrant workers have no willingness to purchase houses in cities and towns in the short-term or long-term. The reason is that they have lived in the villages for a long time and are not used to other places (including other villages and cities); further, the development of villages is getting better and better, so villages are still one of the ideal areas for returning migrant workers to live in the future. The growing trend of returning migrant workers has caused more attention from scholars, but few scholars have paid attention to the issues of settlement after returning and the willingness of migrant workers to purchase houses (Han, 2014; Liang et al., 2014). This article uses ﬁrst-hand survey data to explore the factors that affect the willingness of returning migrant workers to purchase houses. The willingness of returning migrant workers to purchase houses is affected not only by the personal factors such as gender, age, years of education, marital status, years of working, etc., but also by the economic status of the families, as well as external factors, such as the economic level and terrain of villages. In terms of personal factors, when the returning migrant workers are older, they have a deeper attachment with their hometowns, so they are more difﬁcult to integrate into the new environment. Therefore, they have less willingness to purchase houses in cities and towns. Younger migrant workers, especially those who are “post-90s”, are already second-generation migrant workers who live in cities with their parents and have a weaker attachment to their hometowns, thus, they are more inclined to purchase houses in cities and towns. This conclusion is consistent with the ﬁnding of existing study (Wu et al., 2016), that is, young people have a strong willingness to settle down in cities and towns, and elderly migrant workers (over 50 years old) have a low willingness to purchase houses in cities and towns. The difference in the years of education leads to differences in the location choice. The education level affects the employ-ability of people, such as obtaining job opportunities, employment information, and working income. The returning migrant workers with long years of education plan to purchase houses in larger or higher economic level cities, reﬂecting the signiﬁcant correlation between population transfer level and education level to a certain extent. This phenomenon of population diversion is not only the result of social development, but also the inevitable result of market economy. It is also consistent with the current talent policy that is implemented actively in some regions. For example, the talent settlement policy implemented by Zhengzhou City (the provincial capital of Henan Province) tends to target those with a college degree or above. The marriage status is inversely proportional to the willingness of returning migrant workers to purchase houses, because the success of a marriage for males is closely related to owning a house in many places, which is consistent with the conclusions of existing scholars that migrant workers purchase houses because of marriage (Cheng et al., 2012). The longer the years of working, the richer the personal and capital accumulation, the bigger the economic foundation, and the stronger the willingness of returning migrant workers to purchase houses.",
    "From the perspective of family factors, the returning migrant workers with a poorer economic status have a stronger desire to change their families' living conditions, therefore, they have a higher willingness to purchase houses. The amount of arable land has no sig- niﬁcant inﬂuence on the willingness of returning migrant workers to purchase houses, which indicates that with the process of ur- banization, the pulling effect of land that once was the most important means of production has been minimal on farmers’ staying in villages. From the aspect of village factors, when the economy of villages is more developed, the per capita income of village is higher, the material foundation of villagers is stronger, and the willingness of returning migrant workers to purchase houses is stronger. In fact, the most important inﬂuencing factor is the economic foundation. Under the background of high house prices, if there is no capital or the future expected income as a guarantee, then it is difﬁcult to form house purchase expectations. Terrain factors also affect the willingness of returning migrant workers to a certain extent. The mountainous area has complex terrain and inconvenient transportation, which affects the development level of the local secondary and tertiary industries and leads to a weak economic foundation that indirectly inﬂuences the willingness of returning migrant workers to purchase houses. The development of transportation network is a prerequisite for economic development. Superior transportation conditions combined with modern industry are an important factor in economic development (Black, 2001). In the point of returning factors, the returning period affects the willingness of returning migrant workers to purchase houses. The reason is that the income of most returning migrant workers who return to their hometowns will decrease after a certain period of time. At present, although active returning is gradually increasing, passive returning still accounts for a certain proportion. Passive returning is caused by family and personal reasons or unemployment. In addition, the returning method (intra-province and inter-province) and the spatial distance nearly have no inﬂuence on the willingness of returning migrant workers to purchase houses, because the will- ingness of returning migrant workers to purchase houses mainly depends on the availability of funds and the demand for house pur- chases, and less affected by the external environment (Hu and Tian, 2012). In this research, it is not difﬁcult to ﬁnd that the willingness of returning migrant workers to purchase houses is not the result of a single factor, but the result of a combination of multiple factors. In the process of urbanization, many returning migrant workers with a certain economic foundation have a demand to purchase houses in cities or towns, taking into account such factors as marriage status, education, employment, entrepreneurship, and enjoying public services. If this demand can be realized, it will become an important force for purchasing houses in local cities. Previous research has conﬁrmed that returning migrant workers are becoming the main force of the destocking of real estate in the urban industry (Jia, 2017). Housing is also a necessary condition for migrant workers to have the citizenship. Under the current social background in China, it is an objective condition for migrant workers to have their own houses in cities or towns if they want to achieve real urban integration. In this study, we used the binary logistic method to study the factors that affect the willingness of returning migrant workers to purchase houses in Henan Province. The willingness of returning migrant workers to purchase houses is affected by many factors, such as personal, family, village, and returning factors. Among them, age and returning period are negatively correlated with the willingness of returning migrant workers to purchase houses. Factors such as the years of education, years of working, and per capita income of village are positively correlated with the willingness of returning migrant workers to purchase houses. Returning migrant workers in plains and hilly areas are more likely to purchase houses than those in mountainous areas. The formation of the willingness of returning migrant workers to purchase houses is mainly related to the economic foundation, age, marital status, and other factors. All factors that conducive to improving the accumulation of funds, such as the years of working, the years of education, and the economic development level of village, have positive impacts on the willingness of returning migrant workers to purchase houses.",
    "Returning migrant workers have a strong willingness to purchase houses, and the expected location is mainly concentrated in the county seats. In the context of China's high-density population in villages and rapid urbanization, due to factors of employment, marriage, children's education, and access to public services, more returning workers expect to purchase houses in cities and towns, and the expected locations are the relatively larger cities. This extensive potential purchaser's market affects the development of the local urban real estate market and has an important implication for the real urban integration of returning migrant workers. It is recom- mended that the government should reasonably regulate the price of houses to promote the sustainable development of the real estate industry and urbanization process. At the same time, in the process of returning migrant workers into the city, we should emphasize the role of county, as an important carrier of returning migrant workers citizenization. The returning migrant workers who have no will- ingness to purchase houses in villages or cities are mainly affected by factors such as traditional concepts, living habits, and the relative high economic development of villages. This study is mainly carried out from a micro perspective, in the future, it is necessary to analyze the relevant research from a macro perspective to form a correspondence or supplement. In addition, the conclusion of this study is mainly based on the sample data of Henan Province, it remains to be further veriﬁed whether the conclusion is applicable to other regions. The author solemnly promises there is no potential competing interests about this paper, and the study is the original paper, all or part of the content in the paper has never been published in any other journal in any form, there is no problem of repeated submission, there is no plagiarism, and does not contain any contents which violate laws and regulations and infringe on the rights and interests of others."
]