[
    "Shanghai Key Laboratory of Mental Health and Psychological Crisis Intervention, Affiliated Mental Health Center (ECNU), School of Psychology and Cognitive Science, East China Normal University, Shanghai, China Henan Province in Central China was hit by unprecedented, rain-triggered floods in July 2021 and experienced a recurrence of the COVID-19 pandemic. The current study aims to identify the latent profiles of psychological status and acceptance of change among Henan residents who have been cumulatively exposed to these floods and the COVID-19 pandemic. A total of 977 participants were recruited. Latent profile analysis (LPA) was used to explore underlying patterns of psychological status (i.e., perceived risk of the COVID-19 pandemic, post- traumatic stress symptoms, anxiety and rumination) and acceptance of change. The predictors were evaluated with multinomial logistic regression. LPA identified four patterns of psychological status and acceptance of change: high distress/ high acceptance (5.1%), moderate distress/moderate acceptance (20.1%), mild distress/mild ac- ceptance (45.5%), and resilience (29.3%). The additive impact of the floods and COVID-19 pan- demic and negative emotion during the floods were the risk factors, while flood coping efficacy, trust, and a closer psychological distance change were the protective factors. The present study therefore provides novel evidence on psychological status after both a nat- ural disaster and a major public health event. The cumulative effects of the floods and the COVID- 19 pandemic may have heightened the risk of post-disaster maladaptation. A complex relation- ship between psychological outcomes and acceptance of change was also found. The findings of this study thus provide a foundation for both disaster management and psychological assistance for particular groups. The COVID-19 pandemic is an ongoing, widespread traumatic stressor that has caused severe disruptions in multiple dimensions of life [1]. As the COVID-19 pandemic is a long-term crisis without a foreseeable end date [2], other traumatic events, such as natural disasters, may heighten the risk of recurrent trauma exposure. By the end of 2020, more than 70 countries had been subject to a flood Corresponding author. Shanghai Key Laboratory of Mental Health and Psychological Crisis Intervention, Affiliated Mental Health Center (ECNU), School Psychology and Cognitive Science, East China Normal University, 3663 North Zhongshan Road, Shanghai, 200062, China. “ Corresponding author. School of Educational Science, International Joint Laboratory of Behavior and Cognitive Science, Zhengzhou Normal University, Zhengzhou, 450044, China. Received 15 July 2022; Received in revised form 30 December 2022; Accepted 30 December 2022 Available online 31 December 2022 2212-4209/© 2023 Elsevier Ltd. All rights reserved. after their first case of COVID-19 had been detected [3]. On July 20, 2021, Henan Province in Central China was hit by unprece- dented, rain-triggered floods, which affected more than 14 million people and claimed 302 lives. These record downpours flooded subway systems and caused widespread cutoffs of water supplies and electricity outages [4]. Before post-disaster recovery was fully accomplished, the provincial capital, Zhengzhou, was confronted with a recurrence of the COVID-19 pandemic in late July. To curb the spread of the pandemic, lockdown policies were adopted in high-risk areas. Public venues across the whole city, such as restau- rants and entertainment facilities, suspended services. Citizens in Zhengzhou thus faced both post-disaster- and lockdown-triggered difficulties at the same time. Both natural disasters and the COVID-19 pandemic have been suggested to cause a range of psychological symptoms, including post-traumatic stress symptoms (PTSS), rumination and anxiety [5-9], and the COVID-19 pandemic has elevated risk perception [10]. Moreover, risk perception of the COVID-19 pandemic may also affect psychological responses and coping behaviors [11,12]. Previous trauma exposure to floods may have exacerbated the detrimental effect of the subsequent COVID-19 pandemic, which constitutes sen- sitization. As articulated in sensitization models, previous trauma increases sensitivity to negative mental health outcomes when indi- viduals face an additional traumatic event [58]. A prior meta-analysis has indicated that previous trauma exposure is associated with a higher risk of post-traumatic stress disorder (PTSD) following a subsequent trauma [13]. More recent research has demonstrated that this effect is mediated by symptomatic responses following past trauma [14,15]. Past trauma exposure may lead to an attenua- tion of psychological resources and coping capacities, intensifying their vulnerability when individuals are confronted with a new stressor [16,17]. Overall, cumulative exposure to a natural disaster and the COVID-19 pandemic is likely to exacerbate vulnerability to mental health difficulties. A previous study has found that people who have experienced both the COVID-19 pandemic and either floods or wildfires are more likely to have anxiety, depression and PTSD than those who have experienced only the COVID-19 pandemic [18]. Given that the onset of flooding and the lockdown in Zhengzhou occurred with a mere interval of eleven days, individuals there may not have fully recovered from flood-related disruptions when faced with the pandemic. As a consequence, they may have suffered more severe psychological distress due to the cumulative effect of the floods and the COVID-19 pandemic. Thus, it is important to in- vestigate the mental health status of Zhengzhou residents who were exposed to these two mass stressors during a short period. Given the common occurrence of natural disasters worldwide, the present study may have implications for future disaster management and psychological assistance following the occurrence of further natural disasters amid the COVID-19 pandemic.",
    "Psychological responses to traumatic events are heterogeneous among individuals [19]. A recent meta-analysis has also shown that the psychological impact of COVID-19 lockdowns demonstrates considerable heterogeneity [20]. A person-centered approach can thus help us understand the different patterns of psychological responses among people who have experienced both rain- triggered floods and the COVID-19 pandemic. The literature has adopted latent profile analysis (LPA), a person-centered approach, to identify profiles associated with psychological outcomes in COVID-19 pandemic-affected samples, such as university students or indi- viduals in mandatory quarantine, and has found that different subgroups show different patterns of psychological reactions [21,22]. Accordingly, to investigate the heterogeneous psychological impact of the cumulative traumatic experiences of floods and the COVID- 19 pandemic, the current study used LPA to explore the types and proportions of psychological symptoms and risk perceptions that followed these events. Given that floods and the COVID-19 pandemic have posed huge challenges to people's lives, it is important to consider how well individuals cope with these changes, that is, their acceptance of change. Acceptance of change refers to the tendency to embrace change instead of pushing it away [23]. In unchangeable situations, such as natural disasters or the COVID-19 pandemic, acceptance is a particularly important coping strategy [24]. Acceptance level has been associated with adaptive outcomes after traumatic events. For example, during the COVID-19 pandemic, individuals characterized by the engaged coping profile (i.e., acceptance) have exhib- ited the highest psychological well-being [25]. However, Hussain and Bhushan have found that acceptance is positively associated with both PTSS and post-traumatic growth among refugees [26]. Thus, the relationship between acceptance of change and mental health may be complex. On the one hand, acceptance of change may be a protective factor for mental health amid a traumatic event. On the other hand, people may learn to accept that changes are essential and inevitable after struggling with a stressful crisis [27]. That is, a change in worldview may also contribute to the acceptance of change. Therefore, in different subgroups, the patterns of post-traumatic mental health and acceptance of change may be different. Combinations of risk and protective factors contribute to individuals' responses to disasters [28], and thus identifying these factors facilitates post-disaster prevention of psychopathology. According to a recent review, the predictors of post-disaster psychological outcomes can be categorized as disaster-related factors, individual factors or social factors [29]. Disaster-related factors, such as trauma exposure and negative emotional responses to natural disasters, are consistently related to adverse mental health outcomes following natural disasters [30,31]. Individual factors, including coping efficacy and trust, and social factors, such as psychological distance, may have protective effects. Moreover, individual factors can be affected by the emergency response and disaster manage- ment of a government. Trust in government is associated with the reduced risk perception of natural disasters and reduced PTSD symptoms following natural disasters [32,33]. Moreover, residents with greater confidence in authorities’ disaster response are more likely to have a high level of perceived preparedness [34]. In terms of social factors, social connectedness protects individuals from detrimental psychological outcomes, based on a sample exposed to flooding and drought [35]. The same protective effect of social connectedness has also been found during the COVID-19 pandemic [36]. Accordingly, the aim of the current study is to use LPA to identify the profiles of psychological outcomes (i.e., perceived risk of the COVID-19 pandemic, PTSS, anxiety, rumination) and acceptance of change among a sample of Zhengzhou residents who have experi- enced both the floods and the subsequent COVID-19 pandemic. We also examine the effect of potential risk and protective factors on profile membership, including demographic characteristics, disaster-related variables, individual factors and social factors. Identify- ing heterogeneous subgroups and their predictors may enable the provision of personalized intervention plans for individuals with different levels of psychological distress and acceptance of change. The study was conducted from August to September 2021, approximately one month after Henan Province in Central China was hit by rain-triggered floods on July 20, 2021. The provincial capital, Zhengzhou, was one of the hardest-hit areas and was subse- quently confronted with a resurgence of the COVID-19 pandemic. Due to the pandemic, face-to-face investigations were restricted. Thus, we conducted an online survey in Central China. Online questionnaires were publicized through e-posters on social media platforms, such as WeChat. These e-posters included a link for study volunteers to access an informed consent page. After providing their informed consent, participants were directed to the anonymous research questionnaire. Data were collected after the floods and during the COVID-19 pandemic, from August 19, 2021 to September 3, 2021. Ultimately, 977 participants who met our inclusion criteria (i.e., experiencing both the Henan floods and subsequent pan- demic) completed the questionnaire. Most participants were from Zhengzhou (938); the rest were from other flood-hit cities in Henan Province where the COVID-19 pandemic had also resurfaced. All participants had been influenced by COVID-19 lockdown policies (for example, being quarantined) after witnessing the floods. A total of 5 participants (0.51%) were quarantined at home because of the COVID-19 pandemic, and 8 participants (0.82%) were quarantined at hospitals. Participants ranged in age from 18 to 70 (M = 33.39, SD = 8.77), and 81.1% were female. The demographic information of the participants is presented in Table 1. The study design and procedures were approved by the ethics review committee at East China Normal University (HR151-2020).",
    "PTSS was assessed using the 7-item version of the Impact of Event Scale-Revised (IES-R; [60]), which was specified to the flooding. The IES-R was translated into Chinese by Guo and colleagues [55] and covers three parts: avoidance, intrusion and hyperarousal. For each item, participants respond on a four-point scale ranging from 1 to 4. In the present study, the scale exhibited good internal con- sistency (Cronbach's « of 0.92). Anxiety was measured with the Generalized Anxiety Disorder Scale (GAD-7) [37], which consists of 7 items that are scored on a 4- point scale ranging from 1 to 4. The validity and reliability of the simplified Chinese version of the GAD-7 have been tested [38]. In the present study, the Cronbach's « coefficient for this scale was 0.96. Rumination was assessed using the abbreviated version of the Ruminative Responses Scale [57], which was translated into Chi- nese by Han and colleagues [39]. This is a 5-item self-report scale, and the items are scored on a 4-point scale ranging from 1 to 4. In the present study, the Cronbach's « coefficient for this scale was 0.94. Perceived flood severity was assessed using three items: “How severe do you think the overall impact of the flood is?”, “How se- vere do you think the impact of the flood on local life is?”, and “How severe do you think the impact of the flood on the local economy is?” For each item, participants responded with a score of 1-10 (1 = not severe at all, 10 = extremely severe). A general score for perceived flood severity was computed by summing these item scores. In the present study, the scale exhibited good internal consis- tency (Cronbach's « of 0.88). The impact of the floods and the COVID-19 pandemic was assessed using eight items. These items evaluated how the floods and the COVID-19 pandemic influenced aspects of everyday life, including work, life, study, entertainment, social connection, exercise, diet and sleep. For each item, participants responded with a score of 1-10 (1 = no influence at all, 10 = strong influence). In the pre- sent study, the scale exhibited good internal consistency (Cronbach's « of 0.90). Negative emotion during the floods was assessed using four items: “The flood worried me”, “The flood terrified me”, “I did not ex- pect the flood to be so severe”, and “I did not expect the flood to be so destructive”. For each item, participants responded with a score of 1-6 (1 = totally disagree, 6 = totally agree). In the present study, the scale exhibited good internal consistency (Cronbach's a of 0.83). The abbreviated version of the Perceived Risk of COVID-19 Pandemic Scale (PRCPS; [61]) was used to measure risk perception of the COVID-19 pandemic. The abbreviated scale consists of 3 items that evaluate the emotional feeling, cognitive judgment and men- tal representation of risk perception. Participants responded using a six-point Likert scale ranging from 1 to 6. In the present study, the scale exhibited good internal consistency (Cronbach's « of 0.84). Acceptance of change was assessed using the 5-item Chinese Acceptance of Change Scale (CACS; [62]). A sample item is “When change happens, I know it can be both positive and negative.” These items were scored on a 5-point scale ranging from 1 to 5. In the present study, the scale exhibited good internal consistency (Cronbach's « of 0.94). Flood coping efficacy was assessed using four devised items. The positive dimension included 2 items: “I think humans are able to fight against floods” and “I think humans can cope with floods efficiently”. The negative dimension included 2 items, “I think humans are vulnerable when faced with floods” and “I think there are limited things humans can do to cope with floods”. These items were scored on a 4-point scale ranging from 1 to 4. The Cronbach's a of the positive dimension was 0.70, and the Cronbach's « of the nega- tive dimension was 0.61. Trust was assessed using nine devised items, which assessed how participants trusted other people and organizations during the floods, including their family, friends, neighbors, colleagues, volunteers, media, troops, government and nongovernmental organiza- tions. For each item, participants responded with a score of 1-10. In the present study, the scale exhibited good internal consistency (Cronbach's « of 0.92).",
    "Change in psychological distance was assessed using two items: “Before the flood, what did you think of the psychological dis- tance between people?” and “After the flood and during this pandemic, what did you think of the psychological distance between peo- ple?” For each item, participants responded with a score of 1-10 (1 = very far, 10 = very close. A general score for change in psy- chological distance was computed by subtracting the first item score from the second item score. A positive value for the change score indicates a closer psychological distance after the floods and the COVID-19 pandemic. Data analysis in the current study comprised two steps. First, we used LPA, a person-centered approach, to identify the potential profiles of psychological outcomes and acceptance of change following the floods and recurrence of the COVID-19 pandemic in Henan. Analyses were conducted using Mplus version 8.0 [40]. The optimal number of profiles was chosen based on a series of statis- tical indicators, including Akaike information criteria (AIC), Bayesian information criteria (BIC), sample-size adjusted BIC (aBIC), Lo- Mendell-Rubin likelihood ratio test (LMR) and entropy. Lower scores on AIC, BIC and aBIC suggest better model fit, while a signifi- cant p value on LMR indicates that the k profile model is superior to the k — 1 profile model. Entropy ranges from 0 to 1, with a higher value indicating a more accurate classification. Second, after obtaining the best-fitting model solution, we conducted multinomial logistic regression using IBM SPSS Statistics 26.0 to examine the effect of potential risk and protective factors on profile membership. The coefficients of logistic regression were presented as odds ratios and 95% confidence intervals. The statistical indicators for the LPA models are presented in Table 2. This analysis began with a one-profile model, and additional profiles were added until the optimal number of profiles was determined. The AIC, BIC and aBIC values decreased sharply as the num- ber of profiles was increased to four, but these statistical indicators decreased mildly when the fifth profile was added. The values of entropy for the four-profile and five-profile models were among the highest. In terms of LMR, the p value was significant up to four profiles, and the five-profile model included one profile with low prevalence (<5%), indicating that a solution with four profiles was preferable. Based on these fit indices and the interpretability of the profiles, the four-profile model was selected as the optimal model. The profiles with the standardized means of indicators are illustrated in Fig. 1. Profile 1 was characterized by high levels of psy- chological distress as well as high levels of acceptance of change and was labeled the “high distress/high acceptance” group (5.1%). Note: AIC = Akaike information criteria, BIC = Bayesian information criteria; aBIC = sample-size adjusted BIC; LMR = Lo-Mendell-Rubin likelihood ratio test. Profile 2 was characterized by moderate levels of psychological distress and moderate acceptance of change and was labeled the “moderate distress/moderate acceptance” group (20.1%). Profile 3 was characterized by mild psychological distress coupled with mild levels of acceptance of change and was labeled the “mild distress/mild acceptance” group (45.5%). Finally, profile 4 was charac- terized by low psychological distress and moderate acceptance of change and was labeled the “resilience” group (29.3%). The para- meter estimates and means of indicators for each profile are presented in Table 3. Table 4 displays the results of multinomial logistic regression and the results of group comparisons. Compared to the resilience group, people who had experienced a more serious impact of the floods and the COVID-19 pandemic were more likely to belong to a group with worse mental health outcomes, but perceived flood severity was not a predictor. Individuals who had experienced stronger negative emotions during the floods were more likely to belong to the “high distress/high acceptance” group (Profile 1). Overall, then, flood coping efficacy, trust and change in psychological distance were protective factors. Individuals from a better- adapted group were also more likely to have a higher level of flood coping efficacy, trust and change in psychological distance. Age and sex showed no predictive effect for any profile. The present study is the first to examine the profiles of psychological outcomes and acceptance of change among Zhengzhou resi- dents who experienced both the floods and the COVID-19 pandemic in 2021 via a person-centered approach. Our results indicate that the current sample can be characterized by four combinations of psychological outcomes and acceptance of change: high distress/ high acceptance (5.1%), moderate distress/moderate acceptance (20.1%), mild distress/mild acceptance (45.5%), and resilience (29.3%). Specifically, we have found that the same level of acceptance of change can be combined with different levels of psychologi- cal distress. We have also identified certain protective factors that can mitigate the risk of distress, especially at the interpersonal level. These results have implications for both disaster risk reduction management and post-disaster mental health services.",
    "Note: Means in the same row with different superscript letters are significantly different at the p < 0.05 level. PTSS = posttraumatic stress symptoms. Profile 1 = High distress/High acceptance; Profile 2 = Moderate distress/Moderate acceptance; Profile 3 = Mild distress/Mild acceptance; Profile 4 = Resilience. ‘p < 0.001. Note: OR = odds ratio. CI = confidence interval. Profile 1 = High distress/High acceptance; Profile 2 = Moderate distress/Moderate acceptance; Profile 3 = Mild distress/Mild acceptance; Profile 4 = Resilience. In the current study, 29.3% of the sample fell into the “resilience” group, and 45.5% fell into the “mild distress/mild acceptance” group, indicating that while a moderate proportion of individuals remained well adjusted in the aftermath of the floods and recurrent COVID-19 pandemic, approximately half of the individuals experienced mild disruptions. A small proportion of participants (5.1%) exhibited severe psychological distress, while 45.5% exhibited moderate distress. This relatively high rate of psychological distress may be due to the timing of sample selection, which can affect the prevalence rates of post-disaster distress [29]. Given that our study was conducted one month after the flooding and during the COVID-19 pandemic, the focal individuals may still have been experienc- ing variability in their emotional states, giving rise to lower rates of adaptation. Moreover, a short interval between two traumatic events precludes a safe and thorough recovery and produces a sense of helplessness [41,42]. Thus, the cumulative effect of the floods and the COVID-19 pandemic may have heightened the rates of post-disaster maladaptation in the current study. Our results also revealed a complex relationship between psychological outcomes and acceptance of change across the four latent profiles. Specifically, in the high distress/high acceptance group, psychological distress and acceptance of change were found to be concurrently high. Hussain and Bhushan have reported similar results, where acceptance mediates the relationship between trau- matic experiences and PTSS [26]. Many researchers have suggested that a distressing traumatic experience is essential in eliciting a cognitive appraisal, which may facilitate post-traumatic growth, a concept that is consistently associated with acceptance [43-45]. Indeed, when individuals face unprecedented distressful experiences, such as the focal floods and the COVID-19 pandemic, they may adjust their values and worldviews to become accustomed to new challenges, exhibiting a higher level of acceptance of change. Ac- ceptance is a valuable post-disaster outcome in the long run, but it may not guarantee short-term psychological well-being following disasters. In addition, the moderate distress/moderate acceptance group and the resilience group exhibited similar levels of accep- tance of change with disparate levels of psychological distress. These results might indicate that psychological outcomes are also af- fected by risk and protective factors other than acceptance of change. Moreover, the current study identified both the risk and protective factors associated with psychological outcomes and acceptance of change. In terms of the risk factors, our results show that the additive impact of the floods and the COVID-19 pandemic exhibited a stronger predictive effect on psychological outcomes than the impact of the floods alone. Similar to the results in a prior study indicat- ing that trauma survivors are more vulnerable to psychological distress due to the COVID-19 pandemic than individuals without such experiences [46], our findings support the sensitization model's relevance in the context of the COVID-19 pandemic, underscoring the imperative to offer psychological assistance after recurrent trauma exposure. We have also identified negative emotions during the floods as a risk factor. Individuals who showed more negative emotional responses during the floods were more likely to suffer post- disaster psychological distress. Thus, we suggest that greater attention be given to the mental health status of these vulnerable indi- viduals. In line with previous studies [32—34,36], flood coping efficacy, trust and a closer change in psychological distance served as pro- tective factors in our study. Individuals who have higher coping efficacy and trust and experience a closer psychological distance change are more likely to belong to a better adapted group. Promoting flood warnings and property protection measures, such as ele- vating furniture, is an effective way to facilitate preparedness and coping efficacy in flood-prone areas [47]. Furthermore, trust can be enhanced by media publicity regarding the contributions of governments and institutions, such as material support. Prosocial behav- iors, such as donating and volunteering, could also be encouraged, since cooperative cascades can circulate from person to person [48], facilitating both interpersonal trust and closer psychological distance following disasters. Moreover, after a flood, most people fulfill their psychological needs with the help of people close to them [49]. Taking the social restrictions of the COVID-19 pandemic into consideration, when outdoor social activities are limited, it is important to reinforce social connections (including virtual con- nectedness) inside communities and families.",
    "The methodological limitations of the present study need to be noted. First, we could not draw causal conclusions due to the study's cross-sectional design. There may also be confounding factors that have biased our results. Future studies adopting a longitu- dinal design to identify trajectories may thus provide more compelling evidence on the cumulative effect of natural disasters and pub- lic health crises, such as the COVID-19 pandemic. Second, we focused only on a specific group of people who were exposed to both the focal floods and the subsequent pandemic recurrence; we did not include control groups, such as those who were exposed to only one stressor or to neither. The psychological impact of the COVID-19 pandemic demonstrated in cross-sectional studies that lack a perti- nent control group should be interpreted with caution [50]. Future research should therefore identify various development patterns of psychological symptoms among groups with disparate combinations of stressors. Third, the sample in the present study may not be representative enough for the general population. A high proportion of participants were female (81%), while people with limited so- cial media access were less likely to participate in our study because our data were collected using online social media platforms. Hence, we suggest that future studies consider age groups and gender groups before sampling with the help of local communities. Moreover, given the sudden nature of natural disasters, we adopted retrospective self-report measures. However, these approaches may confound predictors due to recall bias, which is related to participants' current mental health condition and may underestimate rates of resilience [29,51]. Accordingly, we suggest that future studies adopt a longitudinal design to track any changes in psychologi- Nevertheless, despite these limitations, our study contributes to the literature by being the first to determine the profiles of psy- chological outcomes and acceptance of change after a flood amid the COVID-19 pandemic. Our findings have both theoretical and practical implications. First, we expand the understanding of the relationships among multiple stressors and mental health outcomes. Although recently researchers have suggested that additional attention be given to the exacerbating effect of the COVID-19 pandemic on pre-existing psychopathology symptoms [52], relatively little empirical research has been conducted on this. The current study, however, demonstrates the utility of the sensitization model in the context of the COVID-19 pandemic. Second, we focus on a vulnera- ble group that has experienced two mass stressors during a short period and observe heterogeneous psychological responses. The ma- jority of these individuals exhibited at least mild disruptions, while a specific, small proportion of the sample experienced severe psy- chological distress. This result underscores the importance of mental health care after recurrent trauma exposure. Moreover, the iden- tified protective factors point to the proper direction for disaster management and psychopathology prevention. The floods and the COVID-19 pandemic led to increased social distancing and daily supply limitations. Previous research has proposed that a govern- ment can provide immediate help following disasters, such as preventing agglomerations, handling hygiene issues and distributing food [53]. The current study also offers practical implications from a psychological perspective. For example, the lockdown policies during the COVID-19 pandemic have restricted social contact and pose challenges to people's mental health [54]. We have found that a closer psychological distance can alleviate psychological distress. Our identified protective factors could also contribute to disaster reduction, especially in terms of psychological distress. Future disaster management would therefore benefit from increasing resi- dents' trust and confidence in their government's disaster response. Increasing access to social support networks, such as enhancing social connectedness and interindividual trust, may be important for facilitating resilience among vulnerable populations. The current study has demonstrated heterogeneous psychological responses among a sample cumulatively exposed to floods and the COVID-19 pandemic. Cumulative exposure to disasters may heighten the risk of psychological distress. Additionally, the same level of acceptance of change could be combined with different levels of psychological distress. We have also identified specific risk and protective factors. The additive impact of the floods and COVID-19 exhibit a stronger predictive effect on psychological outcomes than the impact of the floods alone. In our study, higher levels of flood coping efficacy and trust and a closer psychological distance served as protective factors. Accordingly, these findings open paths for future disaster management research from a psychological perspective.",
    "This work was supported by the Research Project of Shanghai Science and Technology Commission (No. 20DZ2260300), the Na- tional Social Science Foundation of China (No. 22CSH092), the Shanghai Pujiang Program of China (No. 12PJ037), the Shanghai Morning Star Project Sailing Program (22YF1411600), the Program of Philosophy and Social Sciences in Henan Province (No. 2021B- JY043), the Fundamental Research Funds for the Central Universities (2022 ECNU-XWK-ZX04). The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."
]