[
    "Citation: Qiu, P.; Zhou, Z.; Kim, D.-J. A New Path of Sustainable Development in Traditional Agricultural Areas from the Perspective of Open Innovation—A Coupling and Coordination Study on the Agricultural Industry and the Tourism Industry. J. Open Innov. Technol. Mark. Complex. 2021, 7, 16. https://doi.org/10.3390/joitmc7010016 Abstract: Background/Objective: The Chinese government is actively developing the rural economy and promoting the poverty alleviation campaign. The economic development of the traditional agricultural areas is essential to people’s basic livelihood and social stability. The tourism industry has been proven to be an effective approach to promote the regional economy. It has become a hot issue as to how to develop the tourism industry in rural areas. Methods/Statistical Analysis: Based on a corresponding index system, a coupling coordination model was established to explore the coupling and coordination development of the agricultural industry and the tourism industry in Henan province, a traditional agricultural area in China. Findings: The result revealed that although the coupling degree between the agricultural and the tourism industry from the year of 2009 to 2018 is relatively stable, the coordination degree shows a continuous rising trend from 0.278 to 0.921. This indicated that the agricultural industry and the tourism industry in Henan province continues to interact with and inﬂuence each other, and the comprehensive development level and the coordination degree of the two industries have been constantly improved. Implications: From the result, it can be seen that the integration development of the agricultural industry and the tourism industry could be a new path to develop the economy of rural areas. From the perspective of sustainable development, suggestions are proposed to optimize the agricultural industrial structure, extend tourism industry chain and construct support policy to develop a sustainable mode of the agricultural industry and the tourism industry. Copyright: © 2021 by the authors. Li- censee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and con- ditions of the Creative Commons At- tribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). With the progress of China’s poverty alleviation campaign and industrial upgrading and transformation, areas traditionally dominated by agriculture are actively exploring new development paths. Among them, the integration of agriculture and tourism has become an innovative attempt. Within the integration of the agricultural and the tourism industry, a technological and economic connection with their inputs and outputs exists and serves as the link [1]. In China, the agricultural industry is the foundation of the national economy and is closely related to the stability of the society. The development of the agricultural industry can drive the economic prosperity of rural areas and promote the implementation of rural revitalization. The tourism industry, based on tourism resources, provide comprehensive services of transport, travel, accommodation, food, shopping, and entertainment. The tourism industry, relevant to other industries, is a strong driving force for economic development. The agricultural industry gives the support to the development of tourism by providing agricultural resources and products and consolidates the base of tourism resources [2]. The tourism industry inﬂuences the agricultural industry by expanding its operation space and changing its operation modes, which gave birth to a series of new tourism programs. This provided heterogeneous tourism resources and ﬁnally extended the tourism industry chain. Also, the integration of the agricultural industry and the tourism industry has stimulated the development of agriculture by increasing tourism consumption, restructuring the agricultural industry chain, and expanding the agricultural industry from the planting and breeding stage to other parts in the process of production, and changed the slow development of traditional agriculture, which is affected by the single agricultural management model [3]. The integration of two industries cannot only preserve the basic status of agriculture but also expand its value. Various new functions have been generated and the traditional boundary of the agricultural industry has been broken. Furthermore, its quality and efﬁciency are thus improved [4]. development of the American machinery industry [5]. In 1978, Negrouponte found that the fastest growing industry and the most innovative zone is the intersection of three industries: computer, communication, and broadcasting. The development of computer and network technology strengthened the connection among various media, thus forming “digital convergence” and eventually the multimedia industry [6]. Nie and Li (2003) claimed that there are four forms of industrial integration: permeable integration, extended integration, internal reorganization, and alternative integration. Penetrative integration refers to the penetration of high and new technologies into other industries and the integration of new industries; extended integration refers to the integration between different industries through complementation or extension; internal reorganization is the integration within an organization, which results in new products or services. Alternative integration is the way a new industry replaces an old industry [7]. In recent years, scholars in China have studied the integration of agriculture and tourism from diverse perspectives. Yang and Jiang (2017) explored the integration path of the agriculture industry and tourism industry from the perspective of creative agriculture and constructed the model of integrated development of creative agriculture and tourism [8]. Based on the perspective of ecological economy, Wang (2018) explored the driving force of agriculture and tourism and put forward the deep integration strategy of agriculture and tourism [9]. Wang (2018) further combined the theory of industrial integration with practice, analyzed the development process of rural tourism, and explored the construction of three types of rural tourism development models: rural scenery, country life, and agricultural science and technology [10].",
    "Scholars also conducted studies on the dynamic study of the coupling and coor- dinative development of the agricultural and tourism industry from other theoretical perspectives. These studies mainly focused on the possibility, driving factors, and functions of the coupling development. Cai, Leung, and Mak (2005) examined the relationship between the tourism sector and the non-tourism sector and found that the correlation between agriculture and tourism is relatively high and the two industries have a possibility of coordination development [11]. Porter (2011) systematically elaborated the coupling mechanism between tourism and agriculture [12]. Häussler et al. (2012) noted that the main driving force for the coupling development of tourism and agriculture is the comple- mentarity of resource advantages [13]. Zhou et al. (2020) explored the degree of coupling and coordination between the cultural industry and the tourism industry in ethnic minority areas and provided suggestions for the culture and tourism industry stakeholders in other areas of the world from the perspective of open innovation [14]. Kong et al. (2013) explored the social, economic, and comprehensive beneﬁts of leisure tourism agriculture through the data envelope analysis [15]. Chen (2017) proposed improvement measures to promote benign coupling through empirical research on the development status of agriculture and tourism in the Zhoushan region of China [16]. Rural areas have abundant agricultural resources, which may have both economic and cultural value. The tourism industry has very strong marketing power, which may help solve the problem of insufﬁcient market- ing capability of the peasants. Based on the relevant theory and the real situation of the two industries, this paper studies the situation of coupling coordination development of the agricultural industry and the tourism industry and believes that this might be a new path to develop the rural economy; it also proposes some suggestions for the integrated development of the agricultural industry and the tourism industry. Researchers in different countries have done systematic research on the driving factors of industrial integration. Porter (1985) noted that the main reason for promoting industry integration is technological innovation or technology integration [17]. Yofﬁe (1997) and Zhi (2001) claimed that the main factors promoting industrial integration are deregulated policies, innovative technologies, and management [18,19]. Hacklin et al. (2005) noted that the main driving force of industry integration is technological innovation and diffusion, demand evolution, and business model innovation [20]. Zhang (2001) pointed out that the main driving force for industrial integration is the organic combination of management, technological innovation, and deregulation [21]. Yu (2006) wrote that the main motivation of industrial integration is the interaction between technological innovation, deregulation, cross-industry merger and acquisition, and strategic alliance [22]. Industrial integration is driven by the following factors: deregulation by the govern- ment, technological innovation and promotion, change in market demand, and business model innovation. Firstly, loose regulation can effectively stimulate business model inno- vation and expand enterprise technology, thus reducing the barriers to access of the market. Moreover, in the process of technological innovation, there will be information overﬂow in the industry, and other industries can promote technology integration and gradually narrow the technological differences among industrial sectors by taking advantage of this information overﬂow. Additionally, the diversiﬁcation of market demand prompts the continuous transformation and upgrading of enterprises to meet consumers’ various needs through a single transaction. This demand promotes the development of industrial integration. Fourthly, the integration between industries is boosted by business model innovation. Hacklin (2008) pointed out that in the newly generated market, innovative business models can make existing technologies more effectively used and achieve break- through in development [23]. Therefore, the interaction between technology and business model results in industrial integration, and the transformation of technological input into economic output, which is the inevitable result of business model innovation. In 1987, the World Commission on Environment and Development formally put forward the concept of “sustainable development” in its report of “Our Common Future”, pointing out that sustainable development is to meet the needs of contemporary people without compromising the ability of future generations to meet their own development needs [24]. Scholars have conducted systematic research on sustainable development. Caldwell (1984) claimed that the implementation of sustainable development will be inﬂuenced by ecological, economic, social, political, and other factors [25]. Redclift (1987) argued from the perspective of politics and economy that sustainable development should seek a balance between ecological protection and economic development [26]. From the perspective of resource management, Reptto (1986) regarded sustainable development as a development strategy. It conducts comprehensive management of natural, human, and material resources to increase the long-term wealth and welfare of the society [27]. Ye (2001) pointed out that sustainable development is a process of coordinated development of society, economy, population, resources, and environment [28]. Growth differs from development, and sustainable development does not equal the balance of supply and demand. Bao (2001) pointed out that sustainable development should achieve various goals, such as sustainable economic development, comprehensive social progress, improvement of life quality, population quality, and ecological resources [29]. Martin and Kathryn (2009) discusses the European multifunctional model of agriculture by examining the speciﬁc case of the Rural Environmental Protection Scheme in Ireland and suggests that the need to consider how policy narratives and instruments prominent at the macro-global level of governance enter into life-worlds and cultures [30]. Dubois, Alexandre, and Carson, Dean (2020) explore the geohistorical development trajectory of the region by using notions of sustainable agriculture and multifunctional rural transitions, and propose an extensive review of the historical, agricultural, socioeconomic, and institutional contexts of regional Australia before discussing the farming future(s) of the Mid North [31].",
    "Sustainable development emphasizes the importance of development, which provides the necessary material basis for improving people’s quality of life and solving various social problems. Meanwhile, development should fully respect nature and the laws of nature to achieve the dual goals of social development and ecological protection. The concept of “people-oriented” development is to seek and realize people’s freedom and all-round development, so that people can obtain rich material wealth and spiritual enjoyment, which is the goal of sustainable development. There are inherent contradictions and conﬂicts between society, economy, and environment. It is the essential requirement of sustainable development to integrate them as a whole, cooperate with each other, and achieve comprehensive and coordinated development. Henan, located in central China, is a typical agricultural province and an important grain-producing area, which has a population of approximately 109.52 million within the area of 16.7 thousand km2. Although it only accounts for 1.74% of the national land area, it feeds 7.5% of the national population and has become an important agricultural produc- tion base in the country, making positive contributions to the balance between the supply and demand of agricultural products [32]. Henan supplies one-tenth of China’s grain and one-fourth of its wheat, playing an extremely important role in the country’s grain supply. Agricultural development plays an important role in its economic development. However, in agricultural development there are unavoidable problems due to the large population, the insufﬁcient resources, the unreasonable structure of the agricultural industry, and the low production level. Henan is also an important tourism province in China, with a long history, profound culture, and rich tourism resources. Henan has ﬁve world cultural heritage projects, such as the Longmen Grottoes, Yin Ruins, and Shaolin Temple. It is the birthplace of China’s agro-farming culture, and Shaolin kung fu and Taijiquan also originate from this area. However, Henan’s tourism industry started in the 1960s. As early as 1960, the Longmen Grottoes began to receive foreign tourists. In that stage, although the tourism industry was initially formed, operating activities of the scenic spots resembled foreign affairs reception due to the lack of tourism operation and management awareness. In the years of 2005 and 2006, Henan consecutively held a conference respectively on the development of tourism industry and the development of eco-tourism, which comprehensively discussed and solved the development strategy and key issues of the tourism industry in Henan province. In 2008, Henan put forward the Tourism-led Development strategy, which accelerated the leap from a province with rich tourism resources to one driven by a powerful tourism economy, and caused the tourism development to step into a new stage [33]. In 2016, the 13th Five-Year Plan of Henan Province proposed to build itself into an international tourist city, an internationally renowned tourist destination, and an important national tourism center [34]. These policies and measures listed above have greatly promoted the development of tourism in Henan. At present, Henan has established 7 country-level demonstration counties of rural tourism, 7 model villages of rural tourism, 16 country-level demonstration pilot projects of rural tourism, 400 top-level agritainment events, and 40 model households of rural tourism. According to the data measured by Henan Tourism Planning Institute, more than 1000 poor villages within Henan province have the congenital condition for the development of rural tourism [35]. Up to now, the tourist reception and the tourism income of Henan province have achieved substantial growth, and the development of tourism is fast and furious. Henan is selected as the study object because it is a traditional agricultural area with rich tourism resources. Henan plays a big role in grain production in China. Meanwhile, it has given priority to the development of the tourism industry. Therefore, the exploration of the coordinated development of two industries in Henan helps to clarify the coordination mechanism for both theoretical and practical usage. Based on the previous research theories and the principle of index selection, the comprehensive index system of agriculture and tourism industry in Henan province was established (Table 1). The selection criteria of the index system in this study are mainly based on the dynamic mechanism of the integrated development of agriculture and tourism, which not only reﬂects the industrial domain and development characteristics, but also meets the research needs. The indices mainly include the resource endowment, operation scale, operation beneﬁt, and resource utilization ratio of two industries [36,37].",
    "Note: 1. “+” in the table shows the positive type of indicator. The higher in number suggests the better progress in one aspect. 2. The measurement unit of dollar is adopted according to the exchange rate of 7.0173 on 1 December 2019. Agricultural system contains nine indicators: the output of primary industry; the output of agriculture, forestry, and ﬁshery; and the grain output reﬂect its economic output; among them, the total output of the primary industry consists of the sub-output value of agriculture, forestry, husbandry, ﬁshery, and its service industry; the output of agriculture, forestry, animal husbandry, and ﬁshery refers to the total amount of all products of agriculture, forestry, animal husbandry, and ﬁshery expressed in currency, which reﬂects the total scale and total achievements of agricultural production in a certain period; the grain output refers to the total amount of grain produced in a calendar year by agricultural producers and traders; the number of people employed in primary industry indicates the support of employment to agriculture; indices of crop planting area, effective irrigation area of cultivated land, and total power of agricultural machinery show the input of agricultural modernization and the rate of resources utilization; net income per capita and consumption level of rural residents indicates beneﬁts of agricultural operation, acting as a supplement to its economic output. Whereas the tourism system includes eight indicators: the number of domestic tourists, the revenue of domestic tourism, the number of inbound tourists, and the income of international tourism reﬂect tourism resources endowment and the effect of tourism attraction; the revenue of tourist enterprises and the quantity of travel agencies can suggest the reception and service ability of tourism industry; the number of national 4 A-level scenic spots and star-rated hotel indicates the quality and scale of its development. In this paper, the data of 2009 to 2018 are collected from the China Statistical Yearbook, the China Rural Statistical Yearbook, the Henan Statistical Yearbook, the Statistics Bulletin of the National Economy and Social Development of Henan province, and the websites of Henan Agriculture or Tourism Bureau. The measurement units of the original data and their orders of magnitude vary greatly. In order to avoid errors in data analysis, the dimensionless processing of the data of each indicator is conducted before analysis, and the extremization method is adopted here (only positive indicators). The calculation process can be seen in Formula (1): In this formula, Sij is the standardized value of the index j in the year of i, and xij is the original value (i = 1, 2, ..., n. j = 1, 2, ..., n). Additionally, Mij refers to Max {xij}, the maximum value of index j, whereas mij refers to min {xij}, the minimum value of index j. 0.01 is added to avoid the occurrence of 0, which could lead to a failure in calculation. Entropy is a measure of uncertainty. The more information included in an index indicates less uncertainty and is shown with the lower value of entropy; less informa- tion included indicates greater uncertainty and is shown with a higher value of entropy. Therefore, the information carried by the entropy value is used to calculate the weight of each index. Combined with the variation degree of each index, the entropy method is used to calculate the weight of each index to provide the basis for the comprehensive evaluation of multiple indices. In order to objectively give a weight to an index, the entropy method was employed to calculate the weight. As the information is carried by the entropy value, the tool of information entropy is used to calculate the weight of each index in combination with the variation degree of each index to provide the basis for the calculation of comprehensive development indices. According to the entropy method, the value of Pij refers to the proportion of the index of j in the year of i in total indexes, which can be ﬁrstly calculated in Formula (2). Then, Ej, the entropy value of the index j, will be calculated in the Formula (3) and its differentiation coefﬁcient can be worked out by Formula (4). Finally, Wj referring to the weight of each index, can be obtained by using Formula (5). The weight of each index obtained by using the entropy method is shown in Table 1.",
    "After the standardized processing of data, the comprehensive development indices of two systems will be worked out by summing the product of index weight. In Formula (6), Ui represents the development level of the tourism industry or agriculture industry in the year of i. The value of Ui is proportional to the industrial development level. A big value suggests a higher development level of the industry. Coupling originally refers to the process of energy propagating from one medium to the other in physics. Now it is commonly used to reveal the degree of mutual interaction and inﬂuence between two or more systems. The coupling effect between systems will transform the disordered state to the ordered state, achieving the integration between systems. Coupling degree can be used to represent the degree of coordination between systems. A higher degree of coupling coordination suggests different systems mutually inﬂuence and penetrate at the deeper level. In the model of coupling and coordination between agriculture and tourism, C in Formula (7) represents the coupling degree between tourism industry and agriculture, where U1 is the agricultural development index and U2 the tourism development index. Moreover, D in Formula (8) refers to the coupling coordinative degree, whereas T in Formula (9) stands for comprehensive development index, where α and β are undetermined coefﬁcients. In this study, both are assigned the value of 0.5. In order to reﬂect the coupling degree and coupling coordinative degree between agriculture and tourism, the coupling stage and the coupling coordination level are divided into 6 stages (Table 2) and 10 categories (Table 3) by referring to the existing research on the division of coupling stage and coupling coordination level [38,39]. It can be seen from Table 4 and Figure 1 that the comprehensive development trend of agriculture industry and tourism industry in Henan from 2009 to 2018 is in a state of cross-rising. According to the comprehensive development index of agriculture industry, its development has been on the rise. In 2009, agricultural development was at the lowest level with the value of 0.1025, while in 2018, it reached to the highest with the value of 0.786. It is worth noting that tourism shows a continuous rising trend under the inﬂuence of various factors, with its value rising from 0.0579 in 2009 to 0.914 in 2018. Policies and strategies put forward by government play a crucial part in this process. In 2008, Henan put forward the provincial strategy of tourism-led development, which laid a solid foundation for the sustainable and rapid development of tourism. After the year of 2016, the comprehensive development value of tourism is greater than that of agriculture, which has close connection to the 13th Five-Year Plan of Henan Province issued in 2016. The plan provided the guidance for the development of tourism, with emphasis on the theme of “Our Hometown in Henan”, to build the famous international tourist cities and internationally renowned tourist destinations in China. It can also be seen from Figure 2 that the agricultural development in Henan has not been optimistic since 2015. In 2016, the comprehensive index of tourism surpassed that of agriculture. According to the Statistical Bulletin of Henan Province on National Economic and Social Development, the change rate of total agricultural output growth in 2016 was 1.82%, 1.24% in 2017, and in 2018 it reduced to −1.12%. It shows that the agriculture development in Henan was gradually declining from the year of 2016. At the same time, tourism industry in Henan has been maintaining a good development trend. In 2018, the added value of the tertiary industry with tourism as the main body increased by 9.2%, amounting to $30.96 billion. The total number of tourists and tourism revenue showed a trend of annual growth in the past ﬁve years, playing an important role in economic development [40]. Coupling indicates the appearance of mutual inﬂuence among different systems and coordination suggests a benign association within the factors of a system, which reﬂects that elements have a cooperative relationship with the virtuous cycle in a system [41]. Cou- pling coordination refers to coordinated development of mutual inﬂuence and interaction between different systems, the degree of which acts as a measurement of the coordinated development between different systems.",
    "From Table 4 and Figure 2, it can be seen that the coupling degree (the value of C) between agriculture and tourism from the year of 2009 to 2018 is relatively stable, staying above 0.9 and at a high level of coupling. Especially in 2017, the coupling degree of two industries reaches 1. Therefore, it can be inferred that two industries are closely correlated and mutually inﬂuenced in the process of development. The results agree with the ﬁndings of Mao (2020) and Zhang (2017) on the strong correlation between the agricultural industry and the tourism industry [42,43]. Meanwhile, the coupling coordinative degree between two industries shows a con- tinuous rising trend from the year of 2009 to 2018. According to the criteria of coupling coordination level, in 2009 the D value of 0.278 shows that they stay at the stage of low-level coupling coordination. From 2010 to 2013, its value rose from 0.4 to 0.7, indicating the medium-level coordination. From 2014 to 2018, it came to the high-level coordination with the value between 0.7 and 1. The loose policy environment and scientiﬁc guidance provided by the government promote the coordinated development of agriculture and tourism in Henan province. The study further suggests the coordinated development between the two industries in Henan is driven by giving play to the leading role of tourism. The ﬁnding is in line with that of Jiang (2017), which ﬁnds that the tourism industry has a very strong driving effect on other industries [44]. In 2013, in order to give impetus to constructing of the Central Plains Economic Zone and the in-depth integrated development of agriculture and tourism, Henan reintegrated rural tourism resources and established the Rural Tourism network, making full use of the development advantages of the Internet to promote the integration of agriculture and tourism industry. Driven by relevant policies, every city or region gives play to their unique advantages, changes its agricultural development mode, innovates tourism products, creates high-quality tourism goods of characteristics, and develops the regional economy with the help of agricultural tourism. Document No.1 issued by the Central Committee of Communist Party 2017 points out that it is necessary to give full play to the unique advantages of rural material and non-material resources, and the development models of “tourism+” and “ecology+” should be used to promote the integration of agriculture and other industries [45]. The 13th Five-Year Plan of the tourism industry development plan of Henan Province clearly points out that the industrial integration is promoted by the construction of tourism projects and the extending of the tourism industry chain, focusing on building internationally renowned tourist destination, and attaining the goal of the tourist number reaching 880 million and its revenue exceeding $125.48 billion. In June of 2018, the Ministry of Agriculture and Rural Affairs issued the notice on promoting the integrated development of primary, secondary, and tertiary industries in rural areas, which pushed the integrated development of agriculture and The study shows that the two industries inﬂuence mutually, and the tourism industry takes the lead in the development. In view of the good foundation for the coordinated de- velopment of the agricultural industry and the tourism industry, the deep integration can be viewed from the perspective of open innovation to ﬁnd a new path to promote the healthy and sustainable development of two industries. The concept of open innovation was origi- nally proposed by Chesbrough in 2003. Nowadays, open innovation is developed rapidly not only in high-tech industry but also in other industries, for it can facilitate technological innovation of enterprises, market expansion, sales revenue increase, and research and development of new products. The modern economy can be modeled as Entrepreneurial Cyclical Dynamics of Open Innovation with three sub-economies, such as market open innovation by small- and medium-sized enterprises (SMEs) and start-ups, closed open innovation by big business, and social open innovation [46]. Yun (2017) illustrated how open innovation utilizes the developing circle of business models to establish new ones that deﬁne a unique link between technology and markets, focusing on how to develop and maintain successful business models [47]. Small- and medium-sized enterprises pursue open innovation primarily for market-related motives such as meeting customer demands or keeping up with competitors [48]. The success of social enterprises depends on the extent to which they strive to move towards open innovation. Adopting open innovation strategies seems to be a fruitful pathway for social enterprises to progress and grow in their operations [49]. Chiaroni et al. found that the journey from closed to open innova- tion involves four main dimensions of the ﬁrm’s organization, i.e., inter-organizational networks, organizational structures, evaluation processes, and knowledge management systems, along which change could be managed and stimulated [50]. Yun, Avvari et al. (2014) proposed three open innovation measures to compare its levels between nations and ﬁrms, and further analyze its effect on ﬁrm performance [51]. Gambardella and Panico (2014) concluded that the potential of open innovation is underexploited. In particular, owners may not release enough power to make decisions on the use of their assets [52]. Based on econometric analysis of data from a U.K. innovation survey, Laursen and Salter (2014) found a concave relationship between ﬁrms’ breadth of external search and formal collaboration for innovation and the strength of the ﬁrms’ appropriability strategies [53]. Therefore, only if corporate management, business operations, market-targeted strategies, and appropriate business models are fully taken into consideration, can the potential of open innovation in the two industries be fully exploited and thus ensure the agricultural industry and the tourism industry develop healthily and sustainably.",
    "In this study, the correlation and interacting mechanism between the agricultural industry and the tourism industry are systematically summarized. On this basis, the coupling model and comprehensive development index system of the agricultural industry and the tourism industry are constructed. Henan province is taken as the research object, the coupling coordinative model is used to measure their comprehensive development level and the coupling coordinative degree. According to the results, the two systems of the agricultural industry and the tourism industry in Henan province have obvious characteristics of coupling development and the elements in the two systems mutually interact and inﬂuence and develop in a coordinated way. From 2009 to 2017, the development level of the agriculture industry and tourism in Henan province has been greatly improved. The value of the comprehensive development index of the agricultural industry increased from 0.1025 to 0.7860. The corresponding value of tourism industry increased from 0.0579 in 2009 to 0.9139 in 2018. The coupling degree between the two industries in Henan has stayed at the high-level coupling stage from 2009 to 2018, and it comes to an orderly stage in 2017. As is shown in Table 4, the coupling coordinative degree shifts from medium-level to high-level coupling coordination. The agricultural industry and the tourism industry in Henan province mutually interact and inﬂuence, and the comprehensive development level and the coupling coordinative degree have been constantly improved. However, the deep integration of two industries requires the long-run exploration and efforts, for the diversiﬁcation of market demand prompts the continuous transformation and upgrading of enterprises; and its integration is also boosted by the new development philosophy of sustainable development. In the present time, how to realize the sustainable development of agriculture by giving play to the leading role of tourism has become an urgent problem to be solved. Sustainable development adheres to the people-oriented concept, afﬁrms the neces- sity of development, and emphasizes the importance of natural resources and natural environment, aiming to promote the coordinated development of society, economy, re- sources, and environment. The integration of the agricultural industry and the tourism industry enriched tourism resources, caused the innovation of tourism products, expanded its product system and market space, and improved the vitality of the tourism industry. For agriculture, the industrial structure of agriculture has been optimized as its growth mode has been transformed, the agricultural value has been improved and the traditional operation mode has been changed. Finally, the two industries have achieved coordinated development [54]. Facing the problem of slow development in agriculture, we should adhere to the concept of sustainable development, give play to the leading role of tourism, optimize the agricultural industrial structure, continue to develop agricultural tourism products, further promote the integrated development of agriculture and tourism, and ﬁnally realize the coordinated and rapid development of society, economy, resources, and environment in the region. The agricultural planting structure should be adjusted to research and develop the traditional agricultural products, such as wheat, rice, and corn, to build the bases for tea and traditional Chinese medicine and to expand the planting of featured agricultural products such as fruits and ﬂowers. On the basis of efﬁcient, multi-storied agricultural projects, modern and ecological demonstration parks with agricultural characteristics can be built. The cultivation and introduction of leading companies in agricultural industrial- ization is favorable to the establishment of agricultural industry demonstration park with regional characteristics and resource advantages. The establishment of farmers’ cooperative organizations, specialized cooperatives, supply and marketing cooperatives, and social organizations should be encouraged to ensure the diversiﬁed production and operation of agriculture. The quality standards for agricultural products must be established, which can serve to supervise the quality of agricultural products. The certiﬁcation of green organic products can be implemented for creating brands with regional characteristics. In order to improve the distribution efﬁciency within one region, the circulation mode of agricultural products can be transformed to accelerate the development of new circulation modes based on e-commerce platforms. Tourism can boost the development of agriculture by enhancing agricultural tourism products. However, the development of new agricultural tourism projects and products should be attached much importance to, for purpose of the enrichment of tourism content and the enhancement of the quality of tourism. In this process, it is necessary to integrate the planting and of featured agricultural products, rural breeding and regional cuisine into the development of tourism products and project design combined with agricultural resources in Henan. Henan province, located in the Yellow River Basin, has a long history, profound culture and abundant agricultural resources. Focusing on agricultural planting, cultivation, breeding and folk customs, tourism products can be developed by exploring agricultural culture with regional characteristics.",
    "The systematic marketing system of agricultural tourism products is the foundation of the integrated development of agriculture and tourism. Firstly, it is essential to locate the target market and actively expand marketing channels. Moreover, the construction of characteristic tourism brands and the introduction of new media marketing platforms will also effectively improve the marketing effect of agricultural tourism products. Ecotourism projects, folk custom experience activities, and characteristic festival activities hosted in agricultural tourism will also stimulate tourism consumption and cultivate tourists’ lasting attention to regional tourism brands. As an important supporting force, the government should formulate a scientiﬁc plan for the integrated development of the two industries and provide the service of organi- zation and coordination, technical guidance, supervision, and inspection. The training of specialized personnel and the introduction of high-level talents require the support from government, research institutions, and schools. Technical assistance must be provided to improve the level of agricultural science and technology. We will improve the service system for agricultural science and technology and carry out activities to popularize agricul- tural science and technology. The awareness of innovation in enterprise can be encouraged and inspired by instructing leading companies to increase investment in technological innovation. The bridge between enterprises and research institutions should be built to facilitate the technological exchanges and cooperation and promote the transformation of agricultural scientiﬁc and technological achievements. This study establishes an index system and analyzes the coupling coordinative de- gree of the agricultural industry and the tourism industry in Henan province of China. Furthermore, from the perspective of sustainable development, the paths for integrated development are put forward. However, there are several limitations in this study. Firstly, the study chooses one area as the case, and draws some conclusions based on the results of quantitative analysis. Further study may select several agricultural provinces to reexamine the ﬁndings in a wider context. Secondly, this study just focuses on the data from 2009 to 2018, which may be insufﬁcient in terms of reliability and validity. For further study, more longitudinal research can be carried out based on longer time series data. Thirdly, this paper does not study the correlation between different elements of the two industries. Therefore, future research can better analyze the dynamic relationship between different elements. Author Contributions: Conceptualization, P.Q. and Z.Z.; methodology, P.Q.; software, Z.Z.; valida- tion, Z.Z., D.-J.K. and P.Q.; formal analysis, Z.Z.; investigation and resources, P.Q.; data curation, D.-J.K.; writing—original draft preparation, P.Q.; writing—review and editing, D.-J.K.; visualiza- tion and supervision, Z.Z.; project administration, D.-J.K. All authors have read and agreed to the published version of the manuscript."
]