[
    "In the face of various risks and uncertainties including political instability, technological ad- vancements, and natural disasters, businesses involved in cross-market activities are encountering a more competitive environment. This study investigates the relationship between competitive . . . an : i intensity, business intelligence, internal Process efficiency, and the performance of small and medium-sized manufacturing enterprises in China. By incorporating the Technology- Organization-Environment (TOE) framework and Dynamic Capabilities Theory, a research model is developed to demonstrate that competitive intensity improves firms’ performance through the utilization of business intelligence capabilities and internal process efficiency. Through the use of a structural equation model, data collected from 15 industrial parks in Henan province, China, involving 429 participants, was analyzed. The findings show a positive corre- lation between competitive intensity and business intelligence sensing capability (both internal and external). The impact of business intelligence sensing capability on the performance of small and medium-sized manufacturing enterprises is shown to be mediated through internal process efficiency. Our study reveals the mediating roles of business intelligence capability and internal process efficiency in improving organizational performance among Chinese small and medium- sized manufacturing enterprises. This research not only fills gaps in business intelligence research from a management perspective but also contributes to the literature on the interactions among competitive intensity, business intelligence, internal processes, and organizational per- formance. It also sheds light on the relationship between competitive intensity and organizational performance, offering insights for companies involved in cross-market activities. By highlighting the importance of business intelligence capabilities in adapting to environmental influences, this study offers practical guidance for enterprise digital transformation efforts. Received 11 August 2023; Received in revised form 7 July 2024; Accepted 11 July 2024 Available online 14 July 2024 2405-8440/© 2024 The Authors. Published by Elsevier Ltd. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-ne-nd/4.0/). In recent years, the growing influence of advanced digital technologies has had a profound impact on businesses, leading to a fundamental transformation of traditional business operations. To stay competitive and preserve market share, enterprises need to pursue strategic advantages [1]. Firms must prioritize the adoption of advanced technologies to effectively respond to dynamic markets and offer valuable insights for decision-making. Active engagement in cross-market competition is equally vital for capital- izing on opportunities for survival and expansion. The competitive and dynamic nature of cross-markets highlights the significance of making sound strategic decisions to avoid negative consequences for enterprises. Utilizing business intelligence can mitigate risks of uncertainty and improve performance [2]. Business intelligence aids companies in understanding risks and identifying opportunities [3]. The digital economy has emerged as a key factor in global industrial competition due to the latest wave of digital technology advancements. Business intelligence plays a pivotal role in shaping and maintaining competitive advantages for enterprises in this landscape [4]. Business intelligence, as a crucial enterprise information system, aims to improve managerial decision-making effi- ciency and enhance the competitive capabilities and performance of the enterprise [5]. The adoption of business intelligence is increasingly widespread among enterprises due to its recognized ability to enhance performance and create value [6]. Over the past thirty years, research in business intelligence has expanded rapidly. Many enterprises have successfully leveraged business intelligence capabilities to navigate through this unparalleled period [7]. Few studies have explored the relationship between business intelligence and the environmental context [8]. And a review study on business intelligence adoption found that only 17 % researchers focused one small and medium enterprises [9]. Due to the economic transformation and competitive UVCA business environment, both product cycles and business model cycles are considerably shortened [10]. Industry 4.0 significantly escalates competition, posing survival challenges for small and medium-sized manufacturing enterprises in the digital economy. The heightened competitive pressure is a major concern for these firms, as it not only impacts business and industry dynamics but also mirrors product quality and performance. To navigate the escalating competition, enterprises must continuously seek new opportunities to enhance their performance [11]. Competitive in- tensity significantly influences organizational performance according to the industry organization model [12]. Both the Structure-Conduct-Performance framework and the Antecedent-Behavior-Consequence framework emphasize the significant influ- ence of the external environment on the behavior and performance of businesses [13]. Enterprises can achieve optimal performance only when their capabilities and behaviors are in alignment with the external environment [13]. An empirical study reveals a positive link between a firm’s environmental scanning efforts and its overall performance [14]. Intense competition poses a threat to both the stability and development of enterprises. Numerous empirical studies have demonstrated that competitive intensity not only influences enterprise behavior but also impacts enterprise performance [15,16].",
    "Some researchers contend that while competitive intensity can boost enterprise productivity, hostile competition may hinder overall performance. Conversely, other studies indicate a favorable influence of competitive intensity on enterprise performance. The conflicting findings underscore the need for additional empirical research to verify these conclusions. Additionally, there are scholars who argue for a positive relationship between the level of competition and the management of processes [17,18]. There is a notable lack in our comprehension of the influence of competitive intensity on process management, specifically internal process efficiency. Even though there is a wealth of literature on competitive intensity, previous research has mainly disregarded its integration within organizations. Although the information system success model dominant the studies [4], it fails to elucidate the impact of business intelligence on organizations and neglects the correlation between business intelligence and enterprise performance [19]. Researchers prefer using the information processing model over the information system success model to demonstrate the relationship between business in- telligence and organizational advantages. They argue that business intelligence enhances decision-making quality, provides insights, and fosters environmental awareness, without directly impacting organizational performance [4]. Several studies have investigated the association between business intelligence and enterprise performance, yet the exact nature of this relationship remains ambiguous. Certain research suggests that business intelligence could improve enterprise performance [20,21]. In contrast, Phan and Vogel (2010) [22] argue that enterprises implementing business intelligence have not met their expectations. Several studies have indicated a negative correlation between business intelligence and enterprise performance [23]. The reasons for the paradox are: firstly, the complexity of the business intelligence concept, which has evolved through three main stages: 1.0 centered on database management systems and structured content, 2.0 highlighting web-based platforms and unstructured content, and 3.0 integrating mobile and sensor-based data for improved capabilities [24]. Secondly, limited research has explored the theoretical relationship between business intelligence and enterprise performance, with no specific study aiming to address how and why business intelligence in- fluences enterprise performance. Viewing business intelligence as an organizational capability, rather than solely a technical asset, offers a promising approach to understanding the relationship between business intelligence and firm performance. This perspective emphasizes the importance of aligning analytics capability with business strategy, which is vital for enhancing overall firm perfor- mance [25]. From the perspective of dynamic capabilities, a business intelligence capability can be defined as an organization’s ability to leverage technology in order to derive valuable insights [4]. The business intelligence capability comprises sensing, seizing, absorbing, and transformative capabilities [26]. Specifically, business intelligence can be considered as offering a certain capability [27], which can sense “opportunities and threats requires the acquisition and interpretation of information about both the internal operation of the firm and its environmental context” [28,29]). The sensing capability of business intelligence pertains to an organi- zation’s ability to gather and analyze data to identify and leverage opportunities. This capability can be divided into two dimensions: internal sensing, which improves the efficiency and effectiveness of internal operations, and external sensing, which assists in monitoring external market conditions and environmental factors [4]. The external and internal sensing capabilities of business in- telligence positively influence internal process efficiency by leveraging learned behaviors and focusing on enhancing process efficiency. Business intelligence capability is an emerging topic in the field of organizational management, especially for enterprises operating in turbulent environments. The relationship between cross-market competition and organizational performance is intricate. Research indicates that environmental volatility has a detrimental impact on the value creation of business intelligence analytics [30]. The analysis overlooks cross-market competition and lags behind the rapid advancements in the digital economy and business intelligence technologies. Therefore, this study seeks to address this research gap by examining the intersection between cross-market competition and business intelligence. The primary aim is to investigate the influence of competitive intensity on the performance of small and medium-sized manufacturing enterprises by utilizing business intelligence and improving internal process efficiency. A significant portion of previous business intelligence research has employed the technology organization environment framework (35.40 %) [9]. The environment significantly influences technological innovation within the TOE framework. Additionally, the Awareness-Motivation-Capability Framework highlights the importance of recognizing external opportunities and threats as a primary driver for organizational action, with capability playing a crucial role in enabling these actions [31]. Numerous examples in academic literature showcase the positive impact of business intelligence on enhancing organizational performance, despite skepticism [7]. The impact of factors motivating firms to adopt business intelligence and the challenges of implementing it on organizational performance encompass problem space complexity and perceived organizational support [32].",
    "Organizations rely on dynamic capabilities (DCs) to effectively integrate, improve, and adjust their skills to navigate changes. Despite the considerable research on DCs, a fundamental question persists: how exactly do dynamic capabilities empower organiza- tions to thrive in times of change [33]? The TOE framework is widely acknowledged as a concise model for analyzing the factors influencing implementation processes [34]. In this model, organizational factors like agility, flexibility, and external pressures play a crucial role in supporting the availability of technology. The research question for this study is. Improving competitive logistics can boost innovation efficiency by enhancing absorptive capacity. It is suggested that the level of competitiveness in various markets has a positive impact on company performance by improving business intelligence capabilities and internal process efficiency. The research model is detailed in Fig. 1. The study emphasizes cross-market competition as a holistic indicator of the enterprise’s market environment, amidst various factors impacting market risk uncertainty. Various viewpoints on competitive landscapes are provided by concepts like industry concentration, disparities in average productivity, and strategic interactions among enterprises [35]. The level of competition significantly influences the degree of environmental uncertainty [36]. Strategic management scholars argue that competitive intensity is the key indicator among various factors for assessing industry and market structure [18]. The concept of “competitive intensity” arises when multiple companies compete within the same industry, posing obstacles to accessing new avenues for growth [18]. Competitive intensity is a crucial market indicator in strategic management research, assessing the extent to which competitors offer similar products and services in the same market [37-39]. The level of competition significantly impacts an enterprise’s mergers and acquisitions, shaping its core competitive advantage and leading to above-average profits. It also plays a vital role in shaping the growth and development of the enterprise. A study conducted in China found a positive relationship between competitive intensity and knowledge integration [40]. Competitive intensity denotes the degree of competition that businesses encounter in various markets, posing difficulties in acquiring valuable data, information, and resources. As such, it significantly influences a company’s performance. Business intelligence involves gathering, organizing, and analyzing business data to provide decision-makers with valuable in- sights, enabling them to make timely and well-informed decisions [41]. The enterprise can transform structured and unstructured data into valuable information through the business intelligence system [42,43]. Current research on business intelligence primarily examines seven key aspects: organizational performance, influence capabilities, competitive processes, intelligence assets, imple- mentation strategies, investments, and information translation. The development of business intelligence is closely associated with factors such as business strategy, organizational structure, corporate culture, industry characteristics, and national context. Moreover, the influence of business intelligence spans organizational performance, competitive advantages, decision-making quality, organi- zational transformation, and innovation. Over the evolution from business intelligence 1.0 to business intelligence 4.0, enhancing business intelligence capability emerges as a central focus in research within this field [44]. Integrating the business intelligence studies and the dynamic capabilities perspective, Torres, Sidorova and Jones (2018) [4] introduced the concept of business intelligence capability. Business intelligence capability is crucial for enterprises to utilize technology and resources effectively in order to gain valuable insights. This includes the ability to sense, seize, and transform opportunities. According to Han and Wu [26], the ability to absorb information is a crucial element of business intelligence capability. From a management perspective, business intelligence capability can be seen as a dynamic capability that can be improved through the use of metrics and knowledge management practices including information planning, collection, analysis, and transformation. Competitive intensity includes competitive behaviors, competitor focus, competitive pressures, and competitive conditions. Fierce competition often drives companies to embrace dominant logic strategies, which include information filtering, learning processes, and established routines [45]. Competitive pressure strongly motivates enterprises to participate in competition through adjustments in cost management systems, improvements in product quality, promotion of innovation, enhancement of efficiency, and reduction of delivery times [18]. As competitive intensity increases, some researchers propose that enterprises will transition their focus from internal development to external competition [46] and competitive rivalry. Nevertheless, this does not suggest that businesses will forsake organizational growth. Scholars argue that competitive intensity not only boosts motivation for investments and internal innovation within enterprises [47], but also improves the efficiency of innovation diffusion. Enterprises prioritize improving production efficiency and achieving economies of scale in situations of low competitive intensity. Conversely, in highly competitive environments, they shift their focus towards product innovation [46]. In a fiercely competitive landscape, businesses need to shield themselves from new competitors and also adjust to the volatile trends in the market. Continually integrating new technologies is crucial for sustaining a competitive advantage. Business intelligence plays a vital role in providing small and medium enterprises with a competitive edge [48]. Conducting thorough environmental scanning is essential for a firm to determine its position in the competitive landscape across markets. Companies involved in cross-market competition often explore growth opportunities and customer needs. Having a strong business intelligence capability is vital for assessing a firm’s strengths and its capacity to navigate uncertain risks. Business intelligence actively contributes to strategic environmental scanning by proactively gathering and analyzing data [8]. It significantly improves firms’ dynamic capabilities, especially in turbulent environments [49]. The empirical evidence indicates a positive correlation between environmental competition and the adoption of business intelligence [50]. Scanning activities entail analyzing both the external and internal facets of an organization. In order to adeptly navigate uncertain risks stemming from cross-market competition, organizations must cultivate two separate cultures: one dedicated to comprehending the external environment, and the other to assessing the internal dynamics of the organization. Considering that businesses are often impacted by external factors, it is crucial for them to continuously analyze and monitor the environment to stay ahead in the competition. As such, business intelligence provides a comprehensive view of the organizational environment, highlighting the significance of not focusing solely on external scanning activities. Based on the superior capability of business intelligence sensors in interpreting external opportunities and threats, along with collecting internal operational information [50], we propose the following hypothesis.",
    "H1. Competitive intensity is positively associated with business intelligence capability, both the sensing capability to internal (H1a) and sensing capability to external (H1b). Data analysis not only facilitates decision-making but also creates value [51,52]. Business intelligence significantly impacts an organization’s strategic plan through the integration of hardware, software, and data [53]. It can provide valuable support to different functions within a business, including marketing, finance, operations, and logistics [54]. Engaging in business intelligence can yield numerous advantages for the enterprise, such as organizational enhancements, improvements in supplier/partner relationships, increased operational efficiency, and enhanced customer insights [55]. The evidence strongly suggests that operational efficiency was a pivotal factor for all executives examined in the study. Business intelligence is essential for facilitating the execution of strategies, especially those pertaining to operational goals [8]. The organization has the capability to leverage business intelligence technology to convert raw data into valuable insights, thereby reducing uncertainties in decision-making [56] and improving internal operational efficiency. In advanced infrastructure systems research, business intelligence has traditionally not received the same level of consideration as enterprise systems, IT value, compute audit, and knowledge. Nonetheless, the concepts of “judgement and decision”, “expert system”, and “artificial intelligence and decision aids” are closely aligned with the features of business intelligence [52]. Business intelligence plays a vital role in performance management by providing managers with data-driven insights to make informed decisions and strategic actions [57]. It not only supports decision making [58] but also enhances internal process efficiency [59]. Furthermore, it significantly enhances business processes [7] and accelerates a firm’s international expansion [60]. The firm’s intelligence collection system enables more effective resource allocation [61]. Based on empirical evidence, research suggests that improving business intelligence capability can enhance the performance of new service products [62]. Consequently, we posit the following hypothesis. H2. Business intelligence capability, both the sensing capability to internal (H2a) and Sensing Capability to External (H2b), are positively associated with internal business process efficiency. Several empirical studies have shown a positive correlation between business intelligence and organizational performance. The theoretical research has emphasized the relationship between business intelligence capability and organizational performance [26]. Based on this, we propose the following hypothesis. H3. Business intelligence capability, both the sensing capability to internal (H3a) and Sensing Capability to External (H3b), are positively associated with small and medium manufacturing enterprises performance. Process management is a systematic and structured approach used by businesses to analyze, improve, and control their business processes [63]. It also serves as a crucial strategy for maintaining a competitive advantage and improving organizational performance [64]. Several case studies in the information systems field have shown that the implementation of process management can result in significant process modifications [65], especially in terms of the influence of the information system on enterprise value creation [66-68]. Alinejad and Anvari [17] posit that effective process management can significantly enhance business performance. Numerous studies in the information systems field have consistently shown a strong correlation between the efficiency of business processes and companies’ overall performance [49]. The relationship is due to the capability of optimizing business processes to significantly reduce operational costs and improve firm profitability. Therefore, we put forward the following hypothesis. The research model was validated through a field survey, aligning with previous studies. The questionnaire items used to test the model’s hypotheses were adapted from validated scales utilized in previous research. Additionally, a panel of academic experts was engaged to evaluate the instrument’s face validity by thoroughly examining each construct, its definition, and associated items. Competitive Intensity. There were two primary methods employed in previous research to gauge the intensity of competition: one involved the use of questionnaires, relying on experts’ opinions as primary sources; while the other utilized various indexes, drawing on structural variables as secondary sources. Given the notable advantage of questionnaires, which have the flexibility to encompass questions not only regarding structural elements but also behavioral factors [69], this study opted to utilize the 6-item scale developed by Jaworski and Kohli’s [38] to assess competitive intensity. This scale, previously applied in service research studies (e.g., Eldor, 2019; Narver, Slater, & MacLachlan, 2004), directed respondents to evaluate their local business environment using a rating scale from 1 (strongly disagree) to 5 (strongly agree). For example, a sample statement given was: “Anything that one competitor can offer, others can match readily.” Business Intelligence Sensing Capability. To assess business intelligence sensing capabilities, an 8-item scale was utilized based on the Torres, Sidorova, & Jones’s [4] scale, measuring two dimensions: external and internal sense. Participants used a 5-point scale, ranging from 1 (strongly disagree) to 5 (strongly agree). For the external dimension, 4 items focused on monitoring the external environment and market conditions. An example statement was: “Our business intelligence capabilities allow our company to foresee a wide range of actionable options based on its surroundings.” The Cronbach’s alpha for this scale was calculated at 0.866. Regarding the internal dimension, the remaining 4 items concentrated on identifying opportunities to enhance the efficiency and effectiveness of internal business processes. An example statement in this context was: “Our business intelligence capabilities allow our company to identify inefficiencies in existing business processes.” Internal Processes Efficiency. A 4-item scale developed by Elbashir, Collier, and Davern [55] was employed to assess internal processes efficiency on a 5-point scale, where 1 indicated “strongly disagree” and 5 indicated “strongly agree”. An example item included in the scale was: “Reduction in the cost of effective decision-making.” Small and Medium Manufacturing Enterprises Performance. The 6-item scale developed by Elbashir, Collier, and Davern [55] was initially employed to assess the performance of small and medium manufacturing enterprises using a 5-point rating scale, varying from 1 (strongly disagree) to 5 (strongly agree). An example item included in the scale was “Increased return on investment (ROI).” However, the reliability coefficient, Cronbach’s alpha, was determined to be 0.575. Subsequent factor analysis revealed that the factor loading of the item “Enhanced profit margin” fell below the acceptable threshold at 0.287, which led to the decision to eliminate this particular item.",
    "Control variables. Several enterprise-related variables were collected to ensure that the samples aligned with our criteria. The first control variable, F NATURE, indicates the nature of the enterprise and its impact on resource acquisition and corporate behavior flexibility. The second control variable, E NUM, represents the number of employees as a measure of enterprise scale. Existing studies often highlight the significant influence of enterprise scale on their capabilities, operational efficiency, and performance. The third control variable is TNUM, which denotes the percentage of technical experts within the enterprise, crucial for enhancing business intelligence capabilities and internal processes. The fourth control variable, M_NUM, signifies the percentage of managers within the enterprise, emphasizing the value creation role of management alongside technological advancements. Additionally, enterprise age (F_AGE) is also considered as a controlled variable in this study. This research received funding from the Philosophy and Social Science Foundation of China (Grant No. 22BGL096) and adhered to the guidelines provided by the Science & Technology Research Office of Henan University of Economics and Law (SPECIFIC SERIAL NUMBER: 2022-HUEL-096). No unethical behaviors occurred during the research process, and we were exempt from additional ethics board approval due to the absence of human clinical trials or animal experiments in our study. All participants were adequately informed before completing the questionnaire. A structured quantitative survey was created to collect field data, and later translated from English to Chinese to align with the local dialect in China. Upon following the pre-testing procedure of empirical research [70], experts in small and medium-sized enterprises and business administration professors were engaged to review the questionnaire and assess the content’s validity. Utilizing a convenient sampling approach, 500 questionnaires were distributed among small and medium manufacturing enterprises in Henan province, China. A total of 429 valid questionnaires were successfully obtained, resulting in an effective data collection rate of 85.8 %. The high recovery rate can be attributed to the utilization of a group visit survey method during the questionnaire collection process. Each enterprise was visited individually, and prior to commencing the formal investigation, the purpose and procedures of the study were explained to a key executive of the enterprise. Assurance was given to the respondents regarding the anonymity of the investigation and the confidential use of the data solely for scientific research purposes, ensuring no disclosure of private information that could have any detrimental effects on the respondents or their enterprises. Subsequently, the assigned principal executive delegated a manager skilled in business intelligence management, or completed the pre-prepared questionnaire themselves. Data was gathered from 429 enterprises located in 15 industrial parks in Hennan province, China. The majority of the enterprises had been established for over 8 years, with the survey respondents consisting of 50.24 % male and 49.76 % female participants. Furthermore, 82.12 % of the respondents fell within the age bracket of 25-45 years, 60.05 % had attained a university degree, and 76.95 % had accumulated more than 3 years of work experience. We assessed the reliability of the scales and conducted statistical analysis, including mean, minimum, maximum values, standard deviation, and correlation coefficients, using STATA 15.0. In order to thoroughly evaluate the validity of latent variables, we employed specialized tools such as the CLC estimator. Confirmatory Factor Analysis (CFA) and structural equation modeling were performed using MPLUS 7.4 to test the hypotheses. While self-reports are often viewed as subjective, they provide valuable insights into past behaviors, personality traits, perceptions, and demographics. However, researchers must remain cognizant of potential challenges associated with self-report data [71]. As noted by Thornton, Henneberg, & Naudé [72], participants were ensured anonymity during data collection. A common method bias check was conducted before testing the hypotheses due to the cross-sectional survey design and self-reported data. According to the rec- ommendations provided by Podsakoff, MacKenzie, Lee and Podsakoff [71], we assessed common method bias by incorporating a latent variable representing common method bias into the structural equation model. The evaluation criteria indicate that if the fit indexes of the model with the common method bias factor do not show significant improvement compared to the previous model, researchers can confidently assert the absence of substantial common method bias in their study. Furthermore, based on the comparison of fit indexes between the 6-factor and 5-factor models (as shown in Table 2), it can be concluded that there is no significant presence of homologous bias in this study.",
    "To ensure both the validity and reliability of the study, congeneric approaches were employed to estimate factor loadings and overall reliability. Researchers are advised to maintain consistent approaches in estimating latent constructs when utilizing previously validated scales, as suggested by Marzi et al. [73]. The Shiny app “CLC Estimator” (Congeneric Latent Construct Estimator) was employed for this purpose. Model estimation primarily utilized maximum likelihood in IRT expectation-maximization. Table 1 in- dicates that the reliability of all latent constructs was above 0.7, with factor loadings of all items surpassing 0.5, composite reliability exceeding 0.8, and AVE exceeding 0.5. Consequently, it was deduced that the results effectively portrayed the relationships between items and latent constructs [74]. Discriminant validity was assessed through confirmatory factor analysis. The results of the analysis are presented in Table 2, showing that the five-factor model demonstrated a good fit (y2 = 504.220; df = 243; y2/df = 2.075; RMSEA = 0.050; CFI = 0.936; TLI = 0.927; SRMR = 0.052). The correlation test results indicate that competitive intensity has a significant and positive relationship with the internal business intelligence sensing capability (y = 0.345, p < 0.01) and is also significantly and positively associated with the external business intelligence sensing capability (y = 0.397, p < 0.01), providing support for H1a and H1b. Furthermore, both the internal and external business intelligence sensing capabilities show significant and positive correlations with internal processes efficiency (y = 0.363; 0.385, p < 0.01), supporting H2a and H2b. Similarly, both the internal and external business intelligence sensing capabilities demonstrate positive and significant relationships with the performance of small and medium manufacturing enterprises (y = 0.427; 0.466, p < 0.01), providing support for H3a and H3b. Additionally, internal processes efficiency is positively and significantly correlated with the performance of small and medium manufacturing enterprises (y = 0.642, p < 0.01), supporting H4. Note: CI= Competitive Intensity; BSCI—BI&A Sensing Capability to Internal; BSCE= BI&A Sensing Capability to External; BBP= Business Benefits at the Processes Level used to measure Internal Process Efficiency; BBO= Business Benefits at the Organizational Level used to measure small and medium manufacturing enterprises Performance; CMW=Common Method Bias Factor. Note: CI= Competitive Intensity; BSCI—BI&A Sensing Capability to Internal; BSCE= BI&A Sensing Capability to External; BBP= Business Benefits at the Processes Level used to measure Internal Process Efficiency; BBO= Business Benefits at the Organizational Level used to measure Small and Medium Manufacturing Enterprises PerformanceLower-triangular cells report Pearson’s correlation coefficients, upper-triangular cells are Spear- man’s rank correlation, triangular cells are coefficient of Cronbach «.**p < .05, *p < .1. The results from the hypothesis test and structural equation model conducted using MPLUS version 7.4 are presented in Fig. 3. The findings of the structural equation model confirm H1a, indicating that competitive intensity positively and significantly influences the internal business intelligence sensing capability (6 = 0.550, p < 0.01), as well as H1b, indicating a positive and significant effect of competitive intensity on the external business intelligence sensing capability (B = 0.602, p < 0.01). The empirical findings confirm the hypothesis H2b that the ability of business intelligence to sense external factors has a significant positive impact on internal process efficiency (6B = 0.391, p < 0.01). Furthermore, the results support H3b, indicating that business intelligence’s sensing capability regarding external factors significantly influences the performance of small and medium-sized manufacturing enterprises (6 = 0.183, p < 0.01). Additionally, the study findings provide support for H4, suggesting that internal process efficiency significantly affects the performance of small and medium manufacturing enterprises (B = 0.725, p < 0.01). The coefficient of business intelligence sensing capability on internal process efficiency (H2a) was found to be 0.159, indicating statistical significance at the 10 % level. However, no substantial relationship was observed between business intelligence sensing capability and the performance of small and medium manufacturing enterprises (H3a). Therefore, it is not possible to confirm that H2a and H3a have been supported by the findings of this study. The objective of this article is to introduce a new configurational approach that integrates the TOE framework (Technology, Or- ganization, and Environment) with Dynamic Capabilities Theory to explain the ways in which small and medium-sized enterprises (SMEs) can adjust to environmental changes and improve their performance through the utilization of business intelligence. The findings of the study indicate that managing cross-market competition involves a complex process influenced by multiple factors.",
    "This study presents a comprehensive framework that explores the interconnections between among cross-market competition, business intelligence capability, process efficiency, and organizational performance. This provides a basis for researchers to further explore the interplay between different markets and company performance in the age of digital intelligence. The theoretical ad- vancements of this research are delineated below: Firstly, Porter [75] proposed that market intensity is determined by the level of competition present. Moreover, competition within a limited number of firms in a given market segment could be fiercer than competition across the entire market [69]. Conducting thorough research is crucial for accurately evaluating competitive intensity. A questionnaire incorporating maturity scales is utilized to assess market competitiveness by examining the structure and behaviors of competing entities. The results of this study are theoretically significant as they provide insights into industrial competition trends and enterprise competitive behaviors. Secondly, recent studies examining the association between competition intensity and organizational performance have pre- dominantly treated competition intensity as a moderator variable. However, there has been a lack of consensus on how competitive intensity impacts organizational performance. Our study reveals that heightened competitive intensity has a positive impact on the performance of small and medium-sized manufacturing enterprises by improving their business intelligence capabilities and internal process efficiency. This discovery provides a fresh perspective that explores the underlying mechanisms involved and contributes to advancing our comprehension of the correlation between competitive intensity and organizational performance. Additionally, Mavi and Standing [76] classified the literature on business intelligence into two primary streams: the managerial approach and the technical approach. The managerial approach prioritizes converting data sources, whether internal or external, into actionable information, while the technical approach centers on the tools and applications that facilitate this managerial process. Previous research on business intelligence often focused heavily on technical aspects while overlooking the significance of managerial strategies. Although technology plays a crucial role in driving innovation, it is effective management that truly enhances value. including big data and cloud computing, have significantly impacted the evolution of the digital economy and reshaped the global economic competitive landscape. Big data and its analytics are considered disruptive technologies that are revolutionizing the field of business intelligence [77]. The research elevates the examination of business intelligence from a technical standpoint to a strategic management level, aiming to rectify the shortcomings in existing managerial strategies related to business intelligence. The empirical study explored in this paper illustrates that organizational performance can be improved through cross-market competition by utilizing business intelligence capability and enhancing internal process efficiency. This research offers practical advice for small and medium enterprises engaged in cross-market activities to attain a competitive advantage, and provides valuable insights for practitioners and strategy firms on effectively managing uncertainty and competition across markets. Empirical research suggests that businesses need to be aware of the substantial risks and challenges associated with cross-market operations, and the importance of utilizing business intelligence capabilities to adapt to environmental factors. Managers should acknowledge the challenges of the digital economy and seize the opportunities it provides. The dominant theme of the digital age is defined by discontinuity, rapid advancements, and heightened uncertainty. The ongoing revolution in digital technology is reshaping organizational characteristics and operational approaches. Consequently, the phenomena of “strategic confusion” and the “entre- preneurial dilemma” have now become inherent features of the contemporary business landscape. The findings of our study suggest that competitive intensity indirectly improves the performance of small and medium-sized manufacturing enterprises by enhancing their business intelligence sense capability and internal processes. Our research indicates that managers should prioritize not just the adoption of new technologies but also the utilization of digital technology to improve organizational performance and facilitate digital transformation. This strategic focus can assist companies in successfully navigating the volatile business environment and adjusting to the changing dynamics of the digital age. The dynamic and rapidly changing business landscape necessitates companies to quickly adjust to competitive shifts, presenting challenges in areas like evaluating future risks, adopting new technologies, and making strategic decisions. Enterprise managers need to grasp the essence of the digital economy and strategically choose digital tools to boost their core competitiveness, amidst the rapid progress of the digital economy and Business Intelligence (BI) technologies. Despite the substantial expansion in the field of big data analysis, numerous businesses continue to struggle with effectively harnessing and extracting value from this vast amount of data. Our research indicates that BI technology, a key element of big data analysis, can improve internal process efficiency and have a positive influence on the performance of small and medium-sized manufacturing enterprises. In the age of big data, information productivity driven by continuous evolution is essential for enterprises to maintain their competitive advantage. Business intelligence plays a crucial role in boosting information productivity by collecting, analyzing, and mining data to support informed decision-making.",
    "Firstly, the external validity of the research is constrained by the sample selection from industrial cluster parks in Henan Province. To improve the generalizability of the findings, future research should incorporate a wider range of more diverse samples. Secondly, the study primarily investigates the influence of competitive intensity on the performance of small and medium-sized manufacturing enterprises. Future research should not only focus on analyzing external competitive intensity from a market perspective but also take into account the internal competitive intensity within enterprises. In other words, future research can focus on product market competition or internal resource market competition. Thirdly, examining the boundary conditions that influence the relationship between competitive intensity and small and medium manufacturing enterprise performance is crucial. Future research should prioritize improving business intelligence capabilities and exploring contextual factors that can moderate the relationships between business intelligence capabilities and performance. A recent literature review in the field of business intelligence has integrated individual factors into the Technological-Organizational- Environmental (TOE) framework and introduced a new theoretical conceptual framework [9]. Another study indicates that inte- grating organizational learning with ambidextrous organizational culture can improve the accuracy of business intelligence capa- bilities in performance predict [78]. There is clear evidence indicating that businesses are progressing towards integrating machine learning into their operations [44]. Future research can utilize novel methods to reevaluate inconsistent conclusions from the past. Additionally, scholars argue that business intelligence can enhance organizational performance across various dimensions including finance, processes, customer relations, and learning and growth [79]. The primary objective of this study is to examine the relationship between business intelligence capability and the performance of small and medium-sized manufacturing enterprises. Subsequent research should investigate the influence of different aspects of business intelligence on organizational performance. The research results validate a strong correlation between improving internal process efficiency and achieving high organizational per- formance [17]. It confirms the positive association between enhancing internal process efficiency and high organizational performance [57]. The relationship between business intelligence applications and capabilities and the total factor productivity of enterprises remains a topic that is still up for debate. Therefore, managers must thoroughly assess the coherence and incorporation of enterprise needs with business intelligence to avoid misleading enterprise practices. The study results validate a strong connection between improving internal process efficiency and achieving high organizational performance. Nonetheless, certain studies have highlighted the risks associated with overreliance on business intelligence in managing business processes, which could potentially steer enterprises in the wrong direction. Therefore, it is imperative for managers to thoroughly assess the alignment and incorporation of enterprise needs with business intelligence to avoid misguiding enterprise practices. Environmental changes were widespread and continuous, especially in dynamic markets with high levels of uncertainty. In the era of digital intelligence, business environments have become increasingly uncertain, ambiguous, and complex, leading to unprecedented competition among enterprises. Heightened competition across markets results in the generation of large amounts of data that can be used by business intelligence tools to enhance decision-making processes and optimize firm performance. Consequently, enterprises are increasingly faced with both direct and indirect competitors, underscoring the importance of actively monitoring environmental changes to effectively capitalize on emerging opportunities. This research was support by following funds which we are grateful. And the authors would take all responsibility for this paper. Guangzhou Huashang College Key Discipline Project - Business Management: (Project Number: 2022HSKT02,2021HSXK10); Phi- losophy and Social Science Foundation of China (Grant No. 22BGL096); Key R&D and Promotion Special Project (Soft Science) of Henan Province in 2024 (Grant No. 242400412028); Guangzhou Huashang College Province : Featured Convergence Courses (Cross- cultural management); Guangdong Planning office of philosophy and Social Sciences Project (Youth) (Project Number: GD20YGL09). Han Xueliang: Methodology, Investigation, Funding acquisition, Data curation, Conceptualization. Tsung Xian Lin: Project administration, Funding acquisition. Wang Xiao: Project administration, Conceptualization. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."
]