[
    "Background: As the comprehensive development demands of power grid companies for sub- stations continue to increase, traditional substation distribution equipment selection strategies, which only consider the life cycle cost theory, are no longer sufficient to meet current re- quirements. To address this, this paper goes beyond the existing methods that focus solely on economic factors for substation distribution equipment selection. First, the enterprise asset management theory is introduced to preprocess data for substation distribution equipment. Then, the economic aspects of substation distribution equipment are analyzed based on life cycle the- ory. Simultaneously, reliability-centered maintenance theory is employed to study the reliability of substation distribution equipment, while rough set theory is used to evaluate energy efficiency indicators for the equipment. Finally, an equipment selection strategy is proposed based on the collaborative management theory derived from Total Productive Maintenance (TPM). This study is applied to the historical data of a 110 kV substation in Henan Province for the selection of substation distribution equipment. The results indicate that the proposed selection strategy effectively addresses the comprehensive development needs of substation operations, validates the strategy’s effectiveness, and provides theoretical support for the upgrade and renovation of substations in Henan Province. The selection of substation distribution equipment is a critical issue for improving the overall operational efficiency of power grid enterprises, as the results directly determine the initial investment and other direct economic costs of substation equipment.[1] Moreover, the choice of substation distribution equipment significantly impacts the reliability, energy efficiency, and economic performance during subsequent operations of the substation [2]. Inappropriate selection can lead to high indirect costs during later stages of operation, thereby hindering the enhancement of comprehensive operational efficiency [3]. Traditionally, substation dis- tribution equipment selection relies on life cycle cost analysis methods [4–6]. However, these methods predominantly focus on quantitative data evaluation, while providing insufficient consideration for qualitative indicators such as reliability and energy effi- ciency. As a result, they often fail to fully meet the comprehensive development needs of power grid operations. Therefore, supported 2405-8440/© 2025 The Authors. Published by Elsevier Ltd. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-ne-nd/4.0/). by reliable data and by comprehensively considering optimization objectives such as economic performance, reliability, and energy efficiency, developing a rational strategy for substation distribution equipment selection is of paramount importance for enhancing the To conduct a reasonable comparison and selection of distribution equipment, literature [8] initially applied the comprehensive engineering theory to the evaluation of distribution equipment selection, introducing the concept of life cycle cost. This approach considers the costs incurred during various stages of the equipment’s life cycle, integrating technical, financial, and management factors to conduct a comprehensive study of substation distribution equipment, thereby achieving maximum efficiency and economic benefits. However, the engineering theory focuses solely on economic aspects, lacking consideration of reliability, which often results in insufficient power supply reliability for the selected equipment [9]. To address this issue, literature [10] introduced reliability-centered maintenance (RCM) theory into the equipment selection process, proposing a strategy that considers system operational reliability. This approach developed a predictive maintenance framework and methods, improving system reliability while ensuring economic efficiency. Nevertheless, this theory does not consider energy efficiency, leading to a decline in power supply quality [6]. Subsequently, literature [11] proposed an energy efficiency evaluation strategy that considers factors such as power grid planning, equipment parameters, and operational status. It employed the Analytic Hierarchy Process (AHP) to score influencing factors, making energy efficiency evaluation results more quantifiable and intuitive, thereby improving the power supply quality of the system. However, this strategy focuses solely on energy efficiency, leading to insufficient operational reliability in the selection results. The root cause of these research limitations lies in the exclusive application of singular asset management theories to the equipment selection problem. Consequently, the final selection strategies fail to balance multiple optimization objectives such as economic ef- ficiency, reliability, and energy efficiency. In contrast, in the context of equipment selection for mechanical plants, literature [12] proposed the application of Total Productive Maintenance (TPM) theory, advocating for the collaborative application of multiple management theories during decision-making to enhance overall operational efficiency. Similarly, literature [13] introduced the management collaboration theory into enterprise asset management, employing order parameter coefficients to formulate stan- dardized collaborative application strategies. However, these strategies only conceptualize collaborative management from a man- agement perspective, lacking a quantifiable evaluation index system and thus cannot be directly applied to the selection of distribution Therefore, this study draws on the strengths of various management theories and applies them to different stages of substation distribution equipment selection. By employing order parameter coefficients from management collaboration theory, a comprehensive evaluation index system for reliability, energy efficiency, and economic performance of distribution equipment is constructed. Based on this framework, a comprehensive selection strategy for substation distribution equipment is proposed, grounded in management collaboration theory. The proposed strategy is validated using historical operational data from 110 kV substations in Henan Province, demonstrating its reliability and providing theoretical support for the upgrade and renovation of substation distribution equipment in the region.",
    "The common distribution devices used in substations are mainly divided into outdoor AIS devices, outdoor GIS devices, and outdoor HGIS devices. Among them, outdoor AIS equipment is conventional equipment in substations. Although the initial investment price of the equipment is cheaper than GIS and HGIS equipment, it occupies too much area.[14] In addition, the structure of these devices is most directly exposed to outdoor air and is more prone to failure than the other two types of equipment. And compared with the other two types of equipment, troubleshooting, and subsequent maintenance phases are extremely expensive and show obvious deficiencies. Considering the above problems, this paper ignores this kind of equipment in the evaluation and comparison. The outdoor GIS (Gas Insulated Switchgear) equipment has advantages such as high reliability, good stability, and low maintenance costs. However, due to its fully enclosed design, GIS equipment has a higher degree of integration and more complex structure. When a Outdoor HGIS devices combine the advantages of outdoor GIS devices and outdoor AIS devices with compact structure, high flexibility in arrangement, high reliability, and low difficulty in operation and maintenance. The use of a separate phase-independent design and the external placement of the busbar through the insulation sleeve has enhanced the scalability of the device. However, due to the more advanced technical process, the equipment cost is higher, resulting in higher initial investment costs and a relatively large Each of the two types of power distribution devices has its own advantages. In the upgrading work of substations, a reasonable selection strategy for power distribution devices needs to be formulated to provide theoretical support for the upgrading and trans- Currently, the most used theory for the selection of power distribution devices is the Life Cycle Cost (LCC) theory, As shown in Fig. 1. The selection strategy for power distribution units constructed based on this theory [15] is easy to calculate, and a more comprehensive economic evaluation index can be obtained based on the cost analysis of the operating characteristics of power dis- tribution units under different stages. However, the selection strategy only considers the economic index, which can lead to the problem of insufficient power supply reliability and power supply quality of the selected device. Reliability Centered Maintenance (RCM) theory is also often applied in the selection problem of devices [16]. The selection strategy developed based on this theory guarantees the operational reliability of the device through a variety of maintenance strategies such as early warning of failure problems, analysis of the consequences of failures, and a preview of failure situations through reasonable analysis of historical data. However, this strategy lacks consideration of power supply quality and requires high accuracy of historical data, which requires a special management mechanism for historical data maintenance. At the same time, an energy efficiency analysis and evaluation method based on Rough Set Theory (RST) has been proposed to assess the energy efficiency of the equipment [17]. Based on this theory, a selection strategy for substation distribution equipment energy efficiency can be formulated. The strategy evaluates indicators such as harmonic content, voltage deviation, and power per- formance of the equipment supply using Rough Set Theory, and the equipment is selected according to the evaluation results [11]. This selection strategy analyzes the equipment from multiple perspectives, including grid planning, equipment parameters, and operating conditions, and establishes corresponding static, dynamic, and loss-related indicators, constructing a comprehensive energy efficiency evaluation strategy for distribution equipment. However, this strategy focuses solely on energy efficiency and overlooks the issue of power supply reliability of the distribution equipment, resulting in insufficient operational reliability of the selected equipment. Considering that, it is difficult to build a more complete index system by using only one asset management theory of selection strategy, the lack of feedback adjustment mechanism and insufficient synergistic optimization of the selection process leads to insufficient reliability of the selection results [18]. It is necessary to find a new theory to synergistically regulate multiple management strategies and solve the problem of the comprehensive selection of power distribution devices. To synergistically regulate multiple management strategies, the TPM theory appeared [19], and first proposed the concept of collaborative management. And the management synergy theory was proposed based on that. The theory determines the importance of each management strategy to the selection index through sequential parametric coefficients and coordinates the advantages of different management strategies from a macro perspective to improve the comprehensive selection performance of power distribution Considering that management synergy theory can give full play to the advantages of different asset management theories, this paper applies management synergy theory to the selection problem of power distribution devices. Using the sequential covariance coefficients, the commonly used asset management is managed collaboratively, and the correlation between each index and the comprehensive selection index is analyzed to obtain the final comprehensive selection results, and the main application concept is Considering that the selection strategy based on LCC theory and the energy efficiency evaluation strategy based on RST theory are relatively complete, this paper adopts the LCC theory as the basis for economic selection and uses the relevant indicators for distri- bution equipment from the energy efficiency evaluation strategy based on RST theory as the basis for energy efficiency selection.",
    "Considering the superior performance of RCM theory in solving reliability problems, this paper uses it as the basis for the reliability selection index. However, the RCM theory requires high accuracy of historical data, and the evaluation is likely affected by the error of To this end, this paper introduces Enterprise Asset Management (EAM) theory [11] to analyze and process the raw data, and by constructing a complete database for the operation of power distribution devices, the laws of the collected data are discovered, and the deviations are corrected based on it to enhance the validity of the data. In summary, the flow chart of the collaborative selection strategy developed in this paper is shown in Fig. 3. Apply EAM theory to collect and process raw data. apply RCM theory to evaluate reliability, combine energy efficiency and economic indexes, and establish a comprehensive evaluation system. use management synergy theory to rank the importance of each index. combine expert experience to adjust the weight of each index, propose an alternative solution, and submit it to the committee for consultation. feedback on the alternative solution to the decision maker to make decision-making adjustments, and finally realize the comprehensive selection decision of substation distribution devices. To achieve device selection, a corresponding evaluation index system needs to be developed. According to the characteristics and applicability of different theories, the index system of power distribution unit selection based on the management synergy theory can be developed by referring to the literature [20–24] as shown in Fig. 4. Among them, TPM theory is the dominant theory, which aims to fully mobilize all members of the enterprise and comprehensively consider economic, reliability, and energy efficiency optimization goals to coordinate the completion of data processing based on EAM theory, reliability evaluation based on RCM theory, economic evaluation based on LCC theory, and energy efficiency evaluation strategy based on RST theory (see Fig. 4). Specifically, the EAM theory is a management framework for enterprise assets, covering the full life cycle management of assets, including planning, procurement, maintenance, and disposal. By collecting and processing the original data based on the EAM theory, detailed device status data can be provided for the TPM theory. With the status data, in order to achieve the goal of comprehensive selection, the reliability, economic, and energy efficiency indicators of different selection strategies need to be analyzed based on the status data, and TPM can choose the corresponding theory to analyze the indicators. For reliability indicators, the RCM theory is used from the perspective of device reliability to help enterprises design and optimize maintenance strategies to achieve the highest reliability at the lowest cost. For economic indicators, the LCC theory evaluates the full life cycle cost of assets from an economic perspective to optimize device management solutions and reduce cost expenditures. For energy efficiency indicators, the energy efficiency evaluation strategy based on the RST theory analyzes and formulates static, dynamic, and loss in- dicators through multi-dimensional analysis to evaluate and select the energy efficiency of distribution devices. In summary, the TPM theory comprehensively considers economic, reliability, and energy efficiency, thus making the selection considerations more Considering that the initial data determine the validity of subsequent calculations, the initial data are first processed and analyzed based on EAM theory. In this paper, the Least Angle Regression (LAR) algorithm [25] is used to achieve law discovery and bias Based on RCM theory, the possible failure consequences of the device can be divided into four kinds of evaluation indexes: environmental failure consequences, hidden failure consequences, device use and maintenance, and device idle consequences. The environmental failure consequences and the maintenance of the device user can be calculated by drawing on the indicators of routine and troubleshooting costs in the literature [20]. The cost of troubleshooting is difficult to quantify directly and can be simplified to estimate the cost of power supply loss due to unplanned outages [18]. Where: r is the inflation rate. R is the social discount rate. N is the year of commissioning. λ is the equipment failure rate. RC is the average cost of repair. MTTR is the average time to repair equipment. UOC is the unscheduled outage rate. Sr is the lost supply load due to the outage. α is the average tariff for interrupted supply power.",
    "Whereas the consequences of hidden failures are difficult to obtain directly and need to be estimated by operational accident cost analysis [26]. Where: fS1 is the mega-accident indicator, i is the number of mega-accidents, and KS1 is the mega-accident factor. fS2 is the major accident indicator, j is the number of major accidents, and KS2 is the major accident factor. fS3 is the general accident indicator, k is the number of general accidents, and KS3 is the general accident factor. Long-term idleness of the device may lead to a decline in the quality of the power supply. In serious cases, it may even fail to meet the operating standards and be retired, which can be measured by the cost of decommissioning disposal. Considering that the com- bination of electrical appliances after the end of service to the disposal unit disposal, can be considered in accordance with the end-of- Where: RC is the average restoration cost. β is the scrap discount rate. γ is the rate required to dispose of the equipment. The economic indicators can be calculated by drawing on the indicators of the literature [20], such as the cost of investment and operation, the proportion of capital occupation, and the conversion of the present value of capital. The time cost impact is mainly used to measure the investment conversion benefit brought by the distribution installation to the enterprise, which is divided into benefit The benefit-cost ratio characterizes the magnitude of the project’s return on investment and measures the overall rate of return on Where Ri is the total present value of benefits calculated to year i. LCCi is the total present value of whole life cycle costs calculated to The payback period refers to the time after the project is put into operation when the net income balances with the construction expenditure and is calculated in years using a dynamic payback period [12]. The energy efficiency index is extracted from the equivalent utilization rate and shortage loss evaluation index in the literature [21]. The supply reliability index is related to the distribution history and is calculated using the average supply availability rate from The ease of operation and maintenance is from the perspective of substation operation, requiring the simple operation of the device, less misoperation, and considering the replaceability of wearing parts, the versatility of spare parts, etc. There is no more objective evaluation model. In this paper, the expert opinion method [25] is used to analyze and quantify the overall scoring of different experts utilizing the Pythagorean fuzzy Hamacher weighted average operator to obtain a more objective evaluation score [16]. Am = ⊕n l=1 (ωlal) ⎪⎪⎩ al =< βal ,δal βal ∈ [0,1],δal > ∈ [0,1],βal + δal ≤ 1 where wl is the scoring weight of the lth expert. al is the score value assigned to the index by the lth expert. n is the total number of scoring experts. βal and δal are the affiliation and non-affiliation degrees of al. respectively. ⊕is the Pythagorean fuzzy operator. For any In order to achieve the synergistic evaluation of multiple indicators, it is necessary to clarify the dominant status of each evaluation indicator. As a comprehensive management method, the theory of synergistic management emphasizes the synergistic optimization of system elements, and achieves the maximum overall benefit by coordinating the relationships between resources, performance, and goals. Therefore, this paper considers the economic, reliability, and energy efficiency indicators comprehensively and uses the serial parameter coefficient method of the management synergy theory to coordinate the relationships between indicators and rank the indicators in terms of their dominant status. At the same time, it calculates the serial parameter coefficient using the grey correlation Formula: △i(k) = |y(k)-xi(k)|, △min = min imin k△i(k) is the minimum difference between the two poles, △max = max imax k△i(k) represents the maximum difference between the two poles, ρ is the resolution factor, ρ∈(0,∞), Usually, the value range is (0,1). The smaller ρ is, the greater the resolution is. When ρ ≤ 0.5463, the algorithm has the best resolution, and ρ = 0.5 is usually taken. By managing the serial parameter coefficients of the coordination theory, the comprehensive weight of each indicator can be determined, and the comprehensive evaluation index of the substation configuration can be obtained by weighted summation. The evaluation index should reflect the score of the device in the selection, and the comprehensive evaluation of multiple devices should be carried out after that. The device with the highest score is considered to have the best overall performance, which can consider various factors comprehensively.",
    "Applying the management synergy theory to the problem of selecting 110 kV substations in Henan Province, with a 50MVA installed capacity of the main transformer as the selection criterion, a total of 45 outdoor GIS substations and 10 outdoor HGIS substations with the same construction scale were selected. Considering that the operational years and device quantities of the selected substations are different, the latest operational year of the substation is taken as the reference year for the initial investment cost conversion work. The conversion formula is as follows: In this formula, P represents the original value, Pn represents the present value, r represents the inflation rate, and t1 represents the year of installation, and t2 represents the year of data collection. In practical engineering, there are few records of breakdown cost and maintenance cost, so this paper combines them into the breakdown cost for analysis. Firstly, LAR algorithm was used to fit data such as substation maintenance cost and operating years, and the fitting curve was obtained by mining maintenance cost rules, as shown in Fig. 5. Because the fitted function obtained through calculation is a quadratic growth function, the maintenance cost also increases as the operating year of the GIS substation increases. According to the quadratic function expression obtained, the total life cycle fault maintenance cost is approximately 6.16 million yuan. Since the HGIS and GIS devices belong to the same type of combined device, their characteristics and operating environment are similar, the trend of the fitting curves of the two devices is basically consistent, only with numerical differences. Therefore, based on the fitting curve of the outdoor GIS substation, the fault maintenance cost of the outdoor HGIS device can be calculated at 4.3678 million yuan. The decommissioning cost of the substation device is negative, usually calculated at 5 % of the initial investment, as shown in Table 1. As shown in Table 1, the fault repair and maintenance costs of outdoor HGIS are 1.7922 million yuan lower than those of GIS devices, and the decommissioning costs are 502,500 yuan less. The reason for this is that outdoor HGIS has greater assembly flexibility, making it easier to repair and maintain. However, due to the lower initial investment cost, its decommissioning recovery value is also lower. On the other hand, outdoor GIS uses a closed design, and during fault repair, the equipment needs to be disassembled, making the process more complicated, which results in higher fault repair costs. Based on Tables 2 and 3, it can be concluded that the operational accident indicators for outdoor HGIS devices are higher. This is because both types of devices are enclosed, and there have been no instances of major accidents or significant failures. The occurrence of general accidents is relatively low. However, due to the exposed busbars in outdoor HGIS devices, the busbar section is more prone to faults compared to GIS devices. The investment and operating costs of substation distribution devices are divided into two parts: initial investment cost and operating cost. The initial investment cost refers to the cost of the device at the time of its initial investment, while the operating cost refers to the costs incurred for maintenance and repairs of the device. The initial investment cost can be amortized over the years to obtain the annual initial investment cost. The annual operating and maintenance costs, as well as the initial investment cost of GIS From Fig. 6, it can be seen that the initial investment cost decreases as the device’s operational years increase. The operating maintenance cost increases as the device runs, starting from the time it is put into operation, and experiences a significant increase in a certain year. After this increase, the operating costs show a decreasing trend. This may be due to equipment failures or major technical upgrades and overhauls that occurred in that year, which affected the operating costs for subsequent years. Additionally, the operating maintenance fault costs show data gaps from the 33rd year to the 40th year. This may be because the data collection started later, and data from the 33rd to the 40th year were not gathered, resulting in missing data. Due to the short operating life of outdoor HGIS, the operating cost of outdoor HGIS throughout its life cycle needs to be projected based on the fitted outdoor GIS device operating cost trend, with the minimum variance between HGIS operating data and GIS fitted curve as the target, the initial investment cost and operating cost of 110 kV substation can be obtained as shown in Table 4.",
    "From Tables 4 and it can be seen that the initial investment and operating costs of the outdoor HGIS substation are 1.07 million yuan higher than those of the outdoor GIS. The reason for this difference lies in variations in the device procurement cost, land acquisition fees, and installation costs. Regarding the device procurement cost, outdoor GIS devices have a more complex structure due to their fully enclosed design, making their procurement cost slightly higher. For land acquisition fees and installation costs, HGIS requires a larger area and more complex structure, leading to higher land acquisition and installation costs. As a result, the overall initial investment cost for HGIS is slightly higher, making it less economical. Additionally, as shown in Table 4, the operating costs of the outdoor HGIS substation are lower than those of outdoor GIS. This is because GIS uses a fully enclosed design, which better isolates the equipment from external environments, reducing the likelihood of faults and eliminating the need for regular maintenance checks. In contrast, for HGIS, the exposed busbars are more susceptible to environmental influences and require periodic maintenance. The proportion of funds occupied and the impact of time costs on the calculation results are shown in Table 5. From Tables 5 and it can be seen that the substation using outdoor GIS devices has a lower capital occupancy rate, indicating that using this device increases the flexibility of annual fund usage. The benefit-cost ratio for outdoor HGIS devices is higher, and the investment recovery time is 4 years shorter than that of outdoor GIS devices, indicating that the outdoor HGIS device project can recover its investment more quickly and has stronger profitability. Since the present value discounting has already been incorporated into the cost calculation, it will not be analyzed separately. Considering that there are no intermediate calculation results for the evaluation of energy efficiency utilization and power loss, they are put in the same table for the convenience of presentation, as shown in Table 6,and the results of qualitative indicators are utilization is better, resulting in a better economic benefit. Additionally, the evaluation of power shortage loss for this device is higher, meaning that during power grid failures, the power shortage duration is shorter, causing less impact on the power grid and demon- From Tables 7 and it can be seen that the reliability index of the outdoor HGIS device is lower. This is because GIS uses a fully enclosed structure, which better isolates the device from the external environment and reduces the likelihood of faults. In contrast, the busbars of HGIS are exposed, making them more susceptible to environmental influences, which results in a slightly lower reliability for outdoor HGIS devices compared to GIS. Additionally, from Tables 7 and it can be seen that the maintenance difficulty score for outdoor HGIS devices is higher, indicating that their maintenance is easier. On the other hand, the maintenance difficulty score for outdoor GIS devices is lower. This is because GIS devices use a fully enclosed design, making disassembly and repair more difficult, which increases the maintenance difficulty. The outdoor HGIS device, with its simpler design, requires less complex maintenance. This is due to the higher integration of outdoor GIS devices, which have higher requirements for installation and construction processes. In particular, in the ultra-high voltage (UHV) field, the insulation design requirements for the device are more stringent, increasing maintenance costs and difficulty. Based on management coordination theory, the final correlation matrix is calculated as: [HGIS, GIS] = [0.9853, 0.7602]. After considering multiple management theory indicators in a coordinated manner, HGIS is selected as the preferred model for the distribution device and feedback is provided to the investors. Based on the actual situation, and the final device selection for the 110 kV voltage level is shown in Table 8. According to LCC theory, the economic cost for each year is calculated based on the LCC cost calculation method. For the missing data points, quadratic function fitting is used to fill in the gaps. The economic costs for each year are calculated separately for both HGIS and GIS devices, and the final LCC fitting curve for HGIS is shown in Fig. 8. By accumulating the economic costs over the life cycle of the HGIS and GIS devices, the total life cycle cost for both devices can be calculated. The final result shows that the total life cycle cost for HGIS is 1.0719 × 106, and for GIS, it is 1.0428 × 106. According to LCC theory, using the total life cycle economic cost to select a substation distribution device is the traditional method. Choosing the device with the lower total life cycle cost is more economical, so the GIS device is selected.",
    "From Table 9, it is clear that the selection results from the comprehensive selection method proposed in this paper and the LCC theory-based selection method are different. The selection results from the proposed method align with the actual engineering re- quirements, while the LCC theory-based results do not. The reasons for this are as follows: The LCC theory only considers the economic factors when selecting the device. Although the purchase cost of HGIS is slightly lower than that of GIS, HGIS requires a larger land area, and its external busbar structure leads to higher land acquisition and installation costs, resulting in a higher initial investment cost and slightly worse overall economic performance. Therefore, according to the LCC theory, the selection result would be the GIS device. However, considering the actual engineering requirements, GIS devices have difficulty in fault location, require a complete power shutdown during maintenance, and have long power outage times, leading to poorer energy efficiency. Given that the economic differences between HGIS and GIS are small, after comprehensive consideration using the management coordination theory, the final In conclusion, in actual engineering practice, as the comprehensive development requirements of substations increase, considering only a single economic indicator is no longer sufficient to meet the existing needs. This paper comprehensively considers multiple factors and proposes a more holistic substation distribution device selection strategy. The final selection of the HGIS device better meets the actual needs of substation comprehensive development. theory. The proposed decision-making approach helps solve the comprehensive selection problem of substation distribution devices, thus meeting the comprehensive development needs of substation operations. In terms of device performance opti- mization and overall effects, management coordination theory systematically balances cost, reliability, and effectiveness by Wenjie Xue: Writing – review & editing, Writing – original draft, Visualization, Validation, Resources, Data curation, Concep- tualization. Chaoyin An: Project administration, Methodology, Investigation. Tengfei Sheng: Project administration, Formal analysis, Data curation. Pingxian Dong: Writing – review & editing, Writing – original draft, Software, Resources. Yuxin Zhai: Writing – review & editing, Writing – original draft, Software, Conceptualization. Jinfeng Zhang: Methodology, Formal analysis, Data curation. Jie- wen Shen: Software, Formal analysis, Data curation."
]