[
    "All issues of this journal are alternatively stored and archived by: the National Library of Thailand, Russian E-library and Index Copernicus library of journals, Poland In view of the academic atmosphere, it sought after a discussion toward the factors that affect the innovation performance of scientific research by lecturers in private universities in Zhengzhou City, Henan Province; hence, an analysis to determine how the academic atmosphere influences and shapes the innovation performance of scientific research by lecturers at private universities in Zhengzhou City, Henan Province. From there, it sought to develop a strategy that would improve such scientific research innovation performance, with measurement based on subsequent educational actions. The study applied a mix of both qualitative and quantitative research. We can formulate a strategy to enhance the scientific innovative performance of lecturers based on these qualitative and quantitative analyses. From the research findings, it can be inferred that this strategy, to some extent, affected the scientific research innovation performance of lecturers at a private university in Zhengzhou City. JEL Classification: I23 - Higher Education; Research Institutions; O31 - Innovation and Invention: Processes and Incentives; I25 - Education and Economic Development; J24 - Human Capital; Skills; Occupational Choice; Labor Productivity; M54 - Personnel Economics: Labor Management; D91 - Micro-Based Behavioral Economics: Role and Effects of Psychological, Emotional, Social, and Cognitive Factors on Decision Making; O32 - Management of Technological Innovation and R&D University lecturers’ perception of the scientific research innovation performance evaluation has gained currency among them. A scientific research innovation performance evaluation was deemed to be fair, effective, and continuous, taking into consideration the multipartite complexity of the game involving universities, lecturers, and reference groups. Fair evaluations of performance were essential for motivation to be applied to lecturers to perform their functions actively (Chang et al., 2024). Research formed a knowledge management culture among universities, lecturers, and research teams due to long-term interaction and communication. University administrators therefore had to worry about the material and spiritual incentives that they would give the faculty members to enhance the scientific nature of scientific research innovation performance evaluation to advance education and teaching work. Simultaneously, they were also to make the necessary efforts to improve the willingness of lecturers to share scientific knowledge and to build a common culture of shared knowledge in higher education institutions. But there were many challenges in practical operations. There were lecturers who needed more awareness of the management of implicit scientific research knowledge and were not willing to share knowledge with their colleagues. These issues needed further exploration by researchers. The private universities have greatly achieved remarkable results (Pan, 2024; Liu, 2024). As China’s higher education became popularized, private universities became an important part of the higher education system of China (Wang, 2024). It is full-time and fully private undergraduate institutions that were allowed to be set up by the Chinese Ministry of Education in Zhengzhou City, Henan Province, in the year 2002, which covered disciplines related to engineering, business, arts, and many others. These private institutions were at the helm of affairs in the private higher education sector in China. Even though the private universities were unrelenting in the development of the teaching faculty, as well as the output of scientific research, there was a lot to be desired in the aspect of scientific research innovation and research standards since an academic atmosphere was greatly diminished. There were significant shortcomings in the tacit scientific knowledge management and a dearth of research that explored the interrelationships between the academic environment, tacit scientific knowledge management, perceived personal knowledge ownership, willingness to share tacit knowledge, and innovation in scientific research work among lecturers. This paper sought to address this gap. What are the factors that influence the scientific research innovation performance of lecturers in private universities in Zhengzhou City, Henan Province, from the perspective of academic atmosphere? What is the current situation of scientific research innovation performance and related influencing factors among lecturers in private universities in Zhengzhou City, Henan What is the mechanism through which the academic atmosphere influences the scientific research innovation performance of lecturers in private universities in Zhengzhou City, Henan Province? What is the strategy for enhancing the scientific research innovation performance of lecturers in private universities in Zhengzhou City, Henan Province? What is the effectiveness of the strategy implemented to boost the scientific research innovation performance of lecturers in private universities in Zhengzhou City, Henan Province? -to explore the factors influencing the scientific research innovation performance of lecturers at private universities in Zhengzhou City, Henan Province, from the perspective of academic atmosphere.",
    "-to describe the current status of scientific research innovation performance and related influencing factors among lecturers at private universities in Zhengzhou City, Henan Province. -to explore the influence mechanism of academic atmosphere on the scientific research innovation performance of lecturers in private universities in Zhengzhou City, Henan Province. -to formulate a strategy for enhancing the scientific research innovation performance of lecturers in private universities in Zhengzhou City, Henan Province. -to validate the effectiveness of the strategy by assessing the scientific research innovation performance of lecturers in private universities in Zhengzhou City, Henan Province. Academic Atmosphere had a bold impact on the outcome and effectiveness of academic programs in any educational institution (Sihnas et al., 2023). The academic atmosphere essentially reflected institutional and group cultures (Yumei et al., 2023). In the context of institutions of higher learning, it deeply carried mainstream values and was important for improving the quality of talent cultivation and promoting sustainable development. The academic atmosphere was part of self-evaluation that needed continuous improvement and was systematically polished as a part of quality assurance (Zhang, 2020). Academic atmosphere is the university's essential nature, foundation, and growth. Management of implicit scientific research knowledge was a subdivision of knowledge management. Due to its extensive coverage and interdisciplinary nature, experts from various fields had some differences in their interpretations and emphases regarding its definition. Knowledge management was mostly a selective process that involved screening, processing, and sharing existing knowledge based on certain priority criteria in order to make each piece of knowledge more valuable. Knowledge management was important for achieving, maintaining, and increasing the competitiveness and sustainability of an organization. Tajpour et al. (2022) pointed out that knowledge management could be defined as the systematic management of an organization's knowledge resources to create value that matched strategic needs. Knowledge management encompassed processes, a strategy, storage systems, and sustainability measures, as well as the transfer, evaluation, creation, and modification of knowledge. Ahmad (2023) pointed out that knowledge management was a function that established, identified, and managed organizational knowledge for long-term benefits. Silva et al. (2024) pointed out that knowledge management was a process in which social actors used information and knowledge to create, strengthen, or innovate the organization's operations, services, or products, generating environmental value. Since perceived personal knowledge ownership primarily resided at the psychological level rather than the legal level, it heavily relied on individuals' subjective feelings and cognitions regarding knowledge ownership. Based on this understanding, Pierce et al. (2003) propose that ownership should be comprehensively understood in both legal and psychological dimensions. The focus of legal ownership of knowledge was on clear ownership issues spelled out in contracts, while the focus of psychological ownership of knowledge was on how people think and feel about owning knowledge. Van Den Hooff & De Ridder (2004) argued that tacit knowledge-sharing willingness involved rational exchanges of implicit knowledge among individuals and the co-creation of new knowledge- a crucial element in transferring knowledge from the individual level to the organizational level. Grubić-Nešić et al. (2015) also thought that willingness to share knowledge was a dynamic process in which people who wanted to share their knowledge had to express their implicit understanding in a way that others could understand and use. Castaneda & Cuellar (2020) argued that knowledge-sharing was the exchange of experience, skills, and tacit and explicit knowledge among employees. Kmieciak (2021) argued that knowledge-sharing enhanced innovation at both the individual and organizational levels. Cao et al. (2024) pointed out that knowledge sharing was a set of behaviors that included receiving and sending task-related and social information from and with others to collaborate in solving problems, generating new ideas, or implementing organizational processes. Scientific research innovation performance was a metric for assessing the efficiency and effectiveness of organizations or individuals in innovation activities. Team scientific research innovation performance, according to West & Sacramento (2012), is when members of a team consciously use relevant theories and methods to change theories and methods, which improves the output of scientific research results for the team or organization. Hagedoorn & Cloodt (2003) looked at innovation performance from two different angles. In the first, they measured innovation outcomes by how many inventions a company put on the market. In the second, they looked at innovation achievements throughout the whole process, from coming up with ideas to making products and putting them on the market.",
    "The study of academic atmosphere primarily drew on the person-environment fit theory, which was introduced into management by De Cooman & Vleugels (2022). This theory focused not only on individual or environmental characteristics but also emphasized the influence of the relationship between the two on individual attitudes, behaviors, and more. Person-environment fit was viewed as a multidimensional and complex concept, primarily referring to the adaptability when individuals matched well with the characteristics of their work environment (Chen et al., 2022). And existing research defined it mainly from three directions: dimension theory, connotation theory, and comprehensive theory. For the academic atmosphere explored in this study, the person-environment fit theory had important applicability. University administrators could convey positive values within the organization to lecturers through various means, such as socialization, thereby enhancing lecturers' identification with organizational values. This approach helped to strengthen lecturers' perception of individual-organization fit, which in turn enhanced the learning atmosphere of the entire organization. Motivation theory was used to guide the study of how people think they own their own knowledge, how they handle their implicit scientific research knowledge, and how willing they are to share their knowledge. This theory integrates management psychology and behavioral science and is also known as expectancy theory. Motivation theory originated in the 1920s and 1930s and was a core concept in organizational behavior and management. It was based on the diverse needs of humans as a foundation for motivation. Setting targeted goals stimulated people's motivation to work towards those goals, guiding positive behavior and ultimately achieving the goal of enhancing work enthusiasm. Based on differences in research levels, motivation theory could be divided into three types: content-based, behavior modification, and process-based. At the same time, motivation theory fell into three categories: behavioral foundation theory, process motivation theory, and behavior reinforcement theory (Jiang & Zhang, 2024). Motivation theory could effectively promote the transformation of good motivation into practical action for motivated individuals. Choosing the appropriate timing to provide an incentive for lecturers' scientific research work could stimulate their upward ambition and encourage them to put their ideas into practice. This helped lecturers improve their ability to manage their unconscious scientific research knowledge and made them more willing to share tacit knowledge after admitting that they thought they owned it. The performance of innovation in scientific research mainly used the theory of social exchange as one of the principal theories that explained the behaviors of people. In the course of the social exchange, there developed a set of interrelated communications, all premised on the actions of others. Such discourse could have encompassed giving and receiving behavior, the allocation of tangible or intangible resources, as well as economic and social results. The continuous dialogue or positive behavior initiated between the organization and its employees could be seen as a form of social exchange, where the organization expected corresponding returns based on how it treated its employees. Therefore, the responsibility of employees lay in reciprocating a favorable work environment and attractive \"financial and non- financial\" benefits by maintaining a positive attitude; meanwhile, employees also needed to make corresponding changes (Thomas & Gupta, 2021). Social exchange theory had a certain applicability in exploring the issue of scientific research innovation performance in this study. The study focused on the scientific research innovation performance management mechanism for lecturers in private universities in Zhengzhou City, Henan Province. The focus of social exchange theory was on the \"provision\" and \"acceptance\" of benefits between people and groups, with an emphasis on the sharing of resources and meeting each other's needs. These exchanged resources encompassed various aspects, such as emotions, time, technology, knowledge, information, and status. In the direct exchange relationship between lecturers at private universities in Zhengzhou City, Henan Province, the universities set up good performance management systems for scientific research innovation in order to get lecturers to work hard and produce high-quality scientific research results. This study employed a qualitative and quantitative research approach. Through a questionnaire survey on the scientific research innovation performance of lecturers in private universities in Zhengzhou City, Henan Province, the research analyzed and compared the scientific research innovation performance management mechanisms under different backgrounds. Based on this data, research conclusions were drawn. We used descriptive analysis, frequency, percentage, mean, and standard deviation to find out how well lecturers at private universities in Zhengzhou City, Henan Province, did at coming up with new ideas for scientific research. Subsequently, the t-test was applied to enhance the effectiveness of a scientific research innovation performance management mechanism program for lecturers in private universities in Zhengzhou City, Henan Province.",
    "This study focused on examining the scientific research innovation performance management mechanism among lecturers in private universities in Zhengzhou City, Henan Province. The research population primarily involved lecturers from these institutions. To achieve the research objectives, a stratified random sampling method was utilized to survey five private universities: Zhengzhou Huanghe Science and Technology College, Zhengzhou Sias University, Zhengzhou Business University, Zhengzhou Technology and Business University, and Zhengzhou University of Economics and Business (in Tab. 1). Online surveys offered advantages such as being inexpensive, convenient, promoting anonymity, and providing real-time access (Beck, 2024). It was also said that online surveys were widely used because they had a number of built-in benefits, such as lower research costs, shorter implementation times, fewer transcription errors, and easier analysis (Wu et al., 2022). Therefore, the researcher primarily utilized online surveys for data collection. There were five measurement tools in the questionnaire: the academic atmosphere scale, the perceived personal knowledge ownership scale, the tacit knowledge-sharing willingness scale, and the scientific research innovation performance scale. The questionnaire was mostly made up of demographic questions. This study was selected from October 1st to 6th, 2024, to conduct a survey at Zhengzhou Huanghe Science and Technology College, Zhengzhou Sias University, Zhengzhou Business University, Zhengzhou Technology and Business University, and Zhengzhou University of Economics and Business, all located in Zhengzhou City, Henan Province. The study targeted lecturers from these five private universities as the research subjects. The distribution and collection of survey questionnaires took place within these five private universities. The directors of teaching and research offices and program directors at each institution were primarily responsible for distributing the questionnaires. After the person in charge explained the content and completion requirements, the lecturers filled out the questionnaires. We distributed a total of 554 questionnaires, collected 554 valid ones, and achieved a 100% response rate. The researchers manually exported the corrected questionnaire data and then imported it into PLS for data analysis and processing. As a good analytical tool for testing research hypotheses, PLS-SEM used the data to show the inner relationships between the data and the research hypotheses, which made the hypotheses more likely to be true. In this study, a structural equation model was carefully built and tested to find out what factors affect the performance of scientific research innovation among private university lecturers in Zhengzhou, Henan province, and how those factors relate to each other. Researchers also looked closely at the data's distributional properties, including the coefficients of skewness and kurtosis, to see if they meet the requirements of a normally distributed dataset. This set of intensive steps in research and analysis has gone a long way in helping to articulate the phenomenon of scientific research innovation performance among lecturers at private universities. It will also serve as a useful guide for work in related areas. After much thought and review, the researcher chose to use the \"Item Objective Congruence\" method to check if the questions in the survey were valid. In this method, a team of professional experts looks carefully at each question in the survey and gives it a score between -1 and +1, which helps measure exactly how well that question matches the goal. In terms of reliability, under usual standards, Cronbach's alpha should be over 0.7, and composite reliability should be over 0.6 (Chin, 1998; Fornell & Larcker, 1981). (1) Academic team: this strategy formed interdisciplinary research groups consisting of four to five members based on the common interest and background of the lecturers. The focus was to gain support for the institutionalization of interdisciplinary research as a norm, allowing every lecturer to belong to at least one group. (2) Academic resources: the university held training sessions teaching how to make use of the databases and the tools for managing veracity, enhancing Zhengzhou's educational resources by improving the utilization of resources. An output of this session was a list of agreed lectures for a later execution to be conducted by the university that would teach lecturers how to improve their research capabilities. (3) Academic exchange: the university allowed lecturers to share academic insights through WeChat and Ding Talk communities. It also created monthly themed discussions, with more intriguing speakers receiving extra annual points, creating the flow of knowledge and making academic life more vigorous.",
    "(1) Create implicit knowledge: organize lecture delivery by investigators, where experts were brought to share research findings and skills in managing knowledge with an interactive session for an exchange. (2) Organize implicit knowledge: the web repositories should be scaled up for storing research logs, workshop outcomes, and lecture videos, plus someone in charge of keeping that information up to date and accurate. (3) Share implicit knowledge: people who take part in lectures can be encouraged to build academic communities on social networking sites, where they can share research updates and new ideas. This helps the flow of knowledge through connections. (4) Apply implicit knowledge: an annual series of exhibitions should be instituted to display the research results of the informants (papers, patents, products) to stimulate implicit knowledge dissemination and application. We are setting up a loop for feedback, a way to make talking and sharing ideas among teachers better. We asked teachers to provide their thoughts and ideas after sharing their knowledge. Activity one: Zhengzhou Technology and Business University conducted a resource utilization lecture on the 14th of October 2024 for 20 teaching staff. We prepared the content, instructor, interactives, and materials for the session, as well as the platform that would host this activity. We conducted screen demonstrations during the lecture, followed by Q&A, sent electronic materials, and created online communities for further sharing. Activity two comprised expert consultation toward current trends in available and lecturer needs, which took place on October 21, 2024. It involved 20 lecturers. To ensure content depth and breadth, there were expert consultations. A Q&A session encouraged participation as well as discussions. Being recorded, a summary of the event was done and disseminated to make the impact wider and also to arouse interest among lecturers on matters regarding academic interactions. Activity 3 covered an online feedback channel that ran from October 16th to December 8th, 2024. This allowed lecturers to key in their views and suggestions. The system was designed to accept feedback on a biweekly basis. Feedback information was taken as input data, statistically analyzed, and used in fine-tuning a knowledge-sharing strategy to ensure that it would fit the needs of the lecturers. Activity four: for improving innovation in research, industry-academia collaboration, and the translation of research results, 20 faculty received off-campus hands-on training from October 28 to November 26, 2024. On November 26th, 2024, we held a sharing session where we documented, presented, and discussed the experiences. Before the strategy implementation, a pre-survey was conducted among 20 lecturers at Zhengzhou Technology and Business University. After the strategy implementation, the same 20 lecturers were surveyed again using a post-implementation questionnaire. Paired t-tests were used to analyze the differences in the data. As shown in Tab. 2, all four pairs of data exhibited significant differences (p<0.05). Academic atmosphere: A significant difference at the 0.01 level was found (t=42.135, p<0.001). The average value increased from 3.09 before to 6.36 after implementation. Management of implicit scientific research knowledge: A significant difference at the 0.01 level was observed (t=37.306, p<0.001). The average value increased from 2.95 before to 6.32 after implementation. Tacit knowledge-sharing willingness: A significant difference at the 0.01 level was found (t=24.496, p<0.001). The average value increased from 2.68 before to 6.30 after implementation. Scientific research innovation performance: A significant difference at the 0.01 level was observed (t=27.636, p<0.001). The average value increased from 2.92 before to 6.31 after implementation. Note1: AA-Academic Atmosphere, MOISRK-Management of Implicit Scientific Research Knowledge, TK-SW- Tacit Knowledge-Sharing Willingness, SRIP-Scientific Research Innovation Performance Note2: * p-value <0.05; ** p-value <0.01; *** p-value<0.001 This study, therefore, attempts to explore and examine the critical determinants of the innovation performance of scientific research conducted by lecturers working in private universities located within Zhengzhou City, Henan Province. Using the academic environment as the main independent variable, this study will also check if managing implicit scientific research knowledge, being willing to share tacit knowledge, and feeling like you own your own knowledge have any mediating effects. This will enable policy formulation aimed at enhancing the innovation capabilities of lecturers in an actual research environment in Zhengzhou City. The results served to guide further studies and provided an improved conceptual and theoretical framework, in both academic and practical terms, for assessing changes in the research and development activities of lecturers.",
    "University management should, as a priority, make a constant effort in all practices to improve and maintain a lively academic environment by setting up research infrastructure, stimulating interdisciplinary contacts, and offering professional development opportunities. Therefore, knowledge management systems that capture and codify tacit knowledge are needed. The development of a trustful climate, accompanied by rewards for sharing knowledge, would increase the willingness of individuals to share tacit knowledge. Clear individual attribution and IP rights protection would also improve the perception of ownership of knowledge by lecturers. Sustainable research, for the long term, should be a strategic focus area together with continuous funding and partnerships that bring about relevance and impact. That being said, more research can be done to find out how the academic environment affects the results of new research and how teachers can better manage their own unspoken knowledge. They ought to employ multiple sources of data and use sophisticated statistical applications to raise precision. Cross-regional and cross-institutional research can be conducted to compare and contrast differences in innovation output. In addition, a long-term follow-up tracking study is essential to assess the sustainability of research innovation."
]