[
    "All issues of this journal are alternatively stored and archived by: the National Library of Thailand, Russian E-library and Index Copernicus library of journals, Poland This study examined the effects of perceived boredom, perceived dissatisfaction, perceived usefulness, experiential motivation, and switching cost on student clubs switching intention at Zhengzhou Technology and Business University, in China, with the aim of proposing effective strategies to reduce student clubs switching intent. The study mainly used numbers and statistics, collecting data from 1,458 students involved in student clubs out of 1,608 questionnaires sent out. This data was analyzed using methods like descriptive analysis, correlation analysis, and structural equation modeling to understand how the different factors are related. The study found that the key factors influencing student clubs' switching intentions include perceived boredom, perceived dissatisfaction, perceived usefulness, experiential motivation, and switching cost. Experts finally developed and validated the REES strategy, confirming its effectiveness in reducing student club switch intention. Doctor of Education Program in Educational Administration, Graduate School, Stamford International University, Bangkok, Thailand Research interests: educational management, education services, teaching methodology With the advent of the world knowledge economy, the role of talents in international competition and social development is becoming more and more prominent, and the social demand for talents is not only the mastery of scientific knowledge and professional skills, but also the possession of a correct worldview, outlook on life and values, and the acquisition of positive and comprehensive development of human beings, so that they can make useful contributions to the progress of the society, the country and the mankind. The higher education student organization directly reflects the university's spirit of \"independence, openness, and freedom\" and serves as an important carrier of campus culture, fulfilling the function of self-management. Self-education, self-service, and self-development are integral aspects of social indoctrination. Western student clubs appeared as early as in the 18th century, along with the development of the new century, the construction of student clubs is highly valued by colleges and universities, and colleges and universities actively encourage the construction of organizations. As a place of higher education, the function of the university is not only limited to the exploration and pursuit, defense, and dissemination of truth and knowledge, but also to the cultivation of students’ personality accomplishments, cultivating talents for society and the country, and \"bringing social harmony\" (Pascarella & Terenzini, 2005). Since China’s reform and opening up, the education system in colleges and universities has undergone significant changes; university education has transitioned from being categorized as \"elite\" and \"popular\" to a focus on “popularization”. Additionally, both the enrollment scale of these institutions and their overall number have been steadily increasing. The enrollment scale of colleges and universities has been expanding, and the number of colleges and universities has been increasing. At the same time, student clubs in colleges and universities have also developed rapidly, with the number of student clubs increasing and the number of students participating in them growing. By 2022, the Blue Book on the Development of Student Clubs in Beijing Universities reported that the total number of student clubs in Beijing universities had reached 4,215, and over 80% of university students had participated in various activities organized by these clubs. Prioritizing the development of community activities in colleges and universities, increasing their engagement, and improving their educational impact are crucial starting points for reforming higher education in Henan Province. Each university has different types of student associations, but from the current situation, the scale and quality of the student associations are quite different, the members of the associations have a certain fluidity, and even some of the associations exist in name only, and do not play the due effect of education. In this specific regional context, the research on perceived boredom (PB), perceived dissatisfaction (PD), perceived usefulness (PU), experiential motivation (EM), switching cost (SC), and the interaction with student clubs' switching intentions (SOSI) has important practical and theoretical value. The research in ZTBU can not only guide local community development and education reform but also provide valuable insights and enlightenment for other similar regions and universities. (2) To explore the effect of perceived boredom (PB), perceived dissatisfaction (PD), perceived usefulness (PU), experiential motivation (EM) and switching cost (SC) on student clubs switching intention (SOSI).",
    "Boredom is an emotional perception. Understanding what perceived boredom means is complicated and requires looking at different theories, including psychodynamic, existential, arousal, and cognitive theories (Bench & Lench, 2013; Raffaelli et al., 2018). When people are not successful in focusing their attention on activities that are aligned with their desired goals, the psycho-emotional indicator at that point is defined as perceived boredom (Westgate & Wilson, 2018). Although there are various definitions of perceived boredom, researchers agree that perceived boredom is a transient, unpleasant emotional experience that indicates an individual’s failure to engage in a desirable situation; the individual wants to get rid of this perception, and a range of behavioral and social outcomes accompany it. In the life of college student organizations, students may also attempt to seek alternative organizations for obtaining pleasurable stimulation when the pleasure benefits of the original organization are reduced (Line et al., 2016). Thus, perceived boredom often triggers substitution of existing clubs, as well as boredom with existing clubs as an emotional cause of psychological ageing, and when students perceive disinterest, it usually leads to switching to existing clubs or club activities. Dissatisfaction, the opposite of satisfaction, should better reflect the psychology of users who don't use it often. Anderson & Sullivan (1993) defined satisfaction as the positive evaluation and positive emotions of a user after using a particular product or service, while the negative evaluation or negative emotions about this product were defined as dissatisfaction. In contrast to the focus on satisfaction and continued use in technology acceptance studies, dissatisfaction is often the first step in a user’s willingness to transfer. Some studies have indicated that dissatisfaction has an impact on user transfer when users realize the attractiveness of alternatives. Huang & Yan (2019) showed in his research that satisfaction is an evaluation of the subjective feelings a user acquires after experiencing a specific product or service, typically based on certain standards or expectations regarding the quality, functionality, price, and other evaluative aspects. In this research, perceived fun dissatisfaction refers to students’ overall emotional feelings, evaluations, and inner experience of their student organization. It is influenced not only by the subjective factors of students’ individual professional backgrounds and learning goals, but also by the objective factors of interpersonal relations and knowledge supply, which contribute to an overall emotional perspective. If the user experience provided by the original student organization does not meet their expectations, students may become dissatisfied and choose to join other organizations. The positive and significant impact of dissatisfaction on conversion intention has been confirmed by research on user transfer behavior. Dissatisfaction is usually the beginning of students’ transfer behavior, and it is the main thrust factor affecting their conversion intention. Perceived usefulness generally refers to the extent to which external factors affect individuals’ perceptions and attitudes towards things, which in turn affects their switch intention. It can be seen that perceived usefulness will lead to intrinsic motivation, the stronger the perceived usefulness of a thing or behavior, the more likely the individual will adopt the behavior or take positive action to achieve the goal. At the same time, perceived usefulness is one of the most important pull factors in the PPM model. Perceived usefulness is an important concept in the theory of technology acceptance model and is a determinant of an individual’s use of a system, specifically the extent to which an individual believes that the use of a system or technology will increase his or her learning and job performance, that is, the extent to which he or she believes that the use of the system or technology will improve his or her learning and work performance. “Perceived usefulness” can be defined as the consumer’s belief that using water bottles made of recyclable plastic will be good for the environment. The higher the consumer’s perceived usefulness of an environmentally friendly product, the higher his or her purchase intention for that product. Perceived usefulness is “the extent to which a person believes that using a particular system will improve his or her job performance”. Perceived usefulness explains the users’ perception that the interactive mobile map innovation will improve their task performance in terms of ease of location finding. Users can see the value of the innovation in performing their tasks and the extent to which mobile maps are useful in reducing the time it takes to get where they are going, where they are or the distance from one location to another.",
    "Experiential motivation can also stimulate people’s mental and physical activities, making them move toward their goals. It is an important part of human behavior and psychological state (Dann, 1981). Xi (1997) pointed out in his work that motivation is a psychological process and a subjective factor that usually inspires the generation and maintenance of individual behaviors through personal interests, ideals, or desires. Several scholars study the consumption habits of customers in the tourism industry and find a correlation between their internal needs and their travel behavior. Gan (2011) showed that travel demands experiential motivation referring to the motivation to promote people to produce travel behaviors and make them in a positive state to achieve certain goals. Experiential motivation frequently manifests as desires, intentions, thoughts, beliefs, and so on. Need refers to the “desire” and “demand” for tangible things based on specific living conditions; tourism demand arises from travel experiential motivation as well as the interplay between tourism demand and experiential motivation. The internal driving force of promoting tourists to carry out tourism activities comes from the experiential motivation stimulated by tourism demand. Experiential motivation is the most critical factor for understanding tourist behavior and is widely used in research related to leisure vacations, decision-making, market segmentation, destination development, and post-disaster reconstruction. Experiential motivation is highly significant in the study of human and animal behavior. Bao (2005) and others pointed out that motivation refers to the initiation, continuation, or termination of a behavior by humans or animals at a specific time. The motivational state is typically understood as an internal force that creates a tendency to engage in goal-oriented behavior, and there exists competition among different motivational states, with the winner of this competition playing a decisive role. Switching cost, which originated from economic studies earlier, refers to the one-time cost that customers need to pay when switching between consumer goods or service providers (Burnham.et al., 2003). However, with the continuous expansion of customer satisfaction analysis, the concept of switching costs has gradually entered many fields such as management. In the research of user loyalty, Dick & Basu (1994) proposed that switching cost refer to the cost incurred by customers during the switching process, including time cost, money cost and psychological cost. It is mainly defined as the potential risks or possible losses perceived by customers when switching operators, such as financial losses, performance losses, social losses, psychological losses, safety losses, etc. Kim et al. (2019) believe that cost refers to the difficulties that customers who are dissatisfied with the existing services may encounter when switching to another supplier, which is mainly manifested in the economic, social and psychological burdens felt by customers when switching to a new supplier. Hsieh et al. (2012) believed that switching costs refer to the time and energy spent by users of blogs when transitioning to social networking service (SNS) platforms. Conversion intention, a crucial concept in behavioral research, serves as a tool to comprehend and forecast individuals' conversion behavior in various scenarios. It refers to the tendency of an individual to change the current choice in a given situation due to dissatisfaction with the existing service, product, organization, etc., or increased attraction to alternative options. The concept was initially mainly used in marketing and consumer behavior research, and then expanded to other fields, such as education, health services, information technology, etc. Experts and scholars from various fields-initiated research and expansion at different levels. The willingness to switch refers to the tendency of individuals to decide to change service providers due to dissatisfaction with current services or attractiveness to alternative services (Bansal et al., 2005). Many factors, including satisfaction, conversion cost, attractiveness of alternative options, and social influence, influence the multi-dimensional concept of switching intention. This research was conducted at Zhengzhou Technology Business University (ZTBU), and its main target is students who participate in student clubs, including ordinary members and student leaders. The research employs a convenient sampling method. Based on the sample size student samples were selected from each selected school, ensuring that a sufficient number of samples were obtained from different schools and student clubs, the student population of ZTBU was 2966. Then, the total sample of students from the student clubs of 8 schools in ZTBU are selected in this study was 1458. The researcher began distributing the questionnaires from August to September 2024. All collected questionnaire data were meticulously revised, exported, and verified, and then imported into Smart PLS and SPSS for data analysis and processing.",
    "There are two parts to the questionnaire. The first part mainly asks for background information from the respondents, such as gender, grade, position, school, and learning level, to facilitate systematic analysis. The second part consists of the items for each variable. On the basis of consulting a large number of literatures, the item of each variable is determined, and the item of each variable is from the authoritative literature. After front-and- expert verification, any semantic or phrasing in the questionnaire that may cause confusion or misunderstanding is corrected, making the presentation of the questionnaire items more accurate and easier to understand. At this point, the preliminary research questionnaire design of this study was completed, and the main questionnaire included 30 items: perceived boredom (PB) had 6 items, perceived dissatisfaction (PD) had 4 items, perceived usefulness (PU) had 4 items, experiential motivation (EM) had 5 items, switching cost (SC) had 7 items, and student clubs switching intention (SOSI) had 4 items. The perceived attitudes of all students toward each factor were measured using a 5-point Likert scale, and respondents were asked to rate the degree to which they agreed to be asked about the item. Each question is rated from “strongly disagree” to “agree” on a scale of 1 to 5, where 1 means “strongly disagree”, 2 means “relatively disagree”, 3 means “general”, 4 means “relatively agree”, and 5 means “strongly agree”. A total of 40 questionnaires were collected in the pilot test, and the analysis shows that Cronbach’s alpha is 0.907, with each part scoring above 0.7, which means the questionnaires are reliable and meet the standards. The KMO values for the variables are all above 0.7, showing that the data is very suitable for factor analysis, and the questions in the questionnaire have good structural validity, making the data analysis more effective. The KMO values for all variables exceed 0.7, indicating that the variable scale data are highly suitable for factor analysis. Additionally, the design questions of the questionnaire demonstrate relatively good structural validity, making the data analysis of the questionnaire results more effective. For Research Objective One, we aim to measure the current level of switching intention (SOSI) among college student clubs at ZTBU. To achieve this objective, we statistically analyzed the current status of student clubs switching intention at ZTBU using quantitative methods. By calculating the mean value and standard deviation for each question, researchers can gain insights into the tendency of responses to concentrate or vary, providing a comprehensive picture of the current state of student clubs' switching intentions. The collection of a large sample size (n=1458) provides a reliable basis and foundation for statistical analysis. The mean score of 3.75 indicates that respondents’ willingness to switch organizations is more prevalent. For Research Objective Two, the aim is to explore how perceived boredom, perceived dissatisfaction, perceived usefulness, experiential motivation, and switching costs affect students' intentions to switch clubs. To accomplish this goal, we used PLS statistical software to conduct a series of data analyses and develop a structural equation model (SEM). If the T-value exceeds 1.96 and the p-value is less than 0.05, then the positive correlation is significant. A negative path coefficient indicates a negative correlation. According to the above Tab. 2, the path analysis and significance level test leads to the following conclusions. The path coefficient between perceived boredom (PB) and student clubs switching intention (SOSI) is 0.258, with a t-statistic of 13.379 and a p-value of 0.000, indicating a positive and significant correlation. This figure means that the more pronounced boredom students perceive in their current organization, the significantly higher their willingness to switch organizations. The relationship between perceived dissatisfaction (PD) and the intention to switch student clubs (SOSI) is 0.057, with a t-statistic of 2.798 and a p-value of 0.005, indicating a strong positive connection. This means that as students perceive greater dissatisfaction with their current organization, their willingness to switch increases significantly. The path coefficient of perceived usefulness (PU) and student club switching intention (SOSI) is 0.046, with a t-statistic of 4.386 and a p-value of 0.000, which is positive and significant. This finding implies that students’ willingness to switch may increase when their perceived usefulness of the new organization is higher.",
    "The path coefficient of experiential motivation (EM) and student clubs switching intention (SOSI) is 0.203, while the t-statistic is 11.579 and the p-value is 0.000; these values indicate a positive and significant correlation. This data means that when students have a higher sense of pleasure and belong to the new organization, their willingness to switch may increase. The path coefficient of switching cost (SC) and student club switching intention (SOSI) is -0.44, with a t-statistic of 20.151 and a p-value of 0.000, which is negatively and significantly correlated. This statistic means that as students perceive higher assessment costs, learning costs and emotional costs, their willingness to switch decreases significantly. The above correlation analysis supports all the proposed hypotheses. The positive correlations between the variables indicate that the more pronounced the students’ perceived boredom and perceived dissatisfaction with the current organization, the stronger the students’ willingness to switch; and the more the students’ perceived usefulness and pleasure and sense of belonging to the new organization, the stronger the students’ desire to switch. Negative correlations between variables indicate that assessment costs, learning costs, and emotional costs significantly inhibit students’ willingness to switch. These findings provide important insights into the development of relevant targeted measures. In summary, structural equation modeling's (SEM) analysis allows us to gain a comprehensive understanding of the relationships between variables, including direct and indirect effects. The following conclusion can be drawn by combining the results of the reliability, convergent validity, discriminant validity, and through-traffic analyses. The measurement instrument has high reliability and validity and provides a robust assessment of multiple dimensions of students’ organizational switching intentions, with perceived boredom (PB), perceived dissatisfaction (PD), perceived usefulness (PU), experiential motivation (EM), and switching cost (SC) directly influencing student club switching intentions (SOSI). The results of the study provide a strong basis for school authorities to better understand why students develop organizational switching intentions and how to develop targeted measures. Step 1: The researcher thoroughly studied the analysis results and developed a strategy model based on the quantitative and qualitative analysis, aimed at reducing student clubs switching intention. Step 2: Nine experts with extensive research and management experience in the field of educational management reviewed and validated the developed model. Step 3: After the model was validated, the researcher proposed corresponding strategies and specific measures based on the model and implemented these strategies and measures in ZTBU’s School of Engineering. Step 4: To implement these strategies and measures, the researchers have adopted training courses, seminars, and sharing sessions to enhance students’ satisfaction and sense of gain and reduce their willingness to undergo organizational transformation. Through these steps, the researcher systematically proposed and implemented strategies to reduce student clubs’ switching intentions, ensuring the achievement of the research objective. This study explored the significant effects of perceived boredom, perceived dissatisfaction, perceived usefulness, experiential motivation, and switching costs on student clubs' switching intentions using structural equation modeling (SEM). The results of path analysis and significance test indicated that perceived boredom, perceived dissatisfaction, perceived usefulness, experiential motivation and switching cost can directly affect student clubs switching intentions. The results of this study are consistent in most aspects with the relevant theories and previous findings, indicating that perceived boredom, perceived dissatisfaction, perceived usefulness, experiential motivation and switching cost have significant effects on student clubs switching intentions. However, there are some differences, which may be related to factors such as school support, regional differences, individual student differences, and the effectiveness of specific measures. Perceived boredom directly affects willingness to switch, supporting related studies by Maier et al. (2021) and Markey et al. (2014). However, schools with greater support in terms of financial investment, venue facilities, and instructor staffing will effectively reduce student clubs’ switching intentions through colorful reunion activities. Perceived dissatisfaction directly affects switching intentions, which is consistent with Cheng et al. (2019). Perceived usefulness directly affects switching intention, supporting the findings of Hsieh et al. (2012). However, the degree of perceived usefulness is a judgment based on a comparison between the current organization and the new organization. If the current organization meets students’ needs for professional development and networking resources, it reduces their perceived usefulness of the new organization; therefore, the current organization can address this issue by enhancing its organizational attractiveness.",
    "Creating a distinctive organizational culture and a sound incentive mechanism can effectively stimulate students’ experiential motivation, which in turn reduces their willingness to switch. Switching cost directly affects switching intention, which is consistent with the findings of numerous previous studies. As student satisfaction in the current organization increases, so does the switching cost, which in turn reduces switching intention; therefore, enhancing both the attractiveness and satisfaction of the current organization can effectively discourage students from switching. The detailed analyses above clearly demonstrate how each variable affects student clubs’ switching intentions and how these effects align with relevant theories and research findings. Based on the results of these analyses, schools can take targeted measures, such as enriching activity carriers, strengthening knowledge empowerment, building a distinctive culture, reinforcing school support, and improving incentive mechanisms, to reduce student clubs’ switching intentions. To propose and implement strategies to reduce student clubs’ switching intentions, the researcher developed the REES strategy based on the results of the quantitative analysis. The strategy includes: R: Reduce Perceived Boredom: designing diversified activity programs and increasing the frequency of activities to reduce students’ boredom. It is crucial to foster a warm and harmonious team atmosphere to facilitate adequate and effective communication among E: Enhancing Satisfaction: strengthen the effective linkage with internal and external resources to obtain more resource support and inject more vitality into the organization. Encourage students to give full play to their initiative to enhance their sense of participation and responsibility. E: Enhancing Organizational Attractiveness: empower students with the knowledge and skills they need to meet their practical requirements. Carry out leadership training and effectively organize activities to enhance the overall atmosphere of the organization. S: Stimulate Experiential Motivation: create a unique organizational culture to enhance students’ sense of belonging and pride and stimulate their motivation for participation and loyalty. Regularly recognize outstanding students and inspire them to look up to role models. The experts have confirmed that the REES strategy works, and its related part greatly lowers students' desire to switch, which agrees with a study by Hsieh et al. (2012) that shows how important it is for the organization to be useful in keeping students from switching. Strengthening the knowledge empowerment of students is a key factor, and through activities such as skills training and career planning lectures, students can be helped to gain"
]