[
    "As the world’s most populous country, China’s energy poverty reduction achievements directly impact the global energy poverty reduction process. Analyzing energy poverty in China is therefore critical to consolidating the results of poverty eradication, eliminating relative poverty, and improving the social welfare of residents. However, prior research neither considered the applicability of existing energy poverty indicators to the current Chinese reality, nor the spatiotemporal disparities of energy poverty using micro-level data. To study the dynamics of energy poverty in China at the household level, a new multidi- mensional energy poverty index is constructed with seven dimensions using multiple cor- respondence analysis methods. Furthermore, provincial disparities and characteristics of energy poverty are compared using a spatial autocorrelation analysis method. The findings show that energy poverty has improved in China from 2012 to 2018, but its incidence and intensity remain high. Moreover, significant regional differences in energy poverty exist between different regions of China. High levels of energy poverty are mainly concentrated in the western and northeastern regions (especially in rural areas), and the urban—rural gap shows a similar pattern. The results obtained from spatial autocorrelation analysis demon- strate that China’s energy poverty exhibits significant spatial clustering characteristics. Fur- ther, the results of standard deviation ellipse show that during the study period, the center of gravity of energy poverty in China was in Henan province and gradually shifted to the northwest. These findings help policymakers to formulate specific energy poverty reduc- tion policies for various groups affected by energy poverty. Energy poverty is attracting increasing scholarly attention, and the field has developed rapidly in recent years because energy poverty has various adverse effects on human health and social well-being (Kumar, 2020; Lin & Wang, 2020; Ozughalu & Ogwumike, 2018). Although several countries and international organizations have made significant progress in alleviating energy poverty and improving the welfare of residents, energy poverty remains a severe problem of modern society. The International Energy Agency (IEA) projected in 2020 that about 660 million people will not have access to elec- tricity in 2030, most of whom live in sub-Saharan Africa and developing countries of Asia (IEA, 2020). Worldwide, this will leave around 2.4 billion people without access to clean cooking (IEA, 2020). Also, the ongoing COVID-19 crisis is severely impeding progress toward achieving United Nations sustainable development goals. It also ren- dered more than 110 million people with electricity connections unable to afford basic electricity services at the end of 2020. These developments push many households back to using traditional and often inefficient fuels for lighting and cooking (IEA, 2020). Compared to the Global North, in the Global South, energy poverty is more com- plicated and severe because of the lower affordability and accessibility of energy ser- vices (Zhang et al., 2019). While China—the largest developing country in the world— achieved 100% electrification in 2015 (Liao et al., 2015; NEA, 2015) and eliminated absolute poverty in 2020, households are still affected by energy poverty (Z ). Many ouseholds cannot access modern energy for cooking and heating with more than 400 million Chinese still use traditional biomass and coal for cooking. 48.98% of house- olds live in a state of energy poverty (Zhang et al., 2019). Chang et al. (2020) pointed out that rural energy poverty in China reaches 31.56%, indicating that rural energy pov- erty is still severe. According to Lin and Wang (2020), the rate of energy poverty in China was 18.9% in 2014, and nearly 46% of households affected by energy poverty ave insufficient modern energy consumption and are sensitive to changes in energy tariffs. Their level of electricity consumption is below basic demand. Furthermore, because of the energy-development disparity among regions (Wang et al., 2017) and dif- ferences in geographical locations, climate conditions, and resource endowments (Lin & Wang, 2020), China’s energy poverty has distinctive characteristics that compared to other countries. The measurement of energy poverty have been widely discussed (Barnes et al., 2011; Nathan & Hari, 2020; Papada & Kaliampakos, 2016). Among the commonly used meas- urement indices, the multidimensional energy poverty index (MEPI) is more robust, cred- ible, and comprehensive than other energy poverty metrics (Sokotowski et al., 2020). Importantly, it can capture both the incidence and extent of energy poverty (Adusah-Poku & Takeuchi, 2019). However, to our knowledge, few studies have used MEPI to assess energy poverty in China. Examples are Lin and Wang (2020), who studied energy poverty from the perspective of electricity consumption and Tang and Liao (2014) who studied solid fuel use without considering more complex and modern energy services (e.g., enter- tainment and education). Zhang et al. (2019) used equal weight to construct a composite index for measuring energy poverty in China, while ignoring the differences between indi- cators. Consequently, energy poverty is easily exaggerated (Khanna et al., 2019). In addi- tion, these studies have not measured the incidence and intensity of energy poverty based on an improved MEPI because certain indicators (i.e., electricity access) are no longer suit- able for the current reality in China (Wang et al., 2015).",
    "This paper measures the levels and spatial disparities of multidimensional energy poverty in China. Existing measurement indicators of energy poverty are reviewed in an attempt to develop a new composite index for measuring multidimensional energy pov- erty, while also considering the suitability and accessibility of existing indicators. Fur- thermore, the dynamics, intensity, and incidence of multidimensional energy poverty are assessed using household-level datasets, which is a valuable extension to existing energy poverty studies. Finally, the spatiotemporal distribution characteristics of energy poverty are explored, often overlooked in existing energy poverty research. The main contributions of this research are as follows. Firstly, the study builds a new MEPI for China by considering seven dimensions at the household level. This approach captures the availability, affordability, and accessibility of modern energy services. Sec- ondly, an objective evaluation method of multiple correspondence analysis is employed to weight energy poverty indicators. Thirdly, using a nationally representative household sur- vey data from 2012-2018, the spatiotemporal characteristics of energy poverty in China are explored. The findings of this work will help the government to formulate specific energy poverty reduction policies for different groups affected by energy poverty. The remaining sections of this paper are organized as follows: Sect. 2 reviews the rel- evant concepts of energy poverty and discusses different indicators and methodologies for analyzing energy poverty. Section 3 describes the data sources and methodological approach used in this study. The process of explaining and discussing the results is shown in Sect. 4. Section 5 concludes and provides policy implications. Energy poverty is a multidimensional concept (Mendoza et al., 2019; Okushima, 2019). As shown in Table 1, it has been defined from various perspectives, such as capabilities (Sadath & Acharya, 2017; Sen, 1979), Basic needs (Barnes et al., 2011; Teschner et al., 2020), human development (Nathan & Hari, 2020; Teariki et al., 2020), electricity con- sumption (Lin & Wang, 2020), indoor temperature (Papada & Kaliampakos, 2016; WHO, 2007), and measurement methods (Hills, 2011; Mendoza et al., 2019). Various methods for measuring energy poverty have been proposed, but no consensus has been reached (Papada & Kaliampakos, 2016). This lack of a universally accepted method for measuring energy poverty necessitates a systematic and rigorous analysis of previous empirical research. By comparing and analyzing various studies that employed different methods to measure energy poverty, a true measure of energy poverty can be obtained (Qurat-ul-Ann & Mirza, 2020). Therefore, the advantages and disadvantages of different methods for measuring energy poverty must be assessed, and several new indicators should be developed to address methodological challenges. This section presents a review of vari- ous measurement methods of energy poverty divided into three categories: economic indi- cators, composite indicators, and multidimensional indicators. Economic indicators are generally related to household income and energy costs, and there are usually four categories. The first indicator is the energy poverty line where a minimum level or threshold point is determined based on basic energy needs or expenditures (Barnes et al., 2011; Foster et al., 2000). At or below this threshold, households consume only the minimum energy level and should be regarded as living in energy poverty. Because of dif- ferences in cooking, heating, and climate between countries and regions, it is difficult to estimate the exact minimum energy demand. Therefore, this method is rarely used today. The second method is the 10% indicator proposed by Boardman (1991), which has become one of the most commonly used methods. The 10% indicator defines households as energy poor when their energy costs exceed 10% of household income. However, this single indicator is somewhat arbitrary, and the 10% threshold may not be suitable for coun- tries in the Global South (Zhang et al., 2019). The third method is the low income high costs (LIHC) indicator proposed by Hills (2011), which overcomes some of the limitations of the 10% indicator and considers both low-income households and households with high energy costs. It defines households as suffering from energy poverty when the cost of energy to meet basic living needs is higher than the average, and when the residual income is below the official poverty line. This method helps to specifically identify households with inadequate energy consumption as households suffering from energy poverty while avoiding the erroneous definition of wealthy households with high income and high cost as households suffering from energy poverty. However, this approach is characterized by a rather complicated and often non- transparent calculation process, and subjective factors of respondents strongly influence the energy poverty level (Betto et al., 2020; Okushima, 2017).",
    "The fourth method uses the minimum income standard (MIS) indicator, identifying households as suffering from energy poverty when their net income is inadequate to cover energy costs after deducting the minimum cost of living (Betto et al., 2020; Moore, 2012). The MIS indicator is more precise than other indicators; however, it is difficult to stand- ardize it to fit the minimum income of households across different regions (Walker et al., 2016). Composite indicators bridge the gap between unidimensional and multidimensional indi- cators, thus overcoming the shortcomings (i.e., simplicity and one-sidedness) of unidi- mensional indicators. A composite indicator attempts to aggregate various indicators and information into a single, easily interpretable indicator. For instance, Zhang et al. (2019) combined the accessibility and affordability of energy poverty and built a comprehensive indicator for exploring energy poverty in China. Ntaintasis et al. (2019) compared different measurement approaches of energy poverty, combining subjective and objective indicators to measure the energy poverty status of Greek households. Khanna et al. (2019) proposed a new comprehensive indicator that measures energy poverty by considering accessibility, availability, and affordability of energy in a country. While these composite indicators have been widely used because of their transparency and accessibility, certain scholars have pointed out that a number of composite indices lack theoretical support. In particular, the weights of indices in the aggregation are arbitrary (Bazilian et al., 2010; Munda & Nardo, 2005). Mirza and Szirmai (2010) studied energy poverty in rural Pakistan and proposed an energy inconvenience index, which considers the degree of inconvenience associated with accessing and using energy. However, this index does not consider the affordability of energy for households, and requires the collection of detailed survey data, which may be difficult to obtain in certain countries and regions (Pachauri & Spreng, 2011). The IEA proposed the energy development index (EDI) to assess energy poverty and better under- stand the vital role energy plays for human development (Khanna et al., 2019; Kumar, 2020). However, the EDI is more suitable for comparative analyses across countries and ignores the degree of energy poverty at the household level (Mendoza et al., 2019). MEPI—originally proposed by Nussbaumer et al. (2012)—is the most widely used mul- tidimensional indicator. Nussbaumer et al. (2012) were the first to construct a new MEPI, using five dimensions and six indicators to assess energy poverty in several African coun- tries. These include cooking, lighting, household appliances, entertainment or education, and communication. The method consists of two steps: identification and aggregation (Alkire & Santos, 2014; Crentsil et al., 2019; Okushima, 2016). Identification is the deter- mination of who is multidimensionally poor households by first setting poverty thresholds for each indicator and determining the poverty level of each person or household. Aggrega- tion calculates the overall poverty level of different people or households based on weights and poverty thresholds and compares them with the overall measurement standard. Accord- ing to this indicator, a person or household is identified as suffering from multidimensional energy poverty if their degree of energy poverty exceeds a pre-defined threshold. While most existing indicators focus on assessing the degree of energy access or energy-related development, MEPI measures each household’s energy accessibility and the availability of modern energy services. MEPI captures the incidence and intensity of energy poverty by calculating the product of the headcount ratio and the average intensity of those affected by energy poverty. Compared with other indicators, MEPI can be decomposed into different subgroups and dimensions, making the results more credible and robust. The multidimensional energy poverty index is widely accepted and used by scholars (Alkire & Apablaza, 2016; Olang et al., 2018; Villalobos et al., 2021). Abbas et al. (2021) used an adjusted MEPI to measure multidimensional energy poverty in 11 Asian coun- tries and identified the harmful effects of multidimensional energy poverty on women’s health. Qurat-ul-Ann and Mirza (2021a) constructed a MEPI for Pakistani households using seven dimensions and eight indicators, and examined the determinants of the inci- dence and severity of multidimensional energy poverty. Z. Zhang et al., (2021b) meas- ured multidimensional energy poverty at the household level using four dimensions and nine indicators. They then studied the impact of energy poverty on health status from both physical and psychological perspectives. Qurat-ul-Ann and Mirza (2021b) developed an improved MEPI with seven dimensions and 16 indicators and used it to estimate the inci- dence and intensity of multidimensional energy poverty at the household level in Pakistan. According to their findings, 55% of Pakistani households were multidimensionally energy poor in 2014—2015 under the poverty cut-off score of 0.3; the incidence and intensity of energy poverty were 92.5 and 59.5%, respectively. Abbas et al. (2022) measured the depth, intensity, and degrees of multidimensional energy poverty in countries in the Global South using five dimensions and six indicators. Their research confirmed the widespread pres- ence of severe energy poverty in multiple dimensions across Asian and African countries.",
    "The data for this study originates from the China Family Panel Studies (CFPS), which is a national, comprehensive household survey project conducted by the Institute of Social Sci- ence Survey at Peking University.' Unlike other household-level surveys, the CFPS dataset combines a variety of information and indicators of multidimensional energy poverty, such as demographic characteristics, living conditions, housing conditions, energy consumption and expenditures, as well as durable goods. The main advantage of the CFPS is that it allows an in-depth decomposition of the dynamics, incidence, and intensity across differ- ent areas of multidimensional energy poverty in China. Until now, CFPS data have been collected six times, and for this analysis, the latest four rounds of survey data (2012, 2014, 2016, and 2018) were used. Following Nussbaumer et al. (2012), this paper constructs a new MEPI of Chinese house- holds using seven dimensions and eight indicators. These indicators consider the acces- sibility and affordability of modern energy services at the household level, such as modern cooking fuel, household electricity consumption, ownership of entertainment or education devices, telecommunication means, ownership of assets (i.e., durable goods), affordabil- ity, and the year of construction. It is noteworthy that China reached 100% electrification in 2015 (Liao et al., 2015; NEA, 2015); therefore, since 2015, electricity accessibility ceased to be a meaningful metric for China. Following Lin and Wang (2020), household electricity consumption was chosen as an alternative indicator of electricity accessibility. If a household consumes less than 113.8 kWh of electricity per month, the household is affected by energy poverty. The additional indicator year of construction was introduced to explore the impact of housing energy efficiency on energy poverty. Related studies have shown the importance of the year of construction on energy efficiency (Boardman, 2013; Okushima, 2016; Sanchez-Guevara Sanchez et al., 2020). This paper defines properties built before 2008 as energy-poor because the first Chinese regulations on energy saving for civil buildings were issued in 2008. Buildings built before 2008 may not comply with these regulations and thus may show characteristics such as poor thermal insulation, dilap- idation, poor maintenance conditions, and low energy efficiency. Regarding energy con- sumption affordability, when a household spends more than 10% of its monthly income on energy consumption (including heating, fuel, water, property management, transportation, communication costs, housing maintenance, and monthly expenditure on durable goods), the household is considered to be affected by energy poverty (Barcena-Martin et al., 2020; Gupta et al., 2020). Table 2 lists the seven dimensions, eight indicators, deprivation cut- offs, and indicator weights. ' The CFPS sample covers 25 provinces or regions, and data are collected biennially through the face-to- face interview technique using a questionnaire, which includes all family members in sample households. Assignment of weights to the MEPI are controversial, affecting the research results. It has been pointed out that weights that are determined by subjective judgments are arbitrary (Ozughalu & Ogwumike, 2018; Pasha, 2017). A number of scholars used equal weights to measure multidimensional poverty (Alkire & Santos, 2014; Robles Aguilar & Sumner, 2020), which may exaggerate energy poverty (Khanna et al., 2019). Equal weighting may also ignore the relative importance of different indicators and differences between indica- tors (Pasha, 2017). Multiple correspondence analysis (MCA) is a technique for working with binary and categorical variables that overcomes some of the issues with assigning weights (Asselin, 2009). For example, Pasha (2017) calculated weights based on the MCA method and con- structed a multidimensional poverty index for 28 countries. As all variables in the present study are binary in MEPI, MCA is the most appropriate choice for determining the statisti- cal weights of indicators. Technically, MCA is conducted using a standard correspondence analysis on an indicator matrix (i.e., a matrix whose entries are binary (i.e., 0 or 1)). The principle of the MCA is to extract a first factor that retains the complete information con- tained in the matrix (Njong & Ningaye, 2008). The weights given by MCA correspond to the standardized scores on the first factorial axis (Asselin, 2009). When all variables have been transformed into a dichotomous nature (coded 0/1), the weight for these indicators can be calculated as: where k is the number of indicators (variables), j, is the number of modalities of the indi- cator (variables), we is the weighting coefficient corresponding to the standardized score on the first-factor axis (where s is the factor score) of the modality j,, and A, is the first eigenvalue from the multiple correspondence analysis. The weights that result from the MCA procedure can have both positive and negative values. This would complicate the interpretation of the weights, which would not be conducive to measuring energy poverty. Thus, it is useful to positively adjust weights by subtracting the lowest weight from each weight (Berenger & Bresson, 2013), as shown in Eq. (2). Finally, standardization can obtain the weight of each indicator as shown in Table 2.",
    "It is assumed that there are i individuals ((=1, 2..., n) and j variables (j=1, 2..., d). Then, Y= yal nxa TePFesents the n*d matrix of achievements for i individuals across j variables. Each row of the matrix y; represents individuals’ achievements across these different variables, and each column y; yields the achievements for every given variable. z; is defined as the depri- vation cut-off in variable j to identify all individuals that are deprived in any of the variables. Let g= lgi| nxq Cenote the 0-1 matrix of multidimensional energy poverty with an element defined as g=1 when y, < z; and g;=0 when y, > z;. The weights, calculated according to the MCA method, represent the importance of each indicator, and their sum equals 1. The weighted sum (C,) shows the sum of deprivation scores suffered by every individual. This study follows the judgment of Nussbaumer et al. (2012), who suggested that a person is identi- fied as suffering from multidimensional energy poverty if their weighted deprivation score (C;) is greater than k (k = 0.33). Finally, MEPI is calculated, which is the product of poverty incidence (H) and intensity (A). The headcount ratio describes the proportion of individuals suffering from multidimen- sional energy poverty. The headcount ratio (H) is calculated as follows: where q is the number of individuals suffering from multidimensional energy poverty, and n is the total number of individuals. Poverty intensity (A) indicates the severity of poverty amongst households suffering from energy poverty, which is the average of weighted deprivation scores of households suffering from energy poverty, as follows: Consequently, g;; = 1 if household i is deprived in indicator j and g,; = 0 otherwise. Thus, MEPI can be calculated as follows: Spatial autocorrelation is a geographical statistical method that can accurately reflect degrees of spatial correlation between variables and identify their spatial distribution (Cao et al., 2022). Spatial autocorrelation refers to the correlation of the same variable in different spatial positions. Spatial autocorrelation includes both global and local spatial autocorrelations. In this paper, Global Moran’s I and Local Moran’s I are employed to measure and characterize China’s spatial distribution of energy poverty. The following shows the specific calculation formulae: where n is the number of provinces; x; and x; are the energy poverty scores for provinces i and j; X is the mean of energy poverty scores of each province; S? is the variance of energy poverty scores; and w; is the spatial weight matrix, with the weights of neighboring prov- inces being | and the rest being 0. The values of the Moran’s I coefficient range within [-1, 1], with values above 0 indicating positive correlation; values closer to 1 indicating more apparent spatial clustering of energy poverty among Chinese provinces; values less than 0 representing negative spatial autocorrelation; values closer to -1 indicating more pronounced the spatial diffusion of province; and values equal to 0 representing weak spa- tial autocorrelation. The standard deviation ellipse (SDE) is a statistical analysis method that is commonly used in spatial statistics, and can accurately reflect the spatial distribution of geographi- cal elements (Lefever, 1926). The standard deviation eclipse has four parameters: the ellipse center, the long and short axes, and the azimuth angle of the ellipse. The stand- ard deviation ellipse can be used to measure the direction and distribution of a set of data (Zhou et al., 2022). The spatial and temporal evolution of energy poverty in China can be visualized by comparing the SDEs across various periods. The center of the SDE reflects the relative spatial position of energy poverty, the shift path of the center of the ellipse reflects the overall displacement characteristics of energy poverty, the long and short axes reflect the distribution direction and degree of dispersion of energy poverty, respectively, and the azimuth angle reflects the deflection trend of energy poverty. where n is the number of provinces, x;, y; are the geographical coordinates of each prov- ince, and x, y are the coordinates of the weighted average ellipse center. where, @ is the standard deviation ellipse’s azimuth angle, and x, and }, are the coordinate deviations of each province from the average ellipse center. As shown in formulae (12) and (13), o, and o, represent the standard deviation of the ellipse’s x- and y-axes, respectively. The formula derivation and related concepts of the SDE given above can be found in Lefever’s paper Lefever (1926).",
    "Cooking is the most basic energy demand for human survival, and electricity access is essential for development (Nussbaumer et al., 2012). Sovacool et al. (2012) proposed that energy access should be divided into three types, where the most important type reflect basic requirements for energy, such as cooking and lighting. Furthermore, Nathan and Hari (2020) suggested that cooking and lighting are essentials in the current household energy basket. Lack of access to modern energy sources for cooking and lighting is considered the main reason for indoor air pollution and associated health risks. Therefore, this sec- tion focuses on the two main aspects of household energy use: cooking fuel and electricity consumption. Figure 1 shows the distribution of the cooking fuel used by households in China from 2012-2018. As shown, most households used fuelwood and LPG/natural gas as cooking fuels. From 2012 to 2018, the proportion of people using fuelwood decreased from 33.82 to 23.78%, while the proportion of people using coal decreased from 5.87 to 4%. The pro- portion of people using biogas and solar energy remained low. In addition, the proportion of people using electricity for cooking has increased from 19.99 to 22.37%, and the propor- tion of people using natural gas and LPG has increased by 10.52%. In conclusion, the pro- portion of people using traditional cooking fuels (such as firewood and coal) has decreased from 39.69 to 27.78%, while the proportion of people using clean fuels (such as electricity, LPG, and natural gas) has increased. Our finding is in line with the Tang and Liao (2014), Z. Zhang et al., (2021b), and Dong, Taghizadeh-Hesary, et al. (2022), who showed that the number of people who have access to and use clean fuels has increased in recent years. This can be attributed to an improvement in people’s living standards and the Chinese gov- ernment’s clean energy program (Jiang et al., 2020; Wang et al., 2015; Zhang et al., 2019). However, it should not be overlooked that nearly a third of China’s population still rely on traditional cooking fuels in 2018, implying that fulfilling the fuel revolution and clean energy transition is still a long way off, see also Liao et al. (2016), Jiang et al. (2020), and Wen et al. (2021). Sources of cooking fuel are disaggregated to explore the regional differences in cooking fuel use. The results are shown in Fig. 2. During the study period, nearly 50% of rural households used fuelwood as primary cooking fuel. In contrast, urban house- holds are less dependent on fuelwood, and the households that primarily used fuelwood decreased from 15.94% in 2012 to 9.42% in 2018. Although the proportion of rural and urban households using traditional fuels has gradually decreased over recent years, 36.83% of rural households still used fuelwood for cooking in 2018, which is signifi- cantly higher than urban households. These results support former studies which found rural households use traditional cooking fuels more than urban households (Duan et al., 2014; Tian et al., 2021). Urban households mainly use LPG/natural gas as a primary cooking fuel, and this pro- portion increased from 57.87% in 2012 to 65.95% in 2018. In addition, electricity is the second choice of cooking fuel for urban households, and its proportion increased from 19.79 to 22.26% over the same period. Notably, the proportions of rural households using traditional cooking fuels decreased from 54.48 to 42.51%, whilst those using modern cook- ing fuels increased from 45.51 to 57.49%. Approximately 11.15% of this increase was the result of the increased level of LPG/natural gas consumption. In contrast, urban households using traditional fuels for cooking decreased from 21.58 to 11.59%, and the use of clean fuels increased from 78.42 to 88.41% over the study period. This suggests that the cleanli- ness of energy consumption of urban-rural households has improved, which is consistent with existing literature, showing that the energy consumption structure of both urban and rural residents is gradually shifting toward cleaner and greener alternatives (Zhang et al., 2016). However, compared with urban households, the quality and cleanliness of energy services is still very low in rural areas. This finding supports wider evidence that energy inequality between urban-rural areas persists in China (Liu et al., 2018, Ziming Liu et al., 2020a; Tian et al., 2021). Rural areas are therefore focus areas for reducing energy poverty and pursuing the clean energy transition.",
    "Figure 3 shows urban-tural differences in monthly electricity consumption of energy poor households. The share of non-energy poverty households increased significantly over the study period. Specifically, the percentage of non-energy poverty households increased from 30.94% in 2012 to 60.08% in 2018, increasing by 22.38% in 2014, which can be attributed to China’s rapid electrification (Li et al., 2022; Nie et al., 2021; Zang et al., 2021). Simi- larly, the proportion of households suffering from energy poverty decreased and became lower than that of non-energy poverty households after 2014. EP-Urban and EP-Rural, two categories of energy poverty, are used to explore differences in monthly electricity consumption between urban and rural households. Among the households suffering from energy poverty, EP-Urban households account for more than one-third (35.34%), which continues to decrease, while EP-Rural households have increased from 64.66 to 69.97%. Statistical data show that the share of EP-Rural households is twice that of EP-Urban households, and the gap between both has increased from 29.32 to 39.94%. Urban-rural differences in electricity consumption conform to the results of He and Reiner (2016), who showed that rural households mainly use electricity for lighting, and electricity demand is still substantially lower than that of urban households. Certain rural households have low incomes but face high costs, and these households are more susceptible to electricity prices and must restrain their electricity consumption. These findings are in line with the results fe} previous studies (Gupta et al., 2020; Z. Zhang et al., 2021b), indicating that access to lectricity is not always affordable, especially for low-income families. © Although China has made remarkable achievements regarding electricity accessibility (Wang et al., 2017; Q. Zhang et al., 2021a), for 39.92% of households, monthly electric- ity consumption was still below basic demand in 2018. The gap between rural and urban areas has widened. More than two-thirds (69.97%) of rural households have insufficient lectricity consumption, which greatly impacts the quality of people’s life. According to our analysis, it can be concluded that in China, clean fuels are not an affordable option for many households affected by energy poverty. These findings are similar to the conclusions obtained by He and Reiner (2016), Zhang et al. (2019), and Xie et al. (2021) that found rural households to be more sensitive to changes in electricity prices. Therefore, clean energy subsidy policies must be continually implemented, and investments in energy infra- structure should also continue (especially in rural areas). © The poverty levels and contributions for each indicator from 2012 to 2018 are shown in Table 3. Although energy deprivation decreases over the study period, overall, the level of energy poverty remains high. Table 3 shows deprivation in access to clean cooking fuels, which decreased from 39.86% in 2012 to 28.06% in 2018. A lower decrease is related to the low price of traditional fuels and people’s long-term habits of using fuels that they are familiar with (Q. Zhang et al., 2021a). The contribution of cooking fuels to multidimensional energy poverty was 11.94% in 2012 and increased to 24.19% in 2018, implying that the scarcity of cooking fuels contributed to nearly a quarter of stg Aran ked oy Aqy 10 euoyd ef1qow) uoneorunwWOD feuosied) uoneonpejuswuTeyoWUg Io Opes) UoHvoNpe/|UOWMUTe}IO}U pjoyssnoy) syesse jo diysoumoQ, uoronzsuod jo swok Supping uondumsuos Ajay, [ony Supjoos wrepoj China’ energy poverty. This finding corresponds with China’s current energy poverty situation, in which a large proportion of households (mostly located in rural areas) still heavily rely on traditional biomass for cooking and heating (Li et al., 2022; Wang et al., 2017). These findings are supported by the results obtained by Olawumi Israel- Akinbo et al. (2018), Jiang et al. (2020), and Du et al. (2022) who identified the lack of access to clean cooking fuels as a major cause of energy poverty. Similarly, the deprivation of monthly electricity consumption below basic needs decreased from 69.06% in 2012 to 39.92% in 2018. However, the contribution of insuf- ficient electricity consumption to multidimensional energy poverty increased from 13.45% in 2012 to 22.37% in 2018. These results support former studies which found that access to electricity does not only reflect connection to electricity grid. Instead, the problems of adequacy and affordability of electricity services should also be con- sidered (Betto et al., 2020; Gupta et al., 2020). Regarding the affordability of residen- tial energy consumption, 56.61% of households still could not pay their energy bills in 2018. Correspondingly, the contribution of this indicator increased gradually from 11.28% in 2012 to 31.74% in 2018. Therefore, unaffordable energy bills are the main contributor to multidimensional energy poverty. These findings suggest that access to and use of affordable and clean energy are critical for improving the current situation of multidimensional energy poverty in China (Wang et al., 2015; Zhang et al., 2019).",
    "Similarly, although deprivation of assets ownership and personal computer indica- tors decreased by 50.83 and 39.85%, respectively. The lack of household appliances and durable goods needed for living contributed to multidimensional energy poverty increased from 13.11% in 2012 to 15.86% in 2018. The lack of access to personal com- puters for both education and entertainment purposes has contributed to nearly a fifth (19.96%) of energy poverty in China. In addition, mobile phone use and TV penetration rates have multiplied, and their deprivation levels have decreased by 73.01 and 62.84%, respectively. The contribution of these indicators to energy poverty has declined. For example, the contribution of entertainment and education (i.e., radio or television) decreased from 11.55% in 2012 to 0.72% in 2018, and the contribution of communication to energy poverty decreased from 14.53% in 2012 to 4.24% in 2018. These improvements can be attributed to the rapid development of the economy and the increasing living standards of the people. Building energy efficiency standards significantly impacted residential building energy consumption and energy-saving performance of buildings (Huo et al., 2021). Since the implementation of regulations about energy saving for civic buildings in 2008, increasing attention has been focused on the energy efficiency and thermal insulation performance of buildings and consequently, energy loss has also gradually decreased in civic buildings. Table 3 shows that from 2012 to 2018, the number of buildings constructed before 2008 has decreased by 66.43%, and the energy use effi- ciency of buildings has dramatically improved. This is because of the contribution of housing energy efficiency improvements, which decreased from 12.82% in 2012 to 8.28% in 2018. Ma et al. (2019) reported similar findings, i.e., that since the imple- mentation of legislation in 2008, annual energy savings in China’s residential build- ing sector have increased significantly. The findings indicate that policies for reduc- ing energy prices, increasing energy subsidies, and using affordable and clean energy sources are significant steps toward alleviating energy poverty in China. Table 4 depicts the incidence, intensity, and multidimensional energy poverty levels for urban-rural households as well as for the overall residential sector in China from 2012 to 2018. The results show that the incidence, intensity, and level of energy poverty declined over the study period, especially the indicator of incidence and MEPI. Overall, MEPI decreased from 0.67 in 2012 to 0.23 in 2018, and the incidence of energy poverty decreased from 96.42% in 2012 to 43.29% in 2018. This shows that China has made sig- nificant achievements in energy poverty alleviation since implementing the poverty allevia- tion policy in 2015. However, it is worth noting that although the energy poverty intensity decreased from 69.22% in 2012 to 53.59% in 2018, the level of multidimensional energy poverty remains high. These results are aligned with those of Zhang et al. (2019) and Z. Zhang et al., (2021b) that also evaluated the energy poverty situation in China. At the same time, the level of urban—rural energy poverty has decreased from 2012 to 2018, particularly after 2014. Meanwhile Table 4 shows how the incidence, intensity, and levels of energy poverty were much higher in rural areas than in the national and urban areas during the study period, with urban areas having the lowest levels of energy poverty. This urban-rural gap of MEPI is growing, rising from 0.11 in 2012 to 0.19 in 2018. This finding implies that rural areas are more vulnerable to energy poverty than urban areas, which is similar to the findings of Cheng et al. (2022) and Ren et al. (2022). The resulting policy implications are that rural areas should be prioritized when implementing policies that address energy poverty. To further explore energy poverty across different provinces, the spatial distribution of energy poverty in China is shown in Fig. 4. Generally, energy poverty in China has gradually decreased from 2012 to 2018. While the energy poverty level has dramatically improved, the energy poverty gap between provinces has increased. According to the degrees of energy poverty, administrative regions are divided into three categories: acute energy poverty (MEPI> 0.7), moderate energy poverty (0.3 <MEPI<0.7), and low energy poverty (MEPI <0.3). In 2012, six provinces (Heilongjiang, Jilin, Anhui, Guangxi, Jiangxi, and Gansu) suffered from acute energy poverty, while the remaining 19 provinces had a moderate energy poverty level. In 2014, of the 25 provinces covered by the CFPS sample, only one province (Gansu) experienced acute energy poverty, and the remaining 24 prov- inces had moderate energy poverty levels. In 2016, eight provinces (Shanghai, Zhejiang, Beijing, Jiangsu, Guangdong, Tianjin, Hunan, and Hubei) had low energy poverty, and 17 provinces experienced moderate energy poverty. In 2018, only three provinces (Sichuan, Jilin, and Gansu) had moderate energy poverty, and the remaining 22 provinces had low energy poverty.",
    "Based on the calculated average score of energy poverty for each province, the energy poverty level can be decomposed by region (Fig. 5). Energy poverty levels for all areas have followed a decreasing trend from 2012 to 2018, especially in eastern and central regions where since 2014 energy poverty levels have decreased significantly more than in western and northeast regions. As expected, the eastern region has the lowest energy poverty, followed by central and western regions, and the northeast region has the high- est energy poverty. This finding supports the results of Dong et al. (2021), Z. Zhang et al., (2021b), and Zhao et al. (2021) but are inconsistent with the results of Wang et al. (2015). Figure 4 shows that the inter-provincial differences of energy poverty are mainly consist- ent with regional differences. Moreover, the energy poverty level of eastern and central regions is substantially lower than the national average. In comparison, the energy pov- erty level in western and northeast regions is significantly higher than the national average. Therefore, regional differences in energy poverty are apparent, with a stepwise increase in the energy poverty index from eastern to western regions. Moreover, these results are in line with China’s actual situation and previous findings (Z. Zhang et al., 2021b; Zhao et al., 2021). Regional differences may be explained by eastern regions having relatively high economic development levels, openness to the outside world, and better policies and location advantages. These regions have high levels of per capita income and higher use ratios of clean fuels (Z. Zhang et al., 2021b). In contrast, western and northeast provinces are economically undeveloped, and their geographic advantages are not apparent. Their per capita income is lower than that of eastern and central regions. The northeastern and north- western regions have high heating demand in winter (Zhao et al., 2021), and therefore, these regions have fairly high levels of energy poverty. National and regional energy poverty statistics may mask differences between rural and urban areas because rural areas are economically undeveloped and thus more vulnerable to energy poverty than urban areas. To formulate specific energy poverty policies for different regions, differences in energy poverty levels between rural and urban areas were compared (Table 5). The results show that urban-rural energy poverty levels and the urban—rural gap across different provinces and regions improved during the study period. However, energy poverty in rural areas is still more intense than in urban areas, especially in western and northeastern regions. The urban and rural energy poverty levels in the eastern and central regions are significantly lower than the national average, while the levels of western and northeast regions are above average. In addition, the urban-rural gap follows a similar pattern. Generally, compared to west- ern and northeast regions, rural and urban energy poverty levels are lower in eastern and central regions. Moreover, in most eastern and central regions, the urban-rural gap is smaller than in western and northeastern regions. Cheng et al. (2022) and Li et al. (2022) also reported the existence of urban-rural differences in energy poverty. Compared to western and northeastern regions, eastern and central regions have a higher level of eco- nomic development, a lower urban-rural income gap, a better rural energy infrastructure construction, a higher level of electricity services, and higher use rates of clean energy; therefore, in these regions, the energy poverty gap between urban and rural areas is rela- tively low. However, the energy poverty levels of rural and urban areas vary across provinces. Even in the same province, rural and urban areas commonly have different degrees of energy poverty. For example, in 2018, compared to other provinces in the eastern region, the urban and rural areas of Hebei, Shandong, and Guangdong provinces suffered from severe energy poverty, and their urban—rural energy poverty gap was relatively large. Similar situations can be observed in central, western, and northeastern regions. Therefore, the govern- ment should invest more resources in these areas (mainly directed toward rural areas), and Table 6 displays the findings of the global Moran’s I index analysis based on the four-stage energy poverty index. The global Moran’s I is positive and significant across all years, indi- cating that the spatial distribution of China’s energy poverty shows a significant positive clustering effect. Furthermore, the global Moran’s I increased from 0.28 in 2012 to 0.51 in The global Moran’s I can be used to assess the spatial clustering and dispersion of energy poverty as a whole, but it does not identify spatial heterogeneity. In contrast, the local Moran’s I better describes the correlation between a certain provincial unit and neigh- boring provincial units, thus identifying each province’s regional spatial pattern based on the energy poverty index. The local Moran’s I of energy poverty was calculated for all 25 provinces in China, and scatter plots were drawn for all four years.",
    "As shown inFig. 6,7 the local Moran’s I divides the spatial correlation patterns of energy poverty in China’s provinces into four types, corresponding to the four quadrants ? Note: The numbers | to 25 in the Moran’s I scatter plots represent Beijing, Tianjin, Hebei, Shanxi, Liaon- ing, Jilin, Heilongjiang, Shanghai, Jiangsu, Zhejiang, Anhui, Fujian, Jiangxi, Shandong, Henan, Hubei, Hunan, Guangdong, Guangxi, Chongqing, Sichuan, Guizhou, Yunnan, Shaanxi, Gansu, respectively. in Moran’s I scatter plots. Quadrant 1 (upper right) indicates that areas adjacent to high- energy-poor areas, such as Heilongjiang, Jilin, and Liaoning, are also areas with high energy poverty (High-High group). Quadrant 2 (upper left) shows that areas with low energy poverty are surrounded by other high energy poverty areas, such as Henan, Hubei, and Hunan (Low-High group). Quadrant 3 (lower left) indicates that regions with low energy poverty are adjacent to nearby low energy poverty regions, such as Shanghai, Zhe- jiang, Jiangsu, and Fujian (Low-Low group). Quadrant 4 (lower right) represents areas of high energy poverty that are surrounded by areas with low energy poverty, e.g., Hebei, Anhui, and Jiangxi (High-Low group). Figure 6 shows that most of China’s provinces fall into Quadrants 1 and 3, indicating that high-value and low-value clustering are the main forms of energy poverty spatial relationships in China. This demonstrates that China’s energy poverty shows significant spatial clustering characteristics. As shown in Table 7, the number of provinces is unevenly distributed across these four spatial clustering types. Significantly more provinces fall in Quadrants 1 and 3 than in Quadrants 2 and 4, indicating a spatially concentrated distribution of areas with simi- lar energy poverty levels in China. This finding is supported by the analysis of Cai et al. (2021). The number of provinces falling into Quadrants | and 3 increased from 16 in 2012 to 19 in 2018, accounting for 64 and 76%, respectively. A strong positive spatial autocor- relation was found, which is consistent with the results of previous global autocorrelation analysis. Furthermore, during the study period, the number of provinces in the High-High group was higher than the number of provinces in the Low-Low group. In 2012, 10 prov- inces were in the High-High group and 6 provinces were in the Low-Low group, represent- ing 40 and 24%, respectively; however, by 2018, the proportions were 40 and 36%, repre- senting, with the gap between the two gradually narrowing. Overall, the number of provinces classified as High-High and High-Low remained relatively stable. Provinces classified as Low-Low increased from six in 2012 to nine in 2018, while Low-High provinces decreased from five in 2012 to three in 2018. Low-High provinces begun to shift to Low-Low (e.g., Hunan and Guangdong), indicating that energy poverty gradually decreases with increasing economic development in China’s prov- inces. Provinces classified as Low-Low spatial clustering types are mainly located in the eastern coastal region, including Beijing, Shanghai, Zhejiang, and Jiangsu. Provinces with High-High spatial clustering type are primarily located in western and northeastern China, including Heilongjiang, Jilin, Gansu, and Shaanxi. Provinces with High-Low and Low-High clustering types, such as Anhui, Henan, and Hubei, are primarily located in the central region. This finding is consistent with regional differences in economic devel- opment in China, corroborating the robustness of previous results. In conclusion, while energy poverty levels in different provinces decreased gradually from 2012 to 2018, it can- not be overlooked that energy poverty levels in different regions of China vary greatly, and their relative spatial clustering types have not fundamentally changed. In this study, the center of gravity of energy poverty in China from 2012 to 2018 was also calculated. Each center of gravity was connected with a smooth curve to obtain a trajectory map of the migration of the center of gravity of the energy poverty index. This provided a visual representation of the spatial clustering characteristics and evolution trend of energy poverty in China (Fig. 7). Regarding the center of gravity distribution, the center point of standard deviation ellipses of 2012, 2014, 2016, and 2018 is always within Henan province. However, during the study period, the center of gravity of energy poverty in China shifted from the southeast to the northwest, with a relatively stable shift in the direction of the center of gravity. This finding is similar to the conclusions of Zhao et al. (2021) and Dong, Dou, et al. (2022); however, Jia and Wu (2022) found different shift paths of the ellipse center of energy poverty in China. It is worth noting that a comparison of the changes in the ellipses between different years shows that the coverage of the outer circle of the ellipse along the northwest and southwest directions has increased during the study period, while the coverage along southeast direction has decreased. This implies that the northwest and southwest direc- tions are the most prominent for the growing trend of energy poverty in China.",
    "As shown in Fig. 7, the standard deviation ellipse of China’s energy poverty from 2012 to 2018 is primarily located in the eastern and central regions, reflecting a \"northeast-southwest\" spatial distribution pattern. The center of gravity has shifted significantly during the study period and has moved 148.64 km to the northwest (Table 8). The short semi-axis length increased from 690.09 km in 2012 to 692.96 km in 2018, indicating that China’s energy poverty is spreading from east to west. In terms of changes, the length of the long semi-axis increased from 1,188.40 km in 2012 to 1,290.54 km in 2018, showing an overall elongation trend. This indicates that the dis- tribution of energy poverty in China has increased in the north-south direction. The rotation angle is gradually increasing, but the variation range always remains within 3°, indicating that the direction of China’s energy poverty divergence is relatively stable, and the overall trend is still northeast-southwest. The ellipse area gradually increased over the study period, and in 2018, it was 9% larger than in 2012, indicating that China’s energy poverty follows a spatial dispersion trend. Access to affordable clean energy and modern energy services can alleviate household energy poverty and improve health and well-being. This paper constructs a new multidi- mensional energy poverty index for China, capturing modern energy service availability, affordability, and accessibility. The new energy poverty index comprises seven dimen- sions and eight indicators that consider households’ energy needs for cooking, lighting, housing, communication, education, and entertainment. The latest national micro-level survey data are applied to assess the incidence, intensity, and dynamics of energy pov- erty in China at the household level. Based on this, the level and spatial distribution of energy poverty is compared over the study period, including inter-provincial, regional, and urban-rural. Finally, the different types of spatial clustering and the spatiotemporal trends of energy poverty in China are discussed. The study shows that the number of households using clean energy has gradually increased over recent years. However, nearly one-third of households still used tradi- tional solid fuels for cooking in 2018, with 36.83% of rural households still using fire- wood as their primary cooking fuel. There was a substantial difference in cooking fuel use between urban and rural residents. Although China achieved 100% electrification in 2015, the monthly electricity consumption of 39.92% of households remained below basic needs, and nearly 70% of rural households had insufficient power consumption. The most important factor contributing to energy poverty was the inability to pay living energy costs, and 56.61% of households were unable to pay their energy bills in 2018. Residential households had higher penetration of mobile phones and television sets during the study period, and the energy efficiency of buildings has improved signifi- cantly. Consequently, the energy efficiency of buildings, ownership of mobile phones, and ownership of television sets are no longer the main influencing factors of energy poverty. It is worth noting that although deprivation of household assets and personal computer ownership indicators have improved considerably since 2012, their contribu- tion to energy poverty was still substantial and should not be ignored. The affordability of energy bills, personal computers, and the electricity consumption index were impor- tant factors that contributed toward energy poverty. This suggests that reducing the energy burden of residents can significantly reduce energy poverty in China. In general, the energy poverty index in China followed a gradual downward trend during the study period, decreasing from 0.67 in 2012 to 0.23 in 2018. The incidence of energy poverty decreased from 96.42% in 2012 to 43.29% in 2018. This shows that whilst China made significant achievements in poverty alleviation during the study period, the incidence and intensity of energy poverty remained high. Furthermore, rural areas were more vulnerable to energy poverty than urban areas. The level of energy poverty was substantially higher in rural areas than in urban areas, and the urban-rural MEPI gap widened, having increased from 0.11 in 2012 to 0.19 in 2018. Urban-rural energy poverty levels in eastern and central regions were lower than in western and northeast regions. This study also found that energy poverty levels varied across provinces and regions, with the lowest levels found in eastern provinces and the highest in western and northeastern provinces, showing an increasing trend from east- ern to western regions. Moreover, the results of spatial autocorrelation analysis demon- strate that China’s energy poverty had significant spatial clustering characteristics. Fur- thermore, the results of standard deviation ellipse analysis show that during the study period, the center of gravity of energy poverty in China was located in Henan Province and gradually shifted to the northwest.",
    "These results provide useful information for policymakers to intervene and alleviate energy poverty in China. Specific policy recommendations are summarized as follows: Several limitations need to be improved in future research. Firstly, this study did not con- sider indicators of indoor air pollution when measuring cooking deprivation in residential households because of data availability constraints. Kitchen smoke-exhausting ventila- tors have grown in popularity in urban-rural residential households over recent years, and future could use the presence or absence of a kitchen smoke-exhausting ventilator in the household as a proxy indicator of indoor air pollution. Secondly, measuring the energy efficiency of a buildings is complex, and in the present paper, only the year of construc- tion has been used to do so. Future research should consider the impact of factors such as dwelling size, heating equipment, and heating methods in hot summer and cold winter regions on building energy efficiency. Finally, in China, energy poverty has improved sig- nificantly since the start of China’s poverty eradication policy in 2015. Still, this study did not compare the effects of energy poverty reduction policies implemented before and after this time. In the future, the effects of this policy could be studied using methods such as difference-in-difference. Acknowledgements We are grateful for financial support provided by the National Natural Science Founda- tion of China (Grant Number: 72074111)."
]