[
    "Abstract. With the development of The Times, gender education of students has been paid more and more attention. Good gender education also helps students to view themselves and treat others more perfectly. In order to improve the gender education consciousness of teachers and students in a primary school in Henan Province and promote the development of gender education in Henan Province, the author used an offline questionnaire survey and literature review to investigate the cognition of fifth and sixth-grade primary school students on gender stereotypes. From four points of view, the questionnaire content includes gender stereotypes on appearance, personality, career choice and function distribution in the family for males and females. The study found that some of the gender stereotyping tendencies of the participants were related to the participants’ own gender, while the binary gender stereotypes on family duties and responsibilities influenced each other. The findings revealed that participants who had stereotyped biases about the roles of men and women in the household influenced their perceptions of the responsibilities of the opposite gender. According to Google Academic Index, since 2018, a total of 16,900 articles on gender stereotypes and primary education have been retrieved in English, including academic journals, dissertations, conferences, newspapers, books and so on [1]. According to CNKI search, there were only 42 Chinese articles with double keywords since 2018 [2]. In this article, the author used questionnaires to investigate current students in Jinxiu Primary School in Henan Province, China. Results in this study confirm that gender stereotypes exist in elementary school students. The purpose is to better assist the education of students in early adolescence by raising awareness of gender education among teachers and students in local schools and giving suggestions. The subjects of the survey are grade five and six primary school students, most of whom are 11-12 years old. Fifth and sixth-grade students' self-consciousness has been formed, and the ability of self-evaluation and self-education has been rapidly developed. In this order students often think about \"what kind of person I am\" and \"what kind of person I should be\"[3]. The researcher chose students in this developmental stage because students at this stage are at the beginning of puberty: they have a clear understanding of gender, and they are in a stage of physical and mental development. Adolescent students begin to develop self-consciousness. On the one hand, they want to get out of the role of obeying their parents' arrangements. On the other hand, they cannot get rid of their parents’ control completely for adolescents still need their parents to support their studies and life. In terms of acceptance of knowledge and school life, it has changed from passive listening to self-awareness and selective acceptance. Therefore, primary school students at this stage are great research assets. The research focuses on three exposed traits in the impression of gender engraving, which are participants' personality, temperament, career choice and appearance. The research targets are Grade 5 and 6 students in Jinxiu Primary School, Zhanhe District, Pingdingshan City, Henan Province, China. The conclusion of this study can promote gender education in schools and strengthen teachers’ and students' understanding of the importance of gender education. Efforts have been made to promote and develop local emphases on gender education. The concept of stereotype first appeared in Walter's \"Public Opinion\". Walter believed that stereotype is a kind of inherent idea about a certain group or related events formed on the basis of race, gender and other conditions [4]. Hilton and Hippel believed that stereotype is a series of characteristics related to members of a social group, including personality, attitude, behavioral tendency and so on [4]. In the same year, Nelson et al. proposed a similar definition, arguing that stereotypes are cognitive constructs that contain knowledge, beliefs, and expectations about social groups, and that those who subscribe to negative stereotypes are prejudgments [5]. Jussim et al. believe that stereotype is the cognitive bias of people toward different groups, including four attributes: unconsciousness, inaccuracy, permanence, and over-generalization [6]. Domestic studies on stereotypes are mostly defined from the perspective of cognitive bias. With the refinement of scholars' research on stereotypes, different scholars divided the types of stereotypes according to the deviation of research direction. This article will focus only on gender role stereotypes.",
    "Gender role stereotype refers to the public's expectations and requirements for males or females in behavior performance, personality characteristics, career choice and other aspects in today's society, as results in this study confirm that all as the fixed concept of this general view [7]. According to research, gender role stereotyping is a universal and global situation [7]. With the deepening of research, different researchers have put forward different definitions of gender role stereotyping. All port believes that gender stereotype is a mindset related to social concepts and is uncontrollable [7]. Both male and female individuals tend to choose the least cognitive processing when they perceive and judge things, and this way will affect thinking. As for the causes of gender stereotypes, one view is that it is caused by the different physiological characteristics of men and women [8]. The second view on the causes of gender stereotypes is that gender stereotypes are caused by the different occupations and positions of men and women in the family and society. All the studies on gender differences are considered as factors that affect gender differences in society environment and cultural factors play a decisive role, while human nature and physiological factors have little or no effect [9]. Chinese scholars have also come up with different ideas about gender role stereotypes. Researcher Xu Dazhen believed that the concept of gender stereotype refers to the fixed views on a male or female's social gender, behavior style, personality characteristics and other aspects that can be accepted and recognized in the familiar social culture [9]. In the same cultural background, this idea will be closer and more unified. For example, men are more masculine, brave and confident, while women are more delicate, vulnerable and sensitive. This questionnaire was distributed and collected offline. Three questionnaires results in this study confirm the tested, and 150 results in this study confirm the officially distributed after modification, including 150 valid questionnaires. It took a total of five days from issuing the questionnaire to collecting it. IBM SPSS Statistics was used to analyze the data.According to the questionnaire results, it is found that the gender of the questionnaire fillers will bias the degree of gender stereotype of the same and opposite sex, so the two are related. According to the graph 1, males accounted for 46% and females accounted for 54% of the entire population in the questionnaire. The distribution place is in Jinxiu Primary School in Zhanhe District, Pingdingshan City, Henan Province, and the target participants are the fifth and sixth-grade students in the school. A total of 14 questions results in this study confirm that asked in the questionnaire, which mainly aimed at the stereotypes of gender in primary school students. In terms of the results in this study confirm that to the questions, there are five degrees: completely disagree, basically disagree, not sure, basically agree and completely agree, which are respectively represented by five numbers: 1, 2, 3, 4, 5. According to table 1, the reliability of this questionnaire was analyzed according to SPSS, and the Cronbach α value obtained was to.0.647. The questionnaire can be divided into two parts. One part aims to collect demographic information, including the second question in the questionnaire: is your gender male or female. The purpose is to collect the gender of participants in this study confirms that and discuss the differences result in this study confirm the existence of gender stereotypes of the same sex and stereotypes of the opposite sex according to different genders. The second part aims to collect demographic information. Among questionnaire questions, 2,3,5,10,12 are entitled to reverse scoring questions. In order to analyze the phenomenon of gender stereotypes from more dimensions, this questionnaire designed questions from the following aspects： From the stereotype of male temperaments, such as in Question 2: A boy's favorite toy can be a doll. This is a reverse scoring problem. If the participant chose to completely disagree, it was found that the participant had a gender stereotype bias towards male preferences. If the participant chooses to fully agree, it indicates that the degree of gender stereotyping is weak. Question 3 asks participants’ ideas of how they view men results in this study confirm that bring makeups. If they fully agree, it indicates that this study confirms the existence of stereotypes of male appearance requirements; if they completely disagree, this shows particpant's propensity for gender stereotypes: they require men's appearance and behavior to conform to social male characteristics, such as masculinity.",
    "Questions in the questionnaire about men's social function and occupational impression, such as questions 5, 6 and 14. The male occupation and the family share of the function are consistent with the stereotype. Question 5: Male students can be nurses in their career choices. The question focuses on stereotypes about career choices. If the participant chooses to fully agree, it shows that the influence of gender stereotypes on the participant is smaller or has no influence at all. If the participant chooses to fully agree, it shows that the attitude of the participant with the name change is biased toward stereotypes. Question 6: The profession of principal and director should be held by men. This question addresses gender stereotypes about specific positions in education. If the participant chooses to fully agree, it indicates that the participant has a fixed ideological bias in the occupational gender concept; if the participant chooses to completely disagree, it indicates that the participant is weakly influenced by the gender fixation in the occupational gender concept. Question 14: men should be the breadwinner, take more economic responsibility to take care of the family, and generally do not choose women's more professional choices, such as nursing. If they choose to fully agree, this shows participant's propensity for gender stereotypes on male function and solidifies the status of men in society. If they choose to completely disagree, it indicates that they have broken through the traditional curing of the male image and are more able to accept diversified choices. The questions are mainly designed based on three aspects, namely, women's personality and temperament characteristics, women's appearance characteristics and women's social function and occupation impression. Question 8: Girls should be quiet, not like tomboys. This question is designed to address stereotypes about female personality. If they agree completely, they have a strong and rigid view of the personality characteristics of women. They believe that women should be gentle and not have neutral or masculine characteristics. If participants choose to completely disagree, it shows that there are no obvious restrictions on female character characteristics, and female character characteristics can be diversified. Question 7 and 9 are designed for the appearance characteristics of women. Questions are raised about hair styles and clothes, for example, question 7: Girls are not allowed to have the same haircut as boys. If they fully agree, they believe that men and women can be distinguished from each other by their hairstyles. If participants choose to completely disagree, it shows that the binary gender is not only distinguished by appearance and hairstyles, but also has a certain tolerance for the gender ambiguity caused by hairstyle. Question 9: Girls must wear skirts that fall below the knee. This question focuses on the dress requirements for women. If the participant chooses to fully agree, it shows that the participant has the tendency to present gender stereotypes in the dress requirements; if the participant chooses to completely disagree, it shows that the quantification degree of gender stereotypes is weak. Questions 12 and 13 focus on social functions and professional impressions of women. Women's social duties in society are generally considered to be those of caring for the family and the husband. Questions 12: Women can choose to be engineers, pilots, or drivers. In the reverse scoring question, if the participant chose to fully agree, it showed that the participant was less subject to gender stereotyping in his career choice, while if the participant chose to completely disagree, it showed that the participant had gender stereotyping bias in his career choice. Question 13:Women's social duties in society are generally considered to belong to the one who takes care of the family, the husband. If the participant chose to fully agree, it proved that the participant had such a tendency to stereotype the social requirements of women, and the participant agreed to the social assignment. A choice to completely disagree would indicate that the participant believes that women's social duties are not fixed and would indicate a degree of detachment from stereotypes. The data are divided into two groups for correlation analysis. The first group is the gender stereotype bias towards males under the influence of their own gender. Questions 2-6 and 13 are covered in the questionnaire.",
    "According to Table 2, it can be seen that the reverse problem, in question 2: Boys' favorite toys can also be dolls, male stereotyping is related to gender. In Question 3: Boys can make up, Question 4: Boys study mathematics better than girls, Question 6: The profession of principal and director should be held by men, there was a significant correlation with the participant's own gender. In Question 5: Male students can be nurses in their career choices and question 14: men should be the breadwinner, take more economic responsibility to take care of the family, and generally do not choose women's more professional choices, such as nursing, there is no significant correlation between the gender of the participants. Question 2: Boys' favorite toys can also be dolls. According to Table 3, 71 out of 150 participants chose to fully agree. The number of people who said \"strongly agree\" was also the highest, regardless of whether the participants were male or female. Question 3: Boys can make up. According to Table 4, out of 150 participants, 63 participants fully agreed. It can be seen that female participants were more evenly divided in their choices. Question 4: Boys study mathematics better than girls. According to Table 5, out of 150 participants, 56 participants chose \"totally agree\", but as it can be seen, male participants chose \"totally agree\" the most, while female participants chose \"totally disagree\" the most. Question 6: The profession of principal and director should be held by men. According to Table 6, of the 150 participants, the largest number chose to completely disagree. Question 9: Girls must wear skirts that fall below the knee. According to Table 7, of the 150 participants, the largest number chose to completely disagree. Question 11: Girls perform better than boys in learning Chinese.According to Table 8, out of 150 participants, 66 chose not to agree at all. According to Table9, it can be seen that the reverse problem, question 9: Girls must wear skirts that fall below the knee and Questions 12: Women can choose to be engineers, pilots and drivers were significantly correlated with participants' own gender. Question 11 Question 11: Girls perform better than boys in learning Chinese, which is significantly correlated with the gender of the participants themselves. Question 7: Girls are not allowed to cut boys' hair. Question 8: Question 10: Girls' favorite toys can be toy guns and model cars. Question 13: Women's social duties in society are generally considered to belong to the one who takes care of the family and the husband. There was no correlation with the participants' own gender. Although some of the questions were not significantly correlated with the gender of the participants themselves in fact, these questions were also affected by other questions. This section main focuses on the analysis of the questions with no significant correlation.Question 5: Male students can be nurses in their career choices and question 7: Girls are not allowed to cut boys' hair. Question 10: Girls' favorite toys can be toy guns and model cars.Question 13: Women's social duties in society are generally considered to belong to the one who takes care of the family and the husband and explore the explore the reasons for this result and question 14: Men should be the breadwinnder, take more economic responsibility to take care of the family, and generally do not choose women’s more professional choices, such as nursing. Although some of the questions were not significantly correlated with the gender of the participants themselves in fact, these questions were also affected by other questions. This section main focuses on the analysis of the questions with no significant correlation.Question 5: Male students can be nurses in their career choices and question 7: Girls are not allowed to cut boys' hair. Question 10: Girls' favorite toys can be toy guns and model cars.Question 13: Women's social duties in society are generally considered to belong to the one who takes care of the family and the husband and explore the explore the reasons for this result and question 14: Men should be the breadwinnder, take more economic responsibility to take care of the family, and generally do not choose women’s more professional choices, such as nursing.",
    "Table 10 shows that Question 5: Male students can be nurses in their career choices and question 2: Boys' favorite toys can also be dolls, Question 3: Boys can make up is significantly related to gender. At the same time, from Table 5, we can see that Questions 5 and 7: Girls are not allowed to cut boys' hair are also significantly related. It can be seen from Table 11 that questions 5 and 7 are significantly correlated. Similarly, question 7 and question 3: Boys can make up are also significantly correlated. The table 11 shows that question 7 is also significantly related to Question 8: Girls should be quiet, not like tomboys. From Table 3, it can be seen that Question 10: Girls' favorite toys can be toy guns and model cars is significantly correlated with questions 8 and 12. Through table 12, it can be seen question 13: Women's social duties in society are generally considered to belong to the one who takes care of the family and the husband and question 14: men should be the breadwinner, take more economic responsibility to take care of the family has a significant correlation. Results in this study confirm that gender stereotypes do exist and influence the growth of the next generation. This kind of thinking successively and subtly influence people's thoughts. In this study it confirms that with recognition, family and school can implement intervention and help children be more open-minded, rather than sticking to traditional gender beliefs. In this way, children can also have more choices in their future career and growth direction. Educators in this study should lead students more. Teachers can organize some gender topics through schools and discuss topics in class, including introducing some picture books with relevant themes consciously, so that gender issues will no longer be an unmentionable topic. Pre-service educators at their undergraduate stage should actively understand the knowledge of gender, not face it negatively, not be shy when facing the gender issue, and accept the development of diversity. At the same time, in the face of society's rigid view of their gender, students should be brave to say no, and establish their values and dialectical ideas. The popularization of gender education is beneficial to the physical and mental development of children. One of the early studies in the field found that even by only briefly presenting children with picture books involving nontraditional sex role models, their stereotypical ideas about gender role models could be reduced [10]. A different study with elementary school children showed that children who read stories with female main characters in non- traditional roles were more likely to believe that girls can engage in that particular non-traditional roles than children who had read the same story with a male main character [11]. Similar results were reported by Trepanier-Street and Romatowski [11]. After their reading intervention, more boys and girls viewed occupations as appropriate for both males and females. According to the researchers, the change in gender attitude of the children “seemed to generalize beyond the occupational roles portrayed in the books read in the study”, which even further underlines the significant impact books, as well as other cultural products children are daily faced with may have on children’s ideas about gender roles [10,12]. Through the experiment, it can show that human intervention will have an impact on children in primary school. Therefore, it can also show that if the intervention is carried out on school-age students in the fifth and sixth grade of primary school or even at an earlier stage, it may also have a bias to get rid of the influence of gender stereotypes. In the three aspects of the study: the stereotype of appearance and clothing of both sexes, the stereotype of occupation choice and According to the questionnaire, there is a certain phenomenon of gender stereotypes among the students of this school, but the results in this study do not confirm stubbornness. Table 2 shows that participants hold gender stereotypes due to their inherent gender bias in the following aspects: physical appearance of boys and girls, subjects that men and women were good at in the traditional learning model, career choices of men and women in education-related majors, and types of toys available to boys. From Table 3 to Table 8, it can be seen that the family function, dress code and social function of both genders will be affected by the original gender of the participants. However, there is a correlation between male and female family functions. A small number of data show that only single-sex family functions have gender-solidified thought influence, and the distribution of family functions has become an independent concept regardless of the original gender of the participants. It can be seen from the study that not all participants related gender stereotypes to their own gender. There was also no relationship between men's and women's roles in family life. On the contrary, in terms of the division of family responsibilities between men and women, the gender stereotype bias towards the male or female will also lead to the bias towards the other gender orientation. According to this study, 11-12 year old participants have less gender stereotype bias when faced with the question of male or female's dress appearance. Future sex education could focus on the impact of gender stereotypes on men’s and women’s career choice. However, this school’s participants still had some distribution of old gender stereotypes and biases, so relevant intervention were needed. stereotypes on men's and women's career choices."
]