[
    "This conceptual paper explores the theoretical framework surrounding the relationship between teacher competency and job performance in universities in Henan Province, China. Drawing on Spencer's competency model, the paper conceptualises teacher competency as comprising five key dimensions: skills, knowledge, self-concept, traits, and motives. It also introduces perceived organisational support as a mediating variable, offering a novel perspective on how it influences the link between competency and job performance. Theoretical discussions are advanced through a multidimensional approach, expanding the scope of competency and organisational support theories within the higher education context. This study proposes to employ a quantitative research design to examine the relationships among teacher competency, job performance, and perceived organisational support. To collect data, a structured questionnaire is proposed to be administered to university teachers from 60 universities in Henan Province, and the resulting data are subsequently analysed using appropriate statistical techniques to test the proposed relationships. This framework enriches existing literature and provides new directions for future empirical research. By applying this conceptual model, the study contributes to the broader understanding of teacher competency and performance, with potential implications for teacher management, professional development, and International Journal of Management, Finance and Accounting Vol. 6, Issue 1 (2025) https://doi.org/10.33093/ijomfa.2025.6.1.12 This work is licensed under the Creative Commons BY-NC-ND 4.0 International License. © University Telekom Sdn. Bhd. Published by MMU PRESS. URL https://journals.mmupress.com/ijomfa To cite this article: Xu, W., Sy, K. L. L., & Gooi, L. M. (2025). A conceptual framework for university teachers' job performance in Henan, China: Integrating a competency model and the mediating role of perceived organisational support. International Journal of Management, Finance and Accounting, 6(1), 350–379. https://doi.org/10.33093/ijomfa.2025.6.1.12 In the growing internationalisation and intensifying competition within global higher education, university teachers play a pivotal role in driving educational quality. Their competency levels are directly linked to job performance and the achievement of institutional development goals. Since its inception, competency theory has been widely applied in organisational management and human resource domains, focusing on identifying the attributes and capabilities closely aligned with job requirements (Boyatzis, 1991; Burke & Morley, 2023; Kaur & Kaur, 2021; Spencer & Spencer, 2008). However, despite China's efforts to enhance higher education quality under the \"Double First- Class\" initiative, research on university teachers' competencies remains limited, particularly regarding their specific impact on job performance and the underlying mechanisms (Jia, Wang, & Hu, 2022; Wijayanto & Riani, 2021). existing research often adopting Western competency models without adequately addressing the complex teaching and research demands Chinese faculty face. Furthermore, Chinese studies replicate foreign methodologies, needing adaptations tailored to China's unique educational context (Li, 2023). Second, while organisational support theory has been extensively applied in corporate management (Zhang, Xi & Xu, 2022; Eisenberger, Huntington, Hutchison, & Sowa, 1986)), its use in managing university faculty in China still needs to be explored. Given university teachers' multifaceted roles and distinct needs, a more nuanced understanding of perceived organisational support is essential. Third, current limitations in university performance management primarily focus on research outputs, often at the expense of teaching quality. This imbalance has made it challenging for faculty to navigate the demands of both research and teaching (Wang, Zheng, & Zhao, 2022; Zhu & Chen, 2022). Additionally, Henan Province is a particularly relevant research context, characterised by limited high- quality educational resources and constrained economic service capacity. Developing a competency model that reflects local characteristics is crucial for enhancing regional educational quality (Wang, 2022; Zhang, 2023). These challenges underscore critical issues in human resource management within universities that demand immediate Therefore, this conceptual study integrates the competency model and organisational support theory to address these challenges and develop a more comprehensive framework for understanding the relationship between university teachers' competencies and job performance. The competency model provides a foundation for identifying the key attributes that enhance faculty effectiveness, while organisational support theory explains how perceived institutional support influences faculty performance. By incorporating these two theoretical perspectives, this study examines the direct impact of competency on job performance and the mediating role of organisational support in this relationship. The main objectives of this study are as follows: The origins of competency modeling can be traced to 1973 when McClelland developed a pioneering framework to identify suitable foreign liaison officers for U.S. government positions. This initial model identified three essential competencies required for success in these roles: the ability to navigate cross-cultural interactions with sensitivity, the optimistic views of others, and the capability to quickly establish connections within local political communities. Later, McClelland (1973) proposed the competency iceberg model, which includes six components: knowledge, professional skills, comprehensive ability, personality characteristics, motives, and values. Building on McClelland's work, the Onion Model was introduced in 1981, describing competence as a layered structure comprising attributes, self-image, values, social roles, attitudes, knowledge, and skills (Boyatzis, 1991).",
    "memory, self-confidence, initiative, and a sense of responsibility (Boyatzis, 1991). Further refining competency models, Spencer and Spencer (2008) introduced the management competency model, distinguishing between a visible part (knowledge and skills) and a hidden part (self-concept, traits, and motives). This model emphasises that hidden attributes enable individuals to effectively apply newly acquired knowledge and skills (Yuan, Chuang, & Gregory, 2017). Additionally, capability classification theory posits that capability comprises three dimensions—job specificity, industry specificity, and organisational specialisation—from which researchers derive six distinct capability categories. The six competencies are meta-competency, general industry competence, managerial competence, standard technical competence, industry technical competence, and specific technical competence (Nordhaug, 1998; Reis, Fleury, & Carvalho, 2021). This classification further advances the application and development of competency models. The definition of teacher competency has varied across different periods. Medley and Crook (1980) described it as a set of measurable characteristics closely linked to teaching effectiveness, including professional knowledge, skills, and attitudes; however, with modern educational theories, traditional definitions must be revised to address the complexities of contemporary teaching practices. In addition, Spencer and Spencer (2008) defined competency as an individual's fundamental and intrinsic characteristics causally related to a reference standard, such as average or superior performance. These characteristics are deeply embedded and inherent attributes that pertain to work and predict or influence work behavior and performance. Lastly, Kelchtermans and Vandenberghe (1994) expanded the scope of teacher competency to include dimensions such as self-orientation, work motivation, and task perception. The ongoing advancement of educational reforms has gradually extended competency research from the realm of corporate management to the field of education. Within the academic context, the study of competencies initially emerged from learning theories, eventually evolving to encompass research and applications related to teacher and educational administrator competencies. The concept of teacher competency has evolved in tandem with societal changes. In the 1950s, teacher competency was primarily centered on proficiency in mathematics and science (Kelchtermans & Vandenberghe, 1994), developing the \"competency-based teacher education\" theory. This theory emphasises teachers' need for specific knowledge and skills. However, the academic community soon recognised that teacher competencies extended beyond subject knowledge to emotional skills. The \"human potential\" theory of the 1960s and 1970s introduced a shift towards \"human-centered teacher education,\" advocating for teacher autonomy and dignity while broadening the definition of competency (Maslow, 2013; Wijaya, Ginting, Iswanto, Nadia, & Rahman, 2023). \"teacher-centered\" to \"student-centered\" learning, thereby altering the competency requirements for teachers (Hoidn & Klemenčič, 2021; Medley & Crook, 1980). During this period, teachers were expected not only to master subject content but also to facilitate students' knowledge construction. With the deepening of educational reforms, teacher competency assessments became increasingly integrated into standardised evaluation systems, with a growing emphasis on cognitive skills (Chamba & Chikusvura, 2024). Recent studies highlighted the importance of mental skills and knowledge mastery within teacher competencies. As educational philosophies evolved, the role of teachers shifted from mere transmitters of knowledge to facilitators and constructors of learning. Likewise, Harris and Alexander (1998) argued that a teacher's primary responsibility is to support students in constructing knowledge rather than simply imparting information. Research has demonstrated that effective teaching relies on a combination of both professional qualifications and personal attributes. Studies indicated that experienced educators demonstrate enhanced creativity and problem-solving capabilities in addressing classroom challenges, as noted by Sternberg and Williams in 2002. Recent research by Amunga, Were, and Ashioya (2020) presents teacher competency as a multifaceted concept integrating pedagogical knowledge, practical skills, professional attitudes, and core values. This perspective aligns with the framework of Tigelaar, Dolmans, Wolfhagen, and Van Der Vleuten (2004), which emphasises that successful teaching requires a synthesis of technical expertise, interpersonal abilities, and individual Research on teacher competencies in China developed later than in Western nations. The field gained momentum when British teacher training reforms in 1998 established fundamental parameters for teacher competency requirements (Lan, 1998). This work was followed by significant contributions from Professor Cai at Beijing Normal University in 2001, who systematically classified China's teacher evaluation methodologies based on information-gathering approaches. The field advanced further, examining theoretical frameworks and practical applications of teacher competency evaluation in Chinese higher education institutions (Xing & Meng, 2003). Their work established crucial groundwork that continues to influence contemporary research in this domain.",
    "In China, definitions of teacher competency have increasingly aligned with international research. For instance, Xu (2004) described teacher competency as the key attributes that distinguish high-performing teachers from average ones, including abilities, self-awareness, and motivation. Later, Xu (2010) also categorised teacher competencies into threshold competencies (i.e., professional knowledge and skills) and differentiating competencies (i.e., professional attitudes and values) based on McClelland's framework. More recently, a developmental perspective on teacher competency has been grounded in diverse academic viewpoints, highlighting academic teaching, inquiry, and application (He, Liu, Liu, Zhou, & Lv, 2019). The university teachers' curricular humanistic literacy is a critical component of competency, including knowledge, skills, attitudes, and motivation, thereby underscoring its profound influence on course delivery (Yang, Zhai, & Liang, 2022). Competency models typically incorporate multiple dimensions, including skills, attributes, knowledge, and comprehension, thus presenting two fundamental tendencies of the competency model. One is a \"skill-based\" competency model. A skill-based model comprising dimensions such as planning and preparation, instruction, professional responsibility, and environmental management (Sulbidin & Awang, 2024). The other is a \"quality-based\" competency model as it emphasises the role of professional values alongside knowledge and skills in their model (Aguayo-Hernández et al., 2024; Olson & Wyett, 2000). teachers when constructing competency models. The research presents a structured competency model comprising seven key elements based on extensive behavioral event interviews and comprehensive literature analysis. This model emphasises three critical components: innovative capability, proficiency in information retrieval, and interpersonal comprehension skills. The framework provides a systematic approach to understanding and evaluating professional competencies through direct behavioral observation and theoretical foundations (Wang, Dai & Xiong, 2006). A comparative analysis to develop multiple competency models, such as the \"umbrella model,\" reflects the contributions of Chinese academia in this field (Wang, 2017). These models have enabled researchers to explore teacher competencies' characteristics, capability requirements, and impacts on teaching and research, providing theoretical support for educational practices. Studying university faculty performance has emerged as a distinct field within higher education management, drawing from established human resource principles. Academic research has increasingly concentrated on performance evaluation methodologies in higher education institutions (Desai, Damewood & Jones 2000). The initial research examined performance evaluation primarily through the lens of motivation, analysing its impact on behavioral outcomes. A significant theoretical foundation emerged that informed the development of compensation frameworks in research universities, particularly emphasising performance-linked remuneration as a crucial motivational factor (Lazear, 1997). Contemporary research emphasises that performance evaluation systems must align with institutional objectives and national strategic priorities to ensure adequate resource allocation (Grossi, Dobija & Strzelczyk 2020). Current evaluation frameworks incorporate multiple indicators, including assessment of political ideology, teaching effectiveness, and research productivity, according to recent studies by a prior study of Li and Li (2022). increasingly fell under the \"behavior and results-oriented\" framework. This perspective emphasises quantifiable outcomes and behavior-related evaluation criteria (Utami, Pranoto & Latiana, 2021). Furthermore, performance evaluations should incorporate work outcomes, behavioral performance, and potential for future development, offering a forward-looking dimension to performance research (Zhu, Wen, & Shen, 2022). Outcome performance emphasises goal achievement; competency performance highlights self-improvement, and behavioral performance focuses on attitudes and methods during the work process (Sitorus, Putri, Hidayat, & Rostina, 2021). Some scholars have explored performance from a managerial perspective, stressing the need for specificity and transparency in evaluation criteria, such as those based on professional ethics and teaching effectiveness (Li, 2022). These findings illustrate that university teacher job performance research reflects theoretical advancements and continuous policy improvement. However, more research is needed on its conceptualisation and influencing factors, especially in China. observable and evaluable behavioral performance related to their personal and school goals. Further, Sitorus et al. (2021) emphasise that evaluating teacher performance involves assessing not only task execution and conduct but also how such assessments can inform improvements in teacher preparation, classroom instruction, and research productivity. From a systematic perspective, university teachers' job performance reflects their contributions toward achieving the institution's strategic mission. For instance, Xu (2020) identified five key performance indicators for university teachers: competency, job categorisation, responsibility indicators, etc. At the same time, teachers' job performance in research institutions is defined as the work-related actions, accomplishments, and outcomes evaluated by the organisation (Pongton & Suntrayuth, 2019). These definitions reflect the latest research findings and represent the cutting edge The factors influencing university teachers' job performance are multifaceted, encompassing individual characteristics, organisational environments, and social support systems (Jameel, 2024). Empirical analysis using fuzzy mathematics models has shown a significant correlation between teachers' professional competencies and work efficiency (Chen, Hsieh & Do, 2015). Similarly, Afshar and Doosti (2016) found that emotional factors, such as job satisfaction, directly impact teaching quality and student satisfaction, underscoring the critical role of intrinsic motivation in teacher performance. Work environment, teamwork, and leadership support are key factors at the organisational level. An effective human resource management system significantly enhances teachers' work engagement (Aboramadan, Albashiti, Alharazin, & Dahleez, 2020). Similarly, teachers' psychological capacities, external resources, leadership, and organisational culture could also improve performance (Guorong & Yusuf, 2020).",
    "significantly influence teacher performance (Cahapay & Bangoc, 2021). The Chinese university teachers found that essential competencies and work motivation are core determinants of performance, providing theoretical guidance for developing differentiated performance policies (Zhao, Li & Xu, 2024). Notably, the role of professional drive and academic motivation is emerging as a research focus. Personal competencies and research motivation are critical for sustained performance improvement (Yang & Chang, 2023). Likewise, teacher performance is not only influenced by direct drivers but also shaped by career development environments and social support systems (Wang & Long, 2020). In summary, high-performing teachers excel due to personal abilities, organisational support, and social environments, reinforcing the need for comprehensive strategies to enhance university teachers' job performance. reciprocity, and the concept of organisational personification, centers on employees' perceptions of managerial support. Eisenberger et al. (1986) first systematically proposed the theory, positing that employees' recognition of organisational concern for their contributions and well-being translates into enhanced commitment and performance. Later, Eisenberger, Fasolo, and Davis-LaMastro (1990) emphasised that organisational commitment to employees is a prerequisite for employee commitment to the organisation. This foundational perspective has since been widely referenced and expanded upon. As the research extended, the focus included the influence of supervisor support (Kottke & Sharafinski, 1988). For instance, Shanock et al. (2019) refined the definition of organisational support, describing it as employees' perceptions of overall organisational care. Furthermore, Tran et al. (2021) highlighted that perceived organisational support can foster positive psychological states, ultimately enhancing performance. Conversely, McMillan (1997) criticised unidimensional approaches as insufficient to capture the In China, scholars have integrated research with localised practices. For instance, Shi et al. (2020) constructed a dual-perspective model of organisational support mechanisms within human resource management, providing a framework for the localised application of organisational support theory. Additionally, Qu et al.(2022) identified two dimensions of organisational support perception among Chinese employees—emotional and instrumental—offering new insights into localised measurement approaches. Therefore, organisational support is pivotal to positive organisational behavior, catalysing motivation and performance improvements. Organisational support theory is crucial for understanding the employee–organisation relationship and enhancing performance. Researchers explain its mechanisms by examining antecedent and outcome variables. Key antecedents include organisational justice, supervisor support, executive compensation, working conditions (Eisenberger et al., 1986), human resources practices such as decision-making participation, salary fairness, and growth opportunities (Shanock et al., 2019). Additional factors—such as organisational and employee characteristics and procedural fairness—further shape support perceptions (Ma & Zhao, 2022), while engaging frontline workers in challenging tasks may also enhance perceived support (Chen & Eyoun, 2021). Outcome variables influenced by organisational support encompass job performance, organisational commitment, and job satisfaction. Perceived support fosters behaviors beyond formal roles—such as risk mitigation, constructive feedback, and skill enhancement—thereby improving performance (Hameed, Khan, Sheikh, Islam, Rasheed, & Naeem, 2019). In collectivist cultures like China, this support positively impacts performance and reduces turnover intentions by strengthening commitment (Jano, Satardien & Mahembe, 2019; Yang & Li, 2021). Moreover, empirical evidence consistently shows positive correlations between organisational support and both overall and multidimensional job satisfaction (Anggraeni & Febrianti, 2022; Kara & Yücekaya, 2021), confirming its pivotal role in driving favorable employee outcomes (Chen, Hao, Ding, Feng, Li, & Liang, 2020; Zhan, Liu, Wang, & Yan, 2014). Competency refers to an individual's fundamental characteristics that influence work behavior and performance (Ho & Frampton, 2010; Razak, 2021). The iceberg model identifies five key components of competency: motives, traits, self-concept, knowledge, and skills (Bhanu & Sivakalyankumar, 2022; Spencer & Spencer, 2008). Prior research in previous sub-sections has established a clear link between competency and organisational performance by demonstrating that those competencies act as significant elements to enhance job performance (Kartini, Kristiawan, Fitria, Negeri, & Sugihan, 2020). In addition, competency-based performance management, particularly among middle-level managers, has contributed to predictive models guiding employee performance and HR practices (Yu, 2021). Likewise, a direct positive relationship between competency and employee performance in a study of 152 weaving companies in Bali reinforces that higher competencies lead to improved job performance (Martini, Gorda, Gorda, Sari, & Antara, 2024). Based on this, the following hypotheses are proposed: Teacher competency and organisational support are essential factors shaping educational outcomes, such as internal assets (e.g., competency, psychological capital) and external support affecting performance (Luo, Tsai, Chen, & Gao, 2021; Hobfoll, 2002). In education, tangible support enhances teaching quality, professional pride, and overall competence (Boice, Jackson, Alemdar, Rao, Grossman, & Usselman, 2021), while higher teacher competency correlates with greater organisational support (Long, Li & Li, 2022). Like Yang and Chang (2023), university teachers' competency has a significant positive effect on their job performance among 354 university teachers in Jiangsu Province, China. Like Siri, Supartha, Sukaatmadja and Rahyuda (2020), the results showed that teacher competence and commitment significantly positively affected the performance of professional teachers in the Bali context. Similar results were found by Alimmudin and Basuki (2022); teacher competence significantly affected their respective performance among 180 respondents from 18 elementary schools in the Paringin District.",
    "Initially conceptualised in the 1980s, organisational support significantly enhances employee performance by fostering responsibility, emotional attachment, and motivation (Eisenberger et al., 1986). Empirical evidence indicates that university teachers' perceived organisational support directly predicts job performance and indirectly influences outcomes via work engagement and organisational commitment (Ma & Zhao, 2020; Yang & Tang, 2020). This result is consistent with Chu, Yu, Litifu, Zhao, Wei, Wang, & Wei (2024), who found that organisational support was positively associated with task performance among 12 audit firms in Beijing in December 2020. Further, Hasan, Waseem, Sarfraz, and Wajid (2023) found that perceived organisational support positively affects job performance during the COVID-19 crisis among nursing staff of government hospitals in Pakistan. As a result, integrating performance indicators with measures of organisational support is crucial for improving teacher outcomes, especially in higher education institutions (Cao & Li, 2020). Therefore, the following hypothesis is proposed: Existing research indicates that perceived organisational support interacts with external environmental factors that motivate teachers and influence employee behavior (He & Sun, 2023). Perceived support is represented as a motivator of job performance (Wen, Huang & Hou, 2019), while high support enhances work engagement and performance (Ma, 2023). Further, organisational support significantly affects individual behavior (Liu, Mei & Wu, 2020), and higher perceived support provides more resources, leading to improved performance (Luo & Zhao, 2021). These results are consistent with prior studies by Kartini et al. (2020) and (Yu, 2021), who confirmed the direct effect of employee's competencies on their job performance. Similar findings were explored by Chu et al. (2024) and Hasan et al. (2023), who also claimed the direct effect of organisational support on employee job performance. Furthermore, the mediation effect of this relationship was confirmed by Wang and Long (2020), who also found that organisational support mediated the relationship between teacher competency and educational innovation. Therefore, the following hypothesis is proposed: By constructing this model, the study aims to systematically reveal how teacher competency, across its five dimensions—skills, knowledge, self-concept, traits, and motives—affects job performance. This paper will also explore the influence of each competency dimension on perceived organisational support and how perceived organisational support, in turn, impacts job performance. Consequently, the study will establish a theoretical framework illustrating the mediating role of perceived organisational support in the relationship between teacher competency and job performance. Adapted from Chong and Cheah (2009); Eisenberger et al. (1997); Gagné et al. (2010); Gosling, Rentfrow, and Swann (2003); Ingold, Kleinmann, König, & Melchers (2016); Villa and Calvete (2001) The quantitative study will employ a cross-sectional survey design that allows for rigorous statistical analysis of the relationships among teacher competency, job performance, and perceived organisational support (Creswell & Creswell, 2017; Legate, Hair, Chretien, and Risher, 2023). Specifically, the study will utilise descriptive statistics, reliability analyses, confirmatory factor analysis, and structural equation modeling to validate the measurement models and examine the structural relationships among the variables. Province. According to the 2024 national higher education institutions list from the Ministry of Education of China (Ministry of Education of the People's Republic of China, 2024), there are 60 universities in Henan Province. Consequently, university teachers from these 60 universities will be selected as the target respondents for the survey via questionnaires. This study will consider the sample representativeness, the sampling method's complexity, constraints on researchers' time and resources, and the available research budget. Therefore, this study proposed to use a probability sampling approach using simple random sampling. In calculating the required sample size with G Power software, a small effect size (d = 0.2; Cohen, 1988) was assumed, with an expected statistical power of 95% and a significance level of α= 0.05. The calculation indicates that a minimum sample of 314 university teachers is sufficient. The survey instrument is developed based on established scales from prior studies. The competency scale was adapted from Chong and Cheah (2009), Gagné et al. (2010), Gosling et al. (2003), and Villa and Calvete (2001). The job performance scale is based on Ingold et al. (2016), and the perceived organisational support scale is adapted from Eisenberger et al. (1997). Although these measurement tools have been validated in previous research, researchers modified them to suit the specific context of Chinese universities, ensuring both reliability and validity.",
    "Descriptive statistics and reliability analyses will first be conducted using SPSS, while structural equation modeling will be employed via AMOS to test the hypothesised relationships among the constructs. Bootstrapping techniques examined mediation effects. This research examines how teacher competency relates to job performance at universities in Henan Province, introducing a novel theoretical framework that advances the understanding of these interconnected factors. While competency studies emerged from business management principles, the application to Henan's higher education sector remains early. The study adapts traditional competency models to university teaching contexts by analysing five key dimensions: skills, knowledge, self-concept, traits, and motives. By developing this specialised framework, the research offers fresh insights into how teacher competency functions within higher education settings and contributes to expanding competency theory's applications in academia. This structured approach helps illuminate the complex relationships between different aspects of teaching competency and provides a foundation for future research in this field. Furthermore, this study incorporates the theory of perceived organisational support as a mediating variable in the relationship between teacher competency and job performance, offering a deeper analysis of the role of organisational support. Perceived organisational support theory (Eisenberger et al., 1997) suggests that employees who feel cared for by their organisation will likely exhibit increased responsibility and work commitment. However, current research on organisational support tends to focus on corporate employees, with limited attention given to faculty members in Henan universities. By constructing a theoretical framework linking competency, perceived organisational support, and job performance, this study fills a significant theoretical gap, deepening the application of perceived organisational support theory in higher education and broadening the scope of organisational support research in knowledge-worker populations. Additionally, this study will employ a multidimensional perspective, systematically exploring how teacher competency influences job performance through various pathways while uncovering the mediating effect of perceived organisational support. This dual-pathway model overcomes the limitations of single-dimensional analysis, creating a comprehensive theoretical framework that provides a solid foundation for subsequent empirical research. It fosters further integration and development of competency, organisational support, and job performance theories. The study emphasises the importance of teacher competency and organisational support in higher education, extending the application boundaries of modern human resource management theory and providing new theoretical support for the professional development of university teachers. This deepens our understanding of the factors influencing teacher job performance and offers scientific evidence for research on higher education management, teacher evaluation, and career development, thus laying a strong foundation for future theoretical and practical studies. This study centered on the relationship between teacher competency and job performance in Henan Province universities and constructed a comprehensive theoretical framework. It systematically develops a model of the multidimensional structure of competency, the mediating role of perceived organisational support, and the impact mechanism on job performance, offering a new perspective for theoretical and practical research in higher education. By reviewing the existing literature, this study classifies teacher competency into five core dimensions—skills, knowledge, self-concept, traits, and motives—thus enhancing the scope of competency theory. Unlike traditional unidimensional studies, this multidimensional model more accurately reveals the structural characteristics of teacher competency, providing theoretical support for teacher evaluation and development. The model also introduces perceived organisational support as a mediating variable, establishing its key role in the relationship between competency and job performance. By integrating perceived organisational support theory with higher education management, this research highlights the impact of organisational support on teacher job performance. It establishes a mediating effect between teacher competency and job performance. It extends the applicability of organisational support theory to the faculty population in Henan Province. The research model provides scientific evidence for universities in teacher selection, training, and evaluation while offering practical pathways for improving the quality of higher education in Henan. This framework helps Author Contributions Statement: The authors worked together on this paper. Conceptualisation: Wen Xu, Methodology: Wen Xu, Formal analysis and investigation: Wen Xu, Writing - original draft preparation: Wen Xu, Writing - review and editing: Kyra Law Ley Sy, Supervision: Gooi Leong Mow. All authors have read and agreed to the published version of the manuscript. Funding Statement: This study was supported by two projects from the Henan Provincial Department of Education, China: (1) the 2025 Henan Province Philosophy and Social Sciences Education Strengthening Project, \"The Relationship Between University Teachers' Competencies and Job Performance Under the Background of Artificial Intelligence in Henan Province\" (Grant No. 2025JYQS0502); and (2) the 2024 Henan Province Key Scientific Research Project of Higher Education Institutions, \"A Study on the Construction and Application of a Competency Model for Young University Teachers in Henan Province in the New Era\" (Grant No. 24B880064).",
    "Acknowledgment: The authors would like to thank Multimedia University and Segi University, the respondents who participated in this study, and the editors and anonymous reviewers of the International Journal of Management, Finance, and Accounting for their valuable feedback and comments."
]