[
    "Zhang D. Analysis of Henan Province grain production problems based on radar chart. Probe - Plant & Animal Sciences. 2022; 4(1): 1467. https://doi.org/10.18686/ppas.v4i1.1467 Abstract: Henan is the main grain production area in China, which has made positive contributions to the national food security since its history. However, through the analysis of Radar chart and questionnaire survey, it is found that there are still some problems to be solved in the current food production. In view of the situation of Henan grain production, this paper analyzes the causes of the problems in detail and puts forward specific suggestions. Copyright © 2022 by author(s). Probe - Plant & Animal Sciences is published by Universe Scientific Publishing. This work is licensed under the Creative Commons Attribution (CC BY) license. https://creativecommons.org/licenses/b y/4.0/ Agriculture is the foundation of the state and the origin of the state’s governing measures.Henan is a major agricultural province and grain producer. Agriculture, especially grain production, has a decisive impact on the whole country.The CPC Central Committee and The State Council have always attached great importance to the grain production in Henan province and placed high hopes.General Secretary Xi visited Henan and attended the deliberation of the Henan delegation during the NPC and CPPCC sessions, and made important instructions on food issues each time.In view of the current situation of grain production in Henan province, this paper analyzes the main problems troubling the food security in Henan province, and puts forward specific countermeasures and suggestions. Henan is located in the east of central China, between 110°21′–116°39′ east longitude and 31°23′–36°22′ north latitude. It is about 580km long from east to west and 550km wide from north to south. The total land area of the province is 167,000 km2, ranking 17th among provinces and cities in China [1]. The annual frost-free period of the province is 189–240d, the average annual sunshine is 1848.0-2488.7 h, and the average annual temperature from south to north is 12.1–15.7℃ [2]. Henan province has a typical monsoon climate, with an average annual precipitation of 532.5–1380.6mm, but the spatial and temporal distribution of annual precipitation is uneven. Annual precipitation is mainly concentrated in June to August in summer, accounting for about 45–60% of the annual precipitation. The soil in Henan is mainly brown soil, brown soil, paddy soil and so on [3]. According to the data released by the National Bureau of Statistics, in the past ten years, the sown area of grain crops in Henan Province has remained above 10,000 hm2, with no significant fluctuation (Figure 1). Since 2013, grain yield has maintained over 60 million tons all year round, and presented an increasing trend. Based on the above data, using radar chart analysis, it can be seen that the grain production in Henan province is generally stable and reasonable in structure, but there are still some inter-annual fluctuations in the yield per unit area and total yield. After questionnaire survey, it is found that there are mainly the following prominent problems: Thanks to the preferential policies of “direct subsidies to grain producers” and “Subsidies for growing superior seed varieties” successively implemented by the state, farmers’ income from planting food crops increased more, but the price of agricultural means of production, mainly chemical fertilizer, agricultural film, pesticides, agricultural diesel, also rose rapidly, resulting in the state subsidy preference occupied by the rising price of agricultural means of production.Compared with cash crops and breeding industry, grain planting efficiency is low, and the cost increase reduces Although the government has increased the construction of agricultural infrastructure in recent years, due to various factors, the overall grain production infrastructure in Henan is still relatively weak, and the ability to resist natural disasters is still insufficient.Mainly: insufficient construction capital investment; infrastructure construction lacks local conditions, not closely combined with the local food production development; infrastructure construction management is not orderly; social capital is difficult to introduce, failed to form the use of construction funds. Socialized service can use the strength of all aspects of society to carry out professional division of labor and intensive service, which can effectively overcome the disadvantages of the current small scale of grain production and operation subjects.For Henan Province, the following main problems exist: imperfect service system, small number of scientific and technological service personnel, weak technology of agricultural socialized service, far from meeting the needs of farmers for socialized service; second, narrow service scope, key links of food production and weak service; third, no real community of interests with farmers, weak service awareness and poor service quality.",
    "With the rapid improvement of living standards, people generally began to pay attention to the quality of agricultural products, both required to eat full, but also required to eat health.At present, in the grain production of Henan Province, due to a certain amount of farmland soil pollution, the ecological environment is constantly deteriorating, which then affects the grain production, especially the grain quality problem is particularly prominent.The main manifestations are: excessive use of pesticides and extensive use of chemical fertilizer cause farmland soil pollution and grain pollution, and the improper use of agricultural film also cause soil pollution. Establish a sound price management system for pesticides and fertilizers in the market, macro-control the market prices of major agricultural materials, and increase farmers’ enthusiasm for growing grain; Strengthening infrastructure to reduce the cost of food production; We should strengthen the construction of information channels, It is necessary to explore the establishment of agricultural risk compensation mechanism, improve agricultural policy insurance policy, and improve the ability of disaster prevention and resistance according to the practical problems of henan province. In view of the serious impact of drought on grain production in Henan province, the establishment of water-saving irrigation system, and actively promote and develop advanced and applicable water-saving technologies and irrigation methods; We will gradually increase the proportion of government investment, strengthen infrastructure construction and increase grain production capacity. It is necessary to improve the ability of agricultural technology extension personnel, hire experts to carry out professional and systematic training for service personnel working in the front line, and promote professional and moral improvement; We should innovate service methods, make full use of training sessions, on-site guidance and new media communication forms such as Tiktok and wechat to improve the efficiency of agricultural technology promotion. We should improve the promotion system, explore the mode of “experts + agricultural technicians + large growers or cooperatives + farmers”, and implement the mode of experts’ general guidance, technical personnel to guide large growers and drive ordinary farmers to speed up the promotion. To strictly control and strengthen the construction of farmland quality; To implement the balance between occupation and supplement, strictly control the quality of cultivated land; To strengthen monitoring and evaluation, detailed grasp of quality dynamic change; To strengthen leadership, earnestly implement the responsibility of construction and management; To propaganda and guidance, and constantly improve the awareness of environmental protection; We should rely on science and technology to promote the rational use of chemical fertilizers and pesticides. joint Fundings: Henan Science and Technology Think Tank research project “Research on Henan Agricultural Issues under the Background of Food Security”, No.: HNKJZK- 2021-01C."
]