[
    "The report of the 19th National Congress of the Communist Party of China puts forward the concept of high-quality development in the new era and the strategy of rural revitalization, and family farm is an important part of Rural Revitalization and promoting the development of agricultural economy. Family farm not only insists on the basic position of family management, but also overcomes the shortcomings of traditional small-scale management of farmers. It is an effective way to develop moderate scale management of land. The current family farm in China refers to a new type of agricultural operation subject that takes family members as the main labor force, engaged in large-scale, intensive and commercialized agricultural production and management, and takes agricultural income as the main source of family income, and operates and develops under the land \"collective ownership\" and does not change the current family contract management mode. In the process of the rapid development of modern agriculture, the innovation of agricultural management mechanism and the cultivation of family farms play an important role in promoting the efficiency of agricultural production and economic benefits, and also in promoting the implementation of large-scale and intensive agricultural management in China. The emergence of family farms has changed the traditional mode of production and management, and has provided an alternative direction for the development of agriculture in China. It has become one of the new agricultural management subjects. This research analyzes the current situation and problems of development of family farms in Henan Province, formed and proposed appropriate countermeasures to eliminate them: formulate and implement appropriate measures to manage loans, increase the share of innovative financial products; to popularize the land policy, to improve the market mechanism, to formulate the reasonable norms, to calculate expenses and to define mechanisms of economic compensation of transfer of the earth; to strengthen the professional training of employees and combine modern experience in breeding and production technologies; optimize agricultural insurance to avoid risks. В умовах чинного законодавства Китаю сформовано концепцію високоякісного перспективного розвитку та стратегію відродження сільських територій. Сімейне фермерське господарство ідентифіковано важливою частиною відродження сільських територій та сприяння розвитку аграрного сегменту економіки. Даний спосіб ведення господарства має в собі не лише основні позиції сімейного управління, але й долає недоліки традиційного управління дрібними фермерами. Це дієвий спосіб розвитку ефективного землекористування. Сучасна сімейна ферма в Китаї відноситься до нового типу діяльності в аграрному секторі, яка поєднує членів сім’ї в якості основної робочої сили, займається невеликим, інтенсивним та комерційним сільськогосподарським виробництвом та управлінням. Фінансовий результат даного виду діяльності виступає основним джерелом сімейного доходу, і функціонує та розвивається в межах колективної власності на землю і не змінює поточний режим управління сімейними контрактами. Процес сталого розвитку сучасного агровиробництва, запровадження інноваційного механізму управління та розвитку сімейних ферм відіграють важливу роль у підвищенні ефективності сільськогосподарського виробництва та фінансових показників діяльності, а також у сприянні реалізації масштабних та інноваційних рішень в управлінні сільським господарством Китаю. Виникнення сімейних фермерських господарств змінило традиційний спосіб виробництва, господарювання та створило альтернативний напрямок розвитку сільського господарства Китаю. Це стало одним із нових векторів розвитку управління аграрним сектором економіки. У даній науковій роботі проаналізовано поточну ситуацію та проблеми розвитку сімейних ферм у провінції Хенань, сформовано та запропоновано відповідні контрзаходи щодо їх усунення: сформулювати та запровадити відповідні заходи щодо управління позиками, збільшити частку інноваційних фінансових продуктів; популяризувати земельну політику, вдосконалити ринковий механізм, сформулювати обґрунтовані норми, розрахувати витрати та визначити механізми економічної компенсації передачі землі; посилити професійну підготовку працівників та поєднати сучасний досвід в селекції та технологіях виробництва; оптимізувати сільськогосподарське страхування для уникнення ризиків. With the gradual acceleration of the process of agricultural transformation and upgrading in China, relevant supportive policies have been introduced one after another, and family farms have developed rapidly in all parts of China, becoming an important force to promote the fine management and scale management of agriculture [2]. by the end of 2018, there were 600000 family farms in the agricultural and rural sector in China, more than four times more than in 2013 (Figure 1). According to the monitoring, the average labor force of each family farm is 6.6, including 1.9 employees. The management of cultivated land is mainly leasing, and scale management is realized by transferring land. The total area of family farm land in the register is 160 million mu, of which 71.7% comes from lease. There are various types of industries, including planting, animal husbandry and fishery, as well as family farms with combination of farming and raising, of which 62.7% are family farms with planting, 17.8% are animal husbandry, 5.3% are fishery, and 11.6% are combination of farming and raising (Figure 2). In 2018, the total annual sales value of agricultural products of family farms in China was 194.6 billion yuan, with an average of more than 300000 per family farm, and the overall business situation was good.",
    "However, due to the short development time, lack of experience, and the weak status of agricultural industry, family farms are also faced with extensive management, land circulation is not smooth, financing difficulties and other problems, which seriously restrict the healthy development of family farms. Therefore, it is of great significance to pay attention to the development of family farms and explore and solve the practical problems of family farms. The logical starting point of the research on the development of family farm is the research on the origin and formation mechanism of the institutional change or organizational innovation, such as the mode of agricultural management. For the development of family farms, most scholars often analyze and study the scale and nature of farms. There are few researches from a certain region or family farm itself. Because of the large area of China, each region has different characteristics. There are often deficiencies in the research from the whole country's family farm. This paper selects specific provinces, Henan Province for detailed analysis, combined with the agricultural characteristics of Henan Province, analyzes the status of family farms in Henan Province, finds out the problems, and puts forward solutions. We are committed to helping family farms in Henan Province develop better and promote the revitalization of rural areas in Henan Province. The situation of agricultural resources in the place where the family farm is operated. Including the scale and structure of agricultural land operated (hill, 2006; iraizoz et al., 2007; Euroupean Commision, 2010; Zhang Zhongming, Qian Wenrong, 2010; Li Gucheng, etc., 2013), geographical location, traffic conditions, scale degree of farmland, natural attributes of farmland (such as soil fertility, pH, etc.), improvement degree of irrigation and other water conservancy facilities, climate, quality and distribution, etc [3]. (chrominska M, 1994; Antun Petri tchevi ć & etc., 2001, Zoran vuka š inovi ć & etc., 2008; Anke Bischoff, 2012; Wei Jinyi, Qi spring festival, 2015). Market environment factors. It includes the economic cycle (Anne Gadomski & etc., 2005; Gadomski Anne & etc., 2005), the price and fluctuation of agricultural products, the channel types and smoothness of agricultural products circulation, and the perfection of the socialized service system of agricultural production (Allen & Harris, 2005; Nick Evans, 2009; Gallego, J. R., 2010; Shen Ru, Wang Shujin, 2014; PU Xiao, ye Liangjun, 2015; Lu Shanshan, 2015), transaction cost of agricultural products circulation (Marsden et al., 1989; Blandford, 2006), etc. For example, the research of William P. Browne & Mark h. Lundgren (1987) shows that family farm mutual aid organizations have a positive impact on self-interest protection and risk resistance in the process of family farm development. Agricultural science and technology level and extension (W. lesser, 1990; Garcia Martinez et al., 2008; s Hamilton, 2014). Science and technology are the first productive forces (Deng Xiaoping, 1988). Ratan (1968) demonstrated that there is a very complex relationship among technological change, institutional change and economic development. Research by radoje nikolitch (1969) confirmed that technological progress is closely related to the development of family farms, affecting and determining the choice of family farm management mode. Operator's own quality. Including the educational level of operators, the times of participating in various agricultural technical training or experience exchange, the ability of interpersonal communication and social activities of operators, the psychological quality of coping with various risks and predicting the future, the ability of organizing agricultural production and management, the attitude and ability of learning new skills, knowledge, experience, the use of more advanced operation equipment and other new things, (salmon, 1980; Matthews and deary, 1998; young et al., 2003; ondersteijn et al., 2003; p.l.nuthal, 2006; Guo Hongdong, Lou Dong, 2006; D. zagorec stockbreeding, 2009; j.h.c. Costa & etc., 2013). Financing difficulties. Luo Gehong (2015) is also an important factor affecting the development of local family farms due to the lack of financing channels and weak insurance. The analysis of Zhang Mingyue and Xue Xingli (2016) shows that the difficulties in farm financing and the lack of agricultural insurance system have a significant impact on the development of family farms [4]. In conclusion, scholars at home and abroad have carried out some research work in the field of family farm development, which provide a very important theoretical basis for the development of this study.",
    "Henan Province, with a long history and rich resources, is a major agricultural product producing area and an important mineral resource province. With a large population, abundant labor resources and huge consumer market. Located in the central area of China (Figure 3). It is an important comprehensive transportation hub and information flow center of people flow and logistics. It is a major agricultural province and a major food transformation and processing Province in China, with the economic aggregate ranking the fifth in China. In 2018, the agricultural production situation was stable, and the grain production was bumper again, with a total grain output of 66.49 million tons (Figure 4). Among them, the output of summer grain is 36.153 million tons, and that of autumn grain is 30.337 million tons. The annual output of eggs was 4.135 million tons, and that of milk was 2.026 million tons. The output of pork, cattle, sheep and poultry is 6.3 million tons. From the perspective of agricultural modernization, Henan Province, as a large province of agriculture and population, the contradiction between people and land is particularly prominent. Therefore, in the situation, it is particularly important to innovate and develop a new agricultural management model. At present, family farm is considered to be the most reliable and efficient management mode in agricultural production. This kind of management mode of family farm has high stability, which is helpful to the protection and sustainable utilization of cultivated land. It can achieve moderate scale operation, easily stimulate farmers' demand and application of science and technology, and promote the development of agriculture to intensive, specialized and organizational. At the same time, family farm is also committed to the cultivation of new professional farmers, making the government's agricultural policy more specific and effective, which plays an important role in increasing agricultural production and farmers' income. As the continuation and improvement of the original family contract management mode, family farm can retain the advantages of farmers' management and meet the characteristics of agricultural production [5]. As the conditions for the cultivation of new vocational farmers and the foundation of modern agricultural organizations, family farms can also overcome the disadvantages of small farmers. Up to now, the overall development of family farms in Henan Province has been stable. The number of family farms identified by the agricultural and rural departments in Henan Province has increased from 3974 in 2014 to 10342 in 2018, an increase of 1.6 times in five years, with an average annual growth of 27%, showing a good momentum of development. In 2018, the total annual sales of agricultural products of family farms recognized by the provincial agricultural and rural departments reached 3.344 billion yuan, with an average annual sales of 323300 yuan per family farm; 355 family farms had registered trademarks, and 197 family farms passed the quality certification of agricultural products [6]. There are 2796 demonstration family farms above the county level and 254 provincial demonstration family farms in the province. In 2018, the family farms in the province received financial support funds of 21.726 million yuan, with a total loan of 160 million yuan. In order to more accurately investigate the development of family farms in Henan Province and the obstacles, a questionnaire will be sent out in the form of network in 2020. In this survey, 112 questionnaires were sent out, 104 questionnaires were collected, the recovery rate was 92.9%, of which 101 were effective questionnaires, the effective rate was 97.1%. The questionnaire has a wide coverage, high recovery rate and effective rate, and scientific sampling. Based on the analysis of the basic situation of the sample, the age structure and the total number of effective samples are 101. The majority of the survey population is 91 men, accounting for 90% of the total sample, and 10 women, accounting for 10% of the total sample (table 1). In the survey group, there are 2 operators under the age of 25, accounting for 2%; the majority of family farm operators are in the age of 30-55, accounting for 85, accounting for 84.2%; there are 14 operators over the age of 55, accounting for 13.8%. According to the survey, the education level of family farm operators in Henan Province is the highest in junior high school, accounting for 76%, 15% in senior high school and technical secondary school, and 9% in junior college and above. In terms of domestic farm employees, the majority are 2-3 workers per household, accounting for 72.5% of the total sample. Among them, the proportion of only one family worker is 5.5%, the proportion of 4-5 family workers is 19.8%, and the proportion of 6-10 family workers is 2.2%.",
    "The business scope of family farm includes six types: planting, breeding, planting and breeding combination, planting and leisure combination, breeding and leisure combination, planting and breeding and leisure. Among them, the most family farms are planted, accounting for 78%, 6.9% of which are combined with planting and breeding; 10 households are planted and recreational, accounting for 9.9%; the rest are: 5.2%. The existing land scale of family farms: there are 9 family farms with less than 50 mu of transfer land, accounting for 8.9%; 36 family farms have 51-100 mu of transfer land, accounting for 35.7%; 41 family farms have 101-150 mu of transfer land, accounting for 40.7%; and 151-200 mu of transfer land There are 8 family farms, accounting for 7.9%; 4 family farms with 201-300 mu of transfer land, accounting for 3.9%; 3 family farms with more than 300 mu of transfer land, accounting for 2.9% (Figure 5). From the statistical data of the operating area of family farms, it is not difficult to see that the area of family farms is concentrated in 101-150 mu, which is also the best range of moderate scale. In terms of family farm financing, the main source of operating funds is self owned, accounting for 76%. Private lending has become the second source of funds for operating family farms, accounting for 12%; bank lending is the third source of funds, accounting for 9%; other channels are 3%. At the same time, in terms of agricultural insurance, only 46 farmers, accounting for 45.5%. Among the agricultural households without insurance, the price factor accounts for 74.5% and the insurance content accounts for 25.5% (Table 2). At the same time, according to the 2018 survey report of Henan family farm, the social service system is still weak, and the infrastructure conditions need to be improved. In the sales channel of family farm products, 40% of the businesses purchase products on site, 34% of them deliver goods by themselves, 20% of them receive goods by themselves and deliver goods by themselves, and only 4% and 2% are sold through agricultural cooperatives and online sales respectively (Figure 6). Another 22% of the farms reported poor sales channels. 52% of the farms hope to strengthen the role of government guidance, strengthen the docking of agricultural products production and market; 50% of the farms hope to increase public services such as weather, disease and pest monitoring and reporting, product supply and marketing information. Many farms hope that the government will further increase its support for family farms to improve water conservancy supporting facilities, as well as other productive auxiliary facilities such as air drying and storage. In order to better explore the constraints of the development of family farms in Henan Province, according to the survey data and spas software, the factors that affect the development of family farms in Henan Province are as follows: Land resource constraints are tight and land use is difficult [7]. The cultivated land area of the whole province is 121683400 mu, the per capita cultivated land is 1.27 mu, the per capita cultivated land of the rural population is 2.18 mu, the per capita cultivated land of the rural households is 5.98 mu, and it is divided into several plots, so it is difficult to transfer the land. According to the management scale of 100 mu, it is necessary to transfer the land of 16 farmers, about 40 plots. It is difficult to transfer the land contiguously, and the improvement of scale management efficiency is limited. Secondly, the cost of renting land is high. As a traditional agricultural area, our province has good farming conditions, coupled with agricultural support and protection subsidies, which has increased the price of land rental. In 2018, the average rent of family farms in the province was 998.89 yuan / mu, far higher than the national [8]. There is a large demand for funds in family farms, and the problem of financing is prominent. The difficulty of financing is the bottleneck of the development of family farms, which is mainly manifested in the complexity of loan procedures, the small scale of loan and the short term of loan. There is no collateral required by financial institutions in the farm. According to the survey data, the operation funds of family farms are mainly self raised funds, and the loan demand for the operation funds of the farm has not been effectively supplied. In terms of the actual sources of farm funds, the proportion of private loans is much higher than that of bank loans [9]. In the existing agricultural financial supply market, it is difficult to provide financial support to family farms because of the small scale and short term of loans.",
    "The management level and quality of family farm operators need to be improved. According to the requirements of modern agricultural development, the person in charge of the farm needs to have comprehensive skills such as understanding of agricultural technology, good management and management. However, at present, most of the family farm managers in Henan Province lack of new knowledge and application of new technology, lack of modern management concept, which is significantly reflected in the financial management, no accounting records and accounting, and need to improve the quality of producers and operators and the level of farm management [10]. Only 36.59% of the family farm operators have received training in economic management knowledge. The mechanism of agricultural risk dispersion still needs to be improved. The existing agricultural insurance system has the problems of insufficient prevention and control and emphasis on compensation. The awareness of agricultural production prevention and control is low, and the agricultural risk management system is imperfect. In terms of agricultural risk compensation, the coverage is low and the level of agricultural insurance is low. If there is a huge disaster in a short period of time, resulting in heavy agricultural losses, family farms will face higher agricultural risks. There is a big gap between family farm's lower ability to resist natural disasters, higher loss of income and lower level of security, and the stability of agricultural production is poor. In order to improve the current financial difficulties of family farms, we should build an innovative environment and innovation power based on the problems faced by family farms in Henan Province, formulate and launch appropriate loan management measures according to the needs, and increase the innovation of financial products. The existing innovative loan financial services should be widely promoted. In order to improve the loan mechanism of family farms, there are still many defects in the current land property right system, especially in the absence of collateral in most family farms. We will increase state subsidies on the basis of the original policies. Establish and improve the internal financial management system of family farms. Encourage multiple social capital to invest in the construction of family farms. For example, the land circulation contract can be used as collateral, the order contract can be used as collateral, and the processing equipment can be used as collateral. To ensure the sustainability of the production capital chain of family farms, and strive to avoid the break of the production capital chain of farms, provide more sustainable financial support for family farms, and create a good financing environment. Improve the land transfer system and appropriate large-scale management, popularize land policies and regulations related to land transfer among farmers, improve the market mechanism for land transfer, formulate more reasonable land transfer norms, define transfer costs and define economic compensation standards. Efforts should be made to solve the phenomenon of land fragmentation. On the basis of moderation, reasonable land transfer period should be formulated. On the basis of comprehensive consideration of the wishes of both sides of the land transfer relationship, the actual situation of each region and relevant factors, a clear land transfer period is conducive to the clarity of rights and obligations of all parties and the reduction of land transfer costs. Should cultivate new professional family farmers, pay attention to the education and training of the existing family farm workers, focus on the enhancement of their business management ability and the improvement of the level of agricultural technology, and improve the comprehensive quality of family farm managers and operators. Strengthen the professional training of farmers, and combine the experience of breeding and professional technology. At the same time, on the premise of strengthening the construction of basic education on the farm, we should attract and encourage college students to return to their hometown and start businesses, so as to constantly supplement fresh blood for the development of farm families. The establishment of demonstration family farms will set an example for the development of family farms in Henan Province and play a leading role. Optimize agricultural insurance and provide risk aversion guidance. The imperfection of agricultural insurance makes it difficult for family farms to cope with the risks, which hinders their further development. In terms of risk response, we should expand the coverage of agricultural insurance, constantly innovate and improve the types of insurance, increase the support of policy insurance, and improve the standard of claims settlement. Actively carry out comprehensive insurance business and agricultural insurance policy mortgage loan. We will optimize insurance services and improve the family farm insurance system that combines government subsidies with commercial insurance. Establish and improve the mechanism of disaster sharing and reinsurance to resolve the agricultural risks caused by regional major natural disasters and major epidemics. Make full use of financial tools to help family farms avoid market risks.",
    "With the help of the government and the implementation of policies, detailed guidelines for family farm support shall be formulated in strict accordance with national documents. At the same time, special development fund for family farm finance is set up to encourage and support family farm in market circulation, capital circulation, tax and other aspects, so as to provide good conditions for its development. We also need to improve the relevant legal system. To integrate policies and funds, at present, all departments have policies and funds to support family farms, but they are relatively scattered, prone to waste and low efficiency. Governments at all levels should integrate policies and funds to ensure the implementation of policies and the full use of funds. 1. Wang, Hui and Yang, Chaoxian (2018), “Analysis of land transfer characteristics and influencing factors of farmers in traditional agricultural areas ”, Jiangsu agricultural science, vol. 5, pp. 358-362. 2. Yuan, Meng and Yi, Xiaoyan (2017), “The current situation problems and cultivation suggestions of family farm development in China: Based on 343000 samples in the special survey of the Ministry of agriculture”, China's agricultural resources and zoning, vol. 6, pp. 184-188. 3. Xia, Zhuzhi (2014), “Family farm: current situation, challenge and Enlightenment: an empirical survey of Pingzhen, Fanchang County, Anhui Province”, Journal of the Party School of the CPC Ningbo Municipal Committee, vol. 4, pp. 92-99. 4. Cheng, Chunli (2015), “An empirical analysis on the development status and Countermeasures of family farms in Henan Province: Based on the sampling survey of ten counties (cities) in Henan Province”, Reform and strategy, No. 10, pp. 105-110. 5. Liu, Zhaoyong (2015), “Investigation and Analysis on the growth conditions and policy support of family farms: Based on the typical investigation in Henan Province”, Research world, vol. 1, pp. 27-31. 6. Jiang, Bo (2013), “Research Report on the development of family farms in Liaoning Province”, Agricultural economy, vol. 11, pp. 9-10. 7. Guan, Fuxin (2018), “Study on land management scale of grain family farm in North China Plain: Taking Henan Province as an example”, China's rural economy, vol. 10, pp. 22-38. 8. Jiang, Yonghong and Qi, Mingxia (2018), “Generation mechanism, personal endowment and family farmer cultivation”, China population, resources and environment, vol. 5, PP. 170-176. 10. Zhang, Chaohua and Huang, Yang (2017), “Investigation and Research on some key issues in the development of family farms”, Economic development, vol. 7, PP. 81-87."
]