[
    "of listed companies in Henan Province from the factors of corporate profitability, operating capacity and solvency. Combined with the relationship with the government, employees, shareholders, customers, creditors and suppliers and other stakeholders, it conducts factor analysis and multiple regression analysis on the impact of comprehensive corporate performance indicators. In recent years, with my country's reform and opening up, how to effectively promote enterprise development and how to improve operating performance has become a top priority for enterprises. Therefore, the overall performance of the company is evaluated according to the relationship between the company and its stakeholders. This article uses SPASS technology to analyze the three major capabilities of the enterprise, abandons the traditional direct measurement indicators, and uses factor analysis to measure the six major relationships between the enterprise and its stakeholders (with the government, employees, shareholders, customers, creditors, and suppliers). Comprehensive performance indicators of performance, through the use of multiple regression analysis, combine the results and draw corresponding recommendations. This paper, based on the three major capabilities of enterprises, extract the comprehensive indicators of financial performance rather than simply using the return on net assets, taking into account the interpretation of the comprehensive. support in the development of enterprises, so the relationship with the government have a great relationship in improving the performance of enterprises. 2) the relationship with the employees. Employees as the main members to provide services to the enterprise, have an impact on the output, supply and sales of products; while enterprise performance is often dependent on the level of production and supply chain, so the enthusiasm of the production staff and good internal relations is helpful to maintain a health cycle of business performance. 3) the relationship with the shareholders. The financing channels of enterprises are mainly divided into equity financing and debt financing. The issuance of shares is the main way of equity financing. The holders of shares i.e. shareholders have important influence on the working capital of enterprises, and they ultimately affect the performance of enterprises and long-term development by changing the enterprise governance through changes in the company's equity. This paper uses the solvency, operational capacity and development ability to refine the comprehensive performance indicators of enterprises, and then analyse their impact on the stakeholders. It mainly selects three variables for explanation. First, the explanatory variable: F value, the comprehensive indicators of enterprise performance is used as a measure; the second is the interpretation variable which refers to the relationship with the stakeholders, including the relationship with the Government, the staff, shareholders, customers, creditors and suppliers. The third is the control variables: the year of listing, the nature of enterprises, business scale and industry.[1] 1) the relationship with the government. Government as the top of the enterprise regulatory authorities, not only guides enterprises through its policies, but also will give some 4) the relationship with customers. The presence of the customers can explain whether the product is selling, whether it meets the needs of the public, whether the company achieves the greatest return at the lowest cost. Customers’ confidence and loyalty in the product will affect the performance of enterprises through sales. 5) the relationship with creditors. Creditors are connected to enterprises based on the debt financing channels. On one hand they can ease the company's financial pressure and reduce financial risk, on the other hand they can produce the tax shield effect which leads to legitimate tax avoidance.[2] enterprise performance and the relationship with creditors. 6) the relationship with suppliers. Suppliers as upstream enterprises providing raw materials for downstream enterprises, they need to set up a reasonable order price, do not make price adjustment without agreement, and establish Hypothesis 6: There is a positive correlation between enterprise performance and the relationship with suppliers. B. Index selection and variable definition The data from this paper are from www.eastmoney.com and empirical analysis is carried out based on the panel data of A-share listed companies in Henan Province from 2012 to 2014. Screening the sample data during the study according to the following principles: 1.exclude ST and *ST type companies; 2.exclude listed companies that are missing data; 3.exclude listed companies with abnormal value of indicators so as not to affect the objectivity of the study, The According to the above principles after filtering, we get 70 sample business that meet the requirements. Data Analysis and Model Construction is conducted using SPSS17.0.[3] values of maximum, minimum, mean and standard deviation, to aid the study later in this paper. The results of the descriptive statistics are shown in Table 2.",
    "From Table 2, it can be seen that the standard deviation of total assets, net assets, business income, current assets, current liabilities, sales cost and accounts receivable turnover ratio of enterprises is above 1000, which shows that the difference among enterprises is huge. This is due to the strength disparity of enterprise in different regions and with different sizes in the same industry.[4] In this paper, the panel data of 70 listed companies in Henan Province for the years 2012-2014 are selected. Descriptive statistics are used to analyze the explanatory variables. The overall number of samples is judged from the This paper chooses the comprehensive index as the explanatory variable, according to the previous analysis of the total asset net profit margin, net asset net profit margin after tax and sales profit margin under profitability; accounts receivable turnover ratio, total asset turnover ratio, inventory turnover ratio and accounts payable turnover ratio of operating capacity; current ratio, quick ratio, cash ratio and liabilities under liquidity, a total of 11 indicators for using for factor analysis. The cumulative value of the variance of the factor after the extraction is higher, indicating that the extracted factor can describe these nine indexes well. According to the analysis of the variance contribution rate of Table 4, we can see that the variance contribution rate of Factor 1 is 37.936%, the characteristic value of which is 3.414, the variance contribution rate of Factor 2 is 18.196%, the characteristic value is 1.638, the variance contribution rate of Factor 3 is 13.272%, and the characteristic value is 1.194. These three initial eigenvalues are greater than 1 which explains the variance of 69.404%. Respectively, the Factors 1, 2, and 3 are named F1, F2 and F3. The variance contribution rate (37.936%, 18.196%, and 13.272%) of the three principal components is normalized, and the variance contribution rate of each principal component is the weight, obtains the expression of the comprehensive performance index F as: Before the linear regression analysis, the variance expansion factor coefficient test is carried out to clarify whether there are serious multiple collinearity problems between the model variables. The test results are shown in the following table: In general, the tolerance range is between 0 and 1, and the closer to 1 indicates the weaker the multiple collinearity. The variance coefficient of expansion factor (VIF) is between 0 and 10, indicating that there is no multiple collinearity between variables. In this paper, the tolerance of the variables is close to 1, VIF is about 3, indicating that there is no multiple collinearity between the explanatory variables, the model design is reasonable, so as to ensure the reliability of the linear regression analysis.[5] Variables for forecast: (constant), year of listing, nature of CCSR, LCSR, SCSR, tax return to business income ratio. the enterprise, enterprise size, industry, GCSR, ECSR, DCSR, Dependent variable: F Variables for forecast: (constant), Accounts payables turnover, year of listing, tax return to business income ratio, DCSR, enterprise size, asset-liability ratio, ECSR, industry, As shown in Table 7, the R value is 0.854, the R square is 0.729, the adjusted R square is 0.678, which means that the explanatory variable has a strong explanatory effect on the variable explained and the overall model fit is high. In general, when Durbin-Watson is between 1.5 and 2, it indicates that there is no autocorrelation problem between variables. The DW value of this model is 1.88, which satisfies the requirement. There is no autocorrelation problem in this paper. As shown in Table 8, the F test value is 14.187 and the Sig value is 0.00, less than 0.01, indicating that the regression effect is significant at the 0.01 level.[6] 3) The correlation coefficient between enterprise size and F was 0.054, which indicated that the size of enterprise was positively correlated with F; the P value of bilateral test was 0.102 which was greater than 0.05, and the significance test was not passed, indicating the positive correlation between size of enterprise and F was insignificant. 4) The correlation coefficient between industry and F is - 0.251, indicating that the industry has a negative correlation with F; bilateral test P value is 0.239 which was greater than 0.05; it did not pass the significance test, indicating that the negative correlation between the industry and F was insignificant.",
    "1) The correlation coefficient between year of listing and F was 0.092, which indicated that the year of listing had a positive correlation with F. The P value of the bilateral test was 0.042 which was less than 0.05, and the significance test shows that the positive correlation between year of listing and F was significant. 2) The correlation coefficient between the nature of the enterprise and F was -0.159, which indicated that the nature of the firm was negatively correlated with F. The P value of the bilateral test was 0.795 which was greater than 0.05, and the significance test was not passed, which indicated that negative correlation between the nature of the enterprise and F was insignificant. 5) The correlation coefficient between GCSR and F was 11.758, which indicated that GCSR had a positive correlation with F; bilateral test P value was 0.053 which was less than 0.1, significant correlation was found in 90% confidence interval, GCSR was positively correlated with F significantly, which was consistent with Hypothesis 1. 6) The correlation coefficient between tax return to business income ratio and F is -6.099, indicating that the tax return to business income ratio is negatively correlated with F, and the bilateral test P value is 0.596 which is greater than 0.05, and the significance test is not passed. There was an insignificant negative correlation between tax return to business income and F, which was not consistent with Hypothesis 1. 7) The correlation coefficient between ECSR and F was - 5.777, which indicated that ECSR had a negative correlation with F; the bilateral test P value was 0.113 which was greater than 0.05, and the significance test was not passed showing that ECSR had an insignificant negative correlation with F which was inconsistent with Hypothesis 2. 8) The correlation coefficient between DCSR and F is 0.458, which indicates that there is a positive correlation between DCSR and F; the bilateral test P value is 0.016 which is less than 0.05, and the significant correlation between DCSR and F is obtained by the significance test, which is consistent with Hypothesis 3. 9) The correlation coefficient between CCSR and F is - 0.064, indicating that CCSR and F showed a negative correlation; the bilateral test P value is 0.741 which is greater than 0.05, it did not pass the significance test, CCSR and F has an insignificant negative correlation, which is inconsistent with Hypothesis 4. 10) The correlation coefficient between LCSR and F correlation is 0.687, indicating that LCSR and F were positively correlated with bilateral test P value of 0.00 which is less than 0.01, through the significance test, LCSR and F were significantly positive correlation, which is consistent with Hypothesis 5. 11) The correlation coefficient between SCSR and F was 0.049, which indicated that SCSR had a positive correlation with F, the P value was 0.168 which was greater than 0.05, and the significance test was not passed, SCSR had an insignificant positive correlation with F, which was not consistent with Hypothesis 6. It can be seen from the regression equation that among the positive correlations, the government has the most significant impact on the performance of the enterprise. The influence coefficient is 11.758, followed by the relationship with the creditor, the relationship with the shareholder, and finally the year of listing of the enterprise.[7] Based on the review of previous studies and the combination of normative research and empirical research, this paper first elaborates the present situation of enterprise performance, puts forward the research hypothesis, selects 70 listed companies in Henan as the research samples, and collects data of nine indicators to explain the comprehensive performance of enterprises, conducts descriptive statistical analysis, factor analysis and multivariate linear regression analysis using the SPSS17.0 software. The conclusions are as follows: The listed year has a significant positive correlation with the performance of the enterprise, indicating that in the sample data the earlier the year of listing, the better the development is, and the company's performance will also increase. And the relationship with the government was positively correlated, and the coefficient of influence was 11.758. It was also positively correlated with the shareholders. The coefficient was 0.458. And there was a significant positive relationship with the creditors. The coefficient was 0.687. There is an insignificant negative correlation between enterprise performance and industry, employees, customers and nature of the enterprise. The negative impact of these variables on enterprise performance is not significant. There is an insignificant positive correlation between enterprise performance and size of enterprise and suppliers. There is a positive correlation with little influence.",
    "In this paper, the government, employees, shareholders, customers, creditors and suppliers as business stakeholders are used as a foothold to explore the relationship with the stakeholders to the impact on enterprise performance. Conduct reasonable plans with focus to improve enterprise performance according to the results of the model analysis. 1) enterprises should strengthen the relationship with the government, and actively fulfil their social responsibility. Take the initiative to carry out compliance with the law, take the initiative to fulfil their tax obligations defined by the government, pay taxes on time, although this will increase the short-term costs of enterprises, they can get support from government, so that they can utilise government’s preferential policies for enterprises and conduct a good external environment to the business. 2) Take the initiative to maintain the relationship with the shareholders. On one hand focus on the distribution of benefits on the dividend, consolidate the actual control status of shareholders; on the other hand, improve the relationship between agents and shareholders, reduce agency costs, form a good mutual relationship between managers and shareholders, enhance the overall performance of enterprises, and achieve harmony and sustainable development. 3) Reasonable optimization of the capital structure of enterprises, focus on the relationship with the creditors. As part of the improvement in enterprise performance comes from the creditor's credit investment, debt financing will ease financial difficulties and get more \"benefits\" to create better performance. 4) The stakeholders having impact on business performance should be treated differently. For the enterprise and government, creditors, shareholders, suppliers, good relations conducted is beneficial for the improvement in enterprise performance, we should use their positive correlation effect; and for employees and customers, the negative correlation should be limited within a reasonable range."
]