[
    "This paper examines how the adoption of cloud computing affects the relationship between the technical and environmental capabilities of small and medium-sized enterprises (SMEs) in the tourism industry in Henan Province, China, thereby promoting the stable and sustainable development of the tourism industry, combining the laws of tourism market development, vigorously constructing a smart tourism project, guiding tourism cloud service providers to strengthen the cooperation and contact with the market’s tourism enterprises, introducing and utilizing cloud computing technology, optimizing and improving the functions of various tourism services of the enterprises, and enhancing the processing and analysis of enterprise-related data to provide tourism information. Strengthen the processing and analysis of enterprise-related data to provide tourism information, and further study the adoption of cloud computing and its impact on small and medium-sized enterprises (SMEs) in terms of technology and business environment knowledge, so as to make the best enterprise management decisions and realize the overall enhancement of the enterprise’s tourism brand value. Received: 13 August 2024 | Revised: 14 August 2024 | Accepted: 21 August 2024 | Published Online: 16 December 2024 DOI: http://doi.org/10.26549/jsbe.v7i2.19486 Hui, ZH., Mohammadi, A., 2024. A Study on Technology Application and Performance of Small and Medium-sized Enterprises in the Context of Cloud Computing Application - A Case Study of Hotel Industry in Henan, China. Journal of Sustainable Business and Economics. 7(2): 69–75. DOI: http://doi.org/10.26549/jsbe.v7i2.19486 Copyright © 2024 by the author(s). Published by Bilingual Publishing Group. This is an open access article under the Creative Commons Attribu- tion-NonCommercial 4.0 International (CC BY-NC 4.0) License (https://creativecommons.org/licenses/by-nc/4.0/). and “informationization” direction, but also makes the comprehensive budget management of deci- sion-making support role and value creation role more and more obvious. Based on this, in the current cloud computing background, if enterprises want to get a better comprehensive budget management informatization construction results, it must be com- bined with their own internal management, to devel- op a set of more refined comprehensive budget man- agement system, so as to make it possible to realize the production and operation of the comprehensive budget management informatization pattern, but also can effectively promote the enterprise’s operating mode of the benign cycle, and at the same time more able to ensure the gradual implementation of the en- terprise’s strategic planning. The gradual implemen- tation of strategic planning. nificantly reduce the cost of software use, research and development costs and maintenance costs, to provide enterprises with the necessary infrastructure and technical platform support. As a new business service model, the cloud com- puting platform’s biggest technical characteristic lies in “connecting infrastructure and software before and after the service, and constructing the whole cloud computing model platform through the functions of access rights setting, module setting and data cloud storage”. Enterprises in the cloud computing system, through the relevant cloud computing technology will be able to directly access a variety of data infor- mation and basic services, so as to continuously op- timize their own departments, projects, products and operations of the comprehensive budget management In the process of enterprise comprehensive bud- get management informatization construction under the cloud computing environment, its biggest feature lies in effectively guaranteeing the enterprise’s basic development needs such as “strategy landing, re- source allocation, performance appraisal, clear rights and responsibilities”. From the current application of cloud computing modules, “software, platform and infrastructure services” are the three most common application modes, and these are the essential ele- ments of the combination between cloud computing and enterprise comprehensive management informa- tionization. From the point of view of the character- istics of the cloud computing environment, enterpris- es in the process of building comprehensive budget management informationization, the most important practice channels mainly include “software provided by cloud computing service providers, self-research or according to their own needs to buy third-party software company products” and other three modes [2]. Among them, the cloud computing software con- nected to the service provider and the server, can sig- In the cloud computing environment, the enter- prise in the comprehensive budget target setting can not only integrate the original data of enterprise development, but also be able to fully competitive market environment and industry environment in- formation fusion to the budget target setting process, so that not only to a great extent to meet the needs of the enterprise’s strategic goal setting, but also more able to make its enterprises through the cloud computing terminal software to complete the com- prehensive budget management information “upload and send”. “Uploading”, and then by the internal management of the enterprise will be the relevant in- formation and the actual situation of the enterprise to analyze the combination, so as to clarify the future of the enterprise’s comprehensive budget management development planning. This not only can gradual- ly form a linkage between the various departments within the enterprise mode of work, and at the same budget management objectives of the strategic plan- ning practices and economic development, and then constantly expand the enterprise in a fully compet- itive market, the development of the driving force and the industry’s competitive advantage.",
    "determined period of time with the support of cloud computing technology. This enables a more logical basis for overall budgeting data in the process of comprehensive budget management, thus ensuring the accuracy of comprehensive budgeting. In terms of comprehensive budgeting, the enter- prise is not only able to analyze the enterprise’s own historical data, business situation, external market information, strategic planning information, etc. through the cloud computing terminal platform to carry out all-round budget management objectives, but also able to further determine the future annual budget indicators and budget values under the sup- port of cloud computing technology. This not only enables the internal management of the enterprise to optimize its budgeting process and budget approval process on the basis of the comprehensive budget quota standard, but also further strengthens the actu- al role of business departments and work plans in the comprehensive budget presentation. In terms of budget allocation, the enterprise not only needs to combine its own organizational struc- ture and business model to reconstruct the budget allocation of each department, but should also carry out “horizontal allocation” or “vertical extension” based on the results of the completion of the compre- hensive budget in different periods, so as to make it possible for the comprehensive budget management to be compiled to the full budget of the enterprise. At the same time, “horizontal allocation” or “vertical extension” should be carried out according to the results of comprehensive budget completion in dif- ferent periods, so as to enable comprehensive budget management to be compiled for each business item and production link within the enterprise. This not only further clarifies the enterprise’s job budgeting indicators, product budgeting indicators, production budgeting indicators, etc., but also en- ables each department to enhance the connectivity in budget data collection, so that the relevant calcu- lation and allocation indicator data and budget allo- cation summary data can be submitted within a pre- From the current development trend of infor- mation technology, in the process of enterprise comprehensive budget management, to improve the application of big data and cloud accounting means, is bound to affect the final level of budget manage- ment informationization and refinement level. This not only enables enterprises to optimize the overall management of enterprises through information technology thinking, but also enables them to realize the real-time uploading and acquisition of informa- tion data of various aspects of comprehensive budget management under the support of cloud computing, cloud data, cloud accounting and other information technology. In addition, the integration of big data technology and cloud accounting means, but also to promote the enterprise comprehensive budget management in- formation data sharing, so that the data information of different departments can form a good interoper- ability effect. This not only can further improve the enterprise in the comprehensive budget management of information technology linkage pattern, at the same time can also make the enterprise management in the information technology means of comprehen- sive budget management progress for comprehensive monitoring and comprehensive supervision, so that the enterprise comprehensive budget management process management objectives can be on their own assessment and evaluation, data analysis to produce a positive effect. It can be seen that in the process of enterprise comprehensive budget management, cloud computing and other information technology into its management practice, not only to a great extent to make up for the shortcomings of its traditional ac- counting data analysis, but also to further deepen the effective integration of science and technology and industry, which not only improves the enterprise in the process of comprehensive budget management of the data processing capacity, but also significant- ly improve its comprehensive budget management practice efficiency, thereby realizing the enterprise comprehensive budget management process manage- ment objectives can have a positive effect on their own assessment and evaluation, data analysis. Man- agement of the practice of efficiency, so as to realize the integration of enterprise comprehensive budget management and the depth of the development of in- formation technology. For the enterprise comprehensive budget man- agement, strengthen the dynamic supervision of budget implementation, the key link is to ensure that the information technology management tools and enterprise budget management objectives of the suit- ability and integration, so as to make the enterprise internal departments of the comprehensive budget management work can be implemented. Based on this, in the process of information-based budget man- agement, enterprises should not only optimize the implementation of the budget, and at the same time more through the construction of information-based comprehensive budget management system, to effec- tively solve the problem of “budget implementation in the form of” [6]. This will not only enable the enterprise to fully discover its own problems related to budget implementation and dynamic supervision, but also be able to formulate solutions to problems in a timely manner, thus strengthening the enterprise’s resilience in the process of comprehensive budget management.",
    "model” for the enterprise itself through the dynamic supervision of budget execution, which can not only promote the real-time development of dynamic su- pervision, but also further strengthen the enterprise’s own ability to analyze and process the cloud com- puting data. Solve the problems of budget imple- mentation, resolve the enterprise budget risk caused by comprehensive budget management, so as to opti- mize the enterprise’s economic internal consumption and abnormal data feedback and other work. Thanks to the informationization support of cloud computing technology, in the process of building a comprehensive budget management informationiza- tion framework, the enterprise can not only effec- tively improve its information collection level for the external environment and industry development dynamics, but also more conducive to the internal management of the enterprise on this basis to formu- late a more scientific and reasonable budget devel- opment decisions, so as to avoid additional budget management objectives in the process of formulating and compiling Development risk. Based on this, in the process of improving the degree of informatization of comprehensive budget management goal-setting and preparation, enterprises should not only pay attention to the “sharing” and “integration” of the enterprise cloud platform, but also increase the use of highly sophisticated big data processing technologies such as Hadoop, Drill, HPCC, and so on. The application of high-precision big data processing technology, and its application in data analysis and evaluation of results, so that not only can make it gradually through the structured, semi-structured, unstructured data logical relationship verification to deepen the information mining power of the comprehensive budget manage- ment data and information analysis, but also on the basis of which the market competition demand and the market share of the economy to make a reasonable prediction. This not only can provide more data and In addition, under the support of cloud com- puting technology, the internal management of the enterprise can also build up a “budget data analysis budget management goal-setting and preparation, but also can make the enterprise in such a process to con- tinuously improve its own data information process- ing capabilities, so that it can continue to highlight its own information technology comprehensive budget management advantages in the future completely competitive market. also be a safe storage of this part of the data informa- tion. In this way, the senior leaders of the enterprise can extract data for reference and analysis at any time before making management decisions, creating real value for the enterprise. The key to optimize the informationized appraisal system of comprehensive budget management lies in that the enterprise managers should make the enter- prise’s general management system more effective. As an important development trend of the tour- ism industry in the future, smart tourism essentially refers to the construction and operation of the tour- ism industry through the scientific use of advanced technology and intelligent management means, in order to promote the orderly development of vari- ous work links, and provide more high-quality and convenient services for different levels of tourism customers. Cloud computing, as an emerging com- munication technology in modern society, is widely used in different industry sectors, through the organ- ic combination of cloud computing technology and smart tourism, can give full play to their respective advantages and roles, maximize the comprehensive development of the tourism industry, and promote the informationization and intelligent development of smart tourism. Cloud computing itself, as an advanced informa- tion and communication processing technology, can assist the intelligent tourism management to process and analyze the massive data, dig out the more valu- able data information, and at the same time, it can Based on the application of cloud computing technology, tourism enterprises can effectively com- bine the real and virtual information data of the en- terprise, provide consumers with better quality ser- vices, and maximize to meet the needs of different levels of users of tourism experience services. For example, tourism enterprises in the application of cloud computing technology, enterprise service ob- jects can use different terminals to obtain tourism-re- lated support services, convenient for users to eat, live and travel, greatly improving the service level of tourism enterprises, thus attracting more potential users. Intelligent tourism operation and management involves content mainly including resources for tour- ism users, travel, hotels and sightseeing attractions route planning, etc., in this management process will produce a large amount of data, requiring the relevant staff to take advanced management tech- niques and methods to comprehensively improve the level of wisdom of tourism management. Tourism enterprises can introduce the application of cloud computing technology to effectively build up a smart tourism management cloud platform that meets the characteristics of the enterprise’s own development needs, based on the cloud platform for daily opera- tion and management to complete the different func- tional services for market users to meet the different needs of users. Cloud computing technology to build a smart tourism management platform not only has a high level of data processing and analysis capabil- ities, can guarantee the smooth progress of the smart tourism management business, but also can help enterprises effectively solve a large number of data security storage and protection work, to avoid the occurrence of user information data leakage and theft problems, affecting the reputation of the enterprise itself. In the construction of intelligent tourism cloud service platform, the government should strengthen the scientific guidance to the market tourism service providers, guide them to combine the law of tourism market development and tourism enterprise manage- ment needs, reasonably design the intelligent tourism cloud service platform with perfect functions, learn from the introduction of the use of more advanced informatization technology, and lay a good founda- tion for the development of a new situation of intelli- gent tourism in China.",
    "In the new period, the core content of smart tourism business development mainly covers smart tourism industry alliance, smart tourism marketing platform, and online promotion and marketing of tourism products. Tourism industry development process exists in the distribution of tourism re- sources is too dispersed, the tourism market service enterprises a huge number of characteristics, these characteristics will lead to difficulties in realizing the entire tourism market centralized wisdom manage- ment development, need to rely on the application of cloud computing technology to effectively enhance the wisdom of China’s tourism business, the level of information technology development. The applica- tion process of China’s intelligent tourism business innovation and development mode is to build an integrated intelligent business trading platform by the market intelligent tourism business cloud service providers, to provide online payment, security and identity identification and authentication and other enterprises in a scientific and effective manner, so that the legitimate rights and interests of the different parties involved in the tourism business services can be fully guaranteed, and to promote the construction of the tourism industry for the harmonious and stable development of the tourism industry. ing technology, enterprises can build an informa- tion-oriented comprehensive budget management system in the process of comprehensive budget management, which can provide enterprises with ex- tremely accurate budget control data, programs and analysis results. This not only can fully reflect the many economic relationships within the enterprise, but also to optimize its own economic activities. It can be seen that cloud computing technology not only allows enterprises to comprehensive budget management work to obtain more basic services and the underlying data, but also to promote the develop- ment of enterprises in the cloud computing service platform more in line with their own strategic de- velopment, the adoption of cloud computing is the mediator of the relationship between the technical capabilities of small and medium-sized enterprises in the tourism industry and the environmental ca- pacity for policymakers and practitioners in Henan Province, China, to provide the basis for insight, and at the same time, cloud computing technology also improves the environmental and technological capabilities of enterprises and the environment. com- puting technology also enhances the advantages of environmental and technological expertise."
]