[
    "Abstract. With the sustained rapid growth of the economy, China has achieved significant results in promoting regional coordinated development. However, in a more micro-scale spatial scope, it still faces challenges of unbalanced and uncoordinated regional development. This study uses index analysis and relevant literature to explore the current regional development status of Henan Province. Based on the relevant data published in the Henan Statistical Yearbook from 2018 to 2023, this article calculates and analyzes the Theil index of Henan Province as a whole and its four internal regions. The research results indicate that regional economic disparities are the result of the combined effects of multiple factors over a long period, and the fundamental reason for these disparities is the uneven distribution of resources. At present, the differences within Henan Province and within different regions of Henan Province are gradually narrowing, and the economic differences in Henan Province are mainly caused by the differences between the four regions. The Central Plains Urban Agglomeration is the region with the largest difference among the four regions. Since the reform and opening, China has achieved rapid development in economic construction, but this has also led to differences in economic development between coastal and inland areas of China. Causing the economic development between the three major regions of eastern, central, and western China, as well as between provinces and cities within provinces, to be in an uncoordinated state [1]. The CPC made a systematic and comprehensive strategic layout for regional development in the report of the 20th National Congress of the Communist Party of China, emphasizing the need to thoroughly implement the strategy of coordinated regional development and high-quality development of the regional economy. Nowadays, China has gradually formed a multi-level, multi- form, and all-round regional coordinated development pattern nationwide. However, there are still situations where small-scale regional development is not coordinated and there is a large gap in development between core and noncore regions. Therefore, it is necessary to conduct research and analysis on economic development in small-scale regions. The central region of China has an economy that accounts for over one-fifth of the country's total and nearly one-fourth of its population. High-quality development in the central region is conducive to promoting consumption and advancing the realization of common prosperity [2]. As the core province of the central region, Henan Province has a GDP of 5913.239 billion yuan as of 2023, ranking sixth in the country and first in the central region. Its development plays a very important role in promoting the rise of the central region and has a huge impact on achieving high-quality and sustainable development in the central region. This study explores the economic development of various regions in a small-scale space, taking Henan Province as an example, against the backdrop of the rise strategy in the central region. Intended to present the regional economic disparities within Henan Province and provide recommendations for future economic development within the province. This study will use the literature analysis method, combined with domestic and foreign paper materials and research data to summarize and generalize the economic development in Henan Province. At the same time, based on the current provincial statistical yearbook, the Theil index will be used to analyze the economic differences between the four major regions in the province. The development within Henan Province has been influenced by various factors. There are two major obstacles in the high-quality development of Henan Province, namely forest coverage and public library building area per 10000 people. At the same time, Henan Province has performed relatively well in opening up to the outside world [3]. Xu Jun used the spatial Durbin model to analyze the spatial correlation and spillover effects of regional economic growth in Henan Province. He found that there is a strong spatial spillover effect in Henan Province, and the economic development of the region promotes the economic growth of adjacent regions. At the same time, there is a clustering phenomenon in the regional economy within the province. The three factors of industrial structure, fiscal expenditure level, and human capital investment have a significant impact on the regional economic development of Henan Province [4]. Li Jin, Cao Yunyuan, and Sun Changqing believe that the differences in transportation conditions, resource endowments, infrastructure, development strategies, and other factors in different regions of Henan Province have led to uneven economic development in different areas [5].",
    "The economic disparities in Henan Province exhibit strong spatial characteristics. Li Jingjing, Miao Changhong, and Ye Xinyue analyzed from two dimensions: geography and time, and found that Henan Province exhibits obvious core-periphery structural characteristics. The uneven distribution of investment, decentralization, and marketization have a significant impact on the regional differences within Henan Province [6]. Wang Mengzhou pointed out that economic extroversion has significantly hindered the coordinated development of the regional economy in Henan Province. Until 2020, due to the impact of COVID-19, social consumption capacity has strengthened its blocking effect on the coordinated development of regional economy in Henan Province, and the impact of economic extroversion has relatively weakened [7]. Wang Junjie, Xu Shuyun, and Zhou Yi found that the comprehensive ranking of provincial capitals in central provinces, except for Hubei Province, is relatively low, and the economic driving effect of provincial capitals on the whole province is relatively poor [8]. Wei Junjie found through research on the spatial characteristics of 18 cities in Henan Province that the absolute differences in the regional economy in Henan Province were continuously increasing from 2010 to 2019, while the relative differences were continuously decreasing; The economic development within the province formed a trend centered around Zhengzhou, with a decreasing trend in the surrounding areas and slow development in peripheral cities; There is a clear spatial positive correlation in the economic development of various regions in Henan Province [1]. Based on the review and summary of the above literature, it is found that the production and construction situation of local areas is very important for the coordinated development within the region. Both the coverage of local urban infrastructure and the comprehensive cultural level of the local urban population have a certain impact on the economic differences between regions. At present, the regional differentiation in Henan Province is mainly manifested between core areas and non-core areas, with limited development of peripheral cities. There is a positive feedback loop between the energy intensity of urban public transportation and regional economic development. The impact of regional economic development on the urbanization level and the one-way dependence of the urbanization process on the formation of energy intensity patterns in urban public transportation [9]. Regional integration is an effective path for coordinated regional development, and economic resilience is a reflection of economic security and stability, which are key factors for sustainable development. Regional integration has improved the economic resilience within a region, and the degree to which policies enhance economic resilience depends on the concentration of urban size. The industrial structure has a certain regulatory effect, and the more reasonable and advanced it is, the greater the contribution of regional integration to economic resilience [10]. When formulating policies for regional coordinated development, not only should geographical proximity be considered, but also institutional frameworks, transportation network connectivity, and economic diversification should be given priority [11]. The reason for economic disparities is the different endowments of factors between regions, and the impact of differences in total factor productivity is relatively small. The main factor in narrowing the gap lies in the reduction of the gap in total factor productivity [12]. The polarization of regions is influenced by the knowledge economy and local transformation, and the development strategy centered on knowledge economy and innovation plays a crucial role in regional development [13]. After studying the future spatial income of the United States, it was found that the income gap will gradually widen in the future, and the geographical location of regions with different income levels will change. The impact of spatial factors on income levels will gradually weaken [14]. Having a good production structure, high-quality human resources, and natural resources suitable for the development of tourism are crucial for the future economic development of the region [15]. The polarization phenomenon in regional development is closely related to the economic transformation process of decentralization, marketization, and globalization [16]. The differences in geographical and policy factors have an impact on regional economic disparities in China, and compared to policies, geographical location has a greater impact on the regional economy, resulting in a more severe time lag in economic development [17]. Overall, the coordinated development of the regional economy is the result of multiple factors working together, and the fundamental reason for economic disparities is resource endowment. Infrastructure construction is an important link in the coordinated development of the regional economy. The government should strengthen the construction of transportation, power grid, communication, and other infrastructure in moderately developed areas. Regional economic differences are long-term and greatly influenced by geographical factors. The key to reducing regional economic disparities is to enrich the transportation network between regions, reduce spatial barriers, optimize various factors in the process of regional development, and stimulate local economic development.",
    "This article uses the Theil index to analyze the economic differences among various regions in Henan Province. The specific calculation formula is as follows: The T in the equation represents the Theil index of Henan Province; Indicates intra group differences; Indicates differences between groups; I represents the region divided within the province; J represents the cities divided within the region; Y represents the Gross Domestic Product; N represents the number of permanent residents; Indicate the gross domestic product within the designated area; Representing the Gross Domestic Product (GDP) of cities divided within a region; Indicate the number of permanent residents within the designated area; The permanent population of the cities divided within the region. This grouping will divide the province into four economic zones: the Central Plains Urban Agglomeration, the northern Henan region, the western and southwestern Henan regions, and the Huang Huai region, following the \"Outline of Henan Province's Comprehensive Plan for Building a Moderately Prosperous Society\". As shown in Table 1, the overall economic disparity in Henan Province has shown a gradual downward trend from 2017 to 2022, with the overall Theil index decreasing from 0.0682 in 2017 to 0.0534 in 2022. The economic disparities within the region have also shown a downward trend, with the Theil index dropping from 0.0297 in 2017 to 0.0233 in 2022. The overall economic disparities between regions have shown a downward trend, but have slightly increased between 2018-2019, with the inter-regional Theil index decreasing from 0.0385 in 2017 to 0.0301 in 2022. As shown in Table 2, between 2017 and 2022, the inter-group contribution rate and intra-group contribution rate in Henan Province remained relatively stable, with inter group contribution rate consistently higher than the intra-group contribution rate. Compared to 2022, the inter-group contribution rate has slightly decreased, while the intra-group contribution rate has slightly increased. From this, the economic differences in Henan Province are mainly caused by inter-group differences, that is, the economic differences between different regions are relatively large. As shown in Table 3, in the Theil index weighted by GDP, the group Theil index of the Central Plains urban agglomeration and the western and southwestern Henan regions from 2017 to 2022 was higher than that of the northern Henan region and the Huang Huai region. The overall Theil index of the Central Plains urban agglomeration and the southwestern Henan region showed a downward trend from 2017 to 2022. The group Theil index in the northern Henan region showed an initial increase followed by a decrease from 2017 to 2022. The Theil index of small groups in the Huang Huai region tends to stabilize. The group Theil index in the western and southwestern regions of Henan from 2017 to 2019 was higher than that in the Central Plains urban agglomeration, while the opposite was true from 2019 to 2022. The Central Plains urban agglomeration has the highest contribution rate among the four economic zones. The differential contribution rates of the Central Plains urban agglomeration, northern Henan region, and Huang Huai region have been increasing year by year, while those of western Henan and southwestern Henan have been decreasing year by year. From this, the differences within the four regions of Henan Province are currently decreasing, which is consistent with the overall situation within the province. Among them, the decline is more significant in the western and southwestern regions of Henan Province, and the current differences in Henan Province are mainly caused by the differences within the Central Plains urban agglomeration. As shown in Tables 4 and Table 5, in the Central Plains urban agglomeration with Zhengzhou as the core, there are significant differences in the development of Zhengzhou compared to other cities, manifested in differences in industrial structure distribution. Compared with other cities, the tertiary industry in Zhengzhou has a relatively high proportion and a large gap in quantity. From this, Henan Province still has strong core edge structural characteristics in space. Optimize the industrial structure. According to the current distribution of the tertiary industry structure within the province, there are still some cities where the proportion of the tertiary industry is not high. Due to the close relationship between the development of the tertiary industry and regional economic growth, each region should combine its own characteristics and development advantages, and make good use of existing resources to optimize and develop the tertiary industry.",
    "Strengthen the radiation effect between cities. At present, there are still core-periphery characteristics in Henan Province, and there are obstacles to the economic development of peripheral areas. Therefore, developed cities should leverage their resource advantages to drive the economic development of surrounding cities. Each region should consolidate its interaction with surrounding areas based on environmental characteristics and advantages. Strengthen the connections between cities and build a city network structure. Promote the flow of economic factors and form a positive economic cycle. Strengthen infrastructure construction. Infrastructure construction is a key factor in promoting high-quality economic development, and regions should increase investment in infrastructure construction, especially in transportation, communication, and other areas. This is of great significance for strengthening the radiation effect between cities and weakening the core-periphery characteristics of Henan Province. This article reviews and analyzes relevant literature on regional economic development in the past, and presents the current economic disparities in Henan Province using the Theil index. The following conclusions are drawn. Firstly, regional economic disparities are the result of the combined effects of multiple factors over a long period. The construction of infrastructure primarily focused on transportation and communication has a significant impact on the development of the regional economy. Although scholars at home and abroad have different opinions on the factors that affect regional economic disparities, the root cause is still the uneven distribution of resources. Secondly, the differences within Henan Province and different regions of Henan Province are gradually narrowing. In the comparison of data, it was found that the economic differences in Henan Province are mainly caused by differences between four regions, among which the Central Plains Urban Agglomeration has the largest differences among the four regions, while the Huang Huai region has the smallest differences. One of the reasons for the internal differences in the Central Plains urban agglomeration is the distribution of industrial structures. This article analyzes and summarizes the differences in Henan Province using the Theil index, and proposes suggestions and countermeasures for the development of Henan Province. However, the research still has the following shortcomings: the factors considered are not comprehensive enough. The Theil index used in this study only analyzed the relationship between GDP and permanent population and obtained the economic differences in Henan Province. However, there is a lack of analysis on factors such as transportation and geographical location, and more models can be used for detailed calculations in the future."
]