[
    "potential force in rural governance, and it meets the dual needs of developing and applying digital technology and transforming rural governance. This topic has become a new hotspot in rural governance research in China. This article exam- ines the status of digital technology introduced in rural governance and development in Henan Province, and the advantages and difficulties of this tool. Digital technology is used clearly, and services fulfill a certain role in rural governance and development, its widespread use meets the needs of a clear government concept and to a certain extent creates convenience for rural resi- dents. The purpose of this article is to discuss the various impacts of digital technologies on rural development and governance, to provide a theo- retical perspective for actors using digital tech- nologies to participate in rural governance, and to provide background information for develop- ers and rural development services through leg- islation and methods. Institutional Design. Rural areas must take full advantage of the systems and digital products provided by government and technology developers for the benefit of local people. Rural digital information is not only a vari- ety of information, but also digital resources to capture the dominance and potential intangible value of rural digital resources to maximize rural benefits. Цифрові технології стали важливою потен- ційною силою у сфері сільського управління, і вона задовольняє подвійні потреби розви- тку та застосування цифрових технологій та трансформації сільського управління. Ця тема стала новим дискусійним аспек- том в дослідженні сільського управління в Китаї. У цій статті досліджено статус цифрових технологій, які впроваджуються в сільське управління та розвиток в провінції Хенань, а також про переваги та труднощі цього інструменту, також проаналізовано це явище з точки зору побудови суспіль- ства. Цифрові технології використовують у сільському управлінні та розвитку. Але на кінцевий ефект впливають різні сис- теми. Його широке застосування відповідає потребам чіткої концепції уряду, а також певною мірою створює зручність для меш- канців сільських територій, але застосу- вання цієї технології в сільському врядуванні має бути налаштовано так, щоб вона була корисною для потреб сільського управління та розвитку. Метою цієї статті є обгово- рити різний вплив цифрових технологій на сільський розвиток та управління, надати теоретичну перспективу для суб’єктів, які використовують цифрові технології для участі в управлінні сільськими районами, а також надати довідкову інформацію для розробників систем для обслуговування сільського розвитку через застосування законодавства та методів інституційного проектування. Так як уряд, безсумнівно, є провідною силою в управлінні сільськими територіями. Це має покращити якість та надійність збору даних за допомогою законодавства та систем проектування, захистити безпеку особистої інформації людей, подолати бар’єри даних між різними відомствами та створити тип суб’єктної структури сільського управління з розум- ним розподілом праці, розподілом ресурсів, та ефективної співпраці. Сільські території повинні повною мірою використовувати сис- теми та цифрові продукти, надані урядом і розробниками технологій, щоб служити місцевим жителям, і в той час як технології руйнують традиційне сільське суспільство. Це перебудовує сільську громаду. Необхідно повністю усвідомити, що цифрова інформа- ція в сільській місцевості є не лише різнови- дом інформації, а й цифровим ресурсом, щоб захопити домінуючу силу та потенційну нематеріальну цінність сільських цифрових ресурсів, щоб максимізувати переваги села. Ключові слова: цифрові технології, сільське управління, соціальне будівництво, сільські В этой статье исследованы статус цифровых технологий, внедряемых в сельское управление и развитие в провинции Хэнань, а также преимущества и трудности этого инструмента. Цифровые технологии используют наглядно, а услуги играют определенную роль в сель- ском управлении и развитии, его широкое применение отвечает потребностям четкой концепции правительства, а также в определенной степени создает удобство жителям сельских территорий. Целью этой статьи является рассмотреть разное влияние цифровых техно- логий на сельское развитие и управление, предоставить теоретическую перспективу для субъектов, использующих цифровые техноло- гии для участия в управлении сельскими районами, а также предоставить справочную информацию для разработчиков для обслуживания сельского развития через применение законодательства и методов институционального проектирования. Сельские территории должны полностью использовать системы и цифровые продукты, предоставленные правительством и разработчиками технологий, чтобы использовать местными жителями. Цифровая информация в сельской местности является не только разновидностью информации, но и цифровым ресурсом, чтобы захватить доминирующую силу и потенциальную нематериальную ценность сельских цифровых ресурсов, чтобы максимизировать преимущества села. Introduction. Digital technology brings villages and hamlets into the national vision and digital platform. The state and government use digital technology to digitize villages and residents, to control villages continuously and dynamically according to events to achieve precise governance. In practice, however, local governments place excessive emphasis on process management, such as maintaining records on the platform and leaving electronic footprints on the platform as content for rural human resources assessments. Such process management significantly increases the workload of rural human resources. Quantity, so rural cadres are busy with data and don't have time to deal with specifics, indicating the existence of formalism and digital bureaucracy in rural management.",
    "Literature review. Advantages and Dilemmas of Digital Technology in the Application of Rural Governance. Advantages and dilemmas of digital technologies in rural management applications. The depth and breadth of the application of digital technologies in rural governance is constantly expanding, gradually revealing their advantages, disadvantages and difficulties. First of all, it provides all participants of rural management with a modern tool for transforming existing institutional advantages into efficiency of rural management. It makes rural management open and transparent and helps to solve the problems of information mitigation, single subject management, registration of information and inadequate control. With data and information mining technology, data can be directly collected that objectively and fairly reflects the reality of revenues, which can not only improve the efficiency of utility officials, but also collate data to prevent false reports. Targeted support for science and technology not only saves a lot of human capital, but also discreetly plays a role in data control and analysis and solves the \"black box\" management problem caused by incomplete information in the past. For individuals, the use of digital technology can not only reduce contact with local government officials, but also reduce the cost of treatment procedures famous Chinese researcher Zhang Shiyong [11]. Once data becomes public, government information becomes open and transparent, and science and technology Secondly, it also faces issues such as data and information barriers by Feng Xian Li Jin Cui Kai, data and information security, and digital bureaucracy. There are many types of rural data and rich resources. The development and use of mass data is still at an early stage. Information about data from various government agencies is not fully disseminated, which limits the manifestation of the benefits of digital technology in rural governance Digital technology has blurred the boundaries between the public and private spheres, as researchers Zhang BingXuan, Ren Zhe have written about [10]. The personal information of villagers can be recorded, stored, and retrieved at any time and place, creating the risk of sensitive data leakage. In addition, for Internet companies, the ownership of data is not clearly defined and the protection mechanism is imperfect, leading to data misuse, data technology itself may have security risks, and illegal data transactions driven by profit exacerbate massive data security risks. This article aims to make sense of the various impacts of digital technology on rural governance, to provide a theoretical perspective for actors using digital technology to participate in rural governance, and to make them aware that rural governance requires not only technology and institutions, but also the rural community. Results and discussion. Henan Province has achieved full 4G network coverage in 46,000 administrative villages and is promoting the construction of 5G base stations. The number of rural and urban Internet users was 27.93 million and 60.05 million, representing 91.3% of the total population (Table 1). Creating 39 \"three rural\" thematic databases, collecting 600 million agricultural data of various types, forming a \"single network\" of services for \"three rural\" services, providing basic support for the development of digital villages. Applying digital technology to improve grazing management and promoting smart integration platforms such as \"digital party building,\" the province has 52,000 terminal sites and 1.61 million registered users. Promote \"digital government affairs,\" conti- nually integrate and optimize APP applications, and implement all online state licensing practices. Promote \"digital supervision\" and rely on the \"Internet + supervision\" platform to supervise public safety and environmental protection in the province. There are 348,400 first-class municipal video surveillance sites, which mainly cover major roads and key public areas of cities, districts and towns. The remote environmental monitoring system installed 19,885 surveillance cameras and built 131 three- level monitoring platforms to monitor crop growth, fire protection and natural disasters around the clock. Thanks to the implementation of the \" Internet + Education\" program, all 24,600 rural primary and secondary schools in the province were connected to the Internet, and the coverage of online learning reached 100%. The implementation of \"Internet + medical treatment\" resulted in a five-tiered telemedicine service system covering more than 200 county hospitals, more than 200 township health centers and rural/community health facilities in 108 counties across the province. Implement the \"Internet + Employment\" program and use information platforms to organize the export of the labor force of 2.1 million people. Introduced the \"Internet + Inclusive Finance\" program, promoted \"no-touch\" financial services and lent 79.8 billion yuan to 18,000 small, medium and micro enterprises. Promoting the introduction of information to villages and households, the province has established 40,285 agricultural information cooperatives, accounting for 85.8% of the total number of administrative villages in the province, promoting various public welfare services, convenience services, e-commerce, experience training services and online public welfare services. More than 60 million times, nearly 200 million people received convenient service.",
    "The development and application of new technology has improved data collection, analysis, and processing, promoted cross-border integration and open data sharing, and provided technical assistance for the implementation of data technology in rural governance. Internet companies, professional institutions, industry associations, etc. continue to increase investment in mobile application platforms such as agricultural WeChat, Weibo and professional applications, providing rich basic resources and application scenarios for data technology embedded in rural management, and promoting rural management transitioning to digitization and intelligence characterized by the application of deep data analysis. At the same time, the government proposes to further the popularization of 4G in rural areas and the innovative application of 5G by 2025, and the \"digital gap\" between urban and rural areas will be significantly narrowed. Ongoing national policy guidance and support provides an important opportunity and a strong impetus for the adoption of data technology in rural governance. The government continues to extend the digital infrastructure and digital platform to the countryside, and include the countryside in the platform to gradually make it understandable and visible [2]. Digital infrastructure is not only a tool for government management, but also a tool for village governance. technology, and the oversight provided by intrusive opacity is another aspect of technology [3; 8]. As a driver of progress, technology expands human capacity and wisdom. Technological empowerment is multidirectional and universal. Businesses, governments, and people can harness the energy that technology provides, apply technology to achieve their goals, contribute to productivity, social progress, and personal development. For any society, the maintenance of order is inseparable from supervision and deterrence. Technology is an essential means of implementing the supervisory function. In addition to the characteristics of empowerment, technology also has the characteristics of permeability and uncertainty, making it a complex regulatory aspect, and the supervisory function of technology is also multi-directional. The government can use digital technology to supervise disasters and can monitor and reconstruct physical and social space in rural areas, however, such supervision is not a one-way supervision of residents and rural space by the government, but a two-way interactive process. People do not just follow order, they also use technology to restrain and supervise village human resources and government officials to restore space and order [4; 7]. To be sure, in areas such as disaster response and public order, the goals of government and the people are the same, but in matters such as illegal construction, the mismatch between the two often leads to clashes and conflicts. The performance of maintenance and supervision functions is not entirely determined by technology, but is hampered by various systems and mechanisms. The rejection or use of technology and how technology is used is often a choice of system rather than a cause [5; 6]. Among these, state mechanisms, such as management concepts, administrative planning, management service procedures and standards, competitive market mechanisms, strategic human action, and mutually beneficial social mechanisms, jointly construct the content, methods of use, and effects of technology. Technology services and supervisory functions are not set by society, but are constructed by society. This means that the same technology can lead to very different results in different social environments. In rural governance, technology can compress the discretion of grassroots bureaucracy, but it cannot replace the indigenous knowledge of shopfloor bureaucracy and the village. The system causes the intermediate effect that technology causes different social consequences in different societies. Exploring the application of digital technology in rural governance from the perspective of social construction. Digital technology is transforming rural areas and building society mainly through its two main functions: service and supervision. Empowerment and supervision are two common attributes of technology. The development and progress facilitated by the empowerment of technology is one aspect of Perhaps the most important thing about rural areas in the digital age is not the digital technology itself, but the power relations, the social structure, and the evolution of the public-private sector under the influence of digital technology. Sufficient attention must be paid to the negative consequences of digital bureaucracy and the promotion of digital technology and existing governance. The synergy of this system will change the face of the bucolic community. Such a rural community allows each member to have a position that is right for him/her, bringing him/ her confidence, a sense of security, and a sense of belonging, so that the rural community can achieve the goal of harmony, stability, and development.",
    "The conclusions about digital villages have only just begun, and more technical research on rural management still needs time. Nevertheless, as users of technology, people need to think about the boundaries of digital applications in rural governance, not only to leave an appropriate space for the application of technology, but also to define the boundaries. To realize a balance between performance of management and cost, combining accuracy and efficiency and information security. Digital technology brings a new sense of confidence, security and belonging to the countryside and creates a modern rural governance community. 1. Viktor Mayer-Schnberger. (2013) Big date a rev- olution that will transform how we live, work and think Yangyan Sheng Tao Zhou translated. People's Publish- ing House of Zhejiang, P. 200. 2. Han Zhiming (2019) The Clarity and the Opera- tional Logic of State Governance [J]. Academic Monthly. (9): P. 82–94. 5. Allen, D.W., Leeson, P.T. (2015) Institution- ally Constrained Technology Adoption: Resolving the Longbow Puzzle [J]. Journal of Law & Economics. 58(3), P. 683–715. 6. Stoyanets Nataliya, Zetao Hu, Lichen Niu, Junmin Chen (2020) Managing sustainability development of agricultural sphere based on the entropy weight TOP- SIS model. International Journal of Technology Manage- ment & Sustainable Development. Volume 19 Number 3. Р. 263–278 DOI: https://doi.org/10.1386/tmsd_00026_1. 7. Lyulyov, O., Pimonenko, T., Stoyanets, N., Letu- novska, N. (2019) Sustainable development of agricul- tural sector: Democratic profile impact among devel- oping countries. Research in World Economy, 10(4), рр. 97–105. DOI: https://doi.org/10.5430/rwe.v10n4p97. 8. Bilan, Y., Lyeonov, S., Stoyanets, N., Vysochyna, A. (2018) The impact of environmental determinants of sustainable agriculture on country food security. Inter- national Journal of Environmental Technology and Management. 21 (5–6), рр. 289–305. DOI: 10.1504/ IJETM.2018.100580. 9. Feng xian Li Jin Cui Kai (2020). Digitalization of Rural Governance: Research on Status Quo, Demand and Countermeasures. E-Governm. (06), pр. 73–85. DOI: 10.16582/j.cnki.dzzw.2020.06.008. 10. Zhang BingXuan Ren Zhe(2020). Rural Governance Driven by Digital Technology. Journal of Guangxi Normal University: Philosophy and Social Sciences Editio. 56(2), рp. 62–72. DOI: 10.16088/j. issn.1001-6597.2020.02.006. 11. Zhang Shiyong (2020).The Exploration of the Effective Path to Promoting Rural Governance via Technological Governance. Journal of Guizhou Nor- mal University (Social Sciences). (02), рp. 40–47 .DOI: 10.16614/j.gznuj.skb.2021.02.005."
]