[
    "Aim. This study investigates the factors influencing rural entrepreneurial intention and behavior among private university graduates by extending the theory of planned behavior (TPB) to incorporate entrepreneurial passion and entrepreneurial value. Methods. A quantitative approach was employed, utilizing an online survey of 424 students from private higher education institutions in Henan Province. Structural equation modeling (SEM) was conducted to examine the relationships among subjective norms, perceived behavioral control, entrepreneurial attitude, entrepreneurial passion, entrepreneurial value, entrepreneurial intention, and entrepreneurial behavior. Results. Entrepreneurial intention is a powerful predictor of entrepreneurial behavior. Entrepreneurial passion and value play crucial roles, directly and indirectly influencing both entrepreneurial intention and behavior. Additionally, subjective norms, perceived behavioral control, and entrepreneurial attitude have significant impacts on entrepreneurial intention. Conclusion. This study was conducted in the context of growing employment challenges among private university graduates in Henan Province, China, where rural entrepreneurship has emerged as a potential alternative career path. Implementation. These findings contribute to entrepreneurial research by expanding TPB to include psychological and value-driven factors while also offering practical insights for policymakers, educators, and rural development agencies. Entrepreneurship is one of the key measures to address employment challenges, and its economic impact has become increasingly significant in recent years. In 2024, the number of university graduates in China is projected to reach 11.79 million, leading to an intensely competitive job market. As China’s most populous province, Henan is expected to produce approximately 650,000 university graduates in 2024, reflecting the rapid expansion of higher education and the pressing demand for employment opportunities. While employment in major urban centers remains dominant, the Chinese government has actively promoted rural entrepreneurship. The government has introduced various incentives to facilitate this transition, including financial subsidies, workspace provisions, and favorable policy measures. Rural entrepreneurship contributes to economic growth, employment generation, urban-rural structural optimization, and sustainable rural development. By integrating modern agriculture, e-commerce, and rural tourism, rural entrepreneurship enhances agricultural value chains, broadens market access for farm products, and strengthens the competitiveness of rural industries. Moreover, it creates employment opportunities, alleviates pressure on the graduate labor market, facilitates talent redistribution, and optimizes demographic structures between urban and rural areas. Entrepreneurs bring innovative business models and management practices that drive rural governance modernization, improve infrastructure, and enhance the quality of public services. With the combined support of government policies and market mechanisms, rural entrepreneurship not only fosters economic development but also advances rural revitalization and urban-rural integration, establishing a sustainable growth model (Bruton et al., 2021; Junchang et al., 2025; Liu & Li, 2024; Pan et al., 2024; Wang & Mao, 2024; Zou & Bahauddin, 2024). As of 2024, China has 799 private universities, and their graduates face significant employment challenges. Rural entrepreneurship presents a viable alternative, offering new survival strategies beyond the highly competitive urban job market. Rural entrepreneurship, for them, is not merely a means of securing employment but also an avenue for realizing both personal and social value. Unlike the intense competition in first-tier cities, rural entrepreneurship provides broader development opportunities, enabling graduates to leverage government policies supporting rural revitalization to achieve self-sufficiency through innovation and entrepreneurship. By capitalizing on local resources, they can engage in modern agriculture, rural tourism, and e-commerce, injecting new momentum into rural economies while enhancing their practical skills, managerial competencies, and market adaptability. Furthermore, the government has established a relatively comprehensive policy framework— including financial support, entrepreneurial training, and tax incentives—to lower entry barriers and improve the success rate of private university graduates in entrepreneurship. In the process of rural entrepreneurship, graduates not only drive local economic growth and improve rural industrial structures but also contribute to urban-rural integration and rural modernization, achieving both personal career advancement and broader social contributions (Chatterjee et al., 2021; Dong et al., 2021; Yan & Cao, 2024; Yang et al., 2021; J. Zhang et al., 2023). By 2025, Henan Province will have 57 private universities, and the substantial employment pressure poses challenges for both the government and educational institutions. At the same time, Henan is also a major agricultural province in China, ranking among the top in agricultural economic output. The province’s rural permanent resident population stands at 44.287 million, accounting for 44.57% of the total population. This vast consumer market and abundant entrepreneurial resources provide private university graduates with natural opportunities for entrepreneurship. Meanwhile, graduates from Henan’s private universities also face challenges in employment, such as industrial upgrading, intensified market competition, and talent mismatches. Compared to \"Double First-Class\" university graduates, they encounter lower employer recognition, weaker career competitiveness, and limited access to industry resources. Additionally, Henan’s economy is predominantly driven by agriculture Chang Liu and traditional manufacturing, with relatively few high-tech industries, leading to constrained employment opportunities for graduates from specific disciplines. They appear to be reluctant to pursue entrepreneurship and instead prefer to seek employment in government, educational institutions, and hospitals. Despite the difficulty of securing these positions, they are willing to spend years competing for them, resulting in low entrepreneurial intentions (Guo et al., 2023; Lin et al., 2024; Luo & Hu, 2024; Y. Zhang et al., 2023; Zhuang & Ye, 2023).",
    "years, students from private universities still face the challenges of fierce competition, limited job openings, and inadequate policy support when applying for these positions (Yi et al., 2022). Many government jobs have stringent requirements for academic qualifications, professional backgrounds, and examination scores, leading to relatively low acceptance rates for private university graduates. Furthermore, rural grassroots work environments are relatively harsh, with lower salaries and limited career development opportunities, making rural employment less attractive to some graduates (Yu et al., 2024). Against this backdrop, rural entrepreneurship has become an important option for private university graduates, as it not only promotes rural industrial development but also generates a large number of jobs, improves rural infrastructure, and increases farmers’ incomes, thereby making a significant contribution to Henan’s economic development and the implementation of the rural revitalization strategy (Liu et al., 2022). Henan Province currently has approximately 21,000 township-level agricultural enterprises, which play a crucial role in promoting rural economic growth, increasing farmers' incomes, and advancing rural revitalization. In 2023, the province’s rural labor force transfer employment reached 30.7397 million, with 187,700 new returnee entrepreneurs, indicating a vast rural entrepreneurship market with abundant opportunities (Deng & Lyu, 2024; Niu et al., 2021). Therefore, encouraging private university graduates in Henan Province to engage in rural entrepreneurship is beneficial for alleviating employment pressure, optimizing urban-rural industrial structures, promoting rural economic development, and advancing the rural revitalization strategy. Rural entrepreneurship provides stable employment opportunities and facilitates industrial upgrading and sustainable rural economic development through modern agriculture, rural e-commerce, and tourism-based business models. Additionally, rural entrepreneurship contributes to improving rural infrastructure, enhancing public service quality, and fostering social innovation in rural communities. However, the entrepreneurial intentions of private university graduates in Henan remain relatively low, largely due to factors such as career perceptions, policy environment, resource accessibility, and societal recognition (Bi & Yang, 2023; Chen, 2024; Pan et al., 2024; Tang et al., 2024; Yin et al., 2022)Therefore, an in- depth study is necessary to identify the key determinants of their rural entrepreneurship behavior and develop a scientifically sound entrepreneurship promotion model to enhance their entrepreneurial intentions and success rates, thereby providing talent support and industrial momentum for rural revitalization. The Theory of Planned Behavior (TPB), proposed by Ajzen (1991), is a widely used psychological framework for understanding human decision-making and behavior. TPB postulates that an individual's intention to perform a behavior is influenced by three core determinants: attitude toward the behavior, subjective norms, and perceived behavioral control. Attitude reflects the individual's overall evaluation of the behavior, subjective norms capture the perceived social pressures to engage or not engage in the behavior and perceived behavioral control represents the ease or difficulty of performing the behavior, which is linked to self- efficacy (Kautonen et al., 2015; Lortie & Castogiovanni, 2015). A significant body of research has applied TPB to explain entrepreneurial intentions and behaviors among diverse populations. Studies confirm that attitude toward entrepreneurship, perceived social support, and self-efficacy strongly predict entrepreneurial intention and, in turn, actual entrepreneurial behavior (Kautonen et al., 2015; Tsordia & Papadimitriou, 2015). The robustness of TPB in predicting entrepreneurship has been validated across multiple cultural and educational contexts, including Europe (Kruse et al., 2019b; Rueda Barrios et al., 2022), Asia (Al-Jubari et al., 2019; Su et al., 2021), and developing economies (Doanh & Bernat, 2019; Munir et al., 2019). TPB-based studies on entrepreneurial intentions have been conducted across various countries, focusing on different demographic groups. Research has extensively examined university students in Malaysia (Al-Jubari et al., 2019), China (Su et al., 2021), Vietnam (Doanh & Bernat, 2019; Maheshwari & Kha, 2022), India (Roy et al., 2017), Indonesia (Astuti & Martdianty, 2012), and Saudi Arabia (Aloulou, 2016). Additionally, studies have explored entrepreneurial intentions in European countries, including Germany and Spain (Kruse et al., 2019b) and Greece (Tsordia & Papadimitriou, 2015). Some studies extend TPB to examine social entrepreneurship (Kruse et al., 2019b), gender differences (Palupi & Santoso, 2017), and the role of prior start-up experience (Sabah, 2016). Several key research findings have emerged from these studies. TPB consistently explains the formation of entrepreneurial intentions, with attitude, social norms, and perceived control as critical antecedents (Kautonen et al., 2015; Rueda Barrios et al., 2022). Entrepreneurial education significantly influences entrepreneurial intention, often mediated by self-efficacy and perceived feasibility (Ma et al., 2020; Maheshwari & Kha, 2022). Furthermore, studies incorporating additional psychological and social factors suggest that personal values (Yasir et al., 2021), university support (Su et al., 2021), and industry collaboration (Feola et al., 2019) enhance entrepreneurial intention. Research also highlights cultural and institutional differences in how TPB constructs influence entrepreneurial decisions. (Leroy et al., 2015). Moreover, gender differences have been observed, with female students often exhibiting lower entrepreneurial intentions than their male counterparts due to perceived barriers in control and Chang Liu social norms (Palupi & Santoso, 2017). Lastly, creativity and entrepreneurial passion moderate the relationship between TPB constructs and actual entrepreneurial behavior (Sampene et al., 2023; Shi et al., 2020).",
    "Despite its extensive application, several research gaps remain in TPB-based entrepreneurial studies. Limited exploration of entrepreneurial passion and value suggests that existing research primarily focuses on traditional TPB constructs while neglecting additional psychological influences (Shi et al., 2020; Yasir et al., 2021). The lack of context-specific adaptations further limits TPB’s applicability, as most studies apply it in university settings but fail to integrate broader economic and cultural contexts (Dao et al., 2021; Feola et al., 2019). Furthermore, insufficient longitudinal studies hinder understanding of how entrepreneurial intentions translate into actual entrepreneurial action, an area that requires further exploration (Hanage et al., 2024). This study seeks to address these gaps by integrating entrepreneurial passion and entrepreneurial value into the TPB framework, providing a more comprehensive model of entrepreneurial behavior. Additionally, it extends the application of TPB beyond traditional university settings, considering industry-academic linkages, digital transformation, and emerging entrepreneurial ecosystems. By doing so, this research offers novel insights into the psychological and contextual factors shaping entrepreneurial engagement, thereby advancing both theoretical and practical applications of TPB in entrepreneurship research. Entrepreneurial passion is a profound emotional drive that inspires individuals to pursue entrepreneurial activities with enthusiasm and persistence. It encompasses a deep-seated motivation that fuels creativity, resilience, and goal-directed behavior, ultimately shaping entrepreneurial aspirations and actions (Feng & Chen, 2020). This passion enhances cognitive engagement and fosters a sense of purpose, providing entrepreneurs with the perseverance necessary to navigate challenges in their ventures. Entrepreneurial passion significantly contributes to the formation of entrepreneurial intention by stimulating motivation and intellectual engagement (Anjum et al., 2021). Passion, creativity, and self-efficacy play a crucial role in fostering entrepreneurial aspirations (Soni & Bakhru, 2021). The relationship between entrepreneurial education and intention has also been well-documented, with findings suggesting that entrepreneurship education enhances self- efficacy. At the same time, the moderating effects of passion and expected entrepreneurial outcomes further influence intention development (Boutaky & Eddine, 2021). Beyond individual attributes, the social environment also impacts the formation of entrepreneurial intention. Subjective norms and entrepreneurial passion have been found to interact, with social support serving as a moderating factor that either reinforces or weakens this relationship (Suganda & Simbolon, 2023). This highlights the importance of a supportive ecosystem in reinforcing entrepreneurial enthusiasm and intention. Additionally, personal characteristics Chang Liu such as subjective well-being and psychological resilience have been identified as significant antecedents of digital entrepreneurship intention, emphasizing the interplay between emotional stability and entrepreneurial motivation (Sahrah et al., 2023). The role of perceptual and demographic factors in entrepreneurial decision-making has also been explored, particularly in the context of social entrepreneurship. Research suggests that an individual’s perception of social issues and entrepreneurial opportunities can significantly influence their likelihood of becoming a social entrepreneur. (Shahid Satar et al., 2023). These findings highlight the broader implications of entrepreneurial passion in traditional business creation and addressing societal challenges through entrepreneurial initiatives. Overall, entrepreneurial passion is a fundamental driver of both entrepreneurial intention and behavior. It influences key psychological traits, including motivation, self- efficacy, and resilience, while interacting with external factors such as education, social support, and perceived opportunities. (Douglas et al., 2021). Understanding the complex relationship between entrepreneurial passion and intention can provide deeper insights into the factors that encourage individuals to embark on entrepreneurial ventures. Future research should continue exploring passion's nuanced role in different entrepreneurial contexts, offering a more comprehensive understanding of its impact on long-term entrepreneurial success. Hence, this study posits： Entrepreneurial value refers to the intrinsic and extrinsic motivations that drive individuals toward entrepreneurial activities. It encompasses a set of beliefs, attitudes, and ethical considerations that shape an individual's perception of entrepreneurship as a viable career path. Entrepreneurial value is closely linked to personal values, such as self-enhancement, self- transcendence, and innovation, which collectively influence an individual’s decision-making process in the entrepreneurial context (Hueso et al., 2021; Yasir et al., 2022). By understanding these values, researchers can gain deeper insights into how entrepreneurial intention is formed and how it translates into entrepreneurial behavior. Entrepreneurial value and intention are crucial factors in understanding entrepreneurial behavior. Feng and Chen (2020) constructed a model to study the relationship between entrepreneurial passion and entrepreneurs' psychology and behavior, highlighting the impact of passion on entrepreneurial behavior and enterprise performance. Anjum et al. (2021) emphasized the role of entrepreneurial passion in stimulating motivation and improving intellectual activity as a precursor to entrepreneurial intention. Similarly,Yasir et al. (2021) explored the integrated role of personal values and the Theory of Planned Behavior in forming sustainable entrepreneurial intentions, focusing on self-transcending and self-enhancing values.",
    "Moreover, the study by Hatos et al. (2022) investigated the impact of entrepreneurial education on entrepreneurial intentions among Romanian doctoral students and postdoctoral researchers, highlighting individual-level determinants of the intention to become an entrepreneur.Brito et al. (2022) analyzed the determining factors of entrepreneurial intention from the Theory of Planned Behavior perspective, focusing on entrepreneurs and potential Chang Liu entrepreneurs in the State of Acre. Additionally, Lopez et al. (2021) examined the relationship between Entrepreneurship Education and Entrepreneurial Intentions using the Theory of Planned Behavior, showing a significant increase in students' entrepreneurial intention scores after participating in entrepreneurship education activities. Furthermore, Nguyen and Nguyen (2023) discussed the contribution of specialized entrepreneurship academic programs in developing entrepreneurial intentions, suggesting alternative approaches to entrepreneurship education. These studies collectively contribute to understanding the complex interplay between entrepreneurial value, intention, and behavior, shedding light on the factors that influence individuals' decisions to engage in entrepreneurial activities. Overall, entrepreneurial value plays a significant role in shaping both entrepreneurial intention and behavior. Individuals with strong entrepreneurial values are more likely to perceive entrepreneurship as a desirable career option and demonstrate higher levels of motivation and perseverance. The combination of personal values, educational support, and external encouragement significantly enhances entrepreneurial intention. Further research in this area can provide valuable insights into the intricate relationships between entrepreneurial value, intention, and behavior, offering a more comprehensive framework for understanding the dynamics of entrepreneurial decision-making. This study employed an online questionnaire survey distributed to 424 students from private higher education institutions in Henan Province using a random sampling method. The questionnaire was available for approximately two weeks. It consisted of eight sections: the first section introduced the survey, while sections two to seven comprised Likert scale questions assessing subjective norms, perceived behavioral control, entrepreneurial attitude, entrepreneurial passion, entrepreneurial value, entrepreneurial intention, and entrepreneurial behavior. The final section contained a concluding statement. A self-developed measurement scale was utilized, incorporating modifications based on previous scales. Subjective norms were measured using four items (SN1–SN4), while perceived behavioral control was assessed with three items (PBC1–PBC3). Entrepreneurial attitude included three items (EA1–EA3), entrepreneurial intention was measured with three items (EI1–EI3), and entrepreneurial behavior was also assessed using three items (EB1–EB3), all derived from Dao et al. (2021). The measurement of entrepreneurial value was adapted from He and Ding (2023)and included seven items (EV1–EV7). Entrepreneurial passion was assessed based on Feng and Chen (2020), comprising six items (EP1–EP6). As shown in Table 1. A pilot study was conducted to ensure the reliability and validity of the measurement instruments before proceeding with the main survey. A total of 30 students from private higher education institutions in Henan Province participated in this preliminary study. The objective was to assess the clarity, internal consistency, and construct validity of the questionnaire items. The reliability analysis was performed using Cronbach’s alpha to evaluate the internal consistency of the constructs. The results indicated that all scales achieved acceptable reliability, with Cronbach’s alpha values exceeding 0.70, demonstrating strong internal consistency. The validity analysis was conducted through exploratory factor analysis (EFA) to verify the structural integrity of the constructs. The Kaiser-Meyer-Olkin (KMO) measure of sampling adequacy was 0.812, and Bartlett’s test of sphericity was significant (χ² = 425.36, p < 0.001), indicating the suitability of the data for factor analysis. Factor loadings for all items exceeded the recommended threshold of 0.60, confirming the construct validity of the measurement model. The descriptive statistical analysis provides an overview of the sample's demographic characteristics, including gender, household income, and regional background, offering critical insights into the potential factors influencing rural entrepreneurial intention and behavior. Among the 424 respondents in Table 2, 51.2% are male (217 participants), while 48.8% are female (207 participants), indicating a relatively balanced gender distribution, which ensures that both male and female perspectives on entrepreneurship are adequately represented. Regarding household income, the majority of respondents (29.2%) report an annual household income between 50,000 and 100,000 yuan, followed by 26.7% whose household income is below 50,000 yuan, suggesting that over half of the respondents come from relatively low- income households. Additionally, 19.1% of participants fall within the 100,000 to 150,000 yuan range, 13.4% within 150,000 to 200,000 yuan, and only 11.65% report a household income exceeding 200,000 yuan. These income levels may influence entrepreneurial intention, as financial constraints could affect graduates’ ability to take on the risks associated with entrepreneurship. At the same time, lower household income might also serve as a motivating factor for self-employment due to limited salaried job opportunities.",
    "Regarding regional distribution, 52.8% (224 participants) are from urban areas, while 47.1% (200 participants) are from rural areas, reflecting a nearly equal representation of urban and rural backgrounds. This distribution enables an examination of whether individuals with rural backgrounds exhibit higher rural entrepreneurial intention due to familiarity with the local economic conditions compared to their urban counterparts, who may perceive rural entrepreneurship as less desirable. The balanced representation across gender, income, and regional categories ensures a diverse dataset, facilitating a comprehensive exploration of the factors influencing private university graduates’ decisions regarding rural entrepreneurship. These demographic characteristics provide a foundation for further statistical analyses, Chang Liu Table 3 presents the reliability analysis of the measurement scales. Assessed by Cronbach’s alpha, it demonstrates strong internal consistency across the key constructs of entrepreneurial intention, behavior, value, and passion. The entrepreneurial intention (EI1–EI3) scale reports a Cronbach’s alpha of 0.82, indicating a high level of reliability in capturing respondents' intention to engage in entrepreneurship. This suggests that the measurement items used to assess entrepreneurial intention—such as the willingness to start a business in rural areas—are consistent and reliable in reflecting the underlying construct. Similarly, the entrepreneurial behavior (EB1–EB3) scale achieves a Cronbach’s alpha of 0.84, signifying a strong internal consistency in measuring actual entrepreneurial activities undertaken by respondents. This reliability level indicates that the scale effectively captures variations in entrepreneurial engagement, such as concrete actions taken toward starting a rural business, working on business plans, or participating in entrepreneurial activities. The entrepreneurial value (EV1–EV7) scale records the highest Cronbach’s alpha at 0.95, suggesting exceptional internal consistency. This indicates that respondents' perceived values related to entrepreneurship—such as the belief in entrepreneurship’s role in rural economic development, job creation, and personal fulfillment—are measured with a high degree of reliability. The strong reliability suggests that entrepreneurial value is a well-defined and cohesive construct, making it a significant factor in understanding entrepreneurial motivation. The entrepreneurial passion (EP1–EP6) scale shows a Cronbach’s alpha of 0.83, confirming its high internal consistency. This suggests that the measurement items assessing entrepreneurial passion—such as enthusiasm, emotional connection, and determination toward rural entrepreneurship—reliably capture the intensity of respondents' entrepreneurial motivation. Given that entrepreneurial passion is a key psychological factor influencing intention and behavior, its high reliability ensures that the construct is appropriately measured and can be effectively analyzed concerning other entrepreneurial factors. Overall, the reliability results indicate that the measurement scales used in this study exhibit strong internal consistency, supporting their validity in examining the relationships between entrepreneurial intention, behavior, values, and passion. These findings provide a robust foundation for further statistical analyses, including correlation and regression modeling, to explore how these constructs interact in shaping entrepreneurial engagement among private university graduates in Henan Province. The validity test was conducted using the Kaiser-Meyer-Olkin (KMO) measure of sampling adequacy, which assesses the suitability of data for factor analysis. A KMO value above 0.80 is generally considered meritorious, indicating that the data structure is appropriate for exploratory factor analysis (EFA) and that the selected variables exhibit strong correlations. The results in Table 4 demonstrate high KMO values across all latent variables, confirming the adequacy of the dataset for further statistical analysis. Entrepreneurial attitude (0.93), perceived behavioral control (0.92), and entrepreneurial intention (0.91) show the highest KMO values, suggesting that these constructs exhibit a strong factor structure with minimal redundancy among items. This indicates that the measurement scales for these constructs effectively capture the intended psychological and behavioral dimensions. Entrepreneurial passion (0.90) and subjective norms (0.89) also report high KMO values, reinforcing the validity of these constructs in assessing the emotional and social influences on entrepreneurship. The entrepreneurial value scale (0.87) also demonstrates strong validity, indicating that the items measuring personal and societal value perceptions of entrepreneurship are well-structured. Although entrepreneurial behavior (0.81) has the lowest KMO value among the constructs, it still exceeds the acceptable threshold of 0.80, confirming that the measurement items are sufficiently interrelated for factor analysis. This suggests that the scale effectively captures actual entrepreneurial actions, such as starting a business, engaging in business planning, and participating in entrepreneurial activities. Overall, the high KMO values across all constructs validate the factor structure of the measurement model, ensuring that the selected variables are appropriate for further confirmatory factor analysis (CFA) and structural equation modeling (SEM). These findings provide a solid empirical foundation for analyzing the relationships between subjective norms, Chang Liu perceived behavioral control, entrepreneurial attitude, entrepreneurial passion, entrepreneurial value, and their impact on entrepreneurial intention and behavior among private university graduates in Henan Province.",
    "The Pearson correlation analysis examines the strength and direction of the relationships between key latent variables in the study. The correlation coefficients range from -1 to 1, where values closer to 1 indicate strong positive relationships, values near -1 suggest strong negative relationships, and values around 0 imply no correlation. In this analysis, all correlation coefficients are positive and statistically significant at p < 0.001, suggesting robust associations among subjective norms (SN), perceived behavioral control (PBC), entrepreneurial attitude (EA), entrepreneurial passion (EP), entrepreneurial value (EV), entrepreneurial intention (EI), and entrepreneurial behavior (EB). The results presented in Table 5 reveal that subjective norms (SN) exhibit strong correlations with perceived behavioral control (0.938), entrepreneurial attitude (0.883), and entrepreneurial passion (0.85), indicating that social influences, such as family and community support, significantly shape individuals’ perceptions of their ability to engage in entrepreneurship and their overall attitude toward it. The relationship between SN and entrepreneurial intention (0.739) and entrepreneurial behavior (0.715) further supports the premise that social encouragement is critical in shaping entrepreneurial engagement. Perceived behavioral control (PBC) demonstrates high correlations with entrepreneurial value (0.942), entrepreneurial intention (0.908), and entrepreneurial attitude (0.877), suggesting that an individual’s belief in their entrepreneurial capability is strongly associated with both their perceived value of entrepreneurship and their intent to engage in entrepreneurial activities. The correlation between PBC and entrepreneurial behavior (0.753) indicates that individuals who control their entrepreneurial actions are more likely to translate intention into actual business activities. Entrepreneurial attitude (EA) is positively correlated with entrepreneurial intention (0.773) and entrepreneurial behavior (0.853), reaffirming that a favorable perception of entrepreneurship increases both intention and actual engagement. Likewise, entrepreneurial passion (EP) correlates strongly with entrepreneurial value (0.896) and entrepreneurial behavior (0.829), indicating that individuals with a high passion for entrepreneurship are more likely to value its contributions to society and actively participate in entrepreneurial activities. Chang Liu Entrepreneurial value (EV) also exhibits high correlations with entrepreneurial intention (0.937) and entrepreneurial behavior (0.941), confirming its role as a fundamental motivator in both the decision-making process and the execution of entrepreneurial actions. The strong relationship between entrepreneurial intention (EI) and entrepreneurial behavior (0.824) suggests that individuals with a firm intention to start a business are more likely to take concrete steps toward entrepreneurship. Overall, the correlation analysis confirms the theoretical assumptions that subjective norms, perceived behavioral control, entrepreneurial attitude, entrepreneurial passion, and entrepreneurial value are all significantly related to entrepreneurial intention and behavior. These findings provide empirical support for further structural equation modeling (SEM) to examine the causal relationships among these variables. The consistently high correlations also indicate that factors such as social influences, self-efficacy, and personal passion play critical roles in shaping entrepreneurial engagement, particularly in rural areas where economic and social conditions may differ from urban settings. The regression analysis used linear regression modeling to examine the causal relationships between key variables influencing entrepreneurial intention and behavior. The results in Table 6 indicate that all hypotheses are statistically supported, confirming significant effects among the constructs. Subjective norms positively influence entrepreneurial intention (H1), with coefficients ranging from 0.481 to 0.913**. The most substantial effect in Pattern 2 (0.913*) suggests that social support significantly impacts entrepreneurial intention. Perceived behavioral control (H2) also shows a significant effect, with coefficients from 0.244* to 0.85, indicating that higher self-efficacy enhances entrepreneurial intention, particularly in Pattern 4 (0.85)**. Entrepreneurial attitude (H3) significantly affects entrepreneurial intention, with coefficients ranging from 0.215 to 0.927**, confirming that a positive perception of entrepreneurship strengthens entrepreneurial commitment. The highest effect appears in Pattern 4 (0.927*)**. Entrepreneurial intention strongly predicts entrepreneurial behavior (H4), with coefficients between 0.336 and 0.824, reinforcing the Theory of Planned Behavior (TPB). Entrepreneurial passion significantly influences both entrepreneurial intention (H5) and behavior (H6), with coefficients ranging from 0.418* to 0.659*. The highest impact on behavior is seen in Pattern 1 (0.659*), highlighting passion as a key driver of entrepreneurial action. Entrepreneurial value also significantly affects intention (H7) and behavior (H8), with coefficients from 0.35 to 0.789 for intention and 0.235 to 0.656* for behavior, indicating that recognizing entrepreneurship’s benefits promotes both intention and action. The adjusted R² values, ranging from 1,223.652 to 3,960.661, confirm the model’s explanatory power. Pattern 2 (3,960.661) explains the most variance in entrepreneurial behavior, validating the importance of subjective norms, self-efficacy, attitude, passion, and value in predicting entrepreneurial engagement among private university graduates in Henan Province. The results provide empirical support for further analysis using structural equation modeling (SEM) and highlight key psychological and social determinants of rural entrepreneurship.",
    "Figure 1 presents an extended model of the Theory of Planned Behavior (TPB), illustrating the relationships between key psychological and social factors influencing entrepreneurial intention and behavior among private university graduates in Henan Province. The model builds upon the traditional TPB framework by incorporating entrepreneurial passion The diagram demonstrates that entrepreneurial intention serves as the central mediating variable, influenced by subjective norms (0.913*), perceived behavioral control (0.85**), entrepreneurial attitude (0.927***), entrepreneurial passion (0.594*), and entrepreneurial value (0.789*)**. Among these factors, entrepreneurial attitude exhibits the most substantial effect, suggesting that graduates’ perception of entrepreneurship as a desirable career path plays a crucial role in shaping their entrepreneurial aspirations. Subjective norms also strongly influence, indicating that family, peers, and societal expectations significantly impact the decision to pursue entrepreneurship. Perceived behavioral control further contributes, reinforcing that confidence in one's entrepreneurial abilities enhances the likelihood of forming entrepreneurial intentions. The model also highlights how entrepreneurial behavior is primarily driven by entrepreneurial intention (0.824), confirming that individuals with strong entrepreneurial intentions are more likely to take concrete actions toward starting a business. Additionally, entrepreneurial passion (0.659*) and value (0.644)** directly influence entrepreneurial behavior, suggesting that intrinsic motivation and perceived societal benefits of entrepreneurship can lead individuals to engage in entrepreneurial activities, even beyond their stated intentions. Figure 1 focuses on rural entrepreneurship by emphasizing the psychological and social factors that encourage graduates to start businesses in rural areas. The strong relationships observed between entrepreneurial values, passion, and behavior suggest that fostering a supportive environment, enhancing entrepreneurial education, and emphasizing the societal contributions of entrepreneurship could effectively encourage rural business ventures. By integrating entrepreneurial passion and value into the TPB model, the study provides deeper insights into the decision-making process of private university graduates, offering a practical basis for policy recommendations aimed at promoting entrepreneurship as a viable career path in rural Henan. This study was conducted in the context of growing employment challenges among private university graduates in Henan Province, China, where rural entrepreneurship has emerged as a potential alternative career path. Using the Theory of Planned Behavior (TPB) as a foundation, the study incorporated entrepreneurial passion and value to examine the key psychological and contextual factors influencing entrepreneurial intention and behavior among university graduates. The results confirm that entrepreneurial intention is the strongest determinant of entrepreneurial behavior, while subjective norms, perceived behavioral control, and entrepreneurial attitude significantly shape intention. Moreover, entrepreneurial passion and value influence intention and directly impact entrepreneurial behavior, highlighting the importance of emotional engagement and intrinsic motivation in the entrepreneurial decision- making process. These findings provide a more comprehensive understanding of the factors driving rural entrepreneurship and offer empirical evidence supporting the expansion of TPB in entrepreneurship research. Theoretically, this study contributes to entrepreneurship literature by extending the TPB framework to include entrepreneurial passion and entrepreneurial value, addressing the intention-behavior gap and enhancing the model's explanatory power in the rural entrepreneurship context. By demonstrating that intrinsic motivation and value-driven perceptions significantly shape entrepreneurial outcomes, this research fills a gap in existing studies that primarily focus on social and cognitive predictors of entrepreneurial behavior. Practically, the study provides valuable insights for policymakers, educators, and rural development agencies in designing interventions that enhance financial support, strengthen entrepreneurship education, and build a more sustainable entrepreneurial ecosystem. By aligning government policies, academic training, and local business support systems, these stakeholders can collectively foster a more favorable environment for young graduates to engage in rural entrepreneurship, ultimately contributing to employment generation, rural revitalization, and regional economic development. Despite its contributions, this study has certain limitations. First, the data was collected cross-sectionally, which limits the ability to examine longitudinal changes in entrepreneurial intention and behavior over time. Future research should conduct longitudinal studies to track entrepreneurs’ decision-making processes and business outcomes over extended periods. Second, while this study focused on private university graduates in Henan Province, future studies should explore other regions or higher education institutions, particularly in provinces with differing economic and policy conditions, to enhance generalizability. Additionally, while entrepreneurial passion and value were integrated into TPB, future research could examine other psychological and external factors, such as risk perception, digital transformation, and policy incentives, to further refine theoretical models of rural entrepreneurship. By addressing these areas, future studies can build on this research to develop more comprehensive This study investigates the factors influencing rural entrepreneurship behavior among private university graduates in Henan Province, incorporating subjective norms, perceived behavioral control, entrepreneurial attitude, entrepreneurial passion, and entrepreneurial value into the Theory of Planned Behavior (TPB). The research findings confirm that entrepreneurial intention serves as the primary determinant of entrepreneurial behavior, while entrepreneurial passion and entrepreneurial value play a crucial role in both intention formation and behavioral execution. These results contribute to existing entrepreneurship literature by extending TPB and providing a deeper understanding of how social, cognitive, and emotional factors shape entrepreneurial decision-making in rural contexts.",
    "Compared to existing studies that primarily focus on the traditional TPB constructs— entrepreneurial attitude, subjective norms, and perceived behavioral control—this study introduces entrepreneurial passion and entrepreneurial value as additional predictors. Previous research has extensively validated TPB in various cultural and educational settings, emphasizing the importance of social influence and self-efficacy in predicting entrepreneurial intention (Kautonen et al., 2015; Su et al., 2021; Tsordia & Papadimitriou, 2015). However, these studies have largely overlooked the role of emotional and value-driven factors, which are particularly significant in shaping entrepreneurial persistence and motivation. This study fills this gap by demonstrating that entrepreneurial passion and value are not only antecedents of intention but also direct influencers of entrepreneurial behavior, thereby addressing the intention-behavior gap in TPB-based entrepreneurship research. Additionally, this study extends TPB beyond general university students and urban entrepreneurship contexts by focusing on private university graduates engaging in rural entrepreneurship. While prior studies have explored entrepreneurial intentions in different countries (Al-Jubari et al., 2019; Doanh & Bernat, 2019; Kruse et al., 2019a), gender differences (Palupi & Santoso, 2017), and social entrepreneurship (Kruse et al., 2019a), the application of TPB in rural entrepreneurship remains underexplored. This study provides empirical evidence that graduates in rural areas exhibit distinct entrepreneurial motivations influenced by personal values and emotional engagement, rather than just external support mechanisms. By doing so, it highlights the psychological and contextual factors that differentiate rural entrepreneurship from urban entrepreneurial activities, contributing to a more nuanced theoretical framework. Furthermore, previous research has primarily examined entrepreneurial education, self- efficacy, and institutional support as factors influencing entrepreneurial intention (Ma et al., 2020; Maheshwari & Kha, 2022), often overlooking long-term motivational drivers such as entrepreneurial passion and value. This study demonstrates that graduates with strong entrepreneurial passion are more likely to translate their intention into action, while those with high entrepreneurial value perceive entrepreneurship as a long-term career commitment rather than a short-term economic necessity. These findings provide a broader perspective on entrepreneurial decision-making, emphasizing that emotional engagement and intrinsic motivation are as critical as external enablers in fostering sustainable entrepreneurship. By integrating entrepreneurial passion and value into the TPB framework, this study contributes to entrepreneurship theory and behavioral research by offering a comprehensive model of entrepreneurial engagement in rural settings. It validates TPB in a new context and addresses existing research gaps in entrepreneurial motivation, the intention-behavior gap, and rural entrepreneurship, thereby advancing theoretical and empirical understandings of how young graduates perceive and engage in entrepreneurship in developing regions. This study provides important practical insights for policymakers, educational institutions, rural development agencies, and aspiring entrepreneurs seeking to promote rural entrepreneurship among private university graduates. The results confirm that entrepreneurial intention is the strongest predictor of entrepreneurial behavior and that entrepreneurial passion and value significantly contribute to intention and actual business engagement. Additionally, subjective norms and perceived behavioral control are crucial in shaping graduates’ willingness to pursue rural entrepreneurship. These insights highlight the need for multi-faceted interventions that enhance external support mechanisms and intrinsic entrepreneurial motivation. For policymakers, strengthening financial and institutional support is essential to creating a more enabling environment for rural entrepreneurship. Since perceived behavioral control influences entrepreneurial intention, government programs should focus on improving access to startup capital, providing low-interest loans, and reducing bureaucratic barriers that hinder new business formation. Tax incentives, grants, and incubator programs in rural areas can further increase self-efficacy among young graduates, making entrepreneurship a more attractive and viable career option. Additionally, given the significant influence of subjective norms, policymakers should launch public awareness campaigns, mentorship programs, and community engagement initiatives that promote positive social perceptions of entrepreneurship. Encouraging successful rural entrepreneurs to serve as role models and advisors can help normalize entrepreneurship as a legitimate career path among university graduates. Educational institutions, particularly private universities, should integrate entrepreneurship education more deeply into their curricula. Given the strong impact of entrepreneurial passion and value on business engagement, universities should move beyond theoretical instruction and incorporate experiential learning opportunities, such as business simulations, startup incubation programs, and rural entrepreneurship internships. Furthermore, fostering cross-disciplinary collaborations between business, agriculture, and technology departments can equip students with the practical skills necessary for rural entrepreneurship, particularly in agriculture modernization, e-commerce, and sustainable rural tourism. Universities should also strengthen partnerships with local businesses and industry stakeholders to facilitate knowledge transfer, hands-on training, and post-graduation support.",
    "Building a stronger local entrepreneurial ecosystem is crucial for rural development agencies and community leaders. Since entrepreneurial value is a major driver of intention and behavior, creating supportive business networks, cooperative ventures, and regional market linkages can enhance rural entrepreneurship's feasibility and attractiveness. Local governments should facilitate knowledge-sharing platforms where entrepreneurs can access best practices, technological innovations, and market intelligence. Digital transformation is also an essential strategy—expanding e-commerce access, improving digital payment systems, and promoting Chang Liu Collectively, these stakeholders must adopt an integrated, multi-level approach to fostering rural entrepreneurship. Government policies should reduce financial and institutional barriers, universities must strengthen entrepreneurship education and practical training, and rural communities should build ecosystems that sustain and support long-term entrepreneurial success. By aligning these efforts, rural entrepreneurship can become a viable and sustainable career option for private university graduates, ultimately contributing to employment generation, rural economic revitalization, and long-term socioeconomic development in Henan Province and beyond."
]