[
    "2 Henan Provincial Collaborative Innovation Center for Intelligent Education, Henan Normal University, Xinxiang 453007, China 3 The Faculty of Education, Southwest University, Chongqing 400715, China Liu J, Li R, Chen J. Investigating the drivers and barriers of digital resource utilization in mathematical culture curricula development: A PLS-SEM analysis with Chinese teachers. Mathematics and Systems Science. 2024; 2(2): 2747. https://doi.org/10.54517/mss.v2i2.2747 Abstract: The convergence of technology and education has enabled the creation of instructional programs utilizing digital resources, garnering significant interest from educators in developing mathematical culture curricula. This study investigates these factors by incorporating the perceived importance of policy (PIP) variables into the unified theory of acceptance and use of technology (UTAUT) model. Quantitative analysis was employed to collect online questionnaire data from 873 teachers in Henan Province, which was subsequently analyzed using partial least squares structural equation modeling (PLS-SEM). The findings revealed that (1) performance expectation did not significantly impact teachers’ intentions and behaviors regarding the use of digital resources for developing mathematics culture lessons; (2) effort expectations negatively influenced such use; and (3) social influence, facilitating conditions, and perceived policy importance emerged as key drivers, with social influence exerting the most substantial impact. These insights enhance our understanding of the factors influencing teachers’ integration of digital resources in mathematics culture curriculum development. They can inform strategies to improve teachers’ knowledge of teaching with mathematics technology (KTMT) and to promote technology-enhanced mathematics teaching and learning. Copyright © 2024 by author(s). Mathematics and Systems Science is published by Asia Pacific Academy of Science Pte. Ltd. This work is licensed under the Creative Commons Attribution (CC BY) license. https://creativecommons.org/licenses/ by/4.0/ Over the past decade or so, educational researchers have increasingly focused on the role of STEAM (Science, Technology, Engineering, Arts, and Mathematics) education [1]. This shift has inspired educators to approach curricular topics from multiple disciplinary perspectives, thereby enriching student learning [2]. Within this context, the reinforcement of integrating subject knowledge with cultural elements has emerged as a significant trend in contemporary teaching and learning practices. The incorporation of mathematical culture in education can mitigate the monotony and dullness associated with examination-driven problem-solving training. While underscoring the logical and systematic nature of mathematics as a discipline, it concurrently enhances the constructive and humanistic dimensions of the subject [3]. Mathematical concepts framed within cultural perspectives empower students to reflect upon and appreciate both their own culture and the diverse cultures and traditions of others [4]. In China, the burgeoning interest in mathematical culture has fostered the integration of scientific and humanistic values within the mathematics discipline. This integration holds significant implications for the reform of mathematics education and offers valuable insights [5,6]. The development of mathematical cultural curricula has naturally become a priority for educators in their classroom teaching [7]. In the 21st century, digital technologies are widely used in education [8]. Digital resources provide new possibilities for mathematical cultural courses. To reflect the current application status of digital resources in mathematics education, ZDM- Mathematics Education has set up the following two volumes of journals specifically dedicated to discussing this topic: “Digital Curricula in Mathematics Education (2017)”, and “Teaching with Digital Technology (2020)”. Through digital resources, teachers can vividly showcase mathematical content to present students with a diverse range of mathematical practices and application scenarios [9]. Furthermore, digital resources can help teachers better personalize instruction by designing teaching based on students’ levels and interests, promoting learning and exploration in mathematical cultural courses [10]. Therefore, researchers are focusing on teachers who use digital resources, such as understanding and explaining the essence of teachers’ classroom practices and technology [11], development of Knowledge for Teaching Mathematics with Technology (KTMT) for pre-service mathematics teachers through digital technology [12] and guiding teachers in implementing instructional tasks in the classroom using digital technology [13]. Mathematics educators have recognized the convenience of digital resources in developing mathematical culture curricula. However, there has been a notable lack of discussion regarding the factors influencing teachers’ use of these digital resources. The use of digital resources by teachers in developing mathematical culture curricula suggests that it can be analyzed through the lens of Venkatesh et al. [14]’s Unified Theory of Acceptance and Use of Technology (UTAUT) model. This model offers the advantage of analyzing various influencing variables such as performance expectancy, effort expectancy, social influence, and facilitating conditions. Our study focused on addressing the following two research questions.",
    "(1) Based on the UTAUT model, what are the hindrances (or drivers) for teachers to use digital resources to develop mathematical culture lessons? The literature review is divided into three parts. The first part highlights the current situation and future trends of digital resources in education; the second part examines the significance of the relevance of teachers’ use of digital resources to support teaching and learning in the mathematics classroom based on the theme of mathematical culture; and the third part discusses the use of the UTAUT model to measure the factors influencing the mathematics teachers’ use of digital resources to develop mathematical culture curriculum, as well as the hypotheses formulated in this study. Digital resources refer to instructional materials that can be operated on computers or in network environments, including multimedia software, digital images, digital audio, websites, databases, data files, e-mails, online learning systems, etc. [15]. The term “digital resources” is widely used in the field of education to describe specific knowledge and skills related to teachers’ professional digital capabilities [16]. Since the outbreak of the COVID-19 pandemic globally, online digital resources have become the mainstream mode of education [17]. The applications of digital resources in education and teachers’ ability to handle digital resources have increasingly become a focus of research in various countries. For example, 70% of teachers in Germany created digital resources for their lessons themselves [18]. In the Australian curriculum, teachers are required to introduce the following digital resources to teach [19]: According to the European Framework for the Digital Competence of Educators (DigCompEdu) [20], teachers need to have the ability to select digital resources, create and modify digital resources, as well as manage, protect, and share digital resources. Additionally, to promote scientific and technology innovation and national sustainable development, France issued the 2023–2027 Education Digitization Strategy in January 2023. This provides favorable support for students to improve their mathematical literacy and teachers to carry out digital teaching [21]. At the World Digital Education Conference held in February 2021, Huai Jinpeng, Minister of the Ministry of Education of China, emphasized that “Digital transformation is an important carrier and direction for education transformation worldwide” and “Application is the most fundamental and powerful driving force for the digitization of education” [22]. Therefore, conducting in-depth research on teachers’ use of digital resources and the factors influencing them is of significant importance for promoting the high-quality development of digital education [21]. The mathematician Raymond Louis Wilder (1896–1982) proposed in his book “Mathematics as a Cultural System” (1981) that mathematics is a subculture of our general culture [23]. On that basis, mathematics educator Alan J. Bishop (1937–2023) believed that mathematics, as one of the oldest disciplines, has its own unique history and culture [24]. With the deepening of educational reform, it is increasingly recognized that the mathematical culture can build a bridge between anthropologists, cultural historians, and mathematicians to understand different mathematical thinking modes [25]. The curriculum of mathematics culture has also become an important way to pursue educational reform, with an increasing number of researchers in China participating in the study of mathematical culture. According to Wang [26], the cultural value of mathematics and its history could be reflected in five dimensions: historical topics, interdisciplinary connections, social roles, aesthetics & recreation, and multiculturalism. Researchers have analyzed mathematical teaching activities [27], mathematics textbooks [28], and text items of national college entrance examination [29] using this practical framework structure. Zhang and Ran [30] designed a fusion of mathematical cultural project-based learning with STEAM education, placing teachers at the outermost layer of mathematical cultural teaching goals and student- centered approaches, allowing teachers to play roles as designers, developers, and facilitators. Chen and Sun [31] proposed that participation in mathematical cultural activities can greatly promote the professional development of primary school teachers. At the same time, the above studies provide teachers with ideas for using digital resources to develop mathematical cultural curricula. For several decades the potential of digital resources for education, and for mathematics education in particular, has been widely recognized [32]. Digital resources offer incentives and increasing opportunities for mathematics teachers’ design, both individually and in collective [33]. Digital materials offer several affordances over print materials in the format, fit, and flexibility of the educative information provided to teachers, as well as the ability of the materials to track and follow up on teacher behaviors [34]. Designing course materials through digital resources not only helps teachers spread mathematics culture but changes traditional classroom teaching and stimulates students’ interest in mathematics.",
    "The Unified Theory of Acceptance and Use of Technology (UTAUT) model was developed by Venkatesh et al. [14]. It is proposed based on the Technology Acceptance Model (TAM) theory [35] and related user acceptance theory. This model aims to explain and predict the factors that affect the user’s acceptance and application of technology, especially the user’s intention to use the information system and the subsequent actual use [36]. The UTAUT model identifies the following four dimensions as significantly influencing an individual’s willingness and behavior to use technology: performance expectations, effort expectations, social influence, and facilitating conditions. Building on this foundation, we posit that teachers are influenced by relevant policies when utilizing digital resources to develop a mathematical culture curriculum. Through an extensive review of the relevant literature, we incorporated the Perceived Importance of Policy (PIP) as a critical variable into the UTAUT model, following the recommendations of Patil and Undale [37] and Hu et al. [38], to enhance the study’s robustness. By referencing studies related to UTAUT [39–44], we have illustrated the relationships in Figure 1. PE is understood as “the degree to which an individual believes that using technology will help him or her to attain gains in job performance” [14]. In order to investigate the teacher’s use of digital competence and its incidental factors, Guillén- Gámez et al. [45] used the unified theory of acceptance and use of technology and the results show that performance expectancy is associated with behavioral intention. In this study, PE is framed as the degree to which teachers believe that digital resources will improve their teaching performance in mathematical culture curricula. Formally, it is hypothesized that: EE is defined as “the degree of ease associated with using the technology” [14]. EE is primarily associated with the perception that a technology tool can be easily utilized in the classroom environment [46,47]. In this study, it was hypothesized that teachers would show more positive and accepting behaviors toward the program if they perceived the digital resources as easy to use. Based on the role of EE in UTAUT, the following hypothesis will be evaluated: SI is conceived as “the degree to which an individual perceives that important others believe he or she should use the new system” [48]. Some researchers have used SI influence as a “social norm” or “subjective norm” [49,50]. A previous study showed that SI has an important effect on teachers’ use of technology [36]. This study considers that teachers are influenced by their surrounding students and peers, among others, in their use of digital resources. Thus, the authors proposed the hypothesis that: PIP refers to the degree to which teachers view policy as important in their intention to use technology [51]. To anticipate the teacher’s behavioral intention to use technology resources, the variable PIP is commonly integrated with the unified theory of acceptance and use of technology [52,53]. There is a strong policy push to adopt digital resources [32]. Based on this, the following hypothesis is put forward: FC is often measured as the perceived availability of environmental support that encourages and facilitates the adoption of technology [54]. Based on the study conducted by Venkatesh et al. [14], FC directly influences the behavioral use of technology [37,38]. In this study, it is the accessibility of an appropriate learning environment and infrastructure within a school that can promote the teachers’ BI to use digital resources. As a consequence of the provided evidence, the following hypotheses are formulated: BI can be understood as the degree to which an individual formulates conscious plans to perform a behavior [14,48]. The UTAUT model postulates that the BI factor is an important predictor of how technology is used, as evidenced by different studies on mobile cloud learning resources or smartphone apps [55,56]. In the UTAUT model, BI is the most important factor affecting AU [36]. Therefore, this study can examine the variables in BI to positively influence AU and propose the following hypothesis: The study referenced the quantification of indicators on the AU of digital educational resources by Wang et al. [57]. By scoring the measurement of the frequency of teachers’ use of the type of math education resources in teaching, the responses were combined with other variables in the UTAUT model.",
    "This study proposes an extension of the UTAUT model as shown in Figure 1 based on the seven assumptions mentioned above. This study adopted a quantitative approach by using a questionnaire to investigate the factors influencing teachers’ use of digital resources to develop a mathematical culture curriculum. In addition, the study examined the moderating effects on all relationships within the conceptual model. The specific operation procedures were to use a self-compiled scale to collect information on mathematics teachers’ use of digital resources and to analyze this data using the Partial Least Squares-Structural Equation Modeling (PLS-SEM) method [58]. The proposed theoretical framework was tested in this study using a questionnaire which was divided into two parts [36]. The first part focused on demographic information about the mathematics teacher respondents. The study collected valid questionnaires from 873 math teachers from Henan Province, located in central China. Table 1 illustrates the demographic characteristics of participants. The sample of teachers included 420 males and 453 females. Age was categorized into four stages, with a distribution of 20.5% for those under 25, 28.3% for those 26–35, 30.6% for those 36–45, and 20.6% for those over 45. Bachelor’s degree and below, master’s degree, and doctoral degree were 59%, 36.8%, and 4.3% respectively. Teachers from elementary schools, middle schools, high schools, and colleges comprised 25.5%, 40.3%, 27.9%, and 6.2% of the sample respectively. The second part details of the questionnaire are presented in Appendix. The scale was adapted from the five dimensions of the UTAUT model proposed by Venkatesh et al. [14,48], performance expectancy, effort expectancy, social influence, facilitating conditions, and behavioral intention, combined with the perceived importance of policy dimension proposed by Huang and Teo [52,53,59] and the actual use by Wang et al. [57], for a total of 7 dimensions and 29 items. Moreover, to avoid neutral options and to show more nuance in the differentiation of their attitudes [60], this part of the scale used a 6-point Likert scale, with the first six dimensions anchored on “1 = completely disagree” and “6 = completely agree”, the actual use dimension was based on “1 = not used” and “6 = frequently used”. The data collected above are distributed and collected by the professional “wenjuanxing” platform (https://www.wjx.cn), and the contribution to this study was entirely voluntary. Participants were asked to submit an online questionnaire based on their perceptions and use of digital resources, and it was clarified to the teachers before the survey that this questionnaire was motivated by scientific research, that it was anonymous, that it did not involve an assessment of individual teaching competence, and that it would not have any adverse effects on personal health [61]. The data of this study was collected online to ensure the integrity of the data. In addition, a total of 894 questionnaires were returned, excluding some regular responses, which resulted in 97.7% valid questionnaires. Structural equation modeling (SEM) was employed in this study to analyze the methodology. SEM is employed to explore intricate relationships between directly and indirectly observed (latent) variables [62]. It encompasses two primary approaches for estimating relationships: covariance-based SEM (CB-SEM) and partial least squares SEM (PLS-SEM) [63]. Estimation and evaluation of PLS-SEM models adhere to the causal prediction paradigm, aiming to forecast the predictive efficacy of the model and derive theoretical insights. This characteristic is particularly pertinent to our study, prompting the selection of SmartPLS 3.0 software for data analysis and the application of PLS-SEM to estimate structural effects. Testing the theory via PLS-SEM entailed a two-phase approach [63]: (1) evaluation of measurement theory to ascertain the reliability and validity of the measurement model, and (2) assessment of structural theory. Table 2 shows the data on the mean, standard deviation, kurtosis, and skewness of each dimension of the questionnaire for teachers’ use of digital resources to develop mathematical cultural curricula. The scores of teachers’ use of digital resources show that the effort expectancy and the performance expectancy are at a high level relative to the other dimensions, with a mean of 5.11 and 5.02. While the behavioral intention and the actual use results are lower than the other dimensions, at 4.81 and 4.77. This preliminary validation confirms the hypotheses proposed in this study and there are certain factors that hinder teachers’ use of digital resources. Furthermore, the data normality was tested by assessing the skewness and kurtosis values [64,65], as the kurtosis values are all within ±10 and skewness values are all within ±3, data are considered to be normally distributed [66].",
    "The objective of this part of the model evaluation is to ensure the reliability and validity of the construct measures and therefore provide support for the suitability of their inclusion in the path model. The key criteria include internal consistency reliability (Cronbach’s alpha, composite reliability), indicator reliability, convergent validity, and discriminant validity [63]. Table 3 presents multiple categories of data from the measurement model, including outer loadings and variance inflation factor (VIF) for each item and Cronbach’s alpha, average variance extracted (AVE), and composite reliability (CR) for each dimension in the measurement model. Firstly, the Cronbach’s alpha for each dimension of the questionnaire ranged from 0.824 to 0.923, and the CR ranged from 0.884 to 0.925, which is higher than Hair et al. [63] proposed criterion of 0.70. Secondly, the indicator loadings in this study were in ranged from 0.767 to 0.908, and according to Hulland [67], indicator loadings > 0.708 can be used for further testing. Thirdly, the lowest value of AVE was owned by AU of 0647, which was larger than the critical value of 0.5 [63]. Finally, researchers take VIF < 5 as an indicator of multicollinearity [68,69]. The highest value of VIF was owned by FC of 3.280, indicating that there is no collinearity problem in this study model. Table 4 shows the discriminant validity as assessed by the Fornell-Larcker test, which emphasized the correlation of items under the same latent variable and the differentiation between latent variables, respectively [63]. The square roots of the AVE were placed on the diagonal and bolded, and they were overwhelmingly larger than the coefficients in each column, indicating that the measurement model had good discriminant validity [70]. Since the indicator reliability, internal consistency reliability, convergent validity, and discriminant validity of the measurement model fulfilled the criteria, this means that the assessment of the measurement model is satisfactory, and further evaluation of the model can be conducted. The model in Figure 2 was drawn using SmartPLS software and evaluated using the measured data. According to Hulland [67], “the overall goodness-of-fit of the model should be the starting point of model assessment”. The standardized root mean square residual (SRMR) and normed fit index (NFI) values were commonly used to evaluate the suitability and robustness of the model [60]. In this study, the SRMR value was 0.058, less than 0.08, and the NFI value was 0.847, slightly less than 0.90, but still within an acceptable range [63]. The coefficient of determination R2 value represents the methodological amount of endogenous structure explained by all exogenous structures associated with it to assess the ability of the model to fit the explanatory power of the model to the strength of the associations indicated by the PLS path model it quantifies [63]. The R2 values of behavioral intention and actual use were 0.753 and 0.680, respectively, which means the model had excellent explanatory power for these two endogenous constructs. technique. Table 5 shows the path coefficients, effect size f2, T-statistics, and P-values for each hypothesis. It is clear that all the hypotheses are supported except H1 which was found to be not supported. The effect size in SEM, usually symbolized by f2, measures the impact of the predictor on the predicted construct when an exogenous construct is removed from the model [72]. According to Hair et al. [63], the larger the f2, the stronger the relationship between paths. Among them, H1 (β = 0.056, p = 0.249 > 0.05) describes the path between performance expectancy and behavioral intention, indicating that teachers’ performance expectancy in developing mathematical culture curricula using digital resources and behavioral intention had no significant effect. H2 (β = −0.107, p = 0.025 < 0.05) describes the path between effort expectancy and behavioral intention, indicating that there is a significant negative relationship between teachers’ effort expectancy in developing mathematical cultural curricula using digital resources and behavioral intention. Other hypotheses, such as H3 (β = 0.494, p < 0.001), H4 (β = 0.194, p < 0.001), H5 (β = 0.274, p < 0.001), H6 (β = 0.332, p < 0.001) and H7 (β = 0.536, p < 0.001), all demonstrated a positive facilitative relationship for teachers using digital resources. In addition, Table 5 also shows the values of the indirect effects of the different variables. There was an indirect negative correlation between the effort expectancy and teachers’ actual use in developing mathematical cultural curricula using digital resources (β = −0.058, p = 0.018 < 0.05), which was moderated through behavioral intention. Meanwhile, three other sets of variables such as teachers’ social influence (β = 0.265, p < 0.001), facilitating conditions (β = 0.104, p < 0.001), and perceived importance of policy (β = 0.147, p < 0.001) on there in developing mathematical cultural curriculum using digital resources all have an indirect positive and significant contribution to their actual use.",
    "The primary objective of this study was to evaluate the factors influencing teachers’ utilization of digital resources in developing math culture curricula. Utilizing the UTAUT model, this study expanded the original independent variables (performance expectancy, effort expectancy, social influence, and facilitating conditions) by incorporating the perceived importance of policy variables. Rigorous data testing yielded valid evaluation results. The study reached the following conclusions: Firstly, among all the influential factors, H1 (β = 0.056, p > 0.01) indicates that performance expectancy does not significantly affect teachers’ behavioral intention to use digital resources. This result aligns with the findings of Yuan et al. [68] and Altalhi [73]. Although numerous studies have validated performance expectancy as a significant motivator of teachers’ intention to use technology [74–76], this finding evidently does not apply within the context of teaching mathematics culture. The other five factors remained significant. Secondly, the findings indicate that effort expectancy significantly influences teachers’ use of digital resources. However, unlike existing studies [42,77], this study found that higher effort expectancy actually reduces teachers’ behavioral intention and actual use of digital resources. Additionally, several other factors (social influence, facilitating conditions, and perceived importance of policy) significantly contribute to behavioral intention and indirectly to actual use. Finally, the second question in the introduction is summarized here. The deep integration of technology and the field of education will be the future trend [11]. In the teaching of mathematical culture, the driving factors are stimulated based on efforts of all parties to promote the use of modern technological tools for teachers to integrate into classroom teaching, improve the efficiency of mathematics classroom teaching, and enhance the Knowledge for Teaching Mathematics with Technology (KTMT) of mathematics teachers [78]. Specific recommendations are as follows: (1) Appropriately reduce teachers’ Effort expectancy (EE) for the use of digital resources. Moores and Chang [79] argued that too much self-efficacy may over time, instead of facilitating behavior, lead to overconfidence and reduce actual behavior towards the event. At this point, teachers need to make self-regulation so that they can better structure the way they work [80]. (2) Social influence (SI) is the most important of the three sets of drivers, which suggests that teachers are more willing to observe the behaviors and perceptions of their peers around them when it comes to the overall perception of using digital resources to develop mathematical culture curricula and that peer-observed teaching can provide reinforcement for teachers’ goals and practices in using electronic resources [81]. Facilitate teachers’ use of digital resources by building digital resource-based collaborative workshops for teachers to interact with each other, engage in peer-to-peer support, or invite relevant experts to promote teachers’ use of digital resources. (3) Facilitating conditions (FC) were also a driver for teachers’ use of digital resources. Teachers perceived that the necessary knowledge and skill base was a prerequisite for the use of digital resources and that the infrastructure and access assistance provided by the school were conducive to facilitating the use of digital resources. According to previous studies, teachers were more likely to accept educational technology supported by administrative support, peer collaboration, and technology support provided by the school [82]. Educational administrators can provide teachers with a good application environment by providing supporting facilities and training and encouraging teachers to master the access to and application of digital resources. (4) Perceived importance of policy (PIP) likewise drives teachers’ use of digital resources. According to Kim and Lee [74], educational policies drive the use of technology in education. Educational leaders should develop policies related to digital resources to encourage teachers’ willingness to integrate This study used the PLS-SEM methodology based on the extended UTAUT model to analyze the impediments and drivers affecting teachers’ use of digital resources to develop mathematical culture curricula. It was found that performance expectancy (PE) had no significant effect on teachers’ use of digital resources. Higher effort expectancy (EE) hindered teachers’ willingness to use digital resources and their actual behaviors. The remaining influences such as social influence (SI), facilitating conditions (FC), and perceived importance of policy (PIP) were the three factors that (SI), facilitating conditions (FC), and perceived importance of policy (PIP) drive teachers to use digital resources to develop mathematical culture curriculum, with SI being the most influential.",
    "For this study, the theoretical significance lies in the expansion of the UTAUT model based on Venkatesh et al. [14]. (1) The variable of perceived importance of policy (PIP) of teachers was added in the context of educational policy on digital resources, which was found to have a facilitating effect on teachers’ utilization of digital resources. (2) The study considered the direct effect of facilitating conditions (FC) on behavioral intention (BI) and actual use (AU) and found that both were positively facilitated. (3) Behavioral intention (BI) was found to play an important role as both a direct influence and a mediating effect on actual use (AU). The practical significance of this study is to help schools and the government to identify the important factors affecting teachers’ utilization of digital resources and to enhance teachers’ knowledge of using digital technology in teaching mathematics by rationally moderating the hindering factors and stimulating teachers’ use of new technologies, which in turn will enhance teachers’ professional competence. resources to develop mathematical culture curricula and solid conclusions were obtained through quantitative research. Regrettably, there are some limitations of this study, which can also be seen as a direction for future research. First, the sample of this study was limited to teachers in Henan Province, China, and the factors influencing teachers’ use of digital resources to develop a mathematical culture may vary in other regions due to cultural differences; therefore, the results of the study cannot simply be generalized to other educational areas and other countries, and we recommend that similar studies be conducted in the future with larger samples. Second, although this study used the UTAUT model for analysis, it did not consider the moderating effect of other important variables such as gender, age, and experience on teachers’ utilization of digital resources. Venkatesh et al. [14] suggested creating a new structure in the latest research context and merging all the moderating variables on teachers’ utilization of digital resources. Third, the measures of both behavioral intention and actual behavior were based on quantitative data on self-perception, which may lead to the problem of biased self-reports. Therefore, future research should be further validated through classroom observations/teacher interviews. Finally, the study concluded that behavioral intention not only directly influences teachers’ actual use of digital resources, but in addition, it also plays a mediating effect, in the future, we may also try to add other variables as influences on teachers’ use of digital Author contributions: Conceptualization, JL and JC; methodology, JL; software, JL; validation, JL, RL and JC; formal analysis, JL; investigation, JL; resources, JL; data curation, JL; writing—original draft preparation, JL; writing—review and editing, RL and JC; visualization, JL; supervision, RL; project administration, RL; funding acquisition, RL. All authors have read and agreed to the published version of the manuscript. Acknowledgments: The authors thank all mathematics teachers in the Henan province of China who supported this study. The authors express gratitude to the three anonymous reviewers whose suggestions have improved the quality of this paper. Data availability statement: The data used to support the findings of this study are available from the corresponding author upon reasonable request."
]