[
    "Abstract. The rise of green economy and sustainable development requires enterprises to pay more attention to comprehensive performance in the process of performance evaluation. With the rise of the concept of green mine, mine performance evaluation also pays more attention to environmental protection and comprehensive utilization of resources. The comprehensive performance evaluation index system of mines is constructed from three aspects: economic output performance, comprehensive development and utilization performance, and environmental governance performance. The comprehensive performance of 18 major mines in Songxian County, Henan Province is evaluated by using the analytic hierarchy process and entropy method. The results show that the overall performance of the main mines in Songxian County is low, and most of the mines have poor performance in comprehensive development and utilization and environmental governance. The task of building green mines is still very heavy. China is a large mining country with special geological conditions and rich mineral resources, so it is of great social significance and economic value to study mining enterprises[1]. However, due to the large number of mining enterprises in China, it is impractical to fully cover them. Therefore, this paper takes Songxian County, Henan Province as an example to conduct in-depth research. Mines are everywhere in Songxian County, and mining industry has become its pillar industry, with the output value of mining industry accounting for more than 80% of its total industrial output value[2]. However, mining has a high degree of disturbance to the environment. With the rise of green economy, how to improve mine performance while reducing damage to the environment has become a common concern of mining enterprises, governments and society. Mining enterprises have the dual attributes of economic entity and social entity, which requires us to re-examine mine performance evaluation from the perspective of green economy[3]. and even evaluated the green mine construction by combining analytic hierarchy process (AHP) and fuzzy comprehensive evaluation. However, there is still a lack of research on the evaluation of mine performance from the perspective of comprehensive performance, which is also the main starting point of this paper[5]. The traditional enterprise performance evaluation is mostly from the purely financial performance, ignoring the corporate social responsibility. With the rise of sustainable development, green economy and other concepts, people begin to pay attention to the social and environmental performance of enterprises. Building green mines and developing green mining have also become a new trend of mining development. Some scholars have also established the evaluation index system of green mine construction and mine sustainable development[4], © The Authors, published by EDP Sciences. This is an open access article distributed under the terms of the Creative Commons Attribution License 4.0 (http://creativecommons.org/licenses/by/4.0/). The traditional enterprise performance evaluation focuses on the financial indicators, while the green mine construction focuses on the social and environmental benefits of the mine. In view of this, from the perspective of green economy, this paper combines economic benefits with social benefits and environmental benefits, and comprehensively considers the systematicness, completeness, scientificity and operability of the indicator system to build a comprehensive performance evaluation indicator system for mines. Economic benefit is the primary goal pursued by mining enterprises, which is also the focus of traditional enterprise performance evaluation[6]. In the era of sustainable development, how to maximize social benefits while pursuing economic benefits has become a common concern of enterprises and society. The development of green economy requires that enterprises not only pursue economic interests, but also minimize the pollution and damage to the environment. For mining enterprises, the development and utilization of mineral resources and the restoration and management of the mine environment are the biggest problems they face[7]. To comprehensively develop and utilize the mine and restore and manage the damaged ecological environment in the mining area, a large amount of capital needs to be invested. Although it has relatively good social benefits, it is difficult to bring profits for enterprises in the short term. Therefore, this paper examines the comprehensive performance of mines from three aspects: economic output performance, comprehensive development and utilization performance, and environmental governance performance. The economic benefits of the mine include two aspects. One is the profitability, that is, the ability to obtain profits, which is the primary purpose of the enterprise; The second is the operation capability, that is, the daily operation and operation capability of the enterprise, which is the key to the normal operation of the enterprise[8]. Profitability and operating capacity are also key indicators of traditional financial performance evaluation, so this paper measures the economic benefits of mines from these two aspects. The comprehensive development and utilization performance is mainly to investigate the production efficiency of the mine in the mining process and the comprehensive extraction efficiency of the resources in the mining area, including both the resource mining capacity of the mineral enterprises and the technical standards for resource mining and beneficiation. This paper mainly measures the productivity utilization rate, the ratio of technicians and the main technical indicators for mining and beneficiation. The performance of environmental governance mainly focuses on the performance of ecological environment restoration and governance in the mining area and the existing environmental damage problems, so it is mainly measured from the investment in restoration and governance, land Based on the perspective of green economy, according to the above analysis, with the comprehensive performance of mines as the evaluation target, and with the economic output performance, comprehensive development and utilization performance and environmental governance performance of mines as the criteria, a comprehensive performance evaluation index system of mines containing 14 indicators has been constructed.",
    "From the perspective of green economy, this paper constructs a three-dimensional comprehensive performance structure including economic output performance, comprehensive development and utilization performance and comprehensive governance performance, and evaluates the comprehensive performance of 18 mining areas in Songxian County, Henan Province, using AHP and entropy method. From the evaluation results, we can draw the following conclusions. (1) The overall performance of major mines in Songxian County, Henan Province is low. The evaluation results show that the comprehensive performance evaluation values of most mines in Songxian County are lower than 0.5, and only Fengyuan Molybdenum Industry is higher than 0.5. For a long time, the pursuit of economic benefits has been the main goal of mining enterprises, while the comprehensive development and utilization of resources and the restoration and management of the ecological environment have not been given enough attention. In this paper, the performance standards of comprehensive development and utilization of resources and comprehensive environmental governance are added in the evaluation. Because most enterprises do not pay enough attention to these two aspects, the performance scores in these two aspects are relatively low. Fengyuan Molybdenum Industry, as one of the 38 green mine construction pilot units in China, has made a large amount of investment in the comprehensive development and utilization of resources and the comprehensive management of the mine environment. Although the economic output performance is average, after adding the performance evaluation indicators of these two aspects, due to its outstanding performance in the comprehensive development and utilization of resources and the comprehensive management of the environment, The comprehensive performance score of Fengyuan Molybdenum Industry ranks first among all mines. In terms of comprehensive development and utilization of resources and comprehensive environmental governance, although the financial performance of the mine cannot be directly improved in the short term, in the long run, this conforms to the development trend of green economy, and is also a manifestation of enterprises' active social dimensions, the performance fluctuation of comprehensive development and utilization is the smallest, while the fluctuation of economic output performance and environmental governance performance is relatively large. The comprehensive development and utilization of resources is reflected in the comprehensive mining and utilization of ores in the process of mine operation. Most of the mineral deposits in Songxian County are small and medium-sized poor ores, which are difficult to be mined on a large scale. Only by comprehensive development and utilization can the output be effectively increased. Therefore, there is not much difference between different mines in this regard. However, the fluctuations in economic output performance and environmental governance performance are relatively large, which is also the main reason for the differences in comprehensive performance evaluation scores. Economic output performance is a direct evaluation standard for the operation of mining enterprises, while a large amount of investment is required for comprehensive environmental governance, so these two aspects are the main aspects reflecting the difference in mine performance. Mining enterprises need to strengthen their own operation and management, balance economic output and environmental protection input, and strive to improve comprehensive performance. Especially those mining enterprises with good economic benefits but insufficient comprehensive environmental governance need to continue to improve environmental protection and governance in mining areas, which is also the requirement for the development of green mining. Due to data limitations, the mine performance evaluation index system constructed in this paper still has room for improvement, especially in the aspect of mine environment recovery and governance performance, which can increase indicators such as energy consumption in the mining area and emissions of three wastes. In addition, it is also possible to track and study the mining area, evaluate the comprehensive performance of the mining area for many consecutive years, and understand its dynamic changes. On the basis of adhering to the National Mineral Resources Planning, taking the PRED theory of sustainable development as the basis, and in accordance with the principles of objectivity, dynamic development and operability, the framework of green mine performance evaluation index system based on circular economy is established. This performance evaluation indicator system will make the requirements for green mine construction more clear, make the green mine construction indicators more scientific, and help the scientific planning, comprehensive utilization and sustainable development of mineral resources development.",
    "On the government side, it is a realistic way to accelerate the transformation of the mining development mode. To develop green mining and build green mines, we should take rational utilization of resources, energy conservation and emission reduction, protection of the ecological environment and promotion of mine land harmony as the main goals, and take scientific mining methods, efficient resource utilization, standardized enterprise management, environment-friendly production processes, and ecological mining environment as the basic requirements. We should apply the concept of green mining throughout the whole process of mineral resources development and utilization, and promote the development model of circular economy, Realizing the coordination and unification of economic benefits, ecological benefits and social benefits of resource development provides a realistic way to change the development and utilization mode that simply consumes resources and destroys ecology. Third, it is an important means to implement corporate responsibility and strengthen industry self-discipline to ensure the healthy development of mining industry. The key to the development of green mining and the construction of green mines is to fully mobilize the enthusiasm of mining enterprises, strengthen industry self-discipline, promote mining enterprises to run mines according to law, standardize management, strengthen scientific and technological innovation, and build enterprise culture, so that mining enterprises can transform the external requirements of efficient utilization of resources, environmental protection, and promotion of mine land harmony into the internal driving force of enterprise development, and consciously assume the responsibility of resource conservation and intensive utilization, energy conservation and emission reduction, environmental reconstruction Corporate responsibility for land reclamation and promoting local economic and social development. The construction of green mines is a change in the way mining enterprises operate and manage. It is of great significance to improve the joint responsibility mechanism of mineral resources management, comprehensively standardize the order of mineral resources development, and accelerate the construction of a new mechanism to ensure and promote"
]