[
    "Abstract: With the “constructive destruction” of rural land and landscape, rural areas gradually lack of regional characteristics and humanistic care.This paper takes Wangtang Village of Pingdingshan City in Henan Province as an example.From respecting the spirit of the place and the historical context, we will create a space with a sense of belonging, diverse functions and public participation.Hope to provide people with a sense of happiness, security, belonging, with a human place. Keywords: Village; Space Construction; Spirit of Place In contemporary China, with the out-migration of rural population, the urbanization rate continues to rise. But with a complex and huge population base, there are still more than 500 million people in rural areas.In recent years, the continuous advancement of urbanization has accelerated the renewal construction of rural areas, but the rural land and landscape have suffered “constructive destruction”.The countryside lacks regional characteristics and humanistic care, and is even described as a boring space with no sense of security, neighborhood and human touch.This makes people unable to find emotional belonging in the transformed environment, and then produce a deep sense of loss.Therefore, rural landscape design should not only consider from the perspectives of industry, ecology and economy, but also pay attention to the construction of rural spiritual civilization.Rural construction needs to respect the spirit of place and historical context, and create a space with a sense of belonging, diverse functions and public participation. The project is located in Wangtang Village, Pingdingshan City, Henan Province, adjacent to Lushan County and Ruzhou City, with convenient transportation and rich tourism resources.The design site is located at the entrance of tongxin Lane, Wangtang Village, adjacent to the farm yard and a vinegar workshop. On May 15 international Family Day, Wangtang Village was awarded the second batch of Family education Demonstration base in Henan Province.Led by volunteers, villagers study together. The villagers have something to do and books to read, and they get happiness, security and satisfaction from the construction of spiritual civilization. In order to better guide the construction of rural collective memory, the suggestions of aborigines should be respected in the process of landscape reconstruction or new construction.Strive to achieve a balance between the traditional consciousness of indigenous people and the tourism imagination of tourists.Therefore, the design team conducted in-depth communication with the indigenous people in the village during the site investigation.When we arrived at Wangtang village, villagers were weaving insoles in the courtyard under the guidance of volunteers, and we talked to them.We learned that most of the villagers are elderly and children, who often read books and weave insoles together under the guidance of volunteers.In the design and construction process, we always pay attention to the needs and changes of indigenous people, and make adjustments in the design scheme. The hope is to maximize the protection of indigenous peoples’ traditional consciousness and realize their spatial needs. In the development of rural tourism, intangible cultural heritage products with local characteristics will become important tourism consumer goods.Rural revitalization is inseparable from the continuous innovation and development of traditional crafts in order to meet the aesthetic needs of contemporary people.Therefore, the site construction introduces the local embroidery, paper cutting and other intangible cultural heritage into the product cultivation of family education culture in Wangtang Village. Establish the image of characteristic products, expand the popularity of family education culture of Wangtang Village with the material carrier of products.The villagers are cultivated as heritage inheritors and traditional skills are integrated into the family education and cultural products of Wangtang Village.The design team conceived creative intangible heritage products for the villagers that could reflect the family education culture of Wangtang Village.Update and upgrade the existing products to enhance the aesthetic degree and expand the influence. in people’s long-term agricultural production and life practice. Rural culture, as a cultural type different from urban culture, has its economic basis, cultural ecological environment, communication channels and construction subjects.The unique formation conditions of rural culture bring up the differences and diversity of rural culture in expression forms and specific contents. People with wisdom in different regions, different historical periods to create a variety of rural culture patterns. Therefore, we excavate the history of family education in Wangtang Village through literature review, hoping to fully display the culture of family education in Wangtang Village to visitors through a more intuitive landscape space.The family education activities of Wangtang Village are sorted out and the story wall is established to narrate the family education stories of Wangtang Village.In addition, family education activities are planned in the site, and visitors are invited to participate, so that they can deeply feel the simple family education culture.",
    "Through the preliminary analysis and strategy, we formed the final design scheme. The site was reorganized in six steps to form a new form of space(Fig. 1). In the area of regional culture, we set up the wangtang Village family education history display wall. Through the expression of local elements and cultural integration to tell the history of family education construction in Wangtang Village.In terms of leisure space, we extracted the insole patterns designed by villagers and applied them to the design details of the site.The core landscape of the whole site is the Wangtang Village family education story wall. In the form of solid wood roof form, meaning thousands of families. The story of family education in Wangtang Village is displayed under the wooden beams and eaves. In addition to static cultural landscape presentation, we also set up interactive landscape installations.Bamboo sticks with book names are tied around the stone mill, and a turntable is placed at the bottom of the stone mill so that visitors can rotate the stone mill and select books. After the site construction was completed, the design team went to Wangtang Village again, where we inspected the site and experienced the space together with the villagers.Inside the small courtyard built of green bricks and tiles is the laughter of the villagers in Wangtang Village.On the central view wall of the space is carved the simple and touching family story of Wangtang Village. The thick family education culture is condensed and reproduced in this courtyard. Based on the “spirit of place”, this paper takes the reconstruction of Wangtang Village in Pingdingshan city as an example. Starting from respecting the spirit of place and historical context, we should create a space with a sense of belonging, diverse functions and public participation, and promote the construction of rural spiritual civilization.It is expected to provide reference for other rural areas to construct a space with regional characteristics and place spirit."
]