[
    "Abstract: Under the trend where manufacturing companies are increasingly pursuing green development and achieving sustainable transformation, medical device manufacturing companies, as essential enterprises with high pollution and closely related to public health, have gradually become the focus of attention. Improving the sustainable development performance of these enterprises will have a significant positive effect on improving people's well-being and protecting the regional environment. This study takes medical device manufacturing enterprises in Henan Province, China, as the research object. A total of 283 valid responses were collected through questionnaire surveys and using PLS-SEM empirical analysis methods to verify the framework of the impact of corporate sustainability cognition on sustainable performance through green innovation. The empirical analysis results prove that corporate environmental consciousness and corporate social responsibility directly or indirectly affect the three dimensions of sustainable performance. And green innovation plays a mediating role among them. The conclusion of this study points out that managers of medical device manufacturing companies should pay attention to the cultivation of corporate sustainability awareness. By enhancing corporate top-down social responsibility and environmental awareness, promoting green innovation capability in the production process of enterprise products, and improving enterprise sustainable performance, the realization of regional sustainable development goals can be accelerated. The traditional production method with the pursuit of economic goals as the first priority has led to various problems, including ecological damage, resource waste, and issues with product quality. These problems have caused irreversible negative impacts on human health, social operations, and other aspects and have greatly hindered the realization of the United Nations Sustainable Development Goals. To change the current situation, businesses must aim for \"sustainable transformation\" [1-2]. As highly polluting enterprises that are closely related to people's health, medical device manufacturing companies not only have a profound impact on public welfare but also play a significant role in regional environmental problems [3-4]. Especially since COVID-19, the demand © 2024 The Authors. This is an open access article distributed under the terms of the Creative Commons Attribution License 4.0 (https://creativecommons.org/licenses/by/4.0/). for medical devices has increased significantly [5]. The manufacturing process of disposable medical consumables inevitably produces a large amount of waste and resource consumption, which greatly damages the ecological environment. In addition, counterfeit and shoddy medical device products on the market also directly harm public health. Therefore, the sustainable development of medical device companies is closely related to the realization of the United Nations Sustainable Development Goals. However, as the manufacturing industry is closely related to public health, academic circles have not fully discussed the sustainable development of medical device manufacturing companies. Research mainly focuses on modifying existing medical devices to minimize environmental damage. There are also significant gaps in research on the internal sustainability transformation within medical device enterprises. Therefore, this study will conduct an empirical analysis to explore the relationship and influence path between the sustainable awareness of medical device companies, green innovation, and sustainability performance, aiming to provide theoretical support and suggestions for managers of medical device companies. Additionally, this study introduces the concept of \"Corporate Sustainability Awareness,\" which refers to an enterprise's cognition and awareness in pursuing sustainable development. This word includes a company's understanding of social responsibility and environmental protection, combining corporate social responsibility and environmental awareness two dimensions to explore the impact on corporate sustainability performance. According to the triple bottom line (TBL) theory proposed by Elkington [6]. If an enterprise wants to achieve sustainable development, it should adhere to the triple bottom line of economy, society, and environment. Regarding the measurement of corporate sustainable performance, based on the TBL theory, many scholars measure corporate sustainable performance from three dimensions: economic, social, and environmental. For example, the study of Shahzad et al. [7] measured sustainability performance in three dimensions: economic sustainability, environmental sustainability, and social sustainability. In the study of Zaid et al. [8], sustainable development performance is also divided into economic performance, social performance, and environmental performance according to the TBL theory. For medical device companies to achieve sustainable development, this study will also conduct a comprehensive assessment of the sustainable development performance of medical device companies from three aspects based on the TBL theory: economic development, social development, and environmental development. Company management with high environmental awareness will be more proactive in dealing with issues such as waste emissions, energy consumption, and green production to promote corporate sustainability performance [9]. Existing research has also proven that corporate environmental consciousness positively impacts the promotion of corporate development. Research by Khan et al. [10] pointed out that a company's environmental awareness can improve the company's reputation and performance to benefit the company. The study of Tan et al. [11] also stated that a CEC can greatly affect the company's environmental performance, financial benefits, and sustainable competitive advantage, contributing to sustainable development.",
    "This study believes medical device manufacturing companies with high corporate environmental consciousness can improve their operational and production processes and enhance sustainable H1a: The CEC has a significant positive impact on the company's environmental development. H1b: The CEC has a significant positive impact on the social development of the company. H1c: The CEC has a significant positive impact on the economic development of the company. The importance of corporate social responsibility(CSR) has been widely discussed. CSR is often associated with content related to corporate sustainability. A large number of academic studies have proven the close relationship between CSR and sustainable development performance. The study by Malik et al. [12] pointed out that CSR has a positive and significant impact on sustainable performance. Similarly, Khan and Ghouri [13] stated through an examination of the tourism sector that CSR positively impacts the sustainable performance of organizations. As the sample enterprise in this study, medical device companies improve their social responsibilities, truly consider the needs of stakeholders, establish a corporate culture of green production, and conduct business with integrity. This will not only allow patients to use safe, effective, and eco-friendly medical device products but also enhance public welfare and environmental protection. This effort significantly improves the company's reputation and commercial image value, ultimately improving sustainable development performance. Based on the above content, this study proposes the following hypotheses about medical device manufacturers: H2a: CSR has a significant positive impact on the environmental development H2b: CSR has a significant positive impact on social development. H2c: CSR has a significant positive effect on economic development. Green innovation(GI) is a green improvement and extension of traditional innovation. It is also regarded as one of the most important forces for achieving a win-win situation for economic growth and environmental protection [14]. The impact of green innovation on corporate sustainable development performance is self-evident. A large number of studies have proven that green innovation can play a significant positive role in different dimensions of an enterprise's sustainable development performance [15-17]. Therefore, this study believes that improving medical device manufacturing companies' products in an environmentally friendly manner is an essential approach to enhancing the sustainable development performance of the enterprise. In addition, there is also a close relationship between corporate sustainability awareness and corporate green innovation. Hao and He [18] mentioned through research on Chinese enterprises that corporate social responsibility has a significant role in promoting green innovation. Similarly, research by Pola et al. [19] pointed out that environmental awareness stimulates enterprises' interest in green innovation and promotes enterprises' green innovation level. Based on the above review, this study believes that green innovation plays a mediating role between corporate sustainability cognition and corporate sustainable performance. This study proposes the following hypotheses about medical device manufacturers: H3: The CEC of medical device companies can significantly positively influence GI. H4: The CSR of medical device companies can significantly positively influence GI. H5a: GI has a significantly positive effect on environmental development. H5b: GI has a significantly positive effect on social development. H5c: GI has a significantly positive impact on economic development. H6a: GI serves as a mediator between CEC and environmental development. H6b: GI serves as a mediator between CEC and social development. H6c: GI serves as a mediator between CEC and economic development. H7a: GI acts as a mediator between CSR and environmental development. H7b: GI serves as a mediator between CSR and social development. H7c: GI serves as a mediator between CSR and economic development. This study used a purposive sampling technique to conduct both online and offline questionnaire surveys among managerial staff at the grassroots, middle, and senior levels of medical device enterprises in Henan Province, China. Online questionnaires were distributed through the Questionnaire Star platform. Paper questionnaires were completed at participants' workplaces and other designated locations. A total of 283 valid responses were collected. This study also conducted a pilot test, with Cronbach's Alpha and CR values for all items being above 0.7. This study used the PLS-SEM analysis method to analyze the data and examine the relationship among variables. The questionnaire was divided into six sections, and measurement scales for all variables were adopted from mature scales developed by authors in previous studies. Likert seven- point scale was used for measurement, and all scale sources are described in Table 1.",
    "Using bootstrapping with 5000 samples, observe whether the 95% confidence interval of the mediating effect contains 0. The results are shown in Table 4: Through the above data analysis results, it can be seen that most of the hypotheses have been verified. Empirical results prove that the sustainability awareness of medical device companies can directly or indirectly positively affect multiple dimensions of the company's sustainability performance. The H1c hypothesis has not been verified, which indicates the positive effect of environmental consciousness of medical device enterprises on economic sustainability was not significant. However, environmental awareness of medical device enterprises can influence economic sustainability through green innovation. The reason for this may be that environmental awareness possessed by enterprises typically requires some practical experience to yield significant economic benefits in business operations and strategies. Chinese medical device enterprises face various constraints from external environmental factors in their operations, such as severe homogeneous competition and weak R&D capabilities [23]. Transitioning from having good environmental awareness to realizing economic benefits may require a specific time frame and overcoming some barriers. However, having a strong environmental awareness in medical device enterprises can promote the development of green technologies and eco- friendly products during production, leading to reduced resource consumption and ultimately lowering production costs. Additionally, environmentally friendly and safe medical device products are more likely to attract consumer attention, thus enhancing the enterprise's competitiveness in the market. Therefore, high environmental awareness in enterprises can indirectly impact the improvement of economic sustainability performance. Medical device manufacturing enterprises are closely related to achieving SDG3 and SDG12 by enhancing sustainable awareness and promoting green innovation, ultimately realizing sustainable development. This research draws the following main conclusions through empirical analysis: the sustainability awareness of companies regarding social responsibility and environmental protection is crucial for enhancing sustainable performance and achieving sustainable development. Having a high level of sustainability awareness can directly and indirectly influence the three dimensions of sustainable performance. As a highly polluting medical device manufacturing industry closely related to public health. The findings of this study emphasize the importance of fulfilling social responsibility, protecting the environment, and integrating green innovation into the production process. These factors all positively impact the sustainable development performance of enterprises. This research provides valuable insights for managers of medical device enterprises, encouraging them to prioritize corporate responsibility and awareness cultivation in their operations. Additionally, it offers policymakers a reference point, suggesting that governments should intensify training and dissemination of knowledge related to corporate sustainable development, enhancing corporate social responsibility and environmental awareness. All of these behaviors contribute to the early achievement of regional sustainable development goals. The sample region of this study, Henan Province, China, is a relatively economically developed area. Future research could focus on economically disadvantaged regions to compare the relationship between sustainable awareness and the sustainability performance of medical manufacturing enterprises across different cities and regions. Additionally, qualitative research methods could be employed in the future to delve deeper into the mechanism of influence between sustainable awareness and sustainability, thus enhancing the scope and depth of research in this relevant field."
]