[
    "ISSN: 2576-8484 Vol. 9, No. 3, 1252-1273 2025 Publisher: Learning Gate DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate Determining factors influencing environmental knowledge and place attachment on urban residents’ environmental responsible behaviour in urban green space of Henan Province, China: The role of situational factors as a moderator Abstract: From the perspective of emotional and rational integration, we analyze the environmental responsibility behaviors of urban residents in urban green spaces, such as parks, squares, and street green spaces, in order to provide a scientific basis for urban green space management. Based on ABC attitude theory, this paper takes urban green spaces in Henan Province, China, as a case study and explores the factors influencing urban residents' environmentally responsible behaviors by combining relevant literature and integrating green space characteristics. The framework of this study considers environmental knowledge as a cognitive factor and place attachment as an affective factor, while introducing situational factors as moderating variables. Among them, environmental knowledge is divided into two dimensions: subjective knowledge and objective knowledge, and the affective factor of place attachment is included from the perspective of the people-place relationship, which is integrated into the basic model as a mediating variable in order to examine the relationship between place attachment in environmental knowledge and environmentally responsible behavior. Based on 558 valid questionnaires collected in representative cities in Henan Province, this study constructed a model of the mechanisms influencing urban residents' environmentally responsible behaviors and empirically validated the theoretical model using structural equation modeling. The results show that environmental knowledge under each measurement dimension has a significant positive effect on environmental responsibility behavior and place attachment, with path coefficients of 0.419 and 0.775, respectively; and place attachment (path coefficient 0.469) also has a significant positive effect on environmental responsibility behavior. In addition, place attachment played a significant mediating role between perceived value and environmentally responsible behavior. Therefore, by enhancing the perceived value of green activities for urban residents, their sense of belonging to the local community can be enhanced, thereby stimulating conscious participation in environmental actions. With the acceleration of urbanisation and the expansion of population size, China's urban green spaces have inevitably been negatively affected by the irresponsible environmental behaviour of urban residents, resulting in more serious problems of ecological damage to green spaces. Littering, excessive planning and development, trampling of vegetation, collection of plant and animal specimens, History: Received: 10 January 2025; Revised: 24 February 2025; Accepted: 4 March 2025; Published: 15 March 2025 * Correspondence: guoguo15136072013@163.com disturbance of wildlife habitats and other acts of environmental protection awareness deficit have led to serious ecological degradation of travel destinations [1]. Scholars believe that environmentally responsible behaviour not only directly reduces the level of environmental damage to destinations, but also effectively controls the costs of ecological restoration and management operations at destinations [2, 3]. Environmentally responsible behaviours refer to the behaviours of people who take the initiative to avoid damaging natural resources and implement behaviours that are conducive to environmental protection as well as promote the sustainable development of natural resources during leisure and recreation processes [4, 5]. Exploring the factors andpathsaffecting environmentallyresponsiblebehaviour and strengthening the guidance ofurban residents'environmentallyresponsiblebehaviour has now become a real problem that needs to be solved urgently inthe management of urban green spaces. In order to stimulate the environmentally responsible behaviour of urban residents and promote the sustainable development of urban green spaces, more and more scholars have begun to pay attention tothe environmentally responsible behaviour ofurban residents, andthecurrentresearchon environmentallyresponsiblebehaviour focuses on three main aspects:(1)Research on related concepts [6, 7] (2)Dimensionality division relatedstudies [8-10] (3)Relevantstudiesoninfluencing factors [10-14]. Among them,sociology and psychology are crucial for the study of environmentally responsible behaviour [15] some scholars have explored the relationship between their role in influencing environmentally responsible behaviour from a place attachment perspective [16-19]. A growing number of scholars have initiated research on the effect of environmental knowledge as a cognitive factor on environmentally responsible behaviour Kautish and Sharma [20] and Liobikienė and Poškus [21]. [22] firstintroduced the concept of place attachment, which has since been applied to disciplinary areas such as society, leisure, and tourism .Individuals tend todevelop an emotional connection and psychological identification with spatial environments that they are frequently exposed to Zhang, et al. [23]. Research has shown that affective factors are more important and driving influences on an individual's environmentally responsible behaviour than rational cognitive factors [24]. Some scholars have also tried to explore the influencing factors of environmental responsibility behavior from the perspective of integrating cognition and affective [25].",
    "Based on this, this study integrates ABC attitude theory,incorporates the variable of place attachment from the perspective of human-land interaction, and adds it into the basic model as anintermediatevariable to study the relationship between place attachment and urban residents'environmental responsibility behaviours; based on the stimulus-organism-response theory, it incorporates the external objective situational factors - scenic area environmental quality and scenic area environmental policy - as moderating variables to regulate the relationship between place attachment and environmentally responsible behaviour, as a further extension of the basic model of urban residents'environmentally responsible behaviour, taking into account environmental cognitive factors, environmental emotional factors and external objective environmental factors, and exploring the relationship between place attachment and environmentally responsible behaviour factors and external objective environmental factors, to explore the influence of each variable on the environmental responsibility behaviour of urban residents, and to make suggestions forgreen space environmental protection based on the obtained hypothesis testing results, in order to better promote the sustainable development of urban green space. Hovland &Luxembourg proposed the ABC model of attitude in 1960, stating that consumer attitudes are formed through a three-dimensional mental process. Sears, et al. [26] argued that the components of attitude are Cognition is an individual's knowledge and beliefs about the subject matter of the attitude; affect is an individual's feelings about the subject matter of the attitude; and behaviour is an individual's tendency to act or behave in relation to the subject matter of the attitude [27] openly Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate suggests that attitude is the link between the object of study and evaluation. Based on attitudinal theory, it is possible to effectively study an individual's feelings towards the object of study.ABCattitude theory reinforces the interrelationship between cognition, affect and behaviour, and Solomon [28] introduced the concept ofhierarchy of effectsto explain the interplay of these three elements. The ABC Attitude Model summarises the interrelationships between consumers' emotions, cognition and behaviour, and in the research scenario of this paper, \"Cognition→affective→Behaviour\" of the Standard Learning Hierarchy Model can better explain the formation process of urban residents' environmentally responsible behaviours in the green space. the Russell and Mehrabian [29] constructed the \"stimulus-organism-response\" theoretical model from the perspective of environmental psychology. Stimulus (S) refers to the objective environmental factors that stimulate individual behavior, while organism (O) refers to the internal processing and emotional responses experienced during the transformation of stimuli into final behavior, and response (R) refers to the approach or avoidance behavior ultimately made by the stimulated individual [29]. Therefore, the complete pathway of human behavior generation is: external stimulus - cognitive/emotional mediator - behavioral response, and the theory describes the entire process of behavior generation [30]. Place attachment has been used to describe the phenomenon of people forming emotional ties with physical environments [31]. Place attachment serves as an emotional bond between people and the environment, which can be supplemented by functional connections, and the dependence on the functions provided by the landscape can strengthen this connection. Vaske and Kobrin [32] pointed out that the landscape is an important foundation for the formation of place attachment, and local residents continuously strengthen their place attachment through interactions with the landscape, forming a deeper emotional connection with it Vaske and Kobrin [32]. This study draws on the two dimensions of place attachment proposed by Williams et al., namely, place identification (emotional attachment) and place dependence (functional attachment). Sivek and Hungerford [33] pointed out that environmental responsibility behavior (ERB, environmentally responsible behavior) as a whole refers to people's spontaneous reduction in the use of natural resources or promotion of sustainable use of natural resources. The relevant research terms mainly include environmental responsibility behavior [34] pro-environmental behavior [35] environmental behavior [36, 37] environmentally friendly behavior [38] sustainable behavior [39] green behavior [40] etc. Overall, existing literature has no uniform standard in terms of terminology usage, and a unified term that is widely accepted and applied by researchers has yet to be formed. This study draws on the above research and categorizes environmental responsibility behavior into compliance-based environmental responsibility behavior and proactive environmental responsibility behavior. Barr [41] states thatsituational factors refer to the objective environment that residents face when making environmental behavioural choices, i.e., external factors that have an impact on the implementation of environmental behaviour by individual residents. Drawing on Bian [42] study, this paper categorises situational factors into environmental quality and environmental policy.",
    "Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate The influence of environmental knowledge on environmental responsibility behavior has increasingly attracted the attention of scholars. Based on the theory of rational behavior and norm activation, Han (2021) conducted a systematic review of the drivers of sustainable consumer behavior in environmental contexts through a literature review. The results showed that in the context of consumption of environmental products, environmental knowledge is more effective in activating individual environmental behavior. Based on the value-attitude-behavior model, Kim and Stepchenkova [43] conducted a cross-sectional survey on 287 valid questionnaires and found that there was a significant positive correlation between high knowledge groups and attitudes and environmental responsibility behavior, while no such correlation was found in low knowledge groups. Liu, et al. [44] conducted an empirical analysis on 2,824 respondents to assess the causal chain from environmental knowledge to pro-environmental behavior, and the results showed that environmental knowledge had no significant direct impact on pro-environmental behavior . Saari, et al. [45] used the ISSP Environment III open data set and conducted a face-to-face interview, self-completed questionnaire, and mixed-methods study to find that higher levels of environmental knowledge positively influence pro- environmental behavior [45]. Based on the value-belief-norm (VBN) theory, Liobikienė and Poškus [21] selected respondents through a quota sampling method and conducted a empirical analysis on their survey data. The results showed that environmental knowledge directly influences private-domain actions, but does not show a significant positive impact on public pro-environmental behavior. Wang and Yang [46] used structural equation modeling to analyze the relationship between environmental knowledge and green clothing consumption, and the results showed that both action skill knowledge and behavior efficacy knowledge have a positive impact on green clothing consumption . Therefore, the following hypothesis is proposed: What an individual knows about a culture and knowledge is not enough to foster a sense of place attachment towards the destination [47]. Cheng and Wu [48] empirically demonstrated that an individual's environmental knowledge can enhance place attachment through environmental sensitivity, but the direct relationship between environmental knowledge and place attachment has not been established [48, 49]. In the study of environmental compatibility and environmental responsibility behavior, activity knowledge/skills can promote place attachment [50]. In the influence of place attachment on the Byzantine mosaic heritage discourse in Jordan, the more a community knows about local heritage and culture, the more likely they are to develop place attachment, and the greater the possibility of heritage preservation and replication Loureiro and Sarmento [51]. Loureiro and Sarmento [51] pointed out that the level of knowledge in past experiences can moderate the relationship between place attachment and tourism participation, which suggests that the level of knowledge in past experiences may be related to place attachment or may not be related. Based on this, the following hypothesis is proposed: Many studies have shown that residents who have a sense of attachment to their living place are more likely to engage in pro-environmental behaviors. Wu, et al. [1] analyzed the data of 513 potential visitors to the Sanjiangyuan National Park and found that place attachment has a positive impact on self-regulatory behavior. Yang, et al. [52] based on the theory of place attachment, built a model in Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate which the results showed that the formation of place attachment has a significant positive impact on environmental responsibility behavior. Nasr, et al. [53] based on the stimulus-organism-response theory, conducted a study on 375 residents in Ghana as the research object, and the results showed that residents' community attachment is positively correlated with their ERB Nasr, et al. [53]. Zhang [54] built an intermediate model of EMB mediated by psychological ownership based on the attitude- behavior theory, place theory, and possession psychology theory, and constructed two dimensions of place attachment through psychological ownership. The results showed that the two dimensions of place identity and place dependence can have a positive direct impact on EMB. Winton [19] analyzed the data of 368 residents in coastal communities in the Mississippi Bay and found that residents who have a strong sense of attachment to their living place will show positive environmental responsibility behavior and support for sustainable development [19]. Based on this, the following hypothesis is proposed: In the study of environmental responsibility behavior influencing factors, place attachment as a powerful mediator is increasingly being paid attention to by scholars. Zhang [55] analyzed the 516 visitor samples at Beijing Olympic Forest Park and, through empirical analysis, verified that place attachment serves as a mediator between perceived value and ERB Zhang and Yang [56]. Cheng, et al. [57] conducted data analysis on visitors who visited six famous tourist attractions in Shaanxi, China, and proved that service quality as a perceived factor can strengthen environmental responsibility behavior through place attachment Cheng and Krijnen [58]. Xu, et al. [59] conducted empirical analysis on 498 valid questionnaires from visitors to a forest park, and the results showed that place attachment can affect the role of experiential value in environmental responsibility behavior. There are fewer studies on the mediating role of place attachment between perceived value and environmental responsibility behavior abroad, and based on the above literature review, this study hypothesizes that place attachment serves as a mediator between environmental knowledge and environmental responsibility behavior (H4): The situational factors refer to the external factors that have an impact on an individual's ERB [60]. In addition to demographic factors and psychological factors, Stern, et al. [61] have clearly indicated that situational factors have a significant impact on promoting or inhibiting an individual's ERB. Steg and Vlek [62] have pointed out through a literature review that situational factors can serve as a moderating variable between psychological factors and individual ERB. Place attachment falls within the domain of environmental psychology, and situational factors may affect the relationship between place attachment and environmental responsibility behavior, thus leading to Hypothesis H5.",
    "The theoretical framework for this study is based on the standard hierarchy of ABC attitude theory, which is divided into three levels: cognition, emotion, and behavior. The environmental knowledge is placed at the \"cognition\" level, the sense of place attachment is placed at the \"emotion\" level, and the environmental responsibility behavior is placed at the \"behavior\" level. Additionally, based on the stimulus-organism-response (S-O-R) theory of environmental psychology, the urban green space landscape environment and policies are considered as stimulating factors to regulate the relationship between place attachment and environmental responsibility behavior. Combining the above theoretical Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate hypotheses, this study constructs the structural relationship model of \"environmental knowledge → place attachment → environmental responsibility behavior,\" as shown in Figure 1. This paper aims to conduct an empirical analysis on the relationship model between environmental knowledge and environmental responsibility behavior, using a quantitative research method. In order to better handle the mutual relationships between multiple variables in different dimensions, this paper selects exploratory factor analysis and structural equation modeling as the main research methods. The specific steps are as follows: First, the variables are classified by literature search method and the measurement scales of demographic variables, environmental responsibility behavior, place attachment, environmental knowledge, and situational factors are constructed. Pre-survey questionnaires are used to collect data and a formal questionnaire is designed. Second, after collecting research data through formal surveys, the scales and basic characteristics of the sample are described and validated using descriptive statistical analysis and reliability tests using SPSS 24.0 software. Finally, the validity of the scales is verified using AMOS 24.0 software and the structural relationship model is verified through confirmatory factor analysis. The survey questionnaire in this study consists of five parts: social demographic information, environmental knowledge scale, place attachment scale, situational factors scale, and environmental responsibility behavior scale. All variables in the questionnaire use the Likert 5-point scale (1 = completely disagree, 5 = completely agree). The environmental knowledge scale is based on the work of [63-65] study; local attachment measurement reference Liu, et al. [44] study, environmental responsibility behavior references [5, 44] studies, situational factors refer to Dursun [63]; Carmi, et al. Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate [64] and Díaz-Siefer, et al. [65] conducted a study to develop an initial questionnaire and collected 164 valid questionnaires as a pre-survey. After examination, the KMO value was 0.857, which exceeded the standard requirement of 0.7, and the Bartlett's sphericity test's significance was 0.00 < 1%, indicating that factor analysis was appropriate. The validity test showed that all indicator item extraction values were greater than 0.6, and the factor loading was greater than 0.65, which met the standard. Environmental responsibility behavior was extracted through exploratory factor analysis using principal component analysis, and 2 common factors were extracted using Kaiser normalization maximum variance method after rotation, with a cumulative variance contribution rate of 61.141%. After adjusting and modifying the questionnaire based on the pre-survey results, the final questionnaire was formed. This study was conducted from June to July 2024, using the online survey platform Wenjuanxing to survey representative cities in Henan Province, including Zhengzhou, Luoyang, Nanyang, Shangqiu, Pingdingshan, Kaifeng, and Luohe. The main survey subjects were urban residents aged 18 and above who were permanent residents of the survey areas. A total of 700 questionnaires were distributed, and 558 were collected and sorted out, with a valid questionnaire recovery rate of 79.71%. A statistical analysis was conducted on the valid samples obtained, as shown in Table 1, which presents the frequency distribution of demographic characteristics of the survey respondents. It can be seen that the proportion of male respondents is higher than that of female respondents, at 60.6% and 39.4%, respectively. In terms of age distribution, the main respondent groups are those aged 31-40 and 20-30, accounting for 48.2% and 25.4%, respectively. The second largest group is those aged 41-50, accounting for 23.3%. The proportion of respondents aged 50 or above is the lowest, at just 3%. In terms of educational level, 39.6% of the respondents have a bachelor's degree, while the proportion of respondents with a master's degree or higher is the lowest, at 4.7%. In terms of income distribution, the income range of 2001-4000 yuan is the main group, accounting for 33.2%. The proportion of respondents with an income of 10,000 yuan or above is relatively low, at just 5%. In terms of occupation, full-time workers account for the dominant position, at 63.8%, while those who are self-employed account for only 7.5%.",
    "In summary, the 558 survey respondents in this study show significant differences in terms of gender, age, educational level, income, and occupation, providing diverse sample data for further research. Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate The effective samples were sorted out, and the descriptive statistical analysis of the data of each scale is shown in Table 2. From Table 2, it can be seen that the average of each item in the two dimensions of environmental knowledge is between 3.75 and 3.86, indicating that the respondents have a medium to high evaluation of their own environmental knowledge, with the average of subjective knowledge slightly higher, indicating that urban residents subjectively believe that they have enough environmental knowledge, but their actual objective knowledge is slightly insufficient; the average of the two dimensions of local attachment is 3.86-4, indicating that the residents' local attachment emotions are at a high level; the average of each item in the two dimensions of compliance-oriented environmental responsibility behavior is between 3.89 and 3.98, and the average of each item in the two dimensions of proactive environmental responsibility behavior is between 3.84 and 3.95, indicating that compared with proactive behavior, urban residents' compliance-oriented environmental responsibility behavior as a whole is at a higher level. Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate After collecting survey data through field questionnaires, the research data from 558 effective questionnaires were analyzed using SPSS24.0 and AMOS24.0 for reliability and validity tests, confirmatory factor analysis, model fit goodness-of-fit analysis, hypothesis testing, and mediation effect analysis. Based on the valid questionnaire data, the measurement model was tested for reliability using SPSS 24.0, as shown in Figure 2. The results are presented in Table 3, where the Cronbach's Alpha values for Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate the 8 latent variables of environmental knowledge, place attachment, situational factors, and environmental responsibility behavior range from 0.887 to 0.944; the overall scale's Cronbach's Alpha value is 0.961, above the 0.7 standard; and the KMO value is 0.955, and the Bartlett's test of sphericity's significance is 0.00 < 1%, indicating that the data is suitable for factor analysis. A confirmatory factor analysis was conducted using AMOS 24.0, as shown in Table 3, where the standardized factor loadings for each item in each latent variable are all greater than 0.65 and exceed the 0.5 requirement; the CR for each latent variable combination is all above 0.8 and meet the requirement of being above 0.7, indicating that the latent variables have good reliability; moreover, the AVE for each latent variable exceeds 0.6 and meet the requirement of being above 0.5, thus proving that the latent variables have good validity. Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate In AMOS 24.0, maximum likelihood method was used to estimate the parameters of the structural model. The overall fit analysis of the model showed that the relative chi-square value (χ²/df) was 1.867, the residual mean square error (RMR) was 0.039, the root mean square error of approximation (RMSEA) was 0.039, the fit index (CFI) was 0.973, all of which met the standard, indicating that the model fit well. In this study, the significance level of P < 0.05 was used as the criterion for hypothesis path analysis. Since environmental knowledge, local attachment, and environmental responsibility behavior are multidimensional latent variables, the corresponding hypotheses H1, H2, H3, and H4 were expanded accordingly. The results of the hypothesis testing are shown in Table 4. Among the sub-hypotheses of H1, H1b, the influence of subjective knowledge on compliance-oriented environmental behavior was not significant, while the other sub-hypotheses were statistically significant.",
    "Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate This study used the Bootstrap method in AMOS 24.0 software to test the mediating effect of place attachment on the relationship between environmental knowledge and pro-environmental behavior, with specific analysis results presented in Table 5. For the pathway \"LPV→PA→URERB,\" the indirect effect of landscape perception value on pro-environmental behavior was 0.237, which was not statistically significant after adjusting for the error term and at the 95% confidence level. For the sub-hypothesis extension verification of Hypothesis H4, the indirect effect values of the 8 paths, \"SK→PD→CEB,\" \"OK→PD→CEB,\" \"SK→PD→PEB,\" \"OK→PD→PEB,\" \"SK→PI→CEB,\" \"OK→PI→CEB,\" \"SK→PI→PEB,\" and \"OK→PI→PEB,\" were all between 0.090 and 0.260; indicating that the 95% confidence interval did not contain 0, and the indirect effect was significant, thus the various dimensions of place attachment played a partial mediating role between environmental knowledge and pro-environmental behavior. This was conducted using the PROCESS macro in SPSS 24.0 software [66] the results of which are presented in Table 6. The results of the moderated mediation analysis between place attachment and environmental responsibility behavior in the context of situational factors can be seen in Table 6. The interaction term between place attachment and situational factors was significant (p < 0.05), indicating that the influence of place attachment on environmental responsibility behavior varies significantly depending on the level of situational factors. Additionally, as shown in Figure 3, the slope at the high Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate level is much higher than that at the low level, indicating that when situational factors are at a high level, place attachment has a stronger influence on environmental responsibility behavior, which also confirms the significant positive moderated mediation effect. Given that place attachment, situational factors, and environmental responsibility behaviors are all multidimensional variables, this study extends verification of Hypothesis 5 based on them. In this study, Y represents the dependent variable, X represents the independent variable, and W represents the moderating variable. According to the data shown in Table 7-14, the interaction terms of Tables 7, 8, 9, 10, and 13 are not significant (p>0.05), indicating that the effects of place attachment and place identification in influencing compliance environmental behavior and proactive environmental behavior are not significant at different levels of environmental quality, and the moderating effects of environmental quality are not significant. At the same time, the moderating effects of environmental policy on place identification and compliance environmental behavior are not significant. Other expanded sub-hypotheses of H5 indicate that the moderating effects of environmental policy and environmental quality are significant. Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate The conclusion of this paper confirms and supports the theoretical framework and hypotheses presented in this paper, which provides some reference value for analyzing urban residents' environmental knowledge and promoting responsible environmental behavior. Urban green spaces exist in the form of parks, squares, street green spaces, and small parks in cities, and are closely related to the well-being of urban residents. Therefore, studying urban residents' environmental responsibility behavior has positive practical significance for achieving the development and construction of urban green spaces. When studying the environmental responsibility behavior of urban residents, both rational factors and emotional factors should be taken into consideration. This paper builds on previous studies to explore the perceptual dimensions of green spaces and incorporates emotional factors from the perspective of place attachment. It delves into the influence and mechanism of environmental knowledge and place attachment on environmental responsibility behavior, showing that the influence strength of different dimensions of environmental knowledge on environmental responsibility behavior is different to some extent, which to some extent fills the shortcomings of previous studies [67, 68] in exploring the dimensions of environmental knowledge. Meanwhile, individuals often find connections with places through cognitive forms, which further promote environmental responsibility behavior [69]. Therefore, this paper introduces the emotional feedback mechanism of place attachment to better explore the influence of environmental knowledge on urban residents' emotional responses and thus promote their environmental responsibility behavior in green spaces.",
    "The empirical results of this study show that the overall standard path coefficient of environmental knowledge to environmental responsibility behavior is 0.320, with a p-value less than 0.05, proving that the former has a positive and positive influence on the latter. Through hypothesis expansion research, the impact of subjective knowledge on compliance-based environmental responsibility behavior is not Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate significant, indicating that residents' self-assessed environmental knowledge cannot promote the occurrence of environmental compliance behavior. This may be because urban residents believe they have environmental knowledge, but in reality, they cannot guide themselves to take environmental protection actions. Hypothesis 1 and other sub-hypotheses have a significant impact on both dimensions of environmental responsibility behavior. Previous studies by Kim and Stepchenkova [43] showed that groups with higher levels of environmental knowledge are more likely to engage in environmental responsibility behavior. In the path of PA<---EK, environmental knowledge generally exhibits a positive and positive impact on place attachment, which indicates that the environmental knowledge that residents possess can enhance their emotional attachment to green spaces. The more an individual knows about the environment, the more likely they are to exhibit positive environmental responsibility behavior. Previous studies have also provided empirical support for this conclusion [70]. When analyzing the mediating effects of place attachment, all dimensions had a mediating effect on the perception of landscape value and influenced residents' compliance and proactive environmental behaviors to varying degrees. Related studies have also confirmed this conclusion [55, 59]. In summary, the results of this study provide some reference for the sustainable development of urban green spaces and landscape design planning. Firstly, the research data in the text is relatively limited in type, mainly longitudinal data. Later studies can use a combination of longitudinal and cross-sectional data to enhance the reliability and credibility of the research results. Secondly, when analyzing the impact of environmental knowledge on environmental responsibility behavior, individual differences were not included in the study scope. Continuous variables were used, while no categorical variables were employed. Although the study provided demographic information, it showed certain differences, but no comparative analysis was conducted on different genders, ages, occupations, educational levels, and monthly incomes, and the generalizability of the conclusions in different fields needs further verification. Furthermore, the participants in this study were urban residents, and rural residents were not included. The representativeness of the population in the exploration of the influencing factors of environmental responsibility behavior needs further verification. Future studies can include rural residents, and by comparing different population structures, a more comprehensive exploration of the influencing mechanisms of environmental responsibility behavior can be conducted. This paper takes urban residents in Henan Province as the research object, based on the ABC attitude theory and the stimulus-organism-response (S-O-R) theory, constructs an integrated framework of the influencing mechanism of urban residents' environmental responsibility behavior from the perspective of place attachment. The empirical analysis results provide certain theoretical references for the green space construction and management. (1) Environmental knowledge can be divided into subjective knowledge and objective knowledge, of which objective knowledge has a negligible impact on compliance-based environmental behavior, but has an impact of 0.127 on proactive environmental behavior, indicating that the higher level of objective knowledge is more likely to lead to proactive environmental protection actions. Subjective knowledge has an impact of 0.149 and 0.258 on the two dimensions of environmental responsibility behavior, showing that subjective knowledge plays a significant role in promoting proactive environmental behavior. This conclusion may suggest that although urban residents believe they have relevant environmental knowledge, their lack of understanding of policies, terminology, and management may actually hinder the development of their environmental responsibility behavior. Therefore, when Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 3: 1252-1273, 2025 DOI: 10.55214/25768484.v9i3.5480 © 2025 by the authors; licensee Learning Gate promoting environmental awareness, it is important to ensure that the content is easy to understand so that it can be better promoted to the public. In the future, green space development should place emphasis on the cultivation of subjective knowledge to meet the needs of sustainable development. (2)The study found that environmental knowledge had a significant positive impact on place attachment, with both subjective and objective dimensions significantly influencing place dependence and place identification. Specifically, the subjective knowledge dimension had an impact of 0.308 on place dependence and 0.318 on place identification, indicating that subjective knowledge can significantly enhance residents' emotional connections to places. The objective knowledge dimension, on the other hand, had an impact of 0.247 and 0.224 on place dependence and place identification, respectively. When compared comprehensively, subjective knowledge appears to be more advantageous in forming place attachment than objective knowledge.",
    "(3) Compared with environmental knowledge, place attachment plays a more positive and significant role in driving urban residents to form environmental responsibility behaviors. The results show that place dependence has a greater promoting effect on urban residents' environmental responsibility behaviors than place identification, while the situational factors play a moderating role between the two. Therefore, in order to effectively stimulate urban residents to participate in environmental protection activities, not only should the scenic viewpoint system be accelerated, but also the importance of local emotions should be fully considered and utilized through its mediating effect to enhance the human-land relationship. Meanwhile, attention should be paid to the quality of green spaces and related management regulations, starting from the three levels of environmental cognition, emotions, and situations to strengthen citizens' environmental responsibility awareness. The authors confirm that the manuscript is an honest, accurate, and transparent account of the study; that no vital features of the study have been omitted; and that any discrepancies from the study as planned have been explained. This study followed all ethical practices during writing. © 2025 by the authors. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https://creativecommons.org/licenses/by/4.0/)."
]