[
    "How to cite this paper: Zhang, B., & Phromphitakkul, W. (2021). Impact of Intel- lectual Capital on Work Performance of Uni- versity Teachers: The Intermediary Role of Intra Organization Trust. Journal of Hu- man Resource and Sustainability Studies, 9, 355-368. Copyright © 2021 by author(s) and Scientific Research Publishing Inc. This work is licensed under the Creative Commons Attribution International License (CC BY 4.0). http://creativecommons.org/licenses/by/4.0/ Open Access Intellectual capital (INC) is an important source for organizations to create value and gain sustainable competitive advantage. Intra organization trust (IOT) can maintain a good atmosphere within the organization, and ensure the harmony of work relationships. From the perspective of university man- agement, how to efficiently allocate resources such as intellectual capital and intra organization trust is an important topic for university management in the era of knowledge economy. This paper uses a combination of quantitative and qualitative research methods, taking universities in Henan Province as an example, and finds that intellectual capital has a significant positive impact on the intra organization trust and the work performance of university teachers (WPT); intra organization trust has a significant positive impact on the performance of university teachers; when intellectual capital affects the work performance of university teachers, intra organization trust plays an in- The theory of intellectual capital (INC) originated from the study of economic value in educational theory (Schultz, 1961). In the era of knowledge economy, INC is intellectual materials such as knowledge, experience and information that can be used to create wealth, and it is the driving force of organizational devel- opment. Trust is a kind of social capital that can gather capital to develop the economy (Fukuyama, 2001). Intra organization trust (IOT) conforms to the emotional needs of people proposed in the Maslow’s hierarchical theory of needs (Liu, 2017). It can increase interpersonal communication, reduce transaction costs, and improve the economic efficiency of the enterprise and the entire society (Ai, Education is the fundamental way to improve the quality of the people and promote the overall development of people. Higher education undertakes the major tasks of cultivating senior specialized talents, developing science, tech- nology and culture, and promoting socialist modernization. In the overall com- petitiveness ranking of China’s undergraduate universities in 2020, in Henan Province, only Zhengzhou University and Henan University ranked within the top 100. The fact that the comprehensive strength of the universities in the province is not strong cannot be ignored. In order to meet the needs of students, pursue excellent teaching quality and enhance the competitiveness of higher education in Henan Province, we should attach importance to work performance of university teachers (WPT), and en- hance the comprehensive competition level of universities. Taking universities in Henan province as an example, this paper studies the influence of INC on WPT by taking IOT as an intermediary variable, so as to explore ways to improve WPT in Henan Province. 1) INC has significant a positive and direct influence on WPT. 2) INC has significant a positive and direct influence on IOT. 3) IOT has significant a positive and direct influence on WPT. For the study of the connotation of INC, scholars mainly define it from three perspectives: 1) INC is an intangible asset (Itami & Roehl, 1991; Khalique et al., 2015). 2) INC is the sum of knowledge, skills and experience (Chen & Lin, 2001; Liu et al., 2018). 3) INC creates higher value through competition and innova- tion (Klein & Prusak, 1994; Ji, 2019). The connotation of university INC is obviously different from that of corpo- rate INC: 1) The connection between universities and the outside world is a non-profit social relationship; 2) University INC covers a wide range of con- tents, including scientific research achievements, intellectual property rights and new knowledge formed by the continuous integration of knowledge caused by the intersections of different disciplines (Wu & Li, 2007). Therefore, this paper believes that the university INC is the rich educational resources, cultural concepts and scientific research achievements owned by uni- versities, and it is an intangible resource that can create value for them, which will help universities to realize the three major functions, the cultivation of tal- ents, development of science and technology, and service to society, and bring sustainable competitive advantages (Zhang, 2009; Hu, 2018).",
    "In the research on the formation of university INC, the three-dimension is recognized and widely used by most scholars, which is composed of human cap- ital, structural capital, and relational capital (Zhang, 2009; Quan, 2018). These three elements essentially explain the essential characteristics of university INC. Therefore, this paper chooses to study the relationship between INC and univer- sity teachers’ performance from these three dimensions. In university INC, human capital is the core, including teachers’ health, know- ledge, technology, attitudes and abilities. It is the main reason for the perfor- mance of universities and plays a leading role in the process of value creation (Xu et al., 2010); structural capital is the platform foundation for achieving uni- versity performance, including management methods, system culture, facility construction and discipline construction, and creates conditions for human cap- ital to play a role (Quan, 2018); relational capital is the key for universities to obtain social value, including academic reputation, social popularity, and the re- lationship between stakeholders (Wang, 2006). Scholars have put forward different views on the connotation of IOT from dif- ferent angles: 1) Essential perspective. IOT is a firm belief and a willingness to carry risks. The organization or internal individuals must be honest, reliable, and have common goals and beliefs (Cummings & Bromiley, 1996; Peng, 1999). 2) Behavioral perspective. IOT is the trust that members trust in each other, the leadership, and the or- ganization as a whole through interaction (Nyhan & Marlowe, 1997; Liu, 2017). 3) Angle of action. IOT can motivate staff to improve work attitude, improve work performance and promote organizational development (Bryk & Schneider, 2002; Cui, 2014). Therefore, this paper believes that IOT refers to the firm belief of organization members not to obtain additional benefits, which is manifested in the depen- dence of employees on the organization, leadership and colleagues, and contri- butes to the improvement of work efficiency, the development of the organiza- tion and the advancement of the reform (Cummings & Bromiley, 1996; Bryk & Schneider, 2002). Currently, due to different research fields, scholars have different dimensions of IOT. But what most scholars recognize is the three-dimensional division me- thod of organization (university, enterprise) trust, boss (leadership, supervisor) trust, and colleague trust (Kuang & Ling, 2009; Ge, 2015). Therefore, this paper conducts research on this subject from the three dimensions of university trust, leadership trust and colleague trust. Summarizing the previous researches on the dimensions of IOT and combin- ing the characteristics of universities, this paper holds that the concepts of the three dimensions of IOT are: university trust is the overall trust of teachers in some regulations and policies formulated by universities regarding teachers; leadership trust means that teachers believe in the ability of leaders, that they can make correct decisions and other good qualities; colleague trust means that teachers are willing to believe that colleagues will sincerely help them solve their work problems and overcome work difficulties together (Ge, 2015). This paper conducts research on teachers’ personal work performance, and summarizes previous studies on work performance concepts from three pers- pectives: 1) The final result of the work. Work performance is the completion of work functions and other labor or work behaviors specified in the job descrip- tion, emphasizing the number of work and the value and quality of work con- tributions (Bernardin & Beatty, 1984; Yang et al., 2000). 2) A kind of behavior. Work performance is the sum of quantifiable behaviors shown by an individual when achieving goals. It attaches importance to the process by which employees complete the work, rather than the result (Bates & Holton III, 1995; Hou et al., 2014). 3) Comprehensive manifestation of results and behavior. Work perfor- mance is the unity of work behavior, process, and results. It is a complex of be- haviors and results closely related to organizational strategic goals (Borman & Based on the viewpoints of the above scholars, combined with the three major functions of universities, this article believes that WPT refers to the quality and quantity of the individual’s completion of teaching, scientific research, service to the society and other related work, as well as the behavioral performance that is beneficial to the development of the school (Liao et al., 2016; Ma et al., 2017).",
    "As for the division of the dimensions of work performance, scholars divided work performance of different occupations into task performance and relation- ship performance (Wu et al., 2006; Li, 2019). In today’s new era of deepening reforms in higher education, for universities to develop, they must have break- throughs and innovations. Therefore, innovation has become a driving force for the sustainable development of universities. In order to satisfy the three major func- tions of universities, this paper divides the performance of university teachers into task performance, relationship performance and innovation performance. In universities, teachers’ task performance is the result or behavior that teach- ers make contributions to the university by using their knowledge and technol- ogy to complete teaching and scientific research tasks and responsibilities, in- cluding job responsibilities, teaching quality and scientific research achieve- ments (Liao et al., 2016; Wu et al., 2006). Teachers’ relationship performance re- fers to the behavior and process in which teachers indirectly contribute to the university or society through their support for psychological, university and so- cial background, which is mainly manifested in individual self-discipline, teach- er-student interaction and teamwork (Ma et al., 2017). Teachers’ innovation performance refers to the behaviors that teachers care about the development of their subject, engage in scientific research and guide students to innovate (Ma et al., 2017). This research focuses on quantitative analysis, supplemented by qualitative analy- sis. The researcher collects qualitative data using focus-groups from 24 teachers who are currently teaching at universities in Henan Province, and divides the participants into three groups of 8 each. The subject of quantitative research is limited to full-time teachers in universities in Henan Province. According to sta- tistics released by the Ministry of Education of the People’s Republic of China in 2020, there are 124,547 full-time teachers in universities in Henan Province. According to Yamane’s calculation of the sample size, this article randomly se- lected 400 full-time teachers from them for investigation. In order that the selection of sample units is not affected by the subjective factors of the investigator and other systemic factors, the influence of people’s subjective consciousness is completely excluded, so that each unit in the popula- tion has the same chance of being selected. The selection is pure It was acciden- tal. The principle of randomness is the basic principle that must be followed in random sampling. In this statistical sampling survey, the random principle is strictly adhered to. The semi-structured interview outline and questionnaire in this research are designed on the basis of literature and scholars’ practice. Therefore, the scienti- ficity, feasibility, and objectivity of the research method are ensured, which is an important theoretical basis for the study of this article. Through the open coding of the interview records of 24 full-time university teachers, and the core items related to INC, IOT and WPT were obtained by thematic analysis method. Combined with the previous researches on these three measurement indicators, this paper selects the empirical indicators of different scholars and practitioners, and finally determines the evaluation scale suitable for this research according to the characteristics of the university itself. As mentioned before, the semi-structured interview outline and questionnaire in this research are designed on the basis of literature and scholars’ practice. Therefore, the scientificity, feasibility, and objectivity of the research method are ensured, which is an important theoretical basis for the study of this article. This study uses the Cronbach Alpha coefficient method to analyze the reliability of the collected sample data. From Table 1, it can be known that the Cronbach α value of all research variables reached more than 0.8, indicating that the mea- surement data has a high degree of reliability, and the measurement results are more consistent and stable. In order to ensure the validity of the questionnaire design, five experts were selected to evaluate the content design of the questionnaire. Through item objec- tive congruence, the IOC was calculated to be greater than 0.7 (Table 2). T-test analyzed the difference of gender, and the default significance level of the difference test is 0.05. The results are shown in the following Table 3: gender of the sample has no significant difference in IOT (P > 0.05), but has significant difference in INC (P = 0.001 < 0.05) and WPT (P = 0.009 < 0.05).",
    "In addition, one-way ANOVA was used to analyze whether age, education level, job position level, and work experience had significant differences in va- riables such as INC, IOT and WPT. From Table 4, age of the sample has significant differences in INC (P = 0.000 < 0.05), IOT (P = 0.002 < 0.05), and WPT (P = 0.016 < 0.05). From Table 5, education level of the sample has no significant difference in WPT (P = 0.534 > 0.05), but has significant differences in INC (P = 0.000 < 0.05), and IOT (P = 0.008 < 0.05). From Table 6, job position level of the sample has no significant differences in INC, IOT and WPT (P > 0.05). From Table 7, work experience of the sample are significant differences in INC (P = 0.000 < 0.05), IOT (P = 0.001 < 0.05), and WPT (P = 0.010 < 0.05). Through the test results can be known, gender, age, education level, job posi- tion level, and work experience of research variables all have some or all signifi- cant differences on the study variables. In the subsequent regression analysis of this paper, they are used as control variables to exclude the influence of non-study variables. Correlation analysis preliminarily predicts whether the relationship between va- riables is consistent with the hypotheses of this study, and Pearson correlation coefficient represents the strength of the correlation. A specific analysis of the data in Table 8 shows that there is a positive correla- tion between INC and WPT (r = 0.463, p < 0.01), which provides preliminary evidence for H1; there is a positive correlation between INC and IOT (r = 0.769, p < 0.01), which provides preliminary evidence for H2; there is a positive correla- tion between IOT and WPT (r = 0.621, p < 0.01), which is H3 provided prelimi- nary evidence. In this paper, the multivariate linear regression analysis method is used to ana- lyze the causal relationship between variables and verify the relevant hypotheses. F value show significance (p < 0.05), which means that INC has an explanatory meaning for the model. The regression coefficient of INC is 0.393 and shows a significant (t = 10.416, p = 0.000 < 0.01), which means that INC has a significant positive impact on WPT. Therefore, H1 is established. From Table 10, Model 1 - 4 adds INC on the basis of Model 1 - 3, the change of F value show significance (p < 0.05), which means that INC has an explanato- ry meaning for the model. The regression coefficient of INC is 0.749 and shows a significant (t = 23.346, p = 0.000 < 0.01), which means that INC has a significant positive impact on IOT. Therefore, H2 is established. From Table 11, Model 1 - 6 adds IOT on the basis of Model 1 - 5, the change of F value show significance (p < 0.05), which means that IOT has an explanato- ry meaning for the model. The regression coefficient of IOT is 0.535 and shows a significant (t = 15.775, p = 0.000 < 0.01), which means that IOT has a significant positive impact on WPT. Therefore, H3 is established. As can be seen from the above table, INC has a significant impact on IOT and WPT, which meets the conditions for implementing intermediary analysis. There are three models involved in testing the mediating effect of IOT, specifi- cally as follows: 1) Test the regression of INC to IOT (Model 1); 2) Test the re- gression of INC to WPT (Model 2); 3) Firstly, take INC as the independent va- riable, and WPT as the dependent variable for regression, and then take INC and IOT as the independent variables, and WPT as the dependent variable for re- gression (Model 3), and obtain the test result of mediating role. The test results of the mediating effect model of IOT (Table 12), INC (inde- pendent variable), IOT (intermediary variable) and WPT (dependent variable) all have significant effects. The addition of IOT (intermediary variable) makes INC (independent variable) have no effect on WPT (dependent variable) (p = 0.710 > 0.05), indicating the mediating role of IOT between INC and WPT. In addition, this thesis also uses Bootstrap sampling test method to conduct an intermediary role study with a sampling number of 5000, as shown in Table 13, in terms of the influence of INC on WPT, the intermediary role of IOT is tested, and the 95% interval does not include the number 0 (95%CI: 0.324 - 0.500), which indicates that IOT has an mediating role on INC and WPT. INC will first have an impact on IOT, and then affect WPT through IOT. Therefore, H4 is es- tablished.",
    "Through the empirical analysis of the sample data, the research hypotheses pro- posed in this paper have been verified. The specific results are shown in Table 14. Remarks: BootLLCI refers to the lower 95% interval of Bootstrap sampling, BootULCI refers to the upper 95% interval of Bootstrap sampling. This paper collects data from 400 full-time teachers from universities in Henan Province as the survey subjects. After excluding the influence of control va- riables such as gender, age, education level, job position level, and work expe- rience, the following conclusions are drawn: INC can significantly positively af- fect IOT and WPT; IOT can significantly and positively affect WPT; IOT has an intermediary effect between INC and WPT. This conclusion means that im- proving the level of university INC would help to enhance IOT and WPT, and the higher IOT, the more helpful it is to improve WPT. 1) The research on independent variables and intermediate variables has cer- tain limitations. Future research can further explore the influence of other orga- nizational characteristics of universities (such as organizational structure, etc.) on the formation of teacher performance. As the availability of data increases, research can be further deepened in the future to make the use of intermediate variables more reasonable, scientific, and comprehensive. 2) Chinese universities can be divided into different types according to the school-running system, scientific research scale, subject type, etc. This paper does not divide the universities into research by type. Therefore, future research can conduct targeted research on different types of universities, which makes the research results more applicable and operable. By categorizing different types of universities, the research will be more refined, the research conclusions will be more convincing, and the theoretical value and practical significance of the re- search will be improved."
]