[
    "Abstract: Cultural digitization is not only an important innovative form of building a strong cultural country, but also an important part of building a digital China, and an important tool to promote the construction of cultural tourism by local governments.Taking the construction of local government cultural tourism in Henan Province as an example, this paper puts forward relevant suggestions based on the current de- velopment status of cultural digital cultural tourism and combined with the existing problems. In the process of cultural tourism construction, Henan Provincial government emphasized the need to make full use of modern digital technology, build a cultural digital cultural tourism industry system combined with characteristic cultural symbols, and promote the digital transformation of cultural tourism industry and the deep integration of industrial chain. As a product created by new media and Internet technology, short video has distinct characteristics: the personalization of communica- tion subjects, the specialization of video symbols, and the coordination of creation and operation. [1]As a medium connecting the deep integra- tion of culture and tourism, short video plays a unique role of \"relational embedding\" in the construction of cultural tourism. [2]The construc- tion of cultural tourism brand mainly uses three publicity methods: First, through traditional festivals to promote cultural tourism.The festival wonderful tour series of short videos released by Henan Satellite TV builds the cultural image of Shang Dynasty in Yin Ruins of Anyang, shows the image of Luoyang, the divine capital of the prosperous Tang Dynasty, and so on, creating a unique historical IP.The second is to promote cultural tourism by holding cultural tourism activities. Through the launch of Luoyang Peony flower fair, Kaifeng Chrysanthemum Culture Festival and other local characteristics of cultural tourism activities to create urban characteristics of memory points. The third is to promote cultural tourism through publicity ambassadors and civil spokespersons. Through the complementarity of \"familiarity\" and \"trust\" brought by the star effect and civil spokespersons, [3] the public's sense of identity of the Central Plains culture is aroused, and the harmonious relationship between people and land is extended to interpersonal relations, thus creating a credible image of the tourist destination. [4] With the development of AI, AR and VR technologies, the construction of virtual scenes has made the construction of cultural tourism industry more immersive. Through digital technology, culture presents a \"menu-like\" service, providing more diversified and personalized choices while integrating the needs of the public. [5] Large-scale virtual scene immersive performance projects such as \"Supreme Dragon Gate\", \"Tang Palace Night Banquet\" and \"Finding the Goddess of Luo\" present local historical and cultural characteristics through digital technologies such as 5D technology and XD technology. The virtual exhibition halls and digital games in Henan Museum and Yin Ruins Mu- seum combine cultural heritage with digitalization, and carry out high-precision digital restoration of precious cultural relics. Digital technolo- gy is an important tool for the construction of immersive scenes in the field of cultural tourism. The field scenes such as \"Only Henan · Drama Fantasy City\", Qingming Shanghe Garden, Cao Wei Ancient City, etc. are mainly represented, and the deep historical and cultural heritage of Henan Cultural tourism is effectively disseminated and fully displayed in combination with historical and cultural IP. Henan Cultural Tourism has become popular through the form of cultural digitalization, which is due to the fact that Henan has rich his- torical and cultural resources and natural resources, but the general digital cultural resources are scattered and scattered and lack of database integration. [6] The coordination mechanism of transportation, accommodation, catering, cultural and creative products and other industries related to cultural tourism is not perfect, the incoherent industrial chain cannot bring high efficiency, and the conflict with the limited time of tourists will reduce the sense of experience of tourists, and then cause disputes, bring negative effects to the construction of local cultural tourism, and may lead to the stigma of the originally established brand image. Tourists have negative stereotypes and confused thinking and cognition. Henan Cultural Tourism opens a new model of cultural tourism construction in the form of mass production of short videos, but a large number of data and algorithms will cause information homogenization, thus causing aesthetic fatigue and reducing tourists' demand. The same digital model cannot meet the differentiated needs, which inhibits the decision-making of tourists. [7] The short and concise fea- tures of short videos have limitations on the publicity of cultural tourism, and the rich cultural deposits in local cultural tourism cannot be fully presented in this way. At the same time, the level of digital technology also affects the understanding and judgment of the recipient, resulting in one-sided understanding and deviation from its publicity effect. Therefore, the digital cultural travel model is not static and needs to be innovated.",
    "In the process of digital cultural tourism service construction, the smart city system built by prefecture-level cities in Henan Province is relatively independent and has not formed a sufficient linkage network, resulting in the phenomenon of insufficient supply of digital cul- tural tourism services. Due to economic, geographical and other reasons, the digitization degree of popular cultural tourism cities such as Zhengzhou, Luoyang and Kaifeng is much higher than other cities, resulting in the overall average digital cultural tourism service supply level of Henan Province is not high. For rural areas with relatively distant geographical locations, the construction of digital facilities is weak, and the degree of digitization of service supply of cultural tourism industry is not high. [8] Cultural digitization is deeply integrated with the main tourism industry, and the mobile client is the main carrier to provide advance information output for the process of cultural tourism activities. Through data screening, the target tourist groups can be diversified and per- sonalized output, thus affecting the group decision-making. Cultural digitalization is deeply integrated with the catering and accommodation industry and transportation, and digital technologies such as artificial intelligence and the Internet of Things provide high-precision material guarantee for the process of cultural tourism activities, and provide convenient and fast digital cultural tourism services for tourists. Cultural digitalization is deeply integrated with the characteristic product industry, providing post-cultural communication for the process of cultural tourism activities with chip and image technology, and promoting the digital archiving and communication of culture. The integration of cultural digitalization and cultural tourism industry has a clear division of labor and deep integration, and the entire industrial chain is not a separate individual, and it is necessary to work together in a tacit understanding while performing their roles to promote the benign operation of the entire cultural tourism activities. After repeated modification, static short video content presents overall characteristics, while dynamic live streaming is highly fluid and suitable for describing specific details. The combination of the two forms a complete digital literature travel model combining static and dy- namic. Short and concise static short video, overall planning of cultural tourism construction, the function is to create a regional cultural tour- ism brand IP, efficient output of regional cultural tourism characteristics. Dynamic network broadcast can improve the overlap rate of intended tourists' thinking cognition and sensory objects, and seeing is believing to reduce concerns about the authenticity of publicity. To build a supply chain of digital cultural travel services, we must first increase capital investment in digital technology, ensure the per- fection of digital infrastructure construction, and provide solid material guarantee for the supply of digital cultural travel services. Secondly, give play to the radiating role of central cities, lean more high-quality cultural resources to areas with weak cultural resources, and promote urban-rural integration. [9] Finally, build a comprehensive talent team with digital transformation ability. For the on-the-job training of the cultural tourism department, increase the digitalization ability training, carry out a series of cultural digitalization activities in depth, improve the digital ability and professional level of the staff of the cultural tourism department, effectively use digital technology to publicize Henan Cultural tourism, and promote the development of digital cultural tourism industry. The digital integration of local government culture and tourism is an important component of national cultural digitization and deep inte- gration of culture and tourism, playing a key role in the construction of China’s digital society. The deep integration of local government’s cul- tural and tourism digitalization requires deep cooperation between local governments and multiple parties to build innovative digital cultural and tourism models, promote the integration of digital cultural and tourism industry chains, build a digital cultural and tourism service supply chain, jointly promote the digital integration of cultural and tourism, and jointly build a digital society."
]