[
    "How to cite this paper: Liu, S. J., Omar, M. K., & Puad, M. H. M. (2024). Exploring the Impact of Emotional Intelligence on Uni- versity Academics’ Job Performance. Open Journal of Social Sciences, 12, 14-31. https://doi.org/10.4236/jss.2024.1210002 Copyright © 2024 by author(s) and Scientific Research Publishing Inc. This work is licensed under the Creative Commons Attribution International License (CC BY 4.0). http://creativecommons.org/licenses/by/4.0/ Open Access Thriving in a challenging educational environment requires leaders to go be- yond traditional leadership roles. Leaders should possess a strong mindset and the ability to control their emotions, which ultimately improves organizational job performance. Although emotional intelligence is recognized as a critical factor impacting job performance across various industries, its specific impact on the higher education sector is considerably less attentive. This study used a quantitative survey approach to examine the emotional intelligence of univer- sity academics and its effects on their work performance. The survey included 293 respondents from five universities in Henan Province, China. The results showed a significant positive correlation between emotional intelligence and job performance. Research indicates that higher levels of emotional intelli- gence—including self-awareness, emotion regulation, motivation, empathy, and social skills—are associated with better job performance. This relationship is moderated by personal characteristics, organizational support, and cultural context. These findings highlight the importance of incorporating emotional intelligence into educational leadership and continuous professional develop- ment (CPD) and induction training programs for academics, not only to facil- itate teaching and learning processes but also to enhance the overall educa- tional ecosystem. Global discourse on education increasingly recognizes the critical role of emo- tional intelligence in improving academic performance and educational outcomes (Mohamad & Jais, 2016). For instance, in Malaysia, the Strategic Plan for Higher Education emphasizes the transformative role of academics in addressing con- temporary educational challenges, facilitated by emotional intelligence (Chong et al., 2020). Nguyen et al. (2019) further supports this argument by associating emo- tional intelligence in educational settings to improved job performance and or- ganizational communication (Nguyen et al., 2019). However, research within the framework of China, particularly in higher education, is scant. A search on the Chinese National Knowledge Network (CNKI) revealed minimal attention to the emotional intelligence of university academics, with existing research focused pri- marily on nursing educators and the non-educational sector. Empirical studies have demonstrated a significant correlation between emo- tional intelligence dimensions and improved job performance. Effective self- awareness enables professionalism and calmness in the face of stress or challenges, leading to improved work performance (Rechberg, 2020). Self-regulation helps individuals maintain a positive disposition in a condition of criticism or frustra- tion, facilitating problem-solving and conflict resolution (Sarani et al., 2020). In- dividuals with high levels of intrinsic motivation are more likely to succeed in their long-term professional goals (Mukokoma, 2020). Social skills, including ef- fective communication, teamwork, and leadership, are also key to workplace suc- cess (Kusché et al., 2020). Finally, empathy—understanding issues from others’ perspectives—is particularly important for developing relationships and team management (Giménez-Espert et al., 2020). The application of emotional intelligence and its effects in the specific context of the Chinese university environment, especially in a culturally and historically rich province like Henan, requires further research. The study attempts to fill this gap by combining global research findings with the unique dynamics of higher education in China. Considering the large student population and enthusiasm for education in Henan Province, this study offers a unique perspective that contrib- utes to regional educational development and a broader understanding of emo- tional intelligence among Chinese academic stakeholders. Firstly, there is a lack of consensus in the academic community regarding the def- inition and measurement of emotional intelligence. Some researchers emphasize the intrinsic aspect of emotional regulation, while others focus on extrinsic social interaction skills. Additionally, there is ongoing debate about the long-term effects and sustainability of emotional intelligence training. Some studies suggest that such training can have a lasting positive impact on teachers’ career development (Valente, 2019). However, others argue that these effects may be short-lived or limited due to the dynamic nature of social interactions and the fluidity of emo- tional intelligence (Kovalchuk et al., 2022). enhancing teachers’ classroom management skills, student engagement, and teaching effectiveness (Alam & Ahmad, 2018; Taseer, 2020). Nevertheless, this re- lationship varies across different educational settings and cultures, highlighting the need for more cross-cultural research to deepen our understanding and in- form the ongoing discussion.",
    "As higher education increasingly shapes the future of society, the role of uni- versity academics has become more critical. While previous studies have exten- sively explored the effects of emotional intelligence across various industries, its specific impact on higher education remains largely overlooked (Halimi et al., 2021). For example, Tănăsescu and Leon (2019) examined the impact of emo- tional intelligence on the Romanian banking system. Clearly, these studies focused on different sectors and objectives, highlighting the diverse applications of emo- tional intelligence across various fields. Moreover, while García-Martínez et al. (2021) claimed that emotional intelli- gence influences teacher performance in his study of secondary school teachers, he did not extend his research to an in-depth analysis of this relationship in higher education. This gap in the literature highlights the need for further investigation into how emotional intelligence affects the job performance of university academ- ics. Understanding this relationship is crucial for developing strategies that en- hance educator effectiveness and, consequently, the overall quality of higher edu- cation. A growing body of research suggests that enhancing the emotional intelligence of educators can be a strategic approach to improving the quality of education (Pérez-González & Qualter, 2018). This study highlights the need for targeted emotional intelligence training programs aimed at enhancing teachers’ interper- sonal and emotional skills as part of their professional development. Research focusing on higher education teachers in Henan Province increasingly acknowledges the critical role of emotional intelligence in shaping educational outcomes. Studies conducted in the region have demonstrated significant corre- lations between emotional intelligence attributes such as self-awareness, empathy, and interpersonal skills, and educator performance (Chen & Guo, 2020). These attributes significantly impact classroom management, student engagement, and overall teaching effectiveness. In Henan, where the educational landscape is vast and diverse, the application of emotional intelligence by academics has a clear impact on their ability to man- age varied classroom dynamics and respond effectively to educational challenges. For instance, Zhang et al.’s (2023) study highlights that teachers with high levels of emotional intelligence are better equipped to handle stress and conflict, thereby enhancing their performance. This connection suggests that emotional intelli- gence is crucial not only for improving individual teachers’ performance but also for fostering a more positive learning environment (Dolev & Leshem, 2017). The concept of emotional intelligence is based on the model proposed by Mayer and Salovey, which defines it as the ability to identify, understand, regulate, and utilize one’s own emotions as well as those of others (Opengart, 2005). It consists of four components: recognizing emotions, using emotions to facilitate thinking, understanding emotions, and managing emotions (Rosete & Ciarrochi, 2005). This model is particularly relevant to educational settings, where emotional intel- ligence is crucial for academics to effectively manage classroom dynamics and promote student engagement. In this context, job performance is defined as the effectiveness with which higher education teachers fulfil their teaching, research, and administrative duties (Iqbal et al., 2017). This study considers job performance to encompass aspects such as instructional effectiveness, student engagement, research output, and con- tributions to administrative tasks. Performance assessments will be based on a combination of self-evaluations, peer reviews, and student feedback, providing a comprehensive view of each teacher’s professional effectiveness. The relationship between emotional intelligence and job performance is criti- cal, and it is predicted that higher emotional intelligence can enhance job perfor- mance across various dimensions. The goal of this study is to explore this rela- tionship within the unique cultural and institutional context of the higher educa- tion system in Henan Province, addressing a gap in the existing literature that often overlooks this geographic region. This study aims to examine the relationship between emotional intelligence and job performance among university academics in Henan Province, China. Emo- tional intelligence, defined as the ability to recognize, understand, and manage one’s own emotions as well as those of others, has been identified as a critical fac- tor influencing teachers’ job performance in education (Mayer et al., 2000). In recent years, educational research has increasingly highlighted the importance of emotional intelligence in enhancing pedagogical approaches and improving stu- dent learning outcomes (Su et al., 2022). Despite the growing recognition of emotional intelligence’s role in education, the academic community has not reached a consensus on the specific mechanisms linking emotional intelligence to job performance. Some studies suggest that emo- tional intelligence directly enhances teachers’ teaching effectiveness and student satisfaction (Taseer, 2020). In contrast, other research indicates that emotional intelligence indirectly improves job performance by positively influencing teach- ers’ work attitudes, teaching methods, and interpersonal skills (Hamid et al., 2019). These discrepancies may result from variations in research methodologies and differing interpretations of emotional intelligence dimensions and job perfor- mance measures.",
    "The theoretical framework developed in this study aims to provide insights into how emotional intelligence affects the job performance of university academics. It will explore the impact of emotional intelligence on self-management, student interaction, and the ability to handle teaching challenges (Figure 1). The following research objectives underpin this study: (a) to ascertain infor- mation related to university academics’ demographic backgrounds in Henan Province, China, (b) to determine the level of emotional intelligence and job per- formance among teachers at Chinese college, and (c) to investigate the relation- ship between emotional intelligence and job performance among teachers at Chi- nese college. A quantitative approach, specifically a correlational design, was the most ap- propriate method for this study. Data were collected through a questionnaire survey administered to academics at five universities in Henan Province. Using Krejcie and Morgan’s formula, the sample size was determined to be 293. Strat- ified random sampling was employed to proportionately distribute the sample according to the number of academics at each institution, ensuring represent- ativeness. The questionnaire was designed with self-report scales and objective perfor- mance indicators to quantify various aspects of emotional intelligence and job performance. It consisted of three sections: Section A collected demographic data from respondents, Section B assessed levels of emotional intelligence using a standardized scale adapted from the Meyer-Salovey Caruso Test of Emotional In- telligence (MSCEIT), and Section C evaluated job performance through items measuring teaching effectiveness, student engagement, and professional develop- ment. The reliability of the scales was validated using Cronbach’s alpha, calculated with IBM SPSS version 29. Descriptive analysis was used to assess each dimension of emotional intelligence. Pearson correlation analysis was then employed to de- termine the relationship between emotional intelligence and job performance, ad- dressing research objectives related to each dimension of emotional intelligence (Figure 2). The researcher received all 293 completed questionnaires. Table 1 presents the descriptive analysis of the respondents’ profiles. Regarding age distribution, young academics (25 - 35 years old) accounted for 10.24% of the total. The ma- jority were middle-aged, with 40.27% aged 36 - 45 and 40.61% aged 46 - 55, while those close to retirement (56 - 65 years old) made up 8.87%. This distribution suggests that a significant portion of the participating academics are in the middle of their careers, likely bringing extensive teaching experience and emotional in- telligence skills to their roles. In terms of gender ratio, 60.07% of the respondents were female and 39.93% were male, indicating a higher proportion of female academics in five higher ed- ucation institutions in Henan Province. Regarding teaching experience, 9.90% of the respondents had less than 5 years of experience, 40.61% had 6 to 10 years, 31.74% had 11 to 20 years, and 17.75% were senior academics with more than 20 years of experience. This data reflects a broad distribution of teaching experience among the respondents. In terms of academic qualifications, 16.04% of the academics held a bachelor's degree, 30.03% held a master’s degree, 42.32% had a doctorate degree, and 11.60% had other qualifications. This indicates that most of the academics who partici- pated in the survey had a high level academic degree. This demographic and diversity within the respondent group offers a critical foundation for examining how emotional intelligence may affect the work perfor- mance of university academics, especially in the context of different age groups, genders, levels of experience, and academic credentials. Table 2 presents the analysis of the emotional intelligence levels of university ac- ademics, as assessed by the survey. Emotional intelligence was evaluated across five key dimensions: self-awareness, self-regulation, motivation, empathy, and so- cial skills. Each dimension was measured using a Likert scale from 1 to 5, where 1 indicates strongly disagree and 5 indicates strongly agree with the statements pro- vided. This analysis includes frequencies and percentages, central tendency (mean) and variability (standard deviation). The variability is continuous, low (1.00 - 2.33); medium (2.34 - 3.67) and high (3.68 - 5.00) for further clarification. As shown in Table 2, the level of self-awareness was shown that 64 academics, or 21.8%, had a low level, 130 academics, or 44. 4%, had a medium level, and 99 academics, or 33.8%, had a high level. The mean self-awareness score for the over- all sample was 3.36 with a standard deviation of 0.916, the group of academics studied had a high level of self-awareness and the data distribution was relatively concentrated.",
    "Seventy-one academics (24.2 per cent) were at a low level of self-regulation which implies that this group of academics may need additional support and training in the management of their emotions. The number of academics at the medium level was 90 (30.7%), indicating that these academics were able to manage their emotions effectively in most situations. In contrast, 132 academics (45.1%) at the high level demonstrated a high level of self-regulation and were able to maintain emotional stability in stressful situations. Overall, these academics had a mean self-regulation score of 3.14 with a standard deviation of 1.01, reflecting a broad distribution from low to high. This distribution pattern suggests that alt- hough most academics can control their emotions effectively, there are still some teachers who need more attention and support in self-regulation. There were 61 or 20.8% of academics at the low level and these academics may need additional support to boost their motivation. Academics at the medium level, 116 or 39.6%, show some motivation but may still need support to maintain or enhance their motivation in certain situations. High level motivated academics at 116 or 39.6%, demonstrate a high degree of motivation, which could improve stu- dent learning outcomes and their efficacy as academics. The mean motivation score of the academics was 3.42 with a standard deviation of 0.92 which reflects some motivational dispersion. Even though the majority of academics demon- strate good motivation, the uneven level of motivation suggests that individual differences need to be taken into account in academic training and development strategies in order to more effectively enhance each academic motivation to teach and, in turn, optimize the teaching process and students’ learning experience. Moreover, there were 62 teachers with a low level of empathy, which accounted for 21.2%. moderate levels of empathy encompassed 127 teachers, or 43.3% of the total, and these academics were able to understand the emotions of others to some extent but may still lack sufficient sensitivity in certain situations. In addition, 104 academics, or 35.5% of the total, showed high levels of empathy, and this group demonstrated a strong ability to empathize with emotions and effectively under- stand and respond to the needs of their students. The overall mean score for these data was 3.34 with a standard deviation of 0.94, and although most academics were able to demonstrate some empathy, there is still room for improvement in overall levels. Finally, the distribution of levels of social skills among the 293 academics is stated in Table 2. Low level of social skills (1.00 - 2.33) had 52 academics or 17.7% of the total. Medium level social skills (2.34 - 3.67) had 101 academics, or 34.5% of the total, and this group of academics had some social skills and were able to meet basic instructional and professional communication needs. The high level of social skills (3.68 - 5.00), with 140 academics or 47.8% of the total, indicates that nearly half of the academics excelled in social skills and were able to communicate and collaborate effectively. The overall mean social skills were 3.33 with a standard deviation of 0.94, indicating that while most the academics’ social skills were in the upper middle range. Table 3 describes the analysis of the assessed job performance of university aca- demics in Henan Province, China. The study consists of four main dimensions: teaching effectiveness, research output, academic and administrative engagement, and guidance and support. Each dimension was measured using a Likert scale of 1 - 5, where 5 denotes strongly agree with the statements provided, and 1 denotes strongly disagree. The analysis included frequencies and percentages, central ten- dency (mean) and variability (standard deviation). Variability was continuous and was low (1.00 - 2.33), medium (2.34 - 3.67) and high (3.68 - 5.00). The data shows that 57 academics, or 19.5%, had low teaching effectiveness, 120 academics, or 40.9%, had moderate teaching effectiveness, while 116 academics, or 39.6%, had high teaching effectiveness. 3.47 was the average score overall, and the standard deviation was 0.81, indicating that the majority of the academics pos- sessed good teaching effectiveness, but there were still close to one-fifth of the academics who needed to improve on their teaching. Of 293 academics, 47, or 16%, had a low level of research output, 118 academics, or 40.3%, had a medium level of research output, while 128 academics, or 43.7%, had a high level of research output. The overall mean research output score was 3.53 with a standard deviation of 0.85, indicating that the majority of academics were performing well in research, but there were a proportion of academics with low research output.",
    "In addition, the results show that 55 academics, or 18.8%, had a low level of engagement, 133 academics, or 45.4%, had a moderate level of engagement, while 105 academics, or 35.8%, had a high level of engagement. The overall mean score of 3.41 with a standard deviation of 0.86 reflects that academics are generally ac- tive in this area, but the distribution of engagement still shows some variation. The final dimension depicts 27% (79) of the academics had low levels of guid- ance and support, indicating significant room for improvement in effectively sup- porting students; 28.6% (84) of the academics demonstrated moderate levels of performance, suggesting that despite being able to provide basic support, there is still room for improvement; while 44.4% (130) of the academics demonstrated high levels of performance, making them leaders among their peers. The overall mean was 3.41 with a standard deviation of 0.99, reflecting differences in academ- ics’ perceptions of their own performance in this key competency. Table 4 reports that all dimensions of emotional intelligence (self-awareness, self- regulation, motivation, empathy, and social skills) are significantly and positively related to the job performance of university academics in Henan Province, so it can be inferred that improving teachers’ emotional intelligence can significantly improve their teaching effectiveness and professional achievement. In this study, the independent variable Emotional Intelligence (Self-awareness, Self-regulation, Motivation, Empathy, Social Skills) was positively correlated with the dependent variable Job Performance. According to Pearson’s correlation anal- ysis, the correlation coefficient between self-awareness and job performance was 0.778 (p < 0.01), showing a strong association between high self-awareness and high job performance (Côté & Yip, 2021). The correlation coefficient between self- regulation and job performance was 0.773 (p < 0.01), indicating that the better the teachers were at emotion regulation, the better their job performance was (Joseph et al., 2015). Furthermore, the correlation coefficient between motivation and job performance was 0.760 (p < 0.01), emphasizing that high levels of motivation are significant predictors of superior job performance (Miao et al., 2017). The corre- lation coefficient between empathy and job performance was 0.755 (p < 0.01), pointing out that teachers who are able to understand and empathize with the emotions of their students and colleagues usually perform better (Brasseur et al., 2013). Finally, the correlation coefficient between social skills and job perfor- mance was 0.734 (p < 0.01), confirming that good social skills have a positive im- pact on enhancing teachers’ professional performance (O’Boyle et al., 2011). Self-awareness, self-regulation, motivation, empathy, and social skills are the di- mensions of emotional intelligence that researchers identified in this study, along with the level of job performance. The researcher then thoroughly examined the relationship between emotional intelligence and the job performance of university academics in Henan Province. The analyses’ findings demonstrated a significant and positive correlation between academics’ job performance and all dimension of emotional intelligence, including self-awareness, self-regulation, motivation, empathy, and social skills (r = 0.778, 0.773, 0.760, 0.755, 0.734; p < 0.01). These results are consistent with those found in the body of literature, including studies by Goleman (1995) and Mayer and Salovey (2007), which highlight the vital role From a practical perspective, these findings emphasize the need to incorporate emotional intelligence development in academic training and CPD programs. Ed- ucational institutions can enhance the quality of teaching and learning by adding necessary modules on emotional intelligence, such as emotional awareness and risk management. The results of this study support the theoretical basis of emo- tional intelligence in improving job performance and provide educational policy makers with empirical data to support strategies for incorporating emotional intelligence into academics’ professional development. As the educational envi- ronment continues to change, continued exploration of how emotional intelli- gence plays a vital role in specific educational practices. The results of this study highlight the importance of integrating emotional in- telligence training in academic or CPD training programs. By systematically en- hancing academics’ competence in emotional awareness and management, the teaching and learning process can be effectively optimized to increase student en- gagement and satisfaction. Educational administrators can accordingly adjust their academic development program to focus more on the development of aca- demics’ emotional competence, thereby creating a more positive and supportive teaching and learning environment on campus.",
    "Higher education institutions have a crucial role to play in enhancing the emo- tional intelligence of academics, and they should develop and implement custom- ized emotional intelligence training programs to meet the needs of academics at different levels. For new academics, such training should focus on foundational skills such as ways to understand and manage students’ emotions, while more ad- vanced training on leadership and team management should be offered to experi- ence senior academics. Such tiered training would help academics to receive the necessary support and enhancement at different stages of their careers. Educational policy makers should support the development of emotional intel- ligence by creating incentive policies, such as providing career advancement op- portunities or other forms of rewards for academics who demonstrate excellent emotional management skills. At the same time, policies should include financial support for emotional intelligence training in order to reduce the cost of imple- menting such training in educational institutions and to encourage more educa- tional institutions to participate. In addition, in order to ensure the timeliness and effectiveness of the training content, higher education institutions should work closely with educational re- searchers to collect and analyze data on the effectiveness of training on a regular basis, and to adjust the training programs according to the feedback. By establish- ing a continuous research and feedback mechanism, it can be ensured that train- ing programs are always in line with the actual needs of academics and the latest educational research findings, and such a strategy will greatly enhance the useful- ness and effectiveness of training. The study also revealed some potential limitations in that the sample was lim- ited to a number of higher education institutions in Henan Province and was not fully representative of other regions or countries. Future research should consider using a wider sample and possibly incorporating qualitative research methods to gain insight into how emotional intelligence affects academics’ performance in different cultural and educational contexts. Because of its cross-sectional research design, the current study’s investigation of causality was limited in its ability to pinpoint the precise relationship between emotional intelligence and job performance. Future research could validate how changes in emotional intelligence affect academics’ job performance over time through a longitudinal research design, which would contribute to a more accu- rate understanding of the long-term effects of emotional intelligence and its spe- cific application in educational practice. The unique culture of Henan Province, characterized by traditional values and a large population with a high level of education, suggests that the standard emo- tional intelligence model may need to be adapted to adequately account for the complex interactions between emotional intelligence skills and job performance indicators in different regions. This is in line with the results discussed in previous chapters, which emphasize the differences in the level of awareness and emphasis on emotional intelligence in different cultural contexts. Incorporating these cul- tural factors allows for more effective implementation of emotional intelligence development programs tailored to the specific needs of educators in different set- tings. This study acknowledges its limitations, with a primary geographic focus on Henan Province, and suggests that a broader, possibly cross-cultural, study be conducted to validate and extend these findings. Through a careful understanding of how emotional intelligence influences educational environments, this study provides valuable perspectives for the fields of educational psychology, leadership, and faculty development, as well as for policymakers and educational administra- tors who create supportive and effective educational environments. Future research should investigate new technologies that involve interactive software tools to simulate real classroom scenarios, a method that more realisti- cally assesses academics’ ability to apply emotional intelligence in actual teaching. Through such simulations, teachers can practice their emotional management skills in a controlled and safe environment, thus better preparing them to face various challenges in teaching. The study serves as a foundation for developing policies in educational establish- ments. Policy makers are encouraged to incorporate regular assessments of emo- tional intelligence into academic performance evaluations and to consider incen- tivizing academics to further develop these skills. Such policies will not only im- prove academic performance, but also create a more supportive learning environ- ment, which will improve a wide range of educational outcomes. Ongoing re- search is also crucial. Further research could explore which elements of emotional intelligence most affect performance and propose interventions that would ex- plore the long-term impact of these interventions on the education system, providing ongoing feedback to help refine and adapt educational practices and academic training methods to effectively meet changing educational needs.",
    "Putra Malaysia in supporting postgraduate student experiences on publication purposes. Appreciation also goes to the academics at five universities in Henan Province, China who contributed as respondents for this study."
]