[
    "To gain a comprehensive understanding of job burnout among Chinese university teachers, this study examined the impact of teachers' psychological capital on job burnout from the perspective of organizational identification. A survey was conducted among 350 teachers from five colleges and universities in Henan Province of China using a convenient sampling method. Data were analyzed using SPSS23.0 and process macros. The findings revealed that while teachers' psychological capital and organizational identification are generally high, there is a moderate level of job burnout. Furthermore, there was a substantial positive link found between teachers' psychological capital and organizational identification, with psychological capital significantly predicting organizational identification. Both psychological capital and organizational identification demonstrated significant negative correlations with job burnout, plus substantial predictive effects. Mediation analysis suggested that organizational identification partially mediates the relationship between teachers' psychological capital and job burnout. Faculty of Social Science, Arts and Humanities, Lincoln University College Wisma Lincoln, No. 12-18, Jalan SS 6/12, 47301 Petaling Jaya, Selangor, Malaysia Email: limsp@lincoln.edu.my Job burnout, a state of physical, mental, and emotional exhaustion that occurs when an individual is unable to cope with demands that exceed the individual's energy and resources, is a crucial indicator of professionalism [1]. It manifests as a series of delayed psychological reactions and behaviors such as low mood, physical and mental fatigue, and the lack of creativity and personal value reduction [2]. Current studies mostly followed Maslach's three-dimensional definition [3], [4]: emotional exhaustion, depersonalization, and reduced personal accomplishment. Emotional exhaustion is a central feature of burnout, where individuals feel their energy and resources are depleted. Depersonalization involves maintaining a distance from the object of work and adopting an indifferent attitude. Reduced professional accomplishment entails negative self-evaluation, decreased personal achievement, reduced self-efficacy, and a lack of adaptability [5]–[7]. A severe case of burnout is characterized by high levels of emotional exhaustion and depersonalization, as well as low levels of personal accomplishment [8]. Research indicated that those suffering from burnout experience morning work pressures and a phobia of their job [3], [9], progressively affecting their physical and mental well-being [10]. Through a systematic review of burnout and physical health, Madigan et al. [11] provided strong evidence that teacher burnout was associated with poor physical health, such as headaches, gastroenteritis. A study encompassing 25,000 individuals across 26 occupations revealed that the teaching profession ranked second in terms of overall stress levels, with a poor feeling of happiness [12]. Kristensen et al. [13] reported that compared with other service-oriented professions such as social work and nursing, teachers experience a higher level of emotional exhaustion. Job burnout can cause profound negative consequences. Educators feeling burnout typically exhibit lower levels of effectiveness and job satisfaction, demand less work, and avoid challenges [14], [15]. Furthermore, they may alienate students, lose patience and affection for students, reduce the time of course preparation, lack passion and creativity in teaching, lack the sense of achievement and are less inclined to collaborate with their colleagues [9], [16], [17]. Bulatevych [18] found that burnout not only affects teaching quality but can also has a direct impact on students. There are evidences that teachers' job burnout can impair students' academic performance and motivation [19]. Eventually, job burnout may cause teachers leaving the profession [20], [21]. Higher education in China has brought about opportunities that are evident in the following ways, along with the economy's rapid expansion: popularization, the demand for more cutting-edge innovation, and the cultivation of high-quality human resources [22], all of which caused derived demands for high quality university teachers. They have to carry out scientific research while simultaneously undertake heavy teaching tasks, making them face increasing pressure and high risk of burnout. Studies [23], [24] have discovered that the phenomenon of job burnout among Chinese university teachers is already widespread, with an increasing trend [25], which hinders the development of higher education to a certain extent. University teachers are indispensable for the higher education system; thus, it is urgent to develop measures for alleviating job burnout among them. Psychological capital, a product derived from positive psychology in the field of management, signifies the positive mental state of human beings [26]. It is regarded as the fourth resource after the social capital, human capital and economic capital. At present, it has attracted more and more attention of scholars, and many studies have been carried out in sociology, medicine, education and other related subjects. Psychological capital mainly encompasses self-confidence, optimism, hope, and resilience [27], and it was argued that these four dimensions may not play the same role under different contexts [28]. Avey et al. [29] noticed that psychological capital is highly correlated with the well-being of employees. A study [30] conducted on Saudi oil managers concluded that psychological capital can enhance organizational commitment, citizenship behavior, and job satisfaction. Through a comprehensive literature review of psychological capital, Burhanuddin et al. [31] suggested that the majority of studies primarily concentrate on examining the influence of psychological capital as a significant antecedent variable on work performance and life attitude, as well as physical and mental health issues.",
    "Currently there are three models on the mechanism of teachers' psychological capital: main effect, mediating effect and moderating effect. Psychological capital has a negative effect on job burnout and a positive effect on work engagement and job satisfaction, which is a two-way process coexisting with cumulative negative effects [16]. Both studies [7], [26] proved that psychological capital potentially led to a negative prediction of job burnout. A study [32] revealed that psychological capital act as a moderator between teaching-research conflicts and job burnout among educators. Hong et al. [33] came to the conclusion that psychological capital could completely mediate the relationship between natural acting, deep acting and psychological well-being. Related research [34] has shown that psychological capital mediates and moderates’ emotion and job burnout of childhood teachers. For university teachers, job burnout indirectly affects their mental health through psychological capital, which regulates job burnout and mental health [10]. This paper will focus on the main effect and propose the Hypothesis 1: With the research on occupational stress and healthy socialization of employees, organizational identification has become an important variable in the study of organizational behavior, and has attracted more and more scholars' attention. It is generally accepted that organizational identification means the state in which members of an organization create their own self-concept in accordance with unique identification, i.e. the perception that an individual is consistent with or subordinate to an organization [35]. In essence, it is the degree of psychological recognition of the organization, creating a psychological basis to form a common destiny with the organization, which can improve individual work engagement, job satisfaction [36] and individual performance [37], [38], as well as promote employee collaboration and improve organizational performance [39]. Additionally, organizational identification is effective in regulating job leave [35], [40] and emotional exhaustion [41]. Prior studies [42]–[44] have found that identification with a certain social group is negatively correlated with job stress and burnout. The level of organizational identification reflects the extent of the psychological bond between teachers and their affiliated colleges. In other words, teachers build their degree of identification on the distinctive, fundamental, and enduring characteristics of their employers [45]. Avanzi et al. [46] found that organizational identification impacts colleague relations to a certain extent. Therefore, we propose the Hypothesis 2: As mentioned above, psychological capital is a kind of positive psychological resource within an individual, and organizational identification reflects individual attitude toward the organization, so its level is bound to be affected by individual psychology. It has been demonstrated that people with psychological resilience are better able to adjust themselves and identify a sense of belonging in their organizations [47]. Previous empirical studies found that there is a predictive effect of psychological capital on job burnout and organizational identification, and also a predictive effect of organizational identification on job burnout. Based on this, the following hypothesis is proposed: Teacher burnout is formed by the dual influence of external environment and internal factors, so can we prevent it by creating a good organizational atmosphere and excavating teachers' positive psychological qualities? Based on the above literature review and research hypotheses, this paper constructs the following conceptual framework, as shown in Figure 1. This paper aims to explore new perspectives to alleviate the burnout of university teachers, hoping to positively improve the job satisfaction, physical and mental health, and work performance among them. Convenience sampling was used to survey the faculties of five colleges and universities in Henan Province, China. The researcher distributed the questionnaires from August 2023 to November 2023 using a combination of online and offline methods. The online survey was conducted via the \"wenjuanxing\" platform, one of the largest online survey questionnaire websites in China. The Internet was chosen to administer the survey for the following reasons: First, as suggested by Gosling et al. [48], the Internet makes it easier for researchers to communicate with participants and thus it is possible to recruit more participants. Second, Wright [49] argued that the stress of participants can be reduced if researchers are not present on the site. In this way, participants may feel more comfortable to give honest answers to sensitive questions, and they can click the link to fill out the questionnaire, with detailed instructions on the front page, which is completely anonymous and voluntary. Meanwhile, participants will receive a red envelope reward ranging from 1 to 5 yuan after submitting the questionnaire. Out of 350 questionnaires were distributed, 295 were recovered, and 267 remained valid post-screening, with an effective rate of 90.51%. The sample comprised of 111(41.6%) males and 156(58.4%) females, aging from 25 to 60, with 113 (42.3%) aged between 26-35, 106 (39.7%) between 36-45, 42 (15.7%) between 46-55, and the remaining 6 (2.3%) above the age of 56. Regarding teaching experience: there were 18 (6.7%) participants with two years or less, 41 (15.4%) with 3-5 years, 83 (31.1%) with 6-10 years, 90 (33.7%) with 11-20 years, and the rest 35 (13.1%) participants who had taught for more than 20 years. There was a total of 41 (15.4%) teaching assistants, 117 (43.8%) lecturers, 78 (29.2%) associate professors, and 31 (11.6%) professors.",
    "This study assessed psychological capital with the 24-item questionnaire (PCQ) [27], which has been validated in numerous contexts [28]. Most of the studies on teachers' psychological capital use the PCQ- 24, as confirmed by Burhanuddin et al. [31] in a systematic literature review of psychological capital. On a scale of one to six, with responses ranging from strongly disagreeing (1) to strongly agreeing (6), it consisted of twenty-four items that were available for evaluation. There are six items in each subscale of the PCQ-24, which allows for measurement in four different dimensions. These dimensions included self-efficacy, hope, resilience, and optimism. The Cronbach's alpha coefficient in this study was 0.953 and the dimensions were 0.852, 0.881, 0.889, and 0.860 respectively, while KMO=0.952 (p=0.000<0.05). Organizational identification was measured by the Organizational Identification Scale [50], which was revised for localization by Chinese scholars [51]. It consisted of six items on a 5-point Likert scale, ranging from \"very disagree\" to \"very agree\". Sample item: \"When talking about my university, I often say \"we\" rather than \"they\". An increased feeling of belonging to the group is indicated by a higher score. For this study, the Cronbach's alpha coefficient was 0.809, and KMO=0.845 (P=0.000<0.05). The international general maslach burnout inventory (MBI-GS) was adopted for the measurement of job burnout. Li and Shi [52] rewrote and translated the Chinese version, which has been used extensively with reliability and validity. MBI-GS consisted three dimensions: emotional exhaustion (5 items), depersonalization (4 items), and reduced personal accomplishment (6 items). Each item ranged from \"never\" to \"every day\" using a Likert 7-point scale. A positive score was adopted for the first and second dimensions, and a negative score was adopted for the third dimension. The average score of all items was calculated. Kalimo et al. [53] set the standard that a score of <1.5 was considered no burnout, (1.5, 3.5) was considered mild to moderate burnout, and >3.5 was considered high burnout. In this study, the overall Cronbach's alpha coefficient of the questionnaire was 0.889, and the three dimensions were 0.922, 0.899, and 0.911 respectively, and KMO=0.909 (p=0.000<0.05). SPSS 23.0 and Process macro software were used to analyze the data. The reliability and validity of the measurement instruments were tested and the descriptive statistical analysis of each variable was carried out. To test the hypothesis, we also conducted correlation analysis and regression analysis. The descriptive statistics and correlation coefficient matrix for each variable are shown in Table 1. The mean value of psychological capital was 4.583, much higher than the median value of 3.5, indicating the high level of psychological capital of university teachers. The mean value of organizational identification was 3.915, which was also higher than the median value of 3, suggesting that university teachers have a stronger sense of identification with the organization. The mean value of job burnout at all dimensions was between 2-3, showing a mild to moderate job burnout state among university teachers according to previous criteria. Table 1 shows that there is a significant positive correlation between psychological capital and organizational identification (r=0.470, p<0.01), but a significant negative correlation with emotional exhaustion, depersonalization and reduced personal accomplishment (r=-0.217, p<0.01; r=-0.271, p<0.01; r=-0.395, p<0.01). Meanwhile, there was a significant negative correlation between organizational identification in these three dimensions (r=-0.123, p<0.05; r=-0.292, p<0.01; r=-0.315, p<0.01), which verified our hypotheses 1, 2 and 3. We standardized all variables and adopted the SPSS PROCESS3.0 (Model 4) compiled by Hayes [54] to analyze the mediating effect of organizational identification. Parameter estimation was performed using the bias-corrected percentile Bootstrap method analyzing 5,000 random samples with put-backs, and 95% confidence intervals were adopted. The results are summarized in Table 2. Demographic variables such as gender, teaching experiences and professional title were all controlled in our analysis, as previous studies [16], [25], [32] have found that these variables may have an impact on job burnout. We found that teachers' organizational identification has a partly mediating function between psychological capital and job burnout, supporting H4. Specifically, the influence of psychological capital was markedly direct on both organizational identification and job burnout. Psychological capital was a significant positive predictor of organizational identification (b=0.412; p<0.001), in contrast to the significant negative influence on job burnout (b=−0.414; p<0.001). Organizational identification significantly, directly, and negatively effect on job burnout (b=−0.263; p<0.01). Results also showed a significant indirect effect of psychological capital on job burnout via organizational identification (b=–0.108; 95% CI [−0.188, −0.028]). According to Wen and Ye [55], if the confidence intervals of the indirect effect do not include 0, the mediating effect would be significant. And obviously the confidence intervals do not include 0. Moreover, the direct effect of psychological capital on job burnout was significant, thus suggesting that organizational identification acts a partially mediating role. The total effect of the model was also statistically significance (b=–0.522; 95% CI [−0.662, −0.383]). Furthermore, the findings indicated that gender, teaching experiences and job title were all insignificant predictors of organizational identification and job burnout.",
    "The present study is aimed to explore the relationship between psychological capital and job burnout among university teachers and the mediating role of organizational identification. It was found that psychological capital and organizational identification were all at a high level, which was consistent with previous findings [6], [46]. The mean values of total burnout scores and dimensions were between 2-3, at a mild-moderate burnout level, which was also in line with prior research [6], [7], [32]. Psychological capital is one of the important factors affecting job burnout among university teachers. The results showed that psychological capital significantly and negatively predicted burnout, meaning that teachers with stronger psychological capital had lower levels of burnout, which validated earlier studies on the subject [6], [7], [9]. Psychological capital is also an important factor reflecting the strength of teachers' psychological quality. People always actively preserve, maintain, and build resources that they consider valuable [56]. It can elevate the frustration tolerance of individuals, making them full of hope for the future, capable of formulating comfortable interpersonal relationships, acquiring new knowledge and methods, and relieving work pressure, thus contributing to occupational well-being [5], [10]. They can actively understand the changes and mobilize the resources around, and complete their tasks as much as possible. When experiencing setbacks, they will also try to maintain an optimistic attitude. Therefore, they will have more positive evaluation of their own job, experience the happiness of teaching and research, and the sense of honor and belonging to the teaching profession. They will face and accept the pressure and difficulties with a frank and optimistic attitude, and job burnout will naturally clear off. It was discovered that psychological capital is significantly and positively correlated with organizational identification. According to the self-determination theory, resilience is a unique psychological resource, which can assist workers in approaching their organization with a positive attitude and in increasing their sense of connection with the organization [47]. When dealing with adversity and conflict, individuals can better mobilize the resources and adapt themselves to the environment through self-regulation, thus the individual and the organization can achieve an equilibrium. Teachers who are full of hope have a self- motivation for intrinsic achievement, a persistent pursuit of self-worth, and will take the initiative to internalize the goals of the organization, thus enhancing the sense of organizational identification. The result revealed that organizational identification is also significantly negatively correlated with job burnout. University teachers with higher levels of organizational identification are more willing to accept organization-related policies, thus reducing or avoiding the impact of work pressure [43]. Job stress is a major factor in the formation of job burnout [16]. According to the social exchange theory, all human behavior is based on exchange, including not only material reward but also honor and emotions. Therefore, when the organization meets the needs of the teachers, they will form a sense of identification with the organization [40]. According to the findings of relevant research, organizational identification is a powerful psychological bonding between the individual and the organization, which has a significant influence on the attitude and behavior of employees [57]. When employees develop a sense of identification with the organization, the success of the organization will bring them emotions of honor, which will reduce the amount of job burnout that they experience. Teachers with a high degree of psychological capital will be more optimistic and self-confident, thus unlikely to experience job burnout. The results of the regression analysis supported the hypothesis that organizational identification mediates the impact of psychological capital on job burnout to some extent. Organizational identification acts as a connecting link. Teachers who possess higher levels of psychological capital will also identify more strongly with their organization and experience less burnout. When teachers defined themselves at the organizational level and categorized as members of the organization, they would engage in more organization-friendly behaviors, such as overcoming difficulties encountered at work and striving to achieve work goals [58]. Thus, enhancement of teachers' daily working atmosphere and environment, which is achieved through the concern and support from university, can effectively alleviate job burnout among educators. Consequently, this will foster a stronger sense of identification between teachers and their respective institutions as well as enhance their commitment towards their work.",
    "From the perspective of psychological capital and organizational identification, this paper deeply analyzes the causes and mechanisms affecting the job burnout of university teachers, verifies the research hypothesis through empirical evidence, and draws the conclusion that both factors have a certain impact on job burnout, as well as organizational identification plays a mediating role between them. This is of practical significance to further alleviate teachers' job burnout and enhance organizational identification. On one hand, this study deepened the contextual understanding of the role of psychological capital on burnout; on the other hand, it provided new ideas for universities and teachers to reduce job burnout. Therefore, university administrators should take into account the psychology of teachers, adopt measures to enhance the psychological capital of teachers, and eventually strengthen the organization. Teachers' attitudes toward the organization can influence their sense of job satisfaction and occupational happiness, as well as the efficiency of the organization. Of course, there are still some shortcomings in this study: firstly, the research mainly uses the self- stated questionnaire method, with a certain degree of subjectivity, so the fact-to-face interview can be added in future to collect the viewpoints and opinions of the subjects at a deeper level. Secondly, this study investigated only the teachers of a few colleges and universities in Henan Province of China, the representativeness needs to be enhanced, and the sample size can be further enlarged. Thirdly, only three variables were specified in the research, there may be many factors affecting job burnout, so more variables can be introduced in future studies."
]