[
    "Abstract: The Lantern Festival in Baiqueyuan Town, Guangshan, is a long-standing traditional folk custom and the best- preserved folklore fire celebration in southern Henan Province. Through in-depth interviews, this study exam-ines how the Lantern Festival in Baiqueyuan Town, Guangshan, takes ad-vantage of modern media and plays to its strengths in the context of social media to culturally interpret the Lantern Festival in Baiqueyuan Town, and how the collective memory of the event as a ritual phenomenon is con-structed. The study also examines how the collective memory of the lantern festival as a ritual phenomenon is constructed. The relationship between social media, rituals, and collective memory are inextricably linked, and this paper takes the lantern festival in Baiqueyuan town as an example to explore. The Lantern Festival is a traditional social fire folklore event in southern Henan province and has existed for hundreds of years as an important means of ritual and blessing for the people. Located in Guangshan County, Henan Province, the Baiqueyuan Town Lantern Festival is the largest surviving festival in southern Henan Province. In the beginning, the original content of the lantern fair was the people's sacrifice to the god of fire to pray for peace, while today's lantern fair in the content of the form of folkloric performances, the residents of Baiqueyuan town among the popular saying \"only after the lantern fair is the New Year complete\". As the site of the lantern festival, Baiqueyuan Town carries the memories of the people of Baiqueyuan Town, and the festival is held on the 15th day of the first month of each year, and it is a lively event every year. In this study, we will explore how the collective memory of the local people is shaped and constructed in the context of media rituals during the long-lasting ritual event of the Lantern Festival. In the explanation of media and ritual, the concept of ritual in anthropological theory is essentially concerned with the functioning of human civilization and the exchange of different cultures, and Couldry’s view of media ritual applies the influence of media on social life. These actions express a broader range of media-related values. Using the lantern festival as a medium and relying on the symbolic power of the ritual, the Baiqueyuan Lantern Festival is situated in such a mediated society, resulting in the Baiqueyuan Lantern Festival as a mediated ritual that shapes and expresses the local social center of Baiqueyuan Town. function of rituals is to strengthen the ties of members within the collective, where individuals participate in rituals, and where the direct ties between individuals and society will grow stronger under the role of rituals(Wu,2004). On the other hand, rituals blend the sacred and secular, strengthening the religious beliefs of individuals and improving the ideals of certain individuals, increasing the cohesiveness of the group(Qu,2001). The role of group maintenance of rituals reinforces the idea of individual collectivity through rituals(Zhang,1993).Callinicos Alex proposes that rituals, in addition to uniting the members of society and confirming their collective identity, will periodically create a common society, infect the collective emotions of the gathered masses, and achieve a state of \"collective euphoria\" through joint participation(Callinicos,2010). However, although Turgot saw \"collective euphoria\" as a symbol of \"social integrity\" and thus created a tide of civilization, he was \"crazy\", as if The state of \"happiness\" is expressed only in the \"euphoric\" moments of a group, which cannot form a bond with the members of the group. Coser, L. A. argues that in the dull daily life, the collective memory proposed by Habwach uses the rituals of life and heroes for remembrance in the form of literature and poetry to make the memory within the group burst again, and the function of this remembrance is sufficient to fill and eliminate the gap between collective excitement and daily life. In How Societies Remember, Paul Connaughton suggests that past im-pressions and recalled knowledge are transmitted and sustained by various rituals, which provide practices from the mind to the body, and group practices coalesce consensus(Connerton,1989). Watching Zeng considers collective memory as a process of memory sifting and reorganization, through which the group's history and current environment can be analyzed and the future can be envisioned(Wu,2004). Kossel's work follows Harwich’s theory that individuals who belong to the same group give new life to the fading history through the participation of rituals in an imaginary way. The relationship between ritual and collective memory can also be seen, and the ritual perspective is an important basis for our exploration of the In an examination of ritual and collective memory, Turgot in The Basic Forms of Religious Life proposes that religion is sacred and consists of beliefs and rituals together, where the Among the contents of specific observations, numerous scholars have obtained rich research results through case studies. Through a field investigation of the belief rituals of the indigo Yao in various smoke tunnels, NariBilige found that the rituals of the indigo Yao's belief in ancestral spirits and spirits use the body as the main carrier, and the process of the rituals is filled with a strong religious atmosphere of Taoism, and this ritualistic behavior becomes part of the collective memory of the residents(Narilibige,2000). In his observation of the Mongolian Nadamu, De Cai concluded that the three rituals of sacrifice, cultural performance, and athletes' entrance became a means of memory, and the content of the rituals concentrated on Mongolian culture, which is the centralized embodiment of the Mongolian people's consciousness of \"all things have spirit\"(Decai,2017). Li Xiaocheng observed the \"June 6\" field ritual of the Buyi people in Bik village, Guizhou province, and analyzed the origin of the field ritual and the family and collective field rituals, in which collective memory and ethnic identity are strengthened and solidified in the festival rituals and stories and legends(Li,2013).",
    "Today, with the widespread use of mass media, the media has an important role in the construction of social memory, the media expands the public space, and collective memory is expressed and maintained in media production and dissemination. Xia Chunxiang argues that the existence of collective memory, whether constructed or perpetuated, requires public material media as the basis and carrier, and the material basis plays an important role in the content of collective memory becoming stronger(Xia,1999). This material basis can be seen everywhere today, and mass communication is constantly developing, and mass communication has become a kind of ritual, and people receive information through media channels, and the process of receiving information becomes a shared ritual. In summary, the discussion on medium, ritual, and collective memory provides a broader perspective to explain the phenomenon of the Baijueyuan Town Lantern Festival as a medium, and the sense of identity that the medium ritual has become a law of action to unite the society. In the above scholars' discussions, media, rituals, and collective memory are inextricably linked, and the role of media, with a variety of rituals to remember the past, brings collective memory more vividly to life. This study will adopt the qualitative research method of in- depth interviews, which has the characteristics of comprehensiveness and depth and can reflect the process of formation, development, and change of things by collecting rich and vivid data. This study will use a combination of semi- structured interviews and structured interviews. This research method is more suitable for conducting in-depth interviews and free interviews, which is conducive to mobilizing the initiative and enthusiasm of the interviewees and further obtaining first-hand information. The in-depth interviews focused on the family situation, media use and information exposure, emotional attitudes toward the Lantern Festival, and whether and how social media use had an impact on their collective memory, among other things, among the generations of residents in Baiqueyuan Town. Through a combination of convenience sampling and snowball sampling, the 12 interviewees needed for this study were identified, and Use American English when writing your paper. The serial comma should be used (“a, b, and c” not “a, b and c”). In American English, periods and commas are within quotation marks, like “this period.” Other punctuation is “outside”! The use of technical jargon, slang, and vague or informal English should be avoided. Generic technical terms should instead be used. Mediated existence has become a reflection of people's lives at present, and in the context of the widespread use of social media, the participants of the lantern festival in Baiqueyuan town can also become the communicators of the rituals of the festival in social media, and in the process of spreading the mediated rituals in social media, everyone can become the subject of the construction of the collective memory of the festival. As James Carey proposed that the communication system formed by the combination of symbols and meanings forms meaningful symbols in the dynamic process of communication, the process of symbol formation is also the process of symbols being created, understood, and used(Carey,2005). Mediated rituals promote awareness of rituals under the influence of the media and play a huge role in constructing collective memory in rituals and promoting the emergence of cultural identity. As a kind of media ritual, the Baiqueyuan Lantern Festival is disseminated in the new media environment just like the function of \"media hajj\" proposed by Couldry, through which the scene seen in the media can be \"encountered\" once in real life, and the abstracted media The abstracted qualities of the media are embedded in the encounters of the real world, and Couldry argues that \"the mediated hajj is a performance constructed in the space of distance between the ordinary world and the mediated world\"(Couldry,2003). Therefore, the media ritual of sharing the Baiqueyuan lantern festival through the media requires a broader cultural and ritual space, but the structure of the ritual space is limited to the ritual process of the Baiqueyuan lantern festival. In the new media environment, the new media communication of the participants of the lantern festival in Baiqueyuan town is mainly divided into personal social media communication and social organizational media communication. With the aid of communication technology, media rituals in many forms are spread and shared around the world, making it a special moment in the festival as a media ritual with ritual significance(Harrison,1913). Rituals are a perpetual human need, and only in the context of collective rituals can the simple and mundane be divided into the pleasant and breathtaking within. Most people are not artists and thinkers and have long had to live, imagine and feel by conventions (Couldry,2003).",
    "Under the influence of the media environment, all cultures are under the influence of the \"media environment\", and the media, mainly social media, has become another force that cannot be ignored in the development and change of folklore activities. In the process of participating in rituals, specific values shared by the group contribute to the production of collective memory, which is reinforced in regularized rituals(Couldry,2003). Even though the emergence of social media has crowded out the space for folk culture to survive, the span of space created by social media provides a broader space for folkloric activities, providing opportunities for connection between groups that are not in the same space, but in the same memory through technology. The residents of Baiqueyuan town achieve the role of mutual communication and integration through the transmission of information via personal social media, which in turn promotes the generation of collective memory. Tik-Tok and WeChat circles of friends are widely used among the residents participating in the lantern festival in Baiqueyuan Town. Individuals use social media to disseminate information about the festival in the form of pictures, texts, videos, etc., to photograph the site of the festival, distribute information through personal channels, and spread the content of information captured by individuals in the festival. The presentation and maintenance of collective memory is a social construction process, a dynamic evolution of the social psychology of the residents of Baiqueyuan town, and the use of social communication for different purposes varies among individuals. As a media ritual, the Baiqueyuan lantern festival is well known in the town, and the festival itself becomes a social arena for residents to communicate on an equal footing. However, due to the intervention of social media tools, the information transmitted through social media is shared through online channels for viewers outside of Baiqueyuan town, and the lantern festival ritual is further spread under the influence of online media. In the process of collecting information, we learned that some callers of social organizations, to maintain the media of the organizations to which they belong, use social organization media to transmit media rituals and thus build collective memory. The affiliated social organizations hope to use their influence to spread the photography of the lantern festival in the future, which on the one hand objectively reproduces the folklore scenes and cultural contexts of the lantern festival in Baiqueyuan town, and on the other hand interprets the ritual meaning of the lantern festival in Baiqueyuan town with mediated thinking, forming the symbolic power of the ritual, which Couldry calls the concentration of social symbolic resources, and this concentration of resources not only affects people do but affects people's ability to describe society itself, for example, symbolic power affects the perception of people's social inequalities, the capture of ritual messages, etc.(Couldry,2003). In the symbolic power applied to the ritual, it promotes a broader social impact of the Baiqueyuan Town Lantern Festival as a mediated ritual. As Ginsburg wrote in her chapter Media World about the mediated role of the Bolivian interview television program Open Court in the public sphere, the mediated influence formed by social organizations focuses more on the social interaction between the two in the site of media production (Ginsberg,2015), with the observer and lamplighter participant-dominated producers of media rituals placed on an unequal on a continuum of cultural practices that form a substantial public sphere. At the same time, the use of social media promotes new developments in lantern festivals and provides more possibilities for the construction of collective memory of lantern festivals. On the one hand, social media outlines the media space field through pictures and videos, and the power operation mechanism and symbolic mechanism carried by media rituals have been transformed, expanding from the mere examination of ritual contents and functions to the group using social media both at the center of the media and shaped by the media. The collective memory generated by social media is also dependent on social life, and the memory of the habitat needs the continuation of the group. Through pictures and videos, the content of the information released using social media platforms relies on media technology and assumes a communication function, and the practice of viewing the information helps to awaken the collective memory of the residents of Baiqueyuan Town.",
    "This study examines ritual behavior in online media use, and through the investigation of media rituals and collective memory, we learn about the influence of social media on media. This influence also has some shortcomings, firstly, it is limited to the local investigation in baiqueyuan and cannot meet the research in other places, and likewise this study is limited to the local cultural context in Henan Province, China, and does not apply to other regions, although similar ritual activities are also found in other regions."
]