[
    "Received: 18 March 2021 / Accepted: 15 September 2021 / Published online: 1 October 2021 © The Author(s), under exclusive licence to Springer-Verlag GmbH Germany, part of Springer Nature 2021 Objective Occupational stress is considered a worldwide epidemic experienced by a large proportion of the working popula- tion. The identification of characteristics that place people at high risk for occupational stress is the basis of managing and intervening in this condition. In this study, we aimed to identify and validate the risk features for occupational stress among medical workers using a risk model and nomogram. Methods This cross-sectional study included 1988 eligible participants from Henan Province in China. Occupational stress and worker-occupation fit were measured with the Depression, Anxiety and Stress Scales (DASS-21) and Worker-Occupation Fit Inventory (WOFI). The identification of risk features was achieved through constructing multiple logistic regression model, and the risk features were used to develop the risk model and nomogram. Receiver operating characteristic (ROC) curves and calibration plots were generated to assess the effectiveness and calibration of the risk model. Results Among 1988 participants in our study, there were 42.5% (845/1988) medical workers experienced occupational stress. The risk features for occupational stress included poor work-occupation fit (WOF score < 25, expected risk: 77.3%), nurse population (expected risk: 63.1%), male sex (expected risk: 67.2%), work experience duration of 11-19 years (expected risk: 54.5%), experience of a traumatic event (expected risk: 65.3%) and the lack of a regular exercise habit (expected risk: 60.2%). For medical workers who have these risk features, the expected risk probability of occupational stress would be 90.2%. Conclusion The current data can be used to identify medical workers at risk of developing occupational stress. Identifying risk features for occupational stress and the work-occupation fit can support hierarchical stress management in hospitals. Occupational stress is generally acknowledged as a global phenomenon that occurs in both developed and developing countries and has significant health and economic conse- quences (Suleman et al. 2018). In 2019, the State Council of the People's Republic of China issued a public policy entitled Healthy China 2030 (2019-2030) with the aim of promoting mental health screening, and supervisory depart- ments need to give more attention to students and relevant professions. Healthy China 2030 (2019-2030) requires organization managers to regularly assess and take steps to prevent occupation-related psychological disorders (General Office of the State Council of PRC 2019). Occupational stress is a typical occupation-related psychological disorder. At present, the features of groups at high risk for occupa- tional stress have not been determined. It is worthwhile to determine the typical features of groups at high risk, as these risk features can serve as the basis of management in the workplace. Therefore, identification of the risk features and development of tools that can predict the risk of occupa- tional stress are needed to improve targeted prevention and intervention measures. Comparing the occupational stress level among different professions, scientific researchers (Kageyama et al. 2001), policemen (Queirés et al. 2020) and petroleum industry workers (Ning et al. 2020) would be considered as high-risk professions, especially medical workers (Lexén et al. 2020; Tsai and Liu 2012). Many studies have reported that medical workers have a high-to-moderate level of occupational stress (Chatzigianni et al. 2018; Kaburi et al. 2019; Nabirye et al. 2011; Tadesse et al. 2016). In the United States, the report of Exposure to Stress-Occupational Hazards in Hospitals by the National Institute for Occupational Safety and Health showed that the common stressors experienced by medical workers in hospital settings consist of inadequate staffing levels, long work hours, shift work, role ambiguity and expo- sure to infectious diseases (National Institute for Occupa- tional Safety and Health 2008). In the United Kingdom, a report indicated that higher staff turnover, more absence due to illness, decreased performance, and more complaints and grievances were signs of stress (Health and Safety 2019). The above-mentioned report showed that medical workers have a high level of occupational stress, and many countries have begun to give more attention to the prevention of occu- pational stress in hospitals. Previous studies on occupational stress have mainly referred to three aspects: the prevalence of stress in differ- ent occupations (Aratijo et al. 2020; Choy and Wong 2017; Cordioli et al. 2019; van der Wal et al. 2018), the associa- tions between stress and related diseases (Han et al. 2019; Sara et al. 2018; Yang et al. 2018) and stress interventions (Babanataj et al. 2019; Basu et al. 2017; Bresesti et al. 2020; Clough et al. 2017; Nowrouzi et al. 2015). These findings are insufficient to serve as the foundation for the development of targeted intervention strategies because we still lack effective methods of distinguishing subgroups with different levels of the risk of occupational stress, and management depends on understanding these subgroups. The demographic factors, occupational factors and health behaviour factors among medical workers who are at high risk for occupational stress need to be identified. Moreover, a predictive tool that can be used to evaluate the risk of occupational stress in the work force is needed. We believe that a stress nomogram would be a relatively better predictive tool for implementation in hospitals.",
    "The structure of work is changing at a rapid pace and the mismatch between workers and their work environments poses a threat to their health. In this study, we propose a new factor affecting occupational stress, namely worker-occu- pation fit (WOF). In our early pilot study, we constructed a theoretical model of the effects of WOF on occupational stress and related disorders (Sun 2020a). In addition, we also reported the association between WOF and occupational stress: a lower level of WOF was associated with a higher level of occupational stress, indicating that occupational stress has a strong negative correlation with the level of WOF (Sun 2020b). WOF was defined in accordance with the theoretical concept of occupational stress as the match between a worker's characteristics, needs, and abilities and the culture, supplies and demands of the occupational envi- ronment. There are three types of WOF: characteristic fit, need-supply fit and demand-ability fit. A WOF misfit can have negative effects on society and on the mental health, physical health or behaviour of workers. As a result, low- level WOF can increase the risk of occupational stress inci- dence. In this study, we expanded the sample size to explore whether a low-level WOF is a risk feature for occupational stress. The findings are expected to provide new avenues for research on occupational stress and stress prevention in hospitals. Nomograms, which are graphical illustrations of a mathe- matical model in which different factors are combined to pre- dict a definite endpoint, have been utilized as convenient and reliable tools for the prediction of the survival and mortality of cardiovascular disease and cancer patients (Caulfield et al. 2018; Jalali et al. 2019; Zi et al. 2020). Researchers have constructed nomograms for the prediction of depression and anxiety in cancer outpatients (Lima et al. 2016). Guo et al. developed and validated a prognostic nomogram and evalu- ated its discrimination ability to improve the prediction of 30-day survival among critically ill myocardial infarction (MI) patients (Guo et al. 2020). In that study, the nomogram exhibited reasonably accurate discrimination (AUC: 0.765, 95% CI 0.716—-0.814) and calibration (C-index: 0.758, 95% CI 0.712-0.804) in the validation cohort. In another study, Pan et al. constructed a predictive nomogram for mortality in patients with COVID-19, and the areas under the ROC curves for the nomogram were 0.988 (95% CI 0.972-1.000) and 0.956 (95% CI 0.874—1.000) in the primary and valida- tion groups, respectively (Pan et al. 2020). Nomograms have relatively better performance for the prediction of outcomes in patients with cardiovascular disease and cancer, and it is worthwhile exploring whether a nomogram can perform well with regard to identifying groups of medical workers at high risk for occupational stress. Currently, the occupa- tional stress scale is the major method used to assess whether workers are experiencing occupational stress. Workers who are identified as experiencing stress then directly enter the intervention stage. Because a nomogram could identify the high-risk group at an early stage, hospital administrators could implement control and intervention measures in a timely manner to prevent the occurrence of occupational stress. Thus, identifying the risk features for occupational stress in medical workers and being able to regularly screen workers could facilitate the early recognition of this prob- lem, which would support the prevention and treatment of occupational stress and improve the quality of health care Accordingly, this study aimed to identify and validate the risk features for occupational stress among medical workers based on a risk model and nomogram. The results may pro- vide evidence and technical support that can be used when implementing a model of hierarchical management for occu- pational stress in hospitals. From among the 1988 eligible participants, we ran- domly selected 80% of the subjects (n= 1568) as the train- ing set to establish the risk model and nomogram, and the remaining 20% of the subjects (n = 420) as the validation set to verify the risk model. The study flowchart is pre- sented in Fig. 1. This cross-sectional study was carried out from October 2019 to June 2020. A multicentre survey was conducted among medical workers from four targeted hospitals (1 gen- eral hospital and 3 specialized hospitals) in Henan, China. A three-section cross-sectional survey was administered by researchers and investigators to medical workers in the four targeted hospitals. The following survey instruments were used to collect data: The inclusion criteria were as follows: (1) individuals who had more than | year of work experience; (2) individu- als who had no family history of and were not taking medi- cations for a mental disorder; (3) individuals who were regu- lar employees of the targeted hospitals; and (4) individuals who were willing to participate in this survey. The exclusion criteria were as follows: (1) participants who were absent during the survey and (2) participants whose questionnaires were ineligible or were < 80% completed.",
    "There were 2050 medical workers in the surveyed hospi- tals. Nine participants did not agree to participate in the sur- vey, and 32 participants were absent from the hospital during the survey. A total of 2009 questionnaires were distributed, and 21 participants returned incomplete (< 80%) question- naires. Finally, 1988 questionnaires were considered valid, corresponding to a response rate of 97.0% (1988/2050). A self-administered basic information questionnaire was divided into demographic and occupational characteris- tics for each participant. The demographic characteristics included sex (male or female), age, marital status (single, cohabiting, married, divorced and living alone, widowed and living alone), children’s grade level (no children, infant stage, primary school, junior-senior high school, graduate school or higher), education (diploma or less, bachelor’s degree or higher), monthly income (< 3000 yuan, 3000-3999 yuan, 4000-4999 yuan, 5000-5999 yuan, > 6000 yuan) and whether the participant had a healthy lifestyle (e.g., exercise, smoking and drinking). The occupational characteristics included work experi- ence, department, professional title, night shift frequency and work hours. Occupational stress is defined as harmful physical and emotional responses that occur when the requirements of a job do not match the capabilities, resources or needs of the worker (National Institute for Occupational Safety and Health 1999). Occupational stress was measured with the Depression, Anxiety and Stress Scale (DASS-21), which was developed by Lovibond (Lovibond and Lovibond 1995) and has been proven to be a valid measure for the assessment of occupational stress in the Chinese population (Lu et al. 2018). Furthermore, we emphasized that each response to stress was related to occupational features in hospitals. In this study, we used the stress subscale (seven items: 1, 6, 8, 11, 12, 14 and 18) from the DASS-21. Each item was scored from 0 (it does not apply to me at all in the last week) to 3 (it applies to me perfectly in the last week). The DASS-21 score was multiplied by two to calculate the final subscale score, yielding a maximum of 42 points (Lovibond and Lovibond 1995). Participants with a total score from 0 to 14 were con- sidered to have a normal level of stress, those with scores from 15 to 18 were considered to have mild stress, those with scores from 19 to 25 were considered to have moderate stress, and those with scores greater than 26 were considered to have severe stress (Lovibond and Lovibond 1995). WOF is an important factor to consider in the assessment of occupational stress, but it is still neglected in occupa- tional stress research. The Worker-Occupation Fit Inventory (WOFID was based on the questionnaire by Cable and DeRue (Cable and DeRue 2002), with some items and descriptions adapted for the Chinese culture and way of thinking to facilitate its suitability for Chinese participants. The WOFI consists of three sections with a total of 9 items: (1) char- acteristic fit, for example, “Do you think your job style fits your job?”; (2) need-supply fit, for example, “Do you think the job provides what you need?”; and (3) demand-ability fit, for example, “Do you think that your educational back- ground meets the job demands?”. Each item is rated on a 5-point Likert-like scale (1 =extremely poor fit, 2 =poor fit, 3 = general fit, 4= good fit, 5=extremely good fit), and the total score is the sum of the scores for the 9 items, ranging from 9 to 45 points. The higher the score is, the better the WOF. The WOFI showed satisfactory internal consistency (Cronbach's a =0.888). The items used in this section of the survey are described in Table S1. (%) and were compared via chi-square analysis. In this study, we constructed a risk model for occupational stress using a training set, with a binary outcome (“0” indicated an occu- pational stress score < 14, and “1” indicated an occupational stress score > 15) included in the multiple logistic regres- sion model, and those variables (including sex, age, marital status, children’s grade level, education, monthly income, exercise, smoking, drinking, work experience, department, professional title, night shift frequency and work hours) with statistical significance in the univariate analysis were ulti- mately included in the multiple logistic regression model. The incidence risk of occupational stress was expressed as odds ratios (ORs) and 95% confidence intervals (95% CIs). Based on the risk model, a nomogram was constructed using R software with the rms package. The discriminatory ability of the model was quantified using the area under the ROC curve (AUC) for internal validation and external validation. Accuracy and the ROC curve were used to reflect the per- formance of the selected predictors. The calibration of the nomogram was assessed by plotting the observed outcome probabilities and the probabilities predicted by the logistic model in the training set and validation set. Based on the risk model for occupational stress, we calculated the prevalence and used calibration plots to assess the effectiveness of the models at different levels of risk. A two-tailed P value <0.05 was considered statistically significant. All the above pro- cesses were performed using R software (version 4.0.2).",
    "The respondents’ demographics and occupational charac- teristics are shown in Table 1. Among the entire sample of 1988 participants, the mean age was 32.7 (SD =7.8) years, with 214 (7.7%) males and 1774 (92.3%) females. The mean WOF score was 34.3 (SD=6.1). A total of 26.4% (n=525) of the respondents were physicians, and 73.6% were nurses. The majority of the participants had a bachelor’s degree (n= 1519, 76.4%) or higher. A total of 10.8% (n=214) of the participants reported working a>60-h work week, and a monthly night shift frequency >6 (n=928, 46.7%) was the most common. Of the 1988 medical workers, 42.5% (n=845) experienced mild to severe levels of occupational stress. A total of 17.8% (n= 355) of the medical workers had mild stress, 15.1% (n= 300) had a moderate level of stress, and 9.6% (n= 190) had a severe level of stress (Fig. 2). professional title (47.9%, n=286), worked more than 6 night shifts per month (47.0%, n=340), worked more than 60 h per week (55.3%, n=94) and had a WOFI score of 30-34 points (60.1%, n=179). All differences were significant (chi-square test, P<0.05). In the validation set, occupational stress did not differ among subgroups stratified by sex, age, marital status, education, income, smoking, drinking, pro- fessional title, night shifts and work hours (chi-square test, P>0.05). Table 2 shows the incidence of occupational stress in sub- groups with different characteristics in the training set (n= 1568) and the validation set (1 =420). In the training set, occupational stress significantly differed among subgroups with different characteristics (P <0.05). Higher detection rates of occupational stress were observed in participants who were males (53.8%, n=91), were nurses (47.1%, n=549), were aged 30-34 years (52.6%, n=247), were widowed and living alone (87.5%, n=7), had a bachelor’s degree or higher (44.7%, n=529), did not exercise (50.5%, n=462), smoked (63.6%, n=49), drank (55.6%, n=74), had a monthly income greater than 6000 yuan (46.9%, n=76), had worked for 11-19 years (49.1%, n=200), worked in a psychiatry department (49.5%, n= 103), had an intermediate In the Table 3, multiple logistic regression was used to con- struct the risk model of occupational stress. Six variables were included in the final risk model for occupational stress (Table 3). A high WOF was associated with a decreased risk of occupational stress (P<0.01). The variables were male sex (OR=2.10, 95% CI 1.431-3.091), nurse popu- lation (OR = 6.04, 95% CI 4.043-9.031), lack of exercise (OR =2.02, 95% CI 1.594—-2.549), traumatic event experi- ence (OR=2.10, 95% CI 1.623-2.730), work experience duration of 1-3 years (OR= 1.71, 95% CI 0.958 — 3.032), work experience duration of 4-10 years (OR =2.97, 95% CI 1.707-4.892), work experience duration of 11-19 years (OR=3.61, 95% CI 2.104—6.322) and work experience dura- tion of more than 20 years (OR =3.45, 95% CI 1.932-6.732), which were all associated with an increased risk of occupa- tional stress (all P<0.05). Table 4 shows the risk features for occupational stress in the risk model. Based on the risk model, the subgroup with the highest probability of occupational stress would be the high-risk features. The features included: (1) a WOF Table 2 Comparison of . occupational stress among 1988 medical workers with different characteristics in the training and validation sets The number indicates the number of individuals with occupational stress; the % indicates the incidence rate of occupational stress. “P value was analysed by the chi-square test, with significance defined at <0.05 score less than 25 points, which was associated with an expected risk probability of occupational stress of 77.3%; (2) nursing as an occupation, which was associated with an expected risk probability of occupational stress of 63.1%, (3) male sex, which was associated with an expected prob- ability of occupational stress of 67.2%; (4) work experience duration from 11 to 19 years, which was associated with an expected risk probability of occupational stress of 54.5%, (5) the experience of traumatic events within the previous year, which was associated with an expected risk probability of occupational stress of 65.3%, and (6) no habit of regular exercise, which was associated with an expected risk prob- ability of occupational stress of 60.2%. For medical workers with all these risk features, the expected risk probability of occupational stress would be 90.2%.",
    "exercise, experience of traumatic events, work experience and WOF). Internal validation and external validation showed that the final risk model had excellent discrimina- tory ability, with AUCs of 0.747 (95% CI 0.723-0.772) and 0.799 (95% CI 0.756-0.841), respectively (Fig. 4). Figure 5 shows the calibration curves indicating the performance of the model in the validation cohort. The model had excellent predictive performance throughout the range of predicted risks and was accurate through a range of predicted probabilities of occupational stress from 25% to approximately 70% in the training set. The calibration curve in the validation set showed a greater deviation than that in the training cohort because of the small sample size. Based on the risk model for occupational stress, a nomogram was developed (Fig. 3). The included vari- ables were the six identified variables (sex, occupation, To ensure the practical applicability of the risk model, a cut-off point of 56.4% was established based on the maxi- mum Youden index and was used to stratify medical workers into high- and low-risk groups. The sensitivity at the cut-off In this study, we established a risk model and nomogram for occupational stress. We used the training set for internal validation and the validation set for external validation, and both showed good discriminative ability of the model, with AUCs of 0.747 and 0.799, respectively. The high-risk fea- tures for occupational stress were identified. A total WOF score less than 25 points was associated with an expected risk probability of individuals with occupational stress of 77.3%. The expected risk probability of nurses with occu- pational stress was 61.3%, which was higher than the risk of physicians. Among medical workers who had worked for 11-19 years, the risk with occupational stress was 54.5%, which was higher than the risks among groups with other levels of work experience. The traumatic events experienced was associated with an expected risk probability of occu- pational stress of 65.3%. The risk of medical workers with occupational stress was higher in the subgroup that did not regularly exercise (expected risk: 60.2%) than in the other groups. In a group of workers with all the identified risk fea- tures, the expected risk probability with occupational stress incidence would be 90.2%. In our study, among the 1988 medical workers surveyed, the prevalence of occupational stress was 42.5% (n= 845), and 9.6% (n= 190) of the participants had a severe level of occu- pational stress. These results indicate that medical workers have substantial responsibilities and experience high levels of demands and overwork, predisposing them to have a high risk of occupational stress (Xu and Hu 2020; Jerg-Bretzke et al. 2020; Li et al. 2019). We found that the lower the WOF level was, the higher the risk of occupational stress in the study. WOF is an ignored risk factor for occupational stress, which is rarely mentioned Fig. 3 Nomogram used to predict the probability of occupational stress among medical workers. WOF worker- occupation fit. The seventh row (points) indicates the points that are assigned to each variable in rows 1-6, which are the varia- bles that are included in the risk model. The assigned points for all variables are then summed, and the total value is shown as the total score. Once the total score is located, a vertical line is drawn down to the bottom line to obtain the predicted probabil- ity of occupational stress in the study of occupational stress. Our results indicated that when the WOF score was less than 25 points was associated with an expected risk probability of individuals with occu- pational stress of 77.3%. The results suggested that a strong fit between workers and their occupational environment is a protective factor against occupational stress. The WOF score was less than 25 points can be used as an indicator to iden- tify medical workers who are at high risk of occupational stress. Before the allocation of medical workers to certain departments, hospital administrators could consider whether the workers’ characteristics, abilities and needs are a good fit with the occupational environments’ demands and supplies. Using the strength of the fit to predict the risk of occupa- tional stress incidence would not only protect the occupa- tional health of each worker but also prevent a reduction in the quality of medical services provided. Furthermore, increasing the level of WOF when medical workers experi- ence a high level of occupational stress would be a good way to resolve the problem.",
    "is eager to seek promotions or increase their monthly income (Ta et al. 2018). Medical workers who have worked more than 20 years, however, have a reduced physical ability to perform healthcare services, and work fatigue may lead to occupational stress. The demographic and occupation features included male sex, being a nurse, and work experience. Regarding to Male sex, the risk of occupational stress among male medical workers (expected risk: 67.2%) was higher than that among female medical workers. Previous studies reported that males were likely to suffer from occupational stress (Davey et al. 2014; Faraji et al. 2019). This could be due to males are likely to assume more social or family responsibilities in tradi- tional Asian cultures, and the managers of hospitals tend to assign physical work to male medical workers. Regard- ing to be nurses, nurses always reported the highest level of occupational stress due to their heavy workload (Sandrin et al. 2019), reduced social support (Ma et al. 2020), staff shortages (Baye et al. 2020), and decreased amount of time to perform their work duties (Salilih and Abajobir 2014). As a result, the level of occupational stress was higher in nurses than in physicians, and the level of empowerment was lower in nurses than in physicians. Regarding to work experience, the work experience and occupation categories were contributors to the risk of occupational stress. In the risk model, medical workers with 4-9 years of work experi- ence had a higher risk probability of occupational stress than the other groups. This group of medical workers, namely, medical workers and intermediate medical Exercising, drinking and smoking habits reflect whether people engage in healthy behaviours. This study showed that the risk of occupational stress incidence among medical workers who did not regular exercise (expected risk: 60.2%) and therefore had an unhealthy lifestyle was higher than that among medical workers who regular exercised. There is evi- dence that exercise is beneficial for mental health and can reduce the risk of mental illness (Rosenbaum et al. 2014). Chou et al. suggested that physical inactivity is the only sig- nificant factor correlated with occupational stress, and regu- lar exercise could help medical workers resolve occupational stress (Chou et al. 2016). Soteriades and colleagues showed that every hour per week of physical activity performed by participants was associated with a 16% lower risk of occu- pational stress (Soteriades et al. 2019). This conclusion sup- port for our results that obtained in this study. Exercise may be an effective approach to coping with occupational stress (Callaghan 2004). Consuelo Arbona et al. found that drink- ing was a strong risk factor for occupational stress in black firefighters. But in our study, drinking and smoking were not significantly associated with the risk of occupational stress. The reasons may include the following: (1) Firefighters are more often male, while physicians and nurses are more often female in China, and the proportion of those who smoke and drink is relatively small. (2) Medical workers are awareness of the harmful effects of smoking and drinking, so they con- sciously avoid such unhealthy lifestyle behaviours. The results also indicated that exposure to traumatic event as a risk feature of occupational stress. Exposure to trau- matic events in the workplace is common, and traumatic events may result in psychosomatic disorders (Lee et al. 2020). In our study, the results showed that the medical workers who had experienced traumatic events the expected risk of developed occupational stress was 65.3%. Studies on traumatic events have more often focused on firefight- ers (LaRocca et al. 2020). In South Korea, a nationwide, population-based survey of all employed firefighters found that the rate of PTSD was estimated to be 5.4% (Kim et al. 2018). Additionally, a cross-sectional survey in Australia indicated that the rates of PTSD and depression in current and retired firefighters were 8% and 5%, respectively (Jahnke et al. 2016). Both firefighters and medical workers have obvious occupational characteristics and are professionals at high risk for occupational stress. Firefighters and medical workers both experience higher demands at work than other professionals, and they may have experienced stressors such as continuously being at risk of dying. These results and the findings of studies on firefighters indicate that it would be beneficial for managers to look for signs that a nurse or physician may be experiencing occupational stress. We suggest that hospital managers assess occupational stress in workers who have experienced a traumatic event on a regular basis. In addition, psychological training to improve situ- ational awareness and professional adaptability is needed for medical workers, as are interventions to help them overcome psychological crises or negative emotions.",
    "Nomograms have been widely used in clinical practice, especially for cancer, and have been found to have excel- lent predictive performance (Jiang et al. 2017; Kazushige et al. 2015). Currently, the measurement of occupational stress is based on a questionnaire survey that estimates the level of stress in an occupational group. Conducting such a survey requires the commitment of time, labour and material resources by professional survey administrators or research- ers. The proposed nomogram for occupational stress is convenient for use by managers in hospitals; alternatively, it could be used for self-assessment. Our results showed that the cut-off point for the identification of a high risk of occupational stress is the expected risk was 56.4% by risk model. In a future study, we can explore the risk probabil- ity stratified by different characteristics in other professions and collect data on medical workers’ risk probability using the nomogram, with the probability considered a variable related to occupational stress. Some limitations of this study should be noted. The cross- sectional design of this study limits its ability to confirm causal relationships among the variables that were investi- gated. Thus, the present study results should be interpreted cautiously, and future research using longitudinal and exper- imental designs is needed to clarify the direction of any causal relationships among the observed variables. Despite the limitations of our study, these findings contribute signifi- cantly to application-oriented research and provide practical support for the management and prevention of occupational stress in medical workers. In this study, 42.5% (845/1988) of the medical workers expe- rienced occupational stress. Having a poor WOF (WOFI score < 25), being male, being a nurse, having more work experience (11-19 years), experiencing traumatic events and without regular exercise habit were risk features for occupational stress. The identification of risk features and the development of a nomogram are valuable for enhancing application-oriented research and exploring ways to provide practice support to enable the targeted prevention of occu- pational stress in hospitals. Moreover, self-assessment with nomograms can also improve awareness of occupational stress in those performing routine work duties. Acknowledgements The authors are grateful to the hospitals and administrators for supporting this study and thank the medical work- ers from the hospital for their participation. Author contributions Study design, data analysis, data interpreta- tion and finished the manuscript: RCS. Data acquisition: RCS, CLZ. Data analysis: RCS, KYL. Study design and supervision of study: YJL. All authors have read and agreed to the published version of the manuscript. Funding This study was funded by the National Natural Science Foun- dation of China (Grant Number: 82073521). The funders have no role in the analysis, or interpretation of the data, writing of the article, or the decision to submit the paper for publication. Availability of data and material All of the research materials are in the manuscript and request for the datasets are available from the Conflicts of interest The authors have no conflicts of interest to declare that are relevant to the content of this article. Ethics approval This study was approved by the Ethics Committees of West China School of Public Health and West China Fourth Hospital (No. HXSY-EC-2020089). The study was performed in accordance with the ethical standards of the Declaration of Helsinki."
]