[
    "Research on the New Mode of Village-Enterprise Joint Venture to Provide for the Elderly in the Countryside Under the Background of Rural Revitalization - a Case Study of Taishan Village in Henan Province Abstract: Along with our country enters the stage of population aging, the treatment of old-age problems becomes an important topic. In this social environment, Taishan Village in Henan province, taking rural revitalization as the starting point and village collectives and enterprises as the hub, has created a new mode of village-enterprise joint venture to the countryside. Therefore, the study of Taishan Village can provide reference for the future pension model of our country, and provide new ideas for rural revitalization. What is going to the countryside for the elderly? As the name suggests, it is the old people in the city go to the countryside for retirement life. This model is put forward under the background of aging, and is organically combined with rural revitalization. Here, the elderly can also have a good nursing experience. In the rural development mode, there are three types: village collective self-development, social capital leveraged development and vil- lage collective and social capital joint operation. In most villages, their type of development is the first two, relying on themselves or with the help of external forces, themselves or enterprises occupy the dominant control position, leading the whole development. But village collective and social capital joint management is different from the first two. Taishan Village was originally a village with remote geographical environ- ment, inconvenient transportation, low per capita income and backward development level. After the continuous implementation of the rural revitalization strategy, the economy has been developed. Now it has become a demonstration village of rural revitalization in Henan Province, and has won the titles of \"National One Village and one product Demonstration Village\", \"National Ecological Culture Village\", and \"Key Vil- lage of Rural Tourism in China\". The \"White Paper on the Development Trend of China's home-based Care\" report mentions that China's population aging problem is se- rious, and there are characteristics such as large elderly population, rapid aging process, obvious urban-rural differences, and improved quality of the elderly population. With the passage of time, the pension problem is becoming more and more serious, and the aging degree will con- tinue to deepen. At present, the present situation of pension in our country mainly includes: According to the seventh national census, there are 264.02 million people aged 60 and above in China, accounting for the total population, It is estimated that by 2030, it will enter a super-aging society with a proportion of more than 20%. Even though the elderly population in our country is large, the elderly institutions can not meet their needs by far. By 2022, there will be 360, 000 institutions and facilities for the elderly, with 8.126 million beds. This means that the number of beds in nursing institutions in China is less than 4% of the elderly population. Because there is no unified management of the elderly care service industry, there is no appropriate standard, which makes some eld- erly care institutions and facilities, The service level of Shi is not high, and the life of the elderly here is not as happy as they imagined. Even in some institutions with chaotic and irregular management, it also brings troubles and problems to the elderly. The uneven level of service makes it difficult to plan for the elderly, and it is not easy to implement various pension policies, which brings certain obstacles to the realiza- tion of the goal of creating a better life for the elderly. According to the data, the general elderly care institutions charge more than 3, 000 yuan, which can provide basic food and clothing for the elderly Fine. For some elderly people with post-illness care, special care and other needs, the charge is higher, generally more than 10, 000 yuan. If it is home care, taken care of by the family, the cost is not low, also about 6, 000 yuan. China's elderly care industry has developed so far, forming a relatively complete system. However, the current mainstream pension models in society are mainly family pension, community pension and institutional pension, and other pension models have not been widely accepted and applied.",
    "As the name suggests, family care means that the elderly care for the elderly directly at home, and the family is responsible for the care of their daily life in their old age. In the family, the elderly can feel the warmth from their children, and can get along with their children for a longer time. Moreover, the family environment is very familiar, relatively speaking, their own life is more comfortable, less constrained place. In the family pension, chil- dren are more at ease. Because they are responsible for the lives of the elderly, they are more familiar with the situation, and their own care is more in place. However, for some families with great support pressure, it may not be realistic to carry out family pension. On the one hand, they have to take care of their children's lives and take care of the daily cooking of the elderly, which may not be feasible in time. Community aged care is developed with the help of community relations. Build a community for old people to live in. In community There are many elderly people with pension needs. Therefore, in this environment with boundaries, these elderly people naturally form friends with each other. They can meet daily, chat together, and share the details of life. In the community, older people find others to connect with, without the barriers and barriers to communication with the younger genera- tion. In the process of communication with their peers, their emotional needs are satisfied and psychological pressure is released to a certain extent. Simply put, the community is a bond that connects the elderly. Institutional pension is also the mode that most people will choose. In institutions, because there are formal retirement procedures and procedures, The quality of its elderly care is still guaranteed. At the same time, agreements and contracts are signed, so that the responsibilities are clear, and there are plans for various problems that may arise. Whether it is the family or the organization, it is more at ease. As can be seen from the above, although the mainstream pension model is recognized by many people, there are also some problems, which cause that not everyone can apply the above pension model. Therefore, more and new pension models are needed to meet the diversi- fied needs of the elderly. As a new pension model, the rural pension has the advantages and benefits of other pension models, which provides corresponding con- ditions for the rural pension to be applied and continuously improved, and can promote the better development of the rural pension. Taishan Village in Henan Province can take rural development as the core, combine its own resources and practical needs, and build old- age care projects in rural areas and enterprises. In terms of resource margin, rural areas have more adequate basic resources than urban areas. Especially land, an important resource. With the continuous expansion of cities and the gradual improvement of urbanization level, the personnel gap in rural areas has gradu- ally become larger. Most young people choose to live in the city and rarely consider going back to the countryside to work in their hometown and contribute to the construction of their hometown. Although the rural pension has many advantages worth us to develop this new model, but in terms of the current rural infrastructure and industrial development, there are still some problems in the implementation of the rural pension, the model can be widely cited and is restricted by some factors, it is not good to achieve the expected results of the project, promote rural development and alleviate the role of pension. A big problem to be solved is the health problem of the elderly, to ensure that the elderly are healthy or can be Effective detection and control of their diseases, through taking drugs and related care to control, as far as possible to reduce the negative effects of physical diseases. However, in rural areas, the level of medical care is limited because the medical system is not as complete and developed as in cities. At present, the infrastructure construction of elderly care services in some rural areas has not yet been perfected. Although the govern- ment and society have given great support to the countryside, there are big problems in the layout of rural infrastructure, and the construction quality is not high.",
    "As mentioned above, the level of medical care in the countryside is an important factor affecting the elderly care in the countryside. Therefore, in the process of service for the elderly in the countryside, we should deepen the combination of medical care and support to meet the medical needs of the elderly. We can start from these aspects. First, improve the construction of corresponding medical facilities, including clinics, hospitals, and the introduction of corresponding drugs, invest enough elderly nursing equipment, and improve the local medical level. The second is to actively introduce doctors and personnel with a certain level, improve the diagnostic ability of various diseases, and reduce the number of elderly people who go to the city because of illness. The mode of going to the countryside for the elderly jointly created by village enterprises not only requires the management of village collectives, but also depends on social enterprises and capital. To solve the backwardness of infrastructure construction in rural areas, it is far from enough to rely only on government and local fiscal expenditure. Even if the new mode of going to the countryside for the elderly jointly created by village enterprises still has many shortcomings, there are still many problems to overcome. But we should have great expectations, the rural pension will continue to improve, in order to give the elderly a better pension experience."
]