[
    "The Belt and Road Initiative is a long-term foreign development strategy that China adheres to. However, the key to the promotion of the Belt and Road is the investment of a large number of high-quality international talents. In order to promote international talents to go abroad, it is not only necessary to deepen the system level and multilateral cooperation at the diplomatic level, but also to cultivate human resources with the willingness and ability to move internationally to make full use of their capabilities. From the perspective of the TPB model, this paper adopts the method of structural equation model, and takes an application-oriented university in Henan Province, China as the research object, to explore the influencing factors of overseas internship, employment and further study for college students. The results show that attitudes, subjective norms and perceived behavioural control all have significant effects on behavioural intention. Usefulness had no significant effect on behavioural intention; Usefulness has a significant effect on behavioural intention through attitude. Therefore, according to the conclusion, relevant suggestions are put forward for schools, teachers and students respectively. Since The Belt and Road Initiative (BRI) was proposed by General Secretary Xi Jinping in 2013, it has become China's long-term foreign development strategy. However, the key to the promotion of BRI lies in the investment of many high-quality international talents. As universities are the main position of cultivating international talents, the BRI strategy has endowed universities with the glorious mission of cultivating international talents. Sun (2020) believed that the economic Factors Affecting Overseas Internship, Employment and Further Education under the Background of “Belt and Road Initiative” – A TPB Model Analysis The academic research on international talent training began in the late 1980s and has experienced two high tides. The time nodes are China's accession to the WTO and the proposal of the BRI strategy. The research literature reached its peak in 2002, and the BRI strategy was proposed in 2013. Since then, the research literature has been increasing year by year. After 30 years of development, the research results of international talent training have changed from simple research and introduction of developed countries' training models to research on attracting international talents back to China. However, in general, the results of research on international talents are less than those on general talent training. There are too many theories and too few practices in international talents training, especially quantitative empirical research on specific universities. In order to cultivate more high-quality international talents, various universities and colleges have issued many policies, especially an application-oriented university in Henan Province. However, students do not respond strongly, and the effect is not good. What is the problem? Most studies on adoption behaviour are based on the Theory of Planned Behaviour (TPB), and the TPB is mainly used to predict and understand human behaviours. Based on the TPB, this study tries to find the difficulties and influencing factors of students in overseas internship, employment and further education and identify causes and countermeasures. Therefore, this study, taking an applied university in Henan province as an example and based on the TPB model, proposed the influence model of students' overseas internship, employment, and further education (OIEFE), and discussed the difficulties and influencing factors of students' OIEFE, and put forward relevant suggestions according to the influencing factors. Hope to provide reference for international talents training. Most studies on adoption behaviour are based on the Theory of Planned Behaviour (TPB), which was proposed by Ajzen (1985). Evolved from the Theory of Reasoned Action (TRA) proposed by Fishbein and Ajzen (1975), TRA is mainly used to predict and understand human behaviours. According to TPB, attitudes, subjective norms and perception of behavioural control jointly determine an individual's behavioural intention. In the way of action, behavioural intention determines individual behaviour, and behavioural intention is determined by attitude, subjective norm and perceived behavioural control. Therefore, if the individual holds a positive attitude towards a particular behaviour, the more the subjective norms support the behaviour, and the stronger the perceived behaviour control of the behaviour, the individual's intention to engage in the behaviour will also be higher. Based on the theory of planned behaviour, Gong (2021) examined the formation mechanism of entrepreneurial intention of local college students. Wang (2016) used TPB research to investigate and think about the intention of contemporary college students to study abroad. Liu (2017) also used TPB to explore the current situation and influencing factors of college students' intention to start-up businesses.",
    "Attitude (ATT) refers to the positive or negative evaluation of a particular behaviour held by an individual. The more positive an individual's attitude toward a particular behaviour is, the higher his or her behavioural intention will be. If the trend is more negative, the behavioural intention will be lower. Studies conducted by Rong (2014) and Tao (2012) on cross-cultural adaptation of Chinese interns in the United States both confirm that there is a positive relationship between individual attitudes and behavioural intentions. Therefore, if college students hold more positive comments on overseas internship, employment and further study, their willingness to participate will be stronger. The Subjective Norm (SN) refers to the social pressure an individual feels when taking a particular action, i.e., the pressure he or she feels from significant others or groups (e.g., parents, spouse, friends, colleagues, etc.) to consider whether or not he or she should take the particular action. The stronger the positive subjective norm is, the easier it is to induce the behavioural intention to engage in the behaviour. Xing (2012) confirmed that subjective norms have a positive and significant impact on behavioural intention in the study of college students' employment from the perspective of contemporary China's economic structure. Therefore, the greater the social pressure (subjective norms) college students feel for overseas internship, employment and further study, the stronger their willingness to participate will be. Perceived Behavioural Control (PBC) refers to an individual's Perceived ability to control the resources and opportunities required to perform a particular behaviour. In addition, the limitations of behavioural control perception can be divided into self-efficacy and external resources. Among them, the former refers to the cognition of one's ability to complete the behaviour, while the latter refers to the availability and obstruction of the resources available to the individual, both of which may affect the individual's decision to adopt a certain behaviour. In many studies, especially in the study on self-funded study abroad in China, the effect of perceived behavioural control on behavioural intention has been found (Zhan, 2017). Therefore, if college students are more aware of whether they can complete overseas internship, employment and further study and the availability of available resources is greater, their willingness to participate will be stronger. Factors Affecting Overseas Internship, Employment and Further Education under the Background of “Belt and Road Initiative” – A TPB Model Analysis Behaviour Intention (INT) refers to the tendency and degree of an individual to engage in a specific behaviour, namely, the psychological intensity of whether an individual will act in the decision process of behaviour choice. Guo (2020) and Wang (2015) all confirmed in their studies that there is a positive relationship between individual behavioural intention and behaviour. Therefore, the greater the behavioural intention of college students to complete overseas internship, employment and further study, the stronger their willingness to participate will be. Perceived Usefulness (PU) affects attitudes, and the stronger perceived usefulness, the stronger the attitude. Kuang (2018) confirmed that perceived usefulness has a positive impact on attitude in the research and analysis of Chinese senior high school students' overseas higher education demands. Zhang et al. (2012) confirmed that perceived usefulness has a positive and significant impact on behavioural intention in the study on influencing factors of users' acceptance behaviour in college employment information system. Therefore, the higher the usefulness of overseas internship, employment and further study is, the more college students' attitudes toward participation will be increased and their behavioural intention to participate will be enhanced. The questionnaire is divided into three parts: The first part is information introduction, which briefly introduces the purpose of the questionnaire; The second part is about the influencing factors of college students' overseas internship, employment and study abroad intention, which can be divided into five dimensions, namely perceived usefulness, behavioural attitude, subjective norms, perceived behavioural control and behavioural intention. The third part is the basic personal information, including the gender, major, grade, experience, family income and other information of the respondents. The second part of the questionnaire was designed using a seven-level Likert scale, with \"1\" indicating strongly disagree and \"7\" indicating strongly agree. After the completion of the questionnaire design, industry experts and scholars will review, and gradually modify to improve. The final questionnaire includes 5 dimensions, 29 measurement indicators.",
    "This study takes college students from an application-oriented university in Henan, China as the research object. The total number of students at the school in 2021 was 28,000, which is the total for this survey. After the sample size calculator provided by The Survey System website was used to calculate the required sample number: confidence level was 95%, confidence interval was 5, sample size needed was 379. The school was taken as the cluster sampling unit and the required sample number was allocated to 18 departments. From March 10 to April 29, 2020, the questionnaire will be sent to the secretary of the Youth League Committee and counsellors of the Factors Affecting Overseas Internship, Employment and Further Education under the Background of “Belt and Road Initiative” – A TPB Model Analysis second-level colleges through the questionnaire star, and the questionnaire link or two-dimensional code will be sent to the students of the second-level colleges to collect data in the form of the network. A total of 772 questionnaires were completed, excluding 73 incomplete questionnaires and the same answer options. In the end, 699 questionnaires were effectively collected with a recovery rate of 90.5%. In this study, SPSS and structural equation model (SEM) were used for analysis. The analysis consists of three parts :1. Descriptive statistics to analyse the mean value and variance of perceived usefulness, behavioural attitude, subjective norms, perceived behavioural control, and behavioural intention variables; 2. Measurement model: Analysis of convergent validity and discriminant validity of each dimension; 3. Structural model: Understand the significance of independent variables to dependent variables and test five hypotheses. In addition, the model compatibility index is also provided to judge the quality of the model. According to the frequency table in Table 1, the basic data of this research includes six contents: gender, grade, secondary department, family annual income, whether parents have overseas experience, and whether they have overseas experience. In the statistics of gender, the majority of women (541, accounting for 77.4%); In the grade, the number of students in the second year is the largest (335 students, accounting for 47.93%); According to the data of the secondary departments, the college of Humanities and The College of Foreign Languages accounted for the majority of students (491, or 70.24%); In terms of annual family income, the largest number of students (327, accounting for 46.78%) are under 50,000. In the data of overseas experience, about 95 percent of parents or students have no overseas experience. Itemized questions to provide in Table 2 below for each variable. The mean value of the descriptive statistical analysis table of 699 valid questionnaires in this survey is between 3.46 and 5.98, as can be seen from Table 3 below: Respondents most agree that \"PU4: Overseas employment and further study can improve my knowledge structure and broaden my international vision\", but less agree to \"PU5: Overseas employment and further study can help me reflect my identity and status\". To \"ATT3: Working abroad and studying abroad is a wise decision.\" Low level of recognition. The interviewees have the time and energy to go overseas for employment and further study, but they lack the knowledge, experience and resources required by overseas employment and further \"SN1: Overseas employment and further study will be affected by parents' support or not. \"SN2: Overseas employment and further study will be influenced by teachers' encouragement or not\" has a high degree of recognition, and will be influenced by parents and teachers. Factors Affecting Overseas Internship, Employment and Further Education under the Background of “Belt and Road Initiative” – A TPB Model Analysis In addition, respondents to the \"INT2: If there is a chance, I will try to go overseas to work and study.\" The degree of recognition is higher and the behavioural intention is stronger. Factors Affecting Overseas Internship, Employment and Further Education under the Background of “Belt and Road Initiative” – A TPB Model Analysis According to the suggestions of Anderson and Gerbing (1988), a complete Structural Equation Model (SEM) must pass the test of the measurement Model before a complete SEM model analysis can be performed. According to the standards of scholars Hair et al. (1998) and Fornell and Larcker (1981), Standardized factor loading of each indicator variable should be greater than 0.50 at least. Composite reliability should be greater than 0.60, and average variance extracted should be higher than 0.50, indicating that the measurement model has good convergence validity.",
    "In this study, the maximum likelihood method was used to estimate the measurement model, and the estimated parameters included factor load, multivariate correlation square, composite reliability and mean variance extraction. As shown in Table 4 below, the standardized factor load was between 0.67 and 0.89, the synthesis reliability of the studied dimension was between 0.86 and 0.93, and the average variance extraction amount was between 0.56 and 0.74, all above 0.5, all in line with Hair et al. (1998). The standards of Fornell and Larcker (1981) show that each dimension has good convergence validity. In this study, the rigorous AVE method was used to test the discriminant validity. According to the suggestions of Fornell and Larcker (1981), the discriminant validity should consider the relationship between convergence validity and the correlation between dimensions at the same time. Therefore, it is suggested that the AVE square root of each dimension must be greater than the Factors Affecting Overseas Internship, Employment and Further Education under the Background of “Belt and Road Initiative” – A TPB Model Analysis correlation coefficient between dimensions. Meeting this condition indicates that the model in this study has discriminant validity. As shown in Table 5 below, the ROOT mean square (RMS) of AVE for each dimension of most diagonal lines in this study is greater than the correlation coefficient outside the diagonal line, so most of the dimensions in this study have good discriminant validity and still belong to the acceptable range. Notes: The items on the diagonal on bold represent the square roots of the AVE; off-diagonal elements are the correlation estimates. According to Jackson et al. (2009), the most widely used nine fitness indexes in SSCI international journals are shown in Table 6 below: SRMR = 0.06; RMSEA = 0.07; GFI = 0.90; TLI = 0.89. After testing, most of the observed variables are in line with the allowable range, and the theoretical model fits well with the actual observed data, which can further verify the research hypothesis. The results of path coefficients can be seen from Table 7 and Figure 2 below: Perceived usefulness (β=0.87, P&LT; 0.001) significantly affects behavioural attitude (ATT). Behavioural attitude (ATT) (β=0.48, P&LT; 0.001), the subjective norm (SN) (beta = 0.10, p = 0.010), and perceived The research results support the research problems of this model. The explanatory power (R2) of perceived usefulness (PU) to ATT was 76%. The explanatory power (R2) of perceived usefulness (PU), behavioural attitude (ATT), subjective norm (SN) and perceived behavioural control (PBC) to explanatory behavioural intention (INT) was 61%. Factors Affecting Overseas Internship, Employment and Further Education under the Background of “Belt and Road Initiative” – A TPB Model Analysis If a variable (Me) is an independent variable (X) and a dependent variable (Y) at the same time, that is, (X) influences (Y) through (Me), the analysis methods of mediation effect include: causal step mediation effect test, indirect effect coefficient product test, indirect effect self-help test. Some studies on indirect effects point out that bootstrapping has more statistical testing power than causality method and coefficient product method (MacKinnon et al., 2004). According to the indirect effect analysis table of the mediation model in Table 8 below, in the indirect effect of PU→ATT→INT, p < 0.05, Z value > 1.96, and the confidence interval does not include 0[0.25 to 0.53], indicating that the indirect effect is valid. In the direct effect of PU→INT, its P > 0.05, Z value < 1.96, and this confidence interval contains 0[-0.14 to 0.13], indicating that the direct effect is not valid. The results of mediation effect analysis represent that ATT is fully mediated. The results of this study reveal the difficulties and influencing factors of college students' OIEFE, and provide a basis for colleges and universities to promote international talents. It is expected that colleges and universities can provide better help to college students. It can be seen from this study and past literature that the more positive the attitude of college students towards overseas employment or further study, the higher the behavioural intention. The results of this study show that parents' economic support and teachers' spiritual encouragement, guidance and help are likely to affect students' ideas when they go overseas for employment or further study, and thus encourage college students to consider going abroad for employment experience or further study.",
    "For college students, they have enough time and energy, are sensitive, and like to try new things. If they have the opportunity to go abroad for employment or further study, and eliminate and solve other sources of pressure, they will increase their behavioural willingness to go abroad for employment or further study. When college students perceive the greater value of the usefulness of overseas internship and further study, the willingness of overseas employment and further study will gradually increase. This is different from the conclusion found by Lee (2015), that perceived usefulness can play a positive role in promoting consumers' behavioural intentions. The possible reason is that overseas employment and further study are different from ordinary consumption because of high cost, long distance and long time, and there are many factors to consider and experience. The Chinese are relatively cautious and conservative, and need to think twice about important matters. In addition, the reason why perceived usefulness has no significant effect on behavioural intention may also be because perceived usefulness influences behavioural intention through attitude. From the analysis of the mediating effect, attitude is an effective mediating variable, which belongs to the complete mediation, so the perceived usefulness has no direct influence on the behavioural intention. In short, PU has a significant positive effect on ATT of students’ OIEFE, and ATT, SN and PBC contribute highly towards behavioural intention. My findings mean valuable and meaningful for the education sector as well as China, and it shall be an important reference for policy makers in a University in Henan and other Universities in China. In this way, application-oriented universities can be guided to formulate international educational indicators more reasonably and scientifically. Based on the previous conclusions and my findings, this study makes suggestions for this part. For students, college students are in a period of energetic, wants to learn something new, improve the knowledge structure, open international vision, eager to make new friends, if I have an overseas employment or study abroad experience, in the economic conditions allow families and individuals and rule out other factors, it is valuable and meaningful, is the experience of all college students will want to have. But if you want to work or study overseas, you need to have enough knowledge, experience, and resources. First, the school can provide more knowledge, experience and resources needed for overseas employment and further study. The school can produce publications related to overseas internship, Factors Affecting Overseas Internship, Employment and Further Education under the Background of “Belt and Road Initiative” – A TPB Model Analysis employment and further study to provide relevant information and resources. Set up communication groups to share experiences or information on various aspects of working and living overseas. Schools should raise their awareness of service in the operation of overseas internships. It is suggested to establish a network service platform for overseas internship and learning, including several publicity projects, service management and internship guidance, so as to realize active and real-time service and reduce the cost of overseas management of the school. At the same time, relevant insurance support and services should be provided for overseas internship students, various risk assessment and early warning and emergency measures should be made in advance, and risk warning and early intervention should be carried out for possible accidents and psychological problems during internship. Secondly, as OIEFE will be influenced by parents' support and teachers' encouragement, schools should be encouraged to invite parents to attend class meetings for policy guidance from the first enrolment of college students. Strengthen the extensive publicity of perceived usefulness, and focus on enhancing the willingness of parents and students to participate. In particular, create a supportive family environment. On the basis of general publicity, the students' parents will be deeply explained and guided. Allow parents to make an objective assessment of the overseas internship program and perceive the role of the internship program in the growth of students. Thirdly, on the basis of extensive research on students who are interested in overseas employment and further study, students should be provided with a comprehensive understanding of the details of overseas employment and further study, and their awareness of overseas internship should be strengthened through various ways of publicity. Senior students who have been to OIEFE will be invited to share their experiences. Invite cooperative overseas enterprises, universities and other relevant units to participate in the cultivation and management of students, and conduct on-site or online briefings to explain the contents of clothing, food, housing, transportation, work, promotion, welfare, cultural background and other aspects of overseas enterprises. The system of overseas employment and study abroad should be continuously improved, so that internship and employment can be connected with each other, and promotion meetings of internship and employment projects in overseas cities should be held. Colleges and universities cooperate with governments and enterprises, and make full use of the service platform of foreign labour cooperation to promote the overseas employment of college students.",
    "Finally, should constantly improve Henan application-oriented university students’ OIEFE security system (including funds guarantee, the guarantee of language, the guarantee of practice ability, etc.), enhance the level of overseas security and enhance students study overseas internship, employment, will, from college students to overseas without fear of uncertainty, the play to the role of a major ground school training internationalized talents, To facilitate the implementation of overseas internship, employment and further study policies, and to provide more high-quality international talents for the development of the belt and Road Initiative. Close guidance and planning are required by the school. Practice tutor system, in the early, middle and late practice to follow up guidance. In the early stage, it mainly helps students to adapt to the unfamiliar environment, learn the management requirements of internship positions, and help students to integrate into the internship as soon as possible. Mid-term to pay attention to students' internship dynamics, timely answer questions, guide students to deal with the personnel relationship in the internship work, remind students to pay attention to safety; In the later period, students should be guided to summarize actively, prepare corresponding internship reports according to the regulations, improve the materials, and do a good job handover. It is suggested that universities should improve the management system of overseas internship and standardize the design of the purpose, organization, management and guiding process of overseas internship. At the same time, the assessment and performance evaluation of overseas internship should be carried out scientifically and reasonably. Generally speaking, schools should communicate the message of overseas internship through various publicity methods; Explain the content of overseas internship program, internship management and matters needing attention through internship mobilization meeting; Through the summary of internship experience, exchange overseas internship study, life, work experience and skills to show the style of work; Through the incentive mechanism, select advanced interns, praise and commend them, and stimulate students' driving ability."
]