[
    "In the wake of frequent global pandemic outbreaks, the assessment of community resilience has emerged as a critical task for ensuring public health and safety. This study develops a comprehensive framework for evaluating community resilience to public health emergencies, focusing on communities in Henan Province, China. The research integrates a systematic literature review with advanced methodologies, including the SciBERT algorithm for indicator extraction, K-means clustering analysis, elbow method, silhouette analysis, and the Analytic Hierarchy Process (AHP). The resulting framework identifies key dimensions—Spatial Design and Infrastructure, Community Services and Support, Landscape and Ecology, and Medical and Safety Measures—that are essential for enhancing community resilience. The framework was validated through case studies in both urban and rural communities, revealing significant differences in resilience performance and highlighting the need for tailored strategies. This study offers a scientifically validated tool for public health managers and community planners, aiming to strengthen community resilience and improve response capabilities in future public health crises. Quan Wen, Mazran Ismail, Muhammad Hafeez Abdul Nasir, Jing Zhao, Zhang Jing Developing A Comprehensive Framework for Assessing Community Resilience to Public Health Emergencies in Henan Province: Insights from Scibert Analysis In the context of frequent global pandemic outbreaks, the importance of community resilience has become increasingly prominent. Community resilience refers to the ability of a community to respond to and recover from sudden public health events. The pandemic has exposed numerous shortcomings communities' responses to emergencies, including inadequate medical facilities, chaotic management, and uneven resource distribution. These issues have not only disrupted the normal functioning of communities but also posed serious threats to the health and safety of residents. Therefore, establishing an effective community resilience assessment framework has become a critical issue that needs to be addressed (Praptika et al., 2024). in The primary objective of this study is to develop a comprehensive and reliable framework for assessing community resilience in the face of public health emergencies. This framework aims to identify key factors that contribute to resilience, allowing for targeted improvements in community planning and response strategies. By focusing on these critical areas, the study seeks to enhance the ability of communities to withstand and recover from future public health crises. The significance of this study lies in providing public health managers and community planners with a scientific and systematic assessment tool to help them identify and strengthen the weak links in communities, thereby enhancing overall community resilience (Galanis, 2018). The innovation of this study is reflected in several aspects. First, the integration of the SciBERT algorithm and the Delphi method ensures the scientific and authoritative extraction of indicators (Thierry et al., 2023a). Second, the use of the elbow method and silhouette analysis determines the optimal number of indicator classifications, ensuring the reasonableness and accuracy of the classification (Shahapure & Nicholas, 2020). Finally, the Analytical Hierarchy Process is used to evaluate the extracted indicators by experts, forming the final assessment system (Gnanavelbabu & Arunagiri, 2018). Community resilience refers to the ability of a community to respond to and recover from various emergencies and crises (Robertson et al., 2021). A resilient community can quickly restore normal operations after a disaster, minimizing the impact on residents' lives and social order (Kammouh et al., 2019). With global climate change and the frequent occurrence of public health events, the importance of community resilience has become increasingly evident. Research indicates that community resilience depends not only on robust physical infrastructure but also on social capital, community cohesion, and effective resource allocation (Pfefferbaum et al., 2017). Thus, understanding and enhancing community resilience has become a key focus for governments and research institutions worldwide to better protect residents' health and safety during future crises (Joerin et al., 2012). Existing research on community resilience assessment mainly focuses on the following areas: spatial design and infrastructure, environmental quality and green spaces, technological integration and smart systems, medical and safety measures, and community management and resident participation (Yi et al., 2023). Effective spatial design and infrastructure can enhance a community's emergency response capabilities; for instance, spacious public areas and well- designed road networks provide efficient evacuation routes during emergencies (Wang et al., 2023). High environmental quality and well-designed green spaces not only improve residents' quality of life but also offer psychological support and comfort during crises (Valinejad et al., 2023). The application of smart technologies plays a crucial role in improving community management efficiency and emergency response speed; for example, smart surveillance systems and smart energy management systems optimize resource use and safety monitoring in communities (Ariyaningsih & Shaw, 2023). Comprehensive medical and safety measures are core components of community resilience, including adequate medical facilities, emergency medical services, and effective security patrols, which significantly enhance a community's ability to respond to public health emergencies (Dabelko-Schoeny et al., 2022). Furthermore, residents actively participating in community activities and management are more likely to unite and face challenges together during crises, strengthening community cohesion and resilience (L. Shi et al., 2023).",
    "This study employs the SciBERT algorithm to analyze relevant literature and extract key indicators for assessing community resilience (T. N. Dinh et al., 2024). SciBERT can automatically identify and extract important information and indicators from the literature, providing data support for the research. Using the SciBERT algorithm, a significant amount of literature data related to The literature screening process is illustrated in Figure 1. Initially, a literature search was conducted in databases such as Web of Science, resulting in 348 relevant articles. After removing duplicates, 324 articles remained. Screening the abstracts of these articles led to the exclusion of 211 articles that did not meet the research requirements. Subsequently, the remaining 113 articles underwent full-text review, and 74 were excluded based on their relevance to the research topic and availability of complete text. Ultimately, 39 articles were retained for qualitative analysis. To ensure the extracted indicators are reasonable and representative, K-means clustering analysis was conducted. K-means clustering is a commonly used unsupervised learning algorithm that effectively assigns data points to different clusters. By applying K-means clustering to the extracted indicators, the study preliminarily identified several categories of indicators. To determine the optimal number of clusters for K-means clustering, the elbow method and silhouette analysis were employed. The elbow method involves plotting the total sum of squared errors (SSE) for different numbers of clusters and selecting the number of clusters at the \"elbow\" point, where the SSE starts to level off. Silhouette analysis evaluates the compactness of data points within clusters and the separation between different clusters (Lenssen & Schubert, 2024). Through these methods, the study determined that the optimal number of clusters is four. Figure 2 shows the elbow method and Silhouette Analysis results, suggesting it as an ideal number (C. Shi et al., 2021). Combining these methods, the study concluded that four clusters is the optimal classification number. After identifying the initial four categories of indicators—Spatial Design and Infrastructure, Community Services and Support, Landscape and Ecology, and Medical and Safety Measures—this study undertook a thorough review to ensure their scientific validity and relevance. The review process involved several steps: First, the selection of indicators was informed by a comprehensive literature review and consultations with eight experts in urban planning, architecture, landscape design, and ecological environment, selected based on their expertise and research background in community resilience. Data was collected from these experts through structured interviews and Delphi questionnaires, focusing on the relevance, practicality, and applicability of each indicator. Second, specific issues identified during the expert consultation, such as overlap between indicators or lack of clarity in their application, were addressed through iterative feedback and refinement. Indicators that were deemed impractical, redundant, or too general were eliminated, while those that were essential and contextually relevant were retained and detailed in the framework. The final framework thus represents a robust and contextually appropriate tool for assessing community resilience, with specific strengths in its adaptability and Quan Wen, Mazran Ismail, Muhammad Hafeez Abdul Nasir, Jing Zhao, Zhang Jing Developing A Comprehensive Framework for Assessing Community Resilience to Public Health Emergencies in Henan Province: Insights from Scibert Analysis Following the establishment of the final indicator framework, this study employed the Analytical Hierarchy Process (AHP) to evaluate the weights of each indicator. AHP is a method that combines subjective judgment with mathematical analysis, widely used in multi-criteria decision analysis (Arshad et al., 2020). To assess community resilience, a three-level hierarchical indicator system was established, comprising a goal level for overall resilience, a criteria level for four main indicator categories, and an indicator level for specific assessment indicators within each category. A panel of experts in urban planning, architecture, and community resilience then conducted pairwise comparisons of indicators, rating their relative importance on a 1-9 scale to build a judgment matrix. The Consistency Ratio (CR) was used to check the reliability of these comparisons; a CR value above 0.1 prompted experts to re-evaluate their ratings, ensuring the final matrix accurately reflected their consensus on indicator importance. Next, the consistency of the judgment matrix was tested to ensure the consistency of the experts' scores. If the consistency test failed, the experts' scores needed to be adjusted until the matrix's consistency index met the requirements. Then, the eigenvector method was used to calculate the eigenvectors of each judgment matrix, ultimately deriving the weights of each indicator. The weights corresponding to the eigenvectors reflect the relative importance of each indicator in the overall community resilience assessment. Finally, the weights at each level were comprehensively calculated to obtain the final weight of each specific The research team utilized the SciBERT algorithm to extract themes from 39 SCI articles on community resilience in public health emergencies. To Quan Wen, Mazran Ismail, Muhammad Hafeez Abdul Nasir, Jing Zhao, Zhang Jing Developing A Comprehensive Framework for Assessing Community Resilience to Public Health Emergencies in Henan Province: Insights from Scibert Analysis ensure the representatives of the indicators, frequency and source thresholds were set for the extracted phrases. Specifically, phrases that appeared more than three times and were sourced from more than two articles were selected. Table 2 presents the final 39 phrases identified as candidate indicators.",
    "Using the elbow method and silhouette analysis on the 39 extracted phrases, as shown in Figures 2 and 3, the optimal number of clusters was determined to be four. The clustering analysis results indicated that the best four categories are Medical and Safety Measures, Spatial Design and Infrastructure, Community Services and Support, and Landscape and Ecology (Punhani et al., 2022). Following the initial classification, the study conducted a further review and adjustment of these indicators. First, through a literature review and expert consultation, feedback was collected to identify and address potential issues in practical application. Consequently, some indicators that were impractical or redundant, such as support friend, recovery reconstruction, community assist, resilience preparedness, value community, and respond crises, were removed. This process verified and adjusted the indicator system to ensure its applicability to different types of communities and public health emergency scenarios. Figure 3 presents the final framework diagram. To ensure the reliability and consistency of the assessment framework, experts with extensive experience in fields relevant to community resilience, including urban planning, architecture, and emergency management, were invited to evaluate the indicators using the Analytical Hierarchy Process (AHP). These experts performed pairwise comparisons of the importance of each indicator, evaluating their relative significance within their respective categories to construct a judgment matrix reflecting the weights of the indicators. The Quan Wen, Mazran Ismail, Muhammad Hafeez Abdul Nasir, Jing Zhao, Zhang Jing Developing A Comprehensive Framework for Assessing Community Resilience to Public Health Emergencies in Henan Province: Insights from Scibert Analysis consistency of the experts' evaluations was assessed using the Consistency Ratio (CR) to ensure logical soundness, and any inconsistencies identified were addressed by revisiting the experts' judgments to refine the matrix. The results, as illustrated in Table 3, show that \"Availability of Emergency Equipment\" has the highest weight at 0.0905, highlighting its crucial role in enhancing community resilience in response to public health emergencies. Other significant indicators include \"Emergency Rescue Plans\" (0.0899), \"Training and Drills\" (0.0855), and \"Accessibility of Medical Facilities\" (0.0808), emphasizing the importance of medical and safety measures. Additionally, indicators like \"Effective Organizational Management\" (0.0425) and \"Control Entry Points\" (0.0447) underscore the critical role of management and infrastructure in public health emergencies. To further validate the effectiveness and applicability of the constructed assessment framework, this study conducted case studies on two communities in Henan Province: one rural community which named Liujingzhai Village and one urban community which named Fenghuangcheng Community. By evaluating these two communities in detail, the study aims to better understand the differences and commonalities in resilience building across different types of communities, thereby providing a basis for formulating differentiated policies and measures. The results show that the Fenghuangcheng Community scores significantly higher than the rural community in indicators such as \"Availability of Emergency Equipment,\" \"Training and Drills,\" and \"Accessibility of Medical Facilities,\" indicating that the urban community has stronger resilience in these key areas, likely due to more comprehensive infrastructure and greater resource investment. However, the Liujingzhai Village community scores higher than the urban community in indicators such as \"Effective Organizational Management\" and \"Psychological Health Support Services,\" reflecting closer community relationships and stronger organizational management capabilities in rural areas when facing emergencies. These results demonstrate significant differences in resilience performance across different types of communities, underscoring the importance of developing differentiated strategies tailored to each community. For urban communities, it is essential to continue enhancing the availability of emergency equipment and medical facilities. For rural communities, improving emergency management and psychological support services is crucial. Quan Wen, Mazran Ismail, Muhammad Hafeez Abdul Nasir, Jing Zhao, Zhang Jing Developing A Comprehensive Framework for Assessing Community Resilience to Public Health Emergencies in Henan Province: Insights from Scibert Analysis In the context of frequent global pandemic outbreaks, assessing community resilience has become a crucial task to ensure public health and safety. This study aimed to establish a comprehensive framework for evaluating community resilience to potential future public health emergencies. By integrating a systematic literature review, SciBERT algorithm for indicator extraction, K- means clustering analysis, elbow method and silhouette coefficient analysis, and Analytic Hierarchy Process (AHP), this study developed a robust indicator system encompassing multiple dimensions. The findings indicate that Spatial Design and Infrastructure, Community Services and Support, Landscape and Ecology, and Medical and Safety Measures play vital roles in enhancing community resilience. The framework offers theoretical guidance and practical references for community planning and management, ultimately aiming to bolster communities' resilience and response capabilities in future public health crises.",
    "This study contributes a scientifically validated and systematic assessment tool for public health managers and community planners, enabling them to identify and strengthen weak points within communities. The innovative aspects of this study include the use of the SciBERT algorithm and the Delphi method for scientific and authoritative indicator extraction, the combination of elbow and silhouette methods to determine optimal classification numbers, and the application of AHP for expert evaluation of the final assessment framework. This research was not funded by any grant. However, the authors would like to express sincere gratitude to Universiti Sains Malaysia and Henan University of Technology for their invaluable support to the completion of this work."
]