[
    "Journal of Ecohumanism 2024 Volume: 3, No: 8, pp. 2757 – 2770 ISSN: 2752-6798 (Print) | ISSN 2752-6801 (Online) https://ecohumanism.co.uk/joe/ecohumanism DOI: https://doi.org/10.62754/joe.v3i8.4921 This study explores the impact of Transformational Leadership (TL) on Work Efficiency (WE) and career achievement among university lecturers in Henan Province, China. Specifically, it examines how WE mediate the relationship between TL and lecturers' career achievements. TL, characterised by its ability to inspire and motivate followers, was discovered to drive positive organisational change and enhance goal attainment. This research highlights how institutional factors such as leadership decision-making, employee collaboration, and communication influence career trajectories and contribute to career achievement levels. Key milestones in lecturers' careers, such as appointments, promotions, tenure, and professional growth in teaching, research, and leadership, were considered. Factors like academic qualifications, research productivity, teaching experience, and scholarly publications were identified as influential. Furthermore, maintaining high WE are crucial for managing workloads and meeting academic responsibilities. Using a sample of 974 lecturers selected through random sampling and data collected via questionnaires, the study applied quantitative analysis to investigate the correlation between TL behaviours, WE, and career achievements. The findings reveal that TL positively affects lecturers' career achievements, with WE serving as a significant mediating factor. This underscores the importance of TL and efficient work practices in advancing lecturers' careers and enhancing organisational effectiveness. According to Peter J. Wells (2017), head of UNESCO's higher education sector, the connection between higher education and the economic, social, and environmental fabric of the modern world has perhaps never been as significant in recent history. In China, the career achievement of lecturers depends on factors such as their qualifications, research outputs, teaching experience, and publications. Lecturers are usually ranked based on qualifications and research achievements and are promoted at different levels. As Al- Mahdy et al. (2018) presented, leadership significantly impacts lecturers' career achievement, effectiveness, and professional development. The career achievement of lecturers in higher education institutions may encompass an overview of various stages in their careers, such as initial appointment, promotion and tenure processes, and ongoing career achievement. This may also involve assessing the types typically considered in lecturer achievement, such as teaching, research, service to the institution and community, and leadership (Whitchurch, 2021). The career achievement of lecturers is related to many aspects, including achievements, education level, professional titles, etc. Hence, achieving higher career achievements is inseparable from self-improvement and the support of leaders (Hirschi et al., 2015). Work Efficiency (WE) plays a crucial role in the realisation of Lecturer Career Achievements (LCA). These practices enable lecturers to effectively manage their workload and allocate their time and resources appropriately. Other than that, high WE among lecturers increases their chances of excelling in many spheres, including teaching, research, and service—all important elements of lecturer success. (Chen et al., 2020). Bakker (2023) defines Transformational Leadership (TL) as motivating followers to implement constructive changes actively. Othman and Hamid (2023) highlight that this leadership approach is ideal for driving change, characterised by its courage and ability to execute TL support that significantly impacts goal attainment and motivation, with environmental support often forming the core of lecturers' career 2 Faculty of Educational Studies, Universiti Putra Malaysia, 43400 UPM Serdang, Selangor, Malaysia. 3 Faculty of Educational Studies, Universiti Putra Malaysia, 43400 UPM Serdang, Selangor, Malaysia. Journal of Ecohumanism 2024 Volume: 3, No: 8, pp. 2757 – 2770 ISSN: 2752-6798 (Print) | ISSN 2752-6801 (Online) https://ecohumanism.co.uk/joe/ecohumanism DOI: https://doi.org/10.62754/joe.v3i8.4921 motivation, achievement, and satisfaction. Therefore, TL can enhance lecturers' willingness and commitment to achieving their goals, as well as their motivation to work actively (Mehmood et al., 2016). According to Abdul Aziz et al. (2023), the readiness of university lecturers for change moderates the relationship between principals' leadership commitment to change (including normative, continuity, and affective aspects).To ensure educational reforms effectively achieve educational goals, principals must play a strong leadership role to improve readiness to implement these changes. Henan Province is the province with the largest population in China. At the same time, there are few universities and many lecturers. The pressure for promotion faced by lecturers is very high. Note that the stability of university lecturers influences the quality of their education and the professional strain on them. (Liu, 2020). The research by Jinke, Li, Abdul Aziz, N. A., & Kadir, S. (2024) demonstrates many issues within Chinese training institutions. Compared to students' academic performance and achievements, leaders focus more on management and sustainability to enhance organisational competitiveness and explore market opportunities. Consequently, this study will focus more on how higher education leaders are concerned with and attentive to lecturers' WE, enhancing their career achievement. Hence, this study is of great significance in improving the professional achievement of university lecturers.",
    "According to Abdul Aziz et al. (2023), organisational change is highly challenging as it requires meticulous planning and broad acceptance. Nevertheless, the success rate is only 30%. The key to successful change lies in commitment to the change and individual openness. In higher education institutions, the role of leaders is crucial. If lecturers do not actively participate, the change may remain superficial, and the success of its implementation depends on the positive belief and collaboration of the lecturers (Kin & Kareem, 2016). TL is a key concept in educational administration, garnering considerable discussion and application. Initially, it was understood as a process where leaders elevate the system or organisation by enhancing the achievements and motivation of their followers. Early theorists also emphasised that TL is inherently linked with change, highlighting the critical role of a leader in positively altering attitudes, norms, institutions, behaviours, and actions that shape our daily experiences (David, 2020). On the other hand, Ekpoh (2019) claims that transformative leadership is increasingly important in encouraging lecturers' career achievement. Transformational leaders inspire and motivate their teams to achieve beyond expectations, influencing individual and organisational outcomes. Global challenges pose significant obstacles to lecturers' career achievements, necessitating careful management of human resources by university leaders. Correspondingly, identifying factors that hinder or enhance lecturers' career achievements is essential (Zacher et al., 2019). Exploring the relationship between TL and lecturers' career achievement, particularly in Henan, China, deepens our understanding of this leadership theory. For instance, a study in Turkey by Tarcan et al. (2017) discovered a positive relationship between TL and career success among lecturers. Universities can apply focused leadership development initiatives and efficient management techniques to improve lecturers' career achievement and WE by knowing how TL affects their career success and the intermediary role of WE. These findings can guide university management practices in Henan province. Additionally, improving individual lecturers' achievements contributes to the overall educational quality and leadership of the university. Thus, educational leaders must focus on lecturers' occupational needs and psychological states to develop policies and measures that better meet these needs, improving the education system's efficiency, quality, and leadership. Journal of Ecohumanism 2024 Volume: 3, No: 8, pp. 2757 – 2770 ISSN: 2752-6798 (Print) | ISSN 2752-6801 (Online) https://ecohumanism.co.uk/joe/ecohumanism DOI: https://doi.org/10.62754/joe.v3i8.4921 Does work efficiency play a role as a mediator in the relationship between transformational leadership and lecturers' career achievements in universities in Henan Province, China? Insufficient research exists on the relationship between TL and LCA, particularly regarding the moderating role of WE (Brouwers & Tomic, 2013). Despite the critical importance of LCA for driving educational reform and improving work standards and the growing global challenges affecting lecturers' professional development, there is a notable gap in understanding how TL influences LCA and how WE mediate this relationship. Subsequently, identifying obstacles and potential solutions for enhancing lecturer professional achievement is essential. This study aims to address this gap by exploring the mediating role of WE between TL and LCA, contributing valuable insights for university leaders to support lecturer development effectively. Bass (1985) claims that TL consists of four dimensions. The first dimension is idealised influence, which reflects the charismatic aspects of transformational leaders, through which followers perceive and emulate the values and vision of leaders. The second is inspiring motivation, involving leaders conveying convincing visions and motivating followers to achieve ambitious goals. Intellectual stimulation is the third component, and it underlines how leaders support creativity and welcome fresh ideas to solve problems (Bass & Riggio, 2006). The fourth dimension is personalised care, which emphasises that leaders provide personalised care and support to each follower. These dimensions explain how TL promotes organisational change and improves follower commitment and performance. American scholar Gesang (2021) defined the concept of TL as a decision-maker who can fully utilise the motivation of subordinates and achieve higher goals based on it. The behaviour of leaders can make subordinates fully aware of the importance and sense of mission of fulfilling their duties, prompting subordinates to sublimate or rise to a higher level so that they consciously and proactively put the interests of the team and organisation above their personal interests. Bass argues that TL engages subordinates' higher-level needs by highlighting the significance of their tasks, creating a climate of mutual trust, and encouraging them to prioritise organisational goals over personal interests, ultimately surpassing expected outcomes (Bass, 1995). On the other hand, Ibrahim et al. (2024) highlighted the need for higher education management to foster positive workplace relationships, transparent policies, and clear roles to improve employees' emotional well-being and work environment. This is consistent with the importance of work effectiveness as a mediating factor in understanding how TL affects career achievement.",
    "In 2005, Chinese scholars Li Chaoping, Shi Kan, and others summarised the TL structure of China through the induction of foreign research. Li Chaoping, Shi Kan, and other scholars believe that in the unique cultural context of China, TL is characterised by a four-dimensional framework: moral integrity, vision inspiration, leadership charisma, and personalised care. TL theory has been utilised with a lot of research Journal of Ecohumanism 2024 Volume: 3, No: 8, pp. 2757 – 2770 ISSN: 2752-6798 (Print) | ISSN 2752-6801 (Online) https://ecohumanism.co.uk/joe/ecohumanism DOI: https://doi.org/10.62754/joe.v3i8.4921 investment to show that transformational leaders may help lecturers encourage the growth of school objectives and change their opinions on the institution's vision (Thompson, 2020). In contrast to TL, destructive leadership behaviour is also present. According to Omar et al. (2005), the most common negative behaviours include setting unreasonable or unattainable goals and deadlines, assigning tasks below the employee's capability, and using intimidation. Less common negative behaviours include being humiliated or ridiculed at work, being loudly reprimanded or targeted by spontaneous anger, and being subjected to pranks by difficult colleagues. Meanwhile, TL is widely recognised for its positive impact on organisational change and follower performance. The dimensional framework proposed by Bass (1985) and further refined by scholars such as Gesang (2021) and Li Chaoping (2005) presents an idealised view of leadership that may not fully capture the complexity of real-world dynamics. For example, while TL dimensions such as idealised influence and personalised care are critical, they may not account for the nuanced effects of cultural context and individual differences on leadership effectiveness. Meanwhile, emphasising inspirational motivation and intellectual stimulation is valuable. However, the potential for negative outcomes may be overlooked if not properly balanced. Furthermore, as highlighted by Omar et al. (2005), the potential for destructive leadership behaviours underscores the need to consider how negative leadership traits may offset or undermine the positive aspects of TL. This complexity suggests the need for a more nuanced understanding of how TL interacts with work effectiveness and career achievement, particularly in different cultural contexts and in different organisational settings. The career success of lecturers plays a crucial role in institutional development, which encompasses three main dimensions: personal development, professional achievement, and organisational and community achievement. Among these, teaching achievement is a key component of professional success. Additionally, facility and career achievements contribute to organisational success, while welfare achievement is a significant aspect of personal development (Fahrurrozi et al., 2021). A career is all the positions a person occupies in their working life or all the occupations a person holds in their lifetime; the career success of lecturers is a series of jobs connected to the job positions in their lives (Sampson Jr et al., 2014). To address global challenges, it is essential to consider the career achievement of lecturers, and universities must prioritise and effectively manage their human resources (Zacher et al., 2019). In response to the demands and opportunities of globalisation, there is a need for faculty and students with expertise and skills aligned with community needs and aspirations. Other than that, lecturers should also help foster the psychological conditions and attitudes necessary for society to embrace and engage in social change and discovery. As educators, lecturers must be equipped to teach, mentor, train, and develop students, influencing their values, attitudes, knowledge, and skills (Nagy et al., 2019). The model is the four-pillar model proposed by Ehlers (2020), which identifies four core dimensions that contribute to lecturers' career achievements. These dimensions include teaching, research, academic service, and academic leadership. According to the model, lecturers' career achievements depend on their ability to excel in each pillar. Excellent achievements in teaching, research results, active participation in academic service activities, and demonstrating leadership skills are essential for career achievement. In addition, there are four driving forces for educational lectures, Including individualised academic learning, multi- institutional learning paths, future skills emphasis, and lifetime learning. The study's results revealed four different influencing factors, called the pillars of change in higher education. The \"pillars\" are like architectural elements and represent the framework in which higher education is expected to develop in the next decade (Fig. 1). Journal of Ecohumanism 2024 Volume: 3, No: 8, pp. 2757 – 2770 ISSN: 2752-6798 (Print) | ISSN 2752-6801 (Online) https://ecohumanism.co.uk/joe/ecohumanism DOI: https://doi.org/10.62754/joe.v3i8.4921 WE refer to the services produced by an individual or group using more effective performance measurement standards to balance inputs and outputs, which is the ratio that determines the overall work results of producing labour products. There are multiple dimensions to measure employee WE, covering workability, improvement of work outcomes, work morale, personal success, work quality, and WE (Sutrisno, 2016). On the other hand, Ryan (2020) discovered that from a psychological perspective, the WE of lecturers can be understood as the adjustment and control of certain motivations by lecturers in education, teaching, and management practices to maintain the best working state and maximise their potential. It is also related to the rational use of subjective and objective conditions to achieve the best education and teaching results.",
    "According to Zainudin et al. (2023), high self-efficacy in consultants often correlates with stronger emotional awareness and coping skills, which are crucial for enhancing WE. In the context of higher education, this ability is equally important as it helps employees manage work-related stress and challenges, thereby improving WE. Hira (2020) determined a significant positive correlation between WE and TL. This suggests that organisational leaders should possess transformational qualities and deeply understand their employees, as transformational leaders effectively motivate staff to achieve both expected and outstanding results. Meanwhile, Tschannen-Moran and Hoy (2001) developed a three-dimensional model of lecturer WE, comprising teaching skills, student participation, and classroom management. Studies have examined how transformative leadership relates to career achievement for university lecturers. For example, Hira's (2020) study on lecturers found that TL positively impacted lecturers' sense of career achievement. The authors emphasise that transformational leaders who foster a shared vision, provide intellectual stimulation, and provide personalised support can help enhance instructors' sense of career achievement. Similarly, Buil (2019) found that TL significantly predicts lecturers' sense of career achievement in higher education. The research underlined how lecturers' contentment, dedication, and general feeling of success are improved by transformational leaders who show inspiring drive, idealised influence, personal concern, and intellectual stimulation. Research suggests that when employees perceive their leaders as charismatic, they are more likely to be dedicated to their tasks and perform more highly competently (Gea Eman et al., 2023). Thus, transformational leaders' charisma contributes to increased WE. Transformational leaders enhance their employees' skills, knowledge, and competencies by investing in their employees' achievements. This individualised attention boosts employee morale and improved WE by enabling individuals to contribute to their full potential (Chathoth et al., 2020). Employees who feel supported and valued are more likely to be engaged and efficient. Journal of Ecohumanism 2024 Volume: 3, No: 8, pp. 2757 – 2770 ISSN: 2752-6798 (Print) | ISSN 2752-6801 (Online) https://ecohumanism.co.uk/joe/ecohumanism DOI: https://doi.org/10.62754/joe.v3i8.4921 One critical point is the potential overemphasis on the positive attributes of TL without sufficient consideration of the context in which it is applied. For example, while TL's charismatic influence can enhance dedication and performance, it may also create unrealistic expectations or pressures that could lead to burnout if not managed appropriately. This potential downside is not extensively addressed in the reviewed studies. Furthermore, the studies often focus on the direct positive impacts of TL. However, they may overlook other factors contributing to career achievement and WE. These factors might include institutional support structures, external career opportunities, and personal resilience. The interplay between these elements and TL is crucial for a comprehensive understanding of career success. Figure. 2 illustrates the conceptual framework of this work and the link among the variables. This research framework examines how TL impacts career achievements by exploring its relationship with WE. Central to this framework is TL, which inspires and motivates employees to exceed their self-interests and achieve higher performance levels. According to Tschannen-Moran and Hoy (2001), this creates an environment that supports intrinsic motivations, such as personal growth, and extrinsic motivations, like rewards and recognition. The framework posits that WE mediate the relationship between TL and career achievements. WE encompass self-efficacy, target setting, feedback, and motivation, all contributing to enhanced performance. Consequently, career achievements, the framework's dependent variable, are categorised into task achievement, adaptive achievement, and contextual achievement. The model suggests that TL improves WE, leading to better career achievements. This mediation process underscores how leadership behaviour translates into career success by enhancing workplace performance and adaptability (Sampson Jr et al., 2014). Overall, the framework offers a structured view of how TL drives career success through improved WE and motivation. Figure 3 shows theoretical framework. This study explores transformational leadership theory, suggesting that leaders who inspire with a compelling vision and provide intellectual stimulation and personalized support can significantly enhance job satisfaction and performance (Bass, 1985; Burns, 1978). Transformational leadership is characterized by four components: idealized influence, inspirational motivation, intellectual stimulation, and individualized consideration (Bass, 1990). These elements foster strong leader-follower relationships, promoting collective goals that improve work efficiency and career success (Avolio & Bass, 2004). By creating enriching work conditions and setting ambitious goals, transformational leaders can boost overall job performance and satisfaction (Locke, 1968; Hackman & Oldham, 1980).",
    "Journal of Ecohumanism 2024 Volume: 3, No: 8, pp. 2757 – 2770 ISSN: 2752-6798 (Print) | ISSN 2752-6801 (Online) https://ecohumanism.co.uk/joe/ecohumanism DOI: https://doi.org/10.62754/joe.v3i8.4921 Additionally, Trowler's (2010) holistic view of career achievements recognizes that various factors influence career development, including personal attributes and institutional context. Ehlers (2020) identifies a four- pillar model—teaching, research, academic service, and academic leadership—that contributes to lecturers' success. By enhancing workplace effectiveness through transformational leadership, individuals can better navigate their careers and achieve long-term success, linking leadership quality to individual development (Savickas, 2005). This study is a quantitative descriptive and correlational study of lecturers in universities in Henan Province. This study explores the relationship between TL, LCA, and WE, especially to examine the key role of WE as a mediating variable in the relationship between the two. To achieve this goal, a correlation analysis strategy was used to quantify and analyse the closeness of the relationship between observable variables. Regression analysis further allows for examining direct and indirect effects, particularly evaluating WE as a mediating variable. The research location of this study was conducted in universities in Henan Province, China. This study selected five representative universities in Henan Province as the research subjects through stratified sampling to ensure that the sample was widely representative and in-depth regarding reputation, school size, and subject coverage. Ideally, the sample covered all types of lecturers in all universities and disciplines in the province. The sample size selection was guided by statistical power analysis to ensure that the research results were comprehensive and applicable. The population in research refers to the entire group of people, events, or things of interest to the researchers (Gentles et al., 2015). Consequently, Martino et al. (2017) elaborate that a population shares identical attributes relevant to the study. In this research, the population consists of 19,400 lecturers employed across five universities in Henan Province, China, according to the Henan Education Department. These universities span different institutional categories, including top public universities, basic public universities, profit colleges, private colleges, and community colleges, each with distinct faculty policies, salary structures, and career prospects. Journal of Ecohumanism 2024 Volume: 3, No: 8, pp. 2757 – 2770 ISSN: 2752-6798 (Print) | ISSN 2752-6801 (Online) https://ecohumanism.co.uk/joe/ecohumanism DOI: https://doi.org/10.62754/joe.v3i8.4921 To accurately represent this diverse population, a stratified sampling approach was used, ensuring that lecturers from various levels and disciplines were included. The ideal sample size was determined using three distinct statistical methods—Krejcie and Morgan's (1970) formula, Cochran's (2007) formula, and Cohen's et al. (2003) sampling formula. Based on these methods, the calculated sample size ranged from 377 to 980. However, 974 completed questionnaires were collected to enhance the robustness and representativeness of the results. This larger sample size exceeds the calculated minimum and increases the reliability, accuracy, and generalisability of the study findings. The sample was distributed proportionally across the five universities, ensuring that the sample reflects the overall population distribution of lecturers in Henan Province, presented in Table 1. The instruments used in this study consist of adapted and adopted scales that have been rigorously validated by both domestic and international scholars. The survey is divided into four parts: (1) a demographic survey, which collects basic information such as age, gender, and years of teaching experience; (2) the Multifactor Leadership Questionnaire (MLQ) developed by Bass and Avolio (1995) to measure TL across four dimensions—Idealised Influence, Inspirational Motivation, Intellectual Stimulation, and Individualised Consideration. The MLQ uses a five-point Likert scale ranging from 1 (strongly disagree) to 5 (strongly agree), with a Cronbach's alpha of 0.87, indicating good reliability. (3) The Lecturer WE Tool, adapted from Kahya (2019), evaluates WE in the context of lecturers' professional roles, employing a five-point Likert scale with a Cronbach's alpha of 0.85. (4) A Career Achievements Measurement, based on Hascher's (2021) Five-Dimensional Career Happiness Model, measures career achievements in three dimensions—task achievement, adaptive achievement, and contextual achievement. This section also utilises a five-point Likert scale, with a Cronbach's alpha of 0.88, reflecting high reliability. A total of 974 valid questionnaires were collected for this survey, and they chose to fill them out in English or Chinese. All instruments were used with permission from the original authors to ensure proper management of the instruments and adherence to ethical standards during survey administration, as presented in Table 2.",
    "This study examined TL, WE and LCA. To ensure measurement robustness, we addressed construct validity, content validity, and internal consistency reliability. Construct validity was evaluated using Journal of Ecohumanism 2024 Volume: 3, No: 8, pp. 2757 – 2770 ISSN: 2752-6798 (Print) | ISSN 2752-6801 (Online) https://ecohumanism.co.uk/joe/ecohumanism DOI: https://doi.org/10.62754/joe.v3i8.4921 Structural Equation Modelling (SEM), assessing factor loadings and Average Variance Extracted (AVE) with acceptable values of 0.50 or higher (Muijs, 2011). Correspondingly, content validity was ensured by aligning the measurement scale with theoretical definitions and evaluating it with a panel of experts. Reliability was assessed using Cronbach's alpha, with scores computed using IBM SPSS version 23, confirming the instrument's consistency. This rigorous evaluation supports the study's examination of the relationships among TL, WE, and LCA. Reliability refers to the consistency of a measurement in capturing what it is intended to measure. This study assessed reliability using Cronbach's alpha, a well-established method for evaluating internal consistency (Ary et al., 2018; Sekaran & Bougie, 2016), were analysed to confirm the instrument's reliability for the pilot and main studies. Descriptive statistics, correlation analysis, and regression analysis will be employed for quantitative data analysis. Note that regression analysis will specifically assess the impact of TL on LCA while controlling for other relevant factors. After collecting valid questionnaires, appropriate statistical tools, namely percentages, correlation analysis, and regression analysis, will be employed to assess reliability and validate hypotheses. Pearson correlation will validate research questions 2, 3, and 4 and use the SEM model to verify question 5. A total of 1,106 questionnaires were distributed in this study, and 974 were effectively collected, with a collection rate of 88.1%. The gender distribution of the respondents was balanced, with 489 males (50.2%) and 485 females (49.8%). In terms of age structure, the majority were young and middle-aged lecturers, with the highest proportion of those aged 25-35 (40.1%), followed by those aged 36-45 (36.2%). In terms of education level, the absolute majority (60.3%) had a doctorate degree, and the master's and bachelor's degrees accounted for 16% and 22.7%, respectively, reflecting the high education characteristics of university lecturers. In terms of professional title structure, lecturers accounted for the highest proportion (72.2%), while associate professors and professors accounted for 15.4% and 9.4%, respectively, reflecting the rationality and diversity of professional title distribution. In terms of teaching experience, most of the respondents had 1-5 years of teaching experience (69.6%), indicating that the sample included both experienced senior lecturers and energetic new lecturers. In terms of teaching subjects, all disciplines are distributed, among which medicine (15.8%), agriculture (14.4%), and humanities and social sciences (25.9% in total) account for a relatively high proportion, reflecting the breadth and diversity of university subject settings. Table 4 provides the descriptive statistics of the total scores of the three scales. All three scales use the Likert five-point scoring method. The standard deviation and mean data analysis of TL and WE of LCA indicate that the mean value of TL is 74.72, with a standard deviation of 4.09. The mean value of WE is 60.93, with a standard deviation of 3.23. Meanwhile, the mean value of LCA is 134.33, with a standard deviation of 6.43. The research sample includes 974 cases. By comparing the descriptive statistics of these variables, the differences and correlations between them can be preliminarily observed. Further analysis can provide valuable insights into the relationship between TL, WE, and LCA in the work environment. In Table 5, we conducted a correlation analysis of TL, WE, and LCA. The results demonstrate that TL is positively correlated with both WE and LCA. The Pearson correlation coefficient between TL and WE are 0.322**, the Pearson correlation coefficient between TL and LCA is 0.383**, and the correlation coefficient between WE and LCA is 0.377**. This shows that TL has a statistically significant positive impact on both work engagement and career achievement. Journal of Ecohumanism 2024 Volume: 3, No: 8, pp. 2757 – 2770 ISSN: 2752-6798 (Print) | ISSN 2752-6801 (Online) https://ecohumanism.co.uk/joe/ecohumanism DOI: https://doi.org/10.62754/joe.v3i8.4921 Firstly, regarding the total effect, the total effect of TL on LCA is 0.3171, with a p-value less than 0.05. This indicates that TL positively impacts LCA when the mediator variable WE is not considered. Secondly, concerning the direct effect, the direct effect of TL on LCA is 0.2446, which means that after considering the mediator variable WE, TL still has a significant positive impact on LCA (p < 0.05). Lastly, regarding the indirect effect (mediation effect), the indirect effect of TL on LCA through WE is 0.0725, with a Bootstrap standard error of 0.0254. The 95% confidence interval does not include zero (Boot LLCI is 0.0309, Boot ULCI is 0.1278), indicating that the mediation effect is insignificant. Thus, from this analysis, the conclusion can be drawn: the direct effect of TL on LCA remains 0.2446, while the indirect effect is the difference between the total effect and the direct effect [0.3171 - 0.2446 = 0.0725]. This indicates that WE mediate between TL and LCA, with this portion of the effect transmitted through the mediator variable WE.",
    "This study confirms that TL significantly enhances LCA, particularly by improving WE within Henan University. The results demonstrate that TL directly influences LCA, with WE as a key mediator in this relationship. This aligns with previous research highlighting the importance of TL in motivating individuals and fostering a productive academic environment (Ekpoh, 2019; Tarcan et al., 2017). The statistical significance of the regression coefficients—0.25*** for TL on WE and 0.56*** for WE on LCA— underscores the importance of leadership style in enhancing lecturers' career outcomes. The mediating role of WE provide valuable insights into how TL affects career achievements, suggesting that leadership impacts are not only direct but also channelled through improved efficiency in lecturers' work. This finding echoes the broader literature, which emphasises the role of leadership in optimising workplace performance and career development (Kristola & Adnyani, 2014). Hence, universities should consider this when developing leadership programs to improve individual and institutional success. Journal of Ecohumanism 2024 Volume: 3, No: 8, pp. 2757 – 2770 ISSN: 2752-6798 (Print) | ISSN 2752-6801 (Online) https://ecohumanism.co.uk/joe/ecohumanism DOI: https://doi.org/10.62754/joe.v3i8.4921 Meanwhile, the data supports the mediating role of WE well. The study's focus on a single region (Henan Province) may limit the generalizability of the findings. The cultural and institutional context of Chinese universities may shape the way TL and WE operate. For example, the hierarchical nature of Chinese institutions may amplify the effects of TL due to the high value placed on authority and guidance from leaders. In contrast, in more egalitarian educational systems, the impact of TL might be less pronounced. This cultural nuance suggests that future studies should examine the role of context in moderating the relationship between TL, WE, and LCA, providing a more nuanced understanding of leadership's role across different educational environments. The findings of this study offer several key implications for educational leaders, policymakers, and human resource practitioners in higher education institutions, particularly within the context of Henan Province, China. The study highlights the critical role that TL plays in enhancing lecturers' career achievements by improving their WE (Gea Eman et al., 2023). These leadership behaviours can positively impact lecturers' performance and overall job satisfaction, improving organisational effectiveness. Policymakers can foster a culture of excellence that strengthens educational institutions by promoting continuous professional development, mentorship programs, and constructive feedback systems. Furthermore, the study indicates that improving individual lecturers' achievements can elevate the overall quality of education (Zacher et al., 2019). Meanwhile, TL practices can be effective across various settings, and it remains essential for university leaders to consider cultural nuances and ensure that leadership practices are adapted to meet the unique needs of Chinese lecturers. This study confirms the significant positive impact of TL on LCA, particularly through the mediating role of WE. The findings underscore TL's crucial function in enhancing lecturers' professional success by directly influencing their achievements and improving their efficiency in the workplace. The statistical significance of these relationships provides valuable insights into how leadership styles can be strategically leveraged to boost lecturer performance and overall institutional success in higher education. Meanwhile, this study contributes to the growing body of literature on leadership within the context of Chinese higher education, and its implications extend beyond this specific environment. For university leaders, the results suggest that fostering TL is a pathway to creating more motivated, efficient, and successful lecturers, ultimately benefiting institutional performance. The study highlights the importance of integrating TL development programs, emphasising qualities such as inspiration, individualised support, and intellectual stimulation, to promote both WE and career advancement among lecturers. This has practical significance for human resource strategies and leadership training in universities, where investing in leadership skills may translate into better institutional outcomes. However, the study is not without limitations. The data was collected from a single region—Henan Province, China—limiting the generalizability of the findings to other cultural and institutional contexts. The unique cultural dynamics of Chinese academia might amplify the effects of TL in ways that differ from other regions. Thus, future research should aim to replicate this model in diverse cultural and geographic settings to validate the findings and account for cross-cultural variations. Further work, this study focused solely on WE as a mediator between TL and LCA, which, while significant, only partially explains the relationship. Future research should expand the scope by considering other potential mediators, such as job satisfaction, organisational commitment, or psychological well-being, to better understand how TL influences lecturers' career achievements. Moreover, the role of potential moderators, such as lecturer experience or institutional resources, could be explored to better tailor leadership interventions to different lecturer profiles.",
    "In conclusion, this study reinforces the importance of TL in shaping lecturers' career success and highlights the critical role that WE play as a mediator in this process. These findings offer practical guidance for improving leadership practices in academic institutions, particularly within the context of higher education Journal of Ecohumanism 2024 Volume: 3, No: 8, pp. 2757 – 2770 ISSN: 2752-6798 (Print) | ISSN 2752-6801 (Online) https://ecohumanism.co.uk/joe/ecohumanism DOI: https://doi.org/10.62754/joe.v3i8.4921 in China. At the same time, the study lays a foundation for future research that broadens the exploration of leadership impacts on career outcomes, paving the way for more nuanced and contextually sensitive leadership development strategies in academia. Based on the study findings and lecturer feedback, it is recommended that educational administrators prioritise the study of teaching leadership to enhance teachers' efficiency and elevate lecturers' career planning and sense of achievement as key management objectives. Lecturers highlighted the importance of leaders actively engaging in educator interactions and maintaining open communication channels. Furthermore, leaders should emphasise teaching responsibilities and expand and deepen lecturer preparation through diverse multi-platform teacher training initiatives. Hence, motivating teachers to engage in educational and research preparation activities is crucial for fostering continuous professional development and enhancing overall educational quality. The authors have all attested that they have no competing interests in this work. Author 1 took part in the research and the drafting. Author 2 oversaw the authoring of the complete paper and the pertinent literature review. Meanwhile, Author 3 designed the study and entered the data. Author 4 analysed the data."
]