[
    "Abstract. Against the backdrop of the intensifying aging of the population in China, rural areas, as traditional family-oriented societies, the marital status and marital quality of the younger generation have already become important factors influencing the happiness of elderly people. This study delved into Guangshan County, Henan Province, and collected 26 interview materials and 440 questionnaires through questionnaire surveys and on-site interviews. Using methods such as the multiple Logistic regression model and case analysis, empirical studies reveal that there is a notable inverse relationship between rural elderly individuals' perception of their children's marriage squeeze and their subjective well - being. The offspring's marriage squeeze reduces the subjective well-being of elderly people through four pathways: increasing parental transfer payments, reducing offspring's support for the elderly, decreasing emotional support, and reducing social participation, thus harming the subjective well-being of elderly people. Population aging has become a common challenge faced by countries worldwide. Among them, the process of aging in China is particularly rapid. It can be seen that in the new journey of building a modern socialist country in all respects, how to improve the quality of life and subjective well-being of the elderly population has become an important issue in the field of people's livelihood in China. However, the problem of the marriage squeeze of the younger generation in rural areas poses a serious threat to the well-being of elderly people. In an ideal situation, the successful marriage of children can not only bring emotional satisfaction to elderly people but also reduce the living burden on their parents through the stable development of the younger generation's families, enabling elderly people to \"enjoy a good life\". In recent years, however, issues such as the chaotic marriage market, negative social public opinion, and the increasing burden of intergenerational economic support have become more and more prominent, continuously weakening the subjective well-being of the elderly. © 2025 The Authors. This is an open access article distributed under the terms of the Creative Commons Attribution License 4.0 (https://creativecommons.org/licenses/by/4.0/). After entering the 21st century, scholars have found that the formation mechanism of marriage squeeze has become increasingly complex: new factors such as the solidification of the traditional marriage pattern, the rapid increase in the divorce rate and remarriage rate, and the large-scale outflow of rural women[1]have continuously emerged. Regarding the impacts and consequences, on the macro - scale, the marriage squeeze can impede productivity, efficiency, and economic advancement. It can undermine the overall social and population welfare, and also impinge on the sustainable development of China's population and society[2].At the micro level, there is an independent and significant negative relationship between marriage squeeze and the quality of life of rural men, increasing the incidence of suicidal ideation among rural men. In terms of index measurement, at the macro level, Tuljapurkar used the potential male-female ratio at first marriage to measure the scale. Subsequently, Chen [3]created indices such as the relative sex ratio, the single-sex ratio, and the proportion of singles and the unmarried. At the micro level, many studies use whether a person is over 28 years old and unmarried to measure marriage squeeze[1]. The Organization for Economic Cooperation and Development regards subjective well-being as an important dimension of the quality of life and defines it as \"a favorable psychological state encompassing every positive and negative assessment people conduct about their lives, as well as the emotional responses that people have to their experiences\". Subjective well-being is a sense of pleasure generated when people make subjective evaluations of their quality of life and life values. It not only affects people's physical and mental health but also serves as an important indicator for measuring a country's welfare level[4]. In the field of subjective well-being measurement, scholars at home and abroad have developed multiple influential scale systems. Currently, the Satisfaction with Life Scale (SWLS) published by Diener et al. in 1985, and the Subjective Well-being Scale for Urban Residents in China compiled by domestic scholar Xing Zhanjun have a relatively far-reaching influence. In terms of influencing factors, scholars mainly discuss from two levels: micro and macro. Among them, micro-level studies have shown that individual characteristics such as gender, age, marital status, health status, and income level have a decisive impact on residents' happiness[5] [6].Macro factors include income inequality, social equity, environmental regulation, government size, etc.",
    "Based on the above theoretical analysis and elaboration, the perception of the marriage squeeze of the younger generation has an important impact on the subjective well-being of elderly people. From the perspective of the rural population structure, Du Jiao pointed out that more and more rural women are flowing into cities and choosing to marry urban men with stronger economic strength, thus intensifying the marriage pressure on rural male families. In terms of the economic situation, for rural families with poor economic conditions, the parent generation may feel frustrated and powerless due to the worry that their offspring may find it difficult to attract suitable partners with their own capital accumulation, causing them to be in a state of anxiety for a long time. Based on the theory of intergenerational responsibility, the intergenerational responsibility in rural marriages is mainly manifested as the one-sided responsibility and obligation of the parent generation towards the marriage of the offspring, that is, helping the offspring prepare necessary items for marriage such as a wedding house and betrothal gifts. This paper believes that the perception of the marriage squeeze of the younger generation will hurt the subjective well-being of elderly people. Therefore, the following hypothesis is put forward: H1: The perception of the marriage squeeze of the younger generation has a significant negative impact on the subjective well-being of elderly people. Parents provide support such as care, upbringing, and education to their children when they are young, hoping to receive care and rewards from their children when they are old. However, in the context of the marriage squeeze of the younger generation, the balanced relationship of family intergenerational support is broken, showing a trend of weakened upward support and increased downward responsibility, which has multiple negative impacts on the subjective well-being of elderly people. On the one hand, influenced by factors such as the marriage squeeze, high betrothal gifts are difficult to curb[7], the marriage cost is constantly rising, and the resource expenditure required by children to meet their own marriage needs increases, increasing the overall economic pressure on the family. On the other hand, in the context of the marriage squeeze of the younger generation, the surging marriage cost and the severe marriage market situation lead to parents assuming more downward economic responsibilities, including purchasing a wedding house, paying betrothal gifts, and providing continuous support to the offspring's family after marriage[8]. This paper puts forward the following hypothesis: H2: The perception of the marriage squeeze of the younger generation reduces the subjective well-being of elderly people by increasing the transfer payments of the parent generation and reducing the support expenses for the elderly from the offspring. Existing research has shown that intergenerational support not only has the utilitarian nature of resource exchange but also has an emotional nature with family affection and altruism as the core. Intergenerational emotional support is an important guarantee for the mental health of elderly people. The role exit theory holds that old age is a process of withdrawing from social roles, interpersonal relationships, and value systems in middle age, and is manifested as less participation in social activities at the social level. The social interaction goals of the elderly shift to emotional regulation and a limited perception of future time, and they will autonomously narrow their social network invest more in intimate relationships and obtain higher happiness and satisfaction from them. However, the increasingly severe marriage market makes children pay more attention to their own marriage problems and life pressures, and they tend to ignore their parents emotionally, and even neglect daily interactions and concerns[9]. The reduction of emotional support perceived by parents will intensify their sense of loneliness and psychological imbalance, further having a negative impact on their subjective well-being. This paper puts forward the following hypothesis: H3: The perception of the marriage squeeze of the younger generation reduces the subjective well-being of elderly people by reducing the emotional support from the offspring to the parent generation. First of all, according to the role exit theory, in the context of universal marriage culture, the social participation pattern of parents will change significantly. Secondly, according to the social comparison theory, the rural social network has the characteristics of a relatively small information circulation range and high communication efficiency, which largely strengthens the comparative psychology of elderly people. In such a social network, the marital status of children naturally becomes a key focus for elderly people to compare with each other. Some parents whose children are unmarried at an older age may have the idea that their children's marriages are not as good as others due to the discussions about their children's marriage topics by others when they participate in community collective activities or family gatherings, causing elderly people to perceive themselves as being in a \"disadvantaged position\" in the comparison and forming a sense of psychological loss and perception of discrimination[10][11]. Yang Yongjiao[12]pointed out that social participation can meet individuals' entertainment and social needs, thus having a positive impact on subjective well- being. This paper puts forward the following hypothesis: H4: The perception of the marriage squeeze of the younger generation reduces the subjective well-being of elderly people by reducing their willingness to participate in social activities.",
    "This paper selects multiple linear regression as the main model. The regression models of the three specific dimensions and the comprehensive dimension without control variables are as follows: In this study, the explained variable, \"the subjective well-being of elderly people\", is measured by a Likert scale scored from 1 to 5. Among them, a score of 1 represents \"extremely unhappy\", and the respondents may continuously feel unhappy, pessimistic, and lack a sense of satisfaction with life; a score of 5 represents \"extremely happy\", and the respondents' lives are full of happiness and a sense of satisfaction, often feel happy and excited, and are very satisfied with all aspects of their lives. In this study, the entropy weight method, an objective weighting technique, is used to calculate the weight values of competition in the marriage market, social public opinion pressure, intergenerational responsibility awareness, as well as the weight value after integrating all dimensions respectively. The formula is as follows: i,j=1 yij Ej is the sum of the standardized values of all n data points of this indicator, and is the dj information entropy of the j-th indicator. is the difference coefficient of the j-th indicator, m is the Wj Scorei total number of indicators, is the weight of the j-th indicator, and is the comprehensive score of the i-th data point. The following formulas are obtained. In this study, the control variables include the personal characteristics of the respondents (age, gender, educational level, marital status, health status, whether they participate in medical insurance, monthly income level) and family characteristics (annual family income, family assets, the number of children and grandchildren, the distance from the city center, the highest educational level among family members). The results show that for every one-unit increase in social public opinion pressure, the subjective well-being of elderly people decreases by 0.801 and 0.644 units respectively. The regression results of intergenerational responsibility awareness on the subjective well-being of elderly people under the conditions of no control variables and with control variables. From the results, it can be seen that for every one-unit increase in social public opinion pressure, the subjective well-being of elderly people decreases by 1.478 and 1.250 units respectively. Finally, under the conditions of no control variables and with control variables, for every one-unit increase in the perception of the marriage squeeze of the younger generation, the subjective well-being of elderly people decreases by 2.451 and 2.145 units respectively. Thus, H1 has proven. This study uses the method of replacing the explained variable to test the validity of the benchmark regression results. The core explained variable, subjective well-being, is replaced with life satisfaction, and the OLS estimation method is used for estimation. It can be observed that the perception of the marriage squeeze of the younger generation and its various dimensions have a significant negative impact on life satisfaction in both models. For the perception of the marriage squeeze of the younger generation, the regression results are -3.196 and -2.837 under the conditions of no control variables and with control variables respectively. Generally speaking, after replacing the proxy variable of the subjective well-being of elderly people, the model is still robust, and the main conclusions of this paper remain unchanged. Next, this paper further explores the heterogeneity of the impact of the perception of the marriage squeeze of the younger generation on the subjective well-being of elderly people with different characteristics. Heterogeneity tests are respectively conducted on groups with different ages, genders, incomes, and living patterns. This study grouped the age variable to explore the possible differences in the impact of the perception of the marriage squeeze of the younger generation on the subjective well-being of elderly people among different age groups. The perception of the marriage squeeze of the younger generation has a more significant negative impact on the subjective well-being of elderly people over 60 years old, with a regression coefficient of -2.9468. Compared with the group of people under 60 years old (-0.8830), the degree of influence is greater and more intense. Grouped by gender, this study explored the possible differences in the impact of the perception of the marriage squeeze of the younger generation on the subjective well-being of elderly people among different genders. The regression results show that the perception of the marriage squeeze of the younger generation has a more intense impact on the subjective well-being of female elderly people, with a regression coefficient of -3.2006, which is much higher than -1.4799 for male elderly people. This finding reveals the differences in the impact of the perception of the marriage squeeze of the younger generation on subjective well-being among different genders. Women's roles in the family often focus more on maintaining emotions and family relationships.",
    "The overall sample was divided into two groups according to the living pattern: living with children and not living with children. The multiple regression results of those living with children and those not living with children. The results show that for elderly people living with their children. This indicates that for elderly people, the perception of the marriage squeeze of the younger generation has a stronger impact on the subjective well-being of those not living with their children compared to those living with their children. This study refers to the approach of Xue Xindong et al. (2017) which divides the overall sample into two groups based on whether the income is greater than 1000 yuan and conducts multiple regressions for each group respectively. The regression results in columns (3) and (4) of Table 5 show that for elderly people with a monthly income of less than 1000 yuan, the negative impact of the perception of the marriage squeeze of the younger generation on their subjective well-being is more significant. To further explore the transmission path of the perception of the marriage squeeze of the younger generation on the subjective well-being of the elderly, this study introduces three core dimensions: economic support, emotional support, and social participation, and uses the mediating effect model for analysis. The empirical results are shown in the following table. The regression results of the perception of the marriage squeeze of the younger generation on the transfer payments from the parental generation. When the perception of the marriage squeeze of the younger generation increases by 1 unit, the transfer payments from the parental generation will increase by 2.232 units. Thus, H2 is proven. The regression results of the perception of the marriage squeeze of the younger generation on the support fees from the offspring. When the perception of the marriage squeeze of the younger generation increases by 1 unit, the support fees from the offspring will decrease by 1.327 units. Thus, H3 is proven. The increase in the perception of the marriage squeeze of the younger generation will significantly reduce the support fees from the offspring, thereby significantly reducing the subjective well-being of parents. Column (1) of Table 9 reports the regression results of the perception of the marriage squeeze of the younger generation on emotional support. When the perception of the marriage squeeze of the younger generation increases by 1 unit, emotional support will decrease by 0.858 units. Thus, H4 is proven. The regression results of the perception of the marriage squeeze of the younger generation on social participation. When the perception of the marriage squeeze of the younger generation increases by 1 unit, the likelihood of participating in social activities and the frequency of social participation will decrease by 0.237 and 1.067 units respectively. Thus, H5 is proven. First, through the benchmark regression, it is found that the perception of the marriage squeeze of the younger generation indeed has a negative impact on the subjective well-being of elderly people. Second, through the analysis of the mediating effect, it is found that the perception of the marriage squeeze of the younger generation reduces the subjective well-being of elderly people through four paths: increasing transfer payments from the parental generation, reducing support from the offspring, decreasing social participation, and weakening emotional support. The results of the further heterogeneity analysis show that the well-being of the elderly elderly people over 60 years old is more affected by the perception of the marriage squeeze of the younger generation than that of the younger elderly people under 60 years old. The well-being of female elderly people is more affected by the perception of the marriage squeeze of the younger generation than that of male elderly people. The well-being of elderly people living with their children is less affected by the perception of the marriage squeeze of the younger generation than that of elderly people not living with their children. Our research team puts forward constructive suggestions in three aspects: building rural civilization, resolving the difficult problem of the younger generation's marriage, and enhancing the well-being of rural elderly people. (1) The government should adopt a multi-dimensional governance strategy: First, improve the legal and regulatory system. By formulating special policies, clearly prohibit bad habits such as exorbitant betrothal gifts and excessive extravagance at weddings and funerals, providing institutional guarantees for the transformation of social traditions. Second, strengthen the leading role of the Party building. Incorporate the transformation of social traditions into the assessment of (2)Grass-roots Parties and government organs should give full play to the regulatory and guiding role of village regulations and folk conventions, and adopt systematic restrictive measures to promote the work of transforming social traditions. County and township Party committees and governments should strengthen the guidance on the formulation and revision of village regulations and folk conventions, focusing on enriching contents such as new ways of handling weddings, simplified funerals, and filial piety and respect for the elderly, to ensure that they keep pace with the times and are operable.",
    "(3) The government should take systematic measures from two dimensions of reducing the economic burden on families and improving the social security system to promote the marriage and childbearing willingness and marriage security of the young generation. First, implement diversified economic incentive policies: Establish special childbearing subsidies covering key links such as prenatal and postnatal check-ups, childbirth expenses, and childcare expenditures. Second, focus on building a complete childcare support system: Increase financial investment, expand infrastructure such as inclusive nurseries and kindergartens, and improve the quality of childcare services."
]