[
    "ISSN: 2576-8484 Vol. 9, No. 6, 166-179 2025 Publisher: Learning Gate DOI: 10.55214/25768484.v9i6.7762 © 2025 by the authors; licensee Learning Gate 1Management and Science University, Malaysia; 012021090952@gsm.msu.edu.my (M.Y.) 2Graduate School of Management, Management and Science University, Shah Alam, Malaysia; asad_ur@msu.edu.my (A.U.R.) 3Faculty of Business Management and Professional Studies, Management and Science University, Shah Alam, Malaysia; Ayesha_nawal@msu.edu.my (A.N.) Abstract: Tourism e-commerce live streaming has become a vital marketing tool for travel businesses, yet sustaining user engagement remains challenging. This study aims to explore how perceptual elements in live streaming influence users’ value co-creation behaviors, with perceived value as a mediating factor. Guided by the Stimulus-Organism-Response (SOR) framework, a conceptual model was developed linking perceptual elements (information content, interactivity, and host characteristics), perceived value (functional, emotional, social), and value co-creation behaviors (participation and citizenship). Based on a survey of 472 live stream viewers in Henan Province, data were analyzed using structural equation modeling and the PROCESS macro. Results show that interactivity and host characteristics significantly enhance co-creation through increased perceived value, while information content shows no effect on social value and host characteristics do not influence functional value. Mediation analysis confirms perceived value as a partial mediator. The findings highlight the importance of perceived value in converting perceptual stimuli into co-creation outcomes. Practically, tourism e-commerce platforms should foster co-creation by enhancing content quality, integrating gamified and interactive features, and training professional hosts to stimulate user engagement. In recent years, the live-streaming e-commerce economy has witnessed explosive growth, driven by continuous advancements in internet technology and the widespread adoption of mobile devices. According to institutional projections, China's live streaming e-commerce transaction volume is expected to surpass the trillion-dollar threshold by 2026 [1]. Within this surge, tourism e-commerce live streaming has rapidly emerged as an innovative economic model that integrates destination promotion with real-time interactive sales, attracting significant attention from both industry and academia [2, 3]. Compared with traditional tourism marketing channels, this format demonstrates unique advantages including intuitive information presentation, enhanced interactive experiences, and instant purchase decision-making, offering new pathways for tourism product sales and destination branding [2, 3]. However, the sustainable development of tourism e-commerce live-streaming's remains confronted with multiple challenges. Primarily, inconsistent information quality in live-streaming sessions has been observed, where some hosts prioritize traffic acquisition over professionalism and authenticity, resulting in diminished audience trust that limits users' decision-making and engagement willingness [4]. Second, the one-to-many broadcasting format is frequently constrained by platform algorithms or time History: Received: 18 March 2025; Revised: 30 April 2025; Accepted: 5 May 2025; Published: 2 June 2025 * Correspondence: 012021090952@gsm.msu.edu.my limitations, leading to delayed user feedback and reduced experiential satisfaction. Overall, the delivery of customer experiential value is constrained in tourism e-commerce live streaming as in other product categories, contributing to issues such as low satisfaction ratings, reputation management difficulties, and ineffective marketing outcomes [5, 6]. This situation ultimately threatens the sustainability of both tourism e-commerce live streaming and enterprise operations. The introduction of the value co-creation concept provides a novel theoretical framework for addressing sustainability challenges in tourism e-commerce live streaming. Value co-creation emphasizes bidirectional or multilateral interactions between enterprises (or platforms) and users throughout production, dissemination, and consumption phases which enabling synergistic value enhancement and resource optimization [7]. Within tourism e-commerce live streaming, user value co- creation is manifested not only through participatory behaviors (e.g., feedback, comments, inquiries) but also via citizenship behaviors such as experience sharing, content co-creation, and social diffusion. Empirical evidence confirms that customer participation in value co-creation exerts significant positive effects on loyalty, satisfaction, word-of-mouth, and purchasing behavior [8, 9]. Consequently, the promotion of user participation in value co-creation is posited as a mechanism to ameliorate existing deficiencies in tourism e-commerce live streaming development. Value co-creation has been extensively researched in service marketing and consumer behavior. However, empirical studies specifically examining tourism e-commerce live streaming contexts remain limited, particularly regarding the mechanisms through which perceptual elements shape user value co- creation behaviors. Existing literature predominantly examines macro-level metrics such as transaction conversion rates, user satisfaction, and electronic word-of-mouth dissemination in live-streaming commerce [6, 10] with limited exploration of micro-level cognitive-affective-behavioral processes. Notably, systematic research employing the Stimulus-Organism-Response (SOR) theoretical framework remains absent. According to SOR theory, external stimulus shape individuals' internal states, which subsequently drive behavioral responses. Applying this framework to tourism e-commerce live streaming could elucidate how perceptual elements in live-streaming environments influence customers' value perceptions, ultimately determining their value co-creation behaviors. Such insights would enable operators to strategically optimize element delivery mechanisms, thereby enhancing user engagement in value co-creation activities.",
    "Building upon this foundation, the current research investigates perceived elements in tourism e- commerce live streaming and their impact on user value co-creation behaviors. Guided by the Stimulus- Organism-Response (SOR) framework, a conceptual model was developed where perceived elements in tourism live streaming function as stimuli, with tourists' perceived value serving as the mediating organism. This model was empirically validated through systematic investigation. The study's contributions are twofold. Theoretically, it establishes dimensional constructs and measurement protocols for tourists' perceived elements in live streaming contexts, expands the research scope of e- commerce live-streaming, and enriches value co-creation theory through contextual adaptation. Practically, the findings provide actionable insights for tourism enterprises to optimize live-stream strategies, facilitate user-driven value co-creation behaviors, and enhance organizational sustainability. The Stimulus-Organism-Response (SOR) theory, initially proposed by Mehrabian and Russell [11] provides a framework to explain how environmental factors influence individuals' behavioral responses. This theory posits that external stimuli from the environment affect observable responses through the mediation of internal organismic states. In tourism live streaming environments, users' perceptions of streaming elements act as external stimuli. These perceptual inputs subsequently influence tourists' behavioral responses, including value co-creation actions like interactive engagement and knowledge dissemination, mediated by cognitive and affective evaluations (i.e., perceived value) [12]. The SOR framework has been extensively utilized in consumer behavior research and has demonstrated Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 6: 166-179, 2025 DOI: 10.55214/25768484.v9i6.7762 © 2025 by the authors; licensee Learning Gate significant applicability in live streaming studies [13, 14]. Building upon this theoretical foundation, a research model was developed to investigate user value co-creation behaviors in tourism e-commerce live streaming through the SOR lens. Tourism e-commerce live streaming represents a prevalent category within tourism live streaming formats. Tourism experience live streaming, an earlier-developed format, enables real-time sharing of travel experiences, scenic spot demonstrations, and destination cultural narratives. Primarily serving promotional and educational purposes rather than direct sales, its operators typically include local governments, cultural organizations, and key opinion leaders (KOLs). Emerging alongside the e- commerce live streaming boom in recent years, tourism e-commerce live streaming prioritizes transactional objectives. It facilitates real-time product exhibitions and instant sales of tourism-related merchandise including hotel bookings, attraction tickets, and travel packages, predominantly operated by e-commerce platforms and tourism enterprises. This investigation specifically focuses on the latter category. Perceived elements in tourism live streaming encompass tourists' multidimensional evaluations of information content, interactive experiences, and environmental ambiance during viewing sessions. This construct is inherently subjective. Scholars have proposed dimensional categorization and measurement frameworks for user-perceived elements across various product categories in e-commerce live streaming. From a unidimensional perspective, Guo, et al. [13] measured live-stream characteristics as a single construct when investigating their impact on consumer purchase intentions in cross-border e- commerce platforms. Other scholars have focused on individual perceptual elements, such as interactivity and host characteristics, to examine their effects on live-stream users [15, 16]. In multidimensional frameworks, one study exploring immersive experiences and participatory behaviors categorized influencers as host characteristics and live-stream attributes (interactivity, applicability, entertainment value, and harmony)Tian and Frank [17]. Xu, et al. [18] identified host attractiveness, parasocial interaction, and information quality as key user-perceived factors influencing behaviors in e- commerce live-streaming. These studies developed measurement scales with varying degrees of similarity. Compared with other e-commerce live streaming categories, tourism-focused formats require not only detailed product and promotional information to stimulate purchase intention, but also emphasize destination knowledge dissemination and comprehensive travel strategy guidance to facilitate users' decision-making processes. Building upon prior e-commerce live streaming research and expert consultations, this study proposes a tripartite framework of perceived elements: informational content, interactive dynamics, and host characteristics. The measurement scales were developed accordingly, with card sorting techniques applied to refine informational content items. Detailed specifications are provided in the questionnaire design and variable measurement sections. Perceived value, a central construct in consumer behavior research, encapsulates individuals' multidimensional cognitive evaluations of product/service utility during consumption processes. This conceptual framework was initially conceptualized by Zeithaml [19] through the \"consumer-perceived value\" paradigm. The construct's essence lies in consumers' holistic trade-off between transaction utilities derived from subjective experiences, specifically juxtaposing price-mediated perceptions of sacrifice against product-mediated assessments of quality or benefit [20]. At the empirical level, perceived value has been validated as a critical determinant of consumers' purchase decisions, satisfaction, and loyalty [21]. For instance, Research investigated the significant impact of perceived value on customer loyalty within green consumption [22]. Regarding dimensionality and measurement, a standardized scale proposed by Voss, et al. [23] divided perceived value into a dual structure comprising utilitarian value and hedonic value. Subsequent studies, including Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 6: 166-179, 2025 DOI: 10.55214/25768484.v9i6.7762 © 2025 by the authors; licensee Learning Gate Chiu, et al. [24] investigation into repeat purchase intentions, have adopted this dual framework to examine its effects. Sweeney and Soutar [21] empirically established a tripartite conceptualization of perceived value: functional value, emotional value, and social value. Functional value denotes practical utility derived from products/services, emotional value reflects affective pleasure during usage, while social value encompasses identity enhancement and social approval through consumption. This tri- dimensional framework has become predominant in perceived value research and has been extensively applied in scholarly investigations [25, 26]. The present study adopts Sweeney and Soutar's tri- dimensional framework, with measurement scales refined based on established instruments.",
    "The conceptualization of value co-creation was initially introduced in 2000 [27]. This framework has evolved alongside the Service-Dominant Logic paradigm, defined as a collaborative process where enterprises and stakeholders integrate resources through interactive engagements to co-produce personalized value [28]. In the digital economy era, such behaviors manifest through consumers' substantive participation in corporate R&D, production, and dissemination processes. Knowledge sharing and content co-creation mechanisms facilitate mutual value enhancement between parties. Empirical studies have demonstrated that value co-creation behaviors significantly enhance service quality and customer satisfaction [29, 30]. The antecedent factors of value co-creation behaviors have been extensively investigated across diverse contexts, with studies exhibiting heterogeneous emphases and findings. For instance, Song, et al. [31] identified seeking assistance, diversion behaviors, social presence, and brand knowledge as critical drivers of value co-creation. Widyastuti [32] posited that personality traits and belief systems constitute fundamental determinants of value co-creation behaviors in e-commerce platforms. Existing measurement approaches for value co-creation remain fragmented due to its nascent research stage. Current instruments are generally categorized into three types: uni-dimensional scales, dual-dimensional scales, and multidimensional composite scales. Uni-dimensional scales focus on direct manifestations of co-creation behaviors. Yi and Gong [33] proposed a dual-dimensional framework distinguishing participation behaviors (e.g., proactive information sharing and rule compliance during service delivery) from citizenship behaviors (e.g., recommendation and advocacy beyond self-interest). Eletxigerra, et al. [34] divides the construct into three dimensions: travel organization, information seeking, and spiritual journey experiences. This study adopts a uni-dimensional conceptualization of value co-creation behaviors, primarily driven by two considerations: (1) the absence of universally accepted dimensional frameworks and scales in extant literature, and (2) the research objective to examine how diverse live streaming perceptual elements holistically enhance tourists' overall co- creation propensity rather than targeting specific behavioral sub-types. Grounded in the Stimulus-Organism-Response (SOR) theoretical framework, a conceptual model was developed with perceived elements in tourism e-commerce live streaming as independent variables, perceived value as the mediating variable, and user value co-creation behaviours as dependent variables. The structural relationships are explicitly illustrated in Figure 1. Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 6: 166-179, 2025 DOI: 10.55214/25768484.v9i6.7762 © 2025 by the authors; licensee Learning Gate Perceived elements have been identified as critical behavioral determinants in e-commerce live streaming research. Empirical evidence reveals that bullet-screen information characteristics and interactive features significantly influence user participation behaviors [35] while perceptions of product information, host influence, and interactivity shape purchasing decisions [17]. Additionally, host attributes of live-streaming directly affect user buying intentions [15]. These findings collectively support hypotheses H1a-H1c. The digital economy has fundamentally reshaped consumer purchase journeys and value perceptions. Research demonstrates that service quality positively influences perceived utility and perceived value. Furthermore, through perceived trust, influencer characteristics also contribute significantly to the enhancement of perceived value [36, 37]. Additional studies investigating consumers' repurchase intentions in livestream e-commerce reveal that perceived value is significantly shaped by host expertise and interactivity [38]. These theoretical foundations justify hypotheses H2a- H2c, H3a-H3c, and H4a-H4c. Customer perception theory posits that perceived value serves as a pivotal antecedent variable in consumer behavior research, critically mediating decision-making processes [19]. In e-commerce livestreaming research, studies examining the impact of livestream features on purchase behaviors have Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 6: 166-179, 2025 DOI: 10.55214/25768484.v9i6.7762 © 2025 by the authors; licensee Learning Gate confirmed the positive influence of perceived value on consumer purchasing decisions [39]. Research on tourism behaviors similarly demonstrates that perceived value enhances behavioral outcomes, including word-of-mouth, satisfaction, and revisit intentions [40]. Studies on social media advertising further reveal that perceived advertising value positively drives consumer value co-creation behaviors [41]. This multidisciplinary consensus substantiates hypotheses H5a-H5c. Building upon the SOR framework and the aforementioned relational hypotheses, this study postulates that perceived elements in live streaming act as stimuli to activate tourists' functional and emotional value perceptions, which subsequently drive value co-creation behaviors. This causal chain establishes hypotheses H6a-H6c. The research model incorporates seven core constructs: information content, streaming interactivity, host characteristics, functional value, emotional value, social value, and co-creation behaviors. These variables were measured using a combination of self-developed scales and adapted instruments from established studies. Perceived value dimensions were assessed through 12 items primarily adapted from Sweeny and Soutar's seminal work [21]. Value co-creation behaviors were operationalized using 6 unidimensional items distilled from Yi and Gong's scale (Yi & Gong, 2013). Three perceptual elements in live streaming (information content, interactivity, host characteristics) were measured via self-developed scales informed by literature review and consultations with domain experts in Henan Province. The information content dimension (6 items) captures users' perceptions of destination imagery and product information characteristics, specifically evaluating informational richness, reliability, clarity, and usefulness. Streaming interactivity (4 items) measures perceived interaction dynamics, including host communication, peer engagement, conversational atmosphere, and interaction channels. Host characteristics (4 items) assess presenter attributes across four facets: articulation clarity, emotional appeal, professional competence, and approachability.",
    "Collectively, the measurement model comprises 32 items rated on a 5-point Likert scale (1=strongly disagree to 5=strongly agree). The questionnaire additionally collected demographic data through 5 items measuring gender, age, educational attainment, occupation, and monthly income. A hybrid online- offline data collection approach was implemented. Target locations included Henan-based tourism destinations operating Douyin-powered e-commerce live streaming rooms, such as Laojun Mountain Scenic Area (1.5 million followers). Participants comprised users and tourists who had engaged with destination-based tourism live streaming. A pilot survey conducted in March 2024 yielded 73 valid responses. SPSS analysis revealed a Cronbach's alpha of 0.89 for the full instrument, with all subscale coefficients exceeding the 0.7 reliability threshold. Exploratory factor analysis demonstrated satisfactory construct validity, showing 72.3% cumulative variance explained across hypothesized dimensions. The formal survey in May 2024 collected 411 online and 196 offline responses. After excluding 135 invalid submissions due to incomplete entries, response duplication, or implausible completion times, 472 valid questionnaires were retained, achieving a 77.76% validity rate. Demographic analysis revealed the following characteristics: female participants predominated (n=303, 63.5%). Age distribution peaked in the 18-25 cohort (34.7%), followed by 26-35 (30.7%) and 36-50 (14.4%). Educational attainment was concentrated at undergraduate (45.7%) and postgraduate levels (31.5%). Occupational distribution predominantly included educators, students, civil servants, corporate employees, and freelancers. Income analysis showed 40.2% earning CNY 5,001-10,000 monthly and 35.5% in the CNY 3,001-5,000 bracket. The valid sample exhibited distinct youth orientation, moderate income levels, and advanced educational backgrounds. The occupational diversity enhances the representativeness of research findings. Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 6: 166-179, 2025 DOI: 10.55214/25768484.v9i6.7762 © 2025 by the authors; licensee Learning Gate This study primarily utilised SPSS 27.0 and AMOS 25.0 for data analysis. First, the reliability of the full measurement scale was tested via SPSS to ensure data consistency, followed by exploratory factor analysis (EFA) to validate the livestream perceptual elements scale. Confirmatory factor analysis (CFA) was then conducted to assess the overall scale’s validity. Second, under confirmed reliability and validity conditions, structural equation modeling (SEM) was employed in AMOS to evaluate model fit indices and path coefficients. Finally, the mediating effects of perceived value between livestream perceptual elements and user value co-creation behaviors were examined using the SPSS PROCESS macro. Exploratory factor analysis (EFA) was conducted to validate tourism e-commerce live streaming perceptual elements scale. The KMO measure of 0.896 indicated strong inter-variable correlations, confirming factor analysis suitability (Hair et al., 2024). Bartlett’s test of sphericity yielded a significant χ² = 3988.435 (p < 0.001), reinforcing strong variable correlations and scale adequacy for factor extraction [42]. Principal component analysis with varimax rotation extracted six common factors (eigenvalues >1), achieving 74% cumulative variance explained. All factor loadings exceeded 0.7, demonstrating strong structural validity (see Table 1). Subsequent confirmatory factor analysis (CFA) evaluated reliability (α coefficients and composite reliability, CR), standardized loading, convergent validity (Table 2), and discriminant validity (Table 3). Results demonstrated satisfactory internal consistency with α coefficients >0.8 and CR values >0.70 [43]. Convergent validity was established as all average variance extracted (AVE) exceeded 0.5. Discriminant validity was confirmed via the Fornell-Larcker criterion, where the square roots of AVE for each latent variable surpassed inter-construct correlations [1]. Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 6: 166-179, 2025 DOI: 10.55214/25768484.v9i6.7762 © 2025 by the authors; licensee Learning Gate The maximum likelihood estimation method was used in AMOS 25.0 to compute model fit indices and path coefficients. The model yielded a chi-square/df ratio of 1.371, a goodness-of-fit index (GFI) of 0.924, an adjusted GFI (AGFI) of 0.910, a root means square error of approximation (RMSEA) of 0.028, a normed fit index (NFI) of 0.940, an incremental fit index (IFI) of 0.983, and a comparative fit index Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 6: 166-179, 2025 DOI: 10.55214/25768484.v9i6.7762 © 2025 by the authors; licensee Learning Gate (CFI) of 0.983. All indices fell within the recommended thresholds, suggesting that the model demonstrates a good fit and the theoretical assumptions are well supported. Further path coefficients and hypothesis testing results are presented in Table 4 and Figure 2. The results showed that the path coefficients for H1a–H1c were all greater than zero and statistically significant, indicating that IC, LI, and HC each exert a significant positive effect on VCB. Hypotheses H1a–H1c were therefore supported. The path coefficients for H2a and H2b were also positive and significant, suggesting that both IC and LI positively influence FV. Thus, H2a and H2b were supported. Although the path coefficient for H2c was positive, its p-value was 0.431 and not statistically significant, indicating that HC does not have a significant positive influence on FV. Therefore, H2c was not supported. The path coefficients for H3a–H3c were all positive and significant, implying that IC, LI, and HC significantly affect EV. Hence, H3a–H3c were supported. H4b and H4c exhibited positive and significant path coefficients, indicating that both LI and HC significantly impact SV. As such, H4b and H4c were supported. The path coefficient for H4a was positive but not significant (p = 0.708), suggesting that IC does not significantly influence SV. Thus, H4a was not supported. Path coefficients for H5a–H5c were all positive and significant, showing that FV, EV, and SV each exert a significant positive influence on VCB. Accordingly, H5a–H5c were supported.",
    "Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 6: 166-179, 2025 DOI: 10.55214/25768484.v9i6.7762 © 2025 by the authors; licensee Learning Gate Model M4 in the PROCESS macro for SPSS was employed to test the mediating effect of perceived value between live-streaming perceptual elements and users’ value co-creation behaviors. Details are presented in Table 5. The analysis reveals that the total effect of live-stream perceptual elements on value co-creation behaviors (VCB) is 0.8666. The direct and indirect effects mediated through functional value (FV) are 0.7691 and 0.0976, respectively. For emotional value (EV), the direct and indirect effects register 0.6697 and 0.1970, while social value (SV) demonstrates direct and indirect effects of 0.7581 and 0.1086. All 95% confidence intervals exclude zero, statistically supporting hypotheses H6a, H6b, and H6c. This confirms the partial mediating roles of FV, EV, and SV in linking live-stream perceptual elements to VCB. Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 6: 166-179, 2025 DOI: 10.55214/25768484.v9i6.7762 © 2025 by the authors; licensee Learning Gate This study empirically analyzed the impact of perceived elements in tourism live-streaming on users’ value co-creation behaviors, verifying the mediating role of perceived value. The results indicate that perceived elements—information content, live-stream interactivity, and host characteristics— significantly and positively influence users’ value co-creation behaviors. Functional value, emotional value, and social value act as partial mediators between live-stream perceptual elements and value co- creation behaviors, demonstrating that users’ evaluations of functional, emotional, and social benefits significantly affect their subsequent co-creation actions. Notably, host characteristics showed no significant effect on functional value in tourism e-commerce live-streaming, which partially contradicts findings from Chen, et al. [44] research on mukbang live streaming commerce and green agri-food products consumption Chen, et al. [44]. This discrepancy may arise from sample bias or industry-specific consumer behavior differences. Additionally, information content did not significantly influence social value. Potential explanations include: (1) information content primarily fulfills functional needs rather than fostering social identity; (2) users prioritize personal decision-making over social image construction during live-stream interactions. This study validates the extension of the Stimulus-Organism-Response (SOR) framework in tourism live-streaming contexts, where information content, livestream interactivity, and host characteristics are operationalized as environmental stimuli, while functional, emotional, and social values represent users’ organismic states. This theoretical advancement provides a foundational framework for analyzing digital consumer behaviors. A three-dimensional perceptual elements model (information content, interactivity, host characteristics) is established, offering a replicable measurement structure for assessing live-stream environments. The model demonstrates cross-industry applicability, particularly in hybrid commerce contexts where traditional tourism integrates with e-commerce live- streaming. The research clarifies the mediating mechanisms of perceived values, revealing distinct roles: functional value mediates utilitarian outcomes, emotional value drives experiential engagement, and social value facilitates identity-based interactions. Tourism e-commerce live-stream platforms should integrate real-time destination analytic, user- generated reviews, and AI-powered personalized recommendations to establish a multidimensional information framework. Embedding interactive maps and 360° virtual tours can enhance the informational depth and contextual relevance, enabling tourists to efficiently access critical decision- making data. Gamified interaction mechanisms, such as virtual scavenger hunts and engagement-based loyalty point systems, should be incorporated into live-stream designs. Concurrently, AI chat-bots with multilingual capabilities should be deployed for 24/7 query resolution, lowering participation barriers and improving interaction fluency to foster immersive experiences. For professionalising host teams, micro-certification programs in destination expertise should be developed, complemented by biometric feedback tools to refine hosts' vocal modulation and nonverbal communication. This systematic approach cultivates emotional storytelling skills and improvisational competence, building user trust and emotional resonance. Differentiated operational strategies must align with market characteristics: experience-driven destinations should prioritize immersive narrative techniques and user-centric interaction interfaces, while price-sensitive markets require dynamic price- comparison overlays and limited-time offer prompts to amplify perceived functional value. Edelweiss Applied Science and Technology ISSN: 2576-8484 Vol. 9, No. 6: 166-179, 2025 DOI: 10.55214/25768484.v9i6.7762 © 2025 by the authors; licensee Learning Gate This study has several limitations. First, the sample was geographically constrained to live-stream- enabled tourist attractions within Henan Province, which may limit the generalizability of findings. Future studies should expand data collection to include diverse regions and conduct cross-provincial comparisons to enhance representativeness. Second, the research examined a limited set of variables. Incorporating additional factors such as tourist motivations and perceived social support could provide a more comprehensive understanding of how live-stream perceptual elements influence value co-creation behaviors. Finally, the cross-sectional design restricts causal inferences. Longitudinal studies tracking the dynamic relationships among live-stream elements, perceived values, and co-creation behaviors over time would better elucidate their evolutionary patterns and long-term impacts.",
    "Ethical review and approval were waived for this study, as it involved anonymous survey data and posed minimal risk to participants. All procedures performed in this study were in accordance with the ethical standards of the Management and Science University (Malaysia) and with the 1964 Helsinki Declaration and its later amendments. The authors confirm that the manuscript is an honest, accurate, and transparent account of the study; that no vital features of the study have been omitted; and that any discrepancies from the study as planned have been explained. This study followed all ethical practices during writing. The authors would like to express their sincere gratitude to all participants who contributed their time and insights to this study. Special thanks are extended to Dr. Asad and Yan Yibing for their valuable guidance and support throughout the research process. The authors also appreciate the constructive comments provided by anonymous reviewers, which greatly improved the quality of this paper. © 2025 by the authors. This open-access article is distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https://creativecommons.org/licenses/by/4.0/)."
]