[
    "Abstract. Compensation management is the core of enterprise human resources management, is not only the distribution of labor reward mechanism, is promoting enterprise strategic ground, talent competitiveness and the key to the healthy development of the organization. Therefore, enterprises should pay attention to the optimization and improvement of compensation management, so as to enhance employees' satisfaction and work motivation, so as to promote the sustainable development of enterprises. This paper, taking a county of henan province nanyang D company (a maternal and child services class confined club) as the research object, focusing on its compensation management problems, combining the theory of fair and hierarchy of needs theory, the paper analyzes the current situation of the company compensation system and the outstanding problems, and put forward the corresponding optimization Suggestions. The results of this study can provide practical reference for D Company to improve its salary competitiveness and reduce the talent turnover rate, and also provide theoretical and empirical reference for small and medium-sized private enterprises, especially in the service industry. In the process of vigorously promoting the rapid development of national economy and realizing Chinese-style modernization, the proportion of private enterprises in China's overall economy is gradually increasing, and the proportion of private enterprises in the national economy is becoming more and more important [1]. However, there are still many problems in the management of human resources in the later stage of this development, especially in enterprise management [2]. Salary management is the core part of enterprise human resource management, which is highly complex and difficult to optimize. Excellent compensation management strategy can effectively stimulate the work vitality and creativity of employees, better retain excellent employees, attract social talents to join, so as to better boost the development of enterprises [3]. The improvement of compensation management mechanism has become a key factor for enterprises to enhance their core competitiveness and sustainable high-quality development [4]. D company is located in the city of henan province nanyang county, with the acceleration of urbanization, the growing demand for maternal and child services, its performance to achieve significant growth in recent years. However, © 2025 The Authors. This is an open access article distributed under the terms of the Creative Commons Attribution License 4.0 (https://creativecommons.org/licenses/by/4.0/). with the continuous expansion of the company's scale and the gradual expansion of the team, the problems in salary management have gradually become prominent, which has become the core problem restricting the long-term steady development of the company. This paper takes D Company as an example, uses the questionnaire survey method to conduct research, analyzes the current situation and existing problems of the compensation system in the enterprise, and puts forward feasible solutions. The research results not only provide a reference basis for the improvement of D company's salary management, but also provide a theoretical basis and practical experience for the development of private enterprises, and also have certain reference significance for promoting the healthy and rapid development of small and medium-sized private enterprises [5]. Proposed by American psychologist John Stacey Adams in 1965, the core idea of fairness theory is as follows: People will judge whether they are treated fairly by comparing the proportion of their own efforts (inputs) and gains (returns) with those of others, and this sense of fairness will directly affect their behavioral motivation and attitude [6]. That is to say, employees will compare their efforts and gains with those of others. If they feel fair, they will be satisfied, so they will be more active in their work. On the contrary, they will be dissatisfied, which will discourage their enthusiasm for work [7]. According to Goodman and Friedman, when employees feel unfair, they may adopt the following five practices: first, they misinterpret their own or others' efforts or gains; (2) to act in a way that changes someone else's effort or gain; The third is to take a certain behavior to change their own pay or gain; The fourth is to choose other reference objects for comparison; The fifth is resignation [8]. In China, Wang Yue and Zhou Changqun applied equity theory to salary management by analyzing the essential causes of brain drain in state-owned enterprises [9]; Wang Chengbin [10] empirically studied the differences of sample characteristics on salary satisfaction and its structure; Zhou Xuejun [11] analyzed the problems existing in the application of equity theory in salary management and put forward the countermeasures to achieve equity in salary management. This paper aims to use the perspective of equity theory in the design of compensation system, and evaluate the compensation system before the company, from two aspects of external equity and internal equity.",
    "Hierarchy theory of needs from Abraham Maslow (Abraham Maslow) in 1943, the demand of the people like ladder from low to high is divided into five layers (physiological needs, security needs, social demand, respect demand, self-actualization needs), when only low level needs have been fulfilled, will pursue higher level of demand [12]. Therefore, in the process of designing the compensation system, enterprises should grasp the needs of employees and design the corresponding compensation system according to the different needs of different employees [13]. At home, Li Bohui [14] think, combining the theory of maslow's hierarchy of needs of enterprise salary management system, more rational, to realize the scientific development of the enterprise. Tang Fengli comprehensively analyzed the university teachers' requirement, in order to implement comprehensive compensation management system strategy [15]. Based on maslow's hierarchy of needs, to explore how to meet the needs of employees at different levels, to better understand the needs of employees, to know the organization design the corresponding management measures to meet the needs of employees. Founded in 2022, Company D is one of the early moonbirth clubs established in a county in Nanyang City. It has developed steadily in the market of maternity and baby moonbirth centers in the city and continuously stabilized its business scope. Adhering to the corporate mission of \"Let every family experience happy pregnancy\", D Company is committed to providing customers with excellent service experience with the values of \"professionalism, care, meticulousness and responsibility\". The company's services are comprehensive and professional, covering maternity care, infant care, postpartum repair, baby bath, nutritional meals, maternal and child products sales and other fields of business, the existing staff of more than 60 people, covering sales department, maternal and child department, nursing department, industry and health department, water bath department, kitchen department, administration department and other departments. The organizational structure of D company is shown in figure 1 below. The salary level of D Company is affected by various factors such as industry salary standard, enterprise scale, financial status of the company and personal ability of employees. The salary range of the county seat where D company is located is between 1500 and 15000 yuan. The company takes slightly higher than low salary as the basic salary, and mainly combines performance bonus to form the final salary of employees, ensuring that the salary level of some employees is above the middle level in urban areas. At present, the company's salary system is mainly composed of fixed salary and floating salary: fixed salary includes post level basic salary and length of service salary. The basic salary of the post level is determined according to the responsibility and skill level of the employees, while the seniority salary is the reward for the long-term service employees. Variable pay includes performance pay, performance bonus and subsidies. Performance pay is directly related to the performance of employees, while performance bonus is linked to the economic benefits created by employees for the company. For the special and critical position of maternal and child care specialist, the club adopts a tiered daily salary base salary and a salary system based on customer order evaluation. The specific situation is detailed in. (1) the sales department, nursing department, production department, the department of water bath, kitchen department and administration department after compensation has the following four major parts: the basic salary, seniority salary, commission and bonuses, subsidies. Basic salary: set a fixed standard according to the type of position, and pay monthly. The base salary schedule is shown in table 1 Seniority pay: The company pays the seniority pay according to the number of years the employee has worked in the company, that is, the accumulation of the employee's work experience and labor contribution. The specific method is to increase 100 yuan/month after one year of employment, and then increase 100 yuan every year after that, with five years as the upper limit. Commission of water bath department = order package ×0.05+ number of handicraft fee ×5 yuan Bonus: monthly payment, the calculation method is linked to the staff's work completion rate, the specific composition is as follows: Bonus = $100 + perfect attendance pennants prize (100 yuan income pennants several x) + good awards 100 + introduction award (customers and complete the signing singular x 200 yuan) + performance standard 100 + team awards (all the employees, 500 yuan per person) Basic salary: The club adopts the daily basic salary system of hierarchical division. The post level salary = the daily salary value corresponding to the post level and salary. Level appraisal combines staff skills and customer evaluation. If the customer has no poor evaluation, the club can be promoted to one level after completing three orders; If there is a poor evaluation, the daily salary of each level can be directly reduced by one level. See table 2.",
    "The salary system satisfaction survey is conducted for all employees, including employee personal situation survey and salary satisfaction survey. The questionnaire was distributed anonymously and only investigated positions and working years; The salary satisfaction survey covers basic salary, performance bonus, welfare benefits, promotion opportunities and other dimensions, aiming to comprehensively understand the satisfaction and expectation of employees on the salary system, and provide strong support for the development of more attractive salary strategies. The survey, 63 employees of our company to issue the electronic questionnaire, recycling questionnaire, a total of 59 59 valid questionnaires, the questionnaire comprehensive efficient was 93.65%, and the specific situation see questionnaire recovery table 3. Compared with the local salary level, only 22.22% thought that the salary level was slightly higher than the local salary level, indicating that the salary level of the employees was at the medium level in the local area. For overall satisfaction D company pay levels, 33.33% of employees feel generally, that some employees to become dissatisfied with the pay system. Compared with colleagues in the same industry and the same position, only 22.22% thought that the salary system of D company was slightly higher than that of peers, indicating that the salary system of D company does not have strong competitiveness in the industry. Compared with colleagues in the same position in the company, 22.22% of employees think that the salary satisfaction is slightly lower than that of their colleagues, indicating that the salary satisfaction of the same position is not balanced. In the compensation level of employees satisfaction survey, no employees feel very satisfied, and 33.33% think generally, indicating that some employees of salary system. The bar chart of the proportion of the number of employees corresponding to the five options to the total number of employees in this survey is shown in figure 3. 11.11% of employees thought that the fairness of compensation distribution was general, indicating that the fairness of compensation in the company was insufficient. In the satisfaction survey on the salary difference between different positions in the company, 33.33% of the employees thought it was general, indicating that there were differences in the fairness of the salary system in different positions. The bar chart of the proportion of the number of employees corresponding to the two options to the total number of employees in this survey is shown in figure 4. In the survey of satisfaction with the overall benefits provided by D Company, 55.55% of the employees felt that the benefits were average, indicating that half of the employees were dissatisfied with the benefits policy. It is worth noting that in training and learning opportunities provided by the company's satisfaction survey, 11.11% of employees feel generally, should be paid great attention to the company. The bar chart of the number of employees corresponding to the specific three options in the total number of employees in this survey is shown in figure 5. Combined with equity theory, demand hierarchy theory and the present situation of D company salary system, the actual operations through the questionnaire survey and observation, found its Although D Company claims that the salary of some employees is above the middle level in urban areas, there is a gap in the salary of core positions in D Company regarding the salary data of the same type of moonbirth club in Nanyang City (the survey shows that the average daily salary of local maternal and child care teachers is 115-492 yuan, and the basic salary of department heads is generally 3000-4000 yuan). For example, the daily salary of Grade 5 maternal and child care teachers is 190 yuan, which only reaches the middle and lower level of the market. The monthly basic salary of the directors of sales department and industry and health department is 2500 yuan, which is about 20% lower than the average level of the market, which will lead to the phenomenon that excellent nursing teachers and sales backbone are powled by competitors. Company did not establish a normalized market salary survey system, the industry dynamic, regional wage guidelines update lag compensation, lead to pay adjustment the lack of data to support. For example, in 2024, the monthly minimum wage standard of the three types of administrative regions in Nanyang City is 1800 yuan, and the basic salary of ordinary employees in the administration department is still 2000 yuan, which is only slightly higher than the minimum wage, and it is difficult to reflect the post value.",
    "As can be seen from table 2, most departments only distinguish two levels of \"supervisor\" and \"ordinary employee\", and do not specify the levels according to the complexity of job responsibilities and skill requirements. For example, the basic salary of the ordinary staff in the nursing department is 2500 yuan, which is the same as that of the sales director. However, the nursing post requires 24-hour shifts and bears the risk of neonatal care, so the post value is not fully reflected, which is easy to lead to the unfair feeling of \"working more for less\". The commission calculation method of each department lacks a unified standard, and there is a phenomenon of \"different pay for the same work\" : the commission of the sales department is linked to the transaction amount of the order (0.03 ratio), but there is no distinction between new and old customers and the size of the order, resulting in the imbalance of the effort-return ratio between small orders and large orders; The commission standard of \"shampoo times ×5 yuan\" in the Department of Industry and Health is consistent with that of \"handwork times ×5 yuan\" in the Department of Water Bath. However, the commission standard does not reflect the difference in skills due to the higher requirements for professional skills in the department of industry and health. Seniority salary is calculated by the standard of \"100 yuan per year, capped at five years\", and will not increase after five years. Although D company has only been established for more than 3 years, the system is difficult to reflect the long-term service value for the old employees who have worked for five years in the future, and the phenomenon of old employees job-hopping is easy to occur. The proportion of fixed salary for non-business positions such as administration department and kitchen department is as high as 80%, but the basic salary standard is too low to meet the physiological needs of employees (such as the rising cost of living); While the floating salary of sales department, industry and health department and other business positions accounts for more than 60%, but the performance commission rules are unstable, resulting in employees' lack of sense of security. The current bonus system mainly focuses on material rewards such as \"full attendance award and good evaluation award\", and does not involve respect needs (such as honorary titles and skill certification) and self-realization needs (such as training opportunities and promotion channels). For example, the promotion of maternal and child care teachers is only linked to \"order quantity and poor customer evaluation\", which is not included in the skill assessment (such as the upgrading of the qualification certificate of child care teachers), which is difficult to stimulate the motivation of employees to improve their professional ability. The standard of car subsidy and food subsidy is fixed (100 yuan/month), and the actual commuting distance and family burden of employees (such as breastfeeding time subsidy for lactating employees) are not considered, which is difficult to reflect the consideration of care. Every year, we will jointly investigate the salary data of the maternal and child service industry in Nanyang City and the county, focusing on the salary level of core positions, so that the salary level of D Company is higher than that of 75% of its peers, and the specific adjustment is as follows: the daily salary of maternal and child care teachers is 180 yuan, 190 yuan, 200 yuan, 210 yuan and 220 yuan for the fourth level and the fifth level; The monthly basic salary of department heads: 3500 yuan for sales department and Industry and health Department. The basic salary shall be adjusted synchronously every year according to the Nanyang Consumer Price Index (CPI) and the minimum wage standard to ensure that the fixed salary is no less than 120% of the minimum wage; General adjustment of employees' salaries should be made every two years according to the growth of the company's revenue, and the range of general adjustment should not be less than 3%. The \"factor point method\" (decompose the value of the post into several measurable \"factors\", assign weight and score to each factor, and determine the relative value of the post by adding up the scores of each factor) is used to evaluate the positions of the whole company, scoring from the four dimensions of \"skill requirements, scope of responsibility, work intensity and work environment\". The post is divided into three levels (primary, intermediate and senior), and the basic salary will increase by 200 yuan for each level.",
    "Commission of Industry and Health Department = (shampoos times ×5 yuan + repair times ×10 yuan) × skill coefficient (primary 1.0, intermediate 1.2, senior 1.5); Commission of sales Department = transaction amount of orders × (0.03+ coefficient of customer level) (0.01 for new customers, 0.005 for old customers) The duration of seniority pay will be extended to 10 years and adjusted to \"100 yuan per year for 1-5 years and 150 yuan per year for 6-10 years\", and \"long service bonus\" (10% of the monthly salary of the current year will be paid in a lump sum) will be given to employees who have worked for 10 years to enhance their sense of belonging. Non-business positions (administrative, kitchen) : 80% fixed salary, 20% floating salary (quarterly performance appraisal); Business positions (sales, production and health, nursing) : 60% fixed salary, 40% floating salary (performance commission + annual bonus), and set up a \"guaranteed minimum salary\" for business positions (no less than 80% of the local average salary) to ensure the sense of security of employees. Respect for needs: set up awards such as \"Monthly Excellent Service Star\" and \"Annual Benchmark\", and the winning employees can get honorary certificates and public commendation; Self-realization needs: provide free skills training (such as senior nursery teacher and postpartum rehabilitation teacher certification) for employees who have worked for more than 3 years, and promote their position level and increase their salary after passing the assessment. Car subsidy: employees report consumption vouchers to reimburse their commuting expenses; Special subsidies: 1.5 hours of nursing leave per day (calculated according to normal working salary) will be provided for lactating employees, and an additional night shift subsidy of 20 yuan per time will be provided for night shift employees. As an important leader and participant in the maternal and child service industry in Nanyang City, D Company's salary system optimization is the key to enhance its core competitiveness. By building an external fair and internal balanced compensation system and designing diversified incentive methods based on employees' needs, D company can not only solve the current problems of brain drain and lack of enthusiasm, but also lay a human resource foundation for the company's long-term development. This study only takes D Company as the research object, and the sample scope is relatively narrow, so the research results may not be fully applicable to other similar enterprises. In the process of analyzing salary system problems and formulating optimization suggestions, we mainly rely on questionnaire survey and actual operation observation method, which may have some subjectivity. With the continuous development of the maternal and child service industry and the increasingly fierce market competition, enterprise compensation management will face more new challenges and opportunities. In the future, we can further study how to introduce the new incentive mechanism into the maternal and child service enterprises, explore the compensation management mode more suitable for the characteristics of the industry, and inject new impetus into the sustainable development of enterprises. At the same time, it can also strengthen the research on the psychological needs and career development of employees, combine the compensation management with the enterprise planning of employees, and realize the common growth of enterprises and employees."
]