[
    "International business and management research center, institute of advanced studies in humanities and social sciences Beijing Normal University, 519075, A205, Liyun Building, #18 of Jinfeng Road, Zhuhai City, China Abstract. The futures market serves the real economy is an urgent need to develop the capital market. Studying the interaction between the development of futures market and regional economy is of great significance for promoting their coordination and development, especially for the directional guidance of the development of the futures market in the long term. This paper studies the relationship between them from the perspective of regional economics. Firstly, it analyzes the mechanism of mutual influence between the futures market and the regional economy. Secondly, it establishes a VEC model based on representative data from Henan Province in China to discuss this relationship. The outcome indicates the development of the futures market and the regional economy promote each other in the long-run. At the end of the paper, some policy implications from the conclusion are put forward. In China, the location of a futures exchange is not arbitrarily set. It should adapt to the overall requirements of the coordinated development of regional economy and serve the local real economy. On January 22, 2021, China Securities Regulatory Commission approved establishment of Guangzhou Futures Exchange. On April 19, 2022, the official website of Guangzhou Futures Exchange was officially launched. the So far, the geographical distribution of China's futures exchange map has filled the gap in the Pearl River Delta, achieving a balanced geographical distribution. China's futures market has gone through a journey of more than 30 years since its birth. During this long period, how do China's futures market and the development of local regional economy influence mutually? Have promoted each other? Did the development of futures market comply with the strategic requirements of regional economic development? The resolution of these questions is a directional guide for the development of the futures market in the long-term. This paper attempts to study these issues. they theoretical explanation[1][2]. Garbade and Silber (1983) were the first to use econometric models for empirical testing, and later scholars expanded on these models[3]. For example, the scholars such as Fortenbery&Zapata (1997), Nomikos&Kavussanos (1999), Haigh(2000), Zhong et al.(2004), Chen&Tsai(2017), Jena et al.(2018), Pradhan et al.(2021), Li&Xiong(2021) and Shao&Hua(2022) studied and found that for wide varieties the futures price guided the spot price, indicating this function is widely existed[4][5][6][7][8][9][10][11][12]. China pays attention to the means of macroeconomic policy adjustment, and the financial market should serve the regional economic development strategy. Therefore, some Chinese scholars also paid attention to the derivative functions from a macro perspective for the futures market. They indirectly described how the futures market influences the regional economy. For example, Tian (2004), Dang (2006) and Jia (2005) explained the functions of the futures market from the point of resource allocation efficiency. Li (2011) argued that futures markets are quasi-insurance markets and have derivative functions such as separation of commercial and logistic flows, information throughput, and macroeconomic regulation assistance. However, these literatures are not supported by empirical data and are limited to qualitative discussions. As far as the existing literature is concerned, there is no direct research on the relationship between the two, but there are some indirectly related studies. A lot of literature has focused on the influence of futures markets on the real economy and has concentrated mainly on the micro area, particularly on the micro function - the price discovery function. In the early stage, scholars studied this function both theoretically and empirically. For example, the famous \"cobweb theorem\" (Ezekiel, 1938) and \" storage price theory\" (Working, 1949) have provided a good On the other hand, there is no direct research on how the regional economy affects the futures market. A small amount of indirect literature from China mainly discussed the effect of regional spot market development on the futures market. Gu (1993) thought that the spot market must have certain market order conditions (such as credit conditions, trading order conditions, etc.) to establish and develop the futures market. Wang (2009) explained how the spot market evolved into a futures market from the institutional economics perspective. Sun (2010) pointed out that the highly developed spot market is the basis and condition for developing the futures market. There is also no empirical data support for these studies.",
    "Therefore, this paper attempts to study the link of the futures market and the real economy from the point of the regional economics, sort out the mechanism of the interaction between the futures market and the regional economy, and conduct empirical analysis with the representative data of Henan Province of China, in order to provide new literature for the macro function of the futures market. In developed countries, futures markets initially arose in response to the hedging needs of individual market participants. With the increase of participants, the competition is gradually strengthening, infinitely close to the perfect competition market. The price formed in such a market can genuinely display the trend of supply and demand. Thus, the price is accepted as an authoritative benchmark price and an important reference for production and distribution activities. Furthermore, the futures price plays the role of \"invisible hand\", which has effect on the regional economy and even the whole macroeconomy (see Figure 1 for details). Firstly, the futures market can promote the unification of regional markets, which is conducive to improving the national market system and price formation mechanism. Because of the authority of futures prices, they often become the pricing benchmark of the spot market. Furthermore, due to the rapid transmission of price signals widely, the segmentation of the spot market is unsustainable, which significantly promotes the unification of the regional market; The unification of the regional market is in turn more conducive to the development of the futures market and the improvement of the entire market system. In this way, the benign interaction between the futures market and the regional market system will be formed in the whole region and even in a more enormous scope. This benign interaction is Secondly, the futures market can adjust regional production, which benefits the industrialization of related products. In the futures market, because of the hedging function it can supply risk aversion tools for producers and enterprises in the relevant industrial chain, greatly reducing business risks and stabilizing the income of related operators. Overall, the futures market can stabilize the regional production and promote the industrialization of regional listed futures varieties through the hedging function. Thirdly, the futures market can consolidate the financial position of a region and promote the financial center’s formation in the region. The price-centered information from the futures market radiates the entire financial system, impels the financial industry to agglomerate, consolidates the regional financial position, and ultimately promotes the region into a financial center. Lastly, the futures market can radiate and drive relevant industries and promote regional coordination and development. Due to its unique trading mechanism, the futures market can gather capital, talents, commodities and other resources, thus radiating and leading other industries. For example, in futures trading, the delivery can impetus the development of the warehousing and logistics industry, the settlement can promote the development of the financial sectors, and the information release business can drive the growth of the information industry. The futures market is the outcome of a region when it has developed to a certain stage, especially when the spot market arrives to a certain level. The level of regional economic development will affect the development of the futures market. First of all, the regions with a certain stage of economic development can benefit the prosperity of spot market. The highly prosperous spot market is basic for the futures market. If the spot market is not mature, the futures market can’t play roles well. Secondly, regional economic development provides market order conditions for the futures market. The futures contract transactions need to pay a certain proportion of margin in advance, and the rest of the contract amount is maintained by the commercial credit of both parties before delivery. Therefore, whether the credit conditions are complete can affect the entire futures market mechanism’s running. Furthermore, because of the frequent price fluctuations and high risks in the futures market, it is also necessary to have a sound legal system and a high-level management institution to ensure the normal running of the market. Therefore, a good regional legal environment and better social credit conditions will promote the development of the futures market. Thirdly, regional economic development provides the matching infrastructure for the futures market. Futures trading needs advanced communication devices and a modern quotation system. It also needs a fast, convenient and mutually matched delivery system, a transportation system and a storage system. In addition, a complete monetary and financial system, especially a modern transaction portfolio settlement system is required. All of these conditions can only be provided when the regional economy develops to a certain extent. Therefore, the more developed the regional economy, the more conducive it is to the development of the futures market.",
    "According to the above analysis, the futures market and the regional economy will positively interact in theory. To verify the theoretical hypothesis, the next step is to conduct an empirical research with the actual data of economic operations in Henan Province of China to explore the mathematical relationship between the two. As the leading important province of the \"Central Plains Economic Zone\" in China, Henan province is the strategic fulcrum and important modern comprehensive transportation hub for the coordinated development of the national regions. It is at the intersection of the west and south directions of the \"Silk Road Economic Belt\" and connected to the \"Maritime Silk Road\", which is of great significance to the implementation of the overall regional strategy of China. Zhengzhou Commodity Exchange is the only futures exchange in the \"Central Plains Economic Zone\". The Henan futures market represented by Zhengzhou Commodity Exchange has made essential contributions to the economic development of Henan Province for a long time. Therefore, in order to discuss how the futures market and the regional economic development interact, it is of representative significance to take Henan Province of China as an example. It also has directive significance for the construction of futures market in the long term. The selection of measurement indicators should first be based on the internal logic of theoretical research, while considering the need for data availability and sample size of the econometric model. In general, according to theoretical analysis, these measurement indicators can be divided into two categories: futures market development indicators and regional economic development indicators. statistical data have been available since 1997. Furthermore, according to the Statistical Yearbook of Futures Market over the years, only the data of the annual trading volume and turnover of each futures exchange can be obtained. Other indicators, such as the number of employees over the years and the functional indicators of the futures market, have not been counted. Besides, according to our investigation, the number of customers opened by the futures business department and the number of agent turnover of the futures business department can be obtained from the Henan Securities Regulatory Bureau every month and every quarter from 2012 to 2021. Therefore, according to the availability of data, for the development level of the futures market, the only measurement indicators are the trading volume and turnover of the Zhengzhou Commodity Exchange in the calendar years (which can be divided into months or quarters) since 1998, or the agency trading volume or turnover of Henan Province of China in the calendar years (which can be divided into months or quarters) since 2012. As for the measurement indicators of regional economic development level, according to the Statistical Yearbook of Henan Province in China and the statistical yearbook on the website of the China Bureau of Statistics, the annual GDP (gross domestic product) data of Henan Province after 1995 can be obtained (the quarterly data is only available in 2005 and later), and the annual data of per capita GDP and per capita disposable income of Henan Province can also be obtained after 1995. As to other measurement indicators, such as the total education investment over the years and the number of college students, which represent the level of education development, the annual data can be obtained after 1995 (without monthly and quarterly data). The annual data of indicators describing the development level of the spot market can be obtained after 1997 (without monthly and quarterly data). Therefore, fully considering the availability of data and the consistency of time, two methods can be used for the empirical analysis of this article as followed: One is to choose the trading volume (or turnover) of the Zhengzhou Commodity Exchange since 1998 as the measurement indicators representing the development level of the futures market, and to choose the indicators such as the GDP (or per capita GDP, per capita income), the total investment of education and the annual trading volume of the spot market as the measurement indicators representing the development level of the regional economy. However, there are only 24 periods of yearly data from 1998 to 2021, which does not meet the sample size requirements of the econometric model. Therefore, this method is eliminated.",
    "The other is to use the quarterly data of the trading volume (or turnover) of the Zhengzhou Commodity Exchange as the development level indicator of the futures market and the quarterly data of GDP as the regional economic development indicator since 2005 for time series analysis. From Q1 of 2005 to Q3 of 2022, there are 71 periods in total, with the sample size n>30, which meets the basic requirements for sample size of the econometric model. Therefore, in summary, fully considering the attainability of data, the content of study and the requirements of measurement, this article chooses the quarterly turnover of Zhengzhou Commodity Exchange of China as the measurement indicator representing the development level of the futures market and the quarterly GDP of Henan Province of China as the measurement indicator representing the regional economic development level. According to the theoretical analysis above, the futures market and the development of the local regional economy influence each other. It is necessary to test the interaction between the quarterly turnover of Zhengzhou Commodity Exchange and the quarterly GDP of Henan Province, both of which are endogenous variables, and the lag periods of each variable may affect the current value of the two variables. Therefore, an unstructured multi- equation model is suitable for the use of VAR model or VEC model on time series. Because a VEC model is a VAR model with cointegration constraints, whether to use a VAR model or a VEC model depends on the test results in the empirical procedure. The empirical analysis below will explain in detail. In the following empirical analysis, TRVALUE is the variable name of the quarterly turnover of Zhengzhou Commodity Exchange, and GDP is the variable name of the quarterly GDP of Henan Province of China. According to the availability of data, the sample interval is set from Q1 of 2005 to Q3 of 2022. The quarterly turnover data over the years of Zhengzhou Commodity Exchange comes from the database of its official website, and the quarterly GDP of Henan Province over the years comes from the official website of Bureau of Statistics of Henan province. Because this paper uses quarterly time series for analysis, seasonal factors may cause the statistical data to not directly reflect the law of economic change. Typically, factors such as climate, social system and customs can cause periodic changes in the variables of economic events. Because this periodic change is formed by the influence of seasonal factors, it is generally called seasonal fluctuations, which can cover up the laws of economic development. Therefore, it is necessary to seasonally adjust the quarterly data to eliminate the impact of seasonal fluctuations. As shown in Figure 2 below, the quarterly GDP obviously shows seasonal cyclical fluctuations. Therefore, it is necessary to make seasonal adjustments for the quarterly GDP data of Henan Province. From the graph of figure 3, the quarterly turnover of Zhengzhou Commodity Exchange does not show cyclical seasonal changes, so the data of variable TRVALUE doesn’t need seasonal adjustments. This paper adopts the X12 seasonal adjustment method for quarterly adjustment, and the trend of the adjusted quarterly GDP series of Henan Province is shown in Figure 4. 2006 2008 2010 2012 2014 2016 2018 2020 2022 Fig. 2. Change trend of quarterly GDP of Henan Province in China before seasonal adjustment 2006 2008 2010 2012 2014 2016 2018 2020 2022 Fig. 3. Change trend of quarterly turnover of Zhengzhou Commodity Exchange without adjustment Since this paper adopts time series to study how different variables interact, it is necessary to test the stationarity of the data series first. Otherwise, the \"spurious regression\" will occur. The unit root test is mainly used to judge whether the time series is stationary. EViews application program provides six unit-root test methods. This paper selects ADF test which is the most commonly applied. The output is shown in Table 1. Note 1: GDP is the gross domestic product of Henan Province in China. TRVALUE is the turnover of Zhengzhou Commodity Exchange in China. Note 3: The variable D(GDP) represents the first-order difference of the variable GDP. The variable D(TRVALUE) represents the first-order difference of the variable TRVALUE. Note 4: For the type of test (c,t,s) , c means there is an intercept term, t represents a trend term, and s represents the maximum lag length, which is determined according to the SIC optimal information criterion.",
    "According to the test results, comparing the t-test statistics of the series GDP and series TRVALUE with the critical value of each, we can find for each series the original hypothesis (the original hypothesis is \"existence of unit root\") is accepted at the 1% test level, that is, the two series can be considered not stationary. But when conducting the first-order difference, these two series reject the original hypothesis at the 1% test level and are stable. Therefore, the series GDP and TRVALUE are integrated of order 1, and they may have a long-run stable relationship. To determine whether this relationship exists, we can do a cointegration test. In this paper, Johansen test is selected to conduct the cointegration test. This method’s key step is determining the optimal lag order. We first establish an unconstrained VAR model with time series GDP and TRVALUE as dependent variables and their lag values as independent variables. Table 2 gives the output: except for the LogL and SC standards, the other five standards show that for the VAR model the optimal lag order is 3. Therefore, the optimal lag order of this VAR model is determined to be 3. At the same time, as table 3 shown, the modulus of one root is greater than 1 (1.01138), which indicates that this VAR model is out of the stability condition, so this paper does not choose to conduct the VAR model but the VEC model. According to the analysis above, the optimal lag order under the unconstrained conditions is 3, so the optimal lag order for Johansen cointegration test is 2. The output results of Eviews6.0 statistical software are presented in Both of these two types of test outcome indicate that GDP and TRVALUE are cointegrated at the 1% significance level. The cointegration equation is as followed: In the equation (1), ECM is the error correction. This equation shows that the turnover of Zhengzhou Commodity Exchange and the GDP of Henan Province are stably correlated in China in the long-run, and the two variables are positively correlated. Cointegration test indicates that there is a long-term positive correlation between the variables of GDP and TRVALUE. In order to further verify the causal relationship between them, we conduct the Granger causality test. Table 5 gives the output of Eviews software: At the 1% significance level, GDP is the Granger cause of TRVALUE, and at the 5% significance level, TRVALUE is also the Granger cause of GDP. This result verifies the conclusion of the theoretical analysis and shows that the development level of the futures market in Henan Province and the local regional economic development level influence each other. Since Johansen cointegration test outcome shows that GDP and TRVALUE are cointegrated, a VEC model can be built on this basis to further reflect the correction mechanism of short-term deviation from long-term equilibrium. A VEC model is a vector autoregressive (VAR) model with cointegration constraints. According to the operation results of Eviews6.0 software, the estimated results of the VEC model are the following two equations: the GDP to the impulse of the trading value in the futures market from Henan Province of China. The impulse from the turnover of the futures market has a slight negative influence on Henan's GDP at first. From the second period the impact becomes positive, and gradually increases. After coming to the peak value in the third period, the impact presents a stable and positive response. Figure 7 shows the response of the turnover of the futures market to the impulse of the GDP of Henan Province of China. The influence of the impulse from the GDP on the turnover of the futures market in Henan Province gradually increases in the first period, which is a positive response. The impact comes to the maximum in the second period, and then decreases and trends to be stable positive from the third period. The impulse response outcome indicates that the GDP and the turnover of the futures market of Henan Province in China have a long-term promoting impact on each other. The coefficient of ECM of equation (2) is negative, which indicates it conforms to the reverse correction mechanism. The coefficient of equation (3) is positive, which means it does not conform to the reverse correction mechanism and can be eliminated.",
    "According to equation (2), When GDP fluctuates in the short-run and strays from the long-run equilibrium state, there will be a reverse force gradually adjusting it to the equilibrium state. Specifically, as shown in Figure 6, the zero line represents the long-term stable equilibrium relationship between GDP and TRVALUE. The zero line also represents the cointegration relationship. The vertical axis represents the short-run deviation from the long-run equilibrium. The absolute value of the vertical axis represents the degree of the deviation from the long-term equilibrium. As figure 5 demonstrates, the short-term fluctuation deviation from the first quarter of 2005 to the first quarter of 2010 was small and stable, and then the fluctuation range became wider. In the first quarter of 2011, the first quarter of 2020, and the first quarter of 2022, the short-term fluctuation deviation reached the maximum respectively. After that, it was adjusted by the reverse correction mechanism and returned to the long- term equilibrium and stability through about three quarters. According to the above Granger causality test results, the variable GDP and the variable TAVALUE are mutually causal. In order to further clarify the interaction between the two variables development in the long-run, the next step is to use the method of the generalized impulse response function under the VEC model to analyze the response of Henan Province's GDP to the impact of Henan Province's futures market turnover, and the response of Henan Province's futures market turnover to the impact of Henan Province's GDP. Figure 6 shows the response of (1) The series GDP which represents the economic development level and the series TRVALUE which represents the development level of the futures market in Henan Province of China are both first-order integration series. The two variables are cointegrated at the level of 1% significance, which implies that there is a stable equilibrium between the turnover of Zhengzhou Commodity Exchange and the GDP of Henan Province of China in the long-run, and they are positively correlated. Moreover, the GDP of Henan Province will increase by (2) At 1% significance level, GDP is the Granger cause of TRVALUE, and at 5% significance level, TRVALUE is also the Granger cause of GDP. It indicates that the development level of the futures market in Henan Province and the local regional economic development level influence each other. (3) The estimation outcome of the vector error correction model shows that when GDP fluctuates in short-run and strays from the equilibrium, it will gradually return to the equilibrium state with the adjustment force of (-0.006571). (4) The impulse response analysis results show that the GDP and the trading value of the futures market of Henan Province have a long-term promoting effect on each other. However, the response process of the two to the impact of each other is different. The conclusions of the research have shown that the development of the futures market and the development of the regional economy both have a long-term promotion effect on each other, which indicates that a positive interaction can be formed between the two. Thus, in future the development of the futures market should be in line with the overall development of the country, obey the needs of regional economic development, proactively dovetail with regional economic development strategies, rely on local economic entities, play the function of the futures market, realize the positive interaction with industry and regional economy, and usher in a breakthrough development in the new historical period. On the other hand, if conditions are ripe, futures exchanges should be introduced as soon as possible to promote regional economic growth."
]