[
    "The purpose of this study is to explore the relationship between antecedents and consumer ethnocentric tendency on electric car purchasing in Henan province, China. This is a quantitative research paper, the data collected through a semi-structured survey questionnaire from 422 electric car owners in Henan province, China. One-way ANOVA and Pearson’s correlation coefficient were employed to test data variables and to test the hypothesis. This study concludes that a significant relationship between consumer ethnocentrism and socio-psychological (patriotism; correlation), demographics (age; income level), as well as purchasing intention on electric vehicles. Global electric vehicle sales reached 2.1 million units in 2018, a growth of 72 percent year-on-year. The fastest-growing contributor was China with sales of 1.25 million units in 2018, occupied 56 percent units in world sales, an increase of 58 percent year-on-year (Roland, 2019). In the meantime, numerous governments from all around the world begin to pass laws to prevent and to delay in increasing pollution and for environmental protection. In addition, the threshold for subsidy policy is constantly improving and is also driving the new energy vehicle technology rapidly innovating. Under the joint launch, the suppliers' products are also greatly enriched. As a result, more innovative energy products with long-life batteries, cost-effective and novel appearance are emerging, providing automotive consumers with more choices in the ever-growing market for electric vehicles. However, there are growing of China’s rise in nationalism could pose a serious threat to foreign brands (Forbes, 2016) and less welcoming foreign companies (Michael, 2017). Previous scholar (Zhou, 2013) conducted research on the influence of consumer ethnocentrism on automobile brand purchase intention, but the research on electric vehicles has not been done in China. Therefore, this study aims to investigate the impacts of consumer ethnocentrism on purchase intentions of the electric vehicles in Henan province, China. The research conclusions have important practical significance for the marketing of domestic and multinational companies. 1) To find out whether there is a significant influence between antecedents and consumer ethnocentric tendency on electric car purchasing. 2) To investigate whether there is a significant influence between consumers’ demographic factors and consumer ethnocentric tendency on electric car purchasing. 3) To investigate whether there is a significant influence between consumer ethnocentric tendency and purchasing intention on an electric car. There is a huge future development opportunity in China's new energy automobile industry. The sales volume of global new energy passenger vehicles are 2.001 million, while the Chinese market accounted for 1.053 million that more than the sum of the rest of the countries (Roland, 2019). In addition, in the first half of 2019, the sales volume of domestic new energy vehicles are 617 thousand units, an increase of 49.6% year-on-year, of which 563 thousand passenger cars, an increase of 57.7%. In terms of penetration rate, China's new energy vehicle sales reached 1.256 million units in 2018, accounting for 4.5% of all vehicle sales. In June 2019, China's new energy vehicles have a total of 3.44 million vehicles, while the number of traditional fuel vehicles has reached 250 million. The penetration rate of new energy vehicles is less than 1.4%, and the growth space is broad (China Association of Automobile Manufacturers, 2019). The concept of consumer ethnocentrism came from ethnocentrism was formulated by Shimp and Sharma (1987) as domain-specific subject in consumer behavior; it was described as the tendency of the consumers to distinguish between products of out-groups (made in foreign countries) and the in-groups (made in home country) purely on the nationalist reasons irrespective of the quality, price or desired features of the products concerned. Shimp and Sharma (1987) first combined consumer ethnocentrism and consumer behavior that proposed the concept of consumer ethnocentric tendency (CET), which was described as consumers will prefer domestic products and have a psychological tendency to resist foreign goods when they choosing domestic goods and foreign goods. In addition, they established a 17-item measurement scale called the consumer ethnocentric tendencies scale (CETSCALE). After the scale was developed among American consumers, the reliability and validity of the CETSCALE also examined by the previous researchers conducted among consumers in 25 countries around the world, therefore, this scale is a standard measurement scale of consumer ethnocentrism (Good and Huddleston, 1995; Wang Haizhong, 2003; Hamin and Elliott, 2006; Evanschitzky et al., 2008). Moreover, Shimp et al. (1984) mentioned that CET did not develop in isolation but was related to socio-psychological factors and demographic factors. In addition, Sharma et al., (1994) provided a comprehensive graphical framework of consumer ethnocentrism (Figure 3).",
    "For the socio-psychological factors, this study focuses on cultural openness, patriotism, and conservatism. Wong et al. (2008) stated that the cultural openness in foreign markets introduced consumers to products and services around the world as they increasingly exposed to products that coming from different countries. In the communication of cross-cultural, consumers! familiarity with other cultures would weaken their CET. Previous researches stated that cultural openness was negatively correlated with CET (Sharma et al., 1994; Howard, 1990; Ruyter et al., 1998). However, some researches did not find any relationship between cultural openness and CET (Sharma et al., 1994; Suh and Kwon, 2002; Vida et al., 2008). While speaking with patriotism, Balabanis et al. (2001) defined it as a strong feeling of attachment and loyalty to one’s own country, but without corresponding hostility towards other nations. Han (1988) claimed that consumers' choice of products depended more on patriotism rather than on cognitive factors that were quality perception and product applicability. The past empirical studies also indicated that there was a positive correlation between patriotism and CET (Han, 1988; Sharma et al., 1994; Ruyter, 1998; Klein and Ettensoe, 1999; Balabanis et al., 2001; Kenichi, 2009). However, Lee et al. (2003) did not find any significant relationship between patriotism and CET among American consumers. For the conservative, Sharma et al. (1994) stated that conservative persons who showed a tendency to cherish traditions and social institutions that had been strong enough to survive the test of time and to introduce changes only occasionally, reluctantly and gradually. While, under the extreme cases, conservatism could manifest itself as religious intolerance, adherence to strict rules and punishments, and opposition to hedonism (Wilson and Patterson, 1968 in Sharma et al., 1994). In addition, Sharma et al. (1995) and Balabanis et al. (2002) found that there was a positive relationship between conservatism and CET. Regarding demographic characteristics, for gender, some researchers found that men were more ethnic-centric than women (Bannister and Saunders, 1978; Cleveland, 2009), while others stated that women had a higher level of CET than men (Sharma et al., 1994; Bruning, 1997). However, some studies found there was no significant relationship between gender and CET (Caruana, 1996), whether in mainland China (Wang Haizhong, 2003) or Northern Cyprus (Nadiri and Tiimer, 2010). Generally, the elder consumers were more conservative and patriotic; therefore, they had more conflict experience with external things (Han, 1988). Caruana (1996) and Klein and Ettensoe (1999) found that older people would have higher CET than younger people. This could be interpreted by the increased cosmopolitanism in recent years that younger people were influenced by the socio-cultural of cosmopolitanism on their belief patterns (Shankarmahesh et al., 2006). However, empirical research showed mixed results, such as Klein and Ettensoe (1999), Caruana (1996) argued that not young people must have a lower CET than older people, while Festervand et al. (1985), Sharma et al. (1994) and Upadhyay and Sing (2006) did not find any statistically significant correlation between age and CET. Anderson and Cunningham (1972) stated that people with higher education levels would have higher ratings on foreign products. Results from previous researches pointed out that people would have higher ratings on imported products with higher education levels but lower prejudiced and conservative (Ray, 1990; Wall and Heslop,1996). Previous studies found that there was a negative relationship between education level and consumer ethnocentrism (Klein and Ettensoe, 1999; Balabanis et al., 2001; Lee et al., 2003). However, Han (1988) did not find any significant relationship between education level and CET. While mentioning about income level, the rising income levels would provide people more opportunities to travel and buy foreign products easily forming in a more open perspective (Wall and Heslop, 1986; Sharma et al., 1995). Thus, the income level was negatively correlated with CET (Sharma et al., 1994; Bruning, 1997). However, other studies found that there was no significant relationship between income levels and CET (Han, 1988) or positive correlation (Balabanis et al., 2001) Baughn and Yaprak (1991) believed that consumer ethnocentrism influenced consumers from both product quality evaluation and direct emotional factors of purchasing behavior. In addition, Klein et. al (1998) empirically demonstrated that there was a significant negative correlation between consumer ethnocentrism and foreign product evaluations, as well as the willingness to purchase imported products; which meant, the stronger the consumer's own centralism, the lower the evaluation of foreign products, and the willingness to buy was also weaker (Klein et al., 1998). Moreover, Tan and Farley (2010) found that there was a significant influence from consumer ethnocentrism rather than the country of origin images while comparing each influence on product quality, product attitude and willingness to buy. In addition, Balabanis and Diamantopoupos (2004) stated that consumer ethnocentrism tendency was positively related to buying domestic and there was no negative correlation with purchasing imported products.",
    "The population in this study are electric car owners in Henan province and the sample amount is unknown, but presume that the amount should be more than 100,000. Therefore, this research employed W. G. Cochran formula (1997) to derive the sample size is 384, however, the researcher added up 10% of sample size. Therefore, the sample size will be 422 in this study easily computation and to prevent the questionnaires incomplete. This study is designed as quantitative research. The questionnaires consisted of four parts, the first part includes demographic information (gender, age, education level, monthly income), and the second part aims to explore the respondents’ levels of consumer ethnocentrism, 5 illustrative terms were adapted from CETSCALE (Shimp and Sharma, 1987). The next part aims to evaluate the participants’ attitudes on socio-psychological factors, cultural openness measure was adapted from Rawwas et al. (1996), the measure of patriotism was adapted from Adorno et al.’s (1950) scale that 5 illustrative items from the 8-item scale, Schwartz’s (1994) conservatism measure was applied in the questionnaire. The final part aims to investigate the participants’ attitudes on purchasing intention that respectively consisted of five illustrative items on electric car quality that adapted from Klein et al. (1998), as well as 6 countries of buying willingness. Part two to Part four questions were employed in a five-point Likert scale style that was respondent to indicate the extent to which they agree or disagree with statements (Shiu, 2009). Self-distribution of the questionnaires was employed to collect primary data. the author also asked the help from the electric car retailer to distribute the questionnaires after they fully understood the questionnaires from the author. To test the Cronbach’s Alpha for the questionnaire reliable and will accept at a value of more than 0.7. In this study, Cronbach’s Alpha is 0.896, thus the questionnaire was highly reliable. The researcher will test for the reliability using the IOC test (items objective congruence), the items that had scored lower than 0.5 will be revised. After testing the result was more than 0.8, which was reserved acceptable. This study was employed by One-way ANOVA and Pearson’s correlation coefficient to test the research hypothesis. Table 1 gives the correlation between CET and the three socio-psychological antecedents, demographics, as well as purchasing intention on electric vehicles. Socio-psychological factors. As can be seen, there is no significant correlation between cultural openness and CET (r= .005, p= .917), therefore, SubH,;, is rejected. In support of hypothesis H),, the correlation between patriotism and CET is significantly positive (r= .000, p= .467**). Finally, positive coefficients between conservatism and CET (r= .000, p= .531**) provide support for hypothesis H;c. Therefore, supported H). Demographic factors. The results revealed that there is no significant correlation between respondents’ CET and two demographic variables of gender, education level (p= .378, .383) respectively, therefore, SubH,, and SubH,, were not supported. In support of hypothesis SubH>,, the correlation between age and CET is significantly positive (r= .143**, p= .003), which indicates that individuals get more ethnocentric with increasing age. The correlation between income and CET is predictably negative, which indicates that individuals’ consumer ethnocentric tendencies decrease with increasing income (r= -.164**, p= .003), therefore, support SubH4. Purchasing intention. From Table 1, hypotheses H3 are supported. Specifically, the correlation between foreign electric car purchase is significantly negative (r= -.101*, p= .037), while the correlation between domestic electric car purchase is significantly positive (r= .390**, p= .000), therefore, SubH;, is supported. Hypotheses SubH3, is supported by the positive coefficients between CET and foreign electric car satisfaction, domestic electric car satisfaction (r= .178**, p= .000; r= .459**, p= .000) respectively. Socio-psychological factors. The author found that there was no significant correlation between cultural openness and consumer ethnocentrism, that confirmed the results from Sharma et al. (1994) and Suh and Kwon (2002) in South Korea, Vida et al. (2008) in Yugoslavia. However, this finding was contradicted the views by other researchers (Sharma et al., 1994; Howard, 1990; Ruyter et al., 1998; Vida and Fairhurst, 1999; Suh and Kwon's, 2002) stated that cultural openness was negatively correlated with consumer ethnocentrism. The results revealed that there was a significant positive correlation between patriotism consumer ethnocentrism, which is consisted of that if a consumer has stronger patriotism tendencies that he/she also has higher levels of consumer ethnocentrism. This result was confirmed the past empirical studies by Han (1988), Sharma et al. (1994), Ruyter (1998), Klein and Ettensoe (1999), Kenichi (2009), and Balabanis et al. (2001). However, it was contradicted the view of Lee et al. (2003) stated that there was no significant relationship between patriotism and consumer ethnocentrism among American consumers. The results also revealed that there was a significant positive correlation between conservatism and consumer ethnocentrism, which consisted of that if a consumer has stronger nationalism tendencies that he/she also has higher levels of consumer ethnocentrism. This finding has confirmed the views of Sharma et al. (1994) and Balabanis et al. (2002).",
    "Demographic factors. Based on consumer ethnocentrism literature, the author assumed that Henan province consumers do not exhibit highly ethnocentric tendencies. After testing the second hypothesis in this research, the result indicated that there was a significant relationship between consumer ethnocentrism and demographic. The findings indicated that there was no significant relationship between gender and consumer ethnocentrism. While the previous studies had indicated that consumer ethnocentrism level was stronger among women than men (Han 1988). However, in this research, womean had a higher level of consumer ethnocentrism than men. Generally, the elder consumers were more conservative and patriotic; therefore, they had more conflict experience with external things (Han, 1988). However, younger consumers were more open and had a positive attitude with foreign products. With the age increasing, consumers’ attitudes on domestic products became more active and positive. This means that the younger generation in the preferences and attitudes are more internationalist, thus they will be more active and positive on foreign goods (Schooler, 1971). Through Pearson’s moment correlation analysis, the results revealed that there was a positive significant relationship between consumer ethnocentrism and age, probably the similarity view as other researches (Shimp and Sharma, 1987; Han, 1988) suggested that elder consumer tend to be more ethnocentric. The author did not find any significant relationship between education level and consumer ethnocentrism, similarly to the results stated by Han (1988). These findings were contradicted the views with other previous researchers (Anderson and Cunningham1972; Heslop et al.,1996; Ray, 1990) indicated that people with higher education levels but lower prejudiced and conservative, would have higher ratings on imported products, thus, Klein and Ettensoe (1999), Balabanis et al. (2001), and Lee et al. (2003) pointed that there was a negative relationship between education level and consumer ethnocentrism. Probably because the consumer who had a high level of education, he/she would contact more with western culture, thus they will more receptive to western culture and showed less conservative. While in the consumption, they showed less ethnic, their evaluation of the products tended to be rational and objective, but less emotionally. The results also confirmed that numerous previous researchers (Sharma et al., 1995; Bruning, 1997) pointed out that income level was negatively correlated with CET. The rising income levels would provide people with more opportunities to travel and buy foreign products that easily forming in a more open perspective (Liefeld et al., 1986; Sharma et al., 1994). However, this finding has contradicted the views of Balabanis et al. (2001). Purchasing intention. The findings indicated that there was a negative correlation between consumer ethnocentrism and purchasing foreign electric vehicles, while a positively correlated between consumer ethnocentrism and purchasing Chinese electric vehicles. That meant, people who had a high level of consumer ethnocentrism tended to purchase domestic electric cars, while those who had lower consumer ethnocentrism tended to purchase foreign electric cars. The results also revealed that there was a positively correlated between consumer ethnocentrism and purchasing intention to satisfy either domestic or foreign electric cars. From comparing means, the participants most satisfied Chinese products, that corresponding to the question that “I prefer to support Chinese products even it may cost me in the long run” from the consumer ethnocentrism testing part (m=4.26). While comparing with the foreign countries’ product satisfaction, the participants preferred German electric vehicles products rather than products from other foreign countries. This study contributes substantively by fleshing out the specific theoretical meaning and the role of CET plays. Shimp and Sharma (1987) had established the psychometric property of CETSCALE in American, the reliability and validity of the CETSCALE also examined among consumers in 25 countries around the world (Good and Huddleston, 1995; Wang Haizhong, 2003; Hamin and Elliott, 2006; Evanschitzky et al., 2008). However, previous studies had not examined in detail the antecedents of CET in China. In addition, prior researchers conducted their research on the influence of consumer ethnocentrism on car brand purchasing intention in China (Zhou, 2013), and regional employment in the U.S. automobile industry influences consumer ethnocentrism (Neese et al., 2017), but the research on influence of consumer ethnocentrism on electric vehicles purchasing intention has not been done in China. Thus, the author's research fills a gap in this field, provides rich meaning for the marketing strategy of local and global enterprises.",
    "Recommendations for local car dealers, they should take consumer ethnocentrism as a unique marketing concept to motivate consumers to be more confident about the local brand electric car in competing with foreign brands. When faced with multinational brands, domestic enterprises should adopt scientific and reasonable domestic marketing strategies to activate the ethnocentric complex of local consumers. Recommendations for multinational enterprises, they should avoid resistance and seek Chinese value and attitude to be a benefit to their brand, at the same time, recommending global enterprises actively participating in China's public welfare undertakings, contribute to society, cooperate with Chinese enterprises, and jointly develop new products to enter the market. Recommendations for government departments, they should strengthen effective guidance for young people and increase their sense of patriotism. In addition, the government departments also need to strengthen supervision mechanisms to eliminate product quality crises and raise awareness of purchasing domestic products through public opinion. The antecedents construct included in this research are not exhaustive, other variables such as collectivism/individualism, allocentric and dogmatism may relate to CET. In addition, there may have some factors such as perceived product necessity, economic threat, and the country of origin that moderate the effect of CET on attitudes toward purchasing intention."
]