[
    "The Moderator Effect of Researchers' Team Tenure Heterogeneity on the Relationship Between Improvisation Behavior and Innovative Performance in Henan Province, China Correspondence: Fuangfa Amponstira, School of Management, Shinawatra University, 99 Moo 10 Bang Toey, Sam Khok District, Pathum Thani 12160, Thailand. E-mail: 337397210@qq.com With the face of a highly uncertain market environment, an empirical study of researchers in Henan Province found that improvisational behavior has a positive effect on innovation performance, and that team tenure heterogeneity has a significant moderating effect between improvisational behavior and innovative performance. Therefore, we propose a coping strategy to improve innovative performance form the use of team tenure heterogeneity to form a scientific research team and create an environment conducive to improvisational behavior. Scientific and technological innovation is an important foundation for promoting industrial upgrading and improving the core competitiveness of enterprises. Since improvisational behavior was introduced into the field of management, most scholars have been studying the positive effect of improvisational behavior on innovative performance. However, this positive effect is restricted by the situation, and different situations have different results, for example, Ruan Guoxiang (2015) introduced the moderator variables (such as \"sharing the mind, the distance of power and other moderator variables\") used to study the positive effects of improvisational behavior on innovative performance. In terms of Chinese cultural tradition, team tenure means job stability, everyone likes a stable working environment, and researchers are also affected by this. However, due to the nature of their work, researchers are relatively mobile. From the perspective of heterogeneity of team tenure, this paper studies whether heterogeneity of team tenure is conducive to improvisational behavior, to innovation performance, and whether there is a positive moderator effect between improvisational and innovative performance in Henan Province. A comparative analysis of scientific research in Henan Province in 2018 and 2017 shows that the number of persons (researchers) and institutions (units) for research & development in Henan Province is decreasing. Therefore, it is worthwhile to take management measures to create a better scientific research environment. In this situation, this paper plans to study what is the correlation of researchers' improvisational behavior and innovative performance, how to use improvisational behavior improve innovative performance, and how to use the researchers' heterogeneity moderator effect to improve innovative performance in the context of Henan Province. The author hopes that this paper can contribute to improving the level of innovative performance in Henan Province. Consequently, the purpose of this research is to study the correlation between improvisational behavior and innovative performance of researchers who is working in Henan province, China, it could help researchers to achieve more effective improvisational behavior and to improve their innovative performance. H2: The team tenure heterogeneity of researchers could significantly influence the correlation between their improvisational behavior and their innovative performance Improvisational behavior of researchers as: \"the spontaneous and creative problem-solving behaviors and abilities adopted by scientific researchers to use utilization of existing resources in the face of sudden emergencies.\" Improvisational behavior was considered to be an ability to maintain a competitive advantage, there is a general assumption in many literatures that improvisational behavior always leads to positive results and better performance, especially when improvisational behavior is defined as \"smartly coping with or adapting to various situations\" or \"a lot of wisdom and resourcefulness to solve tricky problems\" (Meyer,1998). Improvisational behavior mainly refers to the use of three dimensions include utilizing existing resources, immediate response and intention to create. As improvisational behavior also implies that risk taking at the same, because it is essentially spontaneous, creative, and unpredictable (Vera & Rodrigue-Lopez, 2007), therefore, in the face of environmental uncertainty and limited resources, under the situation, the purpose of researching improvisational behavior in the field of management is aimed at innovative researches on the management to resolve unexpected problems and ultimately achieve positive performance. Magni et al. (2009) in the empirical study of the impact of team cohesion and behavioral integration on improvisational behavior, mentioned that in future research prospects, can consider team heterogeneity as moderator effect on improvisational behavior and innovative performance (Pelled, 1996). The heterogeneity of different teams and different knowledge backgrounds, etc. will affect the performance of improvisational behavior (Hoegl & Proserpio, 2004), which in turn will affect innovative performance. In the context of Chinese culture, like most people, research member also hope that work will be stable. longer the team tenure, the more homogenous the team is, the more stable the social relationship, and the stronger the sense of identity and belonging of the researchers, the easier it is for research members to share knowledge, increase the efficiency of cooperation, and thus improve performance. When talents are introduced, most researchers also tend to sign fixed- term contracts with their units, hoping to obtain a stable identity. Therefore, this study considers the heterogeneity of team tenure as a moderator variable and to study whether there is a significant moderator effect of team tenure heterogeneity on improvisational behavior and innovative performance.",
    "This is a quantitative research that aims at studying the correlation between improvisational behavior and innovative performance of researchers who is working in Henan province, China. The researcher used survey questionnaire to collect data from 506 scientific research team members from different cities of Henan province. Population in this research are scientific research team members who worked in computer information technology, software development, data service and other research and development enterprises in Zhengzhou, Luoyang, Nanyang and other cities which belong to Henan Province. According to the statistical yearbook of Henan Province --2019, by the end of 2018, the total number of R&D personnel in Henan province was nearly 256,175. The sampling method can be calculated by using Taro Yamane (Yamane, 1973) formula with 95 percentage confidence level, the formula is as follows: Supposing to calculate a sample size of a finite, when the original sample collected is more than 5% of the population size, the corrected sample size is determined by using the Yamane’s formula. Based on this study, the population size is 256,175, the error level is 0.05. the calculation for required sample size will be as follows: By applying Taro Yamane formula (1973) to derive the sample size for the survey on the population is finite, the sample size from the computation was 400 samples. However, for the more convenience and to protect from incomplete questionnaire, the researcher used 600 samples in this research for easily computation. The survey questionnaire was designed based on the conceptual framework. Questions were analyzed from the spontaneous behavior, creative behavior, the utilization of available resource behavior, and innovative performance. The aimed target for this research was to study the moderator effect of researchers' team tenure heterogeneity on the correlation between improvisation behavior and innovative performance. A pilot test of the structured survey questionnaire was conducted on potential respondents to ensure ease and to test the questions from the survey questionnaire. Upon completion of the pilot study, a final study of the respondents was conducted. The questionnaire will be used in this study is a semi-structure survey questionnaire for the flexibility of adjustment. The semi-structured survey questionnaire was used for data gathering from scientific researchers in Henan province, China, and using purposive sampling. In order to avoid possible misunderstandings caused by different personal cognition about the designed questions, we distributed questionnaires in designated groups which nearly formed by scientific researchers, such as research and development department of universities and companies, different kinds of science research centers, and meeting of researchers. Moreover, the author will face to face explain the survey questionnaire to designated participants until them clearly understood, and then authorize these people to distribute the survey questionnaire to scientific researchers, and in this process, one participant can only fill out one questionnaire. If there are any questions the respondents confuse about, he or she can connect the author directly. Furthermore, if there are a large number of identical answers in the same batch of questionnaires, this batch of questionnaires were regarded as invalid data. Due to the research design for the study was designed as quantitative research, descriptive and inferential statistics were employed to analyze the data from the survey questionnaires. The descriptive statistics in the survey questionnaire includes frequency, percentage, mean, and standard deviation, which describes the personal data and attitude on improvisation behavior and innovative performance. In addition, Cronbach’s Alpha, and regression are employed to test variables and the hypothesis. The obtained data from the survey questionnaires will be input into a software computer program for computation and analyzing the data. Since this study only focus on scientific researchers in Henan province, China, after two questionnaire distributions and collections, there were 600 questionnaires have been distributed, and 506 were received, which excludes 17 non-scientific researcher's questionnaires. Therefore, the total valid data comes from 427 questionnaires, the receiving rate was 71.1% Table 2 shows that the improvisational behavior and innovative performance correlation coefficient value 0.658, greater than 0.5, indicating that there was a strong correlation between improvisational behavior and innovation performance. Then, the correlation analysis between three dimensions of improvisational behavior and innovative performance are shown in Table 3, Spontaneity correlation coefficient value 0.562, Creativity correlation coefficient value 0.632 and Utilizing existing resources correlation coefficient value 0.607, the correlation coefficient between improvisational behavior and innovative performance value 0.658, each value is greater than 0.5, indicating that there was a strong correlation between improvisational behavior and innovation performance.",
    "After determining the correlation between independent variables and dependent variables, the scatter diagram is used to judge the linear correlation between independent variables and dependent variables, as shown in Figure 3.2, it can be intuitively found that improvisational behavior is linearly correlated with innovative performance. The regression analysis results as shown in Table 4. The standardized regression coefficient has a Beta distribution value of 0.658, P value of 0< 0.05, and the constant of 0.994, both are significant, indicating that improvisational behavior positively correlated with innovative performance, improvisational behavior positively affects innovative performance. The Beta estimate value of innovative performance is 0.762, indicating that the slope of the two linear equations is 0.762, indicating the change of innovative performance with each unit of improvisational behavior change. In summary, we can confirm that there is a positive correlation between improvisational behavior and innovative performance, so the linear model of the two is established as follows: Y=0.762X+0.994 According to the Improvisational Behavior and Innovative Performance Regression Model Summary b as shown in Table 5, the R2 value of 0.433 indicates that improvisational behavior can explain the change of 43.3% of the innovative performance, even if the Adjusted R2 value of 0.431 is slightly smaller, improvisational behavior can also explain the change of 43.1% of the innovative performance. Some scholars believe that in social science research, there are many variables that affect the dependent variable, and it is quite meaningful if the interpretation of a single variable can reach more than 30%. In the same way, it can be explored in depth whether all dimensions of improvisational behavior are equally significant in predicting innovative performance. Dimensions of Improvisational Behavior and Innovative performance Regression Coefficient α as shown in Table 6, the significance coefficient of each dimension p value of 0 < 0.05, and the standardization coefficient of three dimensions of improvisational behavior (utilizing existing resources, immediate response and intention to create) are 0.563, 0.693, 0.650, respectively, indicating that all dimensions of improvisational behavior have significant positive correlation with innovative performance. Dimensions of Improvisational Behavior and Innovative Performance Regression Model Summary b as shown in Table 7, the Adjusted R2 from three dimensions of improvisational behavior (utilizing existing resources, immediate response and intention to create) are 0.314, 0.398, 0.366, respectively, indicating that the three dimensions of improvisational behavior explains innovative performance 31.4%, 39.8%, 36.6%, respectively. In summary, H1 was accepted that there is a significant positive correlation between improvisational behavior of researchers and their innovative performance. At the same time, all sub-hypotheses also were accepted, which are H1a: there is a significant positive correlation between the spontaneity of researchers and their innovative performance. H1b: There is a significant positive correlation between the creativity of researchers and their innovative performance. H1c: There is a significant positive correlation between the utilizing existing resources by researchers and their innovative performance. From ANOVA results from different team tenure groups of researchers in Table 8, the F value of 1.605 and P value of 1.72 greater than 0.05, indicating that there was no significant effect between the team tenure heterogeneity and improvisational behavior, that is, according to this study, there was no difference in the degree of improvisational behavior between team tenure groups of researchers. Further analysis of the three dimensions of improvisational behavior by One-Way ANOVA found that the Spontaneity dimension P value of 0.154 > 0.05, the Creativity dimension P value of 0.012< 0.05, the Utilization of existing resources P value of 0.682> 0.05. There are significant differences in the Creativity dimension, so that in the further homogeneity of variance detection, Creativity Homogeneity Test of Variance as shown in Table 9, the P value is 0.488 greater than 0.05, indicating the data homogeneity. In the case of homogeneity of variance, then the LED multiple comparison method was adopted, and the LED Multiple Comparison Method for Creativity analysis results were shown in Table 10. Team tenure with 1-3 years group of researchers was more likely to be creative than team tenure with less than 1 year, 5-10 years, and more than 10 years group, so 1-3 years group of researchers is easy to play improvisational behavior. In the same way, 3-5 years group of researchers were more likely to improvise than 5-10 years and more than 10 years groups. The results show that the 1-3 years and 3-5 years team tenure groups of researchers are important variables and have a positive impact on the improvisational behavior.",
    "From the One-Way ANOVA Results of Innovative performance from Different Team Tenure Groups of Researchers in Table 11, the F value of 3.179, and the P value of 0.014 less than 0.05, indicating that team tenure heterogeneity of researchers has significant influence on their innovative performance. In Table 12 The Homogeneity Test of Team Tenure Groups of Researchers, the P value of 0.244 is greater than 0.05 by the homogeneity test of variance, so the LED is used. From the Multi-Comparison Results of Different Team Tenure Groups of Researchers (LSD method) in Table 13, 3-5 years of team tenure is significant for innovation performance compared to researchers with less than one year of team tenure, indicating that 3-5 years team tenure is an important variable, that is, there is 3-5years team tenure of researchers, the more significant the innovative performance. Coefficient α of Moderator effect test for Different Team Tenure Groups of Researchers shown in Table 14, less than1 year, 1-3 years (excluding 3 years), 3 to 5 years (contain 5 years), 5-10 years (excluding 10 years) and more than 10 years, and five team tenure groups standardized regression coefficients of grouping Beta value respectively of 0.678, 0.727, 0.342, 0.642, 0.720, P value is 0, have reached significant level (P<0.05), indicating there is a significant predictive effect between improvisational behavior and innovative performance. Model Summary b of Moderator effect test for Different Team Tenure Groups of Researchers shown in Table 15, the regression equations for term tenure groups of less than 1 year, 1-3 years (excluding 3 years), 5-10 years (excluding 10 years), 10 years and more than 10 years have significant effects (P value < 0), and 3-5 years (excluding 5 years) P value < 0.05, indicating that the variables of the team tenure have significant moderator effect. It can be seen from the Table 4.33, less than 1 year, explains the innovative performance reaching 45.9% of the variance variations, 1-3 years (excluding 3 years) group explains 52.8%, 3-5 years (excluding 5 years) group explains 11.7%, 5-10 years (excluding 10 years) group explains 41.2%, 10 years and more than 10 years group explains 51.9%. Compared with other groups, 3-5 years (excluding 5 years) had a lower interpretation of innovative performance. The heterogeneity of the research team's team has a significant moderator effect between improvisational behavior and innovative performance, from the point of view of the stability of the team, the five team tenure groups have significant moderator effect role, including 1-3 years and more than 10 years, the interpretation of innovative performance is the highest, when forming a scientific research team should pay attention to selecting scientific researchers of the two team tenure group. In summary, H2 was accepted that the team tenure heterogeneity of researchers could significantly and positively influence the correlation between their improvisational behavior and their innovative performance. This study considers the moderator effect of researchers' team tenure heterogeneity on the correlation between improvisation behavior and innovative performance in the Henan Province context. According to the statistics analysis, there are several results that could be concluded as below: It was found through regression analysis that the standardized regression coefficient has a Beta distribution value of 0.658, P-value of 0 <0.05, and the constant of 0.994, both are significant, indicating that improvisational behavior positively correlated with innovative performance, improvisational behavior positively affects innovative performance. This study can confirm that there is a positive correlation between improvisational behavior and innovative performance, so the linear model of the two is established as follows: Not only do improvisational behavior of scientific researchers positively affect innovative performance, but also the three dimensions of improvisational behavior (utilizing existing resources, immediate response and intention to create) positively affecting innovative performance, the significance coefficient of each dimension p-value of 0 < 0.05, and the standardization coefficient of three dimensions of improvisational behavior (utilizing existing resources, immediate response and intention to create) are 0.563, 0.693, 0.650, indicating that all dimensions of improvisational behavior have significant positive correlation with innovative performance. It has been empirically demonstrated that there is a significant positive effect between the improvisational behavior of scientific researchers and innovative performance. Therefore, it is feasible for enterprises to improve the innovative performance by improving researchers' improvisational behavior.",
    "The researchers' team tenure heterogeneity has a significant moderator effect between improvisational behavior and innovative performance, less than 1 year, 1-3 years (excluding 3 years), 3 to 5 years (contain 5 years), 5-10 years (excluding 10 years) and more than 10 years, and five team tenure groups P-value is 0, have reached significant level (P <0.05), indicating there is a significant predictive effect between improvisational behavior and innovative performance. From the Table 15, less than 1 year, explains the innovative performance reaching 45.9% of the variance variations, 1-3 years (excluding 3 years) group explains 52.8%, 3-5 years (excluding 5 years) group explains 11.7%, 5-10 years (excluding 10 years) group explains 41.2%, 10 years and more than 10 years group explains 51.9%. Compared with other groups, 3-5 years (excluding 5 years) had a lower interpretation of innovative performance. The team tenure of 1-3 years and more than 10 years have the highest interpretation of innovation performance, maybe researchers with 1-3 years team tenure just have been officially employed, generally maintain their work enthusiasm, researchers with more than 10 years team tenure maintain their work enthusiasm may be due to sense of belonging and other emotional factors, such as a sense of belonging, so companies should also adopt soft power construction such as \" family culture \". As mentioned above, 1-3 years and 3-5 years have a significant positive impact on improvisational behavior, and 3-5 years have a significant positive impact on innovative performance. From the perspective of the stability of the team, when recruiting talents or in the form of a scientific research team, a fixed-term contract of 1-3 years or 3-5 years team tenure should be set up according to the specific situation of the researcher, and whether to sign the next contract according to the results of performance evaluation, at the same time, it should also be noted that the continuous signing of fixed-term contracts for more than 10 years in Chinese law means that there is no fixed-term contract, and the human resources department needs to take other measures to encourage team members with a 10 years team tenure to maintain enthusiasm. The moderator effect of team tenure heterogeneity on improvisational behavior and innovative performance is still inconclusive. Based on the different research objects and scenarios, the results cannot be the same. There are similar limitations in this study. Moreover, only 427 samples were collected, and the distribution area was mainly in Zhengzhou, Luoyang, Xinxiang, and Nanyang, and there are fewer other cities in Henan Province. Therefore, the study may lead to the deviation caused by regional factors. This study can provide human resources management strategy for research team formation and guide the R&D enterprise to use the team tenure heterogeneity of researchers, in order to select appropriate researchers to form a team at the practical level. Firstly, to maintain a reasonable mix team structure of scientific research, the formation of the team should pay attention to the team tenure structure settings; The second is that recruiting talents should give priority to recruiting teams or individuals with strong scientific research capabilities, according to the specific situation, a fixed contract of the team tenure for 1-3 or 3-5 years should be set up to strengthen the performance appraisal, build a better scientific research platform, and ensure that the team can be attracted; The third, it should also be noted that the continuous signing of fixed-term contracts for more than 10 years in Chinese law means that there is no fixed-term contract, and the human resources department needs to take other measures to encourage team members with a 10 years team tenure to maintain enthusiasm, to shape the cultural atmosphere, such as fault-tolerance mechanism, festival care, etc., and constantly strengthen the construction of soft power; Fourth is to strengthen training and build a learning organization, knowledge has a significant positive effect on improvisational behavior and innovative performance, therefore, the human resources department should take various measures to improve the capabilities and quality of scientific researchers, such as holding regular training salons, inviting external experts to give lectures, and going out for visits."
]