[
    "Correspondence: Ning Cheng, School of Computer Science and Technology, Nanyang Normal University, No. 1638 Wolong Road, Nanyang 473061, China. E-mail: cnnynu@vip.163.com This article studies the impacts of sense of career calling and perception of career development opportunities on work engagement, taking academic advisors as survey object. An online questionnaire survey was carried out on academic advisors of colleges and universities in Henan Province, China. Purposive sampling is used for the convenience of data collection, and a total of 400 valid questionnaires were received. SPSS statistical software is used to conduct descriptive analysis, independent sample t-test, and regression analysis of sample data. Research results show that academic advisors have a higher sense of career calling, perception of career development opportunities, and work engagement. Married teachers have a higher sense of career calling, perception of career development opportunities, and work engagement. Sense of career calling and perceived career development opportunities have a significant positive impact on work engagement, and career mission has a greater impact on work engagement than perceived career development opportunities. This research can help college administrators and decision makers realize the importance of the psychological needs of academic advisors in improving work engagement. Higher education is an important symbol of the country’s development level and development potential, and undergraduates are the largest group of high-quality specialized talents. Therefore, undergraduate education is the most important basis for improving the quality of higher education. Talent training ability is the key to the construction of high-level undergraduate education, while teacher is the key to improving talent training ability. Teacher support has a greater impact on students’ academic motivation (Zhang, D, H. et al., 2018; Zhang, Q. F. et al., 2018; Zheng, 2020). The work engagement of college teachers affects their work performance (Xu, 2018; Peng & Hu, 2019). Perceived organizational support of college teachers affects their degree of work engagement (Zhao, 2020; Tang et al., 2021). At present, many colleges and universities in China have incorporated the undergraduate academic advisor system into the talent training system, selecting teachers with high academic levels as academic advisors to provide targeted guidance to students at different academic stages. The responsibility of the academic advisor is to help students with academic planning, provide individualized and comprehensive guidance in course selection, specialty learning, specialty development direction, academic research, innovation and entrepreneurship, psychological health, etc. Academic advisors are part-time positions held by professional teachers. However, academic advisors are important guides and participants in the academic development of students, and they are very different from classroom teachers in terms of work content and work requirements. The extracurricular guidance of academic tutors can make up for the insufficient interaction between teacher and students in classroom teaching, especially for large class teaching. Academic advisor guide can also improve students’ perception of teacher support, thereby stimulating students’ learning interest and efforts. Therefore, this paper studies how to improve academic advisors’ work engagement from their sense of career calling and perception of career development opportunities. In the context of current Chinese higher education, studying the work engagement of undergraduate academic advisors helps promote the implementation of the concept “Three Full-Education” (Note 1) in undergraduate education. Work engagement is closely related to positive psychology. In the Chinese culture, “engagement” belongs to the morality and is a requirement for personal morality. In management field, “engagement” focuses on individual attitudes and behaviors towards work. There are many definitions of work engagement. Work engagement is widely considered as an individual’s positive mental state in the work roles. Kahn (1990) first defined personal engagement as “the harnessing of organization members’ selves to their work roles”. Kahn divided the engagement into physical engagement, cognitive engagement and emotional engagement. Physical engagement means that employees actively devote time and energy to their work, cognitive engagement means that employees recognize the mission of the work role and feel that they master the opportunities and resources needed to complete the work, and emotional engagement means that employees recognize the value of the work, and have a sense of trust among colleagues. Schaufeli et al. (2002) defined work engagement as a positive, fulfilling, work-related state of mind that is characterized by vigor, dedication, and absorption. Among them, Vigor is characterized by a willing to devote energy to work, and willing to persist even in the face of difficulties. Dedication is characterized by a sense of significance, enthusiasm, inspiration, pride, and challenge and strong involvement in work. Absorption is characterized as being immersed in work and difficult for individuals to separate from work.",
    "Chinese scholar Li et al. (2007) defined work engagement as a positive emotional and cognitive state of an individual in the work process. Yang (2012) believes that work engagement is the mental state that employees identify with their work, put their time and energy into work, and are willing to develop together with the organization. In the study of university teachers’ work engagement, Li (2015) pointed out that teacher’s work engagement refers to teachers’ love and enjoyment of their own work, and a state of focus on involvement, active exploration, and dedication in their work. As a feature. Li (2016) states that teacher engagement refers to a positive, progressive, and efficient state in which teachers engage in work. Huang (2018) defined teacher engagement as the positive and fulfilling mental state that teachers embody in education and teaching work. They are willing to put most of their time, energy and emotion in work. Zhu (2019) also defined work engagement as a positive, work-related and self-fulfilling state of mind that is the opposite of work burnout. Dik and Duflfy (2009) stated that a calling at work is “a transcendent summons, experienced as originating beyond the self, to approach a particular life role in a manner oriented toward demonstrating or deriving a sense of purpose or meaningfulness and that holds other-oriented values and goals as primary sources of motivation”. They divide the calling in work roles into three dimensions: external calling, sense of purpose and meaning of life, and altruistic motivation. External calling is a calling from God and from the needs of society; The sense of purpose and meaning in life means achieving the purpose and meaningfulness of one’s activity in a particular life role through efforts; Altruistic motivation takes the pursuit of “the common good” or well-being of society as the main source of motivation. Hunter et al. (2010) defined the sense of calling from three meanings: the first is the guiding force, which is a kind of guidance and calling from some unknow force; the second is personal fit, a sense of one’s job matching one’s owns abilities, and positive outcomes; the third is altruism, that is, an individual can recognize that his career helps the society and others. Dobrow and Tosti-Kharas (2012) defined a strong calling as a kind of “consuming and meaningful passion people experience toward a domain”. Hagmaier and Abele (2012) further divided sense of career calling into five parts: The first is work identity, that is, individuals believe that the job they are engaged in can realize his or her full potential; the second is sense and meaning, which means the realization of the individual’s own sense of meaning in the profession; the third is the match between the person and the environment, referring to the fit between individual abilities, talents and qualifications, and requirements of the job; the fourth is value-driven behavior, that is, an employee’s work-related behavior is influenced by moral value; the fifth is transcendent guiding force, which is a call from a higher force or an internal force. Chinese scholar Zhang (2013) stated that teachers’ career calling is a kind of psychological experience that regards teaching and educating people as one’s own mission. The author developed the teacher’s career calling questionnaire, including three dimensions of passion, devotion and faith. “Passion” refers to the full love and enthusiasm for a particular career, and it reflects how much happiness and satisfaction the teacher career can bring to oneself. The “faith” dimension mainly reflects whether the teacher’s professional ideal is firm; that is, whether he believes that he is destined to be a teacher. “Devotion” refers to the element of altruistic motivation in the teacher’s professional ideal, that is, whether he thinks that engaging in the teaching profession can contribute to the society, and hope to repay the society by becoming a teacher. Zhang (2015) divides the sense of career calling into three dimensions: altruistic contribution, guidance, meaning and value, respectively emphasizing the willingness to help others and serve the country and society in the profession, the power that promotes the calling, and the connection of profession and life meaning, value and purpose. Xi (2016) believes that the strong and meaningful passion that people experience and show in a certain professional category is the sense of career calling. Ma (2017) defined pre-school teachers’ career calling within Chinese context as: preschool teachers’ psychological experience of perception, understanding, recognition and internalization of the duties and tasks assigned to them in the cause of teaching and educating people in accordance with the needs of the country and society under the current social and historical conditions. Lin (2020) regarded career calling is a comprehensive manifestation of values in the field of work. It is an internal spiritual force and willpower that an individual yearns for, pursues, and realizes in a certain field of work. This need can be further transformed into a sense of responsibility and a sense of meaning after being satisfied.",
    "The concept of Career Development is mainly explained from the perspective of career planning, and is widely understood as a series of processes for employees’ career planning. Chinese scholars Liang and Wu (2002) stated that in a narrow sense, career development refers to a person’s entire professional process from the beginning of professional learning to the end of professional labor. In a broad sense, career development is a complete career development process from the acquisition of professional ability, the cultivation of professional interests, the selection of occupation, the employment, and the complete withdrawal of professional labor. Greguras et al. (2006) defined career development as employees’ career development process, through solving a series of difficulties and challenges, so as to achieve the transition of different stages of personal career. Zhang et al. (2003) pointed out that the perception of career development opportunities is the opportunities to obtain relevant skills promotion and job turnover through the organization. This kind of opportunities can help employees obtain career growth and ultimately achieve career development. Kraimer et al. (2011) defined the perception of career development opportunities as whether the work or position is consistent with an employee’s career goals and career interests. Newton et al. (2014) regarded perceived development opportunities as a psychological perception that employees seek to achieve a balance between their own needs and expectations in the process of making value contributions. Yu (2017) considered the perception of career development opportunities as psychological perception level of a series of resource conditions such as superior support, colleague assistance, learning opportunities, promotion space and challenging job. Career development is a long-term process, and the measurement of career development is divided into different dimensions. At present, most researches are conducted from the three dimensions of training, promotion, and salary. The measurement indicators of training development include training opportunities, training willingness, training methods, training effects; the measurement indicators of promotion development include promotion opportunities, promotion methods, and promotion speed; the measurement indicators of salary development include indicators such as salary level, salary system, and salary fairness. Chinese scholar Gao (2016) divides career development into career development motivation, career development opportunities, and career development speed. The career development opportunities include two indicators of opportunities fairness and opportunities cost. The measurement of opportunities fairness includes fairness in employment, training and promotion. The measurement of opportunities cost includes the cost of employment opportunities, training opportunities cost, and promotion. According to career construction theory (Savickas & Porfeli, 2012), career is a transformation process in which individuals try to achieve their ideal self through job roles. Individuals with a sense of career calling can deeply perceive the meaning of work and life and their own mission orientation (Dik & Duffy, 2009), these people are very aware of the gap between the actual self and the ideal self. As Hall and Chandler (2005) pointed out, when individuals regard their work as a mission, they will have a strong sense of goal meaning. Driven by the sense of goal meaning, individuals will mobilize their own self-adaptiveness, make efforts to fulfill their mission with actions, and be more dedicated to work. According to the two-factor theory of motivation, some factors can only prevent dissatisfaction and are called hygiene factors; some factors can lead to satisfaction and are called motivational factors. The perception of career development opportunity is a motivational factor that can be perceived by employees and combined with their own professional development needs. According to Maslow’s hierarchy of needs theory (1970), people’s behavioral motivation depends on people’s needs, training opportunities in career development opportunities can meet employees’ cognitive needs, and promotion opportunities can meet employees’ self-esteem needs. Cognitive needs and esteem needs belong to growth needs, which can motivate employees to engage in their work. In view of this, two hypotheses are proposed as follows: of advising system has enhanced the communication between teachers and students. The advisors provided guidance to students’ academic needs, so that the first classroom teaching work was effectively extended outside the classroom. The main task of the academic advisor is to help students complete their studies smoothly by adopting various guidance methods such as full-process guidance, special guidance according to the students’ academic stage and personal development needs. Accordingly, academic advisors are important supervisors and instructors of students’ extracurricular study, and an important support for improving the quality of talent training. Therefore, it is particularly important to establish a management system that encourages academic advisors to invest in talent training. This paper restricts the research of work engagement to the field of higher education, and studies the influence of academic advisors’ sense of career calling and career development opportunities on their work engagement. According to the education authority policy, there are no restrictions on gender, marriage, age and working period for the selection of academic advisors. However, individuals with different genders may be different in personality characteristics. Marital status may cause work-family conflicts. There may also be some differences in the work enthusiasm and commitment at different stages of career development. Therefore, this research does not restrict the gender, marriage, age, and working years of academic advisors, but conducts a comprehensive survey to try to find the differences of these demographic variables in academic advisors’ work engagement, career calling, and career development opportunities. In order to facilitate the collection of data, this study adopts a purposive sampling survey. The survey population is academic advisors from universities and colleges in Henan Province, China. According to the government report (Education Department of Henan Province, 2021), there are 133,400 full-time teachers in the universities and colleges of Henan Province. Online questionnaire survey platform is used to distribute questionnaire and collect the data. A total of 418 questionnaires were received in this survey, of which 400 were valid questionnaires, with an effective rate of 96%.",
    "In this study, sense of career calling and perceived career development opportunities are independent variables, work engagement is dependent variable, while gender, age, marriage, working period, education, job title are the control variables. Sense of career calling scale is from Chinese scholar Zhang (2013)’s teaching profession calling scale with 9 measurement items. Perceived career development opportunities scale is from Chinese scholar Yu (2017)’s scale with 4 measurement items. Work engagement scale is the shortened version of the Utrecht work engagement scale (Schaufeli & Bakker, 2004), which contains 9 measurement items. In this study, every scale is used as a one-dimensional structure. Likert-5 scale is used for the measurement of items, 1 represents “strongly incompatible”, 2 represents “incompatible”, 3 represents “unclear”, 4 represents “compatible”, and 5 represents “strongly compatible”. According to the reliability statistics, Sense of career calling scale, perceived career development opportunities scale, work engagement scale has good internal consistency, their Cronbach’s Alpha Coefficient are greater than 0.7. This shows that the adopted scales are reliable and acceptable. Table 3 shows undergraduate academic advisors have high sense of career calling, with an average score of 3.98. Among the 9 items, Academic advisors have the strongest sense of career calling in making a contribution to the society (SCC6 mean=4.09, standard deviation=1.126). This reflects academic advisors have strong social responsibility and aspire to realize their social values through teacher career. Academic advisors’ career calling can help achieve “Chinese Dream” (great rejuvenation of the Chinese nation). Talents are the key to realizing the Chinese dream, and teachers are the key to training talents. Therefore, teachers are an important force in realizing the Chinese dream of the great rejuvenation of the Chinese nation. Table 4 shows undergraduate academic advisors have high perception of career development opportunities, with an average score of 4.04. Among the 4 items, Academic advisors have the strongest perception in career prospect (PCD3 mean=4.18, standard deviation=1.120). This reflects academic advisors have high expectations for the prospects of academic advising position, and may be a motivation for them to work hard. Table 5 shows undergraduate academic advisors have high work engagement, with an average score of 3.98. Among the 9 items, academic advisors have the strongest behavioral engagement in work (WE7 mean=4.07, standard deviation=1.119). This reflects academic advisors have high concentration on their job. High engagement in talent training is helpful for establishing favorable teacher-student interaction and make teachers highly recognized by students. The recognition of students, in turn, will encourage academic advisors to be more actively involved in education and teaching. calling, perceived career development opportunities and work engagement. In Table 6, married people have a higher sense of career calling, high perception of career development opportunities, and high level of work engagement than unmarried people. This may be influenced by family economic conditions, cognitive abilities, family members expectations and support, upbringing of children. Regression analysis result in Table 7 shows that marriage can explain 4% of work engagement change, F=8.98, P=.003. After controlling the influence of marriage, the explanatory power of the regression equation increased by 73%, F=333.78, P=.000. SCC has a significant positive influence on work engagement (Beta=.871, p=.000). The higher the sense of career calling, the higher the degree of work engagement. Regression analysis result in Table 8 shows the explanatory power of the regression equation increased by 64%, F=209.92, P=.000. PCD has a significant positive influence on work engagement (Beta=.809, p=.000). The higher the perception of career development opportunities, the higher the degree of work engagement. In a word, regression coefficients show both sense of career calling and perceived career development opportunities have a strong positive correlation with work engagement. Regression analysis shows sense of career calling of academic advisors has a significant positive impact on their work engagement. The higher the teacher’s sense of career calling of academic advisors, the higher their work engagement. This is consistent with research results of Yao (2017) and Lin (2020). Some studies have shown that the sense of career calling can affect the level of work engagement through career resilience, psychological capital, and psychological empowerment (Zhu, 2020; Fu, 2020). According to the career construction theory (CCT), a career is a process of transforming an ideal self through a job role for an individual. Individuals with a sense of career calling are very aware of the gap between their actual self and ideal self, and then they will have a desire to narrow this gap. Driven by a sense of goal meaning, they will adopt actions to transform towards the ideal self, thereby being more devoted to work. The sense of career calling can positively predict work engagement mainly resulting from the sense of value and meaning of the individual. The results of the empirical analysis in this article confirm the above viewpoints. A strong sense of value and meaning helps to stimulate and maintain the inner motivation of work engagement. Academic advisors with a strong sense of calling will always feel the responsibility they shoulder and inspire them to overcome difficulties and devote themselves to their daily work with vigor.",
    "Research result shows perceived career development opportunities have a significant positive impact on work engagement. This is consistent with research result of Yu (2017). Career development opportunities can bring employees a kind of hope or optimism. In career development process, the organization provides a growth platform, employees obtain career development opportunities, and form their inner feelings. Employees who have more perceptions of career development opportunities tend to think that their pursuit of work meaning has been affirmed by the organization, and then they will be more focused on work and show higher positive emotions. Therefore, individuals who perceive more career development opportunities can inspire higher levels of work engagement. According to the theory of social exchange (Levinson, 1965), when employees get the expected rewards from the organization, they will have a psychological sentiment to reward the organization, and try to reward the organization through some channels, such as active engagement in work, give advice and suggestions, etc. Career development opportunities, as an important non-economic remuneration method, can encourage academic advisors to work hard to complete tasks and objectives in return for the organization. Besides, according to the hierarchy of needs theory (Maslow, 1970), the academic advisor’s needs for learning and self-improvement reflect cognitive needs, and the need for job prospect reflects the need for respect (achievement, reputation, status, and promotion opportunities). According to the expectation theory of Vroom (1964), when an individual considers the value of a certain goal very high, and it is estimated that the probability of achieving the goal is high, then the stronger the motivation is. It can be seen that the degree of a person’s work effort depends on the value of the goal and the possibility of its realization. According the survey results, academic advisors have a high recognition of the value and meaning of teaching profession. This also reflects the sense of professional identity and social responsibility of academic advisors, which is a positive psychological state. However, in the case of high job demands, lack of sufficient job resources support, employees are prone to job burnout, unable to achieve career goals. According to the definition of the China Association of Professional Planners, career development is a plan used by organizations to help employees acquire the skills and knowledge needed for their current and future jobs. In fact, career development is training and education activities in knowledge, ability and technology of enterprise human resources. Therefore, colleges and universities should plan and design the career of academic advisors, carry out training activities according to the job responsibilities, and improve the job competence of academic advisors (Ma, 2020). A sense of meaning is the core element of a sense of calling. Finding a sense of meaning at work is an important condition for cultivating a sense of calling. The determination of career calling must be implemented in practical activities. Therefore, academic advisors should cultivate a sense of work meaning through practical activities, make continuous practice in academic guidance, thereby firm their faith in teacher career. According to the self-discrepancy theory (Higgins, 1987), a clear future self creates a gap with the real self. Such a gap will stimulate an incentive effect, because this gap provides people with a goal for pursuit, which also provides the individual with the meaning of existence, that is, to motivate oneself to do something to bridge the gap. The future self actually helps individuals realize their meaning in life. A sense of meaning helps individuals better understand their mission, and tells how a person can maintain this sense of meaning in life through the profession he engages in. Teachers are typical knowledge workers. Knowledge employees generally have the characteristics of eagerness for self-realization, eagerness for care and recognition from the organization, and have a strong sense of self-development and career orientation. Administrators should not only simply meet their physiological and safety needs, but should focus on their needs for professional development and self-realization. Employees with a sense of professional mission orientation may be more willing to learn, have a stronger awareness of their own career planning, and are willing to make more efforts for it. Therefore, the school should provide them with continuous on-the-job training and other learning opportunities to meet the diverse needs of academic advisors and form a personalized incentive model. In addition, training plans should be formulated based on the analysis of employee goals and abilities gap, aiming at improving job competence. Moreover, in the training and development, the school should pay special attention to the analysis of the employees’ inner professional mission Knowledge-based employees, especially those with high academic qualifications, usually hope to obtain achievements through their own hard work, gain professional development and progress. Promotion can meet their needs for respect and reduce negative mood at work. Therefore, promotion decision-makers should fully listen to the opinions and suggestions in the early stage of decision-making, carry out the promotion procedures in accordance with the appointment regulations. For academic advisors with multi-responsible role, a fair promotion channel can help them better fulfill their professional mission and find a more suitable working method. Besides, leaders should care about employees and increase communication with employees and understand their expectations for the speed of promotion. Employees of different ages and working years may have different expectations for the promotion speed. Employees who have just entered the field of work often judge their work competence by their work, and their expectations for the speed of promotion are relatively low. For employees who have worked for more than 5 years, due to the gradual accumulation of work experience and knowledge, there may be a higher level of expectations for the promotion speed.",
    "This study proves that the academic advisor’s sense of career calling and the perception of career development opportunities have a positive impact on their work engagement. This will help college administrators and decision makers realize the importance of satisfying psychological needs of academic advisors in stimulating their work engagement, and thereby promote the initiative and efforts of academic mentors from the perspective of psychological contract. This will also remind the Teacher Teaching Development Center of concerning the professional development planning and needs of academic advisors, carrying out training programs such as teacher ethics and teaching style, professional learning guidance ability, innovation and entrepreneurship education, mental health education. Employees with a high sense of career calling are happy, enthusiastic, and willing to challenge difficulties. This is not only conducive to the improvement of employees’ work engagement, but also conducive to strengthening employees’ loyalty to the organization, reducing employee turnover tendency, so as to achieve the goal of sustainable development of the organization. This study uses quantitative research to verify the causal relationship between variables, but lacks strong evidence to explain the causal relationship. Future research can use qualitative research to conduct face-to-face interviews with academic advisors on career planning to understand their career development goals, progress, and needs for organizational support, so that schools can provide personalized career assistance. In addition, when evaluating the work engagement of academic advisors, this study did not elaborate on the academic advisor management system of the school where the survey respondents are located. Different schools may have different academic advisor systems and job demands, which will result in different needs for job resources. Future research can select several schools with different academic mentor system models to conduct in-depth research, summarize the common problems faced by academic advisors and propose a generalizable academic advisor management program. Finally, this research only explores the impact of career calling and career development opportunities on academic advisor’s work engagement. Future research can explore other influencing factors, such as leadership style, organizational climate, job demands and job resources, self-efficacy, psychological capital, etc."
]