[
    "How to cite this paper: Zhang, K. G., Meng, H. L., Ba, M. T., & Wen, D. H. (2024). The Spatial Distribution Characteristics of Res- ident Population Growth Rate in Henan Province, China. Journal of Geoscience and Environment Protection, 12, 191-206. https://doi.org/10.4236/gep.2024.1211011 Copyright © 2024 by author(s) and Scientific Research Publishing Inc. This work is licensed under the Creative Commons Attribution International License (CC BY 4.0). http://creativecommons.org/licenses/by/4.0/ Open Access Population is an important strategic resource for national development, a fun- damental element of socio-economic development. The coordinated develop- ment of population and economy is an effective way to achieve rapid economic growth. Based on the population statistics data of counties (districts) in Henan Province, China, from 2006 to 2021. The paper firstly uses the logistic popula- tion growth mathematical model to calculate the resident population growth rate of counties (districts), then utilizes the hotspot analysis and spatial semi- variogram analysis, to research the spatial distribution characteristics of the resident population growth rate in Henan Province. The research results show that the evolution of the regional resident population in the province basically conforms to the logistic natural growth model. The resident population growth rate shows the characteristics of high in the north and low in the south, high in the center and low in the surrounding regions. The resident population growth rate is positively correlated with the level of economic development; the urban built-up areas, especially the new regions in urban planning, have a fast growth rate of resident population, which has a significant siphon effect on the popu- lation of surrounding regions. The hotspots of resident population growth rate in the province are mainly distributed in the urban built-up areas and sur- rounding regions of Zhengzhou, Luoyang, and Xinxiang, accounting for about 3.51% of the total area of the province. The cold spots are mainly distributed in the eastern part of the province, forming zonal distribution, which spans across Shangqiu City, Zhoukou City, and Zhumadian City, accounting for about 8.61% of the total area of the province. The area with negative growth of resident population accounts for approximately 53.47% of the total province. The spatial distribution of the growth rate of the resident population in the whole province basically conforms to the spherical model, with a small disper- sion degree and a short range. In the range, there is a high degree of variability Population is the destiny of a country, an important strategic resource for national development, and a fundamental element for socio-economic development (Ma et al., 2022; Deng et al., 2017). The regional population distribution is influenced and constrained by various factors, such as social production mode, economic de- velopment level, regional resource environment, transportation accessibility, and history (Deng et al., 2017; Yan & Li, 2017; Cao, 2022; Song et al., 2022). The socio- economic development of a region largely depends on population security. The coordinated development of population and economy is an important way to achieve rapid economic growth and effectively solve population problems. Popu- lation growth leads to an increase in the size of the labor force, and demographic bonus generated could promote regional economic development. At the same time, rapid economic growth also could provide a relatively favorable living envi- ronment for regional population, attract more migrants, and effectively promote In recent years, driven by factors such as location, natural endowment, and pol- icies, the large-scale population migration brought by regional development differ- ences, not only promotes rapid urbanization, but also profoundly affects the re- gional macroeconomic pattern. The uneven distribution pattern of regional popu- lation brings about uneven spatial allocation of social factors, and on the other hand, the uncoordinated distribution pattern of population and economy leads to the widening of regional development gap, and restricts the coordinated develop- ment of regional economy. In the process of China’s economy shifting from high- speed growth to high-quality development, solving the problem of “imbalance and insufficiency” in development has become an important research contents for im- proving the quality of development (Ma et al., 2022; Yan & Li, 2017). Studying the population distribution pattern and its evolution laws, revealing the dynamic mechanism of population spatiotemporal evolution, have important practical significance for scientifically guiding the rational layout of population, achieving regional coordination and high-quality development (Ma et al., 2022; Deng et al., 2017; Yan & Li, 2017), has also been becoming a focus of scholars’ attention. In recent years, the researches on population distribution have mainly focused on two aspects: one is the analysis of spatiotemporal pattern evolution characteristics, which, based on sampling survey data, using the methods, as centroid model, spatial autocorrelation model, concentration index and imbal- ance index, offset sharing model, and network analysis etc., explore the character- istics of population distribution, population mobility, and population pattern evo- lution in different regions and scales. The second is the study of driving factors for the spatiotemporal patterns evolution, which, based on qualitative analysis or quantitative exploration using diversified models, study the impact on the evolu- tion of population distribution patterns of natural environment, economic and social development factors, economic development level, industrial structure, em- ployment opportunities and income levels, the basic pattern of population distri- bution, economic and social development factors, infrastructure and public ser- vice capabilities, etc. These researches have obtained many practical conclusions, providing scientific guidance for regional socio-economic development (Ma et al., The growth of resident population in a region mainly comes from natural pop- ulation growth within the region and population migration between regions (Sun & Zhang, 2015; Liu et al., 2017). In a similar overall environment for economic development, the regions should have the same natural population growth rate, and the differences in regional population growth rates mainly come from the migration of population between regions. The social living environment and eco- nomic development level of a region play an important role in the migration of population between regions (Xiao, 2010; Sun & Zhang, 2015; Liu et al., 2017).",
    "The growth rate of regional population fundamentally reflects the degree of dif- ference in regional population growth. Based on the population statistics data of counties in Henan Province from 2006 to 2021, this paper, firstly uses the logistic population growth mathematical model to calculate the resident population growth rates of counties, and then utilizes the spatial analysis methods, such as the hotspot analysis and spatial semi-variogram analysis, to research the spatial distribution characteristics of the resident population growth rate in the province, in order to provide meaningful references for formulating reasonable provincial economic and social development policies. Henan is located in 31˚23'N - 36˚22'N, 110˚21'E - 116˚39'E, with a total area of 1.67 × 105 km2, with 17 prefecture-level cities, 21 county-level cities, 82 counties, and 54 municipal districts. The terrain is high in the west and low in the east, and the regional terrain relief gradually decreases with the increase of longitude, the distribution density of resident population is inversely proportional to the terrain relief. From 2006 to 2020, the number of registered population and resident pop- ulation increased gradually. In 2021, the number of registered population and res- ident population shows a negative growth for the first time. In 2014, China began to adjust from the one-child policy to two children free policy. Driven by the pop- ulation policy, how to ensure the coordinated development of provincial economy Theoretically, resident population change in a certain region is a self-organized evolution process, influenced by the regional resource environment, terrain dis- tribution characteristics, geographical location, socio-economic development level, and development policies. The change of resident population mainly comes from natural population growth and inter regional population migration, which basically conforms to the characteristics of logistic curve, where, tP is as the discrete variable of resident population data. t is the sequence of time, a is a regional constant, r represents the natural growth rate of resident population, 0P is as the environmental load capacity. a and r are the regression coefficient of the linear regression equation, where SSR and SSE are the regression squared sum and residual squared sum of Equation (2), n is the number of observed years. Giving a significance level α , based on the critical value αF of the F distribution, as F F> α , a and r are sig- nificant. The environmental load force 0P is the function of the regional environment (Li et al., 2019; Yang et al., 2022). For ease of calculation, the inflexion of Equation (1) is used, and where the tangent slope reaches the maximum, the curve changes from concave to convex. Its value is fitted with the maximum slope of the meas- ured curve (Yin, 2002) The cold and hot spot analysis is an effective method for exploring the local spatial aggregation characteristics of the growth rate of resident population. If there is a strong spatial correlation between the growth rate of resident popula- tion, it indicates that the spatial process factors of resident population growth are affecting the growth of the regional resident population. Studying the re- gions with strong correlation and exploring the significant aggregation charac- teristics of resident population growth rate in spatial patterns, could help to arrange social resources reasonably, ensure the balance of regional population distribution, and guarantee reasonable changes in regional population (Getis & Ord, 1992; Lu et al., 2023). Under the second stationary assumption (Zhang et al., 2020), the hot and cold spots analysis utilizes the Getis-ord *Gi statistical analysis model where, r and S represent the mean and variance of the growth rate of the resi- dent population, respectively. ( = W w )ij n n × is the spatial relationship matrix of the counties, ijw = if and only if the county i and j are connected by edges 1 (edge), otherwise ijw = . 0 Gi > means the weighted average of the resident * 0 population growth rates in the surrounding i county is greater than the overall average, indicating where is hot spot region with higher resident population growth rates. The larger *Gi , the more obvious the hot spots are. In other words, Gi < means the weighted average of the resident population growth rates in * 0 the surrounding i county is less than the overall average, indicating where is cold spot region with lower resident population growth rates. The smaller *Gi , the more obvious the cold spots is.",
    "The overall aggregation characteristics are described by the deviation multiple from the overall theoretical standard deviation of the mean of the sample and the mean of the overall theoretical mean The significance level of the aggregation characteristics is based on hypoth- esis testing, as r and ir converge in probability to a normal distribution ( )2 ,N µ σ (Getis & Ord, 1992; Lu et al., 2023; Huang & Xu, 2020). The resident population growth rate ( r P ) = ( r x y , ) is a regionalized variable, which is different from an ordinary random variable, which conforms to a certain probability distribution, while a regionalized random variable takes a value ac- cording to its location in a region. In other words, the regionalized random vari- able is the specific value of the ordinary random variable at a certain time and a specific location. It is a random function based on the position, an ordinary ran- dom variable in one place (Zhang et al., 2020; Li et al., 2014; Chen et al., 2019; Liao et al., 2016). The resident population growth rate has two significant characteristics: random- ness and structural. Firstly, it is a random variable, and has the characteristics of locality, randomness, and abnormality; secondly, it has average structural properties, which not only reflects the natural population growth level in the location, but also reflects the attractiveness of partial advantages to population migration, to some extent, resulting in the spatial correlation characteristics between the res- ident population growth rate )0Z P at ( 0P and )iZ P at ( iP , where 1P is h away from 0P . These spatial correlations depend on the distance h between the two points and the characteristics of the resident population growth rate itself. where ( )N h is the number of observation value pairs, ( )i r P is the mean of the observation value ,which has nothing to do with the position of iP . In order to conveniently study the overall changes in the resident population growth rate in different places, explore the differences in the resident population growth rate at different distances, the distribution of the resident population growth rate at specific distances, and the relationship between the resident popu- lation growth rate and distance changes, the semi-variogram function of the resi- dent population growth rate ( )hγ is defined as half of the covariance of the res- ident population growth rate for all pairs of observation points ( iP P′ ,i ) at the distance of h which reflects the resident population growth rate variation of all point pairs at the distance of h in the discrete point group, as well as its spatial distribution char- acteristics. The semi-variogram function, calculated based on the observed values of dis- crete resident population growth rate is a discrete function, in order to study the overall characteristics of regional changes in resident population growth rate, us- ing curve fitting method to transform it into a continuous function to obtain a mathematical model of semi-variogram function. Commonly used fitting func- tions include exponential model, spherical model, Gaussian model, and linear model, etc. The mathematical model of a continuous semi-variogram function could be described by four parameters, namely, the localized discontinuity value or nugget value C 0 = lim → h 0 γ ( ) h , which reflects the spatial variation caused by random fac- tors, is determined by the variance of observed values at a single location; As the interval distance h increases, ( )hγ from 0C gradually tends to a constant + C C 0 = lim →∞ h ( ) h , called the sill value, which reflects the largest variation in resi- dent population growth rate; when ( )hγ reaches near the sill value and tends to stabilize, the corresponding value h is called the range (a), which reflects when h a≥ , the spatial correlation of resident population growth rate disappears (Zhang et al., 2020; Li et al., 2014; Chen et al., 2019; Liao et al., 2016). Based on the fitting semi-variogram model, using spatial interpolation analysis could calculate the resident population growth rate at unknown points, which could present the overall spatial distribution and variation characteristics of resi- dent population growth rate in the whole area.",
    "The Kriging interpolation method is based on the data of known points in the finite neighborhood of an unknown point, taking into their spatial position rela- tionship and the structural information provided by the fitting semi-variogram model, using unbiased optimal estimation to calculate the value of the unknown point where iλ is the contribution of the resident population growth rate of the known point iP to the unknown point P. n is the number of points within the specified distance neighborhood of P. K is the augmented matrix of the semi-vari- ogram values on the known points, D is an augmented column vector of the semi- variogram values from the known points to the unknown point (Zhang et al., 2020; Liao et al., 2016). Using Equation (1)-(4) to calculate the growth rate of the resident population in the units of county (district), city and province, under the confidence level of 90%, by the test of F, the resident population growth rates show significant character- istics. The results for the province and each city are shown in Table 1 and Figure 1, and the county (district) are shown in Figure 2. The growth rate of the resident population in the province is about 86.5 × 10−4. In the city level, there are six cities with the resident population growth rate higher than the provincial average, namely Zhengzhou, Xinxiang, Luoyang, Jiyuan, Puyang, and Hebi in descending order. The resident population growth rate in Zhengzhou has reached 13.10 times the provincial average, while the resident pop- ulation growth rates in Xinxiang and Luoyang are about 2 times the average. In terms of urban scale and city economic output, Zhengzhou and Luoyang rank among the top two in the province, while Xinxiang urban scale and city economic output are relatively lagging behind in the provincial ranking, where the popula- tion growth might be attributed to its regional location (Figure 1). There are six cities with negative resident population growth rates, with an av- erage growth rate of −111.60 × 10−4, namely Sanmenxia, Zhoukou, Zhumadian, Xinyang, Luohe, and Nanyang in ascending order, which indicates that the resi- dent population here is gradually decreasing, and under the assumption of the same natural growth rate of populatio in the province, where shows the significant population outflow characteristics. The resident population growth rate in San- menxia is lowest, about 1.53 times of the negative average, while Zhoukou and Zhumadian are slightly higher than the negative average level, and Xinyang and Luohe are about 0.77 times the negative average level. In geographical distribution perspective, the resident population growth rate shows a characteristic of higher in the north and lower in the south, higher in the center and lower in the surrounding regions. The resident population growth rate is positively correlated with the level of economic development. Among the 158 counties (districts) in the province, 71 counties (districts) have a positive resident population growth rate of, where the resident population is gradually increasing; 51 counties (districts) have a resident population growth rate higher than the provincial average, of which 30 urban built-up areas, 3 county- level cities, namely Xinzheng City, Dengfeng City, and Xinmi City, 8 counties, as Zhongmu County, Ruyang County, Qi County, Xinxiang County, Weishi County, Yuanyang County, Changyuan County, and Song County, of which Zhongmu County is adjacent to Jinshui District of Zhengzhou Urban to the west and Fuxiang District of Kaifeng urban to the east, Qi County is adjacent to Qibin Dis- trict of Hebi urban to the north, and Xinxiang County is adjacent to the three built-up areas of Xinxiang urban. The remaining 5 counties are relatively far away from urban built-up area. Among the 51 counties (districts), there are 10 counties (districts) with a resident population growth rate more than 10 times of the aver- age level, including Jinshui District, Guancheng District, Huiji District, Xinzheng City, and Zhongmou County in Zhengzhou City; Luolong District in Luoyang City, Longting District in Kaifeng City, Qibin District in Hebi City, Yicheng Dis- trict in Zhumadian City, and Shanyang District in Jiaozuo City. There are 11 counties (districts) with a resident population growth rate of 5 to 10 times of the average level, including Zhongyuan District, Erqi District, and Shangjie District in Zhengzhou City; Jianxi District and Laocheng District in Luoyang City; Hongqi District and Weibin District in Xinxiang City; Chuanhui District in Zhoukou City; Hualong District in Puyang City; Zhanhe District in Pingdingshan City; and Liangyuan District in Shangqiu City. From a local geographical distribution per- spective, Chuanhui District in Zhoukou City exhibits local heterogeneity charac- teristics, with a negative resident population growth trend in the urban built-up area at a rate of approximately −141.60 × 10−4, while the population growth rate in the egion is 652.72 × 10−4.",
    "Among the 158 counties (districts) in the province, 87 counties (districts) have a negative resident population growth rate, where the resident population is grad- ually decreasing, with an average population growth rate of −150.17 × 10−4, which includes 12 urban built-up areas, namely Xigong District in Luoyang City, Shaan- zhou District in Sanmenxia City, Shunhe District, Gulou District and Xiangfu Dis- trict, as well as Yuwangtai District in Kaifeng City, Shilong District in Ping- dingshan City, Zhongzhan District and Macun District in Jiaozuo City, Yindu District in Anyang City, Shancheng District and Heshan District in Hebi City , at the same time, Heshan District is also the region with the largest population de- cline in the province, with a resident population growth rate of −512.12×10−4, which is −5.92 times of the resident population growth rate in the province, and 3.41 times the average in population negative growth region. Except for Shaan- zhou District in Sanmenxia City, the resident population of the cities, where these built-up areas are located in, is showing a positive growth trendency. The resident population of 11 county-level cities, including Yongcheng, Wei- hui, Wugang, Mengzhou, Yuzhou, Xingyang, Qinyang, Dengzhou, Lingbao, Xiangcheng, and Yanshi, show a negative growth trendency. Except for the three county-level cities, as Dengzhou, Lingbao, and Xiangcheng, the resident popu- lation of the cities, where they are located in, is showing a positive growth trendency. The resident population growth rate of Yanshi City is only higher than that of Heshan District, ranking second to last in the province with −482.19 × 10−4, from the perspective of regional location and economic development level, which should be greatly affected by the population siphon effect of adjacent Luolong District of Luoyang urban. The resident population growth rate of Xingyang City, which is adjacent to three built-up areas in Zhengzhou, is about −287.17 × 10−4, from the perspective of regional location and economic development level, it should be greatly affected by the population siphon effect of neighboring Zheng- zhou urban built-up area. Among the remaining 66 counties (districts) with neg- ative resident population growth, there are 3 in Kaifeng city, 2 in Luoyang city, 3 in Pingdingshan city, 3 in Anyang city, 1 in Hebi city, 1 in Xinxiang city, 2 in Jiaozuo city, 4 in Puyang city, 1 in Xuchang city, 2 in Luohe city, 2 in Sanmenxia city, 9 in Nanyang city, 6 in Shangqiu city, 8 in Xinyang city, 8 in Zhoukou city, with negative population growth are located in the eastern, southern, and western border regions of the province. In the eastern part of the province, there is only one built-up area, Hualong District, in Puyang City, apart from this, only Taiqian County has shown positive resident population growth, while the other four coun- ties (districts) have shown negative resident population growth; Shangqiu City only has two built-up areas, as Liangyuan District and Suiyang District, while all other counties (districts) show negative resident population growth; Zhoukou City has only one built-up area (Chuanhui District), while all other counties (districts) are experiencing negative resident population growth; Zhumadian City has only one built-up area (Yicheng District), while all other counties (districts) are experienc- ing negative resident population growth. In the southern part of the province, Xinyang City only has two built-up areas, as Pingqiao District and Shihe District, while all other counties (districts) show negative resident population growth; Nan- yang City only has two built-up areas, as Wanping District and Wolong District. Except for Xixia County, the resident population of the other 10 counties (districts) has shown negative growth; Sanmenxia City has two built-up areas, as Shanzhou District and Hubin District, except for Hubin District and Yima City, all other 4 Using Equations (5) and (6) to calculate the Getis-ord Gi* index and the corre- sponding Zscore for each county (district), and the results are shown in Figure i 3 and Figure 4, The resident population growth rate in the province exhibits clear distribution characteristics of hot and cold spots. Under the confidence level of 90%, the hotspot regions are mainly concentrated in and around the built-up areas of Zhengzhou, Luoyang, and Xinxiang, accounting for 3.5068% of the total area of the province; the cold spot regions are mainly concentrated in the eastern part of the province, spanning Shangqiu City, Zhoukou City, and Zhumadian City. Wuyang City, located at the junction of Zhumadian City, Nanyang City, Ping- dingshan City, and Luohe City, also exhibits the distribution characteristics of cold spot. Under the confidence level of 90%, its area accounts for 8.6102% of the total area of the province. Under the confidence level of 99%, the hotspot area includes all built-up areas of Zhengzhou City, as well as the north adjacent Yuanyang County, east adjacent Zhongmu County, and south adjacent Xinzheng City, with a total area of 4671.10 km2, accounting for approximately 2.7971% of Using Equations (7) and (8) to calculate the semi-variogram function values of the resident population growth rate ( )hγ , then utilize the exponential model, spherical model, Gaussian model, and linear model to fit the function curve, un- der maximum the coefficient of determination and minimum residual, obtain the optimal semi-variogram function, a spherical model.",
    "The parameters corresponding to the semi-variogram function are the nug- get C 0 = × 1.8700 10 − 4 , the sill value + C C 0 = × 1.2280 10 − 3 , and the range a = 11.700 km . The average distance between 158 sampling points is about 124.746 km, and the average nearest distance is about 20.2014 km. The nugget and the sill value shows that the dispersion of resident population growth rate is rela- tively small. In the range, the spatial heterogeneity of resident population growth rate ( C C C+ )0 = 84.77% is large, but the range is relatively small. Based on the spherical model and Using Equation (9), to perform Kriging in- terpolation analysis on the province, the results are shown in Figure 5. Calculating the contour lines of Figure 5, the distribution of contour lines with the interval of 0.01 for the resident population rate is shown in Figure 6. Statistics show that the area with negative resident population growth is about 8.92 × 104 km2, accounting for approximately 53.47% of the total area of the province. This paper is based on the population statistics data of counties in Henan province from 2006 to 2021, taking counties (districts) as the basic unit, using a logistic population growth mathematical model to calculate the growth rate of the resi- dent population in counties (districts), then utilizing the spatial analysis methods, as hotspot analysis and semi-variogram function analysis to study the spatial dis- tribution characteristics of the growth rate of the resident population in the prov- ince. The research results show that: 1) the evolution of the resident population in the province basically conforms to the logistic natural growth model, the resident population growth rate shows the characteristics of high in the north and low in the south, and high in the center and low in the surrounding areas. The resident population growth rate is positively correlated with the level of economic devel- opment. 2) Urban built-up areas, especially new regions in urban planning, have a rapid growth rate of resident population where have a significant siphon effect on the population of surrounding regions. Under the confidence level of 90%, the hot spots of resident population growth are mainly distributed in the built-up ar- eas and surrounding regions of Zhengzhou, Luoyang, and Xinxiang, accounting for 3.51% of the total area of the province. The cold spots are mainly distributed in the eastern part of the province, spanning across Shangqiu City, Zhoukou City, and Zhumadian City, accounting for 8.61% of the total area of the province. 3) The spatial distribution of the resident population growth rate in the whole prov- ince basically conforms to the spherical model, and the dispersion of the resident population growth rate is small and the range is short. Within the range, the spa- tial heterogeneity of resident population growth rate is large, but the range is rel- atively small."
]