[
    "Introduction. The opening of university stadiums and gymnasiums to public can alleviate the contradiction between supply and demand of mass fitness service and improve the allocation of university sports resources. It also has the function of promoting the reform of college physical education and improving its popularity. Purpose. The current management model of university stadiums and gymnasiums in Henan province is relatively backward, and the lack of management talents and management funds restricts the scale and efficiency of the opening of stadiums. The purpose of the article is to outline general problems in the management mode of university stadiums and gymnasiums in Henan province and provide possible solutions. Results. To meet the needs of daily teaching, it is also necessary to meet the needs of marketization of sports venues with the opening of college sports venues. This puts forward higher requirements for the construction, reconstruction, expansion, maintenance, security and service of the stadiums. This requires a lot of manpower, material and financial resources, and will greatly increase the operation and management costs of college sports venues. However, the current provincial financial support is the main source of capital investment required for the operation and management of college sports venues in Henan Province, in addition to the school's self-raised funds. Due to the relatively low proportion of college sports funds in the provincial education funds, the investment in the construction and maintenance of stadiums is insufficient. The income-generating ability of universities is also limited, so the sports funds of most universities cannot meet the financial needs. The management mode of university stadiums and gymnasiums mainly includes four categories: independent university management mode, contract management mode, entrusted management mode and corporate management mode. Independent university management mode lacks management flexibility. Contract management mode can improve the utilization rate of stadiums; however, the cost of venue maintenance will increase. Under this mode, ownership and management are separated. Entrusted management mode had smaller degree of separation between ownership and management. Corporate management mode requires higher management level. At present, many universities in Henan Province mainly adopt the self-management model which has certain limitations. Therefore, it should be supplemented by the introduction of the other three models and be further compatible with modern Internet technology. As a result, a completely new model of opening up management is developed. Conclusions. To diversify current management models and establish a \"people-oriented\" management concept universities in Henan Province should appropriately introduce market models such as entrusted operation, contracted operation and corporate operation on the basis of independent management. More professional service concepts will be introduced to improve service awareness and adapt to changing market requirements through cooperation with society and enterprises. Appropriate market research on and off campus should be conducted before the venue is open.. On the basis of fully considering the needs of consumers, combined with the actual situation of universities, reasonable opening methods, opening facilities, opening hours, opening prices, and number of exercisers of sports venues can be determined. Finally, service-oriented modern management concept will be established. In this way, the dual goal of improving the quality of physical education in schools and taking into account long-term benefits can be achieved. Keywords: management of stadiums and gymnasiums of colleges, management of sports establishments, management models, management of sports facilities, sports of Henan Province. Анотація. Відкриття університетських стадіонів та спортивних залів для громадськості могло б полегшити суперечність між попитом та пропозицією послуг у сфері фітнесу та покращити розподіл університетських спортивних ресурсів. Він також виконує функції сприяння реформі фізичного виховання в коледжах та підвищення його популярності. Сучасна модель управління університетськими стадіонами та спортивними залами в провінції Хенань є відносно відсталою, а відсутність управлінських талантів та брак ресурсів обмежує масштаби та ефективність відкритого використання спортивних закладів. Мета статті – виділити загальні проблеми в управлінні університетськими стадіонами та спортивними закладами в провінції Хенань та запропонувати можливі рішення. З переходом до відкритого режиму використання спортивних майданчиків освітніх закладів, крім задоволення потреб освітнього процесу, необхідно приділити суттєву увагу маркетингу. Такий підхід змінює вимоги до будівництва, реконструкції, розширення, обслуговування, охорони та обслуговування стадіонів. При цьому вимагається значно більша кількість трудових, матеріальних та фінансових ресурсів і значно збільшуються експлуатаційні витрати та управління спортивними майданчиками коледжів. Основним джерелом капітальних вкладень у будівництво та реконструкцію споруд спортивного призначення при закладах освіти є бюджет провінції. Додатково для потреб функціонування та управління спортивними майданчиками коледжів у провінції Хенань використовуються власні кошти. На жаль, цих ресурсів досі недостатньо для масштабного оновлення.",
    "Режим управління університетськими стадіонами та спортивними залами переважно включає чотири категорії: незалежний режим управління університетом, режим контрактного управління, режим довіреного управління та режим корпоративного управління. У режимі незалежного управління університетом відсутня гнучкість управління. Режим управління контрактами може покращити рівень використання стадіонів, однак вартість обслуговування може зрости. У цьому режимі розділяються функції власника та менеджера. Довірений режим управління має менший ступінь поділу між власниками та управлінцями. Режим корпоративного управління висуває вищі вимоги до якості управління. На сьогодні більшість університетів провінції Хенань застосовують модель самоврядування (незалежного управління), яка має певні обмеження. Тому її слід доповнити введенням інших трьох моделей разом з використанням сучасних Інтернет-технологій. Як результат, має бути запропонована абсолютно нова модель. university Stadiums and Gymnasiums can alleviate the contradiction between supply and demand of mass fitness and improve the allocation of university sports resources. It also has the function of promoting the reform of college physical education and improving its popularity. However, the current management model of university Stadiums and Gymnasiums in Henan Province is relatively backward, and the lack of management talents and management funds restricts the scale and efficiency of the opening of stadiums. Therefore, it is necessary to diversify the open management mode of sports venues, establish a scientific open management system, train and introduce professional management talents, broaden sources of funds, and improve operating efficiency. Analysis of recent research and publications. The issue of sports facilities management has been thoroughly examined by the world’s most prominent scientists in the sphere of business administration and wellfare management. Matthew Guschwan have been analyzing the basic principles used in stadium management. Development of international experience was carefully described by Li Deyi and Lu Hengbo [6]. Chen Kun, Chen Peifeng, Lin Yongqin [1] analysed modern stadium management techniques. In this article their ideas will be used as a basis in order to develop strategies for future improvement. Formulation of research goals. Thus, the purpose of the article is to outline basic trends in sport facility management in Hennan province, to diversify the open management mode of sports venues, establish a scientific open management system, train and introduce professional management talents, broaden sources of funds, and improve operating efficiency. Outline of the main research material. With the rapid economic development and the improvement of people’s living standards, the public’s pursuit of a healthy lifestyle has become increasingly intense [8]. Daily physical exercise has become the fitness needs of most people [3]. Although China's sports industry started late, it has developed rapidly. From 2013 to 2019, the number of sports venues has approximately doubled (Fig 1). However, the current fitness venues provided by the society cannot meet the needs of the people. In the current situation, it is necessary to make full use of the functions of the existing sports production areas. In 2016, the area of college sports venues in Henan Province was 4.591 million square meters, accounting for 5.15% of the total area of sports venues in Henan Province. The opening of university Stadiums and Gymnasiums can alleviate the contradiction between the supply and demand of mass sports and fitness to a certain extent. It can not only give full play to the social utility of university sports resources, but also create economic benefits for universities. The present situation of opening of university stadiums and gymnasiums is quite promising. At present, in Henan province most universities mainly make their outdoor stadiums, such as track and field, football, basketball and tennis courts available to public access. While indoor basketball gym, volleyball gym, badminton gym and natatorium are opened less frequently. Take Xinxiang City in Henan Province as an example, there are four universities in this City. The outdoor stadiums of these schools are free to the public, but most of the indoor stadiums are only for college students. Only natatorium of two universities are open to the public, but admission fee is charged for entrance. Government’s National Fitness Implementation Plan (2016-2020) it is pointed out that by the end of 2020 the number of people who regularly participate in physical exercise would reach 35 million. The physical fitness of the people has improved significantly, and the pass rate of national fitness monitoring exceeds the national average. Sufficient stadiums are the foundation of popular sports. There are various types of college sports venues, which can cover most sports. Their opening to the outside world can provide more professional physical training places, can effectively alleviate the lack of social sports resources, and meet the needs of the population for diversified physical exercises. This provides strong support for the improvement of the public service system of national fitness in our province.",
    "Most of the outdoor sports venues in universities are open to the public when there is no teaching, mainly in the evening, weekends and holidays. In the opening time the social utilization rate is relatively high. However, the indoor venues are basically idle outside of teaching. Especially during the winter and summer vacations, most of the venues are closed, which is not conducive to the effective allocation of resources. At present, most of the college stadiums in Henan Province are managed by physical education teachers or school logistics personnel who use the stadiums. The protection, maintenance and update of sports facilities are mostly taken care of by the logistics department managers. The management and maintenance are mainly to meet the needs of daily teaching work. However, the traditional management model, low service sense, and low specialization cannot effectively meet the management needs of opening up. This will also perfect the allocation of college sports resources and improve economic benefits for both colleges and society. People's increasing attention to physical exercise and government policy support provide a good opportunity for the opening up of university stadiums. Opening outdoor stadiums and gymnasiums free of charge can facilitate for full use of college sports resources, form a valuable supplement to social public fitness resources, and improve resource allocation efficiency. By opening indoor stadiums and gymnasiums for a certain fee, we will not only avoid resource idleness and waste, but also accumulate resources from the income for the use of service to solve the problem. This will add to the construction, maintenance, and renewal of sports facilities in colleges and universities and alleviate the problem of tight funding for college sports in Henan Province and improve the economic benefits of state-owned assets. The positive significance of the opening of university stadiums and gymnasiums may alleviate the shortage of fitness venues and promote the popularization of sports Chinese government attaches great importance to the development of sports and pointed out the necessity of “Extensively carrying out of national fitness exercises to promote the overall development of mass sports and competitive sports” [6]. In the Henan Provincial All this is conducive to promoting the reform of physical education in colleges and universities and increasing the popularity. The opening of university stadiums to the general public through a combination of paid and unpaid services, is conducive to the promotion and maintenance of university sports facilities [1]. This can also enrich the content of college sports activities and improve students' interest in sports activities and organizational capabilities. It can integrate the relatively independent field of college physical education into the tide of social sports reform, and promote the reform of college physical education. In addition, university sports venues are open to the outside world, allowing more people to enter the campus and experience the campus environment, campus infrastructure and campus culture, which can expand the influence and recognition of universities in society, increase the popularity of universities, and enroll students in universities Employment, etc. have a positive impact. There are certain difficulties in the opening management of college stadiums in Henan Province. The open management model of university stadiums is relatively backward. With the opening to the outside world, the management of stadiums and stadiums will be complicated, and the management content and difficulty will be greatly increased. Especially for paid venues, the stakeholders intersect each other, which need higher requirements for management professionalism and service. However currently, most colleges or universities in Henan Province currently adopt a self-management model for sports venues. It also often claimed that there is a lack of professional stadium management talents. At present, many universities in Henan Province tend to focus on research talents, professional teachers and counselors when recruiting sports talents. Although these talents are of high quality, they mainly serve education rather than management. In universities employees having knowledge of sports management and practical experience in operation are very scarce. Therefore, the stadiums of many universities in Henan Province have neither professional managers nor operational talents. The current situation is that physical education teachers are generally only responsible for maintaining the safety of the sports facilities and venues when they use during class. At the rest of the time the stadiums are mostly managed by logistics personnel or temporary workers. The management procedures are simple and not standardized enough. The lack of management talents often results in unreasonable schedules for the use of stadiums, untimely maintenance of stadium sports equipment, more hidden dangers in stadium safety, insufficient professional stadium services, and low efficiency of paid openings, which are not conducive to the healthy development of university stadiums. Taking the author’s university as an example, the sports venues are basically managed by the Service Department. Most of these managers lack professional sports management knowledge and service awareness, and the maintenance of the stadium sports facilities is not timely enough, which makes the operation efficiency of many stadiums more efficient low.",
    "With the opening of college sports venues, in addition to meeting the needs of daily teaching, it is also necessary to meet the needs of marketization of sports venues. This puts forward higher requirements for the construction, reconstruction, expansion, maintenance, security and service of the stadium. This requires a lot of manpower, material and financial resources, and will greatly increase the operation and management costs of college sports venues. These costs include the costs of market research, expert consultation and scientific demonstration for the opening of the venue, and the costs of scale operation and management after the opening. However, the current provincial financial support is the main source of capital investment required for the operation and management of college sports venues in Henan Province, in addition to the school's self-raised funds. Due to the relatively low proportion of college sports funds in the provincial education funds, the investment in the construction and maintenance of stadiums is insufficient. The income- generating ability of universities is also limited, so the sports funds of most universities cannot meet the financial needs of opening up stadiums. Take the four universities in Xinxiang City as an example, Although the construction of outdoor stadiums has been rapidly developed in recent years, most of the outdoor stadiums are open free of charge, and there is no clear fee standard. It is difficult to obtain sufficient financial support after opening. The indoor sports venues are seriously inadequate, and due to lack of sufficient funds for updating and maintenance, sports resources are in short supply and the equipment is outdated and damaged. As a result, it is difficult to meet the open standards in terms of quantity, scale and quality. It can be seen that funding issues are also one of the bottlenecks restricting the opening and operation of university stadiums. There are also some countermeasures for the opening of the stadiums and gymnasiums of universities in Henan Province. This may include the necessity to improve the management model of university stadiums and stadiums. The open management mode of university stadiums and gymnasiums mainly includes four categories: independent university management mode, contract management mode, entrusted management mode and corporate management mode [4,5]. Independent university management mode lacks management flexibility. Contract management mode can improve the utilization rate of stadiums; however, the cost of venue maintenance has increased. Under this mode, ownership and management are separated. Entrusted management mode had smaller degree of separation between ownership and management. Corporate management mode requires higher management level. At present, many universities in Henan Province mainly adopt the self-management model which has certain limitations. Therefore, it should be supplemented by the introduction of the other three models and be further compatible with modern Internet technology [7]. As a result, a completely new model of opening up management will be developed (fig. 2). To diversify current management models and establish a \"people-oriented\" opening management concept universities in Henan Province should appropriately introduce market models such as entrusted operation, contracted operation and corporate operation on the basis of independent management. Through cooperation with society and enterprises, more professional service concepts will be introduced to improve service awareness and adapt to changing market requirements. Before the venue is open, appropriate market research on and off campus should be conducted. On the basis of fully considering the needs of consumers, combined with the actual situation of universities, reasonable opening methods, opening facilities, opening hours, opening prices, and number of exercisers of sports venues can be determined. Finally, service-oriented modern management concept will be established. In this way, the dual goal of improving the quality of physical education in schools and taking into account long-term benefits can be achieved. A trusted scientific management system for opening up must be established. A scientific and rigorous management system is an important guarantee for the opening quality of stadiums. Universities in Henan Province should change the traditional single and extensive management method, and implement scientific and orderly management methods in every aspect of opening up management. Universities should formulate scientific opening hours, appointment systems, admission registration systems, fee collection systems, and compensation systems based on the objects of use of stadiums. For example, formulate working rules, training and management systems, and rewards and punishment systems for the employees of sports venues; formulate risk prevention and control systems, emergency management systems, and security systems for stadium safety management; formulate capital budgets and finances for stadium open fund management Approval and financial management In China, universities must have a certain reserve of operation and management talents if they want to improve the management model of the opening of stadiums and innovate the management system. Therefore, colleges and universities must first focus on the training of sports stadium management talents, actively explore the establishment of interdisciplinary majors between sports and management disciplines, and formulate training programs based on the market. First, in the process of cultivating students, colleges and universities should focus on the combination of theory and practice, set up more practical training courses, appropriately adopt the \"school-enterprise cooperation\" model, and cultivate applied talents who understand sports professional knowledge and have management capabilities. This can not only achieve self-sufficiency, but also fill the lack of sports management talents in our province. Secondly, colleges and universities should pay attention to the introduction of management talents for stadiums. From the talent market, we will introduce stadium management and management talents with advanced concepts and practical experience. Establish a talent team that understands sports, is good at communication, and can manage, and can solve practical problems. Finally, colleges and universities should also pay attention to the follow-up education of talents, and encourage stadium managers to participate in training on the management and maintenance of stadiums.",
    "Sufficient funds are the guarantee for the external operation of university stadiums. In the case of limited government financial investment, on the one hand, universities must seek more sources of funding, on the other hand, we must improve the economic efficiency of venue operations and ensure sufficient internal funds. For example, universities can cooperate with social capital through PPP (Public-Private-Partnership), BOT (Build-Operate-Transfer) and other methods to attract social funds to the construction and operation of stadiums to meet the needs of large-scale university facilities. Universities can also absorb social funds through school-enterprise cooperation, such as transferring naming rights, absorbing corporate sponsorship, and charging fees for in-hall advertising and sports product promotion. Conclusions. By appropriately increasing the opening quantity and quality of paid indoor venues, strengthening external marketing, and focusing on market management, the economic income of the stadiums can be stabilized, thereby improving the economic benefits of opening the stadiums to the outside world. For outdoor venues, the traditional free opening should be changed to free. The combination of openness and paid services can increase the source of operating income by renting out venues and contracting large-scale group activities, and give full play to the economic utility and social value of stadiums."
]