[
    "Abstract: The study explores the impact of multi-sensory experiences on memorable night tourism experiences and the mediating effect of well-being. A sample of 393 university students participating in bike riding night tours was surveyed. The finding of Partial Least Squares Structural Equation modeling emphasized the tourist's delight mediating effect between a multi- sensory experience and a memorable night tourism experience. Additionally, this emerging pattern reflects broader shifts in contemporary youth tourism, where innovation in transportation, the appeal of night-time exploration, and strategic destination image marketing converge to create new forms of engagement with cultural and recreational sites. Therefore, the research provides theoretical and practical perspectives for night tourism researchers and practitioners. Night tourism is an essential part of the tourism industry. On 18 June 2024, four female university students rode more than 50 kilometers from Zhengzhou to Kaifeng to taste Kaifeng's unique dunking dumplings and other special local snacks, taking many short videos and photos along the way. The experience was considered a fun adventure in university life, demonstrating the energy and spirit of exploration of young adults and attracting more university students to ride together. As is known to all, Kaifeng, located in Henan province, is a cultural heritage city with seven ancient capitals of China. cultural contact positively mediate between the night tourism atmosphere and memorable tourism experiences [1]. Additionally, Fang, et al. [2] highlighted that multi-sensory experience positively impacts emotional involvement and feelings of delight. Emotional involvement and feelings of delight positively influence immersive memorable tourism experiences. Therefore, the authors propose that multi- sensory experience significantly impacts delight (H1) and memorable night tourism experience (H2), and delight positively impacts memorable night tourism experience (H3). Meanwhile, delight mediates the relationship between multi- sensory experience and memorable night tourism experience(H3). In the subsequent months, a fascinating new tourism trend has emerged among university students in Zhengzhou, centered around nighttime cycling excursions to Kaifeng. By November, this activity had evolved into a notable \"night rush,\" with bicycle convoys stretching for kilometers during the early morning hours. Leveraging shared bicycles, students embarked on these journeys in the evening, cycling for up to five hours to cover the 50-kilometer distance between the two cities. This phenomenon coincided with the introduction of a free admission policy for university students at key scenic spots in Kaifeng, which came into effect on November 3rd. Between November 1st and 4th, approximately 170,000 students participated in these late-night cycling trips, illustrating a growing intersection of student mobility, tourism, and urban promotion. The research aims to enrich night tourism research by investigating university students’ multi-sensory experiences (visual, auditory, olfactory, gustatory, and tactile) and their impact on memorable tourism experiences. Additionally, the research provides empirical evidence of the mediating effect of delight between these multi-sensory experiences and memorable tourism experiences. Besides, consistent with prior findings on memorable tourism experiences [3, 4], the current research explores how the effects of five dimensions of university students’ multi- sensory experience are mediated by delight in a memorable night tourism experience in Henan province, China. All items measured in the research were used in existing literature and slightly modified to fit thousands of university students bike riding phenomenon. The self-reported questionnaire consists of 25 items covering three constructs: multi-sensory experience, delight, and memorable night tourism experience. Particularly, the multi-sensory experience contained five dimensions (shown in Figure 1) and measured 17 items adapted from Buzova, et al. [5], a four- item scale of delight adapted from Ahrholdt, et al. [6], and the memorable night tourism experience was evaluated by four items modified from Jiang and Tu [7]. All measurement items with a 7-Liket scale were posted on the wjx. cn website through WeChat groups for respondents (only university students) with bike riding experience in Henan province. The data collection period lasted from November 10th to 25th; In the research, SPSS 27 and PLS-SEM4.0 were employed to analyze the data. The Kaiser-Meyer-Olkin (KMO) value was 0.924, and the results of Bartlett’s Sphericity Test were significant, which indicates that the sample data are appropriate for conducting EFA (exploratory factor analysis). Additionally, all item factor loadings are higher than 0.70. Furthermore, Cronbach’s alpha, rho _a, composite reliability (CR), and average variance extracted (AVE) values of all constructs are greater than 0.7, 0.7,0.7, and 0.5 respectively [8]. However, the AVE value of construct multi-sensory experience is 0.449, the Cronbach’s alpha, rho _a, and CR values are 0.923, 0.925, and 0.932 respectively, confirming Given that the calculation of path coefficients in PLS-SEM results from regression analyses, all VIF values are less than 5.0, thus indicating collinearity is not an issue in the structural model [8].In the study, bootstrapping was employed to assess the statistical significance of the path coefficients and calculate the t-values, and the T-values of the hypothesized paths are all higher than 2.57 (a=0.01, two-sided test) and p<0.001, the paths are statistically significant, Therefore, all hypothesize are supported.",
    "The results of the structure model assessment with the bootstrapping procedure are presented in Table 2. Five dimensions of multi-sensory experience were found to significantly impact on the construct. T values of the hypothesized path of AY and Mul, GY and Mul, OY and Mul, TE and Mul, VL and Mul are 30.318, 57.647, and 56.33,29.527 and 14.947 respectively. As for the direct path, the relationship between Mul and DT, Mul and MNET, and DT and MNET are also significant. Thus, H1, H2 and H3 are supported. Meanwhile, DT mediates the relationship between Mul and MNET. Therefore, H4 is also supported. To minimize common method variance, a full collinearity method is adopted to evaluate the possible bias. The variance inflation factor (VIF) values are between 1.191 and 3.604, which are lower than the threshold of 5.0 [8]. Therefore, the full collinearity assessment is not an issue in the current research. Then, the score of Harman’s single-factor test is 42.23%, indicating the main extracted factor accounts for only 42.23% of the total variance within the sample. Thus the result is less than 50%, which demonstrates Common Method Bias (CMB) does not affect the result [8]. Under both analyses, the common method variance is not an issue in the study. delight and contributes to night tourism literature by conducting university students’ five-sensory experiences on bike riding memorable night tourism experiences from Zhengzhou to Kaifeng and providing empirical evidence for young adults' tourism behavior. The results indicate that five sensory experiences (Auditory, Gustatory, Olfactory, Tactile, and Visual) and delight are the key factors affecting on memorable night tourism experience. Delight plays a mediating role between multi-sensory experiences and memorable night tourism experiences. Multi- sensory experiences from tourists’ sight, smell, taste, hearing, and touching to experience the unique scenery and food. During the process of tourism, it enhances their interest and delight and finally builds a memorable night tourism experience. Furthermore, the findings are consistent with a prior study by Fang, et al., delight mediates antecedent and outcome variables. It is an essential construct impacting a memorable night tourism experience. The interaction of tourists and the night tourism atmosphere further improves young adults’ positive emotions and consequently delight. To enhance a memorable and meaningful night tourism experience, this study provides a new insight into bike riding experiences in Kaifeng's historical and cultural city. The results reveal the energy and spirit of exploration of university students and attract more young adults from home and abroad to ride together and create a memorable night tourism experience. Unlike prior studies, which mainly focused on pleasure, arousal, delight, and dimensions of the night tourism atmosphere and their effect on memorable tourism experiences and immersive night tourism experiences. The research constructs a memorable night tourism framework to explore how multi-sensory experiences affect memorable night tourism experience through the mediating effect of Finally, to enhance the key destination image for heritage tourism, further research could explore other mediating and moderating variables, making it a significant case in the exploration of sustainable cultural tourism among young adults. Moreover, the case provides new transportation for a short journey exemplifying the challenges and opportunities Ethical Approval All procedures performed in studies involving human participants were in accordance with the ethical standards of the institutional and/or national research committee and with the 1964 Helsinki declaration and its later amendments or comparable ethical standards. Funding: This article has been produced as part of the project of the research and practice project of research Teaching Reform in undergraduate colleges in Henan Province, research and practice of teaching management system in local engineering colleges suitable for research teaching (Grant No.2022SYJXLX036)—Henan Provincial Office for Philosophy and Social Sciences."
]