[
    "This study investigates the relationship between academic procrastination, self-control, time management, and academic self-efficacy among vocational college students. Grounded in self-control theory, the study utilized convenience sampling to conduct an online survey of 994 students from vocational colleges in Henan Province, China. Descriptive analysis, correlation analysis, and hierarchical regression analysis were performed on the data using SPSS. The data revealed that self-control has a negative and significant impact on academic procrastination; time management plays a partial mediating role between self-control and academic procrastination; academic self-efficacy can play a partial mediating role between self-control and academic procrastination; time management and academic self-efficacy play a chain mediating role between self-control and academic procrastination. Vocational colleges need to educate students with solid knowledge, skills, and abilities, while also guiding them to form scientific vocational values, noble professional ethics, and sound personalities. From the perspective of developmental stages, China's higher vocational education has experienced exploratory expansion, expansive scale development, and connotative development based on demand. It has played a crucial role in optimizing China's education and talent structure, supplying technical and skilled talents, and improving the entire higher education structure (Liu & Yang, 2016). However, as higher education transitions from massification to universalization, scale expansion is no longer the primary concern of Chinese higher education; instead, structural issues have become prominent (Zhou & Chen, 2019). Students in higher vocational schools often exhibit various deficiencies in their learning, such as lacking clear learning objectives, insufficient motivation, and severe aversion to studying (Hebebci et al., 2020). Sarid et al. (2021) indicate that the current situation of academic procrastination among university students is much more severe than before, characterized by non-submission of assignments, lack of exam importance, and failure to complete learning tasks assigned by schools or teachers. Self-control, time management, and self-efficacy jointly influence academic procrastination. Effective time management can reduce procrastination tendencies, while the development of self-control abilities can assist individuals in implementing effective time management strategies (Wang & Sun, 2023). Additionally, higher self-efficacy can provide intrinsic motivation and confidence, thereby reducing academic procrastination. These factors interact to help individuals better manage their time, overcome procrastination, and achieve academic success, forming a complex network of interactions among self-control, time management, self-efficacy, and academic procrastination (Zhu, 2023). Wei (2018) mentions that effective time management and self-control abilities can enhance individuals' self-efficacy, thereby reducing academic procrastination. Furthermore, higher self-efficacy and self-control abilities can assist individuals in better planning and managing their time, avoiding procrastination behaviors. These factors collectively influence individuals' academic performance and achievements significantly. Higher self-control abilities enable individuals to effectively manage time and task planning, enhancing their self-efficacy. This heightened self-efficacy, in turn, encourages individuals to exert better self-control abilities, reducing the occurrence of academic procrastination (Endiape & Hermosa, 2023). Against the backdrop of increasing attention to higher vocational education and the continuous rise in the number of vocational college students, the issue of academic procrastination among students in higher vocational schools is gaining widespread societal attention. It is imperative to conduct research on the characteristics of academic procrastination among vocational college students and its related factors. This study adopts a perspective grounded in the self-control theory of vocational college students and employs a questionnaire survey methodology to investigate the relationship between self-control and academic procrastination, time management, and self-efficacy, as well as the underlying influencing factors. The aim is to promote research on the academic direction of vocational college students. Muraven et al. (2006) defined self-control as the ability of individuals to inhibit automatic, habitual, and instinctual behaviors, impulses, and desires to avoid their interference with goal-directed actions. Lakein (1973) introduced the concept of time management, defining it as the organization of events by individuals. Specifically, it involves: firstly, setting goals; secondly, prioritizing these goals based on their importance; and then, starting with the most important tasks according to the individual's available time. Macan (1990) proposed that time management is a highly individualized behavior. It entails individuals identifying their needs and subsequently allocating time based on the importance of these needs. Bandura (1982) proposed that academic self-efficacy refers to individuals' judgments of their own abilities in the academic domain when completing a specific task. It is a manifestation of self-efficacy within the realm of learning. Academic self-efficacy is measured from various perspectives, with dimensions delineated to capture students' perceptions of their academic abilities. Pintrich and Degroot (1990) examined students' learning self-efficacy from both ability and action perspectives. Academic self-efficacy directly influences the internal mechanisms of students' learning behaviors.",
    "Senécal et al. (1995) defined academic procrastination as the deliberate delay or postponement of learning tasks that learners know they should and intend to complete within a specified period. Schraw et al. (2007) characterized academic procrastination as the intentional postponement or delay of learning tasks that must be completed. Researchers generally agree that one of the significant factors contributing to academic procrastination is a failure in self-control (Uzun et al., 2020). Individuals' levels of self-control can negatively predict the frequency of their procrastination behaviors (Przpiorka et al., 2019). Academic procrastination is a trait procrastination in academic contexts, and research by Ariely and Wertenbroch (2002) confirmed that individuals with higher levels of self-control exhibit lower frequencies of procrastination behaviors in academic domains. Chen et al. (2019) found that with increasing age, both academic self-efficacy and self-control abilities tend to improve. Moreover, higher levels of competition are associated with higher levels of academic self-efficacy and self-control. Academic self-efficacy is negatively correlated with aggressive behavior and positively correlated with self-control. Baumeister (2002) discovered that self-control relies on individual self-regulatory resources, while academic self-efficacy complements self-control as a positive emotion. Individuals with higher levels of time management ability tend to exhibit lower levels of academic procrastination. Conversely, individuals with more pronounced procrastination tendencies may demonstrate more indecision and uncertainty when dealing with tasks that could potentially result in failure, leading to longer time consumption (Lay, 1986). Calonia et al. (2023) found a significant negative correlation between time management and academic procrastination, indicating how tendencies in time management effectively control procrastination. academic self-efficacy to a certain extent. Bargmann and Kauffeld (2023) discovered a significant interaction between time management tendencies and academic self-efficacy. Korzynski and Protsiuk (2024) indicated through their study that general self-efficacy can positively predict time management tendencies. Academic self-efficacy influences student learning outcomes by affecting their motivation, diligence, and the duration of learning behaviors (Bandura, 1977). Compared to students with lower self-efficacy, those with higher academic self-efficacy demonstrate greater learning conscientiousness, can persist in learning for longer periods, and achieve better learning outcomes. Therefore, students with higher academic self-efficacy tend to procrastinate less. Parmaksız (2023) found a negative correlation between academic self-efficacy and academic procrastination in their study of university students. Self-control plays a crucial role in procrastination (Wijaya & Tori, 2018). Previous research attributed procrastination to depleted self-control resources (Adachi & Adachi, 2024). Sirois and Pychyl (2013) found that individuals with higher self-control are better able to resist short-term temptations, thus reducing the likelihood of procrastination. Self-control directly predicts academic procrastination. Simultaneously, an improvement in student self-control implies a reduction in academic procrastination (Wang & Sun, 2023). Additionally, Asani (2023) noted that individuals with higher self-control also exhibit stronger time management control, implying a direct influence of self-control enhancement on academic procrastination. However, this process involves resisting external temptations, i.e., self-control, in managing time. H4: Both time management and academic self-efficacy can mediate the relationship between self-control and academic procrastination among vocational college students in Henan Province, China. Selecting students from two vocational colleges in Henan Province, China as the research subjects, 1000 copies of the formal questionnaire were distributed, resulting in 994 valid responses, yielding an effective response rate of 99.4%. Self-Control Scale: The College Student Self-Control Scale, developed by Tangney in 2004, was revised for the Chinese version by Tan and Guo (2008). Following the revision, the scale comprises 19 items, each rated on a five-point scale. It encompasses five dimensions: impulse control, healthy habits, resisting temptation, focus on work, and moderation in leisure. The internal consistency reliability of this scale is 0.862, explaining a total of 53.7% of the variance. Time Management Scale: The Adolescent Time Management Tendency Scale (ATMD), developed by Huang Xiting and Zhang Zhijie, is utilized in this study. This scale consists of three dimensions: time value perception, time monitoring belief, and time efficacy perception, totaling 44 items. Scores on the scale range from one to five, with higher scores indicating greater time management ability. The scale demonstrates good reliability and validity. In this study, the Cronbach's α coefficient for the overall scale is 0.958. Academic Self-Efficacy Scale: The scale used in this study was developed by Liang Yusong (2000) based on dimensions from Pintrich and DeGroot's (1990) Academic Self-Efficacy Scale. It distinguishes academic self-efficacy into two dimensions: self-efficacy in learning abilities and self-efficacy in learning behaviors. The scale employs a five-point scoring system. These two dimensions explain 85.6% of the total variance, with coefficients of 0.820 and 0.752, respectively.",
    "Academic Procrastination Scale: The Academic Procrastination Scale adopted in this study follows Aitken's (1982) Likert five-point scoring method, comprising 19 items categorized into three dimensions: delay in action, poor completion, and insufficient planning. Regarding reliability, correlations between each dimension and the total score range from 0.731 to 0.876, with a test-retest reliability of 0.8747, indicating good reliability and validity of the scale. Harman's single-factor analysis was employed to examine whether the research results were affected by common method bias. The study extracted 10 factors with eigenvalues greater than 1, cumulatively explaining 66.804% of the variance. Among these, the first factor explained 31.546% of the variance, which is less than the threshold of 50%. This indicates that the issue of common method bias in this study is not significant, and the collected samples exhibit good population representativeness. In the data analysis of this study, the result (F=91.451, p<.001) reached significance, indicating statistical significance. Other values in the table were also statistically meaningful. Resisting temptation had a significant negative impact on academic procrastination (β=-0.362, p<0.001), suggesting that vocational college students who resist temptation tend to exhibit reduced academic procrastination behavior. level, and a standardized regression coefficient of 0.538. This indicates a significant negative impact of self-control on academic procrastination, with an Adj R² of 0.290, suggesting that self-control can explain 29% of academic procrastination. In Model 2, the result (F(p<.001)) reached a significant level, with t=24.434 (p<.001) and a standardized regression coefficient of 0.613. This indicates a significant positive impact of self-control on time management, with an Adj R² of 0.375, suggesting that self-control can explain 37.5% of time management. In Model 3, the result (F(p<.001)) reached a significant level. The standardized regression coefficient of time management on academic procrastination was -0.390, with t=-12.360 (p<.001) reaching significance. Additionally, the standardized regression coefficient of self-control on academic procrastination was -0.299, with t=9.475 (p<.001) still reaching significance. This indicates that both time management and self-control have a significant impact on academic procrastination. The adjusted R² was 0.384, showing an increase of 0.094. However, with the inclusion of time management, the standardized regression coefficient of self-control on academic procrastination decreased from -0.538 to -0.299. This suggests that time management partially mediates the relationship between self-control and academic procrastination. As shown in Table 3, in Model 1, the result (F(p<.001)) reached a significant level, with t=-20.114 (p<.001) also reaching a significant level, and a standardized regression coefficient of -0.538. This indicates a significant negative impact of self-control on academic procrastination, with an Adj R² of 0.290, suggesting that self-control can explain 29% of academic procrastination. In Model 2, the result (F(p<.001)) reached a significant level, with t=18.828 (p<.001) and a standardized regression coefficient of 0.513. This indicates a significant positive impact of self-control on academic self-efficacy, with an Adj R² of 0.263, suggesting that self-control can explain 26.3% of academic self-efficacy. In Model 3, the result (F(p<.001)) reached a significant level. The standardized regression coefficient of academic self-efficacy on academic procrastination was -0.288, with t=-9.649 (p<.001) reaching significance. Additionally, the standardized regression coefficient of self-control on academic procrastination was -0.390, with t=-13.087 (p<.001) still reaching significance. This indicates that both academic self-efficacy and self-control have a significant impact on academic procrastination. The adjusted R² was 0.350, showing an increase of 0.060. However, with the inclusion of academic self-efficacy, the standardized regression coefficient of self-control on academic procrastination decreased from -0.538 to -0.390. This suggests that academic self-efficacy partially mediates the relationship between self-control and academic procrastination. Using Process Model 6 to test the mediating effects, the results show that self-control significantly positively affects time management (β=0.705, t=24.628, p<0.001), self-control significantly positively affects academic self-efficacy (β=0.372, t=9.853, p<0.001), and time management significantly positively affects academic self-efficacy (β=0.364, t=11.874, p<0.001). Self-control significantly negatively affects academic procrastination (β=-0.264, t=-7.801, p<0.001), time management significantly negatively affects academic procrastination (β=-0.293, t=-9.962, p<0.001), and academic self-efficacy significantly negatively affects academic procrastination (β=-0.174, t=-5.956, p<0.001). Thus, it can be concluded that time management and academic self-efficacy mediate the relationship between self-control and academic procrastination among vocational college students in Henan Province. As shown in Table 4. As shown in Table 5, the Bootstrap analysis results indicate that the total effect value is 0.499 (p<0.001), with a 95% confidence interval that does not include 0 [Bootstrap 95% CI: 0.444, 0.549]. The direct effect value is 0.399 (p<0.01), with a 95% confidence interval that does not include 0 [Bootstrap 95% CI: 0.339, 0.456]. The total indirect effect value is 0.100 (p<0.001), with a 95% confidence interval that does not include 0 [Bootstrap 95% CI: 0.078, 0.126], confirming the partial mediating role of time management and academic self-efficacy in the relationship between self-control and academic procrastination.",
    "The significant negative impact of self-control on academic procrastination is consistent with the findings of Steel (2016) and Üztemur and Dinç (2021). Additionally, research by Sun and Wang (2022) indicates a positive correlation between robust self-control and better academic performance, improved time management, and reduced tendencies towards procrastination. Individuals with strong self-control are better equipped to manage their behavior effectively, making it easier for them to formulate and implement study plans and to overcome tendencies towards procrastination. Conversely, individuals with low self-control are more prone to procrastination, which adversely affects their academic performance and emotional well-being. This study posits that self-control represents an individual's intrinsic capacity for social engagement, encompassing the ability to make long-term decisions advantageous for the future, facilitated by sound judgment of social situations and effective regulation of one's emotions. In an academic context, this may involve establishing study schedules, resisting temptations such as social media or entertainment to maintain focus on learning, among other strategies. Individuals lacking in self-control may be more susceptible to yielding to momentary desires or temptations, resulting in procrastination in their academic pursuits. Conversely, individuals with strong self-control are more likely to persevere in the face of challenges, rather than succumb to temporary setbacks or procrastination (Li et al., 2022). Strengthening self-control contributes to the development of positive academic habits and behavioral patterns, thereby reducing the likelihood of academic procrastination. Cultivating self-control enables better management of academic stress and enhances academic performance. Self-control has a significant positive impact on academic self-efficacy, consistent with the findings of Khudabadi (2023), Diseth (2021), and Liu et al. (2020). It was found that there exists a significant positive relationship between self-control and academic self-efficacy. Based on these results, self-control involves setting clear goals and taking action to achieve them. By accomplishing academic goals, individuals can accumulate successful experiences, thereby increasing confidence in their academic abilities and enhancing academic self-efficacy. Individuals with strong self-control are better able to overcome difficulties and challenges in their academic pursuits. By overcoming challenges, individuals can perceive their capabilities and resilience, thereby enhancing academic self-efficacy. Ginns et al. (2021) mentioned that self-control includes monitoring and providing feedback on one's behavior. Through continuous monitoring of academic performance and positive feedback, individuals can cultivate confidence in their academic abilities and enhance academic self-efficacy. Time management has a significant negative impact on academic procrastination, consistent with the findings of Caramat et al. (2024), Aeon et al. (2021), and Codina et al. It was found that there exists a negative relationship between time management and procrastination. Effective time management typically begins with setting clear academic goals and developing detailed plans. When students know their objectives and have a clear action plan, they are more likely to avoid procrastination. Time management involves exerting effective control over one's behavior. By setting goals, making plans, and adhering to them, individuals can cultivate stronger self-control and reduce the tendency to procrastinate in their academic endeavors. Time management includes breaking down large tasks into smaller parts to make them more manageable and achievable. By breaking tasks down, individuals can gain a clearer understanding of the steps involved in learning, alleviate the pressure of tasks, and reduce the likelihood of procrastination. Effective time management helps to avoid rushing to complete work before deadlines, thereby reducing the likelihood of procrastination. Planning academic activities in advance, allocating time reasonably, and avoiding last-minute studying and task completion are essential. Effective time management helps establish good study habits. Scheduling study time regularly and developing a habit of working according to the plan help reduce the occurrence of procrastination. Time management has a significant positive impact on academic self-efficacy, consistent with the findings of Cassidy (2015) and Aldhahi et al. (2022). Enhancing students' academic self-efficacy contributes to strengthening their resilience. Time management is considered a mechanism for cultivating academic self-efficacy because it helps students better organize learning tasks and cope with academic pressure. There exists a significant positive relationship between time management and the overall domain of academic self-efficacy. When individuals are able to complete tasks within a reasonable time frame, they are more likely to have positive evaluations of their abilities, enhancing their academic self-efficacy. By setting clear academic goals and achieving them through effective time management strategies, individuals can frequently experience a sense of achievement, thereby increasing confidence in their academic abilities and enhancing academic self-efficacy. Effective time management allows individuals to accumulate successful experiences, which is an important pathway to improving academic self-efficacy. Each time a task is completed according to plan, it provides individuals with an opportunity for success, thereby enhancing confidence in their abilities. Good time management requires continuous self-monitoring and feedback. By regularly reviewing their progress, individuals can better understand their abilities and performance, influencing the formation of academic self-efficacy. Appropriately managed time can create a sense of urgency within the deadlines, prompting individuals to be more focused and exert greater effort. This sense of urgency contributes to enhancing academic self-efficacy as individuals can complete tasks within limited time.",
    "Academic self-efficacy has a significant negative impact on academic procrastination, consistent with the findings of Caramat et al. (2024), Steel (2016), and van Eerde and Klingsieck (2018). It is observed that college students with high academic self-efficacy tend to adopt proactive approaches towards tasks and employ more effective learning strategies. They are better able to analyze task requirements, use appropriate learning strategies, and avoid falling into the procrastination cycle. Students with high academic self-efficacy are more likely to set clear academic goals and are motivated to achieve them. They believe in their ability to complete tasks, and this confidence and motivation help reduce the occurrence of procrastination. Students with high academic self-efficacy are more likely to maintain a positive emotional state. They believe in their ability to overcome academic challenges, which helps alleviate the emotional burden of procrastination and increases confidence in academic tasks. Students with strong academic self-efficacy are more likely to engage in self-monitoring, adjust academic plans in a timely manner, and effectively manage time, thereby avoiding the pressure of task completion caused by procrastination. 5.3 The Mediating Role of Time Management and Academic Self-Efficacy in the Relationship between Self-control and Academic Procrastination among Vocational College Students This study found that time management serves as a mediator in the relationship between self-control and academic procrastination. While there is limited research discussing time management, self-control, and academic procrastination together, past studies have explored the relationships between pairs of these variables. For instance, Sirois and Pychyl (2013) discovered that individuals with higher levels of self-control are better able to resist short-term temptations, thus reducing the likelihood of procrastination. Additionally, self-control has a direct predictive effect on academic procrastination (Wang & Sun, 2023). Moreover, the improvement in students' self-control implies a reduction in academic procrastination (Asani, 2023). This study comprehensively discusses the relationships among the four variables and finds that time management can mediate between self-control and academic procrastination. Effective time management and self-control contribute to the cultivation of academic self-efficacy, thereby reducing the likelihood of academic procrastination (Salguero and Reyes, 2023). Individuals influence their academic procrastination behavior by completing tasks according to a schedule, thereby fostering confidence in their academic abilities. Time management is closely related to self-control because effective time management requires individuals to possess self-control. Individuals who excel in managing their time are typically adept at self-control, enabling them to develop and execute study plans effectively, and adhere to task schedules. Good time management is often associated with lower levels of academic procrastination, as individuals can avoid last-minute work before deadlines by setting reasonable time plans, establishing clear goals and priorities, thus reducing the likelihood of procrastination. Individuals with higher levels of self-control are more likely to avoid academic procrastination. Those with strong self-control can resist immediate gratification and are better equipped to overcome the urge to This study only selected vocational college students from two universities in Henan Province, China, as research subjects. However, some researchers have found that students from different economic regions may exhibit different conditions in various variables. In future research on academic procrastination among vocational college students, it would be beneficial to include universities from more provinces in China. On one hand, this would enable comparisons between vocational college student populations in different provinces, and on the other hand, it could analyze the similarities and differences in academic procrastination among university students from different provinces. This would facilitate the development of more effective psychological health management strategies. It is important to note that this study may have captured the relationships between variables at a specific point in time and may not measure dynamic changes in data over time. Therefore, despite the findings presented in this study, further research is needed to address these limitations. Zepei WU: Concept and design, statistical analysis, data analysis / interpretation, data acquisition, drafting manuscript. Dr. Man JIANG: Admin, technical or material support, supervision, critical revision of manuscript, final approval. The data that support the findings of this study are available on request from the corresponding author. The data are not publicly available due to privacy or ethical restrictions."
]