[
    "Abstract: This study delves into the language preferences, attitudes, and choices of Henan province industrial migrants in Shizuishan City, China. Shizuishan City embraces Mandarin as the dominant language but also accommodates other languages, including the Henan dialect spoken by migrant workers. The workers show a strong attachment to their native Henan dialect, using it with pride when discussing their hometown or communicating with fellow Henan natives. They skillfully code-switch between Mandarin and their dialect based on context and listeners. This code-switching reflects their dual identification with both Henan and Ningxia, where Shizuishan City is located. The study highlights the role of language in shaping personal identities, social relationships, and cultural affiliations. In conclusion, this research sheds light on the complex relationship between language, adaptation, and identity negotiation among industrial migrants. The findings contribute to understanding these dynamics and inform policies to foster linguistic diversity and social integration among migrant populations. Language attitudes and choices among immigrants have long captivated research attention, recognizing language's pivotal role in shaping individual identities, social interactions, and community integration. Fishman delved into \"language loyalty\" among immigrants in the US, exploring how ethnic and religious groups preserved their non-English mother tongues amidst assimilation pressures. Language became a symbol of ethnic identity and solidarity, preserving cultural heritage within immigrant communities [1]. Giles and Johnson introduced \"ethnolinguistic vitality,\" studying how language perception influenced intergroup communication and social cohesion among immigrants and host communities [2]. Gudykunst and Kim examined intercultural communication in diverse settings, emphasizing effective communication between different cultural groups and its impact on intergroup relations [3]. This study investigates the language choices and attitudes of Henan migrant workers in Shizuishan City, China. Shizuishan City boasts a unique linguistic landscape, with Mandarin as the dominant language, alongside the local Ningxia dialect and languages spoken by migrant workers, such as Henanese. Understanding language dynamics in this context sheds light on the experiences and identity negotiation of industrial immigrants. By examining language attitudes and choices, this study aims to uncover the factors influencing their language usage, adaptation, and integration into the local community. This study draws upon sociolinguistic theories, including language attitude, language choice, and code-switching, to create a comprehensive theoretical foundation for understanding language use among Henanese industrial migrants in Shizuishan City. Lambert and Gardener revealed that language attitudes, encompassing value-based responses, involving emotions, cognition, and behavior to different languages and language users, are influenced by social, cultural, and historical factors, impacting language learning outcomes [4]. According to Gumperz, language choice is often context-driven, leading to shifts in language selection. Code-switching, a crucial aspect of language choice, represents a speaker's transition between languages, dialects, or registers, occurring in various scenarios, including different contexts, conversations, and even within a single sentence [5]. Sociolinguistic research mainly explores the social motivations behind code-switching. Scholars worldwide have shown significant interest in the language choices and attitudes of migrant workers. This literature review focuses on Chinese migrants, particularly Henan province workers in Shizuishan City. Relevant research includes studies on multilingualism in China and Shizuishan City, acculturation and language learning, as well as identity negotiation through language use and attitudes. China's linguistic diversity encompasses over 80 ethnic groups and 100 languages [6]. While Mandarin serves as the government-promoted official language for national unity and communication, other languages also thrive in the country. Shizuishan City predominantly uses Mandarin, alongside local Ningxia dialect and languages of migrant workers, such as Henan. The influx of over 200,000 industrial migrants to Shizuishan City over the past 60 years has resulted in a unique linguistic landscape. The city's language policy emphasizes Mandarin while recognizing the importance of preserving linguistic diversity through other languages and dialects. Acculturation, defined by Gibson as the process of culture change and adaptation during intercultural interactions, significantly impacts language learning [7]. Language acquisition is crucial for the social and economic integration of migrant workers, with similar language orientations observed among immigrant groups in diverse cultural contexts [8]. Language choices and attitudes are closely linked to the negotiation of identity for immigrant workers. Numerous studies explore these aspects in various contexts and populations, highlighting the influence of social status, career development, social networks, language policies, and cultural exposure [9-11]. Language attitudes and proficiency levels also impact language choice, maintenance, and intergenerational communication.",
    "In conclusion, the literature underscores the intricate nature of language choices and attitudes among industrial migrant workers, shaped by various factors. While some research has investigated migrant workers in Shizuishan City, specific studies focusing on language attitudes and choices in this context are limited, revealing a research gap that necessitates further exploration [12]. In-depth This study utilized qualitative research through in-depth one-on-one interviews to collect data. The interviews were conducted in June 2023, following referrals from key informants and establishing connections with potential interviewees. The semi-structured format allowed for flexibility and in- depth exploration. Five participants aged between 65 and 75, who were early migrants during the establishment of the Ningxia Hui Autonomous Region and had resided there for over 50 years, were selected for analysis. The participants had diverse educational backgrounds and engaged in various occupations, ensuring representation. Gender distribution among interviewees was relatively balanced. Interviews were conducted through voice calls, each session lasting between 20 to 40 minutes. Thematic analysis was applied to examine data from the semi-structured interviews. An iterative process generated initial codes, resulting in the identification and refinement of four key themes: Language Proficiency and Acquisition, Language Attitudes, Language Choices, and Self- identification. These themes provide valuable insights into interviewees' perspectives and experiences, discussed in detail in the following section. During the interviews, the author assessed the interviewees' Mandarin proficiency in pronunciation, vocabulary, grammar, intonation, and fluency. Overall, the interviewees demonstrated a relatively standard level of Mandarin proficiency. Although some displayed minor inaccuracies in tones and occasional mispronunciations, along with influences from regional dialects in the use of certain words and syntax, these deviations were not significant. This assessment aligned with the interviewees' self- evaluations. Various factors contributed to their Mandarin proficiency, including school education, social environment, influence of individuals around them, and exposure to media. The dominant influence was the social environment in Shizuishan City, where Mandarin was prevalent due to its migrant population. Additionally, their work environments required Mandarin usage, providing ample learning and practice opportunities. School education also played a significant role, as the government's promotion of Mandarin as a national language policy influenced their proficiency from an early age. The interviewees' workplaces offered supplementary Mandarin and cultural classes, further enhancing their language acquisition and proficiency. \"I used to take cultural supplementary classes for about six months when I just started working. I would go to the classes for two or three times a week. And Since I was young, Mandarin has been taught to us.\" (Interviewee 2) In addition, one interviewee indicated that he had already acquired a relatively fluent Mandarin by listening to the radio before he arrived in Shizuishan. \"When I was in Henan, I enjoyed learning Mandarin. I had a small radio and I would often learn Mandarin by following along with it. I didn't have a specific teacher to learn from, but as soon as I get on the train (going to Ningxia), I start speaking Mandarin.\" (Interviewee 3) Regarding their native dialect, interviewees expressed a strong attachment and pride. Even though some interviewees had not returned to Henan for an extended period, they still demonstrated proficiency in the dialect when communicating with family and friends. However, one interviewee noted that their Henan dialect had deteriorated over time due to lack of practice, and when visiting their hometown, they sometimes lose efficiency and had to revert to using Mandarin. In term of the local dialect in Ningxia, the interviewees mentioned that they could generally understand it but were unable to use it for communication purposes. None of them had actively learned the Ningxia dialect, and they could only recall a few representative words. Regarding Mandarin, the interviewees expressed a strong identification with Mandarin and acknowledged its social value. They believe that Mandarin is \"useful\" and promotes equality. They are willing to learn and use Mandarin in daily communication, and also hope their children will master fluent Mandarin. This aligns with the notable language variation and language shift observed, which corresponds to the author's subsequent investigation into intergenerational differences in family language strategies and language usage. Meanwhile, the interviewees perceive Henan dialect as pleasant and concise, and they have a strong sense of pride and belonging towards it. When asked about their attitude towards Henan dialect and its use, all interviewees exhibited a strong sense of belonging. Additionally, the interviewees demonstrated their proficiency in Henan dialect to showcase their emotional connection and mastery of their native dialect: \"I can never forget my native dialect. 'Have you had your soup?' (referring to having a meal) 'Hurry up and cook the soup!' (referring to cooking a meal)\"! (Interviewee 1) \"'shui (Who is there)? Now (me)! zhua (What are you doing)? niao (Going to the toilet)!'\" It's a simple and concise summary. (Interviewee 4) \"We all generally like to speak in the Henan dialect, saying things like ' nen nong sha lei (What are you doing)' or ' Zhong bu Zhong (Is it okay).\" (Interviewee 5) Furthermore, the interviewees share similar attitudes towards using Mandarin and dialect when communicating with fellow locals. The interviewees believe that using Mandarin in daily communication is a normal phenomenon and can be accepted in the context of language policy. However, if they were to use Mandarin in a dialect-speaking environment, such as within a family where everyone uses dialect, it may cause confusion and distance but not necessarily aversion. Interviewee 5 commented as follows: \"If you, as an outsider, speak the dialect of hometown, they may not understand you, so you can only answer them in Mandarin. But if you are in your hometown, isn't it all about speaking the Henan dialect? If you don't speak the Henan dialect, it feels like you're not close to them.\" Furthermore, Interviewee 3 conveyed that their hometown family members no longer proficiently use the Henan dialect, and they harbor no particular sentiment about it. They perceive their adaptation to the Mandarin-speaking milieu in Shizuishan City due to their prolonged absence.",
    "These findings contrast with language attitude trends noted elsewhere, where interviewees displayed aversion to Mandarin. The variation could stem from Shizuishan City's high linguistic Concerning the Ningxia dialect, interviewees' assessments diverge. Interviewees 1, 2, and 4 evinced a neutral stance, showing no inclination to learn it. Conversely, Interviewees 3 and 5 found the Ningxia dialect disagreeable and expressed no intent to acquire it. Interviewee 5 commented: Transcript 5: \"Out-of-province people have a nickname for Ningxia people, saying that they speak with a rural accent. 'laowazi' (rural folks) speak 'laowazi dialect'.\" The study's findings reveal the interviewees' dual usage of Henan dialect and Mandarin, varying based on context, formality, and situation. Shared language choices and code-switching practices are evident, reflecting their adaptability within Shizuishan's linguistically diverse environment. \"(At work) of course, it's all Mandarin since colleagues come from different places. At home, it depends on who you're talking to. When you married to someone who are not from Henan, you have to speak Mandarin because you can’t understand each other’s dialect. But if you're married to someone from Henan, then naturally you speak Henan dialect at home.\" (Interviewee 2) In the workplace and public settings, interviewees mostly use Mandarin for effectiveness and to highlight professionalism. Interviewee 1, who works as a telephone operator, said, \"We used to have a central switchboard at the mine. Back then, people didn't have mobile phones, so they had to go through the switchboard. Telephone operators must know Mandarin since you have to answer long-distance calls from all over the country.\" Regarding family dynamics, language planning diverges according to individual backgrounds. For instance, Interviewee 5, married to a Liaoning native and with Mandarin-learning children, prioritizes Mandarin at home. In contrast, those married to Henan partners opt for Henan dialect with spouses for better understanding, reserving Mandarin for children unfamiliar with the dialect. In discussions about their hometown, interviewees predominantly use Mandarin when interacting with non-Henan speakers. However, deeper analysis reveals a subconscious inclination toward Henan dialect during such conversations, aligning with identity formation as they weave both languages to shape their sense of self. In Shizuishan, interviewees comfortably employ Henan dialect, especially among fellow Henan natives, fostering familiarity and facilitating communication. They even engage in lighthearted code- switching for humor during casual chats, enhancing family enjoyment: \"Sometimes when my family tells a joke, I suddenly burst out with a sentence in Henan dialect, and they laugh uncontrollably.\" In contrast, challenges arise when using Ningxia dialect. For example, Interviewee 1 encountered difficulties with a Ningxia-dialect-speaking vendor, resorting to gestures. Interviewee 3, in an administrative role, emphasizes Mandarin proficiency for effective work communication: \"When we hire workers from the Xihaigu area, we emphasize teaching them Mandarin during training. Once, I went to Rujigou Mine, 70% of the people there are locals. I was giving a lecture, and one of them asked me a question in Ningxia dialect but I couldn't understand. So I told them to ask me in Mandarin if they had any questions.\" This study delves into the language use, attitudes, and choices of Henanese industrial migrants in Shizuishan City. The interviewees display a strong command of Mandarin, with slight regional influences. They recognize Mandarin's utility and its role in promoting equality. Although they take pride in their native Henan dialect, they predominantly use Mandarin in professional and public contexts, demonstrating language flexibility and code-switching proficiency. The findings offer significant insights into the dynamics of language use and adaptation among industrial immigrants, contributing to a deeper comprehension of the implications of language choices and attitudes in the lives of migrant workers. These findings can inform future research and policy considerations aimed at promoting linguistic diversity and facilitating social integration."
]