[
    "1Institute of Scientific and Technical Information of China, Engineering Center, China 2Xi’an University of Finance and Economics, Institute of Statistics, China 3JIANGNAN RURAL COMMERCIAL BANK, China Abstract. By investigating the current situation of information disclosure and public demand during rainstorm disaster in Henan Province, this paper builds a model of factors affecting the quality of information disclosure characterized by rainstorm disaster information based on TOE framework theory, metadata evaluation model, resource based theory and resource confirmation theory. With the help of the current situation and demand characteristics of the public's actual information acquisition, it designs a model with information disclosure content quality, information disclosure accessibility, information disclosure process completeness 10 test dimensions of government information disclosure ability, government feedback ability, minimum information disclosure acceptance ability, information disclosure technology support ability, right to know protection ability, privacy protection ability, right to equality protection ability, and 35 test items of rainstorm disaster information disclosure quality impact factor evaluation scale. The research provides help for government information disclosure to more accurately identify public needs, provides targeted evaluation models and operable evaluation models for rainstorm disaster information quality evaluation in Henan, and provides ideas and strategies for improving rainstorm disaster information quality. The intensity and scope of rainstorm rainstorm broke the historical record, far exceeding the flood control and drainage capacity of urban and rural areas. Large areas of urban and rural areas were flooded, urban street depressions were seriously waterlogged, rivers and reservoirs were flooded for a short time, and a large number of streams and gullies in hilly areas were choked up, forming a particularly serious natural disaster [1]. In the process of government information disclosure, due to the acceleration of information circulation rate and the increase of various information transmission channels, the channels, ways and scope of government information disclosure have increased. Only relying on the existing information disclosure mechanism can not adapt to the background of sudden rainstorm disasters, the characteristics of rainstorm information, and can not effectively guarantee the quality of rainstorm information disclosure. It is necessary to establish an influencing factor model that simultaneously considers the public demand and the quality of rainstorm disaster information disclosure, so as to realize the benign interaction between the government and the public, and truly achieve high- quality government information disclosure work, so as to provide the public with better government information services and ensure the safety of public life and property. The Technology Organization Environment (TOE) framework believes that technological innovation is influenced by three factors: technological factors, organizational factors, and environmental factors, as shown in Fig 1. Among them, technological factors include the characteristics of the technology itself, the relationship between the technology and the organization, the use of technology, technology compatibility, technology usage costs, and technological comparative advantages. Organizational factors mainly include the organization's own situation, organizational resources, organizational characteristics, organizational structure, organizational culture, and organizational communication mechanism. Environmental factors include the surrounding environment of the organization, laws and regulations, © The Authors, published by EDP Sciences. This is an open access article distributed under the terms of the Creative Commons Attribution License 4.0 (https://creativecommons.org/licenses/by/4.0/). market structure, industry environment, customer environment, competitive relationships, etc. Due to the fact that the TOE framework systematically examines internal and external factors and technical factors within the organization, and serves as a universal classification framework, it has strong systematicity and operability [2-3]. The quality of metadata refers to the information quality of resources input by personnel and stored in metadata records, which can be used for independent analysis. The quality of metadata can be demonstrated through the expression of data resource accuracy, consistency, integrity, accessibility, ease of use, information source, and security [4-5]. Resource Based View (RBV) regards resources as the starting point and center of a company's development strategy, believing that different types of enterprises control different types of resources. RBV regards internal resources, capabilities, and knowledge as key requirements for enterprises to gain competitive advantage. Enterprises with high value, scarcity, hard to replace resources, capabilities and knowledge capabilities will gain sustainable competitive advantage in market competition [6]. Expectation Confirmation Theory (ECT) occurs in the consumption process of consumers. Before the consumption process, consumers will have expectations for the product, and during the consumption process, they will judge whether the product is useful through perception. Then, by comparing the magnitude of perception and expectation, satisfaction is formed. Confirmation of high expectations promotes high satisfaction, thereby affecting consumers' subsequent consumption behavior[7].",
    "The implementation of the public information demand survey mainly adopts the anonymous questionnaire on the demand and use of rainstorm disaster information to the public. The questionnaire is set up according to the contents and channels of open data in Henan Data Regulation (Draft) [8], the types of disasters and the brief list of disaster events in the National Disaster Reduction Network and the global Natural Disaster Database. The use and demand of public open information is investigated with a wide range of multiple choice questions. A total of 550 questionnaires were issued. The object of questionnaire distribution is limited to the public in the main disaster- hit cities in Henan Province. Finally, 539 questionnaires were collected, with a recovery rate of 98%. After excluding those from residents outside Henan Province, 505 effective questionnaires were collected, with an effective recovery rate of 91.92%. By investigating the status quo of public open information use, this paper investigates the status quo of public information channels and access to information content in Henan Province, including the information open channels used by the public, the government open information obtained by the public, the status quo of public access to rainstorm information during the heavy rainstorm in Henan, and the types of rainstorm disaster information open information channels received by the public. Finally, it was found that the information disclosure channels used by the public were mainly concentrated in the mobile interactive network. On average, each public had access to nearly three kinds of public information, mainly concentrated in the fields of geographic information, statistical information and epidemic information. However, during the heavy rainstorm in Henan Province, the most popular information was meteorological information, geographic information and traffic information. In terms of information disclosure channels used by the public, more than half of the 505 people surveyed used wechat to obtain government information disclosure data, while nearly 40% of the people used government websites, Internet and TV broadcasts, and nearly 30% of the people used Weibo and consultation hotline, show as Table 1. It can be found that the main channels for users to obtain public data of government information are all related to the Internet, while the proportion of traditional channels is relatively low. Since the frequency of information disclosure channels used is 1147, it can be concluded that every person on average has used at least two channels to obtain government information disclosure channels. improve the quality of information disclosure, it is necessary to develop a measurement model suitable for information disclosure to evaluate the current quality of information disclosure. With the help of TOE framework, metadata evaluation model, resource based theory, resource confirmation theory and other theoretical characteristics, this study proposes an evaluation model for the quality of rainstorm information disclosure, so as to more accurately implement the investigation and research. According to the above analysis of the current situation of rainstorm and the actual needs of public information, the model of factors affecting the quality of rainstorm information disclosure is refined, and the information perception expectation, organization perception expectation, and information environment acceptance level of rainstorm disaster information disclosure are expanded. Finally, the quality of information disclosure content and the availability of information disclosure constitutes the information perception expectation factors, the completeness of information disclosure process, the government response ability. The ability of government feedback constitutes the perceived expectation of the organization, while the minimum acceptance ability of information disclosure and the technical support ability of information disclosure constitute the acceptable level of the information environment. Finally, the influencing factor model of rainstorm information disclosure quality is proposed, as shown in Fig 2. After combining the current situation and problems of rainstorm disaster information disclosure, the actual needs of public information, and the research on relevant information disclosure, the evaluation indicators in the influencing factors model of rainstorm information disclosure quality are refined, and the potential variables that may affect the quality of rainstorm information disclosure are selected. The final preliminary designed measurement scale is shown in Table 2. combining relevant research characteristics and the actual situation of rainstorm information disclosure, and finally takes the accuracy, timeliness, comprehensiveness, relevance, availability, multi- source, diversity and other seven information disclosure content characteristics of rainstorm disaster information disclosure as the elements to measure the quality of information disclosure content [8-11]. Accuracy, timeliness, and comprehensiveness is the basic elements of information disclosure content quality, which are the core factors that affect information perception expectations. The target of information disclosure is public users, without any specificity. In order to ensure that public users can completely and clearly obtain the information disclosure of rainstorm disaster. Firstly, it is necessary to ensure the accuracy, timeliness, comprehensive display of disaster information, and certain relevance of the information disclosure content. At the same time, it should be easy for public users to use and understand, ensure the diversity of data sources and the diversity of information disclosure forms, so that all kinds of public users can access the content of rainstorm disaster information disclosure in high quality.",
    "Information disclosure and accessibility. Only when rainstorm disaster information is received by the public can the value of information disclosure be demonstrated. In the era of the Internet, the accessibility of information disclosure is difficult to measure. This study measures it through subjective public evaluation indicators. We mainly measure the completeness of the operational guidelines for government department information disclosure systems, the ability of government department information disclosure systems to provide personalized services, and whether they can interact and communicate with government personnel [12-14]. The completeness of the information disclosure process. There is an information disclosure process in the process of information disclosure services, which should serve the public's needs. Evaluate the completeness of the information disclosure process by assessing whether it meets public needs, whether each process is completed according to requirements, and whether the information disclosure process is subject to public supervision [8-9]. Government responsiveness. This dimension is used to measure the response of government information disclosure department service personnel and public users. The government's response ability is evaluated by three indicators: the speed of solving problems raised by the public, the degree of public participation in rainstorm information disclosure, and the willingness of government personnel to stand on the public's side to disclose information [15-16]. Government feedback capability. The main description is the government's service capability for information disclosure. After the rainstorm disaster information is released, whether the public has timely received relevant government feedback, the extent of timely feedback, and the effectiveness of the solution when feedback is not available. For example, after the information is made public, the public can consult the government for relevant disaster information and whether the government department can provide timely and accurate responses. If unable to respond, can alternative solutions be provided. Minimum acceptance capacity for information disclosure. This dimension includes possessing the basic knowledge required to use information disclosure, possessing the necessary ability to use information disclosure content, and the necessary equipment to use information disclosure data. This dimension displays whether the information disclosure environment is friendly to the public and measures the conditions that the public must have to accept information disclosure [8-9]. Information disclosure technology support capabilities. This dimension is a service evaluation indicator for information disclosure systems, including the stability, security, response speed, ease of operation, and usage efficiency of the information disclosure system. The evaluation of indicators can reflect the technical support capacity of government information disclosure and technically guarantee the requirements of rainstorm disaster information disclosure [12,17]. Ability to safeguard the right to information. Because the degree of information disclosure directly affects citizens' right to know, an additional dimension of citizen rights protection is added to information disclosure [11,18]. This dimension mainly measures whether citizens' right to know can be effectively guaranteed, whether they can provide the public with rainstorm disaster information that should be known, whether citizens are blocked by staff when exercising their right to know, and whether rainstorm disaster information provided to the public is complete. Privacy protection capabilities. Privacy protection refers to the ability to protect private information disclosed during the public's use of publicly available data. This dimension mainly measures whether the government provides public privacy protection mechanisms and whether the public feels privacy infringement during the information disclosure consultation process [19-20]. Ability to ensure equal rights. The subject of equal rights is all citizens, and public access to information and public data shall not be restricted due to various conditions. According to the characteristics of the information disclosure process, the plan measures the ability to safeguard equal rights from two dimensions: whether the public is discriminated against in the process of obtaining public information, and whether Accuracy of rainstorm disaster information disclosure Timeliness of rainstorm disaster information disclosure Comprehensiveness of rainstorm disaster information disclosure Relevance of rainstorm disaster information disclosure Availability of rainstorm disaster information disclosure Multi sources of rainstorm disaster information disclosure Diversity of disaster disclosure forms rainstorm information Completeness of operational guidelines for government information disclosure systems Government department information disclosure system data provision capability The ability of government department information disclosure systems to provide personalized services The public can interact and communicate with government personnel on information disclosure The information disclosure process can meet public needs The completion of various processes for information disclosure is relatively high The public can supervise the information disclosure process The speed at which the government solves problems raised by the public Degree of public participation in rainstorm information disclosure The willingness of By investigating the current situation of information disclosure during rainstorm disaster in Henan Province, this paper builds a model of factors affecting the quality of information disclosure characterized by rainstorm disaster information based on TOE framework theory, metadata evaluation model, resource based theory and resource confirmation theory. With the help of the current situation and demand characteristics of the public's actual information acquisition, it designs a model with information disclosure content quality, information disclosure accessibility, information disclosure process Completeness 10 test dimensions of government response ability, government feedback ability, minimum information disclosure acceptance ability, information disclosure technology support ability, right to know protection ability, privacy protection ability, right to equality protection ability, and 35 test items of rainstorm disaster information disclosure quality impact factor evaluation scale. The research provides help for government information disclosure to more accurately identify public needs, provides targeted evaluation models and operable evaluation models for rainstorm disaster information quality evaluation in Henan, and provides ideas and strategies for improving rainstorm disaster information quality."
]