[
    "How to cite this paper: Sun, F. B. (2022). Agricultural Credit Risk Assessment in China Based on the BP and GA-BP Neural Network. Modern Economy, 13, 860-884. https://doi.org/10.4236/me.2022.136047 Copyright © 2022 by author(s) and Scientific Research Publishing Inc. This work is licensed under the Creative Commons Attribution International License (CC BY 4.0). http://creativecommons.org/licenses/by/4.0/ Open Access The credit constraint caused by difficult and expensive loans is a crucial ob- stacle to agricultural modernization in China. This is due to the high risk and uncertainty of agricultural production and operation activities and the high transaction cost and asymmetric information of agricultural credit activities, which lead to ineffective risk assessment. In this study, comprehensive infor- mation on agricultural credit business reports, customer questionnaires, and loan application forms of Chinese banks are combined with the characteris- tics of the agricultural industry and credit scenarios to develop an innovative agricultural credit risk assessment index system. The index system is con- structed mainly based on the first repayment source and risk process. Fur- ther, a genetic algorithm optimizes the BP neural network. The sample data of 1165 agricultural credits collected from Zhejiang, Jiangsu, Shandong, and Henan provinces are analyzed. The results of the classification prediction si- mulation show that this method effectively reduces the problem of the BP neural network converging to a local minimum and increases the accuracy and sensitivity correction of data prediction. This overcomes the problem of difficult risk assessment due to nonstandard and inaccurate agricultural cre- dit data, thus providing theoretical and practical solutions for improving the The African swine fever and Sino-US trade war caused tight supply and conti- nuous price increases of Chinese agricultural products, such as meat, poultry, and feed, for a sustained period. Thereafter, the COVID-19 and locust plague in Africa broke out in 2020, triggering volatility and panic in the international food market. Consequently, the United Nations World Food Program and FAO jointly issued the “Early Warning of Hot Spots with Serious Food Insecurity,” according to which, “at least 25 countries will face a severe risk of famine in 2020, and the world is on the verge of the worst food crisis in 50 years”. Thus, issues concerning agriculture, rural areas, and food security have recently be- come a topic of great interest to the Chinese people. The structure of the article is as follows: the first part is a brief introduction to the full text, the second part is the system and data collection of the new agri- cultural business entity, the third part uses the establishment of the neural net- work model, the fourth and fifth parts are to substitute the data into the model for calculation, and the seventh part is a summary. Meanwhile, the investment of a unit of land capital and the intensity of agri- cultural capital are constantly increasing. Therefore, it is necessary to establish a rural financial support system and adequate rural financial supply to ensure sus- tainable development and establish a modern management system for the agri- culture sector. However, according to the statistical data provided by the “China Rural Financial Services Report”, the balance of domestic and foreign currency rural loans of Chinese financial institutions has been around 20% of the balance of various loans, and the country’s coverage rate of rural banks is only about 50%. Therefore, many rural areas lack basic financial services, and agricultural production faces severe credit constraints. The reason for China’s agricultural credit constraints lies in the high degree of fragmentation and scale of agricultural production land, limited ability to resist natural disasters, weak rural credit infrastructure, lack of adequate information on credit transactions, and high transaction costs. These reasons cause ineffec- tive risk identification and assessment in rural financial institutions. Meanwhile, agricultural business entities have problems, such as low income, limited assets, ineffective mortgages, and inadequate guarantees. In addition, poor credit records, irregular land circulation, and insufficient insurance guarantee con- strain businesses. Furthermore, there is concern that rural financial institutions lack innovation and effective methods to prevent and control risks. Therefore, to address this dilemma, we explore the effective index system and model method of risk assessment. Due to information asymmetry, we also rely on financial science and technology innovation to help China’s rural financial institutions avoid adverse selection and moral hazards after trading. Financial institutions reduce transaction costs through the scale effect, providing technical support for improving the efficiency of credit risk management and relieving credit constraints.",
    "The existing theory and practice of risk assessment of agricultural credit busi- ness, especially the vast rural financial institutions in China, remain based on mortgage, guarantees, and other secondary repayment sources. On the other unique index system for risk assessment of agriculture-related credit. This will inevitably lead to significant defects in the pertinence, scientificity, and accuracy of the risk assessment. For example, in constructing a risk assessment index sys- tem, Micha et al. (2015) comprehensively evaluated the impact of obtaining convenient financing from indicators, such as the age of the agricultural opera- tors, education level, industry prosperity, planting area, and government sup- port. Sousa (2015) used a dynamic Bayesian model to construct a discriminant model, focusing on indicators, such as age, occupation, income, and social status of agricultural operators in the risk assessment. Meng and Chi et al. (2015) com- bined partial correlation analysis and comprehensive discriminant ability to build a credit evaluation index system of 16 indicators for farmers’ microfinance. They used support vector machine (SVM) to build a credit evaluation model. Based on farmers’ basic information and credit details, a rural credit evaluation system with 2 first-level and 11 second-level indicators was constructed (2019). In applying the risk assessment model, Dutta and Rating (1988) analyzed how the change in network structure and the number of independent variables in the neural network model affect its credit-rating-discrimination-ability, at a predic- tion accuracy rate of 76% - 82%. Sousa (2015) built a Bayesian dynamic credit risk assessment model based on ordered data, and the empirical results are con- sistently superior to the static one. Meng and Chi et al. (2015) built a credit risk evaluation model for farmers’ microfinance by maximizing the range. The re- sults showed that the evaluation results of different single methods are contra- dictory. Huang et al. (2019) combined the traditional scorecard with the ma- chine learning model and concluded that the effectiveness was better than a sin- The existing research on agricultural credit risk assessment is mainly based on the secondary repayment sources of customers, such as basic credit, financial status, mortgage, and guarantee. These traditional credit risk assessment tech- nical tools are mainly re-applied in agricultural credit risk assessment. However, several Chinese agricultural business entities, especially those applying for oper- ating loans of over 300,000 - 500,000 yuan, find it difficult to pass the risk as- sessment due to the absence of mortgage guarantees. They are often subject to existing policies and credit constraints. Therefore, this paper begins with the de- sign of the first repayment source, mainly based on the income from production and operation. Then, we combine the machine learning methods with high ac- curacies, such as BP and GA-BP neural networks, to make the credit risk as- sessment more targeted, scientific, and accurate. credit, operational, and market risk, based on national risk classification stan- dards. Agricultural credit risk has the characteristics of general financial risk, the particularity of the agricultural industry, periodicity, complexity, infectivity, and relevance. Second, considering that agricultural credit activities run through the whole process before, during, and after production, the main risks and their in- fluencing factors are different in different industries and links. These three types of risks are further subdivided into 10 secondary indicators that include solven- cy, technical risk, and price risk. Then, the basic questionnaire is designed by collecting the information of agriculture-related credit business reports, cus- tomer questionnaires, and loan application forms of various banks. The ques- tionnaire is based on analyzing agricultural credit scenarios from the perspective of risk sources and processes. It combines them with many default behaviors and the three-level indicators influencing agricultural credit risk. Finally, combined with field investigation and interviews, the questionnaire is constantly revised and improved by the Delphi method to make the design more scientific, rigor- ous, and operable. Therefore, relying on the existing bank credit risk evaluation index system, a large number of index parameters based on the first repayment source are further defined so that the overall index is more scientific and precise. Finally, an innovative three-level evaluation index system of agricultural credit risk is designed (Table 1). To obtain real, effective, and representative credit sample data, an empirical in- vestigation was conducted in Zhejiang, Jiangsu, Shandong, and Henan in China, some representative regions with the most significant scale of agricultural credit supply and relatively active rural financial reform in 2018-2019. Since these provinces are the first provinces in China to start the agricultural financial reform and have special agricultural financial products, to a certain extent, they can represent the future direction of China's domestic agricultural reform and future popularization policies, and the data of these provinces can effectively represent the overall universality. Local government agricultural authorities, agriculture-related financial institutions, industry associations, and agricultural business entities1 were interviewed, such as civil servants, farmers, loan officers, factory directors, local farmers, respectively. In particular, the representative counties and cities under the jurisdiction of China’s rural financial reform pilot zone—Lishui City, Zhejiang Province—were investigated. Meanwhile, in-depth and detailed interviews were conducted with the executives and frontline credit personnel of 105 agriculture-related credit banks. As a result, the analysis of the factors influencing credit risk was cross-verified and improved with actual credit business operation experience. Simultaneously, nearly 2000 credit sample data were obtained by combining field investigation with bank internal data collec- tion. The resulted from the phenomenon that Chinese agricultural operators 1Due to the wide scope of agricultural credit business, the credit samples investigated in this paper are mainly production-oriented agricultural business subjects.",
    "generally have low education, irregular management, and non-standardized agricultural credit bank business data and file management system. After further screening, sorting, analysis, and consulting relevant credit personnel, 1165 valid credit sample data were finally obtained. To further verify the scientificity of the selected evaluation indicators, we con- struct a basic fixed-effect model for initial pre-inspection and consult Chinese universities and banking experts to validate the constructed evaluation indica- tors. Simultaneously, it was found in the survey that the credit risks of agricul- tural business entities in different industries vary. Therefore, the subsequent empirical analysis divides the obtained credit sample data into four categories according to the different industries: cash crops, field crops, animal husbandry, and aquaculture2. 2Due to the relatively small number of aquaculture samples and uneven regional distribution found in the process of empirical investigation, this study first explored the other three types of agricul- tural operators. Meanwhile, for the convenience of expression, the agricultural operators of the in- dustry were referred to as the agricultural operators of the industry in the subsequent sample analysis. In addition to setting up a scientific and reasonable evaluation index system, choosing suitable and efficient models and tools plays a vital role in the accuracy of the evaluation output. In recent years, with the rapid development of artificial intelligence [AI] and information technology [IT], the ideas and methods of cre- dit risk assessment have become more diversified. As a result, advanced tech- nologies, such as neural networks, genetic algorithms, and decision support sys- tems, have been gradually introduced into the field of risk assessment, effectively overcoming the limitation of traditional econometric analysis methods with strict data requirements. LeCun, Bengio, and Hinton (2015) first proposed deep learning discovers intricate structure in large data sets by using the backpropa- gation algorithm to indicate how a machine should change its internal parame- ters that are used to compute the representation in each layer from the repre- sentation in the previous layer. BP neural network is a unidirectional propagation multilayer forward network based on the BP algorithm; it includes the input, hidden, and output layers. It uses the gradient descent method and gradient search technology to minimize the mean square error between the actual and expected output of the network. The calculation process of the BP neural network consists of forward and reverse calculation processes. In the forward calculation process, the foreign informa- tion goes through the hidden layer from the input layer, and then goes back to the output layer such that the state of neurons in each layer can only affect the state of neurons in the next layer, but the neurons in each layer do not affect each other (2016). If the calculation process cannot obtain the expected output result at the output layer, it will turn to backpropagation. This returns the error signal layer by layer along the original connection path, makes repeated calcula- tions by modifying the weights of each neuron, and finally minimizes the error signal. Therefore, the BP neural network has unique advantages in the logical and classification judgment of samples. The black box network can effectively and quickly self-learn and achieve the dynamic fitting effect of judgment func- tion. Simultaneously, it can also fit all types of irregular functions. Thus, theo- The input layer of the neural network is the initial parameter and the middle layer selects the node number according to log A. A is the number of input 2 layer nodes, as the output layer is the target result, and its structure is shown in The elimination and the formula method are used to determine the number of neurons in the middle layer. The formula method is widely used, and the specific reference formulas include the following three: First, calculate 1n = + + , where m and n are the number of neurons in m n a the output layer and a is the input layer. Then n = log n , where n is the number of neurons in the input layer; Final calculate ∑ i = 0 C i n > k , where k is the sample number, ni is the number of intermediate nerve elements, n is the number of afferent nerve elements, where i n> i , i nC = . 0 There are multiple internal calculation algorithms in a neural network, and the basic algorithm cannot meet the agricultural credit risk assessment due to low sample data quality. Therefore, all the basic default algorithms are changed and optimized to adapt to the calculation processing. The specific functions in- volved in the construction and calculation process are as follows: LM algorithm is similar to the quasi-Newton method, and its purpose is to avoid calculating the Hessian matrix when modified at an approximate second-order training rate. When the error performance function has the form of square sum error (typical error function of training feedforward network), the Hessian matrix can be approximately expressed as where J refers to the Jacobian matrix containing the network error function, the first derivative of the weights and thresholds, and e is the network error vector. The Jacobian matrix can be calculated by standard feedforward network tech- nology, which is straightforward than the Hessian matrix. Similar to Newton’s method, the LM algorithm can be modified by the approximate Hessian matrix as follows: When the coefficient μ is 0, the above formula is the Newton method. When the value of coefficient μ is large, the above formula becomes the gradient des- cent method with a smaller step size. Because Newton’s method approaches the minimum error faster and more accurately, the algorithm should be as close as possible to Newton’s method. With each successful iteration step (the error per- formance is reduced), the μ is reduced. Only when the error performance in- creases after the trial iteration will μ increase. In this manner, the error perfor- mance of the algorithm is always the smallest after each iteration. LM algorithm is the fastest algorithm (up to hundreds of connection weights) proposed mainly for training medium-sized feedforward neural networks. It is also effective for MATLAB implementation because matrix calculation is realized by functions in MATLAB. The attributes become clear when setting.",
    "It is easy to fall into the local extremum with the BP neural network, leading to over-fitting and training failure. To better realize its popularization and ap- plication value, this study mainly avoids its inherent application defects by ad- justing and modifying the relevant parameters of the model and combining the genetic algorithm strategy with the neural network. The study also puts forward a strategy for strengthening network training using a genetic algorithm and compares the advantages and disadvantages of the two. As a result, the improved model is more operable and accurate in an application, and finally, it improves the risk assessment efficiency by giving full play to their advantages. Introducing a genetic algorithm into the BP neural network and its highly pa- rallel global search algorithm overcomes its shortcomings. It helps avoid the problem of falling into a local minimum and improves the convergence speed of the network. This enhances the learning and generalization ability of the model and its performance. In determining the model structure, the input and output parameters are mainly determined according to the problems to be solved. Con- trastingly, the genetic algorithm mainly determines the initial weight and offset value by calculating the individual fitness value and the weight and offset value corresponding to the optimal individual through selection, crossover, and muta- tion operations. It is only necessary to assign the values of this parameter indi- vidual to the weights and thresholds of the BP neural network in the operation process because each parameter individual contains all the weights and thre- sholds of the neural network. Meanwhile, the BP neural network prediction mainly determines the final structure of the network according to the first two steps to predict the new data and get the results. Fitness function: Through the initial weight and threshold of BP neural net- work obtained by the individual, the training data is used to train the BP neural network to predict the system output. At the same time, the absolute value E of the error between the predicted output and the expected output and F as the in- dividual fitness value are calculated as follows: In the above formula, n is the number of nodes output by the network, and iy is the expected output value of the ith node of BP neural network, io is the predicted output value of the ith node, and k is the coefficient. Select operation: The selection operation of genetic algorithm belongs to rou- lette method. It is a selection strategy based on fitness proportion, and the selec- tion probability of each individual i is different ip as follow: In the above formula, iF is the fitness value of individual I, because the smaller the fitness value, the better. Therefore, before individual selection, cal- culate the reciprocal of the fitness value, where k is the coefficient and N is the number of individuals in the population. Cross operation: Because individuals mainly use real number coding, the crossover operation method adopts real number crossover method, and the K chromosome ka and chromosome lth la , their cross operation method at J is as follows: Cross operation can effectively increase the randomness of data and reduce the specified partial derivative of single regular data to the result. gene; ( f g ) = r 2 1 − G max , 2r is a random number, G is the current iteration BP neural network optimization: After completing a series of operations, the weight and threshold of the optimal solution are substituted into the BP neural network for cyclic iterative calculation, and a better solution is obtained. The BP neural network easily falls into over-fitting during credit risk assessment. Thus, the genetic algorithm fits the whole data better and has a higher degree of discrimination against unknown data in forecasting. Therefore, to further ex- plore a more accurate and efficient model and method for credit risk assessment, the demonstration and simulation will begin with the fitness function based on BP neural network. Then, the above 33 index parameters are used to conduct the selection, crossover, and mutation operations on the credit samples of three types of agricultural business entities engaged in cash crops, field crops, and li- vestock breeding production. Then, the genetic algorithm is substituted for analysis to compare the advantages and disadvantages of the two models re- garding risk assessment accuracy.",
    "MATLAB R2019a is used to build BP neural network, and 1165 sample data are classified according to industry. The specific process includes determining training samples, selecting network parameters and related functions, analyzing training results, and warning network risks. Taking the above 33 risk factors as the input layer of network training, whether to default as the output layer, that is, there are 33 input layer nodes and 1 output layer node, the number of hidden layers is log 33 , and after rounding, it is 5. After the neural network structure and training parameters are set, the accuracy of the training set is explained by the confusion matrix. The sum of data in the 2 × 2 matrix represents the total training sample data. The percentage represents the accuracy. Finally, the accuracy of the test simulation set is measured by pre- diction accuracy, which is equal to the real value of the total number of test sets. According to different industries, the classification simulation test is carried out, and the specific results are discussed in the following sections. The credit risk of cash crop samples is analyzed, including the above 33 parame- ters, with a total of 458 sample data. A total of 366 sample data are selected as training sets, and the remaining 92 are selected as test simulation sets. According to the model results, the probability of being judged correctly is 97.7% among the 366 training sample data. Furthermore, the prediction accuracy of the BP neural network model for cash crop samples is 73% (Figure 2), while the predic- tion accuracy of the GA-BP neural network model is 84% (Figure 3), which is better than that of BP neural network. In the calculation process of the genetic algorithm, the optimization of the BP neural network is consistent. The training dataset is divided into three groups to prevent over-fitting. Training is 75% of the total data, validation is 15%, and the test is the remaining 10%. Only the training data participate in the training, and the other data are used for later inspection and explanation. As shown in Figure 4, the training set r of the BP neural network is 0.980, the verification set r is 0.854, and the test simulation set r is 0.9415. Thus, the fitting effect is relatively good, and the overall fitting degree is 0.953. In Figure 5, the training set r of the GA-BP neural network is 0.897, the verification set r is 0.895, and the test simulation set r is 0.876. The fitting effect is good with an overall fitting degree of 0.894 and no fitting phenomenon. The variance error of the BP neural network for cash crop samples is concen- trated between −0.05 and 0.06, and the error rate is negligible (Figure 6). The va- riance error of the GA-BP neural network for cash crop samples is concentrated between −0.09083 and −0.06122, approaching 0, and the error rate is negligible (Figure 7). Thus, there is little difference between the two methods in operation error, but the genetic algorithm is more accurate in judging extreme values. In the optimization process of genetic algorithm, the number of evolutions, that is, according to the principle, the lower the function value of fitness, the higher the fitness, and the better the individual (Figure 8). When 20 iterations are reached, the individual fitness reaches the highest, and the optimal weights and thresholds are obtained simultaneously. As the number of iterations and the population size will affect the calculation time and performance, one size is se- lected as 50. Choosing 20 and 50 can effectively optimize the intermediate oper- ation time when choosing code exchange. The probability of cross genes is se- lected as 0.3, and the probability of code variation is selected as 0.1. Because RNA cross probability is slightly larger than self-variation in biology and in the process of calculation optimization and performance comparison, according to the principle, the lower the function value of fitness, the higher the fitness, and the better the individual. When 20 iterations are reached, the individual fitness reaches the highest, and the optimal weights and thresholds are obtained simul- taneously. The credit risk of field crop samples is also analyzed, including the above 33 parameters, a total of 387 sample data. Among the sample data, 310 are selected as training sets, and the remaining 77 are selected as test simulation sets. Ac- cording to the model results, the probability of being judged correctly is 92.9% among 310 training sample data. Figure 9 shows that the prediction accuracy of the BP neural network model of field crops with 33 parameters is 67%. The pre- diction accuracy of the GA-BP neural network model is 70%, and the prediction effect is more pronounced (Figure 10).",
    "The training dataset is further divided into three groups to prevent over-fitting. Training accounts for 75%, validation 15%, and test accounts for the remaining 10% of the total data. Only the training data participate in the training, and the other data are used for later inspection and explanation. The training set r of the BP neural network is 0.961, the verification set r is 0.995, and the test simulation set r is 0.942 (Figure 11). Thus, the fitting effect is good, and the overall fitting degree is 0.965. Figure 12 shows that the training set r of the GA-BP neural network is 0.923, the verification set r is 0.817, and the test simulation set r is 0.984. Again, the fitting effect is good, and the overall fitting degree is 0.908. between 0 and 0.03, and the error rate is small and concentrated near 0 (Figure 13). Figure 14 shows that the variance error of the GA-BP neural network pre- diction model is concentrated between −0.017 and 0, and the error is less than that of the BP neural network. The evolution times (i.e., iteration times) are selected as 30, and the popula- tion size is selected as 50 in the optimization process of the genetic algorithm (Figure 15). As iteration times and population size will affect the calculation time and performance, choosing 20 and 50 can effectively optimize the interme- diate operation time. When 20 iterations are reached, the individual fitness reaches the highest, and the optimal weights and thresholds are obtained simul- taneously, consistent with the previous generations of the genetic algorithm for cash crops. The credit risk of animal husbandry samples is also analyzed using the above 33 parameters and 320 sample size. Among the total data, 80% were selected, with 256 sample data as training sets and the remaining 64 as test simulation sets. According to the model results, the probability of being judged correctly is 88.3% among 256 training samples. The lower accuracy of animal husbandry compared with cash and field crops are due to the unique data of animal hus- bandry. This is mainly due to the tightening of China’s environmental protec- tion policies in recent years and the impact of African swine fever and other events that made collecting samples difficult and fluctuating relevant data. Fig- ure 16 shows the prediction accuracy of the animal husbandry BP neural net- work model with 33 parameters is only 44%, which does not reach more than 50%. Figure 17 shows that the prediction accuracy of the animal husbandry GA-BP neural network is 60%, which has a better prediction effect. This model prediction accuracy is lower than that of cash and field crops due to the data. The training dataset is divided into three groups again to prevent over-fitting. 10%. Only the training data participated in the training. The other data did not participate in the training but are used for later inspection and explanation. The training set r of the BP neural network model is 0.986, the verification set r is 0.998, and the test simulation set r is 0.999 (Figure 18). The fitting degree is slightly higher, and the overall fitting degree is 0.989. Figure 19 shows that the training set r of the GA-BP neural network model is 0.863, the verification set r is 0.961, and the test simulation set r is 0.955. The fitting effect is better, and the overall fitting degree is 0.889. As shown in Figure 20, the variance error of the BP neural network predic- tion model is concentrated between –0.05 and 0, and the error rate is small, concentrated near 0. Meanwhile, the variance error of the GA-BP neural net- work prediction model is concentrated between –0.47 and 0.11, distributed at both ends of 0, and the error rate is small (Figure 21). In the optimization process of the genetic algorithm, the number of evolutions (i.e., the number of iterations) is selected as 30 and the population size as 50 (Figure 22). The probability of crossing genes is selected as 0.3, and the proba- bility of code variation is selected as 0.1. As a principle, the lower the function value of fitness, the higher the fitness, and the better the individual. When 25 iterations are reached, the individual fitness reaches the highest, and the optimal weights and thresholds are obtained simultaneously.",
    "Combined with the credit sample data results of the above three types of agricul- tural business entities, the genetic algorithm is higher than the BP neural network in the overall data fitting degree. In the prediction, the unknown data are highly discriminated, and the BP neural easily falls into an over-fitting state. Thus, a genetic algorithm is more suitable for prediction analysis. It is more accurate to select the GA-BP neural network by fitting and judging the existing data. The specific comparison results are shown in Tables 2-4. The comparison of the above tables shows the following: 1) The BP neural network is slightly faster than the GA-BP neural network in algorithm calcula- tion. However, the latter is higher than the former in agricultural credit risk pre- diction accuracy. 2) The BP neural network is high enough in ontology fitting degree, but with an over-fitting phenomenon. In contrast, the GA-BP neural network does not have over-fitting when fitting sample data. It has a good fitting effect, which can better reflect the real situation of China’s agricultural credit risk assessment. Based on empirical investigation and bank interviews, this study first screened and tested the existing bank credit risk evaluation index system by Delphi me- thod and fixed-effect model and constructed an innovative agricultural credit risk evaluation index system based on the first repayment source. Then, the BP and GA-BP neural networks were used to build the model of China’s agricultural credit risk evaluation index system. Finally, the representative agricultural credit sample data collected in Zhejiang, Jiangsu, Shandong, and Henan were divided into three categories according to industries: cash crops, field crops, and animal husbandry. In particular, 80% of them are trained empirically, and the remain- ing 20% are simulated and predicted. After studying the results and the thre- shold layers of weights, the comparison table of prediction accuracy of the GA-BP neural network prediction model was obtained, which provides a refer- ence for agricultural credit risk control. This study found the following: First of all, in addition to credit risk, China needs to pay more attention to operational and market risks. Agricultural business entities in different indus- tries have different risk influencing factors. Therefore, when constructing the follow-up risk assessment index system, it is necessary to screen indicators from the perspective of industry scenes. In addition, analyzing them from the pers- pective of the first repayment sources, such as revenue and market conditions, is Secondly, because China’s agricultural credit information collection is difficult and the data are missing, it must be optimized and upgraded by combining qua- litative and quantitative methods. BP, GA-BP neural network, and other ma- chine learning methods can be introduced to improve the calculation processing, efficiency, and accuracy of risk assessment. The algorithm’s discrimination de- gree, calculation efficiency, and data utilization rate significantly improve com- pared to logistics-based discrimination methods. The digitalization, automation, and artificial intelligence transformation of financial institutions are also greatly improved. Finally, although BP neural network is slightly faster than the GA-BP neural network in calculations, the BP neural network is not as accurate in the degree of prediction. Simultaneously, it is difficult to enter the over-fitting state in the calculation, and the error distribution is relatively average, and the error con- centration is high. However, if there is sufficient data to predict the overall credit risk in the future, GA-BP neural network will significantly improve the predic- tion accuracy and reduce the error. Simultaneously, it can effectively classify and judge the target default. This kind of method needs a lot of data and complex parameters to solve this kind of problem. The data used to support the findings of this study are available from the cor- responding author upon reasonable request (e-mail: sfb007@zufe.edu.cn)."
]