[
    "Improving the credit system is a new requirement of the Ministry of Education of China. The academic advisor system is an essential part of the credit system management and plays an important role in the planning and guidance of students’ academic career. Therefore, this paper studies the influence of students’ perception of academic advisor support on academic motivation. It surveyed 455 undergraduates from universities and colleges in Henan Province that implemented the academic advisor system, and found that students have a high degree of academic motivation. The main results of the research are as follows: 1) Freshmen’s perception of academic advisor support is higher than that of senior students; 2) Perceived autonomy support and engagement support have a significantly positive impact on intrinsic academic motivation; 3) Perceived opportunity support has a significantly positive impact on extrinsic academic motivation; 4) Perceived relationships support has a significant negative impact on amotivation. This research can help higher education workers to value student autonomy in learning, actively communicate with students, and provide resource support for the realization of student goals. motivation is “the attribute that moves us to do or not to do something” (Broussard and Garrison, 2004). Motivation is also the psychological process by which people act in a way that is conducive to their satisfaction (Latham G., 2011). Motivation also plays an important role in the study of student performance in higher education. Academic motivation is the motivation that initiates and maintains individual learning activities and directs learning activities to certain learning goals. It contains two elements: learning needs and learning expectations. According to the research of Yerkes and Dodson, there is an optimal level of motivation for various activities. The optimal level of motivation varies with the nature of the task. When learning more complex problems, the optimal level will be lower. The relationship between motivation and work efficiency is an inverted U-shaped curve. Medium-intensity motivation is conducive to the completion of the task, and when the motivation is at a medium level, work efficiency is the highest. Many educators and psychologists have verified that students’ academic motivation has a positive impact on their academic performance (Haider et al., 2015; Sukor et al., 2017; Sivrikaya, 2019; Zhong, 2020). In order to comprehensively improve the quality of undergraduate talent training, various universities in China have begun to strengthen the construction of the academic advisor system. Since the academic advisor comes from teaching faculty and is a part-time position, the advisor bears a new teacher role with four identities: course teacher, ideological educator, academic planner and academic manager. Full-time Chinese college students live in universities during their studies. There are many disciplines and a small teacher-student ratio. Coupled with the professionalism, complexity and application characteristics of the disciplines, students will inevitably have learning difficulties and psychological pressures. Academic advisors have gradually become important guides and supporters of college students’ study and life. Therefore, this paper aims to study the implementation effects of the undergraduate academic advisor system in Henan Province through a survey questionnaire, focusing on whether academic advisor support can stimulate students’ academic motivation from the perspective of student perception. At the end of the 19th century and the beginning of the 20th century, British universities such as Oxford and Cambridge began to implement the credit system, applying the graduate advisor system to the training of undergraduates. The Chinese scholar Liao (2006) divides the role of undergraduate advisors into four types: the role of advisor group, the role of counselor, the role of scholar, and the role of waiter. The role of advisor group means that each student’s advisor is composed of multiple people, who provide all-round guidance for students’ thinking, life, and study. The role of counselor refers to the ideological and political education of students. In this role, the advisor is responsible for a large number of students. The role of a scholar is to be responsible for the study of students in their professional field, and to encourage students to actively participate in scientific research activities. The role of the waiter is that the instructor is responsible for guiding and helping students solve various problems encountered in their thinking, life and learning. Graduate advisor system focuses on the academic guidance research of students, while the undergraduate academic advisor system emphasizes the comprehensive effects of the teacher’s charm and knowledge (Li, 2018). Due to the differences in the school-running mode and the competence of the teaching staff, different universities are different in academic advisor system. In Henan Province, China, the selection conditions for undergraduate academic advisors are professional teachers with a strong sense of responsibility, good political quality, and high academic standards. The tutors are required to conduct ideological guidance, course selection guidance, learning method guidance, study plan guidance, scientific research guidance, social practice guidance, and innovation and entrepreneurship guidance so as to promote students’ individualized development and overall development.",
    "Shelton (2003) divides perceived teacher support into two types: psychological support and professional support. The former aims at cultivating a sense of value and competence, reflecting the value and acceptance of teachers to students, while the latter aims to improve academic achievement and promote professional development, reflecting the extent to which teachers give students effective academic guidance. Ou (2005) believes that students’ perception of teacher support behavior refers to the behaviors and attitudes that students perceive to their support in their studies and life. Perceived teacher support is divided into three dimensions: learning support, emotional support and ability support. Cai (2013) divides the perceived teacher support into three dimensions: emotional support, autonomous support and cognitive support. Emotional support examines the teacher’s care for students, communication, and the resolution of negative emotions when students face challenges or pressures; autonomous support refers to the cultivation of students’ learning autonomy, such as giving sufficient freedom in the choice of learning tasks, learning content and problem-solving methods; cognitive support means he cognitive assistance that teachers give to students, such as adopting flexible teaching methods, provide pragmatic learning skills, etc. As the research progresses, Chinese scholars have begun to study teacher emotional support in depth and use it as a separate variable for research. For example, Qiao (2014) defines teacher emotional support as students’ perception and satisfaction of attitudes and behaviors to teachers in the education and teaching process. Xu (2017) states that teacher support refers to the help and support provided by teachers to students in the teaching process, mainly to help students on a spiritual level, and generally does not involve material assistance. It mainly includes emotional support and academic support. Emotional support examines the teacher’s concern, tolerance and listening to students, and academic support means the specific guidance that teachers give to students in learning. Gao et al. (2017) define teacher’s emotional support as care, love, respect, support and help of teachers for students in study and life. They emphasized teachers’ emotional support can play a role only when the support is perceived and understood by students. Academic motivation is the source of motivation for students’ learning, and it affects students’ learning efficiency. Chinese scholars mainly investigate the factors affecting learning motivation from the perspective of the decline of college students’ learning motivation. Li, S. (2019) found that learner factors and environmental factors have a greater impact on learners’ motivation decline in a study on the phenomenon of decline in motivation of Chinese learners of Hungarian college students. Learner factors include three aspects: decreased self-confidence, lack of interest in learning, and negative attitudes. Environmental factors include four aspects: lack of language environment, teaching management problems, teaching materials problems and teaching facilities problems. Li, Z. (2019) studied the external and internal factors of the decline of college students’ English learning motivation in the context of mobile learning. External factors include teaching methods, learning atmosphere, classroom teaching materials, and curriculum settings. Internal factors include learning energy, learning interest, and learning strategies. Gao et al. (2019) built a theoretical model of the factors affecting college students’ autonomous learning motivation from the four dimensions of individual, peer, teacher, and environment in the network environment. Individual-level influencing factors include personality, goal achievement, emotions, and learning styles; peer-level influencing factors include peer communication and feedback, peer collaboration and competition; teacher-level influencing factors include teacher autonomy support, learning activity design, learning task design, curriculum design; environmental factors include learning mode and learning atmosphere. Gao and Wang (2020) conducted a questionnaire survey on the factors affecting the decline of English learning motivation among 1,357 non-English majors in five universities in China. The results showed that teacher factors, lack of self-confidence, lack of life goals, lack of learning strategies, and teaching content, Language attitude and English homework are important factors that affect the decline of students’ English learning motivation. Hong (2020) pointed out that students, teachers, learning environment and teaching evaluation are important factors that lead to negative motivation of college students in English learning. According to Pygmalion effect, if students perceive that teachers have higher expectations of them, they will adjust and promote themselves toward the goals that teachers expect. Wentzel (1997) found that students who are loved by teachers are more engaged in learning; Ruzek et al. (2016) states that if students can perceive that they are favored by teachers, they will be more enterprising and show higher motivation and confidence to solve the problems encountered, the sense of gain and happiness in learning will be stronger. Gregory et al. (2016) believe that when teachers begin to invest a lot of emotional support for students during the school, students’ learning motivation and engagement will increase accordingly. In an emotionally supportive classroom, adolescents’ learning autonomy has been improved in daily learning activities, and they can establish a more harmonious and stable relationship with their peers. Li (2018) studied teacher emotional support perceived by five-year vocational students and found that the overall score of teacher emotional support is generally low. Teachers are mostly in a state of emotional scarcity for students, and students are prone to problems such as depression, poor behavior, and insufficient learning motivation.",
    "Sha et al. (2020) studied the influence of teacher support strategies on college students’ learning motivation. Teaching support behaviors include providing spiritual encouragement, providing suggested choices, providing positive behavior feedback, answering student questions, communicating opinions with students, and allowing students to work in their own way. The results of online and offline mixed teaching tests show that after adopting teacher support strategies, students’ overall learning motivation has been significantly improved. Learner engagement is an action component of learner motivation development model (Fredricks et al., 2004). Bao and Zeng (2020) divide the teacher support into instrumental support, informational support, evaluative support and emotional support in the study of online English learning investment and teacher support for 632 English majors. Instrumental support mainly refers to teachers providing resources or spending time on teaching-related matters; informational support refers to providing students with information and suggestions, including various types of guidance on students’ learning behavior; evaluative support refers to providing students effective feedback on learning behavior; emotional support refers to the trust and care shown by teachers to students in teaching. The study found that the four dimensions of teacher support have a significant positive impact on students’ engagement, among which instrumental support and informational support have the most significant impact, followed by emotional support and evaluative support. Based on the above research results on teacher support and academic motivation, this paper puts forwards the following hypothesis: There is a relationship between perceived academic advisor support and students’ academic motivation. The Ministry of Education of China pointed out that it is necessary to cultivate new-age talents with a broad international perspective and actively serve the country’s opening-up strategy. Situated in inland China, Henan province is slightly inadequate in terms of internationalization. However, Henan Province is in a critical period of coordinating the construction of the four Silk Roads1 on land, air, internet, and sea. The economic and cultural ties between Henan province and other countries in the world are getting closer and have higher demands for international talents. Academic tutors are responsible for guiding students’ academic development. This paper takes the undergraduate students in pilot universities and colleges of academic advisor system in Henan Province as the survey object. Since the responsibilities of academic advisors are consistent, there is no restriction on the specialty of college students. In order to facilitate the collection of data, this study adopts the purposive sampling. The survey questionnaire is distributed online and offline. According to the government report, the number of undergraduate students in universities and colleges in Henan Province was 1,197,200 in 2019. A total of 486 questionnaires were received in this survey, of which 455 were valid questionnaires, with an effective rate of 94%. According to the Yamane equation, the sample size meets the minimum sample size required for this study, and can be used for statistical analysis. academic motivation is dependent variable. Perceived academic advisor support is measured using the perceived advising support scale developed by the University of Missouri (Burt et al., n.d.), including three dimensions: autonomy, interpersonal relationships, and engagement. The autonomy dimension includes 12 measurement items, such as “My advisor accepts me.”; “I can make choices among activities in order to complete degree requirements.”; “He/she provides clear guidelines for how tasks should be completed.”, etc. The interpersonal relationships dimension includes 6 measurement items, such as “I feel like I have a choice about interacting with this person.”; “When interacting with this person, I think about how much I enjoy it.”; “When I see him/her outside of the classroom, I am greeted.”; etc. The engagement dimension includes 4 measurement items, such as “He/she keeps me aware of opportunities for involvement on campus.”; “My advisor encourages me to get involved.”; “I am encouraged to emulate the example of involvement my advisor provides.”; etc. Students’ academic motivation is measured using the educational motivation scale of Vallerand et al. (1989), which includes three dimensions: intrinsic motivation, extrinsic motivation, amotivation. Intrinsic motivation dimension includes 12 measurement items, such as “Because I experience pleasure and satisfaction while learning new things.”; “For the intense feelings I experience when I am communicating my own ideas to others.”; “For the pleasure I experience while surpassing myself in my studies.”; etc. The extrinsic motivation dimension contains 12 measurement items, such as “Because with only a high-school degree I would not find a high-paying job later on.”; “Because I think that a college education will help me better prepare for the career I have chosen.”; “To prove to myself that I am capable of completing my college degree.”; etc. The unmotivated dimension contains 4 measurement items, such as “Honestly, I don’t know; I really feel that I am wasting my time in school.”; “I can’t see why I go to college and frankly, I couldn’t care less.”; etc. The measurements are all using a Likert five-point scale, 1 represents “strongly incompatible”, 2 represents “incompatible”, 3 represents “unclear”, 4 represents “compatible”, and 5 represents “strongly compatible”.",
    "This section calculated the Cronbach Alpha coefficient of perceived academic advisor support scale and academic motivation scale. According to the reliability statistics, Cronbach a coefficient of both the two scales and their subscales are greater than 0.9 (Table 1), shows that the adopted scales have higher internal consistency and they are acceptable. This result also indicates that these scales have a good applicability to Chinese students. The results of the descriptive analysis show that the university students participating in the survey were highly motivated, with an average score of 3.97. The measurement results of internal learning motivation show that students have the strongest internal academic motivation in gaining a sense of accomplishment (Table 2), reflecting the need for students to surpass themselves in learning. The measurement results of external academic motivation show that students have the strongest desire for a better life (Table 3), which shows that students have high value evaluation and expectations for learning results. Through one-way ANOVA, there were significant differences in students’ perception of academic engagement support among grades (Table 4). Among the four grades, freshmen have a higher perception of academic support than sophomores and juniors. First-year students have the highest scores (mean=4.5500), followed by second-year students (mean=4.2449), and third-year students (mean=3.2500). This finding cannot reflect the positive correlation between education and vigor, but indicate that the employees with highest education level and lowest education level display more vigor in work. This may be related to students’ inadaptability of campus environment. Freshmen have just come of age and left their hometown. In an unfamiliar environment, their study and life are different from those in high school. It is inevitable that they will not adapt to it. As new comers, they need more guidance and support from their advisors than senior students. Note: 1 = Grade One; 2 = Grade Two; 3 = Grade Three; 4 = Grade Four. * indicates significant at 0.05 level (2-tailed test) Through multiple linear regression analysis, the following four main results are obtained: 1) Perceived academic advisor support has a significant positive impact on academic motivation; (Table 5); 2) perceived autonomy support and opportunity support have significant positive effects on intrinsic academic motivation, while perceived interpersonal relationship support has a significant negative impact on intrinsic academic motivation; (Table 6) 3) Perceived opportunity support has a significant positive impact on extrinsic academic motivation (Table 7); 4) perceived relationships support has a significant negative impact on amotivation (Table 8). The autonomy support behavior of academic advisor has a significant impact on students’ intrinsic academic motivation, which is consistent with the research result of Zhang et al. (2018). Autonomous learning behavior refers to the learning behavior initiated, controlled and completed by learners voluntarily and actively. According to self-determination theory, the satisfaction of psychological needs is a necessary condition for improving the level of motivation. There are three basic psychological needs, that is, the satisfaction degree of autonomy, competence, and relationship. Autonomy refers to the sense of free will or psychological freedom in the learning process; competence refers to the feeling of being able to effectively complete tasks or achieving expectations; relationship refers to the emotional connection formed between individuals and others in a certain learning situation. The higher the satisfaction of the three psychological needs, the higher the level of autonomous motivation and the better the learning effect. students’ intrinsic academic motivation, which is consistent with the results of Lang (2020) research. According to the expectation theory, the size of the incentive force is determined by the valence V*expected value E. The application of this theory in the students’ management and motivation in colleges and universities is mainly to guide students to establish goals. When helping students establish goals, advisors must follow practical principles. If the target is too difficult, then the target valence is high, and if the target is too easy, the target valence is small. Besides, this theory can also be applied to the employment guidance of graduates. Students should choose jobs that match their own abilities. If the professional needs are too high, students will suffer because they cannot meet the requirements. As a result, they lose confidence and fail to invest in the industry well. Therefore, it is necessary to make full use of expectation theory in guiding students’ employment.",
    "Academic advisor’ support for student engagement has a significantly positive impact on students’ extrinsic academic motivation, and this result is consistent with the research result of Yang (2015). The engagement support results reflect that students have higher perception of campus opportunities and encouragement provided by the advisor. The academic advisor encourages and organizes students to actively participate in various campus and social activities, which can provide resource support for the realization of student goals, and can also check the progress of the completion of learning goals. When students learn that they have the opportunity to prove their learning ability and contribute to their future career development, they often have higher expectation for the results of their learning behaviors, which in turn will increase their learning interest and engagement. The interpersonal relationships support of academic advisor negative has a significant negative impact on students’ amotivation, and this result is consistent with the research result of Sun (2018). The evaluation results of academic advisors reflect that students find advisors very interesting and hope to communicate more with advisors. Communication allows students to perceive the teacher’s care, understanding and support, thereby prompting them to form a comprehensive cognition and evaluation of their own learning ability and learning behavior throughout the learning process. If individuals continue to receive guidance and encouragement from teachers, they will increase their interest and confidence in learning, and deepen their understanding of the meaning and value of learning (Jensen et al., 2019). Especially in terms of ability perception, it will enable students to re-recognize their own abilities in learning and enhance their self-confidence in learning. Autonomous support can meet the psychological need of students’ autonomy. The satisfaction of autonomy need is based on a certain sense of competence to some extent. If students do not recognize their own abilities in the learning process, even if they can choose freely, they cannot make effective decisions and actions, and their sense of autonomy will lose its foundation. Therefore, only providing autonomy support cannot meet the competency need of students with different ability levels. Especially students with low ability, without the necessary guidance and feedback, may lack understanding of tasks to be completed, feel confused and disorderly, and have a decreased sense of competence. A structured incentive style can greatly reduce the occurrence of this situation. Teachers can provide appropriate tasks and goals to students, and give necessary guidance, feedback and positive expectations when students encounter difficulties, which will help students feel the achievability of the goals and obtain the satisfaction of their competent needs. The sense of Competence solves the problem of knowing how to do it and being able to do it, but the willingness to do still needs to be provided by a sense of autonomy. Without autonomous support, students feel controlled and unfree, and still will not have a proactive effort. Therefore, autonomous support and structured support meet the needs of autonomy and competence respectively. The relationship needs will be met in teacher-student interaction when teachers adopt autonomous support or structured support. Helping students to build up their self-confidence helps to stimulate their motivation for intrinsic learning and enable students to better engage in learning activities. First of all, academic advisors should give students proper guidance before the beginning of the semester, so that students have an understanding of the difficulty of the course to be learned and the course objectives, tell them the importance of studying hard to improve the learning effect, and dispel students’ doubts about their own learning ability. Secondly, academic advisors should teach students in accordance with their aptitude, guide students in a targeted manner, and help students formulate appropriate academic plans according to their different learning characteristics and development needs. Teachers can help students set learning goals step by step, and put forward different requirements for students of different levels, so that all students have the opportunity to complete the goals, thereby gaining a certain sense of academic achievement and enhancing self-confidence. Third, advisors should give feedback to students in time and give them more positive evaluations, such as using oral or written comments to praise students, award certificates or small prizes, etc., in order to enhance students’ recognition of their learning ability. Finally, teachers should not only pay attention to the development of students’ learning ability, but also discover and cultivate students’ abilities in other aspects, so as to promote all-round development of students.",
    "College students spend most of their time in school. The care they feel in the school environment from non-peer comes from teachers. Increasing students’ perception of teacher support can be achieved by improving the environment of student perception. The personal qualities of academic advisors are the key factor that affect students’ perception. According to the “7%-38%-55%” rule, when we communicate in language, 7% of our liking for a person’s information comes from the content of the speech, 38% comes from the speaker’s voice, and 55% comes from the speaker’s body language. Therefore, teachers should strengthen the training of personal qualities, establish a fair education concept, and give students equal care and guidance. In view of the full-time undergraduate training model, academic advisors can make term planning, organize class meetings, special lectures, individual talks, questionnaires and other communication activities through classrooms, telephones, and the Internet, and increase the frequency of communication with students. The understanding and guidance of students’ learning and ideological conditions can fundamentally relieve students’ learning pressure, make students feel cared and understood, and then increase students’ perception of teacher support and meet their basic psychological needs (autonomy need, relationship need, competency need) to stimulate intrinsic academic motivation. Compared with regular classroom teaching, the atmosphere of extracurricular activities is more cheerful and the way of activities is more flexible, which can greatly reduce the pressure to participate, enhance their self-confidence and academic motivation. The social experience gained by students through extracurricular learning activities, in turn, has an influence on the learning of theoretical knowledge in the classroom. Individuals with strong introjected motivation have a high degree of autonomy, a strong sense of self-determination, and are willing to learn actively. In view of the students’ competency needs, academic advisors can help students set clear learning goals, use role models to encourage students to study hard, and provide students with various campus activities that can prove their learning ability, such as discipline competitions, social practice activities, innovation and entrepreneurship activities, scientific research activities, etc., to improve the learning environment. In addition, universities should build a positive campus cultural environment. More fun-learning slogans and examples can be used in the construction of campus culture, such as the design of posters, banners, and publicity columns. Furthermore, the expectation for a better life and high-salary work is also an important factor in motivating students to learn. Academic advisors can organize students to go to companies for research and internships, so that students can understand the company’s requirements for employees’ knowledge, ability, and quality, and then form an appropriate target valence to guide academic activities. The results in this study prove that the autonomy and engagement support of academic advisors have a significant positive influence on students’ intrinsic academic motivation, and engagement support of academic advisors have a significant positive influence on students’ extrinsic academic motivation. This helps classroom teachers and academic advisors to realize the importance of satisfying the basic psychological needs of students, thereby give students the opportunity to make their own choices, and promote students’ individualization development. In addition, various learning-related activities and information support can provide students with opportunities to prove their abilities, stimulate students’ sense of self-determination, and enable them to better engage in learning activities. This research also has a certain guiding significance for the construction of campus culture in colleges and universities, allowing college administrators to realize the importance of constructing a positive campus cultural environment by strengthening the model education mechanism, actively publicizing the advanced deeds of alumni, and motivating students to study hard. The data collected in this study are cross-sectional data at a certain time, which will affect the causal reasoning of this study. Future research can consider longitudinal comparative studies, and studying the changes in students’ perceptions of academic advisor support and students’ academic motivation levels. In addition, this study investigates the current implementation of the academic advisor system only from the perspective of students’ perception, which makes the feedback is not comprehensive enough. Future research can interview some academic advisors to understand the way academic advisors guide students, the difficulties encountered, and their opinions on the school’s academic advisor management mechanism. Finally, this research only studies the direct impact of perceived academic advisor support on academic motivation. Future research can use qualitative research methods to conduct in-depth interviews with students and academic advisors to understand their true feelings and ideas, and to find out other factors that can better stimulate students’ academic motivation in the context of academic advising system."
]