[
    "Abstract: Based on the sample survey data of grain farmers in Shandong, Hebei and Henan provinces, This paper use Probit model and Mediating Effect Model to analyze the influencing factors of farmers’ adoption behavior of water saving irrigation technology(WSIT) and their income increasing effects. The results show that education years of household head, planting scale, cooperatives membership and perception of water scarcity all significantly promoted farmers’ adoption of water saving irrigation technology. Water saving irrigation technology adoption behavior can significantly increase farmers’ income. After using instrumental variable method to deal with endogenous problems, the regression results are still stable. The adoption of water saving irrigation technology not only has a direct effect on improving household income, but also indirectly increases household income through factor inputs. Therefore, strengthening agricultural technology popularization, guiding and encouraging farmers to join cooperatives, and expanding farmers’ planting scale through land circulation are the keys to improve farmers’ income level. China’s per capita water resource is only a quarter of the world average level, close to the warning line of 1700 cubic meters. Among them, agriculture occupies a dominant position in China's water resources utilization. However, with the advancement of industrialization and urbanization, a large number of industrial water and domestic water occupy agricultural water. Under the current water resources endowment conditions, China’s agricultural water resources are facing severe challenges, the contradiction between supply and demand of agricultural production water resources is prominent, and the utilization efficiency of water resources is not high, which is more serious in irrigated agriculture. International experience shows that popularizing and adopting water saving irrigation technology is an effective way to alleviate the shortage of water resources in agricultural production. Therefore, China attaches great importance to the development of water saving irrigation technologies (WSIT). In 2019, the National Water saving irrigation Action Plan issued by the National Development and Reform Commission and the Ministry of Water Resources emphasized the strict implementation of dual control of water intensity and total amount, and promoted water saving irrigation technologies such as covering soil moisture conservation, spraying micro- irrigation, low-pressure pipe irrigation, and rainwater harvesting and supplementary irrigation. However, in the process of policy implementation, there is a disconnection between government promotion and farmers’ actual adoption, flood irrigation is still widespread, the actual adoption efficiency of agricultural water saving irrigation technology is low, and the effect of increasing income has significant individual differences. How to improve the adoption rate of water saving irrigation technology, and then improve the income level of farmers, has important practical significance. Therefore, clarifying the influencing factors of farmers’ water saving irrigation technology adoption behavior and its mechanism on farmers’ income is particularly important for promoting farmers’ water saving irrigation technology adoption behavior. (1) Influencing factors of farmers’ adoption behavior of water saving irrigation technology. The effect of individual characteristics of farmer households on water saving irrigation technology adoption behavior. The age of household head has a positive effect on the adoption of water saving irrigation technology, the older the head of household is, the less labor intensity he can put into agricultural production, and water saving irrigation technology has the characteristic of saving labor input, so the older the head of household is more willing to adopt water saving irrigation technology. The effect of education years of household head on the adoption of water saving irrigation technology by farmers is positive, the more educated the household head is, the more he realizes the importance of water saving irrigation technology in reducing water waste and protecting the environment, and the probability of adopting water saving irrigation technologies is higher. The effect of risk attitudes on farmers’ adoption behavior of water saving technology is positive, advanced water saving technology such as sprinkler irrigation, has a certain technology risk, and farmers with more positive risk attitude are more willing to adopt water saving technology. Therefore, it is assumed that the elder age of the household head, the more years of education, and the more positive risk attitude have a positive effect on the (2) The effect of farmers’ household characteristics on water saving irrigation technology adoption behavior. The effect of planting years on farmers’ water saving irrigation technology adoption behavior is positive, the richer planting experience, the more sensitive to the technical effects of water saving irrigation technology, and the higher probability of adopting water saving irrigation technology. The effect of planting scale on the adoption behavior of water saving irrigation technology by farmers is positive, sprinkler irrigation and other engineering water saving irrigation technologies have the requirement of minimum scale, and the larger planting scale of farmers, the more income farmers can get and thus the more money farmers can invest in the water saving irrigation technology, which will help farmers to adopt water saving irrigation technology. The effect of family laborers size on the adoption of water saving technology by farmers is negative, water saving technology has the attribute of labor saving, the more family laborers, the more they can meet the labor input for irrigation, and the less to adopt water saving technology. The effect of cooperatives membership on the adoption of water saving irrigation technology by farmers is positive, as cooperatives provide technology publicity, training and guidance, which helps farmers deepen their understanding of water saving irrigation technology and helps adopt water saving irrigation technology. The effect of social network on farmers’ water saving irrigation technology adoption behavior is positive. As a kind of informal system, social network can disseminate technology information through geographic, kinship, and industrial relations, forming the cohort effect of water saving irrigation technology adoption, and farmers who have not adopted water saving irrigation technology can improve the probability of technology adoption through learning and imitation effect. The effect of water scarcity perception on farmers’ water saving irrigation technology adoption behavior is positive, and farmers believe that the more scarce water resources are, the more willing to adopt water saving irrigation technology to reduce irrigation water consumption. Therefore, it is assumed that the longer planting years, the larger planting scale, the larger family laborers size, the larger membership in cooperatives, the larger social network, and the more sensitive water scarcity perception, have a positive effect on (3) Impact of water saving irrigation technology adoption behavior on farmers’ income. Water saving irrigation technology adoption behavior can reduce irrigation time by about 38%, and the reduction in irrigation time correspondingly saves pumping energy and irrigation water (Lampayan et al., 2015; Rejesus et al., 2011)[1-2], can reduce irrigation water use by 25-30% (Rahman and Bulbul, 2015)[3], and thus saves irrigation water costs. In addition to save water, water saving irrigation technology adoption behavior also has the effect of saving other production inputs such as input labor cost, pesticide and fertilizer cost, and seedling cost (Huang et al., 2017)[4]. At the same time, water saving irrigation technology adoption behavior increases average acre yield by reducing crop water use and increasing water productivity, which leads to increased income. Alternate wet and dry irrigation techniques can reduce water use by 25-30% (Kulkarni, 2011)[5], and increase groundwater utilization for higher yields (Carrijo et al., 2017)[6].",
    "In order to study the influencing factors of water saving technology adoption behavior, a probit estimation model was developed as follows: Where, i denotes the sample farmers, TA; denotes the farmers adopt water saving irrigation technology, X;denotes a series of influencing factor variables, p; denotes the estimated parameters ¢;, denotes the random error term. From the theoretical analysis, it can be seen that the adoption of water saving irrigation technology by farmers may have an impact on the income of farmers through saving the cost of factor inputs, and the mediating effect model is established to analyze the impact mechanism. Firstly, we set up (2) to test the direct impact of water saving irrigation technology adoption behavior on farmers’ income, and secondly, we use (3) and (4) to test whether water saving irrigation technology adoption behavior indirectly affects farmers’ income through mediating variables. Where, iM denotes the mediating variables, i , i denotes the estimated parameters, only 1 significant to continue to test 1, 1 , 2 , otherwise stop the analysis of mediating effects. Under the premise of 1 passing the test, if both 1and 2 are significant, it indicates that the impact of water saving irrigation technology adoption on farmers’ income is realized at least partially by the mediating variables. In the case of the previous two steps of the test are passed, if 1 significant and , with the same sign, indicating that 1 2 the mediating variable partially mediated, otherwise the masking effect. The data come from a questionnaire survey of grain growers conducted by the research group in 2019 in the main grain-producing regions of Shandong, Hebei and Henan provinces. The research area is dominated by irrigation districts, mainly relying on the exploitation of groundwater for irrigation, with a relatively complete infrastructure support, which is an important part of guaranteeing grain supply in the north of China. The selection of the questionnaire respondents took the combination of stratified sampling and random sampling, with the county as the unit, and the survey content mainly covered the basic situation of grain growers' families, cost and benefit situation, knowledge and application of water saving irrigation technology, water resource utilization and cognition, and information of their villages, etc. A total of 500 valid questionnaires were obtained, and 450 valid questionnaires were screened out. In order to ensure the quality of the questionnaire and the accuracy of the survey, the questionnaire has been revised many times and pre-survey, and at the same time, the researchers were trained on the questionnaire survey before the survey. Water saving irrigation technology adoption behavior. Water saving irrigation technologies for grain production mainly include six agronomic or engineering technical measures such as drought-resistant varieties, mulching, stubble no-tillage, surface pipelines, sprinkler irrigation, drip irrigation, etc. (Tang et al., 2016) [7], and the water saving irrigation technology adoption behavior variable was measured by whether farmers adopted at least one water saving irrigation technology. farmers’ water scarcity perception as the instrumental variable of farmers’ water saving irrigation technology adoption behavior. It should be noted that farmers’ perception of water scarcity is highly correlated with water saving irrigation technology adoption behavior, the more scarce water resources farmers believe, the higher probability of farmers adopting water saving irrigation technology, while the perception of water scarcity does not directly affect the income level of farmers, so the selection of the instrumental variable is in line with the requirements of relevance and exogeneity. Farmers’ household income. Farmers’ household income includes agricultural income and non-farm income, of which agricultural income is from food sales and subsidies after deducting labor costs and material costs, and non-farm income is wage income. Other variables. Individual characteristic variables such as age, education and risk attitudes, and household characteristic variables such as planting years, planting scale, labor size, social network, and cooperatives membership are added to the model. Instrumental variables. There may be a mutual causality endogeneity problem between farmers’ water saving irrigation technology adoption behavior and farmers’ income, and farmers’ water saving irrigation technology adoption behavior requires a certain economic cost, the higher level of farmers’ income, the higher probability of adopting water saving irrigation technology. In this paper, we selected Table 1 reports the variable definitions and descriptive statistics results. From the results of the data statistics, it can be seen that 33.9% of all samples of farmers have adopted water saving irrigation technology, the average age of head of the sample farmers is 51.024 years old, the average education years of the household head is 8.308 years, the risk attitudes of the farmers’ households are concentrated in the range between neutral and averse degrees, the average planting years are 26.646 years, the average planting scale is 10.683 mu, and the average farmers’ household laborers are 2.109, the average proportion of family gift expenditure to family income after taking the natural logarithm is 7.689, the proportion of farmers’ household choosing to cooperatives is 8.4%, and the level of perception of water scarcity in farmers’ household is concentrated between average and more severe. join Since farmers’ water saving irrigation technology adoption behavior is a 0-1 variable, the probit model was used to analyze the influencing factors of farmers’ water saving irrigation technology adoption behavior, while the OLS model was used for comparison. Table 2 reports the estimation results. From the Probit estimation results, it can be showed that the education years of household head has a significant positive effect on the adoption behavior of farmers’ water saving irrigation technology, indicating that the higher the level of education, the more farmers realize the importance of water saving irrigation technology in saving costs and increasing yields, and the more they are willing to adopt water saving irrigation technology. The coefficient of planting scale is significantly positive at 1% level, indicating that planting scale can significantly increase the probability of farmers’ water saving irrigation technology adoption behavior, water saving irrigation technology generally has a higher cost, the larger the planting scale of the farmers, the better the burden of adopting water saving irrigation technology, and the better to play the role of economies of scale. Cooperatives membership has a significant positive effect on the adoption of water saving irrigation technology by farmers, indicating that cooperatives can promote the adoption of water saving irrigation technology by providing the latest technology information to member farmers and publicizing the advantages of water saving irrigation technology in saving water and increasing production. The coefficient of social network is significantly positive, indicating that the social network promotes the adoption of water saving irrigation technology by first adopting farmers, thus contributing to the adoption behavior of water saving irrigation technology. The perception of water scarcity has a significant positive effect on the adoption behavior of water saving irrigation technology, indicating that farmers believe that the more scarce water resources are, the higher the possibility of adopting water saving irrigation technology, and that water saving irrigation technology, as a resource saving technology, water scarcity can motivate farmers to adopt water saving irrigation technology.",
    "Note: *, **, and *** indicate significant at the 10%, 5%, and 1% levels, respectively; robust standard errors are in parentheses. saving irrigation technology by farmers’ households can increase agricultural outputs, while will save labor to engage in non-farm industries and thus earn non-farm income, thus increasing total income. The OLS estimation method was used to analyze the impact of water saving irrigation technology adoption behavior on farmers’ income, and the stepwise regression method was used for comparison, and the IV regression method was used due to the possible endogeneity problem of mutual causality between water saving irrigation technology adoption behavior and farmers’ household income. Table 3reports the estimation results. The results show that water saving irrigation technology adoption behavior has a significant positive impact on farmers’ income, and all of them are significantly positive at the 5% level, and the coefficient of water saving irrigation technology adoption behavior rises after the instrumental variable method is used to deal with the endogeneity problem, which indicates that if the endogeneity problem is not taken into account, the impact of water saving irrigation technology adoption behavior on farmers’ income will be underestimated. Adoption of water Among the control variables, the age of household head has a significant positive effect on farmers’ household income, which is due to the fact that the older the head of household is, the labor capacity decreases. The education years of household head has a significant positive effect on farmers’ household income, the higher the education years of household head, the higher the productivity and the greater the possibility of obtaining higher income. The labor size has a significant positive effect on farmers’ household income, the more labors the household has, the better it can engage in agricultural production, and at the same time, there is more surplus labor for off-farm employment, which leads to higher income. Social network has a significant positive effect on farmers’ household income. As a geo-society, social network can play an important role in rural areas, and richer social network can obtain more information, which can help to obtain higher income. Note: *, **, and *** indicate significant at the 10%, 5%, and 1% levels, respectively; robust standard errors are in parentheses According to the previous theoretical analysis, the adoption behavior of water saving irrigation technology affects farmers’ income by influencing factor inputs, therefore, the mediating effect model is applied to clarify the mechanism played by factor inputs between water saving irrigation technology adoption and farmers’ income, and the factor input variables include input factor costs such as irrigation water costs, input labor costs, pesticide and chemical fertilizer costs, and seed costs. Table 4 reports the estimation results. The coefficient of water saving irrigation technology adoption in model (1) passes the significance test, and the total effect of water saving irrigation technology adoption behavior affecting farmers’ income is 0.232. In the factor input equation of model (2), the adoption behavior of water saving irrigation technology has a significant negative effect on the factor inputs, which indicates that the adoption behavior of water saving irrigation technology can significantly reduce the cost of factor inputs, and save the production cost. The coefficient of water saving irrigation technology adoption behavior in model (3), farmers’ household income equation is significantly 0.338, in addition, the coefficient of water saving irrigation technology adoption behavior on factor inputs is significantly negative, and the indirect effect of the mediating variable is significant, which shows that at least part of the impact of water saving irrigation technology adoption on farmers’ household income is realized through factor inputs. Therefore, the direct effect of water saving irrigation technology adoption on farmers’ household income is positive, and the indirect effect of factor inputs is positive, indicating that the adoption of water saving irrigation technology not only has a direct improvement in farmers’ household income, but also indirectly improves farmers’ household income through factor inputs. Note: *, **, and *** indicate significant at the 10%, 5%, and 1% levels, respectively; robust standard errors are in parentheses Based on the sample survey data of grain farmers in Shandong, Hebei and Henan provinces, this paper uses Probit model to analyze the influencing factors of farmers’ water saving irrigation technology adoption behavior and further analyzes the effect mechanism of water saving irrigation technology adoption behavior on farmers’ income by using the Instrumental Variable method and the Mediating Effect Model, and the main conclusions of the study are summarized as follows: First, the regression results of influencing factors of water saving irrigation technology adoption behavior by farmers show that education years of household head, planting scale, cooperatives membership, and perception of water scarcity have a significant role in the adoption behavior of water saving irrigation technology by farmers.",
    "Second, the adoption behavior of water saving irrigation technology can significantly enhance farmers’ household income, and the regression results are still robust after the instrumental variable method is used to deal with the endogeneity problem, and the education years of household head, the laborers size, and the social network all have a significant role in promoting the income of farmers’ households, while the age of the household head has a significant negative effect on the income of farmers’ households. Third, the results of the impact mechanism of water saving irrigation technology adoption behavior on farmers’ household income show that water saving irrigation technology adoption behavior not only has a direct improvement effect on the income of farmers’ households, but also indirectly improves farmers’ household income through factor inputs. First, increasing the promotion of agricultural technologies such as water saving irrigation technology, improve the coverage of technical extension services, adopt technical training, agrotechnology publicity, policy subsidies, etc., through the provision of financial subsidies and policy support to encourage farmers to adopt water saving irrigation technology, improve farmers’ knowledge of water saving irrigation technology in saving water resources, improving yields, and protecting the environment, and increase the support for the initial investment in equipment and later maintenance. Increase support in initial equipment investment and post maintenance, and reduce the cost of water saving technology adoption by farmers. Secondly, actively encouraging and guide farmers to join cooperatives and giving full play to the advantages of cooperatives in technology promotion and information dissemination will help promote the adoption of water saving irrigation technologies by farmers. Third, water saving irrigation technology has a minimum scale requirement, through the adoption of land transfer and other ways to actively encourage farmers to expand the scale of cultivation, can play an important role in the economy of scale in the adoption of water saving irrigation technology by Fourthly, increasing human capital investment in rural labor, promote formal education, skills training and specialized technical guidance, further enhance the education level and scientific and technological quality of farmers, open up diversified income channels, and improve the self- development capacity of farmers."
]