[
    "How to cite this paper: Wan, Q., & An, Y. N. (2025). Digital Economy, Governmental Intervention and Industrial convergence: Evidence from Henan, China. American Journal of Industrial and Business Manage- ment, 15, 1019-1042. https://doi.org/10.4236/ajibm.2025.157049 Copyright © 2025 by author(s) and Scientific Research Publishing Inc. This work is licensed under the Creative Commons Attribution International License (CC BY 4.0). http://creativecommons.org/licenses/by/4.0/ Open Access With a panel data of Henan Province in China from 2014 to 2021, this study examines the role and mechanism of the digital economy on the integration of advanced manufacturing and modern service industries and analyzes the mod- erating effect of governmental intervention on the direct effect path. The study found that: (1) Digital economy can seriously promote the integration of the two industries and has significant heterogeneity in developed areas, heartland and higher levels of marketization which perform more prominently; (2) The digital economy enables the integration of the two industries through two in- termediary channels: improving technological innovation and reducing trans- action costs, with the former accounting for a higher proportion of indirect paths; (3) Governmental intervention plays an inverted U-shaped moderating effect between the digital economy and the two industrial convergence: the re- lationship between the integration of the two industries and the digital econ- omy is positively moderated when there is minimal government interference; When the intervention level is high enough, the relationship between the two is negatively regulated, even reversing the promoting effect between the two. The research conclusion is not only of great significance to understand the role of digital economy in China’s economic transformation, but also provides a to realize China’s manufacturing industry’s rising status in the global value chain, the industrial convergence is an inevitable decision. Industrial convergence has been described as a dynamic process of industrial convergence and evolution, re- ferring specifically to the continuous emergence of new business forms and struc- tural configurations through the interactive penetration of two or more industries (Lu, 2016). This study focuses on the convergence between advanced manufactur- ing and modern service industries (hereinafter referred to as “the two industries”). The 20th National Congress of China pointed out the need to “promote an in- depth melding of modern service industries with advanced manufacturing and modern agriculture”. In recent years, the two industries’ integration in China has deepened and intensified. However, it still faces problems such as insufficient depth, low level, institutional mechanisms and policy environment constraints. It is still necessary to strengthen the two industries’ integration’s leading and sup- porting roles in China’s excellent social and economic development (Hu, 2023). In today’s era, digital technologies are the forerunners of the world’s scientific and technical revolution and industrial change, as well as the key areas of a new era of global rivalry. Digital is becoming a core production factor to promote eco- nomic growth, and industrial convergence has become increasingly important in driving economic development. Data from “China Digital Economy Development Research Report (2023)” published by the China Communications Academy shows that in 2022, China’s digital industrialisation scale got to 9.2 trillion yuan and the scale of industrial digitisation reached 41 trillion yuan, of which the digital economy penetration rate of the second and third industries was 24.0% and 44%. The gap between the penetration rate of the two industries was further narrowed, forming a pattern in which the digitalisation of industry and services is jointly driven. The digital economy is now a key component of industrial convergence and a growth driver. Additionally, the academic community generally believes that the economic rules of local government are the main reason for existing bar- riers to entry between different industries (Tadayoni & Skouby, 1999). When fa- vourable external conditions arise owing to the introduction of supportive policies or deregulation by the government, enterprises try to continuously break the boundaries between different industries under the principle of profit maximiza- tion, resulting in the spillover of industrial functions, which enables the mutual integration of different industrial functions and supports the integration of indus- tries. Hence, it can be said that government intervention is a favourable external Despite the fact that the positive effects of the digital economy are expanding quickly in the application space, little is known about the mechanism underlying its influence, how the two industries integrate, and how the government plays into all of this. Is it possible for the digital economy to encourage the merging of these two sectors? If so, what steps can we take to encourage the two industries’ inte- gration? In the context of the digital economy, what part does the government play? None of these questions has been conclusively answered currently. Based on this fact, the following elements of this study’s marginal contribution are repre- sented. First, refer to the existing literature on the building and measurement of the digital economy index system and the integration of the two industries, ex- plaining the factors affecting the integration of the two industries from different dimensions when discussing the relationship between the two industries, and fur- ther excavating the mechanism of the enabling effect of the digital economy on the growth of the integration of the two industries. Second, the two indicators of technological innovation, as well as transaction costs, are chosen as mediating var- iables to make clear the distinctive path of the digital economy to promote the integration of the two industries. Third, the indicator of government intervention is chosen as a moderating variable to analyze the role played by the government in the digital economy to empower the integration of the two industries.",
    "The digital economy refers to a set of economic activities in which data resources are regarded as key factors of production, the modern information network serves as a crucial infrastructure, and the effective use of information and communica- tion technology (ICT) acts as a major driving force to enhance efficiency and op- timize economic structure (Xia et al., 2023). Firstly, the platform effect of the dig- ital economy has fostered new business models and shifted consumer demands, driving integration between manufacturing and services. To meet diverse and per- sonalized needs, manufacturers extend their value chains and incorporate up- stream and downstream services, achieving “product + service” integration (Miao, 2021; Ma et al., 2025). Secondly, data resource sharing has become a key compet- itive strategy in industry integration. By leveraging big data and IT, manufacturers and service providers can gain greater profits and strengthen collaboration, thereby deepening integration (Büyüközkan & Göçer, 2018). Thirdly, digital ele- ments’ value-added impact drives industrial integration by empowering enter- prises to reintegrate supply chain networks and enhance value creation through innovation chain optimization (Korder et al., 2024), which makes it possible for manufacturing and services to form a variety of combinations, enhances the abil- ity of enterprises to create new products and services, and injects new momentum Apart from the direct impact of the digital economy on the integration of the two industries under its characteristics, the essential features of the digital economy, which involve intertemporal transmission, exchange of data, and cost manufac- turing and reduction, increase the likelihood that the digital economy will increase the integration of the two industries through internal factors such as technological innovation and transaction costs. The influence channels discussed above are shown in Figure 1. (1) Technological innovation. The digital economy mainly promotes techno- logical innovation through the factor reorganization effect, market competition effect and knowledge spillover effect, and thereby improves the integration level of the two industries. On the one hand, digital technologies enhance the efficient flow and allocation of production factors, optimize enterprise resource utilization, and serve as a foundation for technological innovation (Tian et al., 2023). On the other hand, the digital economy also facilitates knowledge spillovers, enabling em- ployees to access and absorb external knowledge more effectively, thereby strength- ening firms’ capabilities for personalized services and product innovation (Song, Ming, & Wang, 2013; Li, Ye, & Zhang, 2023). Moreover, digital finance and skilled labor matching further improve innovation efficiency and promote the transfor- mation of manufacturing towards service-oriented models (Del Giudice et al., 2019; Tao et al., 2018). Technological innovation, in turn, drives the convergence of manufacturing and services by blurring industry boundaries and fostering common technical foundations, ultimately reinforcing industrial convergence (Lei, 2000). Hypothesis 2 (H2). The digital economy boosts the integration between the two industries by increasing the level of technological innovation. (2) Transaction costs. The digital economy mainly improves the level of inte- gration between the two industries by reducing transaction costs through such channels as shortening the time-space distance, developing dynamic pricing strat- egies, changing the structure of transaction costs, and building a digital credit sys- tem. Firstly, it reduces intermediate costs. Digital technologies shorten spatial- temporal gaps between production and consumption, replacing traditional verti- cal hierarchies with platform-based models that streamline intermediary links (Li & Zhao, 2024). Secondly, it reduces the costs of decision-making, bargaining and information search. By refining information flow and implementing dynamic pricing, digital systems eliminate reliance on fixed pricing mechanisms, enabling precise customized pricing and reducing costs arising from information asym- metry, bounded rationality, and opportunistic behavior (Liu et al., 2024; Wang et al., 2024). Thirdly, it reduces the matching cost. Internet technologies near-elim- inate market research expenses, revolutionizing transaction cost structures through efficient product-service matching (Liu et al., 2022). Fourthly, it reduces the cost of trust. Algorithmic transparency and digital credit systems enhance product/ser- vice visibility, reducing supply-demand trust barriers and increasing consumer confidence (Lu et al., 2020). Transaction cost reduction establishes sustainable mechanisms for manufacturing-service sector interaction by accelerating indus- trial synergy integration (Eswaran & Kotwal, 2002; Liu et al., 2017). As Liu et al. (2022) confirm, digital technologies achieve this through cost-lowering effects that drive sectoral convergence. Therefore, the present paper puts forth the fol- lowing hypotheses: From the standpoint of national conditions in China, the development of the dig- ital economy and the integration of manufacturing and services are closely tied to the actions of local governments. Tools such as financial subsidies, tax adjust- ments, regulations, and industrial policies have long been key drivers of China’s economic growth. Government intervention plays a vital role in both the integra- tion of these two industries and in supporting digital economic activities. The in- tegration process must navigate various external uncertainties, making digital support essential. Government policies align with this need by enhancing the abil- ity to respond to external changes. Research supports this view: government in- tervention significantly impacts the productive service sector (Jiang & Shi, 2023); fiscal subsidies can accelerate the digital transformation of manufacturing (Sun, Sun, & Wang, 2024); and the Internet’s impact on service industries is influenced by government actions (Xu et al., 2023). Moreover, government involvement shapes the role of manufacturing within the digital economy (Li, Zhang, & Li, 2024). However, excessive government intervention can lead to inefficient re- source allocation and may negatively affect the integration of the two industries. Therefore, this article argues that there may be a nonlinear regulatory effect from government interference between the digital economy and the merging of the two industries.",
    "Firstly, the development of the digital economy depends heavily on strong dig- ital infrastructure, efficient resource allocation, and skilled talent. These elements require active government involvement. Through initiatives such as special fund- ing, support for platform-based and diversified digital markets, enhancement of platform search and matching capabilities, and high-level talent programs, the government provides essential support for digital infrastructure, driving the growth of the digital economy (Liang & Li, 2023). At the same time, data—while a key competitive asset for digital platforms—can be misused by monopolistic players to block data flow, distort resource allocation, compromise consumer pri- vacy, and reduce the effectiveness of digital technologies in meeting consumer needs. Government intervention through anti-monopoly regulation and digital taxation helps address these market failures and supports the healthy integration of digital technologies into industry (Li, Li, & Tao, 2023). Moreover, moderate deregulation is a prerequisite for integrating the digital and real economies. It fa- cilitates more efficient resource use, encourages market competition, and fosters innovation, leading to new models and forms of industrial convergence (Pan, Huang, & Jin, 2023; Zhang & Zhao, 2024; Porter, 1980). However, excessive gov- ernment intervention can lead to diminishing returns. Beyond a certain point, it may distort market resource allocation, hinder innovation, and disrupt the inte- gration of digital and traditional industries. Thus, striking the right balance in in- tervention is crucial for promoting both digital economy growth and industrial Hypothesis 4 (H4). Government intervention plays an inverted U-shaped reg- ulatory role between the digital economy and the two industries integration. Spe- cifically, when the level of government intervention is small, it positively moder- ates the connection between the digital economy and the two industries integra- tion; the relationship is negatively moderated when government intervention is large. Benchmark model. To confirm how the digital economy affects the integration of the two industries, we set up the following benchmark regression model: In Equation (1): ,i t and it ic describe the province, the year and the integra- tion of the two industries, respectively. dige is the digital economy. itX rep- it resents control variables. In addition, tδ and iθ represent the time-fixed effect and city-fixed effect respectively, and itε signifies the random error term. Mediation model. We build the following effect mediation models to test whether technological innovation is the mechanism via which the integration of the two industries is impacted by the digital economy: In Equation (2) and (3): innov is technological innovation; if the digital econ- omy can facilitate the integration of the two industries by improving the techno- logical innovation, then 0β > and 0β > . Mediation model. We constructed effect mediation models to test whether transaction costs are the means by which the digital economy influences the two industries’ integration: In Equation (4) and (5): cost is transaction cost; if the digital economy re- duces transaction costs and promotes integration between industries, then 0β < and 0β < . Moderating model. We construct the moderating effect model to study the moderating connection of government intervention on the digital economy’s in- fluence on the integration of the two industries. Referring to (Haans, Pieters, & He, 2016; Miller, Stromeyer, & Schwieterman, 2013), the following moderating effect models are constructed by introducing dige × gov and dige × gov 2 : In Equations (6) and (7): gov represents government intervention. If 2R of the model (7) is greater than that of the model (6), it indicates that government ac- tion has a moderating effect on the integration of the two industries. If 3 0γ > and 3 3 0γ < , passing the significance test of the coefficient, it can be demonstrated that 4 government intervention has an inverted U-shaped moderating role in the effects of the digital economy on the merger of the two industries. And in the econometric regression results, the partial derivative of the digital economy ( dige ) on the two it industries integration ( ic ) is the adjusting effect of government intervention on it the connection between the two is reflected in the ( 3 β β + 3 gov + 3 β gov 2 ). Explained variable. Integration of the two industries ic . To ensure a scientific and systematic reflection of the development status of the two industries and to meet the matching and corresponding evaluation indicators of the two industries, we draw reference from Zhang et al. (2025) and use the coupled coordination model to quantify the degree of integration between two industries. The paper constructs first-level evaluation indicators from three aspects: industrial scale, in- dustrial base and industrial structure. It selects 16 second-level indicators to create an assessment index system. Detailed indicators are displayed in Table 1.",
    "Firstly, the advanced manufacturing industry and the modern service industry are first assessed for their respective levels of comprehensive development. The degree of coupling between the two industries is then determined by applying the coupling coordination model. The coupling coordination model is as follows: In Equation (8): 1U and 2U are comprehensive order parameters of the ad- vanced manufacturing and modern service industry, and C is the system cou- n =∑ Uλ U pling degree of the two. The value of C is between 0 and 1. 1 1 j 1 = 1 j n n n ∑ ∑ =∑ 1jλ and 2 jλ are the index weight = λ λ λ = 1 U 1 , ; ; j j 2 2 2 j 11 = = = j 1 j j 1 coefficients of the two subsystems respectively, which are obtained by entropy method here. The model for coupling coordination is as follows: j , In Equation (9): D ( 0 D≤ ≤ 1 ) is the coupling coordination degree of the two systems, which measures the level of integration between industries. A higher level of D means a higher level of integration between industries. T indicates the comprehensive coordination coefficient of the two industries. T = ∗ α U 1 + ∗ β U and α β+ = . α and β respectively refer to the proportion of advanced man- 1 ufacturing and modern services, and 0.4α= , 0.6β= . 2 , We categorize the advanced manufacturing and modern services using classifi- cation standards from the State Administration of Taxation, the Ministry of Fi- nance, and the ‘13th Five-Year Plan’ Scientific and Technological Innovation and Transformation Plan for Modern Service Industry published in 2017. Core explanatory variable. Digital economy dige. These eight indicators cover the core dimensions of industrial penetration, infrastructure and innovation ca- pability of the digital economy. They complement each other and constitute a comprehensive and systematic evaluation framework, which can accurately reflect the development level of digital economy at the technical, industrial and social levels. Using SPSS software, factor analysis was used to perform dimensionality reduction on the eight indicators in Table 2, and two common factors with a cu- mulative contribution of 78.49% were obtained. After performing orthogonal ro- tation, the indicators can be classified into two categories based on their loadings on different factors. The first factor is digital infrastructure and innovation capa- bility, including indicators such as mobile subscription, total telecommunications business per capita, and patent application number. The second factor is the ap- plication depth of the digital industry, including the number of employees in in- formation transmission, software and information technology services, and digi- tal inclusive finance. The specific factor loading matrix is reported in Table A1 of the Appendix. Finally, the advancement stage in the digital economy is calculated using the following formula: In Equation (10): w is the contribution rate of the factor and f is the component score coefficient of the factor. Mediating variables. Technological innovation (innov). Patents contain valua- ble information about technology, inventions, and inventors, and can provide in- sight into the level of technological innovation. They are often used in research due to their accessibility and generalizability (Acs, Anselin, & Varga, 2002). This paper evaluates technological innovation by calculating the ratio of weighted pa- tent filings relative to the overall population of a region. The weighted count of patent applications is calculated by considering three categories of patents: inven- tion, utility and design patents. Each type is given a weight of 0.5, 0.3, and 0.2, respectively, based on their degree of innovation. This approach provides a more comprehensive and realistic reflection of each region’s patent output level. Transaction cost (cost). Transaction costs are the expenses involved in conduct- ing economic transactions. In the study of Feng (2009), operating costs are used to measure transaction costs. While production operating expenses and transac- tion costs are not identical, they share a growth trend and can partially explain transaction costs. Variable substitution is a viable method. Moderator variables. Government intervention (gov). In the paper, Zhao and Yan (2024) tested government intervention utilizing a percentage of fiscal ex- penditure to GDP in each provincial and municipal area, with a higher ratio indi- cating stronger government intervention and vice versa.",
    "an impact on the integration of the two industries when testing the hypotheses. Economic development (pgdp) is assessed by GDP per capita; Foreign investment (foin): is defined as the total level of foreign investment in each region during the current year; Infrastructure (asset): quantify the ratio of fixed asset investment to regional GDP; Industrial structure (indu) is quantified as the percentage of the gross product of the tertiary sector to the gross product of the secondary sector; Resident income (wage) is the average wage of residents. Data sources and descriptive statistics. This paper makes panel data from 17 perfecture-level city between 2014 and 2021. The data are taken from Henan Ter- tiary Industry Statistical Yearbook and National Bureau of Statistics. Missing data is interpolated using the linear interpolation method. Table 3 gives the descriptive statistical outcomes for the main variables. The mean value of ic is 0.348, with variances of 0.151. Thus, the level of integration of the two industries has some variations. The mean and variance values of the digital economy are 0.016 and 0.937, respectively, showing that there are significant var- iations in digital economics across different provinces. Conversely, the values are within a respectable range, as shown by the descriptive statistics of the moderator, mediating and control variables. We test for multicollinearity by calculating the variance inflation factor (VIF) for all predictor variables. As shown in Table A2 of the Appendix, all VIF values are far below the threshold of 10, indicating that multicollinearity is not a problem in this model. This research takes a general-to-specific strategy to examine how the digital econ- omy and different control variables have an impact on the integration of the two industries. We begin by conducting a regression analysis on the core explanatory and explained variables, followed by the gradual addition of control variables. Ta- ble 4 summarizes the regression findings. Note: *, **, and ***respectively represent significance at the significance level of 10%, 5%, and 1%, with the t-statistic of the estimate in parentheses. The same applies hereinafter. The correlation between the digital economy and the integration of the two in- dustries is displayed in Table 4 by the information displayed in Column (1). The coefficients of dige are considerably positive at the level of 1%, showing that the digital economy can improve the integration of the two industries. Control varia- bles are shown in Columns (2) through (6) of the regression observations. The dige coefficients are significantly positive, implying that the parameter estimates for the core explanatory variables are robust. This further confirms the value of digital economy in facilitating the integration of the two industries. Therefore, hypothesis 1 is valid. The above results offer theoretical guidence for Henan Prov- ince to accelerate the new kinetic energy by integrating the two industries and accelerating the digital economy. Digital economy is developing quickly due to the widespread use of new-generation information technologies like cloud stor- age, 5G, large amounts of data, the internet, and robotics, and continuous break- throughs and innovations are made in terms of development speed, development scale and scenario application, providing impetus and ideas for two industries to overcome the value chain’s “low-end lock” conundrum. The estimated coefficient of economic development during the data collection period is positive and passes the significance degree test of 1%, according to Table 4’s empirical assessment of the control variables in Columns (6). This suggests that a feasible external economic environment is provided by the level of eco- nomic development for the integration of the two industries. Foreign investment has a favorable effect on the integration of the two industries, as indicated by the estimated coefficient of the level of foreign investment, which is significantly pos- itive. The reason may be that the cooperation between foreign trade enterprises and domestic reproduction, research and development, sales and so on, makes the whole value chain more complete and orderly. Through cooperation with foreign enterprises, domestic enterprises continuously improve their position and added value in the industrial chain, and then open up new potential for the integration of the two industries. The estimated coefficient of fixed assets is significantly neg- ative, which inhibits the integration of the two industries. The reason may be that the specificity of fixed assets is strong, and the cost of reconfiguring these assets for service-related business activities is high. The calculated coefficient of indus- trial structure is notably negative, revealing that, to some extent, an increase in the share of secondary industry raises the need for technical innovation in production processes and processes, thus inhibiting the integration of the two industries. The conclusion that raising residents’ living conditions unilaterally will not be suffi- cient to effectively promote the merger of the two businesses is supported by the calculated coefficient of residents’ income, which is not substantial.",
    "Endogeneity tests. The digital economy and the merging of the two sectors might be causally related in both directions. On the one hand, the digital economy fos- ters the deep integration of the two industries is by facilitating the movement of factors between regions through platform, sharing, and value-added effects. On the other hand, regions with a high degree of integration of the two industries tend to have a more complete industrial system. Additionally, the level of digital economic innovation ability and digital infrastructure affects the development and diffusion process of digital technology, which in turn impacts the level of in- dustrial digitalization. Referring to the practice of Nunn and Qian, this paper uti- lizes the method of instrumental variables to handle potential endogeneity issues, such as two-way causality (Nunn & Qian, 2014). An instrumental variable for the digital economy is the interaction term between the number of landline phones per 100 persons in each city in 1984 and the total number of Internet broadband ports in Henan from 2014 to 2021. The specific regression results are provided in Table A3 of the Appendix. This variable is then put via 2SLS regression. The Kleibergem-Paap rk LM statistic in Table A3’s Column (1) demonstrates that it has a level of statistical significance of 1%, meaning that the chosen instrumental factors are not inadequately identified. Weak instrumental variables do not pre- sent a concern, as indicated by the Cragg-Donald Wald F statistics, which is greater than the 10% crucial value. The digital economy’s regression coefficient for the integration of the two industries is noticeably positive, suggesting that en- Robustness test. The specific regression results are provided in Table A3 of the Appendix. First, we replace the core explanatory variable. By reconstructing the early digital economy indicators and applying the entropy method instead of fac- tor analysis, we reassess the impact of the digital economy on industrial integra- tion. The results in Column (2) of Table A3 are consistent with the baseline re- gression. Second, we replace the estimation method. To avoid potential serial au- tocorrelation caused by the cumulative effect of industrial integration, we adopt the system GMM model within a dynamic panel framework. Column (3) of Table A3 demonstrates that the regression coefficient of the digital economy on two- industrial convergence is remarkably positive, and the model’s validity and stabil- ity are supported by the findings of the Hansen and AR tests. Further validating the accuracy of the system GMM results are the results in column (4) of Table A3, which use the one-period delayed digital economy as an instrumental variable for the 2SLS regression. Both methods confirm the robustness of the above results. Finally, Removal of outliers. This study uses a 1% and 99% shrinkage in the tail for sample variables to test whether the sample outliers have a meaningful effect on the outcomes. According to Table A3’s column (5) data, the estimated coeffi- cient of the two industries’ integration in facilitating the digital economy is still The specific regression results are presented in Table A4 of the Appendix. First, heterogeneity in economic development. Cities differ significantly in economic foundation, digital infrastructure, and labor quality. To explore this, the 17 cities in Henan are divided into 9 developed and 8 underdeveloped cities based on 2021 GDP rankings. Columns (1) and (2) in Table A4 show that the digital economy significantly promotes industrial integration in developed cities. In contrast, alt- hough the coefficient remains positive in underdeveloped cities, it is not statisti- cally significant. This may be due to weaker infrastructure, limited innovation ca- pacity, and lack of policy support in those areas. Second, heterogeneity in urban location. Based on adjacency to the provincial capital, the cities are grouped into 7 central and 9 peripheral cities. Results in Col- umns (3) and (4) show that the digital economy has a stronger effect in central cities. This may result from better infrastructure, higher innovation levels, and earlier digital transformation in central areas, whereas peripheral cities lag behind in these aspects. ronment helps the digital economy allocate resources efficiently and promote in- tegration. Using the marketization index by Fan Gang, regions are divided into high and low marketization groups. Columns (5) and (6) show that the digital economy significantly facilitates integration in highly marketized regions, but the effect is insignificant in regions with weaker market development. This suggests that inadequate market mechanisms may hinder the digital economy’s role in driving industrial integration.",
    "Mediating effect of technological innovation. Table 5, columns (2) and (3) exam- ine the mediating influence of technological innovation. The findings reported in column (2) reveal that the digital economy has a considerably beneficial effect on technological innovation at the 1% level, implying that a higher level of digital economy growth is more conducive to technological innovation. The regression coefficient of technological innovation in column (3) is highly positive, suggesting that greater technological innovation can facilitate the integration of the two busi- nesses. Simultaneously, the regression coefficient of the digital economy is found to be lower than that of column (1), indicating that technological innovation acts as part of the mediating the relationship between the integration of the two indus- tries and the digital economy. Numerically, the size of the mediating effect is about 0.043, which accounts for about 0.3196 of the total effect, indicating that technological innovation can ex- plain 31.96% of the expanision of digital economy development in fostering the integration of the two industries. That is, the mechanism is “developing digital economy → improving technological innovation → promoting the integration of the two industries”. In addition, the article carried out the sgmediation mediation effect test, the results show that the Sobel test, Goodman1 test and Goodman2 test are significant, so hypothesis hypothesis 2 is supported. Mediating effect of transaction costs. In Table 5, columns (4) and (5) test the mediating effect of transaction costs. The regression coefficient of dige in column (4) is not positive and passes the significance level of 1%, indicating that the growth of the regional digital economy contributes to the reduction of transaction costs in the region. The data in column (5) indicate that generating more transac- tion costs is not favourable to the integration of the two industries, as the regres- sion coefficient of transaction cost is strongly negative. Additionally, the value of the digital economy decreases compared to the first step, implying that the digital economy and industrial convergence are partially mediated by transaction cost. The mediation effect is numerically 0.005, account- ing for 3.6% of the total effect, indicating that transaction costs may account for the hindrance to the digital economy’s growth in terms of the two industries’ in- tegration. The mechanism is “developing digital economy → decreasing transac- tion cost → improving integration of the two industries”. In addition, the signifi- cance of the Sobel test, Goodman1 test, and Goodman2 test meet the require- ments. We conducted a robustness test using the level of financial development as a proxy variable for transaction costs. However, it is important to note that there is an inverse relationship between the level of financial development (fd) and transaction costs. In other words, transaction costs decrease as the level of finan- cial development increases. By observing the regression results in columns 6 and 7 of Table 5, it was found that it significantly passed the robustness test. The hy- pothesis 3 is supported. According to the above theoretical analysis, the digital economy and the merging of the two sectors may be moderated by government involvement in the form of an inverted U. Based on the regression findings of columns (1) and (2) of Table 6, the value of the digital economy increases slightly after the government interven- tion index is added, but it remains highly positive, and the value of the regression model increases from 0.135 to 0.087. This implies that the relationship between the digital economy and the merger of the two industries is moderated by govern- ment involvement. Government intervention has a beneficial adjusting effect that only affects the magnitude of the positive spillover influence of the digital econ- omy on the integration of the two sectors, but not its direction. However, the ad- justing effect of government intervention increases the elasticity of the digital economy to the integration of the two industries, making it more sensitive to such integration. The determination coefficients of columns (3) and (4) show that model (4) is superior to model (3), indicating that government intervention has a nonlinear moderating effect. According to column (4)’s regression results, there is a significant positive correlation between the digital economy and government intervention, and a significant negative correlation between the digital economy and government intervention squared. It demonstrates how government action has an inverted U-shaped moderating influence on the relationship between the digital economy and the merger of the two industries. Specifically, a modest level of government intervention has a positive moderating effect on the digital econ- omy and the integration of the two industries; that is, as government intervention increases, the positive impact of the digital economy on the integration of the two industries is somewhat amplified. When the government intervention continues to increase, the relationship between the digital economy and the integration of the two sectors is negatively moderated, that is, as the government intervention further increases and exceeds the optimum range, the government intervention weakens or even reverses the positive impact of the digital economy on the con- vergence of the two industries. So hypothesis 4 is supported.",
    "Table 6’s column (5) contains the dynamic GMM model’s estimation results. The P-values of AR (1), AR (2) and Sargan assays imply that there is no second- order autocorrelation in the disturbance term and no over-identifying problem in the instrumental variables. The dynamic GMM model is in accordance with the previous regression analysis. The interaction term between the digital economy and government intervention square remains still significantly negative, indicat- ing that the regression evidence continues to be robust, and the moderating role of government intervention remains inverted U-shaped. In addition, the esti- mated coefficient of the one-period lag of the digital economy is highly consistent and positive at the level of 1%, meaning that the digital economy of the previous period has a greatly positive impact on the growth level of the current digital econ- omy. Therefore, it seems sense to incorporate the inertia effect into the model. This paper draws a regulatory effect diagram to clearly observe the regulatory effect of government intervention. According to Table 6 column (4), the variables containing the digital economy in the regression model are merged into the same phase, as shown in formula (11). From the regression results of Column (4), 4 β = 1 0.077 , 4 β = 3 0.237 , 4 β = − 4 0.171 , it can be seen that the regression coeffi- cients are substituted into Equation (11), and the regression models are all stand- ardized regression models, and the inverted U-shaped adjustment effect diagram of government intervention is drawn, as shown in Figure 2. It can be seen that there is a threshold for the impact of government intervention. On the left side of the threshold, the slope of the relationship between the digital economy and the integration of the two industries continues to increase, indicating that the im- provement of government intervention can strengthen the positive impact of the digital economy on the integration of the two industries. However, when govern- ment intervention exceeds a certain threshold, the slope of the relationship be- tween the digital economy and the integration of the two industries begins to de- cline, and finally presents a negative impact on the integration of the two indus- tries, indicating that government intervention weakens the positive impact of the digital economy on the integration of the two industries. Using the panel data of prefecture-level cities in Henan Province from 2014 to 2021, mediating, and moderating effects of the digital economy promote the inte- gration of the two industries. It also reveals the mechanism by which the digital economy promotes the integration of the advanced manufacturing industry and modern service industry. The following are the primary conclusions: Firstly, the direct effect shows that the development of the digital economy greatly fosters the integration of the two industries. Following the inherent con- cerns of the instrumental variable approach and robustness test, the substitution of key explanatory variables, the replacement of estimating techniques, and the removal of outliers, this conclusion remains true. Secondly, the impact of the dig- ital economy on the integration of the two sectors is quite heterogeneous. The digital economy has a more significant role in fostering the integration of ad- vanced manufacturing and modern services in developed areas, heartland and higher levels of marketization. Thirdly, the digital economy not only has direct effects but also indirectly fosters the merger of the two industries through two mediating channels: transaction cost reduction and technical innovation promo- tion. Compared with transaction costs, the indirect path of technological innova- tion accounts for a higher proportion, with positive and negative mediating effects accounting for 31.96% and 3.6% respectively. Fourthly, the inverted U-shaped regulatory effect of government involvement also has an impact on the interaction between the digital economy and the merger of two industries in the direct effect tionship between the digital economy and the integration of two industries. This increases the elasticity of the digital economy to the integration of two industries, increases the sensitivity of the reflection, and partially strengthens the positive ef- fect. When the degree of government intervention deepens and exceeds the opti- mal value, it negatively regulates the connection between the digital economy and the integration of the two industries, making the positive effect of the digital econ- omy on the integration of the two industries weaken or even reverse to a certain extent.",
    "We would like to thank the anonymous reviewer for the extremely helpful sugges- tions and comments. We also wish to thank the editor for handling this paper. This research was supported in part by Henan Provincial Philosophy and Social Science Planning Project [grant number 2024CJJ135]; Postgraduate Education Reform and Quality Improvement Project of Henan Province [grant number YJS2022JD30]; Survey Research Topics of the Henan Science and Technology Think Tank [grant number HNKJZK-2025-65B]; the Nanhu Scholars Program for Young Scholars of XYNU."
]