[
    "Abstract: Against the backdrop of China's official rural revitalisation strategy, the development of village tourism in Henan has been fast-tracked, which has led to the destruction of village landscapes and the gradual disappearance of the original locally preferred landscapes. New village community squares lack cultural connotation. The design of village community squares lacks appropriate methods and sustainable development. This paper adopts the qualitative research method, sums up the valuable experience by analysing the relevant cases at home and abroad, explores the design of Henan villages community squares based on cultural identity, and puts forward the basic characteristics and design principles that the design logic of Henan villages community squares should have. It is hoped that the theoretical viewpoints of this study can contribute to the enhancement of cultural identity of village community landscapes in Henan Province, and at the same time provide a theoretical basis for the design and construction of villages community squares in Henan. to ignorance of the local culture, they are unable to feel the human connection. This has a negative impact on the village community [3]. The 19th National Congress of the Communist Party of China (CPC) formally put forward the strategy of rural revitalisation in its report, and called for different types of villages to be \"clustered and upgraded, integrated into towns and cities, protected by special features, and relocated and merged\", among other categorical construction ideas. Combining villages and residences is conducive to promoting the concentration of farmers, improving the life and living environment of the people, and realising the urbanisation of the countryside, the communalisation of residences, and the scaling up of agricultural operations [1]. Destruction of village landscapes. Various policy related developments have severely damaged many of the village landscapes, particularly cultural and natural features. This has resulted in major deficiencies in village landscape design in terms of local preference. In order to save the cost and time of landscape design, development layouts are usually blindly carried out in a modern way, focussing only on commercial design, resulting in the gradual disappearance of the original locally preferred landscapes [2]. New village community squares lack cultural content. As a result of the policy of accelerating and stimulating the development of village tourism, many large recreational squares or parks have been built to promote urbanisation activities that conflict with the village environment. For village communities, such developments without cultural connotations have no practical significance for the daily life of the community, and also reduce the utilisation of public space and destroy the unique culture of the village itself. Due The design of village community squares lacks a suitable approach and sustainability, and the gradual rise of development has led to many villages being provided with a common urban planning and design module, which has led to the loss of their own identity due to a lack of research and planning efforts, severely deteriorating the ecological environment of the villages [4]. Henan Province is known as the cradle of the Chinese nation and the root of its long history and culture. A number of cities in Henan have received worldwide attention for their deep historical and cultural significance. Among them, the cultural heritage and traditions possessed by cities such as Luoyang, Kaifeng, Anyang, Nanyang, Shangqiu and Zhengzhou are shining beacons of cultural resources in Henan Province. Over the past thousands of years, the natural geographical environment of Henan has objectively created the natural characteristics of simplicity; on the other hand, the people of Henan, who have long been in the political, economic and cultural centre of China, have been endowed with the unique historical characteristics of the people of Henan for thousands of years by the feudal orthodoxy, their ethical and moral concepts and the idea of a small peasant economy, and have formed a folk culture that is unique to the hinterland of China. The characteristics of Henan's folklore include the following: a farming-oriented ideology; a hard-working and simple folklore; open-mindedness and cheerfulness; an emphasis on The living style of Henan people Historically, they are known for their simplicity. Before the founding of the People's Republic of China, the people of Henan generally emphasised \"liveability and practicality\" in their living. People had a strong concept of \"settling down and moving in\". Cultural exchanges and recreational activities in Henan villages were mainly concentrated in community centres, where reading rooms, libraries, squares and pavilions became lively places for people to gather. The art of storytelling from ancient traditions also continues to be passed down in community centres, such as the pendant and Yu opera. These ancient musical arts are passed on and interpreted through the performances of folk art groups. During festivals and special celebrations, these groups present wonderful performances in community centres or village squares, attracting many enthusiasts who come to listen and keep the cultural traditions blossoming in joy.",
    "Ji Jiadun Village is located in the south of Jinxi Town, Kunshan City, Jiangsu Province, built in the 1980s, belongs to an ordinary rural settlement and lacks historical and cultural heritage.In 2016, the whole village was renovated to take advantage of its advantageous location on the outskirts of the city to create a rural leisure tourism place for urban crowds, and to attract local youths to return to their hometowns to start their own businesses through initiatives such as environmental remediation and the introduction of new industries, which empowers Ji Jiadun Village (Chen, 2022). Therefore, the core public space mainly satisfies the basic functional needs of tourists and their aesthetic needs for village life and culture. The core public space of the village is transformed from the old villagers to the new villagers from the city. Tourists replace villagers as the main users and residents of the village, and commercial consumption replaces production and labour, Ji Jiadun Village is no longer a settlement where villagers live for a long time, but a tourist resort transformed by capital, a temporary residence. Like Ji Jiadun village such a more typical case in the initial stage of China's rural revitalisation strategy there are indeed some very successful cases now become an example to get a lot of praise. But with the deepening of rural revitalisation, most of these rural transformation projects failed to withstand the test of reality, after a period of heat faded, leaving behind the devastation and double the scene of depression, the rapid decline in attention; urban tourists no longer patronise; foreign merchants fleeing, which did not bring economic and living conditions to the villagers to improve the destruction of their original habits, and also seriously damaged the original rural landscape and rural areas. This has not brought any economic and living conditions improvement to the villagers, but destroyed their original living habits and seriously damaged the original rural landscape and culture. Yangzigou village is located in Luanchuan County Government 10 kilometres east, the village is a national 4A scenic resort, because the Tang Dynasty heroine Fan Lihua camped in this, the only son to teach his son Xue Gang and named. The total area of the village is 14 square kilometres, with 4 groups of residents, 178 households and 725 people. The valley is orientated north-south, with abundant water and sunshine, the front hill, both sides of the open ground, flat terrain, fertile soil; the back hill, canyon landscape, plant species, lush growth. The village is rich in natural landscape and historical and cultural resources. Beautiful natural scenery, heavy culture of raising children, simple and honest folk style, hospitable villagers, to the majority of tourists home general experience, memorable. Yangzi Cultural Square is located in Yangzigou Village Yangzi field, covering an area of more than 20,000 square metres, is the Luanchuan County Government for the establishment of cultural identity; construction of beautiful, good, livable and blessed new Luanchuan and elaborate spiritual civilisation home. The project was started in November 2018 and completed in June 2019, and the square has five divisions: party building culture area; rule of law missionary area; tutelage culture inheritance area, Yiyin clean government culture area; leisure activities area. Novel design, construction of a unique cultural square, so that tourists enjoy the landscape, enjoy the food at the same time, experience the Fan Lihua child rearing and teaching the hardship and wisdom of the child, to appreciate the local history and culture of the thick and far-reaching. More for the village community residents to provide a communication and learning, fitness and sports, leisure and recreation, and other daily life of the village community square. Kanayama Town is located in the northeastern part of Yamagata Prefecture, Japan, with a total area of 161.67km2, of which forests account for 78% of the total area. It has hot and humid summers and snowy winters. With abundant cedar resources and convenient transport conditions, Kanayama Town has evolved from a post station in the past to a new age topped whitewashed wooden structures and natural scenery in harmony with the landscape have become the main perception of Kanayama Town (Xiao, 2022). The corner exchange square, which was built as the central square of Kanayama- cho, was constructed by using the open space left after the demolition of two dozos and the main house of the old folk houses. It is located at the L-shaped intersection of Tokamachi Street and Nanokamachi Street, which form the centre of Kanayama-cho. Since it is located in the centre of Kanayama- cho, the site was acquired as a resting place and native plants such as zelkova were transplanted. In order to create a square environment, a wooden veranda was installed at the edge of the open space. A reinforced concrete retaining wall was placed along the weir at the edge of the road to withstand the pressure of snow removal by snow removal trucks. The verandahs are built on one side on the basis of retaining walls with a span of 2.4 metres and are constructed using local timber as the main material. Benches are set up on the side of the retaining wall for villagers and tourists to take a rest, which is designed to serve as a guide for people to focus their attention on the square. Considering the affinity of the structure, the corridor components adopt a gentle arc. The square floor is paved with a concrete foundation and square granite blocks as the surface material, which are arranged in a radial pattern starting from the drainage outlet to divert The demographic structure of rural villages in Henan is developing towards diversification. In recent years, Henan countryside construction overly catering to the market and tourists demand, but ignored the rural community residents as the main body to understand their cultural identity and living habits, it is difficult to design a plaza to meet the needs of the rural community residents, not only destroyed the living environment of the rural community residents also destroyed the original cultural atmosphere with characteristics.",
    "Therefore, the design of Henan rural community square should return to the villagers' demands and local culture as the main requirements, taking into account to meet today's diverse demographic characteristics, to enhance the cultural identity of villagers and tourists' cultural experience, and to promote the harmonious development of rural society in the new era. Complexity of function is the basic characteristic of the village community square. In today's, Henan village community square in the function has been no longer in the old period of religious worship, clan culture and other spatial functions, more to the villagers' daily living habits as the core embodies stronger leisure, entertainment, sports, display, publicity, business and other functions, showing a multi- composite features and the inclusiveness of the demand for the use of space. Village community square design with culture as the entry point to influence the spatial layout of the village, condense the regional style, show the village community residents living picture of the space carrier, generally have more characteristic public buildings, a variety of functional types and landscape elements, highlighting the strong regionality and iconicity. Under the background of rural revitalisation, Henan village community square has become a visual symbol of material space in the village spirit and living culture. The spirit of place has a broad and profound meaning, which reflects the unique atmosphere and charm of a place. Among other things, it includes people's living habits, emotional attachment, collective memory, and the place's cultural traditions, architectural style, folk customs, social environment and other aspects (Guo, 2023). In addition to focusing on how to create rural speciality industries, we should also focus on how to create a more livable rural community living environment with unique cultural connotations. In the design of village community squares, we should rely on the unique natural attributes of Henan Province, while inheriting the farming culture, to create a unique charm of the spirit of the place, and thus enhance the cultural identity of the village residents. In the design of rural community square, we should not destroy the original resource advantages of the site under the premise of the site's natural environment as the basis for the creation of village community square, designed with regional characteristics of the village community square. In the design of rural community square in Henan, the landscape elements of village community square become the carrier of the inheritance and development of farming culture, and the farming culture provides inspiration for the landscape design of the village community square. Therefore, in the design of village community square, you can dig out the rich history and culture from the local rural architecture, customs and habits, historical legends, through the form of landscape to express, such as cultural wall, landscape sculpture, landscape promenade and so on. The design of the village community square needs to fully expand its intrinsic function to meet the spiritual life needs of community residents. In the process of design, it is necessary to consider the current lifestyle of the residents of the village community, people and the environment, and the relationship between tradition and modernity. On the basis of meeting the traditional needs of residents, create a village community square with a variety of functions to improve the quality of life of residents in the village community, thus triggering the cultural identity of users. Therefore, in the design of functional zoning should be a good functional positioning and reasonable division of space. For example, a communication and exhibition space can be added to the square to provide villagers with a venue for exchanges, gatherings, activities and creativity. To strengthen the fun and experience of the village community square in diversified forms, enriching their spiritual and cultural life. This will stimulate the villagers' in- depth cultural identity and participation, and revitalise the village community square. Confucianism and long human history. It should be emphasised and promoted in the design of village community square to create a healthy cultural environment in the village community. These valuable cultural heritages have important historical, artistic and cultural values. They are not only the continuation and inheritance of Henan culture is an important foundation for the design of village community square. In the design process should effectively combine the local material culture and intangible cultural resources. Material culture has strong visual properties. Some cultural elements can be directly applied, such as sculpture, stone carvings and so on. Others need to symbolise their material forms and apply them in the design of village community squares to build a village community square space with local cultural characteristics. Such as: local materials, artefacts, auspicious patterns, etc. Visual presentation of intangible culture, on the basis of fully meeting the life and psychological needs of village community residents, can be taken to reconstruct the layout of the place, increase the spatial experience of activities in the way of village community square design. The location of the village community square should take into account the overall planning of the countryside, the natural conditions of the site and the site's history, focusing on the cultural core areas in the village and according to the nature of the site to design different forms of square, in the form of plane composition design to give them the corresponding cultural connotation, Under the background of rural revitalisation strategy, how to maintain cultural identity in village square design has become an urgent problem in the design and construction of village community squares in Henan Province. This study mainly adopts observation research, text analysis, case study and place study in qualitative research method as research tools. Valuable experience is gained from three domestic and international cases. Through the study of the problem and the summary of the case experience, this study explores the design of Henan village community squares based on cultural identity, and proposes the basic characteristics that should be possessed by the logic of the design of Henan village community squares. The study concludes that in order to achieve cultural identity in the design of village squares in Henan, the following design principles should be followed: firstly, the spirit of place should be created by relying on the natural attributes; secondly, the spatial function should meet the needs of the aboriginal people; and thirdly, the culture should be presented visually in the design. It is hoped that the theoretical viewpoints of this study can make a positive contribution to the enhancement of the cultural identity of village community landscapes in Henan Province, and at the same time can provide theoretical help for the design and construction of village community squares in Henan Province."
]