[
    "How to cite this paper: Kong, X.M. and Feng, Z.Y. (2023) Evaluation Study on the Level of High-Quality Development of the Construction Industry in Henan Province of China. Open Journal of Applied Sciences, 13, 366-382. https://doi.org/10.4236/ojapps.2023.133030 Copyright © 2023 by author(s) and Scientific Research Publishing Inc. This work is licensed under the Creative Commons Attribution International License (CC BY 4.0). http://creativecommons.org/licenses/by/4.0/ (OMOMIT open Acces | Based on the data of the construction industry in Henan Province, China, from 2005 to 2020, the high-quality development level of the construction industry in Henan Province is measured. Firstly, this paper constructs the indicator system based on the high-quality development theory and the characteristic of the construction industry from seven dimensions: industrial scale, industrial efficiency, industrial benefits, industrial innovation, industri- al risk, industrial potential, and the green development of the construction industry. Secondly, using the global principal component analysis (PCA) me- thod to measure the high-quality development level. Thirdly, cluster analysis is applied to measure the relative changes of various dimensions in different stages. The results show that overall the high-quality development level of the construction industry in Henan province is increasing, but different indica- tors perform differently in various stages, and the changes in real estate poli- cies have a significant impact on this. Finally, based on these findings, we think it is better to reduce real estate dependence, promote the application of new materials and technologies and maintain the stability of real estate poli- cies. Henan Province, located in central China, is a province in China with a total pop- ulation of 99.4 billion people in 2020. In 2020, the construction sector in Henan Province generated a value-add of ¥528.331 billion, employed 2,876,700 indi- viduals, and levied ¥45.417 billion in taxes. These figures constituted 9.42% of the province’s GDP, 5.49% of its total employment, and 16.43% of its tax reve- nue. With its substantial contribution to employment, GDP, and taxes, the con- struction industry in Henan earns its place as a cornerstone of the province’s economy. Meanwhile, other industrial sectors rely considerably on the construc- tion industry to produce goods and services. For example, constructing infra- structure such as roads and bridges can facilitate the production of goods and services while creating employment opportunities for the people (Boadu et al, 2020) [1]. However, the construction industry in Henan currently faces significant de- velopmental difficulties, such as sluggish growth, financial strain, heightened op- erational risks, and low labor productivity. Furthermore, uncertainties caused by fluctuating raw material prices, uncertain demand, shifting consumer expecta- tions, inadequate waste management infrastructure, and misguided recycling techniques all lead to complexities in the construction industry (Aawag Mohsen Alawag et al, 2022) [2]. In the “14th Five-Year Plan” and beyond, high-quality development will be the dominant direction of economic and social development. Measuring the high-quality development level and exploring the future direction of develop- ment is of great practical significance. To promote the high-quality development of the construction industry in Henan Province, this paper constructs an index system including industrial scale, industrial efficiency, industrial benefits, indus- trial green, industrial innovation, industrial risk, and industrial potential, as- sessing the level of high-quality development with principal component analysis. Based on the local characteristics of Henan Province and the foundation of the construction industry, this paper innovatively incorporates industrial risk and potential into the indicator system. After measuring the overall high-quality de- velopment level, this paper conducts indicators’ comparative studies on different stages with cluster analysis. We find a close relationship between the high-quality development of the construction industry in Henan Province and the changes in real estate policies. Through exploring the causes of changes in different stages from a temporal evolution perspective, this paper provides a reference for Henan Province to formulate construction industry development policies in response to changing times and circumstances. This part compares and analyzes the literature from three aspects: the concept of high-quality development, the connotation of high-quality development in the construction industry, and the index system of high-quality development in the construction industry, respectively. Since the report of the 19th Communist Party of China National Congress made a significant judgment that China’s economy has shifted from “a stage of high-speed development to a stage of high-quality development,” academics have fully ex- High-quality development refers to a process of growth and improvement in an economy that prioritizes sustainability, inclusiveness, and resilience [3] (Zhang Jukuo, 2019). This development idea seeks to balance economic growth with so- cial and environmental considerations, ensuring that economic progress’s bene- fits are widely shared and do not come at the cost of long-term harm to com- munities or the environment [4] (Gao Peiyong, 2020).",
    "High-quality development often involves diversity and innovation, education investment and workforce development, and the creation of supportive policies and institutions [5] (Liu and Ling, 2020). It also often prioritizes measures to reduce inequality and support disadvantaged communities, as well as efforts to transition to a low-carbon, environmentally sustainable economy [6] [7] (Zhou Shaofu and Chen Yahui, 2022; Bai Xiuyong, 2022). In short, achieving multidi- mensional goals is a distinctive feature of high-quality development. The construction industry is a pillar industry of the national economy. High-quality development of the construction industry has also attracted much academic attention. In the context of a globalized industrial world, organizations in the construction sector need to be more active in pursuit of higher quality to fulfill the consumers’ demands and establish a long-term competitive advantage [2] (Aawag Mohsen, 2022). From the standpoint of fulfilling demands, Sun Jide (2019) [8] believed that the high-quality development of the construction indus- try must meet the needs of consumers and economic, social, and environmen- tally sustainable development. Wang Li (2020) [9] emphasized the flexibility and diversity of satisfying demands and believed that the high-quality devel- opment of the construction industry is oriented to satisfy the market demand and provides diversified, personalized, and high-quality products and services for the people in various means. From the perspective of “crisis impact”, Gao Huajian (2021) [10] believed that under the dual constraints of technological progress and resource bottlenecks, the construction industry must adopt a high- er quality, higher efficiency, more intensive, more environmentally friendly de- velopment model. Xiang Yong (2019) [11] argued that the high-quality devel- opment of the construction industry is the result of collaboration among the government, market, industry, and enterprises. Wang Zeyu et al. (2022) [12] also emphasized the crucial role of government governance in the high-quality de- velopment of the construction industry and believed that the improvement of the government’s comprehensive governance capability in areas such as strategic planning, policy-making, institutional innovation, service provision, and market supervision is the foundation for the high-quality development of the construc- The high-quality evaluation index system is built upon a logical understanding of high-quality development [13] [14] (Li Jinchang et a/, 2019; Wang Wan et al, 2022). The different understanding and measurement results in various evalua- tion indices. Concerning a specific industry, the index system is closely related to that industry’s characteristics and development plan. As for the construction industry, there are differences in the design of the indicator system due to the study area’s heterogeneity and the researchers’ different focus. Gao Huajian (2021) [10] used five dimensions, including the industrial foun- dation, construction products, social benefits, development pattern, and con- struction process, to measure the high-quality development of the construction industry. Yang Chengqian (2020) [15] used five dimensions: industry scale, in- dustry efficiency, technology and equipment, industry efficiency, and develop- ment potential. Wang Wenzhao (2019) [16] constructed an indicator system based on the “Innovation, Coordination, Green, Openness, and Sharing” (ICGOS) de- velopment concept and measured the level of development with the TOPSIS method. Yang Deqin (2020) [15] incorporated the construction industry's de- velopment into the evaluation index system based on the ICGOS development concept. The existing literature has provided analytical ideas for this paper, but there are two shortcomings: first, the industrial and product attributes of the construction industry are ignored. The construction industry, especially the housing con- struction industry, provides products that have both essential and investment properties. Both supply and demand sides are highly dependent on bank credit funds and are greatly affected by finance, credit, and national industrial policies. Therefore, industrial risks must be fully considered. Secondly, the influence of the regional economic development level on the development of the construc- tion industry is ignored. The development of the construction industry is closely related to economic growth, urbanization level, and increase in urban and rural residents’ incomes [17] [18] [19] (Li Xianguang, 2007; Cao Linjian et al, 2016; Wang Hongqiang ef al, 2022). Therefore, in assessing high-quality levels, we ought to consider the economy’s expansion, the urbanization potential, and the increase in rural and urban residents’ incomes. In this paper, two indicators of industrial risk and industrial potential are added to the indicator system. We hope that the indicator system and analysis results in this paper will provide a reference for the high-quality development of the construction industry in He- nan Province, China.",
    "not yet formed a unified cognition in the academic field. Based on existing lite- rature and the situation of the construction industry, this paper believes that the connotation of high-quality development in the construction industry should include controllable risks, good productivity and economic efficiency, steady improvement in scale, green and innovative development, good resilience and development potential despite facing greater difficulties. Based on the connotation of high-quality development and data availability, this paper constructs an evaluation index system containing industrial scale, indus- trial efficiency, industrial benefits, industrial green, industrial innovation, indus- trial risk, and industrial potential. Each indicator (see Table 1) and the selection basis are as follows. 1) Industrial Scale. The industrial scale refers to the size and output of a par- ticular industry sector, often measured by its total production value or employ- ment numbers. It reflects the level of economic activity and production capacity within that industry. In this paper, we choose the output value of the construc- tion industry (A,), the number of construction enterprises (A,), the number of construction employees (A), and the total assets of construction enterprises (A,) to measure the industrial scale. 2) Industrial Efficiency. Construction companies often have complex supply chains and construction processes, and ensuring that project equipment, prod- ucts, and materials are produced without rework and efficiency is an ongoing challenge [20] (AlMaian et a/, 2015). The construction industry generally has a long production cycle. Regardless of the characteristics of the project, construc- tion cost and schedule control are always considered to be the top priority in building construction [21] (Assaad et a/, 2020). Thus, construction efficiency (B,) and completion efficiency (B,) are selected to measure construction enter- prises’ start-up and completion efficiency, respectively. From the operation an- gle, the more efficient the enterprise is, the better it is at cost control. The main business cost rate (B;) is selected to measure the management efficiency of the enterprise, and the total labor productivity (B,) is selected to measure the overall production efficiency of the construction industry. 3) Industrial Benefits. Implementing total quality management in the construction industry can positively and directly impact project performance (Cherng-Yee Jong et a/., 2019). Industrial benefits include economic and social benefits. The profit rate of assets (C,) is selected to measure the overall return on unit investment, the return on shareholders’ equity (C,) is selected to measure the return to investors, and the employment share (C,) and the tax rate of output value (C,) are selected to measure the social benefits. 4) Industrial Green. Construction production in the building industry re- quires a large amount of industrial raw materials, such as cement, steel, etc. These raw materials consume much energy and have a huge impact on the envi- ronment. If the construction industry wants to achieve green and sustainable development, it must improve the efficiency of raw materials and energy utiliza- tion. Academics generally measure industrial green in terms of steel, cement, and glass use per unit of output value [16] [22] (Wang Wenzhao et al, 2019; Wu Xianghua et al, 2021). However, because steel has the advantages of being lightweight, having good seismic resistance, easy construction, and recyclability, China government actively promotes steel structure buildings from the policy level. Therefore, this paper selects wood consumption per unit of output value (D,), glass consumption per unit of output value (D,), cement consumption per unit of output value (D,), and energy consumption per unit of GDP to measure industrial green. 5) Industrial Innovation. Upgrades in machinery and equipment and ad- vances in safety design concepts form the basis for innovation in the construc- tion industry [23]. (Hsiu-Ping Chen and Kuo-Ching Ying, 2022) Under the es- tablished technology level, the innovation ability is derived from the design abil- ity and technical equipment conditions. Thus, this paper selects technical equipment rate (E,), power equipment rate (E,), and the net value of own con- struction machinery and equipment (E,) to measure technical equipment inno- vation ability. The number of survey and design institutions (E,) is selected to measure the innovation ability of survey and design. 6) Industrial Risk. The environment of construction projects is complex and dynamic, with uncertainties. The construction industry is vulnerable to business risks [24] (Mhetre ef a/, 2016). Small and medium-sized construction companies in developing countries suffer from a growing global trend of late and non-payment payments [25] (Peters et a/, 2019). This paper selects the cap- ital indebtedness ratio (F,) and current liability ratio (F,) to measure the finan- cial security of the construction industry and the current asset ratio (F,) to meas- ure its short-term solvency.",
    "7) Industrial Potential. As the income of urban and rural residents increases, society and households have a higher demand for the products provided by the construction industry. This paper measures the industry potential from both supply and demand perspectives. The growth rate of fixed asset investment (G,) is selected to measure the growth potential from the supply side. The urbaniza- tion rate (G,), GDP per capita (G,), and disposable income per capita (G,) are selected to measure the growth potential from the demand side. In this paper, the global principal component method will be used to evaluate the high-quality development of the construction industry in Henan Province. The basic idea of principal component analysis is to extract m (m < n) dimen- sional data from n-dimensional data with a strong enough correlation to represent the original data by means of dimensionality reduction while minimizing the information loss in the process of dimensionality reduction. The principal com- ponent analysis is applicable to cross-sectional data, but the data at different times lack comparability because they are in different main planes. Thus, this paper integrates the data of different years into a multidimensional data table and analyzes the data using global principal components analysis (GPCA). The Step 1: Construct a multidimensional data table. In Equation (1), Tis the time, n is the number of samples, and p is the number of variables. We integrate data intoa 7,,, panel. nx Step 2: The matrix X is z-standardized to eliminate the effect of the magni- tude. The covariance matrix of the normalized matrix is calculated, and its eige- nroots and corresponding eigenvectors are found. Extract m principal compo- nents F,, F, .... and £,, with their eigenvalues greater than 1. The /th principal component is calculated as shown in Equation (2). Step 3: The loading matrix V is obtained by calculating the correlation be- tween the principal components and the variables. The coefficients £, of the variables on the i-th principal component are obtained by dividing the /-th col- umn of the loading matrix V by the arithmetic square root of the /-th characte- ristic root. Subsequently, the principal component scores are calculated. Step 4: The final calculation of the composite score. In Equation (4), 4, is the ith feature root, g is the sum of the extracted feature roots, and f, is the score of the #th principal component The construction industry data of Henan Province from 2005-2020 were used, and the data were analyzed using Statal7, which was derived from the China Construction Industry Statistical Yearbook and China Statistical Yearbook from 2006-2021. Before conducting principal component analysis, correlation tests between va- riables need to be verified. KMOs were all greater than 0.7, while Bartlett’s spheri- cal test was significantly 0.0000, indicating that global principal component analy- sis could be performed. The principal components were extracted with the crite- rion of the characteristic root greater than 1. The characteristic root and va- riance contribution of the principal components extracted are shown in Table 2. After extracting the principal components, we get the weights of the third-level indicators under each second-level indicator. Then, we calculate the second-level indicators’ scores to obtain the second-level indicators’ weights. The weights of the secondary and tertiary indicators are shown in Table 1. After obtaining the weights of secondary and tertiary indicators, the scores of each secondary indicator and the final comprehensive score were calculated after weighting, as shown in Table 3. As can be seen from Figure 1, the high-quality development of the construction industry in Henan Province presents the following two characteristics. First, the overall score shows a fluctuating upward trend, which indicates that the level of high-quality development of Henan Province’s construction industry is continuously improving. Secondly, in the indicator score, the industrial scale and risk score are basical- ly in a stable upward trend; green indicators show an upward spiral trend, while industrial efficiency, industrial benefits, and industrial innovation scores are in a five-year phase, in a stepped, spiral upward trend. After 2016, The above three in- dicators are in a downward trend. In 2016, the Chinese government implemented real estate regulation policies to cool down the overheated housing market and control housing prices. These policies included stricter requirements for down payments, higher mortgage interest rates, and limits on property purchases in certain cities. Real estate accounts for about 60% of the proportion of the con- struction industry output value in Henan Province. Real estate regulation poli- cies may be the main reason for the lower trend of the three indicators.",
    "In order to study the stage characteristics, we use cluster analysis to cluster the samples at the longest distance and generate a cluster spectrum (Figure 2). As seen in Figure 2, we divided the research cycle (2005-2020) into four phases. The first stage is 2005-2007; the second is 2008-2010; the third is 2011-2014; and the fourth is 2015-2020. We ranked the secondary indicators based on the aver- age scores under the different stages (Table 4). By combining Table 4, we will analyze the causes of the stage characteristics based on the real estate policy. According to Chen Yingnan et al. (2022) [26], China’s real estate policy adjustment has the following characteristics. When eco- nomic growth faces greater difficulties, macro-control promotes real estate con- sumption. And when housing prices rise too fast, macro-control tends to inhibit the development of the real estate industry. Therefore, the frequent adjustment of the real estate regulation and control policies on the development of the con- struction industry has caused a greater impact. The first stage is from 2005-2007. At this time, Henan’s construction industry was still in the initial development stage, the overall scale of the industry was small, and the impact of construction industry development on the environment was limited. At this stage, the industrial scale and industrial efficiency of the construction industry in Henan Province ranked sixth and seventh, respectively, and the industry ranked first in green. The second stage is from 2008-2010. In 2008, the Chinese government an- nounced an economic stimulus plan worth 4 trillion yuan to counter the impact of the global financial crisis on the Chinese economy. The plan aimed to stimu- late economic growth by increasing domestic consumption and investment. Specifically, the plan included measures in areas such as infrastructure construc- tion, rural economic development, housing construction, and environmental protection. Henan Province’s construction industry output value increased from 282.406 billion yuan in 2008 to 440.061 billion yuan in 2010, with an average annual growth rate of 27%. Indicators closely related to industrial benefits, such as profits and taxes, grew by 42% and 30%, respectively. Thus, industrial benefit ranks first during this period. However, the loose financial credit policy allows construction industry companies to be more aggressive in financing. The capital indebtedness is relatively high, so the industry risk ranked seventh, and con- struction companies have a higher risk. The third stage is from 2011-2014. In 2011, the government realized the dan- ger of overheated housing prices, lowering the reserve requirement ratio six times and raising the benchmark RMB lending rate four times. However, the previous large-scale economic stimulus’s inertia still kept house prices rising. During this period, the scale, profit, and tax growth of the construction industry in Henan Province performed relatively well. The growth rate of the construc- tion scale was 20%, 14%, and 17%, respectively, over these three years; the growth rate of profits was 24%, 16%, and 34%, respectively; and the growth rate of taxes was 14.3%, 13.8%, and 22.1% respectively. In 2013, the Chinese govern- ment formally introduced the “New Five National Policies,” a real estate regula- tion and control policy. The “New Five National Policies” include strengthening regulation, stabilizing property prices, curbing speculation, and increasing supply, which is an update and strengthening of the previous real estate regula- tion policy. As a result, during this period, thanks to the strong regulation and control policies, the industry ranked first in terms of risk, and the industrial risk situation was significantly improved, while industrial efficiency, industrial bene- fit, and industrial innovation also ranked high. The fourth stage is from 2015-2020, in which the real estate market regulation policies frequently shifted. In 2013, the “New Five National Policies” led to a drop in housing prices, but in 2014, the Chinese government began using mild measures such as credit incentives and subsidies to stimulate demand. In 2015, the Chinese government heavily promoted the “Monetization of shantytown re- settlement,” which solved housing renovation and demolition problems through monetary means and actively helped the real estate industry to reduce inventory. From September to October 2016, housing prices in first and second-tier cities rapidly rose, and the government introduced the “Housing for Living, Not Spec- ulation” concept for market regulation. This concept posits that houses are meant for living, not for speculative trading. During this stage, the profit and tax revenue growth rates of the construction industry in Henan Province were vola- tile. In 2016, the profit growth rate was 37%, but in 2020 it decreased to -8%, and the tax revenue growth rates from 2015 to 2020 were —1%, 27%, 16%, 25%, -4%, and —6%, respectively. As shown in the table below, despite the industry ranking second in scale during this stage, it ranked sixth and seventh in industry efficiency and risk, respectively, due to the frequent shifts in real estate regulato- ry policies.",
    "Structural adjustment is an essential aspect of the high-quality development of the construction industry. The construction industry encompasses housing con- struction, civil engineering construction, building installation, building decora- tion, and other construction. Table 5 shows the internal structure of the con- struction industry in China, Henan Province, and Hubei Province from 2005 to 2020. Hubei province was chosen as a reference subject because its construction industry labor productivity ranks first nationwide. In 2020, its construction in- dustry labor productivity was 702,079 yuan/person, significantly higher than the national average of 422,898 yuan/person. The labor productivity in Henan’s construction industry was 423,307 yuan, roughly equivalent to the national av- erage. As can be seen from Table 5, the proportion of the housing construction in- dustry in Henan province is significantly lower than the national average level and Hubei province. In the fields of civil engineering construction, building in- stallation, and building decoration, the corresponding indicators in Henan prov- ince are higher than the national average level and slightly higher than Hubei province. A high proportion of the housing construction industry would make it too dependent on the real estate industry, making it more vulnerable to the in- fluence of real estate market conditions and policy regulation, which is not con- ducive to high-quality development. In today’s “housing is not for speculation,” Henan province’s lower proportion of housing construction business is condu- cive to the construction industry getting rid of its dependence on real estate. At the same time, the increasing proportion of building installation and decoration also points to the direction for the construction industry to find new growth points. This part shows the advantages and development potential of the struc- ture of the construction industry in Henan province. With the further develop- ment of the economy, especially the development of new infrastructure, the con- struction industry outside of the housing construction industry will face more development opportunities. The fluctuations in the real estate market deeply affect the high-quality devel- opment of the construction industry in Henan province. The construction in- dustry in Henan must reduce its dependence on real estate, explore new business growth points, fully tap into the construction industry’s potential, and enhance the resilience of the construction industry’s development. Henan province has a large population and a massive housing stock, and there is a strong demand for the transformation and decoration of living environments. In the context of “Housing for Living, Not Speculation,” the construction industry in Henan prov- ince should actively innovate its production and service models, flexibly meet the diversified and personalized demands of the people for the transformation and decoration of their living environments, and advance high-quality develop- ment through multiple businesses. Innovation is an important element of high-quality development [27] [28]. In the context of “Carbon Peak, Carbon Neutral,” efficiency improvement, energy sav- ing, and environmental friendliness are essential elements of high-quality devel- opment of the construction industry, as well as the basic preconditions for the sustainable development of the construction industry. Therefore, the government should encourage construction enterprises to use environmentally friendly ma- terials and apply intelligent technologies such as the Internet of Things, artificial intelligence, big data, and cloud computing to the production chain. Since the economic work conference in December 2016, the real estate regula- tion policies centered on the theme of “housing for living, not speculation” have conveyed stable policy expectations. Since 2022, the economy has faced more tremendous pressure due to changes in the international situation and the im- pact of the COVID-19 pandemic. There are signs of relaxation in the govern- ment’s macroeconomic regulation policies for the real estate industry, and He- nan plans to continue implementing “Monetization of shantytown resettlement” in the next three years. It is reasonable to adopt a flexible policy response in spe- cial times, but frequent and aggressive adjustments to real estate policies can eas- ily lead to uncertainty and risk, which is not conducive to the long-term healthy development of the construction industry. Therefore, the government should adopt a gradual approach to adjust its policies to ensure the stability of the real estate policy."
]