[
    "Abstract. Large-city housing costs are commonly attributed to excessive investment or financialization of the property market. The primary cause of housing issues is the imbalance between housing supply and demand. In the context of the urban housing market, the dynamic matching of housing supply and population type plays a crucial role in promoting equilibrium, maximizing the effectiveness of the market’s long-term mechanism, and preserving the coordination and sta- bility of the market. To illustrate this point, the paper analyzes the impact of different attributes of population on housing demand from the perspective of dynamic matching between population attributes and housing types. Taking Zhengzhou City in Henan Province as an example, we consider the relationship between population attributes and housing types in the past, construct a theoretical model of population and housing type and anticipate the future supply scale of various housing kinds. Ultimately, our findings provide a theoretical justification for curbing excessive financialization and housing bubbles in large cities. Furthermore, we propose a practical method for urban housing to return to the essence of life from the perspective of matching housing supply and demand. Urban housing has long been a prominent concern for those residing in metropolitan areas. Nonetheless, follow- ing the implementation of housing market reform, hous- ing prices in China have experienced a significant surge, ultimately leading to the emergence of the wealth effect pertaining to housing. Consequently, housing has gradu- ally transformed from a mere consumer good to an invest- ment product, with financialization further exacerbating the issue of housing inequality. This, in turn, has come to represent a crucial symbol of social differentiation be- tween those of affluent and impoverished backgrounds, ultimately serving as a pivotal mechanism that contrib- utes to social inequality and differentiation (Li & Fan, 2020). In light of the issue of exorbitant residential costs, the Chinese government has put forward the notion that abodes should serve as dwellings rather than as commodi- ties subject to speculation. Additionally, authorities have advocated for the formation of a rental-purchase housing framework. The expansion of metropolitan areas has been paralleled by the movement of people. This migration has engendered a surge in the populace, thereby intensify- ing the need for habitation in urban locales. As a result, this has perpetually stimulated the escalation of housing costs in Chinese cities. However, the housing supply in big cities is inelastic (Howard & Liebersohn, 2021) and does not match the growth of housing demand, which tends to cause housing market failure. The inadequacies of the housing market not only pose a threat to the eco- nomic development at the local level, but also result in prolonged commuting periods, diminished standards of living, and impede social mobility for specific segments of the population. In numerous countries, metropolitan areas have witnessed a surge in the escalation of these ap- prehensions in recent times (Rodriguez-Pose & Storper, 2020). Contemporary research has successfully identified a plethora of factors responsible for the escalation in resi- dential property prices. The factors in question are those that induce a hike in housing demand and those that are responsible for the amplification in housing supply. These factors entail but are not limited to, construction costs, geographic limitations, land policies, income levels, pop- ulation expansion, housing preferences, tax implications, and speculative demand, among others (Glaeser et al., 2017; Hanink et al., 2012; Huang, 2004; Liang et al., 2016; Yu, 2011; Yu & Huang, 2016). 2017; Hanink et al., 2012; Huang, 2004; Liang et al., 2016; Yu, 2011; Yu & Huang, 2016). Some scholars have discovered a correlation between demographic shifts and housing costs. Previous studies in this area mainly point out population size (Ding, 2019), population density (Miles, 2012), population structure (Gevorgyan, 2019; Green & Lee, 2016; Levin et al., 2009; Myers, 1990), labor mobility (Akbari & Aydede, 2012; Wang et al., 2018), household demographic characteristics (Eichholtz & Lindenthal, 2014; Lauster, 2008) and other factors related to housing prices. Mulder (2006) posits the existence of a symbiotic relationship between the popu- lation and housing sectors. A burgeoning populace has a significant impact on the demand for housing, which in turn influences the spatial distribution of people, ei- ther encouraging or impeding mobility. Concurrently, the escalation of housing costs has resulted in a geographic mismatch between residential areas and places of work, culminating in the gradual suburbanization of the labor force. Most urban inhabitants tend to reside in suburban areas while working in the central business district, result- ing in an increased commuting time between their abodes and workplaces. Additionally, there exists a causal connec- tion between population migration and the volatility of house prices. In the short term, the availability of urban housing is constrained. The inflow of migrants will exacer- bate the already high urban housing prices, which will, in turn, lead to higher living expenses, ultimately impeding population mobility. There is an inverted U relationship between the proportion of the population in large cities and urbanization (Liu et al., 2022). Among demographic factors, both qualitatively and quantitatively, housing de- mand varies with age of the population. This change deter- mines future demand for housing. Over the past few de- cades, many countries have experienced severe population aging. In large cities facing the challenge of aging, there is a contradictory relationship between population dynamics and housing stock, with a surplus of housing stock that is unable to meet the housing needs of the population. The mismatch between the existing housing stock and the needs of the population stems from changes in de- between different attributes of population and housing types, and propose corresponding suggestions based on the existing mismatch between population attributes and housing. For example, we take into account the emerging youth groups in the city – college students and graduates. Because they are the target of competition for talent in each city, cities will provide housing subsidy policies to attract and retain these talents. The provision of reason- ably priced housing, economical dwellings, metropolitan villages, extended-stay rental units, and additional forms of subsidized housing can decrease both procurement demand and investment impetus. This not only resolves the housing predicament of low- and moderate-income individuals but concurrently curtails their anticipations of future escalation in housing costs. In this study, we investigate the correlation between population and hous- ing dynamics in major urban areas. Our aim is to miti- gate the escalation of housing prices by aligning different housing types with specific population attributes and to address the housing challenges faced by low- and mid- dle-income individuals. To achieve this, we have gath- ered and meticulously organized population and hous- ing data from Zhengzhou, China. Using the SPSS data analysis software, we have established a linear regression equation to model the relationship between population and housing. Based on this model, we have made projec- tions for various population types from 2021 to 2035. Subsequently, we employed the same linear regression equation to predict the data for different housing types. Our findings present a match between different popula- tion attributes and housing types. We can able to find the minimum housing needs as well as the future preferences of different population attributes from a demand per- spective, which can enable us to make supply-side efforts to deliver housing options that cater to the specific needs and attributes of the population. We believe that an effec- tive match between population types and housing types will provide a basis for decision-making for government We think that the alignment of population and resi- dential accommodations can effectively diminish the demand for housing investments. While previous stud- ies have considered the relationship between population and housing, they have not revealed a match between population attributes and housing type. In particular, there is a lack of focus on those who rely on housing security, who are generally economically weaker and find it difficult to survive living in the city. The novelty of our In the late 1960s, scholars analyzed the relationship be- tween demographic fluctuations and the housing con- struction cycle and demonstrated the impact of demo- graphic changes on total housing demand (Campbell, 1963). Among demographic factors, age structure is con- sidered to be the most important factor in determining the interaction between population and housing demand (Myers & Pitkin, 2009). The effect of population growth on housing demand is contingent upon age. The younger demographic exhibits a greater degree of mobility among new households, which subsequently leads to an ampli- fication in the demand for fresh housing units. On the edly deleterious effect on housing demand (Malmberg, 2010). The advent of population groups into adulthood engenders a surge in the exigency for housing. As these individuals mature, they eventually succumb to mortality or relocate to nursing homes, consequently bequeathing a substantial number of unoccupied dwellings. This, in turn, engenders a commensurate rise in the provision of housing within the housing market. The aging pro- cess might bring down house prices in the future. On the contrary, considering the accelerated urban popula- tion movement, the process of urbanization will generate more housing demand, thereby promoting housing pric- es (Chen et al., 2011). Several academics have conducted research into the effects of urbanization on the real es- tate industry, as well as the surge in inflexible demand for housing that has resulted from the growth of urban populations. Urban areas possess a greater potential for attracting skilled individuals due to their developmental benefits. Due to the widening income gap between rural and urban residents, many farmers left their hometowns and ventured to the major cities to seek employment op- portunities. Moreover, the enhancement of educational attainment has the capacity to augment the populace of young homeowners (Myers et al., 2019). Studies show that human capital agglomeration has a long-term posi- tive effect on housing prices and economic development (Yang & Pan, 2020). China’s housing reform is charac- terized by a distinctive housing supply system that en- genders significant differentiation in urban social space. The underlying factors responsible for this social-spatial differentiation include the household registration system (Zhao & Howden-Chapman, 2010), work unit character- istics (Li & Wu, 2006), and the dual land system (Zhao, 2013). Hence, residents possessing local urban household registration exhibit a greater degree of contentment with their living conditions relative to the floating population. Moreover, the housing category plays a significant role in producing the social-spatial segregation of urban in- habitants. There exists a social segregation between house- hold residents and mobile populations within the housing Moreover, the housing category plays a significant role in producing the social-spatial segregation of urban in- habitants. There exists a social segregation between house- hold residents and mobile populations within the housing area, where different housing categories typically occupy distinct regions of the city, catering to diverse social and economic groups. With regards to urban population mo- bility, few scholars have discovered that the rise in the floating population impacts the demand in the real estate market. The immigration process comprises of stages, and the process of settling immigrant populations in cities is a dynamic process that involves three stages: arrival, set- tlement, and stabilization (Llopis Alvarez & Muller-Eie, 2022). Newly arrived immigrants may be uncertain as to whether they will establish permanent residence in the city, and thus tend to prefer rental accommodations of smaller size, as compared to long-term residents. Young people, who have lived and worked in the city for an ex- tended period, face the prospect of marriage and often seek to purchase a house suitable for family life. Skov- constraints emanating from economic and social status, as well as exclusionary systems, which make it difficult for them to acquire housing in inflow areas. Therefore, immigrants frequently opt for public rental housing as a viable alternative to meet their housing needs. The inflow of migrant populations contributes to urban development, resulting in rapid escalation of urban housing prices, but only a small percentage of migrants have been able to purchase homes in the receiving city. Even if the migrant population has a high income, it remains challenging to obtain urban housing due to the high construction costs and the long-life cycle of urban housing, resulting in a less flexible housing stock that cannot accommodate the needs of highly active populations and households. As a result, the housing market responds less effectively to demographic changes, leading to a mismatch between population and housing. Addressing the mutual match- ing of housing and population in cities is essential for the promotion of social integration, as well as the achievement of new urbanization strategies.",
    "early days, the government viewed land as an asset. The commoditization of land became a means of generating revenue and paved the way for the massive development of commercial housing in China. However, the assetiza- tion of land stimulated an increase in housing assetiza- tion, making housing affordability an increasingly acute problem in China’s cities, especially for those new entrants to the housing market (Chen & Wu, 2022). Since 2008, the importance of urban land has been increasing and the supply of urban construction land has attracted great at- tention and regulation by the government. Government intervention in the land market generally takes two forms: land use regulation and direct government control of land supply. When government obtain direct control over resi- dential land supply, it usually determines the quantity of land supply based on the projected demand for housing (Chiu, 2007). At a certain building density, the quantity of land supply should be positively related to the quantity of new housing supply. When there is an adequate supply of land, developers are able to respond quickly to an increase in housing price by building more housing units. By con- trast, the responsiveness of new housing supply to change in housing price will be constrained when land supply is inadequate (Yan et al., 2014). When the government intensified its intervention in the land market, the supply of residential land was severe- ly restricted. When the supply of residential land decreas- es, developers race to buy government land, making land prices high, which in turn promotes higher costs for the housing built. Despite rapidly rising home prices, more than half of all households are still interested in buying a new home. The central policy has introduced purchase restriction policies in the hope of controlling housing de- mand, yet it has not cooled the city’s real estate market, which stems from the fact that the localized policies might be, to a certain extent, different from the central government’s original guidelines. When local municipal government formally issued its localized measures for im- plementing the central government’s policies, the market uncertainty induced by the State Council’s notice disap- peared, confidence about the future growth of housing prices was rebuilt up. Some potential homebuyers who are not excluded from the market by the limits seized the op- portunity to purchase homes, therefore driving up hous- ing prices. This was far from the expectations of policy makers (Jia et al., 2018). China’s urban housing reform has resulted in a housing system that is increasingly market-oriented. This shift has given rise to the coexistence of numerous distinct hous- ing types. China has implemented the dual housing supply system consisting of commercial housing provided by the private sector and social housing provided by the public sector. The current housing supply mainly consists of pri- vate sector housing (regular commercial housing), subsi- dized housing (e.g., affordable housing), and public rental housing (e.g., talent apartments). Commercial housing is built by private developers and sold at market-determined prices. Therefore, the supply of commercial housing is ex- cessive and the prices are rising too fast. Affordable hous- ing is planned and directed by the state. It has the charac- teristics of economy, security, and practicability, and can be suitable for the affordability of low- and middle-income families. The talent apartment serves as a rental living fa- cility that supports talent employment and provides tem- porary living arrangements for entrepreneurs in a specific location. The apartment follows the principle of renting rather than selling, with a household size ranging from 10 to 200 m2 and a limited rental period. Its accommoda- tion is primarily provided to professionals, doctors, and both international and local university students who have not purchased their own houses and are not entitled to other subsidized housing. At present, China’s urban hous- ing system faces some unresolved internal contradictions, such as rapidly increasing prices for regular commercial housing, insufficient coverage of subsidized housing and public rental housing, and a mismatch of housing supply and demand levels, calling into question the effectiveness of existing land supply policies. Although land allocations for residential development have increased, they have not matched the growth in housing demand. Policies to regu- late access to housing for urban migrants further add to the complexity and can be socially destabilizing.",
    "this price is even higher than 30,000 yuan, which outstrips the rise in the material index, such as Beijing and Shang- hai. The burgeoning real estate investment sector is evi- dent, as evidenced by the data released by the Zhengzhou Bureau of Statistics indicating that the total sales area of commercial housing was 209.99 million m2 before 2010, which had risen to approximately 439.28 million m2 by the end of 2020 (Henan Province Bureau of Statistics [HAPBS], 2021). The proportion of investment has gradu- ally increased from 22% in 2007 to 43% in 2017, with the proportion of real estate investment remaining above 30% since 2011. Housing prices have continued to increase annually. The real estate market began to rise steadily in 2010, and by 2016 Zhengzhou house prices began to soar, and since then the rise has eased. After nearly ten years of development, the average price of commercial hous- ing in Zhengzhou has reached 10,215 yuan/m2 in 2020 from 3,994 yuan/m2 in 2007. The high price of housing has brought great pressure on the life of ordinary urban residents. The proliferation of commercial housing is advancing expeditiously, while the subsidized housing construction that is spearheaded by the government is consistently un- derprovided. Consequently, this has not only resulted in a swift escalation of housing costs, but also in a dispar- ity within the housing system. The supply of affordable housing is relatively limited, and local governments tend to restrict the resources for affordable housing to the local household population. In other words, the threshold for obtaining affordable housing is so high that it fails to cover the large numbers of rural migrants and urban workers in the process of urbanization (He et al., 2022). In addition, cities with more dependence on land finance and higher fiscal autonomy were less likely to devote land to afford- able housing construction unless local governments’ reli- ance on urban land-based interests is weakened. Although the central government has issued a series of guaranteed housing support policies to help ease the housing difficul- ties of new citizens, young people, etc., local government revenues are mainly dependent on land grant revenues, and high land prices allow local governments to achieve rapid short-term economic growth (Zou, 2014). In cities with a high level of economic development, housing and land prices are high, leading to high costs for sheltered housing. It can be seen that resources for affordable hous- ing are not well concentrated in areas with high rates of population urbanization, and there is a certain degree of spatial mismatch (He et al., 2022). In previous years, data from China’s statistical yearbook reveals that the average cost of commercial housing has increased from 1854 yuan/m2 to 9980 yuan/m2 (National Bureau of Statistics of China, 2020). In some mega-cities, Another significant factor contributing to elevated hous- ing prices is the incongruity that exists between supply and demand. A spatial partition between the demand for housing and the supply of land exacerbates the predica- ment of the dislocation between the demand and supply of housing. This predicament is gradually escalating. The equilibrium between the housing supply and demand var- ies considerably across different regions in China. Some regions experience a scarcity of housing supply, while oth- ers have an oversupply of housing in the market (Weng & Pan, 2019). Furthermore, the present occupancy of the subsidized housing primarily comprises of resettled households, which strays from the initial aim of safe- guarding the housing rights and interests of the low- and middle-income urban groups. Additionally, the design of the housing does not align with their living necessities. This incongruity between supply and demand will inevi- tably result in a significant accumulation of commercial housing. On one hand, certain individuals are incapable of affording housing, while on the other, some high-in- come individuals possess multiple residences. In order to curb excessively high housing prices, China’s Central Government has announced a policy of restricting home purchases. While the purchase restriction policy reduced house prices and transaction amounts, it did not affect the housing investment or construction market. Heterogene- ity exists across cities, with first- and second-tier cities, as well as highly urbanized cities, experiencing significant reductions in house prices following the implementation of the policy, but the housing policy is less effective in Based on the aforementioned housing development issues prevalent in major urban centers, the present study aims to establish a model for the progression of housing advan- tages in said areas, which aligns housing categories with corresponding population demographics and fosters the healthy growth of urban housing. To this end, regression analysis was conducted on the factors influencing the sup- ply and population distribution of housing in Zhengzhou, utilizing data procured from “Henan Statistical Yearbook” (HAPBS, 2021), “Zhengzhou Housing Security and Real Estate Bureau 2021 Annual Report on Government In- formation Disclosure” (Zhengzhou Housing Security and Real Estate Bureau, 2021).",
    "The permanent residents who have already integrated into the city, formed their families and lived in the city for a long time. They have a certain economic base and can afford the price of general commercial housing. The registered population is divided according to the place of registration of the household, and they have the hous- ing benefits of that city. The restriction on housing reg- istration makes it easier for the registered population to qualify for housing. Moreover, cities are now reforming their household registration systems to attract talent, and have enacted a number of subsidized settlement policies. Therefore, the demand for housing by the reg- istered population can well reflect the development of the city. Migrant workers have an even more profound impact on urban housing. They are constantly flowing into cities and choosing urban life for the sake of their children’s education and improved quality of life, which has led to a growing urban population and rapidly rising housing prices (Wang et al., 2017). However, the major- ity of them are primarily occupied in occupations that offer lower wages, and their absence of official residency status poses a challenge in accessing affordable urban housing, thereby exacerbating the severity and com- plexity of the housing issue. The annual increase in the count of individuals with university degrees results in a new cohort of youthful migrants emerging from educa- tional institutions. As they leave the educational system for the first time, they find themselves in a transitional phase characterized by economic vulnerability and the need to further refine their skills across diverse domains. Consequently, this has prompted municipal authorities across different cities to direct their attention towards the housing predicament faced by these graduates, in an endeavor to exert their utmost efforts in aiding the as- piring citizens and young individuals, among others, in mitigating the challenges encountered in securing hous- ing. Urban housing prices affect the job location choice of college graduates (Lin et al., 2022). Although most cities have provided housing subsidy policies for gradu- ates for talent introduction, the current housing prices are still beyond the graduates’ financial ability (Li et al., 2017), and most of them have to choose the form of tal- ent apartments with rented rooms, becoming a new gen- In recent years, Zhengzhou has been developing continu- ously, becoming a national central city and an interna- tional comprehensive transportation hub, with a strong population absorption force in the Central Plains. As a result, population density has increased significantly and housing has become an important issue. In previous stud- ies on the relationship between population and housing, some scholars have divided the population by household size (Day, 2018), population structure (Choi et al., 2019), and mobility status (Li et al., 2022). In this paper, from the perspective of population attributes, we mainly select the resident population, registered population, migrant workers, university graduates, and the group of college Therefore, we choose these five groups of population as the independent variable, and the amount of new area of general commercial housing, talent apartments and affordable housing as the dependent variable for the dif- ferent housing needs of these groups. We establish the regression equation model of population attributes and housing. The symbols are described in Table 1. The data pertaining to population and real estate utilized in this study has been sourced from the appropriate official government websites and platforms, namely, “Henan Sta- tistical Yearbook” (HAPBS, 2021), “Zhengzhou Housing Security and Real Estate Bureau 2021 Annual Report on Government Information Disclosure” (Zhengzhou Hous- ing Security and Real Estate Bureau, 2021). According to the statistical data, the data on the population types and housing types in Zhengzhou in the past ten years are ob- tained. The specific data are shown in Table 2, and Table 3. A regression equation was established based on the re- lationship between the dates from 2010 to 2020 and each population type, and then the independent variable date was substituted into the equation to obtain the popula- tion type prediction data for each year. The forecast data We forecast housing types from 2021 to 2035 based on real estate trends. With the new commercial housing, new talent apartments, and new affordable housing as the dependent variables and the date as the independent vari- able, we obtained the regression equations between the three housing types and the date through linear regression analysis by SPSS, and then calculated the forecast data of housing types from 2021–2035, as shown in Table 5.",
    "Considering that there may be multicollinearity problems between variables, multivariate analysis is used to analyze the multivariate linear relationship between all independ- ent variables and dependent variables, as shown in Table 6. It can be seen that the registered population of Zheng- zhou has the greatest impact on the total area of new com- mercial housing, and the demand for commercial housing from non-local residents in Zhengzhou is also increasing. College students are unlikely to buy commercial housing in the short term, and may not necessarily stay in Zhengzhou in the future, so the correlation with the total area of new commercial housing is low. Then we continue to analyze the relationship between the independent variables and the area of new talent apartments, as shown in Table 7. From Table 7, it can be seen that the population of migrant workers and the resident population of Zheng- zhou have the most obvious influence on the area of new talent apartments. With many universities purchasing tal- ent apartments for their students or teachers, it leads to an increased correlation between the number of college students and the area of new talent apartments. Finally, we analyzed the relationship between the respective vari- ables and the area of new affordable housing, as shown in Table 8. It can be seen that the registered population and col- lege students in Zhengzhou are strongly correlated with the new affordable housing. Affordable housing is mainly for middle- and low-income groups to live in peace, and the college group is also a major part of affordable housing. From the above tables, it can be seen that the sig val- ues between the independent variables and the depend- ent variable are all much greater than 0.05. Since there is an inclusion relationship between the individual samples and the phenomenon of multicollinearity between the variables, we adopt the ridge regression analysis method to determine the coefficients of the regression equation. Ridge regression analysis is carried out on the relationship between the respective variables and the new commercial housing area, the new talent apartments area, and the new affordable housing area, among which: graduates; CS – College students; CH – New commercial housing area; TA – New talent apartments area; AH – New affordable housing area. Ridge regression analysis on the relationship between each variable and the new commercial housing area. The analysis results are shown in Tables 9 and 10. The regression equation between the independent var- iables with the new commercial housing area is derived from the SPSS ridge regression operation: The ridge regression analysis is carried out on the re- lationship between the independent variables and the new affordable housing area. The analysis results are shown in Tables 13 and 14. It can be concluded that the regression equation be- tween the independent variables and the new affordable housing area is as follows: The ridge regression analysis is carried out on the re- lationship between the respective variables and the new talent apartments area. The analysis results are shown in Tables 11 and 12. It can be concluded that the regression equation between the independent variables and the new talent apartments area is as follows: It is discernible from the expressions of the aforemen- tioned three equations that the analysis of these three sce- narios is more intricate. This is unequivocally linked to the fact that certain independent variables exhibit a decline or negative growth rate; nonetheless, in general, we can observe the degree of correlation between the independ- ent variables and the dependent variable. There exists an inverse correlation between diverse housing types and the permanent resident population in Zhengzhou, which may be attributed to the exorbitant housing prices and the ex- clusionary effect. Housing strays from residential attributes and gravitates towards attracting investment capital and a housing and the population is more pronounced. Among these, the migrant population evinces a stronger correla- tion with commercial housing. The process of urbaniza- tion has led to an upsurge in the number of migrants in major cities, which signifies people’s yearning for supe- rior housing and resources, consequently contributing to the escalation in commercial housing prices. The degree of positive correlation between the population of college graduates and the area of commercial housing is great- er than that of talent apartments. Talent apartments are primarily associated with attracting college graduates to promote urban innovation and development. Most college talents still place their aspirations on commercial housing. This could be due to the fact that talent apartments are not suitable for family populations, and new talents require more extensive commercial housing to settle in the city. In the forthcoming times, it is imperative to provide appro- priate apartments in accordance with the talent structure. For instance, certain smaller-sized apartments are suitable for students. It may be feasible to moderately augment the investment in apartments, enhance the quality of apart- ments, and provide housing security for high-level talents. The groups inhabiting affordable housing mainly comprise of middle- and low-income groups who migrate to Zheng- zhou for work and household registration. Hence, it can Previous research indicates a strong correlation between population attributes and housing type. Therefore, it is imperative that future studies focus on the alignment of these two factors to alleviate housing difficulties. Such an approach would not only facilitate a more precise and ap- propriate housing supply for the market but also provide a foundation for decision-making by the government and private companies, ultimately leading to the development of housing types that cater to market demands and meet the needs of the populace. The future housing supply type can be predicted by analyzing the previous regression analysis of population and housing as well as the popu- lation forecast data from 2021 to 2035, after which the future population type and housing type can be further examined.",
    "Using SPSS, the regression equation between the new housing types and the population attributes from 2010 to 2019 was obtained, as shown in Table 15. Then use the regression equation between the hous- ing types and various population types to calculate the forecast data of each housing type from 2021 to 2035, as shown in Table 16. Comparing the forecast data of each house type under the natural development trend in Table 5 with the forecast data under the development trend of the reference popula- tion attributes in Table 16, it can be seen that the predicted data for housing type, under the influence of demographic type factors, has a great difference. This also explains the necessity of studying the matching of population attributes and housing type to a certain extent. To enhance urban construction and development, mu- nicipalities furnish elite apartments to entice high-caliber talents to settle down. In 2017, the Zhengzhou adminis- tration promulgated a talent policy to attract talents at all levels to propel development. Given the surging housing prices and rents in numerous cities, particularly first and second-tier cities, lodging has emerged as a crucial con- sideration for young individuals when selecting a city, especially college graduates (Wang et al., 2021). Conse- quently, providing talent apartments for college graduates and other cohorts plays a pivotal role in aiding Zhengzhou City’s talent acquisition scheme. As a result of the talent apartment’s guaranteed and low price, the administration shoulders the primary responsibility for the relevant con- struction and supply. Thus, the administration ought to consider fully the dynamic demand for talent apartments from college graduates and other groups in the context of talent acquisition, augment investment in the construction and supply of talent apartments, to effectively satisfy the Under the circumstance of demographic change, the do- main of affordable housing is anticipated to exhibit an up- ward trajectory in the forthcoming years. Affordable hous- ing, which is a form of commercial housing that guaran- tees its nature, is of paramount importance in addressing the housing requirements of the populace, particularly those belonging to the low- and middle-income strata. With an increasing influx of immigrants to Zhengzhou, af- fordable housing, which is characterized by relatively low prices and guaranteed nature, has emerged as a critical welfare project that supports the process of urban expan- sion and demographic growth. The construction and pro- vision of affordable housing necessitate not just the leader- ship of the government but also its implementation at the micro-operational level. The government should augment its endeavors in planning, construction, and investment to ensure an orderly and adequate supply of affordable housing. Furthermore, it should also take into account the equitable distribution of affordable housing and devise a gradient supply model to meet the needs of a wide range of groups. More importantly, it also needs to consider the spatial suitability of affordable housing, so that affordable housing does not only exist in the suburban areas of the city and meets people’s basic transportation needs. accelerating the development of its metropolitan region. The establishment of high-quality integrated development of the Central Plains urban agglomeration depends on satisfying the housing needs of the population as a funda- mental and obligatory requirement. The provision of com- mercial housing in an orderly manner is of paramount im- portance. However, the assurance of adequate supply does not entail a laissez-faire approach to the haphazard devel- opment of commercial housing. Instead, it necessitates an increase in effective supply and the provision of commer- cial housing that is relevant to the type of population and the demands of consumers. This will not only mitigate or inhibit the problem of escalating housing prices due to a decrease in supply in the residential market but also safe- guard the housing needs of the population. While ensuring the supply of commercial housing, it is also pertinent to consider that continuous investment in the capital of the commercial residential market will create further inflation- ary pressure. Hence, the government must adopt adminis- trative and legal measures to increase macro-control of the real estate market. It is also crucial to collect data and man- age the types of commercial housing developed by compa- nies to effectively regulate the market inflow of commercial housing, especially the supply of different types of housing to correspond to the type of population.",
    "The present study’s investigation has demonstrated a close correlation between population attributes and housing type. At present, a severe asymmetry exists between the supply and demand of housing. The scarcity of reasonably priced housing, such as talent apartments and affordable housing, has contributed to housing’s investment proper- ties, thereby exacerbating the discrepancy between supply and demand. The mismatch between urban populations and housing will lead to the financialization of hous- ing investment and an increase in housing prices. Prop- erly aligning population attributes and housing type can alleviate the housing difficulties faced by large cities and presents an effective solution to returning houses to resi- dential properties. This mechanism is pivotal to resolving the supply and demand contradictions in large cities, as well as the contradictions between residents’ income and housing prices. Additionally, it serves as a crucial element in addressing the contradiction between the government’s reliance on land finance and the assurance of essential housing needs for residents. The specific research findings are outlined below. (1) The development of forthcoming housing varieties is influenced by the evolution of population varieties. When the diversity of housing provision is aligned with the hous- ing requirements of individuals, it can diminish the need for housing investments. Individuals depend on afford- able housing, low-cost housing, urban villages, and long- term rental apartments to fulfill their basic needs, which can mitigate the housing burden of people with low- and middle-income and resolve their housing predicaments. The government ought to augment the supply of subsidized housing. This subsidized housing can resolve the housing predicament, diminish people’s aspirations for future hous- ing price increments, and restore the housing provision to the aspect of housing needs of diverse population types. (2) There is a strong correlation between different types of housing and urban population inflows and out- flows. Over time, urban population inflows will generate different intensities of demand for different types of hous- ing, so the type of housing supply should be a dynamic adjustment process. Planning housing supply according to the different attributes of the population will be effective in reducing housing prices. (3) Matching housing classifications with the populace and ensuring the fundamental housing needs of individ- uals are met represents the crux of resolving the afore- mentioned issues. One should augment the availability of subsidized housing, as well as refine the entrance and exit mechanisms pertaining to such housing, in order to sat- isfy the housing needs of the majority of individuals with middle to low-income levels. Simultaneously, it is impera- tive to safeguard the land intended for elementary urban construction. The government should further alleviate restrictions on migration, while simultaneously tailoring housing subsidies to individuals with distinctive talents. This will foster an environment that is conducive to in- novation and entrepreneurship, and promote the stability of employment for local and foreign university students in Zhengzhou. Such measures will enhance urban activism and advance urban innovation. The aforementioned findings hold significant reference value for the formulation of China’s housing policy. Firstly, the local government ought to construct a multi-tiered housing supply system based on the population’s attributes and quantity to cater to the varied requirements of diverse groups. They must not only rationally plan the number of self-owned, commercial housing, subsidized housing, public rental housing, and dilapidated communities, etc., but also provide differentiated housing supply for different groups to mitigate housing prices and address the housing demands of low- and middle-income individuals, includ- ing urban migrants and new citizens. Secondly, it is vital to establish sound entry and exit mechanisms for subsi- dized housing. The government should prohibit middle and high-income individuals from acquiring subsidized housing and extend the coverage scope for low-income individuals. It should oversee the subsequent income of family members who have already obtained guaranteed housing so that those who no longer satisfy the require- ments shall withdraw from guaranteed housing. Lastly, it is imperative to foster the high-welfare talent settlement policy and the reform of the household registration sys- tem, and to guarantee that highly skilled talents can live and work in Zhengzhou. The government should provide eligible personnel with Provide guaranteed rental housing, and give a certain area subsidy to those who rent market- oriented rental housing, so as to take advantage of low Grant [21YJCZH130]; Henan office of philosophy and social science under Grant [2024-ZDJH-031]; Henan office of philosophy and social science under Grant [2023BZH010].",
    "Zhifeng Shen and Jing Li conceived the study. Zhifeng Shen, Jing Li, Ahsan Siraj, Shilpa Taneja, and Zhihui Li were responsible for the design and development of the re- search. Zhihui Li and Jing Li were responsible for data col- lection and data interpretation. Jing Li, Ahsan Siraj, and Shilpa Taneja wrote the first draft, edited, and revised the article. All authors have read and agreed to the published version of the manuscript. tain limitations. The paper employs data concerning the population and housing in Zhengzhou City, Henan Prov- ince. Nevertheless, the selection of the city sample is rela- tively narrow. The focus of the study lies primarily in ex- amining the relationship between housing demand across various demographic attributes and the prevailing housing supply. However, the variable of population income level remains absent. Although it is noteworthy that guaran- teed housing is primarily a policy benefiting low-income groups, and we have included demographic variables such as graduates and migrant workers as representatives of this group, we find ourselves still lacking specific data to sub- stantiate this claim. This deficiency arises from the chal- lenge of obtaining income data for different attributes of demographic groups. Consequently, it becomes impera- tive to further investigate the impact of income level on housing in subsequent studies. Furthermore, taking into account the projected sluggish population growth and the impending aging problem, the rate at which new housing units will be developed is expected to decelerate. In order to offer a broader range of housing security, the govern- ment and relevant authorities must contemplate the reju- venation of old housing structures as well as the provision of long-term rental housing in the future. Additionally, we plan to conduct a comparative analysis by selecting a large"
]