[
    "Abstract: Given the increasingly severe challenges of resource scarcity and environmental pollution, economic development has garnered widespread attention. Firstly, an analysis of the research background of logistics industry and economic development in Henan Province is conducted. Subsequently, a comprehensive evaluation index system for logistics and economic development levels is constructed, utilizing entropy weight method and coupling coordination degree to illustrate their relationship. The research findings indicate a high degree of coordination between the logistics industry and economy in Henan Province, where they mutually influence each other. The transformation of the logistics industry requires economic impetus, while economic development also relies on the support of the logistics industry, fostering a mutually reinforcing positive development relationship. Additionally, based on the comprehensive evaluation levels and weights of logistics and economic development, it is evident that continuous investment is needed in aspects such as informatization and optimized network layout to accelerate the development of the logistics industry and economy. In recent years, the mutual development relationship between the economy and the logistics industry has become a focal issue of concern in the academic circle. Against the backdrop of rapid economic growth, the innovation of the logistics industry has been accelerated, the regional scale of logistics has been expanded, the informatization level and management capacity of logistics have been continuously improved, and the transportation efficiency has been significantly enhanced, becoming an important driving force for economic and social development. The National Development and Reform Commission has clearly pointed out that the high-quality development of logistics is an indispensable and important force in promoting the high- quality development of the national economy[1].Therefore, there is sufficient evidence to show that there is a close connection between economic and logistics development, but sufficient experience has not yet been gained regarding the coordination mechanism between the two. Zhang Y[2]usde the three-stage DEA evaluation model and the Tobit econometric model, the efficiency and development status of the logistics industry were analyzed. It was found that the logistics efficiency presented a stepwise distribution of \"high downstream and low upstream\".Wu N, Zhang Q, et al. [3]~[4]all studied the coordinated development of logistics and economy, and used the entropy weight method and coupling coordination degree model to evaluate the evolution characteristics of the region. Zhan J, et al.[5] took the Yangtze River Economic Belt as the research object, analyzed the coupling coordination level of its logistics and information, and used coupling coordination degree to analyze the imbalance of the development of the two. Xie X, et al. [6]used the coupling coordination degree model to measure the integration level of the logistics industry and the digital economy, and further analyzed the development integration status and trend of the two from three aspects: regional differences, spatial effects, and dynamic evolution through algorithms such as Moran index and LIS cluster diagram. According to previous literature analysis, the coupled development of logistics and economy has attracted widespread attention, but the development relationship between the two in Henan Province has not been studied in depth. To this end, this paper will conduct an empirical study on the logistics and economic data of Henan in the past ten years from 2012 to 2021, and further explore the relationship between the two, in order to put forward policy recommendations for enhancing the efficiency of the logistics industry under the economy. With the improvement of digitalization, Henan Province's logistics industry is gradually realizing intelligent and digital transformation. The application of advanced technologies such as big data, the Internet of Things, and artificial intelligence has improved logistics efficiency, reduced transportation costs, and promoted the quality and personalization of logistics services. Hu W (2021) [7]'s research shows that in order to achieve the goal of integrated development of logistics in the economic circle, it is necessary to build logistics integration, create an integrated logistics and transportation system, build a public logistics information platform, establish an integrated logistics operation service system, and cultivate and expand the logistics industry to promote the development of logistics integration and economic integration. In terms of gross domestic product, in the first half of 2022, Henan's GDP was 3,075.72 billion yuan, a year-on-year increase of 3.1%, 0.6 percentage points higher than the national average. Among them, the added value of the tertiary industry was 1,491.069 billion yuan, a year-on-year increase of 2.2%[8]. From the perspective of industrial structure, Henan Province's economic structure adjustment has achieved certain results. The growth rate of the service industry is accelerating, and its supporting role in economic growth is gradually increasing. At the same time, Henan Province actively cultivates new industries and promotes the transformation and upgrading of traditional industries, providing new growth points for economic development. In short, Henan Province's economy is in a state of steady growth, its industrial structure is constantly optimized, its innovation capacity is constantly improved, and it continues to promote high-quality economic development.",
    "(1) Policy environment. Government policies and regulations have an important impact on logistics and economic development. For example, the government can introduce policies to support the construction of logistics infrastructure and optimize the tax policies of the logistics industry to promote the development of the logistics industry. At the same time, the government can also influence the development of the overall economy by adjusting economic policies and formulating industrial development plans. (2) Changes in consumer demand. With economic development and consumption upgrading, consumers' demand for logistics services is also changing. The requirements for the timeliness, safety, and customization of logistics are getting higher and higher, which not only promotes the innovation and development of the logistics industry, but also promotes economic growth. (3) Technological progress. Technological progress has a driving effect on both logistics and economic development. In the field of logistics, advanced technologies such as big data, the Internet of Things, and artificial intelligence can improve logistics efficiency, reduce costs, and promote innovation in the logistics industry. In terms of economic development, technological progress can improve production efficiency and promote industrial upgrading and transformation. (4) Market competition. Market competition has a driving effect on both logistics and economic development. In the field of logistics, market competition can prompt logistics companies to improve service quality, reduce costs, and innovate business models. In terms of economic development, market competition can promote cooperation and competition among companies and promote industrial upgrading and optimization. Based on the above analysis of the factors affecting the economy and logistics industry, and taking into account the actual development of Henan Province, indicators are selected in five aspects: logistics production capacity, logistics sustainable development capacity, economic scale, economic benefits, and economic structure. See Table 1. (1) The entropy weight method is a weight determination method that calculates the entropy weight coefficient based on the degree of variation of each model indicator and the concept of information entropy. Determining the weight of each order parameter by the entropy value weighting method can avoid the influence of the subjective level to a certain extent [°1, The specific calculation steps are as follows: first, dimensionless processing is performed. Xj; is the original data of the j indicator in the i year, Yjj;, is the data of the positive indicator after standardization, and Y;j2 is the data of the negative indicator after standardization. Then calculate the weight. In formulas (3) to (5), Pi; is the weight of the indicator after standardization, e; represents the entropy value of the indicator, and W, represents the weight value of each indicator. (2) Coupling coordination includes coupling degree and coupling development degree. Coupling degree is used to describe the strength of the relationship between two subsystems. The higher the coupling degree, the more orderly the system structure state is, and vice versa. The coupling degree reflects the static coupling state of the system, so the coupling coordination degree model is introduced to reflect the dynamic coupling coordination development level between systems[10].This paper takes the development indicators of the two major subsystems of logistics and economy as coordination indicators, establishes a coordination evaluation model, and conducts a comprehensive evaluation on this basis. That is, the coupling degree model is as follows: systems. The larger the value of C, the higher the degree of coupling; U; represents the comprehensive score of logistics, and U,represents the comprehensive score of economy. T is the comprehensive coordination index of logistics and economy; a and b are undetermined coefficients, which are set as a=b=0.5 here; and D is the coupling coordination degree of the two systems. The data in this article are all from the \"Henan Statistical Yearbook 2012-2021\". After the original data dimensionless, the entropy weight method is used to calculate the weights of each indicator, as shown in Table 3. The weights of the information level of cargo turnover, freight volume, postal business volume, and energy consumption are 0.2557, 0.0061, 0.3284, 0.1475, and 0.2623, respectively. The weights of GDP production fiscal budget revenue, total import and export trade, total retail sales of social consumer goods, contribution rate of the tertiary industry, and the proportion of employment in the tertiary industry to the total population are 0.1662, 0.1739, 0.1609, 0.1488, 0.1923, and 0.1577, respectively. is U, represents the comprehensive score of logistics, and Uz represents the comprehensive score of economy. As shown in Figure 1, the trend of the comprehensive evaluation level of economy is low, between 0.2 and 0.3, and the overall development level is in the primary stage. There are different degrees of development in industrial structure and energy efficiency. In the process of economic development, it is necessary to achieve the coordinated promotion of industrial structure adjustment, energy efficiency improvement and carbon intensity reduction. From 2015 to 2021, the level of economic development will accelerate, which is also in line with the five development concepts of \"innovation, coordination, green, openness and sharing\" put forward by the Fifth Plenary Session of the 18th CPC Central Committee. For the development of logistics industry, as shown in Figure 2, although the coupling level has fluctuated in the past ten years, the overall comprehensive evaluation level has shown an upward trend, and the closeness between system elements is very high, indicating that the logistics and economic development of Henan Province have been improving in the past ten years. The development level from 2013 to 2015 was relatively low, between 0.2 and 0.3. At that time, the logistics industry in Henan Province was in its initial trial stage, and the urban logistics planning was not yet perfect. After 2015, the development of the logistics industry in Henan Province aimed to accelerate the development of modern logistics industry and promote the optimization and upgrading of industrial structure, so as to further enhance the comprehensive competitiveness of the logistics industry.",
    "According to the coupling coordination index, it can be found that from 2012 to 2014, the logistics industry and economic development were in a growth stage, temporarily unstable, and roughly in a basically coordinated state. The two reached a highly coordinated state in 2019. During this stage, the development of the logistics industry and economy in Henan Province has been significantly improved compared with the previous stage. Combining the comprehensive evaluation level of the two, it is found that the economy has driven the development of logistics in this stage. Combined with the current development status of logistics and economy, the following suggestions can be made for the development of logistics and economy in Henan Province: 1) Optimize the layout of the logistics network. By strengthening the construction of transportation hubs, a more efficient and convenient logistics network covering the entire province can be provided, while promoting the integration of urban and rural logistics networks. 2) Promote the transformation of the traditional logistics industry. Realize real-time sharing and online processing of logistics information, reduce the cost of logistics information transmission, and improve the speed and accuracy of information transmission. 3) Create a good coordinated development environment. Combine national policies with local policies, implement laws and regulations that are adapted to local conditions, and at the same time give play to the industrial agglomeration effect to attract more industries and economic activities to move closer. Under the background of economy, the issue of logistics development has become the focus of attention of all sectors of society, and has also become an important basis for the government and relevant departments to formulate policies and plans. The new pattern of logistics industry development has gradually formed, and has gradually become an important part of the modern logistics industry, and an important growth point for the economic development of Henan Province. In short, if Henan Province wants to develop the logistics industry, it needs the support of the economy to form a sustainable development state. In this process, the logistics industry also needs to continuously adjust and upgrade its own structure. With the continuous advancement of the two industries, it will bring huge dividends to Henan Province. Through the coupling coordination analysis of logistics and economic indicators in Henan Province from 2012 to 2021, the following conclusions are drawn. 1) The logistics industry and economy in Henan Province are highly coordinated, and the two are in a mutually promoting positive development relationship. 2) By optimizing the logistics layout, the efficiency of logistics distribution can be improved, transportation costs can be reduced, and economic consumption can be promoted. 4) According to the actual situation, create a good development environment for integration and promote high- quality development of both parties."
]