[
    "Design/Methodology/Approach: The population of this study is the community of Zhengzhou City, Henan Province, China. The unit of analysis is individuals living in the community of Zhengzhou City. Through random sampling method, 384 community residents were selected to participate in the research. This study used a questionnaire survey method to obtain primary data for analysis. Findings: The results of the study show that (1) there is a significant positive correlation between government regulation, corporate capabilities, social organization involvement and building resilience cities. (2) Strengthening government regulation, corporate capabilities, and social organization involvement can effectively strengthen urban community collaborative governance, which is beneficial to building resilience cities. Thus, it is favorable to building Resilience Cities. Research, Practical & Social implications: This research will be useful in creating a new model of urban community governance that will enhance the ability of cities to cope with disasters and achieve the goal of building resilient cities. A multifaceted and collaborative urban community governance model will be developed by strengthening the collaboration of the three groups - government, corporations, and social organizations，in order to ensure that the collaborative urban community governance model promotes the city's ability to cope with disasters, thereby enhancing the city's resilience. Enhancing urban resilience can fundamentally improve residents' ability to cope with the potential risks that persist in cities, thereby resolving social conflicts and satisfying people's pursuit of a better life. Originality/Value: This study presents an innovative form of urban community management model that provides valuable insights on the impact of collaborative urban community governance models on resilient city buildings. C Professor of Technology & Operation Management. Graduate School of Management, Postgraduate Centre, Management and Science University, University Drive. Selangor, Malaysia. E-mail: zunirah@msu.edu.my Design/Metodologia/Abordagem: A população deste estudo é a comunidade da cidade de Zhengzhou, província de Henan, China. A unidade de análise são indivíduos que vivem na comunidade da cidade de Zhengzhou. Por meio do método de amostragem aleatória, 384 moradores da comunidade foram selecionados para participar da pesquisa. Este estudo utilizou um método de pesquisa de questionário para obter dados primários para análise. Constatações: Os resultados do estudo mostram que (1) há uma correlação positiva significativa entre a regulamentação governamental, as capacidades corporativas, o envolvimento da organização social e a construção de cidades de resiliência. (2) O reforço da regulamentação governamental, das capacidades empresariais e do envolvimento das organizações sociais pode efetivamente reforçar a governação colaborativa da comunidade urbana, o que é benéfico para a construção de cidades de resiliência. Assim, é favorável à construção de Cidades Resiliência. Investigação, Implicações práticas e Sociais: Esta investigação será útil na criação de um novo modelo de governação da comunidade urbana que melhorará a capacidade das cidades para lidar com catástrofes e alcançar o objetivo de construir cidades resilientes. Será desenvolvido um modelo de governação da comunidade urbana multifacetado e colaborativo através do reforço da colaboração dos três grupos - governo, empresas e organizações sociais, a fim de assegurar que o modelo de governação colaborativa da comunidade urbana promova a capacidade da cidade para lidar com as catástrofes, reforçando assim a resiliência da cidade. Melhorar a resiliência urbana pode melhorar fundamentalmente a capacidade dos residentes de fazer face aos potenciais riscos que persistem nas cidades, resolvendo assim conflitos sociais e satisfazendo a busca das pessoas por uma vida melhor. Originalidade/Valor: Este estudo apresenta uma forma inovadora de modelo de gestão da comunidade urbana que fornece informações valiosas sobre o impacto de modelos colaborativos de governança da comunidade urbana em edifícios urbanos resilientes. Diseño/Metodología/Enfoque: La población de este estudio es la comunidad de la ciudad de Zhengzhou, provincia de Henan, China. La unidad de análisis son los individuos que viven en la comunidad de la ciudad de Zhengzhou. Mediante muestreo aleatorio se seleccionaron 384 residentes de la comunidad para participar en la investigación. En este estudio se utilizó un método de encuesta con cuestionario para obtener datos primarios para su análisis. Hallazgos: Los resultados del estudio muestran que (1) existe una correlación positiva significativa entre la regulación gubernamental, las capacidades corporativas, la participación de la organización social y la construcción de ciudades resilientes. (2) El fortalecimiento de la regulación gubernamental, las capacidades corporativas y la participación de la organización social puede fortalecer de manera efectiva la gobernanza colaborativa de la comunidad urbana, lo que es beneficioso para construir ciudades resilientes. Por lo tanto, es favorable a la construcción de Ciudades de Resiliencia.",
    "Investigación, Implicaciones prácticas y Sociales: Esta investigación será útil para crear un nuevo modelo de gobernanza comunitaria urbana que mejorará la capacidad de las ciudades para hacer frente a los desastres y alcanzar el objetivo de construir ciudades resilientes. Se desarrollará un modelo de gobernanza comunitaria urbana multifacético y colaborativo fortaleciendo la colaboración de los tres grupos -gobierno, corporaciones y organizaciones sociales- para asegurar que el modelo de gobernanza comunitaria urbana colaborativa promueva la capacidad de la ciudad para hacer frente a los desastres, mejorando así la resiliencia de la ciudad. Mejorar la resiliencia urbana puede mejorar fundamentalmente la capacidad de los residentes para hacer frente a los riesgos potenciales que persisten en las ciudades, resolviendo así los conflictos sociales y satisfaciendo la búsqueda de una vida mejor por parte de las personas. Originalidad/Valor: Este estudio presenta una forma innovadora de modelo de gestión comunitaria urbana que proporciona información valiosa sobre el impacto de los modelos de gobernanza comunitaria urbana colaborativa en edificios resilientes de la ciudad. history of human existence. Since the industrial revolution in Britain, urbanization has been accelerating worldwide, and the management mechanism of the urban community has also been changing. Since China's reform and opening up, urbanization has grown two times faster than the world's average rate of urbanization over the same period (Li et al., 2020). Therefore, the urban community is the basic unit for building cities, and urban community development is closely related to urban construction. In recent years, the evolution of China's political system, the rapid growth of Internet technology, and the highlighting of social pain point problems all indicate that urban development has entered a period of acute change, and there is an urgent need for a new model of urban management to cope with the complex problems arising in cities (Luo Haimei, 2022; Wang Yanhua, 2023; Xie et al., 2022). Therefore, building resilient cities has emerged as a new way of solving complex problems (Fan et al., 2022). There is a strong correlation between building resilient cities and urban communities (Wang Dianli, 2022). Improving urban community governance, mechanisms can solve the pain point problems in cities and effectively enhance building resilience cities (Chen et al., 2023). Therefore, this study combines historical literature and proposes the mechanism of urban community collaborative governance to improve the urban governance mechanism further and provide a new path for building resilient cities. In summary, this study conducts a correlation study between urban community collaborative governance and building resilient cities, which In this study, the residents of Zhengzhou City, Henan Province, China, were selected as the study population, and the individuals among the residents were used as the unit of analysis. Accurately capture the essential components of the urban community management process, Governmental Organization, Corporate Organization, and Social Organization. By examining the daily status of urban community governance, it can be found that the regulatory role of the Governmental Organization does not play a significant enough role (Prianto, Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 3 Abdillah, 2023). Corporate Organization does not fully utilize its capabilities (Wardekker, 2023). Social organizations are not sufficiently involved in the urban community governance process, among other phenomena (Ro, Garfin, 2023). By analyzing these phenomena, it is possible to summarize the problems of incoherence in the management process of these three groups, the lack of apparent roles, and the conflict of interest in their daily functioning. Therefore, this study, in terms of the value of research. On the one hand, urban community collaborative governance can effectively alleviate the above problems, and on the other hand, building resilient cities urgently need changes in urban community management mechanisms, which can help to enhance building resilient cities. In summary, there is an urgent need for an in-depth exploration of the correlation between urban community collaborative governance and building resilient cities. governance and building resilient cities. Huang Ling, Zheng Yiao, Luo Junhang, and Xu Jianfeng (2023) stated in their study that urban community collaborative governance is needed in urban community governance, so the government mainly assumes the responsibility of supervision in the governance process. Therefore, uncoordinated management is caused by the lack of government supervision. Thus, the Governmental Organization should fully play its supervisory role to promote the construction of collaborative governance mechanisms in urban communities. Li Jian, Li Yujie (2022) In the study, it is stated that mega-city development has become a trend in China and that this development pattern has formed \"The paradox of urban development.\" Therefore, based on the theory of public service chain and modularization, the combination of chain and block effectively enhances urban community collaborative governance. In these chains, corporate development has become a vital link, especially in strengthening the capacity of enterprises, which can effectively improve the capacity and supply of public services in urban communities, thus forming a diversified body of services. Sun Bisheng (2022) stated that as the modernization of cities continues, the risk to urban communities is also increasing. Therefore, the power of urban community collaborative governance requires the participation of social organizations and the use of modern governance techniques to enhance the ability of urban communities to respond to public crises. Xu Feng and Chen Qirong (2023) stated that the urban community is the \"end\" of the urban governance unit. Thus, building resilience cities must be strengthened by improving community governance systems. Therefore, urban community collaborative governance can effectively complement the deficiencies in modern urban community governance, thus opening up the critical points of Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 4 urban community governance and realizing the internal microcirculation in urban community governance. Therefore, urban community collaborative governance can effectively enhance building resilience cities. Terblanche, De Sousa, and Van Niekerk (2022) stated that strengthening and building resilient cities can effectively respond to current and future risks. For the City of Tshwane, building resilient cities is a massive challenge as it requires the shared commitment and cooperation of different players in the city. Therefore, in the process of constructing the resilient cities framework, urban community collaborative governance is required. Apostu, Vasile, Vasile, & Rosak-Szyrocka (2022) stated that during COVID-19, Smart Cities contributed significantly to the fight against the epidemic in urban communities. Smart Cities are socio-economic systems created by governmental, corporate, and social organizations. Therefore, in building resilient cities, the correlation between Smart Cities and urban community collaborative governance is strong and can effectively influence building resilient cities.",
    "scholars have studied the correlation between urban community collaborative governance and urban community collaborative governance, which has been very fruitful and provides a substantial reference value for this study. However, it is different for the body of research on urban community collaborative governance. Fewer studies integrate governmental organizations, corporate organizations, and social organizations into urban community collaborative management, and fewer studies correlate them with building resilience city. Regarding research methodology, a large amount of historical literature is analyzed through descriptive analyses, typical case studies, and literature review types of comments are more frequent, but the use of structural modeling equations is less frequent. Therefore, based on Synergistic Governance Theory（SGT）, this study identifies urban community collaborative governance research subjects as three areas: governmental organization, corporate organization, and social organization. Based on the historical literature, the duties of the three subjects are divided into the regulatory responsibilities of the Governmental Organisation, the capacity enhancement duties of the Corporate Organisation, and the active participation duties of the Social Organisation. Therefore, the variables of this study are Government Regulation（ GR）, Corporate Capabilities（CC）, Social Organisation Involvement（SOI）, and Building Resilience Cities (BRC). The problems and causes in urban community collaborative governance are further identified by analyzing the correlation between the variables, thus providing a theoretical basis for promoting building resilient cities. Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 5 Principles, Processes, and Practical Tools,” The National Policy Consensus Center (NPCC), in its grassroots stewardship work, has facilitated hundreds of collaborative governance projects in each of Oregon's states, contributing significantly to the city's growth. Therefore, this study focuses on urban community collaborative governance. Urban community collaborative governance is based on the evolution of Synergistic Governance Theory (SGT). The main research subjects in urban communities are government organizations, corporate organizations, and social organizations. By reviewing the historical literature, the subjective responsibility of the Governmental Organization is clarified as the duty of supervision, the subjective responsibility of the Corporate Organization is clarified as the duty of competence, and the subjective responsibility of the Social Organization is clarified as the duty of active participation. Therefore, this study takes how to enhance Urban Community Collaborative Governance (UCCG) as a research component and identifies Governmental Regulation (GR), Corporate Capabilities (CC), and Social Organization Involvement (SOI) as independent variables. Lawrence J. Vale, in “The Resilient City: How Modern Cities Recover from Disaster” states that a large number of cities have been destroyed in disasters. However, these cities have been rebuilt after the destruction and there are a variety of commonalities and significant differences in post-disaster urban reconstruction. The study of these issues enables exploring the value of building resilient cities. From the research literature in recent years, building resilient cities is a hotspot of urban management research in recent years（Qu, 2023). The role of urban community collaborative governance in building resilient cities cannot be ignored, and research on the correlation between the two has become an inevitable topic. Based on Synergistic Governance Theory（SGT）, this study hypothesizes that the three subjects of urban community collaborative governance, government regulation, corporate capabilities, social organizational involvement, and building resilience cities are correlated and can influence each other. Based on this, this study proposes a hypothetical correlation model between urban community collaborative governance and building resilient cities. This is shown in the figure below. Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 6 corporate, and the social organizations, in collaborative urban community governance. Description of the research variables according to the different subjects' social values. Therefore, the primary research in this study is that there is a correlation between Governmental Regulation (GR), Corporate Capabilities (CC), Social Organisation Involvement (SOI), and Building Resilience Cities (BRC). In terms of enhancing the safety of urban communities, there is a need to look at several aspects such as technology, management, and culture, and the better the level of government regulation of these three aspects, the better it will be for building resilience cities (Fan Weicheng, 2022). It can be inferred that there is a positive and significant effect between governmental regulation and building resilient cities. Building resilient cities is a complex task, and urban development requires continuous innovation in science and technology. Enterprises can make up for the lack of this aspect and give full play to the ability of enterprises to help build resilient cities (Yang Rongjun, 2022). Accordingly, it can be inferred that corporate capabilities and building resilient cities have a positive and significant effect. Social governance needs community, and urban community governance is inseparable from community participation. The current community management does not play to the self-worth of social organizations. Only by constantly improving the participation of social organizations is it possible to improve the management mechanism of the community and can strengthen the building resilience cities (Li Xingguo, 2023). It can be inferred that there is a positive and Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 7 The scale for this study was firstly designed based on the variable indicators of previous researchers as a reference and then based on the content of the research expected to be investigated in this study. At the same time, this scale was designed independently, so a pre- survey was required. The address of this study is Zhengzhou City, Henan Province, China. Henan Province is one of the most populous countries in China, and Zhengzhou City is the capital of Henan Province, so it is of general statistical significance to carry out a study on Zhengzhou City. Therefore, conducting a study on Zhengzhou City is of general statistical significance. The pre-research was conducted with community residents. By checking the relevance and reliability of the indicators in the questionnaire scales, it was possible to determine whether the questionnaire met the research needs.",
    "In the pre-researched, 35 questionnaires were distributed, and 30 valid questionnaires were obtained after excluding questionnaires that did not meet the requirements. The options were all the same, and the options were missing. The questionnaires collected were collated and analyzed, and through Project Analyses (PA) and Exploratory Factor Analysis (EFA), it was possible to find out that the test results excluded selections with Factor Loadings (FL) less than 0.5. The scale is based on the Likert Scale（Likert Rensis, 1932）, with values 1-5 corresponding to five different levels of responses, namely, \" Strongly Disagree, Disagree, Unsure, Agree, Strongly Agree.” Finally, the following valid questionnaires were obtained. Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 8 As of December 2022, the resident population of Zhengzhou City is 12,828,000 (values from Zhengzhou City Demographic Development Report). According to Sample Size Determination Using Krejcie and Morgan Table (Krejcie & Morgan, 1970), the count of the whole population (N) is more than 1,000,000, and the sample size (n) has to be 384 people. Therefore, the number in this sample was determined to be 384. To ensure the comprehensiveness of the study data, the questionnaire was distributed in 84 street offices in six jurisdictions of Zhengzhou City. Since this study used a web-based questionnaire, which Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 9 has the phenomenon of missing research data or inaccurate research subjects, each street office issued five questionnaires for residents of the community under its jurisdiction to fill in, so a total of 420 questionnaires were issued. Excluding unqualified questionnaires such as options are all the same and options are missing, the number of valid questionnaires recovered was 384, which is a 91.4% recovery rate. In this study, 384 valid questionnaires were analyzed descriptively. The analysis is based on gender, area of residence, age, and length of time living in the community to determine the characteristics of the research population. The specific analysis is as follows. The basic information of the respondents is shown in the table below. In the gender distribution, as can be seen, the proportion of women is higher than that of men. As some families in Zhengzhou City have men working outside the home, most women live and work around the neighborhoods where they live, so women better understand community management. In terms of distribution by area of residence, Since the distribution for this study was 5 copies for each street office, the number of copies recovered from each street office was also 5. After excluding invalid questionnaires, the following data were obtained. As can be seen, the number of street offices varies from region to region. Jinshui District has a significantly higher Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 10 Yuxi, H., Ahmad, A., Talib, Z. M. (2023) The Relationship Between Urban Community Collaborative Governance and Building Resilience Cities in Zhengzhou City, Henan Province, China number of neighborhood offices than Shangjie District, even quadrupling the data. It can be seen that the population of Zhengzhou City shows an uneven distribution. In terms of age distribution, more people completed the questionnaire 31-50 years old. Therefore, it can be inferred that more young and middle-aged people live in the neighborhoods of Zhengzhou City, while the elderly and minors live in smaller numbers. At the same time, because young people often communicate with community managers on matters of business, they have a higher degree of understanding of the community, and young people pay more attention to the management of the community and the construction of the city, which is more conducive to the development of the city. In terms of the breakdown of time spent living in the community. The combined total of community residents aged 0-5 years and 6-10 years amounted to 82%. It can be seen that Zhengzhou City's community development is relatively late. Many people are new to living in the city, and the city's community building is also relatively late. As a result, many people have entered Zhengzhou city to work and live in the last decade. At the same time, it analyses the political context of urban development in Zhengzhou City. 2003, since the implementation of China's \"Rise of the Central Plains Programme,” Zhengzhou City has been expanding over the past 20 years, reaching unprecedented heights in terms of area, population, and economy. Therefore, urban community development and building resilient cities in Zhengzhou City is relatively arduous.",
    "As seen from the above analyses, the subjects studied present the following characteristics: a predominance of women, uneven population distribution, many young and middle-aged groups, and the late development of urban communities. The above characteristics are consistent with the overall distribution characteristics of the current urban residential population. This study used SPSS 26.0 data analysis software to analyze the 13 question items in the scale. The results show that the Cronbach'a value of the different dimensionality is between 0.816 and 0.860 (0.8 < Cronbach'a < 0.9), which indicates that the scale’s reliability is excellent, the reliability is higher, and the stability is better, the questionnaire has a good consistency. Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 11 Yuxi, H., Ahmad, A., Talib, Z. M. (2023) The Relationship Between Urban Community Collaborative Governance and Building Resilience Cities in Zhengzhou City, Henan Province, China In this paper, Validity was tested by Exploratory Factor Analysis of the scale, measured by KMO, Bartlett Bartlett's Test of Sphericity, and cumulative variance contribution rate. The result shows that KMO=0.872>0.8 indicates that scale data has good Validity. Bartlett's Test of Sphericity shows that Similar Chi-Squared Test=2295.236, df =78, Sig=0.000 This shows that the scale Unified Validity can be better and is appropriate for variable Factor Analysis. In addition, for the 13 questions in scale, the common factor of scale data is extracted by Maximal rotation of variance and eigenvalue ＞1. According to the principal component feature, for PCA > 1 criterion，hcf = 5， Cumulative of Variance = 73.728% > 50%. It can be seen that the common factor can explain these four variables, and the results of Factor Analysis present suitable, these four variables can be effective in extracting the information of the research item. In addition, 0.837 < CR < 0.866 (CR > 0.7) and 0.617 < AVE < 0.66 (AVE > 0.5) for each latent variable, indicating that the Latent variable has better convergent validity. The specific analysis is shown in the table below. Meanwhile, this study further explores the research model through the correlation table of discrimination validity. Correlation analysis showed that GR (r=0.421, p=0.01), CC (r=0.463, p=0.01), SOI (r=0.385, p=0.01), and BRC showed a significant positive correlation at the 1% level. Relationship. The details are shown in the table below. Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 12 Meanwhile, the minimum value of the square root of AVE value of each Latent variable located on the diagonal is 0.785, which is greater than the maximum value of the Correlation coefficient of each Latent variable located on the off-diagonal is 0.463, i.e. The value of correlation coefficient between each latent variable is less than the square root of AVE value of each latent variable. This indicates that the discrimination validity of the model is better. Based on the above test and analysis, the SmartPLS software calculates the established Structural Equation Model (SEM), and the standardized paths are obtained, as shown in the figure below. After obtaining the SEM, further path inspection and analysis can be carried out. Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 13 In this study, the Smart PLS data analysis software was used to perform goodness of fit for the established Structural Equation Model (SEM). After modification indices for goodness of fit, the results of curve fitting are tabulated in the following table. The following metrics were used in this study to measure the curvilinear fitting of the measurement model: SRMR = 0.055 (<0.08), d_ULS = 0.273 (<0.95), d_G = 0.150(<0.95), and NFI = 0.850 (0.80 <NFI <0.09). It can be seen from the above that the results of the model test satisfy the range of judgmental criterion values. This indicates that the model has an excellent assessing fit degree for the sample data group. In this study, the SEM path test analysis results mainly contain the coefficient of standardized paths between each latent variable of standardized error, T value, and P value. where the positive sign of the coefficient of paths meets, and the negative sign indicates the direction of the influence relationship between variables. The P-value mainly indicates the level of significance of the effect relationship. In the table, the p-values are less than 0.05, thus indicating that the two variables are significantly correlated at 95% Confidence limit, it is considered that there is a strong and significant influence relationship between the two variables, and the hypotheses can be further tested to see whether they are valid or not.",
    "Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 14 The path coefficient value of Governmental Regulation (GR) on Building Resilience Cities (BRC) is 0.298 >0. Moreover, this path presents a significant level of 0.001 (p=0.000<0.001), which indicates that Governmental Regulation (GR) has a positive and significant effect on Building Resilience Cities (BRC), and hypothesis H1 is valid. When community residents believe that strengthening the capacity of governmental regulation can promote the collaborative governance capacity of urban communities, which is conducive to building resilient cities. Most of the community residents surveyed believe that increasing the strength of governmental regulation and giving full play to the maximum benefits of governmental regulation can effectively improve the community's ability to resist disasters and that these measures are very favorable to building resilient cities. In other words, the stronger the government regulation, the more conducive it is to build resilient cities. The path coefficient value of Corporate Capabilities (CC) in Building Resilience Cities (BRC) is 0.230 >0. Moreover, this path presents a significant 0.001 (p=0.000<0.001). It indicates that Corporate Capabilities (CC) positively and significantly affect Building Resilience Cities (BRC), and hypothesis H2 is valid. When community residents believe that strengthening corporate capabilities can promote the collaborative governance capacity of urban communities, thus contributing to building resilient cities. Most of the community residents studied believe that strengthening the self-efficacy of corporations themselves in community management and fully releasing corporations’ energy in responding to disasters can effectively enhance the community's ability to resist disasters and that these measures are favorable to building resilient cities. In other words, the greater the corporate capabilities, the more conducive to building resilient cities. Resilience Cities (BRC) is 0.208>0. Moreover, this path presents a significant level of 0.001 (p=0.000<0.001), which indicates that Social Organization Involvement (SOI) has a positive and significant effect on Building Resilience Cities (BRC), and hypothesis H3 is valid. When community residents believe that enhancing the participation of social organizations involvement in community governance can promote the collaborative governance capacity of urban communities, thus contributing to building resilient cities. Among the community residents surveyed, most of them believe that social organizations need to participate in the process of community management actively, and the greater the number of people, the better the management mechanism, and that stimulating the participation of social organizations can enhance the community's ability to resist disasters, and that these measures are very beneficial Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 15 to building resilience cities. In other words, the greater the participation of social organizations, the more conducive to building resilient cities. (GR), Corporate Capabilities (CC), and Social Organization Involvement (SOI) in building resilient cities. Strengthening Government Regulation, Corporate Capabilities, and Social Organization Involvement can all contribute to building resilient cities. It should be noted that these three influences are only three factors affecting building resilient cities and are not representative of the full range of factors. Therefore, the reverse is invalid. capabilities, and social organization involvement can all contribute to urban community collaborative governance. The reverse is invalid. However, these three factors only represent three factors that influence urban community collaborative governance and do not represent all of them. Therefore, reversal is not a valid judgment in this study. This study can make it clear that urban communities can construct a new governance system through the three aspects of government, companies, and social organizations, and through strengthening the collaboration among the three, to enhance the management capacity of urban communities and realize the modernization of the governance capacity and level of governance of urban communities, to provide new ideas for enhancing the building resilience cities set up. Based on the above findings, it can be seen that: there is a significant positive correlation between the two. Meanwhile, there is a significant positive correlation between government regulation, corporate capabilities, social organization involvement, and building resilient cities. Therefore, strengthening government regulation, corporate capabilities, and social organization involvement will help strengthen urban community collaborative governance and contribute to building resilient cities. The strengthening of government regulation, corporate capabilities, and social organization involvement will help to strengthen urban community collaborative governance and help to promote the building of resilient cities.",
    "Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 16 In the process of urban community governance, there are two main problems regarding the strength of governmental regulation. First, there is insufficient leadership of the government theme. Secondly, the government's planning for collaborative governance is unclear. There are two main paths to the solution. First of all, government workers should constantly clarify their primary responsibilities, starting from the transformation of the content of the work position, the transformation of rules and regulations, etc., to fundamentally strengthen the government's strength in supervision and enhance the government's leadership in the community. Secondly, government units should organize more community work cases from the perspective of collaborative governance, prompting government staff to change their thinking, and strengthen their work capacity, by inviting professional community managers to do an excellent job of planning for the primary duties and responsibilities to lay the foundation for collaborative community governance. capabilities. First, companies do not fully integrate themselves into community work. Secondly, enterprises’ capacity is insufficient to deal with risks in the community. There are two main paths to solving the problem. First of all, changing the thinking of corporate managers does not make the company independent of community management because the staff in the company, the business content of the company, and the development of corporate culture are all closely related to the development of the community. The prosperous development of companies requires the community to provide work and financial, and material resources. Therefore, in carrying out their work, corporations should integrate their management with that of the community to enhance the influence, role, and integration of corporations in society, thereby strengthening their capacity and contributing to community development. Secondly, there are large and small enterprises, fast and slow corporate development, and business enterprises involving all kinds of industries. Hence, the capacity of each enterprise is different. Some companies can quickly respond when a disaster occurs in the community. In contrast, others need the assistance of the government and society, so companies need to improve their ability to cope with disasters continuously. When a disaster occurs in the community, they can provide In urban governance, there are two main problems with the positive aspects of social organization involvement. First, there is not enough recognition of social organizations. Secondly, there are not enough participants in social organizations. The two main issues addressed are as follows. First of all, the recognition of social organizations requires the Intern. Journal of Profess. Bus. Review. | Miami, v. 8 | n. 9 | p. 01-22 | e03561 | 2023. 17 recognition of governmental units or professional bodies, and the formation, establishment, development, and growth of social organizations require the support of the government and enterprises, as well as the attention of other members of society to the group. For example, the government can release social organizations' numbers, types, and application requirements through official platforms and offer reasonable incentives, thus prompting social organizations to be recognized by outsiders and thus enhancing their participation. Secondly, there are more types of social organizations. However, there is a significant lack of standardized training, reasonable exercises, and appropriate publicity, so many community residents are unaware of the existence of social organizations. This is especially true of people with specialized technical skills who provide value only in their workplaces and do not give full play to their social value. Therefore, extensive publicity and appropriate stimulation of the residents' enthusiasm can prompt the community residents to actively participate in social organizations when the community and the city encounter the disaster process. The timely formation of social organization groups with professional skills, organizational discipline, and professional equipment to respond to the occurrence of the disaster promptly, as far as possible, to reduce In promoting the functioning of government, enterprises, and social organizations, we are promoting the collaborative governance of urban communities, a model of community management that breaks down the \"old system\" and forms a \"new pattern.” It is also a management model that has evolved in the continuous development of urban society and is suitable for modern society. This model can promote the political and economic development of the city, but also to improve the living standards of the residents, more able to reduce the risk of the living environment of the residents, but also able to timely response to the arrival of the risk to enhance the resilience of the city in order to strengthen the residents in the city to live in the sense of security and happiness."
]