[
    "All issues of this journal are alternatively stored and archived by: the National Library of Thailand, Russian E-library and Index Copernicus library of journals, Poland This study aimed to investigate the current teachers’ competency level and teacher leadership status, to explore the relationship and impact between teacher leadership and _ their instructional competencies, and to develop a teaching leadership model for enhancing the teachers’ instructional competencies at the private high schools in Henan province, in China. Through systematic literature review, the researcher developed a questionnaire to survey teachers’ leadership and instructional competencies. The researcher surveyed 402 full-time teachers from three private high schools in Henan Province. The study found that 1) teachers' instructional competencies at the private high schools of Henan Province, in China, were at the moderate level. 2) Teachers’ instructional competency level was also at the “moderate” level. 3) There is a significant positive correlation between teacher leadership and instructional competencies. 4) Teacher leadership has a measurable impact on instructional competencies. 5) The developed teacher leadership model could help improve teachers’ instructional competencies in private high schools in Henan Province. The researchers Lecturer, Doctor of Education Program in Educational Administration, Graduate School, Stamford International University, Bangkok, Thailand Research interests: education, teaching, students’ motivation discussed each finding and recommended schools that can foster continuous professional growth among their educators, resulting in tangible improvements in instructional quality. JEL Classification: 121: Analysis of Education; J24: Human Capital; Skills; Occupational Choice; Labor Productivity; M12: Personnel Management; 128: Education: Government Policy Teaching is one of the oldest, but a noble profession, which is still revered as the profession of changemakers (Fullan, 1991), to bring the necessary transformations to society. Given the globalized world, new businesses flourish daily, and knowledge growth peaks exponentially. In this new situation, instructional competencies become very important, and schools must be founding places that inculcate new knowledge and skills in their avid learners. Hence, teachers must position themselves to acquire new instructional competencies apt for 21st-century teaching and learning and adopt trendy strategies to counter the needs of learning in this ever-changing world. Teaching is a complex cognitive skill that focuses on knowledge, ways of constructive planning, and conducting effective lessons that impart knowledge and content in the best possible ways (Day, 2004). Teacher leadership plays an important role in ensuring the development of skills essential for good teaching and learning that are apt to the type of school, its environment, climate, and culture. Teacher leadership is considered one of the core practices of successful school change because teachers are critical in the teaching process (Huang, 2016). To truly make teachers participate in school reform and development, it is necessary to change teachers' traditional role as passive followers and let them assume the professional responsibilities they deserve (Li et al., 2013). Previous studies showed that teachers are the foundation of the education system. Teacher leaders are significant in the teaching workforce as role models for novice teachers, leading to better school outcomes (Zhou & McLaren, 2021). Teacher leaders are agents of change, and this role should be nurtured and explored so that teachers can lead initiatives, challenge the status quo in schools, and pursue excellence in teaching and learning (Grant et al., 2010). Pigozzi (2008) also stated that quality teachers and their instructional competencies meant a lot to increasing school productivity; the quality of the teachers, with their instructional competencies, may be able to engage more students in meaningful teaching and learning practices. The key to standardizing the quality education system is relying on the teachers’ competencies (Jyoti & Sharma, 2009). China's educational reform and the internationalization of educational ideas have been progressing. The outline of China’s National Plan for Medium and Long-term Educational Reform and Development 2010-2020 mentioned that the teachers who can play the part of leaders in the school are expected to be exemplary and radiating. Moreover, the Professional Competency Standards for High School by the Ministry of Education of the People’s Republic of China in 2021 show the call for developing teacher leadership in school. Simultaneously, to enhance the high-quality balance of education in China, teacher leadership has emerged as the primary trend of education reform, a collaborative effort involving multiple forces (Weng, 2016). Therefore, it is essential to fully trust the professionalism of teachers, make full use of their leading role in education reform, develop a cadre of willingness and ability to engage in change activities, and influence other teachers (Ye & Zhu, 2018).",
    "The analysis suggests that there is an urgent need to cultivate the field of teacher leadership research (Qi et al., 2021). The research on teacher leadership in China mainly focused on teachers with formal positions, and there is little literature on teacher leadership development in China (Zhong & Xu, 2011). Research has demonstrated that the level of teacher leadership among high school teachers in China remains incomplete. Thus, this study tries to focus on the development of teachers’ instructional competencies through a teacher leadership model derived through knowledge, research, and strengthening through implementation at the private high schools in Henan province, China. - to explore the relationship and impact between teacher leadership and their instructional competencies at the private high schools in Henan province; - to develop a possible teacher leadership model for enhancing teachers' instructional competencies at the private high schools in Henan province. Teachers’ instruction competencies need teachers’ professional guidance and facilitation for students to learn. Every action that an instructor takes in the instruction process has the aim of facilitating the students’ learning and mastering certain competencies. In other words, the instructional task, as a planned activity, aims to facilitate learning, and the quality of teaching determines the quality of learning. Additionally, there should be a match between instructional methods or strategies and the intended learning outcomes (Glickman et al., 2013). Although it may attempt to define instruction or teaching and learning as stand-alone terms, the two are inseparable. Literature revealed that teacher characteristics and actions in classrooms have a significant impact on student learning, the acquisition of knowledge, and their learning processes (Philpott et al., 2010). In general, teachers! instructional competencies included the important cognitive parts that could make them effective. To do this, the teacher needs to develop a number of competencies, such as 1) teacher knowledge, 2) ways of organizing lessons, 3) the quality of teaching and presenting, and 4) being able to clearly communicate. Leadership does not only involve teacher-based positions of power and authority formally but also tends toward a level of knowledge and skills. Teacher leadership attributes consist of knowledge, skills, and values shown by teachers who have a positive impact on student learning, both official and unofficial, in the classroom or outside the classroom. Teacher leadership also helps improve students' academic achievements. Future teachers should consider teacher leadership as a guide for developing their own leadership skills. Teacher leadership should be able to produce quality teachers. In addition, this study will bring awareness to the teachers' own teacher leadership. This is due to the close relationship between a school's success and the leadership of its teachers. Schools offer current teacher leadership development to help teachers grow professionally. The goal is to improve teachers' professional skills by improving their (a) pedagogical knowledge, (b) pedagogical skills, (c) pedagogical creativity, and (d) pedagogical innovation (Buharkova & Gorshkova, 2007). In China, the role of teachers leading does not get enough attention yet, and the sense that teachers can become leaders is vague. Therefore, if teachers want to play a leadership or management role, they first need to be promoted to a formal leadership position, resulting in the loss of excellent front-line teachers (Jin, 2007; Lou, 2015). At the same time, teachers who take a formal leadership role are considered superior to other teachers. Consequently, teacher leaders, such as backbone teachers, hold a status that is unequal to other teachers. They have a mentoring relationship with colleagues, in which teacher leaders are \"experts,\" and others are \"inexperienced teachers”. Teacher leadership is about working together to solve problems based on shared interests, not a mentoring relationship (Lou, 2015). Teachers’ complicated role in China's schools is unconscious, and teachers lack conscious leadership concepts. Their leadership among other teachers is unconscious and invisible. Those teachers impact others but do not realize this (Wang & Wang, 2020; Su, 2020). Teacher leaders need to help teachers balance the relationship among colleagues and leaders and maintain a harmonious atmosphere in school (Li et al., 2013). As a result, some teachers are reluctant to take a leadership role to avoid conflict with colleagues, leading to a breakdown of rapport with colleagues (Jin, 2007; Ma, 2013). In a nutshell, the primary factors impeding teacher leadership in China include principals' incorrect leadership style, competitive school tasks, traditional culture, hierarchical systems, the absence of an ideal teacher leadership system, the principal's lack of support for teacher leadership, and factors specific to teachers themselves (Jin, 2007). Under the current development of teacher leadership in China, the backbone teacher is the only official teacher leader (Wang & Wang, 2020).",
    "The development of teacher leadership should also include the process of teachers seeking mutual understanding of leadership roles and support from colleagues and leaders in the school (Chen & Lu, 2010). Formal and informal teacher leadership is equally important in school development. Too few opportunities and too much focus are detrimental to enhanced peer interaction. Hierarchy and instrumentality also make teachers subject to bureaucratic power, which is not conducive to empowering educators (Chen & Lu, 2010). The development of informal teacher leadership in China has not received enough attention. Formal teacher leadership is the backbone of teachers as an example; although indispensable, the development of an extreme will do more harm than good. The unfair system of formal teacher leadership may bring about the problem of fairness; just letting a few teachers Therefore, previous Chinese researchers suggested focusing on a few perspectives to promote or improve teachers’ leadership in Chinese schools (Jin 2007; Chen & Lu, 2010; Sun & Cheng, 2020). Overall, Henan's private schools are developing healthily and gradually, with standardized school-running behaviors in place. The quality of education and teaching has improved year by year, the employment situation of graduates is good, and a diversified development model, a flexible school-running mechanism, and the school-running characteristics of one school - one policy - have gradually formed (Jin, 2007; Luo, 2021). The overall number is small, and the conditions for running schools are weak. Although private schools in Henan have developed rapidly in recent years, they are still insufficient in terms of total number. After years of development and accumulation, private schools in Henan have a certain foundation. Except for a few schools with large investments and long running times, most schools still have a certain gap in terms of their running level, education, and teaching quality compared with public schools. Especially in the compulsory education stage, with the government's responsibilities in place and the implementation of the \"two exemptions and one subsidy\" policy for compulsory education, it is difficult for those private schools that invest less capital and rely solely on education to support students to survive. Most of the teachers in many private schools are part-time or temporary hires. In some schools, part-time teachers account for more than 50%, which affects the level of running private schools. In private schools or educational organizations, most full-time teachers are young teachers under 30 and old teachers over 60, with a small proportion of middle-aged teachers. This teaching structure inevitably affects the sustainable development of schools (Jin, 2007). To catch up with the world's advanced level and develop the country into a strong socialist nation, it can also rely on private education. Another aspect of private education is to meet the needs of different levels and corners of society, because although public education is relatively standardized, with a fairly large and formal investment scale, its mechanism is difficult to meet the needs of all levels of society. Many of these types of education must be met by private education, so there is a close relationship between private education and the market, whose basic function is to meet social needs (Ma, 2013). According to Li et al. (2013) report on private education (primary school, junior high school, and high school) in Henan Province, he mentioned the development of private schools in Henan in general was healthy and gradual, and school-running behaviors were standardized. In the development process of private education in Henan, the provincial government and relevant departments have conscientiously implemented support policies to truly treat private schools and public schools equally. However, Su (2020) also pointed out that to compete with the public schools in the areas, the private schools still face challenges like lack of professional teachers, high teacher turnover, and unstable teacher quality, and so on. Private schools need to invest more in the professional development of their teachers, particularly in building a stable and competent teaching team. The selected private schools are comprised of kindergartens, primary schools, and middle schools, which not only emphasize foreign language learning from kindergarten to middle school but also attach importance to the cultivation of learners' multiple intelligences and positive habits. As mentioned, the research focused on all full-time teachers from these 3 private high schools in Hehan province, China, including Zhenghang Experimental High School, Jiaozuo Yuhua Experimental School, and Xuchang Yuhua Experimental School.",
    "These three private schools are selected as representatives of three main regions of Henan Province, as well as the top leading private schools. We distributed the questionnaires by email directly to each school from the first semester to the end of the second semester in early 2024. A total of 402 full-time teachers were surveyed; the researcher received 89% of valid questionnaires from the 358 teachers, and the related data were put into the data analysis. After the data collection, the researcher also recorded and processed the data with the assistance of the school administrator. The questionnaire developed by the researcher in this study was named the Questionnaire on Teacher Leadership and Instructional Competencies at Private High Schools in Henan Province of China. 2) The second part of the questionnaire is teacher leadership. Researchers primarily developed the questions’ contents based on a systematic literature review, previous studies, and relevant theories, which included six key domains. This part of the questionnaire was based on the Teacher Leadership Standards Model and then adapted to the actual situation of the targeted Chinese schools in the Henan region for the study. 3) The third part of the questionnaire was to assess the instructional competencies of teachers at the private high schools in the Henan Province of China. As explained, the researcher didn’t change too much in terms of questionnaire design. The original researcher’s Cronbach’s alpha coefficients were all above 0.7. As aresult, the teachers' instructional competencies at the private high schools of Henan Province, in China, were at the moderate level, as the total mean scores were 3.42, which was in the range of 2.51-3.50, belonging to the moderate level. Among the six dimensions, the dimension of acquisition of content knowledge and skills was the highest (mean=3.56, SD=.612), which was the only dimension researched as a “high level”. Then, the dimensions were at moderate levels. These included creating a good learning environment (mean=3.45, SD=.600); helping students learn (mean=3.41, SD=.600); thinking about how to improve teaching (mean=3.40, SD=.578); and learning how to be a good leader (mean=3.39, SD=.548). These indicated that teachers’ instructional competencies are still lacking in teaching reflection and developing leadership skills. The study focused on the leadership level of teachers at private high schools in Henan province, China. Similar to their instructional competency level, it was at the “moderate” level, as the total mean score was 3.48, which was in the range of 3.51-4.50; it was regarded as the high level. Among the four factors, the lowest score was for assessing and using research findings (mean = 3.19, SD = .591), while the highest score was for promoting the assessment and data (M = 3.54, SD = .601), making it the only item to reach a \"high level”. Research objective three: to explore the relationship and impact between teacher leadership and their instructional competencies at the private high schools in Henan province Findings from Pearson's correlation coefficient analysis showed that the seven areas of teachers' leadership perception and the five areas of their instructional competencies were all strongly linked. Most of the correlations had moderate-to- high positive associations. In general, the overall teachers’ leadership was highly correlated with the five dimensions of their instructional competencies, as shown that all aspects are strongly positively correlated with the overall relevance. As the detailed p-values and Pearson correlation coefficient results showed, among different domains and dimensions, ACKS was highly related to PAD, FSL was highly related to ASP, DLS was highly related to PPL, ECLE was highly related to CFC, and RTP was highly related to AUR; all these highly correlated factors would be considered to use in the model development process. The regression analysis showed that the leadership domains of teachers had a strong relationship with the teaching competencies dimensions at private high schools in Henan Province, China. As the B scores and P value showed, the dimensions of FFC impacted ECLE the most (p=.004, B=.216), the dimension of AUR impacted RTP the most (p=.004, B=390), the dimension of PPL impacted the DLS the most (p=000, B=.328), the dimension of FII impacted ESL (p=000, B=.382), the dimension of PAD impacted ACKS (p=.007, B=.273), the dimension of CFC impacted ACKS the most (p=000, B=.485), the dimension of ASP impacted ESL the most (p=.004, B=.20), and overall, the teachers’ leadership impacted all the domains of their instructional competencies, including ACKS, FSL, DLS, ECLE, and RTP.",
    "In conclusion, the correlation and regression analysis demonstrated a significant relationship between the leadership dimensions of teachers and their instructional competencies. The main quantitative results from the correlation and regression analyses, along with the descriptive results of teachers' leadership and teaching skills, were used to come up with a proposed model. The researcher also submitted the model to nine experts for their review and validation. Absorbing all the essence of the experts’ suggestion, this researcher also revised the teachers’ leadership model for enhancing teachers’ instructional competencies at the private high schools in Henan Province of China. The finalized model was presented in Fig. 1. The notes outline the steps and explain the dimensions and domains. It's also clear that the straight-line changes into a waved line and isn't directly separated from the pentagon's angle. This shows how the dimensions and domains interact with each other. This clearly shows how the dimensions and domains interact, and it represents the main functions of the teachers' leadership model to improve teachers' teaching skills in private high schools in Henan province, China. Step 1: Starting from activities of cultivating DLS (Developing Leadership Skills), through the focus on PPL (Promoting Professional Learning) and FII (Facilitating Instructional Improvement). Step 2: Then turn to improve ECLE (Establishing a Conducive Learning Environment) through the focus on FCC (Fostering a Collaborative Culture) and CFC (Collaborating with Families and Communities). Step 3: Follow by increasing RTP (Reflection of Teaching Practices) through the focus on CFC (Collaborating with Families and Communities) and AUR (Assessing and Using Research). Step 4: Transform to maintain ACKS (Acquisition of content knowledge and skills) through the continuous focus on PAD (Promoting the Assessment and Data). Step 5: Last but not least, it must be back to FSL (Facilitation of Student Learning), based on the focus of ASP (Advocating for Student and Profession) and FII (Facilitating Instructional Improvement). A strong positive correlation was identified between teacher leadership and instructional competencies. Teachers with better leadership abilities tended to demonstrate higher instructional competencies. Leadership practices such as mutual communication and collaboration, as modeled in group discussions and moral education case studies, fostered a culture of shared responsibility and higher performance standards among teachers. The significant positive correlation between teacher leadership and instructional competencies is well-documented in educational research. Instructional leadership is a fundamental component of teacher leadership, encompassing the ability to lead in instructional practice beyond mere content delivery. This includes coaching, mentoring, and fostering collaborative relationships, all of which enhance instructional competencies, as confirmed by the Teacher Leadership Institute. A study that looked at the link between school leaders' instructional leadership and teachers' functional competency also found a very strong one. This means that teachers with higher levels of competency are likely to have effective instructional leadership. The significant correlation between teacher leadership and instructional competencies aligns with theoretical models that underscore their interdependence. Teacher leadership was found to have a direct and measurable impact on instructional competencies. Teachers who embraced leadership roles, such as those in the expert group tasked with observing and selecting top-quality courses, exhibited enhanced competencies in their own classrooms. The direct impact of teacher leadership on instructional competencies is supported by theoretical frameworks that emphasize the role of leadership in educational settings. Competencies for teacher instructional leadership include coaching, mentoring, and building collaborative relationships, which directly influence teaching practices. The National Education Association (NEA) also says that teacher leaders can work with administrators and other important people to improve the quality of teaching. This shows how teacher leadership can completely change how teachers teach. Zhenghang Experimental High School's initiative, including leadership workshops and peer observations, mirrors research findings that structured leadership opportunities lead to improved instructional competencies. The significant improvement in instructional competencies following the implementation of a teacher leadership model is consistent with findings from previous studies. The Teacher Leadership Institute (TLI) emphasized that leadership in instructional practice involves more than content delivery; it includes guiding peers, leading professional development, and advocating effective instructional strategies. Additionally, research has shown that instructional leadership promotes teacher leadership by improving teaching practices across the school, leading to enhanced instructional competencies. The improvement in teachers’ instructional competencies following the implementation of a teacher-led model aligns with empirical studies emphasizing the importance of leadership models.",
    "The findings are consistent with prior research and theoretical frameworks, emphasizing the critical role of teacher leadership in enhancing instructional competencies. Building on transformational leadership theory, distributed leadership models, and empirical evidence, schools should continue investing in leadership development programs."
]