[
    "Abstract: In recent years, the foreign direct investment attracted by Henan Province has been increasing and has become an important driving force of Henan Province's economic development, but the scale still has a large gap with developed provinces, the analysis of its influencing factors is beneficial to our further introduction of investment and future policy guidance. Based on theoretical analysis, this paper selects six variables as the influencing factors of FDI, including the scale of economic development, the state of economic development, labour cost, infrastructure level and trade policy orientation, and openness to foreign trade, etc. Using the time series data of Henan Province from 1995 to 2021, the relationship between FDI and the above six explanatory variables is empirically The results of the empirical study show that The empirical results show that the scale of economic development represented by GDP has a significant positive impact on FDI in Henan Province, while labour cost represented by regional per capita wage has a negative impact on FDI in Henan Province, while other factors do not have a significant impact on FDI. With the continuous deepening of economic globalization, the role of multinational corporations in the international production system is increasing significantly, and foreign direct investment (FDI) has greatly propelled China's economic growth. The Foreign Investment Law of the People's Republic of China officially came into effect on January 1, 2020. The introduction of this law in China has played an important role in promoting, protecting, and regulating foreign investment. Since China's reform and opening up, China's FDI has increased dramatically: from only $2 billion in 1985 to a record $1.15 trillion in 2021, with an annual growth rate of 14.9% in actual FDI inflows, surpassing the trillion-dollar mark for the first time. Despite the dual pressures of the COVID-19 pandemic and the reorganization of global industrial and supply chains in recent years, China's stock of FDI has remained stable and growing. Therefore, this paper selects Henan Province as the research object and uses time-series data from 1995 to 2021 to empirically study the factors affecting FDI in this province, in order to effectively promote investment attraction. This paper takes the actual utilization of foreign direct investment (FDI) in Henan Province as the research object and conducts the following research on the factors affecting FDI in Henan Province through theoretical research and empirical analysis: Chapter 1: Introduces the background of the study and clarifies the content and methods used in this research, providing a solid foundation for the subsequent theoretical and empirical analyses. : The regional distribution of FDI in China shows significant disparities. Compared with the central and western regions, the eastern coastal provinces are more advanced in both the quantity and quality of foreign investment attracted. At the beginning of the 21st century, in order to increase the enthusiasm for FDI inflows into the central and western regions, the Chinese government successively implemented strategies such as the \"Western Development\" and the \"Rise of the Central Region,\" and introduced a series of preferential policies. It is hoped that these measures will promote coordinated and sufficient development and improve the unbalanced regional distribution of foreign investment. Henan, as a major economic province in the central region, has seen a steady improvement in its economic level and has achieved remarkable results in attracting foreign investment. Its FDI increased from $0.0565 million in 1985 to $2.107 billion in 2021, a growth of more than a thousand times. However, compared with the eastern coastal provinces, Chapter 2: Conducts a theoretical analysis of the factors affecting FDI in Henan Province from six aspects: economic development scale, economic development status, labor costs, infrastructure construction, trade policy orientation, and the degree of openness to foreign trade, laying a good foundation for the following empirical study. Chapter 3: Collects time-series data from Henan Province for the period 1995-2021 and uses the Eviews11.0 software to establish a multiple regression model to empirically study the factors affecting FDI. The model is tested and revised accordingly. Chapter 4: Based on the theoretical and empirical analyses, the paper draws conclusions and proposes some suggestions to better promote investment attraction in Henan Province. This paper employs both qualitative and quantitative analysis methods to explore the factors affecting FDI in Henan Province through qualitative literature review and quantitative empirical analysis. Literature Search Method: By searching libraries and the Internet, relevant domestic and international literature on the factors affecting FDI is reviewed and organized. Based on this, theoretical hypotheses regarding the factors affecting FDI in Henan Province are proposed in line with the province's actual conditions. Empirical Analysis Method: Using the econometric software Eviews11.0, a model is established based on the time-series data from 1995 to 2021. The results of the empirical study are analyzed to draw the conclusions of this paper.",
    "Based on the domestic and international research results reviewed above, this paper first conducts a systematic theoretical analysis of the various factors influencing FDI. The scale of economic development is usually measured by the Gross Domestic Product (GDP) of a region. A large scale of economic development is highly conducive to attracting foreign direct investment. Firstly, regions with a large economic development scale imply a larger market size, closer proximity to consumers and factor markets, and a better understanding of the market, which in turn reduces the costs of market research and transportation. Secondly, in regions with a large market size, there is greater sensitivity to changes in market demand, allowing for rapid adjustments to production plans in line with market demands, thereby enhancing productivity. Additionally, regions with a high level of economic development often feature industrial clusters, which bring economies of scale and reduce production costs for investors. Therefore, considering economies of scale and production costs, investors tend to choose regions with a large economic development scale for production and business activities. The status of economic development is typically measured by the growth rate of regional GDP. Sustained and stable economic growth is a sign of a favorable investment environment and an open market prospect in the region, and foreign investors are more likely to expect substantial returns on their investments in the future. Conversely, economic stagnation and macroeconomic decline increase the risk preferences of foreign investors regarding investments in the host country, thereby affecting the inflow of FDI. At the same time, investors' analysis is not limited to the size of the regional market but focuses on the future prospects of the market. If foreign companies decide to establish a presence in regions with a large market size, it is beneficial for their long- term development. Labor costs are usually represented by average wages. From the perspective of investment costs, labor costs are significant, often being a key factor in determining a company's strategic position in international competitive markets. This also explains why some companies prefer to set up processing plants in places like India and Thailand. Generally, labor costs tend to inhibit the inflow of FDI, as cheaper labor is more attractive to foreign investors, especially in labor-intensive sectors with high labor demands and low skill requirements, such as Foxconn. The level of infrastructure is measured by the growth rate of regional fixed asset investment. The faster the growth rate of fixed asset investment, the higher the level of local infrastructure. Infrastructure encompasses a wide range of public works, including transportation, postal and telecommunications services, water and electricity supply, and domestic services. It is the material basis for all production and living activities and the basic material guarantee required for regions to attract foreign investment. Although infrastructure does not directly bring economic benefits to foreign investors, it affects the transportation costs, time, and construction period of enterprises. The level of infrastructure development affects the production efficiency and scale of FDI in the investment location, especially for large-scale foreign-funded projects. Generally, the level of infrastructure construction promotes the inflow of FDI. A region with higher and better infrastructure will help enterprises save start-up costs, expand smoothly and rapidly, improve efficiency, reduce trade costs, and enhance the ability to attract capital. Conversely, if the local infrastructure is relatively underdeveloped, it will not be able to meet the needs of industrial development, leading to reduced output and efficiency of enterprises, and consequently lower investment returns and reduced investment amounts. Policy orientation also plays a special role in attracting FDI and serves as a powerful driving force. Practice has shown that in 1979, China established four special economic zones. With the help of various preferential policies and flexible measures introduced by the state, including tax incentives, streamlined approval systems, and sound legal systems, the free flow of FDI was ensured, and the country's foreign economic activities, especially in the coastal areas and the provinces of Guangdong and Fujian, were significantly activated. The degree of openness to foreign trade is usually represented by the ratio of total imports and exports to GDP, reflecting the extent of openness and market scope of an economic entity. There is a close relationship between foreign trade and FDI. The more open an entity is to foreign trade, the more capable it is of attracting FDI. This is because the development of foreign trade implies an expansion of the investment market, while FDI promotes the development of foreign trade. The resources required by FDI, such as the purchase of inputs and the sale of outputs, need to be met through foreign trade.",
    "Based on previous research and considering the availability of data, this paper selects the following six variable indicators as factors influencing the growth of FDI in Henan Province, where the scale of foreign direct investment has been gradually increasing in recent years. the frequent fluctuations in exchange rates, this paper uses the exchange rate based on 100 US dollars to Chinese yuan. An increase in this exchange rate value means depreciation of the Chinese yuan, which reduces the costs for foreign investors and leads to an increase in FDI. (6) Degree of openness to foreign trade: The ratio of total imports and exports to regional GDP (X6) is used as an indicator of the level of economic openness. Obtain the specific data of FDI and these six variables from 1995 to 2021 from the Henan Statistical Yearbook for empirical analysis To reduce the fluctuation range of variables and eliminate heteroscedasticity, the natural logarithm of each variable is taken first, and the regression equation is established as follows: Where Y represents the actual amount of foreign direct investment (FDI), C is the constant term, Bdenotes the regression coefficient, andjiis the random disturbance term. Using the Eviews11.0 software, a preliminary multiple linear regression model was established, and the regression results of foreign direct investment and these six influencing factors are as follows: (1) Goodness-of-fit test: R2 =0.988040, with an explanatory power of over 95%, indicating that the established model has a relatively good overall fit. (2) Significance test of the equation: This involves testing whether the parameter values of all explanatory variables are simultaneously zero at a certain significance level, to determine whether the selected explanatory variables are appropriate overall. The F-test is used for this purpose. At a significance level of o=0.05, Prob(F-statistic) = 0.000000, indicating that the estimated sample regression equation is overall significant, and the F-test is passed. explanatory variables are all greater than 0.05, and the t-test is not passed. In terms of economic significance, economic development scale, infrastructure level, and degree of openness to foreign trade are positively correlated with foreign direct investment, while economic development status, labor costs, and trade policy orientation are negatively correlated with foreign direct investment. However, the relationship between economic development status and trade policy orientation with foreign direct investment does not conform to economic significance, indicating that the model still needs to be optimized. (3) Significance test of variables: At a significance level of o=0.05, except for economic development scale, labor costs, and trade policy orientation, the p-values of the other first examined whether there was multicollinearity among the explanatory variables by calculating the correlation coefficients between them, as shown in Table 3. From the correlation coefficient matrix in Table 3, it can be observed that the correlation coefficients between InX1 and InX3, InX5, InX6, as well as between InX2 and InX4, are relatively high, with absolute values all exceeding 0.7, As shown in Table 4, the order of the R2 values is InX1 > InX3 > InX5 > InX6 > InX2 > InX4. Based on this, other variables are added in sequence for regression until Since the explanatory variables are all economic variables, they are very likely to be non-stationary. To avoid spurious regression, the stationarity of InY, InX1, and InX3 was tested using the ADF test in EViews. Ata significance level of a=0.1, it was found that InY, InX1, and InX3 are all integrated of : . performed on InY, InX1, and InX3, and the residuals obtained Wee tested using the DF test. The t-statistic obtained was - 4.649307. At a significance level of 0.05, the critical value for the EG two-step test is calculated as -3.7429 - 8.352/27 - To determine whether there is a cointegration relationship among InY, InX1, and InX3, a multiple linear regression was 13.41/27? = -4.070628, which is greater than the t-statistic. This indicates that the residual series is stationary and does not contain a unit root. Therefore, there is a cointegration relationship among the variables InY, InX1, and InX3. To eliminate autocorrelation, the generalized differencing method was employed. A regression was conducted using the command Is(w=W) InY c InX1 InX3 to generate the residual sequence E. The auxiliary regression yielded p=0.277861. Subsequently, a new regression equation was generated using the command Is(w=W) InY - 0.277861*InY(-1) c¢ Inxl - 0.277861*Inx1(-1) Inx3 - 0.277861*Inx3(-1). The results obtained are presented in the following table.",
    "Based on the above analysis, it is evident that the main factors affecting FDI in Henan Province are the scale of economic development and labor costs, with the former having a positive impact on FDI and the latter being detrimental to FDI inflows. Therefore, the following policy recommendations are proposed. Based on the final model established in this paper, when other factors remain constant, the scale of economic development has a positive impact on Henan Province's ability to attract FDI. For every 1% increase in InX1, InY will, on average, increase by 6.809080%. Regions with a large scale of economic development, characterized by their advanced economies, broader markets and sales channels, and convenient access to information, enhance the expectations of foreign investors to make profits, thereby increasing their attractiveness to FDI. Conversely, when other factors remain constant, for every 1% increase in InX3, InY will, on average, decrease by 4.665671%. This indicates that labor costs have a negative impact on Henan Province's ability to attract FDI, suggesting that higher labor costs tend to suppress the growth of FDI. GDP was selected as the indicator of regional economic development scale in this study, and the empirical analysis shows that it has a positive impact on FDI. Henan Province should grasp the current market trends, leverage its existing resources and advantages, and formulate effective long-term policies to ensure stable and positive economic development. At the same time, the government should vigorously develop the rural market, respond to the call for rural revitalization, and effectively implement and publicize people-oriented policies. By genuinely benefiting the people, efforts should be made to increase residents' income levels, boost consumption, tap into and transform potential consumer power, and inject vitality into market development. Overall, when making investments, foreign investors place significant emphasis on factors such as the scale of economic development and labor costs in the investment region. Henan, located in the Central Plains, has been a populous province since ancient times. Compared with other provinces, its abundant human resources are an obvious competitive advantage. Foreign investors have been attracted by the cheap labor force in Henan, with most investments concentrated in labor-intensive industries. However, with the progress and development of science and technology, enterprises' demand for high-quality talent is increasing. Therefore, the urgent task for Henan Province is to formulate and implement a talent strategy to address the severe brain drain and ensure that high- quality talent can be attracted, retained, and well-supported."
]