[
    "How to cite this paper: Zhang, B., & Phromphitakkul, W. (2021). Influence of Three Dimensions of Intellectual Capital on Relationship Performance of University Lecturers: A Case of Universities in Henan Province, China. Journal of Service Science and Management, 14, 369-381. https://doi.org/10.4236/jssm.2021.143023 Intellectual capital plays an important role in promoting the development of the universities. Individual lecturers are in an organizational environment, and their behavior is affected by the organizational environment. Therefore, the relationship between intellectual capital and relationship performance of university lecturers is an important research topic. This thesis used quantita- tive research methods, taking university lecturers in Henan Province as an example, and found that three dimensions of intellectual capital, human cap- ital, structural capital and relational capital, have a significant positive impact on the relationship performance of university lecturers. Copyright © 2021 by author(s) and Scientific Research Publishing Inc. This work is licensed under the Creative Commons Attribution International License (CC BY 4.0). http://creativecommons.org/licenses/by/4.0/ Open Access In the era of knowledge economy, intellectual capital plays a vital role in the de- velopment and growth of knowledge-intensive organizations. Intellectual capital is divided into three dimensions by most scholars: human capital, structural capital and relational capital (Li & Yao, 2011; Tollington et al. 2012; Wang &, Wang, 2018). Human capital is the source of creative intellectual capital (Edvisson, 1997) and the core of intellectual capital; structural capital is the basis for the realization of organizational performance, which provides a carrier for the normal operation of the organization and tapping the capabilities of em- As a typical knowledge-intensive organization, universities’ essence is to re- search the academic, the pursuit of truth, the cultivation of real talent (Gu, 2010). Intellectual capital has become the core of the operation and management of universities. Universities must accelerate the development of human capital, structural capital and relational capital and choose effective management models to promote intellectual capital to become a source of wealth and core competi- tiveness. This is a competitive advantage for universities and the key to becom- ing a first-class university in the country and even in the world. Currently, there are 134 universities in Henan Province. In the 2019 Chinese University Rankings, only Zhengzhou University and Henan University ranked in the top 100 universities in China, which showed that is not high the overall strength of universities in Henan Province. For this reason, the pursuit of excel- lent teaching quality, emphasis on the performance of lecturers, and enhance the comprehensive competitiveness of universities have become the innovation of the universities’ internal educational connotation. Relationship performance is one of the dimensions of work performance rec- ognized by many scholars. It is mainly manifested in the handling of interper- sonal relationships at work. Good interpersonal relationships can help create a healthy working atmosphere, reduce friction between members in the organiza- tion, and improve the personal efficiency of employees (Xu, 2012). This paper took the universities in Henan province as an example, studied the impact of human capital, structural capital and relational capital on the rela- tionship performance of university lecturers. All in all, there are not many scholars studying Influence of Three Dimensions of Intellectual Capital on Relationship Performance of University Lecturers. This thesis used quantitative research methods, taking university lecturers in Henan Province as an example, research Influence of Three Dimensions of Intellectual Capital on Relationship Performance of University Lecturers. The research of this paper has great theoretical research value and strong practical significance. Intellectual capital was first proposed by the famous British classical economist. With the deepening of research, more scholars have put forward different views on the definition of intellectual capital. Edvinsson and Malone (1997) believed that intellectual capital was the integration of knowledge, technology, innova- tion, and the ability of individual employees to control their own tasks. Sha and Kong (2004) believed that intellectual capital was capital that could be standar- dized, controlled, and influenced to produce higher value. Li and Liu (2005) be- lieved that corporate intellectual capital referred to the intangible assets owned by the company that met the needs of corporate strategic development and could be used to create value for the company and form a competitive advantage. Li (2013) believed that intellectual capital covered the content of intangible assets and was expressed in the form of intangible assets. Intellectual capital could de- Summarizing previous related studies, it can find that the connotation of in- tellectual capital mainly includes three core elements: a) Intangible organiza- tional resources; b) Creating value; c) The source of competitive advantage. Based on previous scholars’ intellectual capital research, combined with the cha- racteristics and functions of universities themselves, this paper believed that the intellectual capital of universities is an intangible resource of universities, and all that can be transformed into competitive advantages of universities, and is the sum of knowledge, structure, and relationships that can create the value of uni- versities.",
    "It is recognized by many scholars that intellectual capital is divided into three dimensions: human capital, structural capital and relational capital, among them: cultural level (Edvisson, 1997; Zhang, 2002; Dzinkowski, 2005). Through conscious investment to achieve future value-added, dependent on the total value of hu- man health, intelligence, and spirit (Liu et al., 2007; Xu, 2009). In universities, It mainly included knowledge, technology, attitudes, teaching, research, innova- tion, and collaboration capabilities (Zou & Hui, 2009; Wang, 2006), which are the main reasons for the performance of universities. Structural capital referred to all organizational intangible assets that can play basic functions (Yan, 2006). It includes soft assets such as the organization’s strategic culture, structural systems, rules and procedures, as well as basic assets such as data information and knowledge networks (Li, 2006). Structural capital in universities is a kind of organizational ability. It improves efficiency by inte- grating various resources of universities (Tao & Jiang, 2011), and creates condi- tions for human capital to function. It consists of organizational structure, regu- lations, campus culture, facility construction, and discipline The composition of professional construction, information technology, and intellectual property rights (Fan & Tao, 2005; Wang, 2006), is the platform foundation for achieving university performance. Relational capital referred to the beneficial relationship between the organiza- tion and its customers, suppliers, partners, etc. (Edvinsson & Malone, 1997). It is the capital formed by the establishment, maintenance, development and invest- ment of the relationship between enterprises and stakeholders to achieve their goals. Relational capital in universities referred to the social environment in which the university is located and the society’s evaluation of the university, in- cluding academic reputation, social popularity and the relationship between stakeholders (Fan & Tao 2005; Wang, 2006; Zou & Hui, 2009), is the key for universities to obtain social value. Relationship performance is mainly concerned with organizational interpersonal relationships (Borman & Motowidlo, 1993), including voluntary completion of informally prescribed activities, perseverance and enthusiasm to complete tasks, helping others and cooperating with others, sacrificing the individual to comply with organizational rules and procedures, and approving, supporting and main- taining organizational goals and other related behaviors. Regarding the work of university lecturers, relationship performance referred to lecturers’ contribu- tions to the university through psychological, university and social background support (Wu et al., 2006), which is mainly reflected in social services, lectur- er-student interaction, and teamwork. It is helpful to achieve the three functions of cultivating talents, developing science, and serving society in universities, and relational capital and relationship performance of university lecturers through quantitative research. There are 141,992 university lecturers in Henan Province, and the sample size is 400 calculated by Yamane. In this paper, 400 randomly selected university lecturers in Henan Province were taken as the objects of in- vestigation, and questionnaires were distributed. In addition, this paper selected the empirical indicators used by different scholars and practitioners to evaluate human capital, structural capital, relational capital, and relationship performance, and combined the characteristics of the university itself to determine an evaluation scale suitable for this research, and analyzed the reliability and validity of the variables, and then the difference test of demographic variables to eliminate the influence of non-research variables on the research results, and finally used correlation analysis and regression analysis to verify the research hypotheses. In this study, the Cronbach Alpha coefficient method was used to analyze the re- liability of the collected sample data. From Table 1, it can be known that the Cronbach α values of human capital, structural capital, relational capital, and relationship performance all reached 0.8, which shows that the reliability of the measurement data is high, and the measurement results are more consistent and stable in Table 1. In order to ensure the validity of the questionnaire design, three experts were selected to evaluate the content design of the questionnaire. Through the Item Objective Congruence, the IOC was calculated to be greater than 0.7, and test results of the experts are shown in Table 2. different from the research variables. If the difference test is significant, then these demographic variables need to be used as control variables in the subse- quent regression analysis to exclude the influence of non-research variables and enhance the accuracy of the research conclusions.",
    "There are only two groups of male and female, which are two independent samples, so the T-test is used for analysis. Gender has no significant difference in human capital, structural capital, relational capital and relationship performance (P > 0.05). The analysis results are shown in Table 3. One-way ANOVA is to measure the influence of different levels of control va- riables on the observed variables. This method can be used to analyze whether there are significant differences in human capital, structural capital, relational capital, and relationship performance by age, education, work experience, and professional titles. Through One-way ANOVA of the data, the following conclu- sions can be drawn in Table 4: From Table 4, it shows that age has no significant difference in structural cap- ital and relationship performance (P > 0.05), but has significant difference in human capital and relational capital(P < 0.05). From Table 5, education level has no significant difference in relationship performance (P > 0.05), but has significant differences in human capital, struc- tural capital, and relational capital (P < 0.05). From Table 6, there are no significant differences in structural capital and re- lationship performance for work experience (P > 0.05), but there are significant From Table 7, professional titles have no significant difference in relationship performance (P > 0.05), and have significant differences in human capital, structural capital, and relational capital (P < 0.05). Through the test results can be known, gender, age, education, work expe- rience, and professional titles of research variables are some or all of their signif- icant differences, so in the subsequent regression analysis in the thesis, gender, age, education, work experience, and professional titles as control variables, to eliminate the influence of non-study variables. Correlation analysis is an analysis method of the degree of interdependence be- tween one variable and another variable. It can understand the correlation be- tween variables and whether the relationship between the preliminary predictors is consistent with the hypotheses of this research. This paper uses SPSS23.0 to analyze the sample data, and the results of the correlation analysis between the research variables are shown in Table 8. From Table 8, correlation analysis is used to study the correlation between human capital, structural capital and relational capital and relationship perfor- mance of university lecturers. Pearson correlation coefficient is used to express the strength of the correlation. Specific analysis shows that: Structural capital and relationship performance show a significant relation- ship (r = 0.655, p < 0.01), which provides preliminary evidence for H2. Table 8. Correlational Analysis Results by Human Capital, Structural Capital, Relational Capital and Relationship Performance of University Lecturers (N = 400). Regression analysis is a statistical analysis method to determine the mutual de- pendence of two or more variables. It can be used to quantitatively analyze the causal relationship between variables. The multiple linear regression equation in this article is expressed by the following formula: { } = β β β β , 1 2 m { γ γ γ = 1 2 } γ and η are estimated parameters, ε is the n error term. Among them, the change of the dependent variable (explained variable) is solved by the linear part, the interaction term and the random error term. Cor- relation analysis initially verifies the correlation between variables, but cannot explain the causal relationship between variables. change of F value show significance (p < 0.05), which means that human capital has an explanatory meaning for the model. In addition, the increase of R squared value from 0.045 to 0.420 means that human capital can produce 37.5% expla- natory power for relationship performance. Specifically, the regression coeffi- cient of human capital is 0.548 and shows a significant (P = 0.000 < 0.01), which means that human capital has a significant positive impact on relationship per- From Table 10, Model 1-4 adds structural capital on the basis of Model 1-3, the change of F value show significance (p < 0.05), which means that structural capital has an explanatory meaning for the model. In addition, the increase of R squared value from 0.045 to 0.471 means that structural capital can produce 42.6% explanatory power for relationship performance. Specifically, the regres- sion coefficient of structural capital is 0.532 and shows a significant (P = 0.000 < 0.01), which means that structural capital has a significant positive impact on relationship performance. H2 is established.",
    "From Table 11, Model 1-6 adds relational capital on the basis of Model 1-5, the change of F value show significance (p < 0.05), which means that relational capital has an explanatory meaning for the model. In addition, the increase of R squared value from 0.045 to 0.421 means that relational capital can produce 37.6% explanatory power for relationship performance. Specifically, the regres- sion coefficient of relational capital is 0.523 and shows a significant (P = 0.000 < 0.01), which means that relational capital has a significant positive impact on re- lationship performance. H3 is established. Through the above empirical analysis, the verification results of all relevant research hypotheses in this thesis are obtained, as shown in Table 12. On the basis of reviewing and collecting relevant literatures, this thesis summa- rized the related researches on human capital, structural capital, and relational capital and relationship performance, combined the characteristics of university lecturers, determined the measurement indicators of each variable, and con- structed a theoretical model of control variables (gender, age, education level, work experience, and professional titles), independent variables (human capital, structural capital, and relational capital) and dependent variables (relationship performance), then proposed related research hypotheses. In addition, this thesis combined the previous researches, designed a ques- tionnaire, conducted surveys on university lecturers in Henan Province. Relia- bility and validity analysis was carried out based on the data of 400 valid ques- tionnaires, and the influence of irrelevant variables on the research results was excluded by controlling non-research variables. Correlation analysis and regres- sion analysis were used to verify the hypothesis. Empirical research finally concluded: Human capital has a significant positive impact on relationship performance of university lecturers. Structural capital has a significant positive impact on relationship performance of university lecturers. Relational capital has a significant positive impact on relationship performance of university lecturers. It can be explained that the improvement of human capital, structural capital and relational capital is an important means to improve the relationship perfor- mance of university lecturers and an effective method to improve the compre- hensive strength of universities."
]