[
    "Investment in High-End Scientific Human Capital Development and Technological Talent Management: Role of Mediating and Moderating Variables towards Organization Talent Innovation Capacity in High-Tech Industry in Henan Province, China How to cite this paper: Sheng, G. Y. (2025). Investment in High-End Scientific Human Capital Development and Technological Talent Management: Role of Mediating and Moderating Variables towards Organization Talent Innovation Capacity in High-Tech Industry in Henan Province, China. Ad- vances in Applied Sociology, 15, 287-310. https://doi.org/10.4236/aasoci.2025.154016 Copyright © 2025 by author(s) and Scientific Research Publishing Inc. This work is licensed under the Creative Commons Attribution International License (CC BY 4.0). http://creativecommons.org/licenses/by/4.0/ Open Access China is a rising economic power that has garnered global interest. The 1978 economic reforms and opening-up have spurred tremendous growth. In the knowledge economy, Henan Province’s high-tech industry’s talent innovation capacity is gaining attention. This research evaluates Henan high-tech industrial organisations’ talent innovation capacity after investing in high-end scientific human capital development and technological talent management. A wider sam- ple of industry employees will be surveyed for quantitative data. The surveys will ask employees how mediating and moderating elements affect their organiza- tion’s talent innovation capacity. SPSS and PLS software will assess research question hypotheses during data analysis. Quantitative data will clarify the re- search problem and add to field expertise. The proposed strategy ensures thor- ough, systematic, and relevant research for Henan Province’s high-tech industry. playing a crucial role in driving economic growth and innovation. Henan Prov- ince, located in central China, has been actively investing in human capital devel- opment and technological talent management to enhance its innovation capacity. This study aims to explore the relationship between high-end scientific human capital development, technological talent management, and organizational talent innovation capacity in Henan’s high-tech industry. It also examines the mediating and moderating variables that influence this relationship. The 20th Party Congress report emphasizes leveraging talent innovation capacity across modernization efforts, particularly in high-tech industries, to fuel eco- nomic innovation. General Secretary Xi Jinping highlighted the importance of sci- ence, technology, talents, and innovation-driven development. Research shows that human capital development and technological talent management are crucial for economic growth. In Henan, the high-tech industry is a key driver of local and national economic development. However, it faces challenges. Technological in- novation in this sector may cause environmental pollution and energy consump- tion. Moreover, high costs, high risks due to government regulations hamper in- novation activities, resulting in weak innovation capacity in China’s high-tech in- dustry (Guo et al., 2023). Against this backdrop, this paper explores investment in high-end scientific human capital development and technological talent manage- ment, and its impact on the talent innovation capacity of high-tech industry or- ganizations in Henan Province, China. 3) How does strategies for achieving organizational talent innovation capac- ity mediates human capital development towards organization of talent innova- tion capacity in high-tech industry in Henan Province, China? 4) How does strategies for achieving organizational talent innovation capac- ity mediates technological talent management towards organization of talent innovation capacity in high-tech industry in Henan Province, China? 5) How does work environment moderates human capital development to- wards organization of talent innovation capacity in high-tech industry in Henan Province, China? 6) How does work environment moderates technological talent management towards organization of talent innovation capacity in high-tech industry in Henan 7) How does strategies for achieving organizational talent innovation capac- ity influence organization talent innovation capacity in high-tech industry in He- nan Province, China? 1) To examine the impact of human capital development towards organizational talent innovation capacity in high-tech industry in “Henan Province”, China? 2) To examine the impact of technological talent management towards organ- ization talent innovation capacity in high-tech industry in “Henan Province”, China? 3) To assess to influence of strategies for achieving organizational talent in- novation capacity in human capital development towards organization of talent innovation capacity in high-tech industry in Henan Province, China? 4) To assess the influence of strategies for achieving organizational talent in- novation capacity in technological talent management towards organization of talent innovation capacity in high-tech industry in Henan Province, China? 5) To determine the influence of working environment in human capital de- velopment towards organization of talent innovation capacity in high-tech indus- try in Henan Province, China? 6) To determine the influence of working environment in technological talent management towards organization of talent innovation capacity in high-tech in- dustry in Henan Province, China? 7) To understand the influence of strategies for achieving organizational tal- ent innovation capacity towards organization of talent innovation capacity in high-tech industry in Henan Province, China? Professional skill workers and R&D scientists and engineers are scarcer in Cen- tral China. High-tech companies need inventive individuals and mid- and senior- level management. The rapid growth of private firms in Henan province requires managerial resources. As these companies grow, their major supply of lower-level workers can no longer match high-tech growth requirements. Lin et al. (2024) state that present human resource demographics and the government’s talent re- tention mechanism make it hard for private companies to hire innovative manag- ers. Professional skill workers focus on education and healthcare. Incentives are needed to draw talent to less economically developed regions (Central, Henan) and less appealing industries (e.g., electronic information, biology, medicine, in- novative materials, and logistics). Policymakers and government organisations must find strategies to attract talent in Henan and high-tech industries. Because it doesn’t meet industry needs, Chinese higher education has failed to match market demands. More deliberate consideration and effort are needed to a) align educa- tional curricular with market demands, b) identify essential competencies needed by diverse businesses, and c) connect theory with practice through experiential learning.",
    "In accordance with Zahedi et al. (2024), high-tech industry is an information and knowledge intensive service industry, relying on information technology and modern management philosophy. According to Wang & Sun (2018), developed from traditional service industry (e.g., commerce, traffic, storage, and mail busi- ness, lodging and food industry), high-tech industry in Henan, China expands service areas to include scientific research, technical service, finance, realty busi- ness, community service, and cultural service. Although the development of high- tech industry is important for promoting national economy, accelerating social progress, and building an innovation oriented society in China, Henan faces some serious continuous learning and development challenges in human capital devel- opment towards organization talent innovation capacity in high-tech industry. The high-tech industry is the low quality of talents and shortage of middle to sen- ior managers for key positions in organization. As a result, many different high- tech sectors across Henan province face the shortage of skilled, talented people. Therefore, China needs to take a systematic approach to develop professional skilled talents who can contribute to its high-tech modernization vision in its He- nan province. In accordance with Tang (2024), promoting key core technology innovation is conducive to promoting high-quality economic development, maintaining na- tional security, and seizing global technological development opportunities. In ac- cordance with Zhang et al. (2024), key core technologies include a large amount of tacit knowledge, which is difficult to imitate and replicate due to high barriers to breakthrough. According to Szogs (2010), first-move firms have established strict protection and exclusivity mechanisms to protect their core knowledge and technology from imitation, making it impossible for latecomers to understand the process of key core technology formation and technology “black box”. Thus, the practical difficulties have accelerated the pace of promoting key core technology innovation in Henan, China. Richard Scott described the relationship between organization and the environ- ment as follows: the organization is interdependent with the environment in many aspects and the environment is the most important among five factors for organ- ization construction. Any organization is surrounded by an open environment, and this open environment directly influences the results of organization opera- tion. Organization, in turn, influences the cognition and decision-making towards the environment to a great extent. Nowadays, no organization can ignore its links with the environment. Global companies attract individuals to build employer brands. Some employer brands are more desirable than others due to organisational features, managerial practises, and human resource management, according to Lievens and Slaughter (2016). Regional economic development relies on its symbol, the most essential factor in talent social progress. Economic development impacts mining worker number, quality, and conditions, according to Bai (2016). Good economic condi- tions can help them maximise their talent to meet material needs and affect nature and society. Good social and economic conditions support talent growth and re- tention. Regional economic development greatly impacts per capita GDP quality of life and standard of living. Talent environment affected economic development most directly and fundamentally, yet per capita GDP was comparable and dy- namic (Bai, 2016). After China joined the WTO comprehensive and international standards, a province’s economic development appears inseparable from the in- ternational market, so total import and export per capita and per capita foreign investment can better reflect a city’s openness and participation in the world mar- ket. Science, technology, culture, and talent flourish throughout the province. Life and talent depend on the province’s harsh environment. Urbanisation impacts the province’s economy, society, and environment. Assessing affective responses to organizational recruitment messages is predi- cated on the assumption that these responses can be generalized to actual organi- zation choice. In addition in accordance with Highhouse et al. (2003), to items assessing company attitudes and intentions, a handful of studies have used items assessing perceptions of a company’s prestige. These items have been designed to assess the degree to which organizations are perceived as being well-regarded. Ac- cording to Collins and Martinez Moreno (2022), different facets vary in the values or relevance to job seekers through the intensity or visibility of the brand adver- ‐ tisement and the uniqueness of brand messages. For example, in an era of infor- mation explosion, high-tech industries in Henan China can use the “Talent Envi- ronmental Assessment System Design” to attract top talents. It can be collected principle. According to Bai (2016), because the Talent Evaluation System for En- vironmental Talents in today’s society, use, optimization so important. Therefore the choice of evaluation should have sex can be collected. This research will be able to obtain a wide range of application to provide scientific guidance for the creation of reasonable talent environment and optimal allocation of human re- sources. Besides, the comparative principle. Talent Environment is a comprehen- sive reflection of economic, social and political impact of the growth of talent of various factors. Hence, talent environment in various areas in Henan with relative independence, neighbouring areas or situations similar comparison will provide a useful reference for the development of various regions, and promoting the re- gion’s talent environment towards a more rational and effective direction.",
    "Knowledge-enabled workers have unique qualities that should be examined for scientific group or job management. Most Henan acceptance, nurturing, and ex- citation approaches are partial enhancements that fail to fully inspire enthusiasm and rational excitement. He (2015) says Henan’s talent acceptance, training, and excitation mechanisms, human resource market mechanism, knowledge-enabled market distribution, domicile, human resources, and other systems have substan- tially inhibited talent rational flow. Knowledge-enabled firms adopting knowledge-enabled human resources struggle to leverage quality people, espe- cially in Henan’s underdeveloped economies dominated by traditional employ- ment models. Leaders still hire talent but ignore talent exertion. With higher ed- ucation, talent quantity is prioritised over skill growth. Henan firms should first start thinking about development training as an investment rather than consump- tion to create a systematic mechanism for knowledge-enabled human resource development. Make HR layout. The firm assesses human resource demand to im- plement its development strategy and achieve its goals and prepares methodically. Third, build human resource layout-based development and training pro- grammes scientifically. 4. Increase talent. Integrating training with Henan’s China’s universities are graduating millions of students each year to meet the needs of the knowledge economy. 6.3 million, including more than 50,000 with doctorates, entered the job markets in 2010. According to Cieslik et al. (2022), but the quality of the training is weak and many graduates are having difficulties find- ing employment, although this is likely to be temporary. The low quality is ex- plained by four factors. The massive expansion of enrollment, which has strained instructional capacity; The short duration of PhD training [3 years], The inexpe- rience and weak qualifications of instructors and pedagogical techniques which favour lecturing over discussion and greater classroom involvement of students; and university systems poorly equipped. To exercise quality control and to weed out the weaker candidates. In the meantime, employees complain about a serious shortage of highly skilled technicians, engineers, and executives. As a conse- quence, this low skilled guilt and high skill shortage poses a difficult for the skill transfer needed for companies to improve the quality of their output or move to a higher rank of the value chain. On December 19, 2003, the First National Talent Conference (Congress) was held in Beijing (capital of China), symbolizing the official recognition of the im- portance of talent management and study in the development of economy as well as the entire Chinese society. In accordance with People’s Daily, to this end, the central government initiated the “Recruitment Program of Global Experts,” known as the “Thousand Talents Plan,” at the end of 2008. The goal of this pro- gram is to attract more than 1000 top talents in different fields from all over the world over the next 5 to 10 years. Relying on National Key Innovation Projects, National Key Disciplines, central SOEs and state-owned commercial and financial institutions, and various industrial parks (mainly the high-tech development zones), this plan called for strategic scientists or top talents who can make break- throughs in key technologies or can enhance China’s high-tech industries and emerging disciplines People’s Daily in 2010. The overseas talents recruited through this program enjoy preferential policies in visa applications, residence permits, settling in China, and exit/entry convenience. In 2014, the Ministry of Education accredited talent studies (ren cai xue) as a university program and listed it in the Classification and Code of National Standard (840.72). By 2016, five Chi- nese universities had offered master’s degrees in talent studies. According to He (2015), Henan’s recognition, training, and excitation instru- ments for abilities are flawed, the human asset showcase instrument is flawed, the knowledge-enabled human asset showcase is still in its infancy, and housing, hu- man resources, and other frameworks have blocked the wise flow of abilities. Knowledge-enabled ventures that tolerate knowledge-enabled human resources know little about using quality gifts, especially in some areas with poor economies in Henan, which are affected by traditional work modes. Pioneers still explore for using abilities but give small considerations to the effort of gifts. High considera- tions are paid to the amount of abilities with higher education, but small consid- erations are paid to the talents’ aptitude. So, to set up a precise human asset im- provement preparing component that matches knowledge-enabled human asset characteristics, Henan ventures should change concepts and take the improve- ment preparing as an investment, which may be the most important investment but not utilisation. Moment, to format human assets. The human asset format means the project predicts human assets to plan development and satisfy goals. Third, develop and plan logically and methodically using human asset framework. Fourth, to enhance source channels. Thus, the best approach in Henan is to inte- grate training with knowledge-enabled employees’ career management (He, Harvard University experts introduced the concept of loyalty, in which they argue that loyalty can be categorized into different levels and grades, manifested in a pyramid-shaped hierarchy from high to low. At the base of the pyramid is the individual’s loyalty, followed by the employee’s loyalty to the organization, and finally, the employee’s endorsement and loyalty to the organization’s values and relevant rules. According to Jin et al. (2024), puts forward that employee loyalty can be summarized from the perspective of employees as follows: the degree to which employees make every effort and make unremitting efforts to achieve tasks or goals; from the perspective of the development of the enterprise in Henan Prov- ince’s technological innovation capacity it can be understood as: the degree of de- pendence of employees on the enterprise, corresponds to Zhao (2020), takes high recognition of the cultural value of the enterprise, pride in working in the enter- prise, and value of collective interests as the realistic expression of employee loy- alty. According to Jin et al. (2024), believes that employee loyalty is not a quality possessed by employees themselves, but a projection of the welfare, leadership and overall level of the enterprise, and a standard for evaluating the enterprise. Ac- cording to the research of Wang et al. (2024), various factors affecting employee loyalty in an enterprise mainly include salary and welfare standards, employees’ recognition of the enterprise, internal training system, and whether resource allo- cation is reasonable towards the development of the high-tech industry in Henan technological innovation capacity. Therefore, they found that the current research on loyalty mainly focuses on organizations and supervisors, the content of loyalty mainly includes emotional loyalty, normative loyalty and instrumental loyalty, and the level of loyalty mainly includes attitude and behaviour.",
    "In accordance with Zhang (2025), advancing key center innovation develop- ment is conducive for human capital development towards high-tech industries in Henan to advancing high-quality HR process and seizing technological ad- vancement openings. In accordance with Mortazavi et al. (2022), key center ad- vances incorporate a huge sum of inferred information, which is troublesome to mimic and duplicate due to tall obstructions to breakthrough. According to Fri- shammar et al. (2015), first-move high-tech industries in Henan must built up strict security and restrictiveness instruments to ensure their center information and innovation from impersonation, making it outlandish for latecomers to get it the method of key center innovation arrangement and innovation “dark box”. In this way, the practical challenges have quickened the pace of advancing key center innovation development in Henan, China. Hence, with the continuous develop- ment of national regional collaborative innovation, the policy synergy, industry synergy, and innovation chain synergy among regions are more able to consider the efficiency of high-tech industrial development. High-level talent introduction policies in Henan are largely created by the na- tional government with little public or employer input. In talent policy formula- tion, companies and social organisations should have more say and participation. (Li, 2021) suggests that industries, associations, and employers actively participate in talent introduction policy formulation and provide an efficient information ex- change platform to increase policymaker-employer interaction. Thus, enterprises need a Trinity government system. The government, society, and businesses in- troduce top talent. Therefore, Chinese colleges must be trusted. research institutes and several local businesses to combine the three subjects organically. High-level talent introduction requires government policy guarantees. Colleges and research institutes should fulfil their function as wisdom gathering locations, introduce high-level talent, build laboratory sites and equipment, and more. Facilitate high- level talent introduction to work. Enterprises should maximise the ability to turn talent innovations. Only a complete high-level talent introduction system that in- tegrates the government, society, and companies can change the condition for high-level talent work in Henan (Li, 2021). According to Liu (2023), Hong Yong from the E-commerce Research Institute of the National Academy of Commerce said the “cloud office” helps sustain eco- nomic and social operations and speeds the “paperless” office transition, contrib- uting to the “double carbon” goal. For Henan’s packaging business, the National Development and Reform Commission of the People’s Republic of China advo- cated convenient online office environments in 2020. Employee performance in Henan’s packaging business is seen differently. (Darmawan et al., 2020) defines employee performance as a person’s professional achievements and job results, including the quality and quantity of given tasks. This ongoing procedure has un- predictable results and multiple steps. Safitri & Patrisia (2019) found that clear job instructions, incentive, recognition, and work discipline promote employee per- formance and organisational talent innovation. Effective communication solves problems and transmits information and ideas to employees regardless of com- prehension, increasing production (Safitri & Patrisia, 2019). According to Grunig (2013), employee communication is one of the most essential variables in organi- sational management, and modern companies are ready to implement technology that enable cross-cultural, time-, and location workplace collaboration. Effective online communication and symmetrical communication greatly increase em- ployee-organizational ties, which influences high-tech employee innovation per- The salary is a scale to measure the relations between enterprise and employees, whether the employees are satisfied with the enterprise or not can be a reflection from they are satisfied with the salary or not. As for achieving the organizational talent innovation capacity in high-tech industries in Henan, employees shall not just take the salary as an economic exchange relation with the economic views as organizer, the salary should be regarded from the psychology, starting from the individual angle, it shall emphasize how the individual evaluate the salary and how the salary influence his behaviors and attitudes, which embody the psychological contract between employees and organizer. For example, according to He (2015), in Henan the knowledge-enabled employees in high-tech industries hold certain motive to enter the enterprise which is expected to satisfy the employees in mate- rial and spirit; and the enterprise, via the human resource management, shall make full of the human resource to achieve the enterprise’s goals. The social rela- tion between employees and high-tech industries makes it impossible to define completely the responsibilities of two sides in the written employment contract, yet, in the heart of each knowledge-enabled employees, they should have clear knowledge to what to do, how to do and what salary to get in the enterprise (He, 2015). Seen from the core, the psychological contract is a psychological tie to con- commitments to the enterprise, work achievement, flow rate and finally the en- terprise achievements. Therefore, as for the continuous innovation excitation mechanism, the high-tech industries in Henan province shall provide efficient growth mechanism and make the enterprise get long term development potentials via absorbing and exciting employees, which is a win-win strategy (He, 2015).",
    "Local colleges and universities should also directly or indirectly provide service to Henan’s regional economy and social development. According to Li and Xu (2015), it is necessary to consider the characteristics of Henan’s regional economy from a macro level, take into account the needs of industries within the regional economy to develop relevant policies for attracting skilled workers, establish a fea- tured method for cultivating technological innovation teams, satisfy the real needs of the society by pursuing actual effectiveness in team building, and effectively integrate universities’ talent development initiatives into local social development objectives. Therefore, while determining targets for building technological inno- vation teams, local universities should take into full account the economic devel- opment needs of the region where the university is located while preparing a talent pool that is sufficient to serve the local economy is the target, it is equally im- portant to set up a talent introduction and training program, establish technolog- ical innovation teams that can adapt to and promote regional economic develop- ment, and cultivate outstanding university students who can be trained to fill eco- nomic development needs in Henan (Li & Xu, 2015). Henan in the sector in Zhengzhou, Luoyang and Xinxiang in the economic and scientific factors in scores among the best. According to urban planning point of view of ecological theory, the modern city is a kind of artificial fragile ecosystem, which is the depletion of the ecological processes, rather than a chain circulating on the management system. Therefore, in accordance with Bai (2016), urban con- struction should first promote ecological construction, emphasizing the system- atic urban construction, naturalization, the economic and humane. In this regard, the city scores high in Luoyang. For example, in recent years, urban planning spe- cial attention to the area of Luoyang urbanization ecological planning and man- agement, the relationship between the ecological relationship suburban, urban natural ecology and human ecology (Bai, 2016). Construction the relationship be- tween ecological construction and ecological environment construction industry, human settlements construction and landscape ecological construction relation- ship. Thus, by ecological industry incubator, induced ecological environment to nurture and promote ecological culture of an eco-efficient technologies, manage- ment system and harmonious system is responsible for social behavior, and pro- mote the coordinated development of economy and the environment. This is also Henan universities should work with local governments’ public technological service networks and regional economies to employ highly skilled scientists and innovators in high-tech enterprises. Bai (2016) recommends that local govern- ments help university scientific and technology staff actively transform scientific and technological achievements to stimulate innovation. Henan University of Sci- ence and Technology has 2235 full-time teachers, including 944 senior profes- sional technical teachers, 809 doctorate-degreed teachers, 7 shared academicians, 2 central-plain scholars, 11 provincial professors, 61 doctoral tutors, and 249 sen- ior talents who are national experts and Henan Provincial outstanding experts recognised by the “Million Talents Project”. Thus, the university works with Luo- yang Productivity Promotion Centre, Luoyang Private Enterprise Federation, and other public service organisations to provide innovative enterprises with infor- mation, technology, laboratory tests, and other public technological services to accelerate technological adoption and boost organisational productivity. Univer- sities encourage innovative awareness and practice in staff training. It administers the annual Students Research Training Programme (SRTP), university student in- vention production competitions, graduate innovation financing, academic con- ferences, scientific and technological results reward money, and other projects. The university provides capital, location, equipment, and materials for students to extensively train in technological innovation to create an innovation atmos- phere on campus and boost university students’ creative drive, innovative aware- ness, and technological innovation capabilities in high-tech industries (Bai, 2016). The high-tech industry in Henan, China, has experienced rapid growth and transformation in recent years, fuelled by advancements in technology and in- creasing global demand for innovative solutions. In this dynamic landscape, or- ganizations face the challenge of continuously enhancing their talent innovation capacity to maintain a competitive edge. Leadership development emerges as a critical factor in this process, as effective leadership is essential for driving or- ganizational change, fostering creativity, and empowering employees to unleash their full potential in driving innovation. According to Avolio and Gardner (2005), leadership development programs that focus on fostering visionary lead- ership, encouraging risk-taking, and promoting a culture of experimentation are essential for stimulating innovation within organizations in Henan, China. For example, in accordance with Bass and Riggio (2006), transformational leader- ship, characterized by inspirational motivation, intellectual stimulation, and in- dividualized consideration, has been identified as particularly conducive to fos- tering innovation within high-tech industries in Henan, China. Hence, in ac- cordance with Meyer (2022), the concept of talent innovation capacity refers to tivity of its workforce to drive innovation. This capacity is influenced by various factors, including leadership practices, organizational culture, and talent man- agement strategies.",
    "In his theory of organization, Richard Scott portrayed the relationship between an organization and the environment as follows: the organization is interdepend- ent with the environment from numerous perspectives, and the environment is the foremost critical among five components for an organization’s development. Efficiency in operations is an indispensable requirement for organizations to thrive in the intensely competitive business landscape. Organization, in turn, im- pacts the cognition and decision-making towards the environment to a great de- gree. These days, no organization can disregard its joins with the environment. Distinctive capabilities of an organization are shaped through its interactions with this open environment. The capabilities include not just technical skills and re- sources but also the organization’s ability to adapt to changes in the environment, its capacity to innovate, and its efficiency in utilizing available resources. These distinctive capabilities differentiate one organization from another and play a cru- cial role in determining its competitive advantage. For instance, an organization’s ability to quickly adopt new technologies or its proficiency in managing relation- ships with stakeholders can be seen as distinctive capabilities that contribute to its success. A conceptual framework is a serious set of fundamental ideas and guidelines that are drawn conclusions from several academic industries and serve as a roadmap for the development of a future presentation (Jabareen, 2009). The research Quantitative data will be gathered through surveys distributed to a larger sample of employees within the same industry. The surveys will aim to capture the per- ceptions and experiences of employees regarding the role of mediating and mod- erating variables in shaping their organization’s talent innovation capacity. Data analysis will involve statistical analysis, which will test the hypotheses derived from the research questions using SPSS and PLS software. The quantitative data will provide a comprehensive understanding of the research problem and contrib- ute to the existing body of knowledge in the field. The proposed methodology ensures that the research is rigorous, systematic, and relevant to the high-tech in- dustry in Henan Province. As can be seen from Table 1, the reliability coefficient value is 0.892, which is greater than 0.8, indicating that the reliability quality of the research data is high. For “α coefficient of deleted items”, after any item is deleted, the reliability coeffi- cient will not increase significantly, so the item should not be deleted. For “CITC value”, the CITC value of the analysis items is greater than 0.4, indicating that there is a good correlation between the analysis items, but also indicates that the reliability level is good. In summary, the reliability coefficient value of the research data is higher than 0.8, which indicates that the data reliability quality is high and can be used for further analysis. As can be seen from Table 2, the reliability coefficient value is 0.914, which is greater than 0.9, indicating that the reliability quality of the research data is high. For “α coefficient of deleted items”, after any item is deleted, the reliability coeffi- cient will not increase significantly, so the item should not be deleted. For “CITC value”, the CITC value of the analysis items is greater than 0.4, indicating that there is a good correlation between the analysis items, but also indicates that the reliability level is good. In summary, the reliability coefficient value of the research data is higher than 0.9, which indicates that the data reliability quality is high and can be used for further analysis. As can be seen from Table 3, the value of the reliability coefficient is 0.906, which is greater than 0.9, indicating that the reliability quality of the research data is high. For “α coefficient of deleted items”, after any item is deleted, the reliability coefficient will not increase significantly, so the item should not be deleted. For “CITC value”, the CITC value of the analysis items is greater than 0.4, indicating that there is a good correlation between the analysis items, but also indicates that the reliability level is good. In summary, the reliability coefficient value of the re- search data is higher than 0.9, which indicates that the data reliability quality is high and can be used for further analysis. As can be seen from Table 4, the reliability coefficient value is 0.946, which is greater than 0.9, indicating that the reliability quality of the research data is high. For “α coefficient of deleted items”, after any item is deleted, the reliability coeffi- cient will not increase significantly, so the item should not be deleted. For “CITC value”, the CITC value of the analysis items is greater than 0.4, indicating that there is a good correlation between the analysis items, but also indicates that the reliability level is good. In summary, the reliability coefficient value of the research data is higher than 0.9, which indicates that the data reliability quality is high and can be used for further analysis.",
    "As can be seen from Table 5, the value of the reliability coefficient is 0.875, which is greater than 0.8, indicating that the reliability quality of the research data is high. For “α coefficient of deleted items”, after any item is deleted, the reliability coefficient will not increase significantly, so the item should not be deleted. For “CITC value”, the CITC value of the analysis items is greater than 0.4, indicating that there is a good correlation between the analysis items, but also indicates that the reliability level is good. In summary, the reliability coefficient value of the re- search data is higher than 0.8, which indicates that the data reliability quality is high and can be used for further analysis. As can be seen from Table 6, validity research is used to analyze whether the research item is reasonable and meaningful. The validity analysis uses factor anal- ysis, a data analysis method, to conduct a comprehensive analysis through KMO value, common degree, factor load coefficient value and other indicators, so as to verify the validity level of the data. KMO value is used to judge the suitability of information extraction, common degree value is used to exclude unreasonable re- search items, variance interpretation rate value is used to explain the level of in- formation extraction, and factor load coefficient is used to measure the corre- spondence between factors (dimensions) and items. From the data analysis, it can be seen that the common degree value of all research items is higher than 0.4, indicating that the information of research items can be effectively extracted. In addition, KMO value is 0.903, greater than 0.6, the data can be effectively extracted information. In addition, the variance explanation rate values of the 5 factors were 15.919%, 12.851%, 11.719%, 10.256% and 9.567%, respectively, and the cumula- tive variance explanation rate after rotation was 60.312% > 50%. This means that the information content of the research item can be extracted effectively. Finally, please combine the factor load coefficient to confirm whether the correspondence between the factor (dimension) and the research item is consistent with the ex- pectation. If it is, it indicates the validity; otherwise, it needs to be re-adjusted. When the absolute value of the factor load coefficient is greater than 0.4, it indi- cates that there is a correspondence between the option and the factor. As can be seen from Table 7, human capital management and technical talent management are taken as independent variables, and organizational talent inno- vation ability of high-tech industry is taken as dependent variable for linear re- gression analysis. As can be seen from the above table, the model formula is as follows: The innovation ability of organizational talent in high-tech industries = 17.686 + 0.478* human capital management + 0.042* technical talent manage- ment, and the R-square value of the model is 0.272, which means that human cap- ital management and technical talent management can explain 27.2% of the change of organizational talent innovation ability in high-tech industries. During the F-test of the model, it is found that the model passes the F-test (F = 27.774, p = 0.000 < 0.05), which means that at least one of the human capital management and technical talent management will have an impact on the innovation ability of organizational talent in high-tech industries. In addition, according to the multi- collinearity test of the model, it is found that, VIF values in the model are all less than 5, which means that there is no collinearity problem; And the D-W value is near the number 2, which indicates that there is no autocorrelation in the model, and there is no correlation between the sample data, and the model is good. The final concrete analysis shows that the regression coefficient value of human capital management is 0.478 (t = 6.034, p = 0.000 < 0.01), which means that human capital management will have a significant positive impact on the innovation ability of organizational talents in high-tech industries. The regression coefficient value of technical talent management is 0.042 (t = 0.620, p = 0.536 > 0.05), which means that technical talent management has no influence on organizational talent inno- vation ability of high-tech industries.",
    "Summary analysis shows that human capital management will have a signifi- cant positive impact on the innovation ability of organizational talents in high- tech industries. However, technical talent management has no influence on the innovation ability of organizational talents in high-tech industries. As can be seen from Table 8, the correlation analysis is used to study the cor- relation between organizational talent innovation ability, human capital manage- ment and technical talent management in high-tech industries respectively, and the Pearson correlation coefficient is used to express the strength of the correla- tion. Specific analysis shows that the correlation value between organizational tal- ent innovation ability and human capital management in high-tech industries is 0.519, with a significance of 0.01, indicating that there is a significant positive cor- relation between organizational talent innovation ability and human capital man- agement in high-tech industries. The correlation value between organizational tal- ent innovation ability and technical talent management in high-tech industries is 0.306, showing a level of significance of 0.01, which indicates that there is a signif- icant positive correlation between organizational talent innovation ability and technical talent management in high-tech industries. Organizations should prioritize continuous learning and development programs to enhance the capabilities of their talent. This investment not only improves in- dividual skills but also fosters a culture of lifelong learning, which is crucial for staying competitive in rapidly evolving industries. Continuous learning programs can include workshops, seminars, online courses, and on-the-job training. By providing these opportunities, organizations can ensure that their employees re- main up-to-date with the latest technological advancements and industry trends. This, in turn, enhances the overall innovation capacity of the organization and helps in developing a workforce that is adaptable and resilient. Offering competitive compensation and benefits packages is essential for attract- ing and retaining top talent. This strategy helps organizations secure skilled pro- fessionals and ensures that employees feel valued and motivated, thereby reducing turnover and enhancing productivity. Competitive compensation includes not only salary but also bonuses, stock options, and other incentives. Comprehensive benefits packages can include health insurance, retirement plans, flexible working hours, and remote work options. By providing these, organizations can create a positive work environment that attracts and retains high-performing employees. A strong company culture that encourages innovation and employee engagement is vital for driving organizational success. By creating an environment where em- ployees feel empowered to take risks and contribute creatively, organizations can unlock new levels of innovation and performance. This can be achieved through open communication channels, recognition programs, and a supportive leader- ship style. Encouraging teamwork, collaboration, and a sense of community among employees can also enhance overall job satisfaction and productivity. Ad- ditionally, fostering a culture of innovation can involve setting up innovation labs, encouraging experimentation, and rewarding creative thinking. Leveraging technology to streamline HR processes can significantly improve effi- ciency and effectiveness. Automated systems and advanced tools can enhance re- cruitment, performance evaluation, and talent management, allowing HR profes- sionals to focus on strategic initiatives. Implementing HR information systems (HRIS) can automate routine tasks such as payroll processing, benefits admin- istration, and performance tracking. Advanced analytics and data-driven insights can help in making informed decisions about talent acquisition, development, and retention. Additionally, using technology can improve the overall employee expe- rience by providing easy access to resources and support. Offering clear pathways for career advancement is key to motivating employees and driving innovation. By providing opportunities for growth and development, organizations can foster a sense of loyalty and commitment among their work- force, leading to higher engagement and better retention rates. Career advance- ment opportunities can include internal promotions, leadership training pro- grams, and mentorship initiatives. Providing employees with a clear understand- ing of the skills and experience required for higher positions can help them plan their career trajectories effectively. Additionally, organizations can benefit from the diverse perspectives and innovative ideas that come from promoting from within. In summary, these practical recommendations aim to enhance organizational talent innovation capacity by focusing on continuous learning, competitive com- pensation, a strong company culture, technological efficiency, and career ad- vancement opportunities. Implementing these strategies can help organizations build a more innovative and resilient workforce, ultimately driving long-term suc- cess in the high-tech industry. By investing in these areas, organizations can create a competitive edge, attract top talent, and foster a culture of continuous improve- ment and innovation.",
    "The research makes several significant theoretical contributions to the field of or- ganizational talent management and innovation capacity. Firstly, it integrates hu- man capital development and technological talent management within a unified framework, providing a comprehensive understanding of how these factors influ- ence organizational talent innovation capacity in the high-tech industry. By ex- amining the mediating role of strategies such as competitive compensation, em- ployee engagement, and technological streamlining of HR processes, the study of- fers new insights into the mechanisms through which talent management prac- tices enhance innovation. Additionally, the research highlights the moderating ef- fect of the working environment, emphasizing the importance of a supportive or- ganizational culture and opportunities for career advancement. These findings enrich the existing literature by contextualizing talent management theories within the unique economic and technological landscape of Henan Province, China. The study also contributes to the broader understanding of innovation ca- pacity by demonstrating how strategic talent management practices can drive or- ganizational success in emerging economies. Overall, the theoretical contribu- tions of this research provide a robust foundation for further studies on talent This study provides valuable insights into the role of human capital development and technological talent management in enhancing organizational talent innova- tion capacity in Henan’s high-tech industry. It highlights the importance of stra- tegic talent management practices and the influence of mediating and moderating variables in driving innovation. Future research can further explore the specific Graduate Education Reform Project of Henan Province (2023SJGLX144Y); Grad- uate Education Reform Project of Henan Polytechnic University (2023YJ20); Soft Science Research Program Project of Henan Province (252400410717)."
]