[
    "Citation: Peng A (2025) Sustainable regional development from the perspective of economic resilience: Based on the impact of COVID-19. PLoS ONE 20(1): €0314663. https://doi.org/10.1371/ journal.pone.0314663 Copyright: © 2025 Aotian Peng. This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. The process of regional economic development is marked by a sustained exposure to exter- nal disturbances. In today’s unpredictable and tumultuous global environment, such distur- bances have become increasingly common, underlining the need to advance a region’s economic resilience and foster adaptive mechanisms to handle environmental flux. Compar- ing the typical provinces in eastern, central, western and northeastern regions during the COVID-19 epidemic period, it found that the economic resilience performance of Henan Province, which is a representative of the central region, has the following characteristics. Henan Province has the lowest total production resilience in the selected regions, but it is in he second position in terms of development potential resistance, while it is in the middle range in terms of resilience performance, and it has a weaker resistance performance in ‘erms of the resilience indicator of the standard of living of the residents. Against this back- drop, this study undertakes an analysis and comparison of the economic resilience indica- ors of the 18 cities in Henan Province to suggest several refinements. It urges a promotion of the integrated development of the primary, secondary, and tertiary industries through increasing emphasis on the industrial sector, which will enable a transformation of the sec- oral structuring. Further, digitization can help the upgrading of industries’ intelligence and unction as a lever to raise their competitiveness. Innovation in enterprises is also crucial in enhancing industrial competitiveness, by bolstering the technological innovation capabilities of enterprises and simultaneously boosting the wage-based incomes of residents, resulting in an overall improvement in their standard of living. Also, the study emphasizes the estab- lishment of a digital talent platform to construct a sound regional talent ecology system. Data Availability Statement: The datasets used and analyzed during the current study can be found from the website hittps://www.stats.gov.cn/sj/ndsj/ (China Statistical Yearbook) and https://tij.henan. gov.cn/tjfw/ticbw/tjnj/ (Henan Statistical Yearbook), which can be publicly available. Other data are included in this published article. Funding: This research was supported by the Higher Education Young Backbone Teacher Training Program of Henan Province “Quality Improvement Mechanism of First-class Undergraduate Courses from the Perspective of PDCA” (No. 2021GGJS128), as a Staged Outcome Amidst a world of unprecedented change and upheaval, compounded by the COVID-19 pan- demic, the global economy faces immense challenges, wherein the rupture of global value chains and the disrupted globalization of labor play a significant role. For countries and regions deeply engaged in global labor, prioritizing measures that enable their local regions to recover from the economic contraction, and possibly from an economic negative growth crisis, of the Program of Philosophy and Social Science Innovation Team of Higher Education Institutions in Henan Province “Rural Revitalization and Rural Regional Economic Development” (No. 2021- CXTD-01), Planning Project of Philosophy and Social Sciences in Hen: an Province “Relative Poverty and Endogenous Anti-Poverty Mechanism” (No. 202 BJJ001). The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript. in the shortest possible time remains a core interest. China, in particular, faces enormous pres- sure and challenges under such circumstances, and the localization of production, fragmenta- tion of value chains, and formation of regional networks have become imminent. As pandemic policies shift, regions are competing for economic advantages. Henan Province, as a central region, has been at the heart of the country during China’s previous long historical development cycle. It was also ahead of other regions in terms of eco- nomic development. However, during the decades of implementation of the market economy, Henan Province has gradually lagged behind the south-east. The level of economic develop- ment is lower than that of the south-east, higher than that of the west and the north-east, which is at an intermediate level. Although two decades ago, China also began to take Henan as a multiple national-level strategies implementation place, Henan was expected to have a bet- ter performance in regional economic development through the support of policies. However, the policy effect has not achieved the expected results. In the past few years, affected by changes in the external environment, Henan has even revealed some problems in the process of devel- opment, which are somewhat typical of regional development in China.",
    "Therefore, this paper, which takes Henan Province as the key research object, aims to com- pare the economic resilience of Henan Province with that of typical provinces in eastern, cen- tral, western, and northeastern China, to determine where it stands in terms of national economic development. The study will then compare the different performances in economic resilience among the 18 cities in Henan Province, attempting to identify the different charac- teristics and problems of economic development in different regions, and clarify the driving forces for future economic development, providing support for the rapid recovery and high- quality development of the economy. The current world situation is in the midst of intricate environmental changes and the global economic recession makes it particularly important to study the economic sustainability development. The purpose of using economic resilience as a breakthrough point to explore the economic development status of a region is to provide an idea that can also be applied to the analysis of the economic development status of any region in future studies. Through the analysis of economic resilience, it explores the ways for the region’s economic development to return to the original growth mode or break through to a new growth path, and finds the impetus for the sustainable development of the regional econ- omy. The introduction section of this paper provides an introduction to the background and significance of the research. The literature review examines the connotation of economic resil- ience and relevant literature, summarizes pertinent research findings, and highlights the dis- tinctions between this study and previous investigations based on these findings. In the measurement and data source section defines the measurement methods for economic resil- ience as well as identifies sources for research data. The result analysis section analyzes respec- tively the resilience of total production, development potential, and living standards in the areas under study. Finally, in light of these analyses, the conclusion section concludes by sum- marizing key points from throughout this paper while also proposing future directions for fur- “Economic resilience” is the term used to describe a region’s ability to adapt, adjust, and trans- form its economic development under certain shocks [1]. Thus, “economic resilience” is increasingly a topic of concern in both academic and policy circles. “Resilience”, which origi- nally comes from the Latin word “resilio”, meaning “to bounce back”, is now commonly used as an academic concept in research. Its development has gone through different stages, includ- > « ing “engineering resilience”, “ecological resilience”, and “evolutionary resilience” [2]. “Engineering resilience” mainly refers to the ability of matter to recover under external forces [3]. “Ecological resilience” was first proposed by Holling [4] in 1973 in his work Resilience and Stability of Ecosystems. He defined “ecological resilience” as the ability of an ecosystem to maintain its original structure and function despite being influenced by natural or human- induced disturbances [5]. Later, the concept of “resilience” gradually found its way into the study of human social systems and turned into “evolutionary resilience” [6], which mainly reflects the ability of human social systems to maintain their own structure and adapt to envi- ronmental changes in the face of various perturbations [7]. Currently, the study of “resilience” is widely applied in many fields, including psychology, engineering, and mechanics. As research on the concept of “resilience” becomes more profound, especially in the stage of “evolutionary resilience”, many scholars have proposed that resilience does not always mean returning to the original state, but instead it could also involve transforming into a new state that could be more ideal, better, and more adaptable to the environment [8]. This would not only reflect a system’s ability to maintain its own structure and function, but also the ability to respond to environmental changes in a situation where the environment changes dramati- cally. It would also enhance the system’s ability to adapt to the environment continually, learn and evolve [9]. “Resilience” is not just a simple static concept; it emphasizes the dynamic, con- tinuous, and evolutionary processes involved. 2014, [10] proposed concept regional resilience, defining as a region’s ability to resist external shocks and quickly return to its original growth path or find new development paths under external shocks. He also believed that this ability was a long- term capacity. Martin and Sunley [11] defined economic resilience as a dynamic self-adjusting ability and a reflection of an economic development trend, which they believed contained four dimensions: fragility, resistance, redirection, and recovery. Martin and Gardiner [12] also developed a dynamic economic resilience analysis framework and measurement methods, pointing out that economic resilience was not a static concept, but a multi-stage development process. Many scholars have applied the concept of “economic resilience” to specific regional economic development studies. Jiang et al. [13] argued that the regional economic system is not a smooth and gradual process. It tends to be continuously exposed to various shocks and disturbances. The core of enhancing economic resilience is to make adaptive adjustments in response to changes in the environment. Asongu et al. [14] measured the economic resilience of 150 countries worldwide under the impact of the COVID-19 pandemic using a resilience index. Yang et al. [15] analyzed the economic resilience of Hubei Province, which was most affected by the pandemic in the early stages, and found that the recovery speed of large cities was slower than that of small and medium-sized cities. Jiang et al. [13] measured the impact of the pandemic on the Chinese economy, and found that the Chinese economy maintained strong economic resilience under the impact of the pandemic. Geng [16] analyzed the impact of residential income disparity on economic resilience and concluded that narrowing residen- tial income disparity would improve regional economic resilience. Li [17] proposed to enhance economic resilience by building a resilient capital market. Zhang [18] suggested enhancing regional economic resilience by deepening the role of the digital economy in fostering new dynamics. He [19] points out that the demographic dividend of population quality can signifi- cantly enhance the economic resilience of cities, while the impact of the demographic dividend of population quantity is not obvious. Cai et al. [20] comprehensively measure the regional economic resilience from four dimensions: risk index, stability index, circulation index, and innovation index. They conduct empirical analysis on the economic resilience of 31 provinces in China from 2008 to 2019. Huang [21] empirical analysis demonstrates that digital inclusive finance has a significantly positive impact on the development of regional economic resilience, et al. [22] propose that the impact of public health emergencies on regional economic resil- ience is firstly reflected in the impact on the service industry, and then transmitted to the manufacturing industry over time. The recovery of resilience also starts with the service industry.",
    "The existing research on the resilience of regional economic development mainly focuses on comparisons at the global or national level, through which different performances of regional economies in terms of economic resilience are identified. Some studies further use empirical methods to investigate the reasons behind these differences in performance. This paper focuses on a particular region and compares this region to typical representatives of other economic development regions in China. Comparisons are then made between areas of this region differentiated by administrative divisions. By comparing the evaluation indicators of economic resilience, the differences in the economic development status of each region are analyzed, and suggestions for further economic development are given context of the reality of each region. The application and exploration of the concept of “resilience” in the field of regional econom- ics has broadened the horizons of research methods for regional economic development. In essence, measures of “economic resilience\" include measures based on core variables, eco- nomic cycle fluctuations, and multivariate statistical models. Based on the purpose of this paper and the availability of data, a core variables-based measure of regional economic elastic- ity was selected. Its applicability is reflected in the construction of a sensitivity index to mea- sure the resistance and resilience of a region’s economic resilience, as represented by macroeconomic indicators such as GDP, and using Covid-19 as an impact event. As an epi- sodic event, Covid-19 can be used as a natural experiment to compare economic development before and after its occurrence. This paper focuses on two dimensions of \"economic resil- ience\": one dimension pertains to the ability of an economic system to resist external shocks, maintain its own structure and function, reflecting its aptitude to utilize and allocate prevailing resources. The other dimension relates to the capability of an economic system to respond rap- idly to shocks, adapt itself accordingly to the external environment, and portrays its profi- ciency in recovering over a certain period of time. In this context, Martin [23] presented two simple indicators, that leverage changes in employment circumstances per region in order to measure the region’s restorative capacity during shock periods, while its resistance is repre- sented by the ratio of changes in that region’s employment to shifts in national employment. The specific formula is as follows: AE, = the change of employment level in a certain region during a certain period; E, = the employment level at a certain point in a certain region; Drawing inspiration from Martin [16], this paper evaluates the economic resilience of selected regions by measuring their “resistance” and “recovery capacities” using a two-dimen- sional framework. At the same time, by referring to the measurement of economic resilience by Jiang et al. [13], Wei [24], and Wei [25], this paper selects of indicators by combining the specific reality of China and the availability and credibility of data. Firstly, to reflect the impact of external environment changes, such as the COVID-19 pandemic, on regional economies, the economic resilience is measured from three dimensions—GDP as an indicator of the total production value, fixed asset investment as a measure of development potential, and per capita disposable income as an indicator of the living standards of the residents. Secondly, to account for the impact during the shock period, the occurrence of the shock (2020) is taken as the base period (t-period) and the previous year (2019) as the t-1 period to measure the resistance capacity using the difference in values between the base and t-1 periods, and the recovery capacity using the 2021 values (t+1 period). Thirdly, based on the regional division of China by the National Bureau of Statistics, Guangdong is chosen to represent the eastern region, Hubei to represent the central region, Shaanxi to represent the western region, and Liaoning to represent the northeastern region. Finally, the economic resilience of Henan Province is compared with these regions to analyze the differences in economic development within 18 cities of Henan to identify the underlying factors driving these disparities. To sum up, this paper measures the resistance and resilience of regional economic resil- ience according to the following formula: According to the economic development strategy after entering the 21st century, China has divided 31 provinces, municipalities and autonomous regions (excluding Taiwan Province, the Hong Kong Special Administrative Region and the Macao Special Administrative Region) into four major economic regions, as shown in Table 1. Based on this, this paper finds out the typical provinces in the four economic regions as the research object. Then the research per- spective focuses on the central Henan Province, and measures, analyzes and compares the eco- nomic resilience of all the regions included in it (Henan Province consists of 18 prefectures and cities). All the data in this paper are from China Statistical Yearbook, Henan Statistical Yearbook, and statistical yearbooks and bulletins of other Chinese provinces and cities over the years.",
    "In accordance with Formula (2), the national level of resistance for total production value is 1. Among the selected provinces, Guangdong Province ranks the highest in terms of resistance (as shown in Table 2), but its value is still lower than 1. However, the economic recovery capac- ity of Guangdong Province in the following year was also lower than the national average, pos- sibly because Guangdong’s total volume of imports and exports account for about 22% of the national total, and the sudden outbreak of the COVID-19 pandemic had a huge impact on global trade, especially import and export trade, which severely hit Guangdong, as the top- ranked province for import and export trade. Hubei Province had the lowest total production value resistance in 2020, reaching -1.6736, which is related to the initial outbreak of the COVID-19 in that area. This suggests that the pandemic had indeed caused a significant impact on the economy of the region. The total production value resistance of Liaoning Prov- ince is also relatively low, which may be related to its three-industry structure. In 2020, the pro- portion of the three industries in Liaoning, Henan, and Shaanxi provinces were 9.1:37.4:53.5, 9.7:41.6:48.7, and 8.7:43.4:47.9, respectively. Analyzing the composition of the three industries, it is evident that the proportion of the tertiary industry in Liaoning Province is relatively high, and during the pandemic, measures taken to restrict population mobility had a significant impact on it. According to data released by the National Bureau of Statistics, the year-on-year decrease of the added value index of the tertiary industry was significantly higher than that of the primary and secondary industries in 2020. Therefore, the contraction of the national eco- nomic output value of Liaoning Province, which has the largest proportion of the tertiary industry, was more apparent under the impact of the pandemic. Among the selected regions, Hubei Province, with the weakest total production value resis- tance, had the highest recovery capacity for total production value, indicating that Hubei Prov- ince has experienced a significant rebound in economic output after touching the bottom during the outbreak of the COVID-19. Meanwhile, Henan Province’s total production value recovery capacity in 2021 was the lowest among the selected regions, indicating that there is still room for improvement in its economic development over the two-year period. According to the aforementioned formula, the total production value resistance and recovery capacity of each city in Henan Province were calculated and shown in Table 3. The ranking of the total production value resistance and recovery capacity of different cities in Henan Province is consistent. Zhumadian, Puyang, and Zhengzhou occupy the top three positions, while Jiaozuo, Hebi and Luohe are ranked lower. Zhumadian is a typical agricultural city that has long faced problems such as low industrial level and insufficient innovation momentum. In recent years, it has explored an economic development model based on the integration of the primary, secondary, and tertiary industries, driven by the primary industry. This model has achieved good results in its economic development process. For example, in Zhengyang County, the construction of a modern agricultural industry park that is the only one in the country based on peanuts, starting from “the largest county in the production of peanuts in China”, has achieved industrial upgrading, with the brand value and industrial out- put value of peanuts reaching “double hundred billion”. The “academician economy” develop- ment model based on the technical support of academicians and doctoral workstations has achieved good results. Puyang, as a traditional resource-based city, was listed as one of the third batch of resource-exhausted cities in China in 2011. Transforming its economic structure from relying on the petrochemical industry to finding new sources of growth has been a major challenge. Through continuous exploration, Puyang has made upgrading traditional industries and developing emerging industries as its main development direction. Science and technol- ogy innovation is the key to the transformation and development of industries and the devel- opment of emerging industries. By nurturing “specialized, refined, distinctive and new” small and medium-sized enterprises through science and technology innovation, the number of high-tech enterprises in Puyang increased by 43.7% in 2021, and the number of national tech- nology-based small and medium-sized enterprises increased by 39.8%, which is 10.7 and 11.8 percentage points higher than the average growth rate in Henan Province, respectively. By enhancing innovation capabilities, Puyang has achieved comprehensive and high-quality transformation and become the only resource-exhausted city in Henan Province selected as an outstanding example of national transformation effects. On the other hand, Jiaozuo, as one of the first 12 resource-exhausted cities in China, has transformed its economic structure by shift- ing from “underground mineral resource exploration to the development of above-ground tourism resources”. However, the tourism industry has been greatly affected by the pandemic, and relying solely on tourism as the pillar industry has also affected the overall economic development of the city. Similarly, Hebi, as a resource-exhausted city, is still exploring and moving forward on the path of transformation. As a national food city in Henan Province, Luohe has made good progress in the construction of the “grain to food, agriculture to indus- try” industrial chain in recent years. However, its industrial chain and value chain are still in the early stages of development, and further efforts need to be made to build a more concen- trated industry and upgrade its industrial and value chains.",
    "Among the selected typical representative provinces, Hubei Province had the weakest develop- ment potential and resistance capacity, which was related to the huge impact of the COVID-19 outbreak in the early stages (as shown in Table 4). In terms of the distribution of fixed asset investment in Hubei Province, investment in infrastructure, manufacturing, and real estate development all experienced negative growth, with infrastructure and manufacturing invest- ments both experiencing a decrease of -22.8% and -24.5%, respectively. This can be described as a severe blow to the economy. However, in 2021, Hubei Province had the highest recovery capacity and development potential. On the one hand, this was due to the severe impact of the epidemic in 2020, which significantly suppressed economic development, so there was more release space in 2021. On the other hand, it also demonstrated that the economic development of Hubei Province does have great potential. After reaching the lowest point due to the impact of the epidemic, it also demonstrated strong bottoming and rebounding capabilities. Its fixed asset investment in infrastructure, manufacturing, and real estate development increased by 9.9%, 18.9%, and 25.2%, respectively. In 2020, Guangdong Province had the strongest develop- ment potential and resilience, which can be attributed to its high level of economic develop- ment. The growth rate of fixed asset investment in infrastructure, manufacturing, and real estate development in Guangdong Province in 2020 was 11.6%, -5.1%, and 9.2%, respectively, suggesting that manufacturing investment was hit hardest by the pandemic, with negative growth, while infrastructure investment had the highest growth rate and made the largest con- tribution to the overall fixed asset investment in the region. Guangdong Province had the highest resilience in fixed asset investment recovery, except for Hubei Province. In contrast, Shaanxi Province had the weakest fixed asset investment recovery in 2021, with negative growth. On analyzing the distribution of fixed asset investment, it was found that real estate investment had the highest growth rate in 2020. Real estate development has been greatly affected by the macroeconomic environment in recent years, which may have led to poor per- formance in Shaanxi Province’s recovery potential in 2021. Henan Province’s performance in terms of development potential and resilience is second only to Guangdong Province, with intermediate performance in terms of recovery potential. The resilience indicators of develop- ment potential of each city are shown in Table 5. Regarding the indicators measuring development potential and resilience in different cities throughout Henan Province, it can be observed that overall recovery indicators are substan- tially less significant when compared to resistance indicators. In terms of development poten- tial and resilience, Zhumadian, Anyang, and Xinxiang stand out as the top performers. Zhumadian ranks second in the number of projects featured on the “2020 Key Construction Project List of Henan Province”, after Zhengzhou and Luoyang. Its integrated development model entails the combination of the primary, secondary, and tertiary sectors, driven by both project and platform strategies, which presents an eminent example for other cities in China. In the field of fixed asset investment, Anyang has exhibited remarkable performance, with investment in its strategic emerging industries increasing by 9.1%. This investment accounts for approximately 31.6% of the total industrial investment in Anyang, making it a key compo- nent of the city’s industrial structural optimization agenda. In Xinxiang, investment in the ter- tiary industry has effectively stimulated the growth of fixed asset investment, becoming the major driving force underpinning this growth, which exhibits a promising trend. Regarding the development potential and resilience, differences in value were generally minimal among the various cities throughout Henan Province, with most cities scoring between 0.13 and 0.1. However, it is noteworthy that Luoyang and Zhengzhou ranked last and scored negatively. These cities serve as the central and sub-central regions within Henan Province and have been backed by multiple national-level policies, yet their subpar performance regarding their devel- opment potential and resilience indicators may suggest the presence of significant underlying developmental issues. These cities have failed to fulfill their role of serving as key drivers for development and have even become the only two cities in Henan Province with negative scores for development potential and resilience. In Zhengzhou, the fixed asset investment growth rates across industries such as industry, transportation and warehousing, postal ser- vices, information transmission software, and information technology services, finance, real estate, leasing and commercial services, residential services, and other services, education, cul- ture, sports, and entertainment have been negative. Notably, in the residential services, finan- cial, and cultural, sports, and entertainment sectors, the growth rate has decreased sharply to -70.1%, -50.6%, and -22.1%, respectively, indicating that all areas of industry have suffered set- backs. In Luoyang, the fixed asset investment growth rate was negative across a wide range of sectors, including agriculture, forestry, animal husbandry, and fishery, industry, wholesale and retail, transportation, warehousing, and postal services, accommodation and catering, leasing and commercial services, scientific research, technology services, water resource and public facility management, education, health, social work, public administration, social security, and social organizations. In particular, the growth rates for scientific research and technology ser- vices, public administration, social security, and social organizations, as well as agriculture, forestry, animal husbandry, and fishery registered at -51.2%, -49.9%, -47.3%, respectively. These figures indicate that Luoyang’s investments in fundamental agriculture, technological innovation, and public welfare have been significantly restricted.",
    "Resilience analysis of residents’ living standards is shown in Table 6. Regarding the resilience indicators for residents’ living standards, Hubei Province had the weakest performance, fol- lowed by Henan Province. Comparing the breakdown of per capita disposable income across provinces, Hubei Province had the lowest proportion of wage income, accounting for about 49%, and Henan Province ranked second with roughly 50%. These figures suggest that wage income may be an essential factor in ensuring the resilience of residents’ living standards. In contrast, Shaanxi Province had the strongest performance, followed by Guangdong Province. Although Guangdong Province had a higher proportion of wage income than Shaanxi Prov- ince, the proportion of transfer income in Shaanxi Province was around 27%, while in Guang- dong Province, it was only about 6%. This indicator shows that the state’s transfer payments played a role in safeguarding residents’ living standards in the western region, particularly in Shaanxi Province. In terms of the resilience indicators for residents’ living standards, Hubei Province had the strongest performance, while Liaoning Province had the weakest, followed by Henan Province. Comparing the breakdown of per capita disposable income across Hubei and Henan provinces, the proportion of wage income, net operating income, net property income, and net transfer income in disposable income was similar. However, the absolute value of per capita disposable income in Hubei Province was higher than that in Henan Prov- ince, and this disparity may be the reason for differences in the performance of resilience indi- cators for residents’ living standards. The performance of Henan Province’s cities in terms of resilience indicators for residents’ living standards is not entirely consistent, with most cities ranking similarly in both resilience indicators (as shown in Table 7). For example, Puyang ranked second in resistance and first in recovery capacity. However, some cities had a more significant difference in their rankings between the two indicators. For instance, Shangqiu ranked first in resistance but fifteenth in recovery capacity, while Nanyang ranked fourteenth in resistance but fifth in recovery capac- ity. This phenomenon indicates that the resilience of residents’ living standards is not a simple positive or negative correlation. Of particular note is Zhengzhou, the provincial capital of Henan Province, a national central city, a national pilot free trade zone, a national demonstra- tion zone for independent innovation, and an economic integrated experimental zone for avia- tion ports. Despite receiving multiple national-level strategic supports, it ranked lower in both resistance and recovery capacity. One possible explanation for this could be due to the pains of transformation and upgrading in development. However, it also highlights the need for cities to further address issues related to residents’ disposable income during the development pro- cess, as improving residents’ living standards is the ultimate goal of social development. In the context of the global economic downturn, research on regional economic resilience has become increasingly important. This article selected typical provinces to represent the east, central, west, and northeast regions of China, and analyzed their regional economic resilience indicators. By comparing Henan Province with these typical provinces, the following conclu- sions can be drawn: Henan Province has a relatively weak performance in regional economic resilience. The specific reasons for its lagging performance are as follows: (1) Henan Province’s industrial structure exhibits a relatively high proportion of primary industry, thus necessitating the further integration and consolidation of the primary, secondary, and tertiary industries to promote holistic, sustained development. (2) Although Henan Province has made strides in implementing transformative measures, such as advancing manufacturing industry upgrades and strategic emergent industries, there remains much room for further development in terms of enhancing industrial competitiveness and promoting high-end, intelligent growth. (3) In order to remain innovative in the present-day market environment, enterprises in Henan Province must continue to enhance their capacity and cultivate a culture of creative ideation. (4) Given its status as a populous province, Henan Province must place a heightened emphasis on attracting and cultivating high-quality human capital, whilst continuously striving to improve the living conditions of local residents. This paper focuses on Henan Province. The economic development resilience of all areas in Henan Province is compared and analyzed, and on this basis, targeted sustainable develop- ment proposals are put forward in the context of the actual development of the region. Com- pared with previous studies, this research on sustainable regional economic development is more focused in perspective and more specific in methodology. Firstly, compare and contrast the development of a region within the broader system of national economic development in order to find its niche, and then do a more detailed analysis of regional realities to propose measures for the sustainable development of the region’s economy based on the performance of economic resilience indicators. The research ideas in this paper can be generalized to the study of sustainable development in other regions.",
    "In light of the findings reflected in this analysis, the following recommendations are posited to bolster the economic resilience of Henan Province: Firstly, Henan Province must priori- tize structural overhauls of its economy, pivoting towards industrialization while retaining a focus on food security. This necessitates the integration of primary, secondary, and ter- tiary industries to ensure the attainment of sustainable, high-quality regional development. Secondly, Henan Province must concentrate on advancing digital industries to bolster industrial competitiveness, perpetually striving to enhance intelligent growth through tech- nological innovation. With careful consideration of the positioning of economic entities within the industrial chain, Henan Province can successfully upgrade the established indus- trial sectors and promote the scale development of emerging industries alike. Thirdly, Henan Province must leverage the confluence of a variety of national-level strategies to stimulate energetic innovation and cultivate “specialized, refined, distinctive, and new” small and medium-sized enterprises. By promoting industrial competitiveness at the micro- level, the vitality of the wider market can be enhanced, creating additional job opportunities and bolstering the livelihoods of residents in the process. Lastly, Henan Province must pro- actively take inventory of its talent pool and closely examine the talent structure of the region overall. In light of these assessments, a comprehensive digital talent platform and a regional “talent map” can be developed, thereby attracting and retaining high-quality per- sonnel to create a vibrant, innovative talent ecosystem that promotes the continued devel- opment of local industries. By using the method of quantitative analysis, this article analyzes the toughness index of regional economy from the aspects of total production, development potential and residents’ living standard, and compares several typical areas. Through comparative analysis, it puts for- ward improvement suggestions for the development of backward regions, which provides new ideas for high-quality development of regional economy. However, at the same time, this study still has certain shortcomings, such as the selection of typical regions is subjective to some extent, and the selection of indicators describing economic resilience can be more diverse. If there are opportunities to expand this study in the future, the selection of compara- tive regions and related indicators will be further enriched, so as to obtain more comprehen- sive research conclusions."
]