[
    "1School of Surveying and Land Information Engineering, Henan Polytechnic University, Jiaozuo 454003, China 2City of ZhengZhou Center of Disease Control and Prevention, Zhengzhou 450042, China Abstract: With the deepening of aging, pension institutions have gradually become the focus of research, and the reasonable distributions and locations of pension institutions have great impact on their own functions. Taking Henan Province as the study area, the spatial distribution characteristics of pension institutions are analyzed by the nearest neighbor index method and the kernel density estimation method, the accessibility of pension institutions with a single service radius and its influencing factors are analyzed by improved potential model and two-step floating catchment area method. The results are that: (1) the pension institutions in Henan Province generally show the characteristics of “central cohesion-denseness in the north and sparseness in the south”, and have the trend of development in marginal areas. (2) The spatial accessibility of pension institutions decreases from northeast to southwest, positively affected by economy, public service, per capita income of residents and negatively impacted by the elderly population. (3) The improved potential model is more suitable to evaluate the spatial accessibility of pension institutions in Henan Province. Improving the elderly problem is an important part of improving people's living standard and ensuring their quality of life. Actively promoting the development of the elderly service industry can alleviate the pressure of social elderly care brought by the growth of the elderly population, however, there are problems of unreasonable location of elderly institutions and imbalance between service capacity and service recipients in many elderly institutions, and the analysis based on accessibility can well highlight the problems of wasted resources and insufficient supply. Henan Province is a large population province, and according to the National Bureau of Statistics, the total population of Henan Province has been growing since 2011, from 93.88 million to 96.4 million in 2019, and the dependency ratio of the elderly population has grown from 12.5% in 2011 to 16.3% in 2018; as of the end of 2018, there were 16.06 million elderly people over 60 years old in the province, accounting for 16.7% of the resident population 16.7%, with Henan Province ranking third in the country in terms of total elderly population[1]. The elderly population in Henan Province has the characteristics of large base, rapid growth rate and advanced aging, and the degree of social aging is deepening. The issue of elderly care has gradually become a social issue of public concern. Henan Province has been improving the combined medical and nursing care service system based on home, community and institutions, and has issued a series of policies concerning the rights and interests of the elderly, nursing care institutions and charity. The Civil Affairs Department of Henan Province has released the \"Star Classification and Evaluation Standards for Service Institutions in Henan Province\", \"Service Quality Standards for Elderly Service Institutions in Henan Province\", the first batch of supply and demand information list of elderly service institutions in Henan Province[2], and issued the \"Notice of Henan Provincial Department of Finance, Henan Provincial Department of Civil Affairs on the Piloting of Construction of Intelligent Elderly Service Platform\" (Yu Cai the Comprehensive [2020] No. 21) in 2020, requiring the launch of piloting of intelligent elderly service platforms in 12 places in Henan Province, including Zhengzhou City and Changyuan City, according to the award funding standard of no more than 3 million yuan per pilot on average[3]. Accessibility refers to the study of the degree of difficulty in overcoming spatial barriers or the potential for interaction, indicating the number of opportunities available to residents from a certain location using a certain means of transportation or the degree of difficulty in achieving the purpose, the ability or potential for interaction between two points or things, and is often used to study the location rationality and spatial distribution characteristics of public service facilities[4]. There are many domestic studies on accessibility. Song researched computer-aided accessibility and promoted the digital development of accessibility research; Yang synthesized and summarized the accessibility concepts and methods of Western research; Li compared the advantages and disadvantages of the main accessibility evaluation methods and proposed the development and outlook of accessibility[5- 7]. The study of the spatial pattern of elderly institutions based on accessibility has also made great progress. For example, Gao measured the accessibility of elderly institutions in Shanghai through different spatial distances, Xu compared and analyzed the single service threshold and the three-level service threshold to derive the spatial characteristics such as the central cohesion and peripheral dispersion of elderly institutions in Nanjing, Li used spatial analysis techniques to derive the clustering-random distribution pattern of elderly institutions in Xuzhou City, and researched the accessibility of elderly institutions in Wuhan City, Beijing and other regions[8-13].However, there are few studies on the accessibility of nursing institutions in Henan Province, and the research methods used are single, without further analysis This paper proposes to use the entropy weight method to get the comprehensive evaluation indexes of pension institutions in Henan Province, and use the kernel density estimation method and the nearest neighbor index method to analyze the spatial layout of pension institutions; from the perspective of accessibility, the improved two-step moving search method is used for the setting of search radius and distance decay coefficient, and the improved potential model is used for the setting of scale influence of supply and demand side, and the related operation of ArcGIS is used to The analysis results of the two methods are obtained, and the correlation between accessibility and each factor is analyzed by combining the economy, elderly population, public services and per capita income of each jurisdictional city in Henan Province, and the characteristic analysis of the spatial pattern of elderly institutions in Henan Province is derived。 Henan, also known as Zhongyuan and Yuzhou, is located in the middle and lower reaches of the Yellow River in the southern part of the North China Plain, with a total area of 167,000 square kilometers, 17 prefecture-level cities, 21 county-level cities, and 1 province-administered county-level city. It is located in the combination of the open coastal region and the central and western regions, and is the middle zone of the domestic economy that develops and advances in sequence from east to west, and is also an important comprehensive transportation hub and the center of human and logistics information flow in the country, with a gross product has been increasing year by year, and the per capita disposable income and per capita consumption expenditure of residents tend to rise linearly in the past five years; data show that the top five cities in GDP ranking in the first three quarters of 2020 are the same as those in 2019, and have a real growth rate of 0.8%~1.8%; meanwhile, Henan Province is one of the traditional large population provinces, with 13.83 million people aged 65 and above as of the end of 2021, accounting for 14%, and the total number of all kinds of elderly institutions is 937 according to statistics. With the increased attention to elderly care and policy support, the quantity and quality of elderly institutions in Henan Province have improved.",
    "The economic data of Henan Province is obtained from the National Bureau of Statistics; the population data of each city is obtained from the Henan Statistical Yearbook of Henan Provincial Bureau of Statistics; the pension policy of Henan Province is obtained from the Department of Civil Affairs of Henan Province and the Ministry of Civil Affairs of China; the map and traffic data of Henan Province are obtained from the National Geographic Information Resource Catalogue Service System; the name, address, number of beds and floor space of pension institutions in Henan Province are obtained from the Pension Information Network using crawling technology. The name, address, number of beds and floor space of the elderly institutions in Henan Province are obtained from the information network of the elderly. According to the national standard \"Rating and Classification of Elderly Institutions\" (for trial implementation) issued by the Ministry of Civil Affairs of China, the entropy weighting method is used to calculate the weights of each indicator of the existing data to obtain the comprehensive evaluation index of each elderly institution[14].With reference to the grading criteria stipulated in the \"Star Rating and Classification Standards for Service Institutions in Henan Province\", the number of beds of elderly institutions is taken as a parameter, and those with less than 50 beds are classified into one level, and those with 100, 150 and 200 beds as interrupted values are divided into four levels. The elderly institutions in the central and northern regions are large in scale and concentrated in distribution, while those in the east and west and south are small in scale and The distribution is sparse. According to the 1:1 million map data provided by the national geographic information resources directory service system, six maps are used to stitch together to form Henan Province, including five types of elements: water system, residents and facilities, transportation, boundaries and political areas, place names and notes. The map of Henan province was obtained by map stitching and map cropping, including the data of districts and counties, and the data of settlements, and the elderly population was divided into four levels according to the grading method of pension institutions, with the interrupted values of 50,000, 100,000 and 150,000 elderly people. There are 17 provincial cities and 1 provincial county-level city in Henan Province, Nanyang City has the largest elderly population with a population of 1.26 million; there are 162 counties and districts, and Jinshui District in Zhengzhou City has the largest number of elderly people with a population of 177,000. The number of elderly people in Henan Province shows an overall pattern of high in the east and low in the west, decreasing from southeast to northwest. The nearest neighbor index method is a method to determine the spatial distribution pattern of the study object by the nearest neighbor distance between points. NNI The nearest neighbor index is obtained by comparing the actual average nearest neighbor distance to the theoretical average nearest neighbor distance. The actual average nearest neighbor distance (Equation 1) is calculated using ArcMap's average nearest neighbor tool to obtain the results based on Euclidean distance and Manhattan distance[15]. The kernel density estimation method is a non-parametric estimation method, which is simple to understand and the analysis results are intuitive, and is often used to study the spatial pattern of public service facilities. The experimental operation takes a univariate of the point data as the number of continuous surfaces created, and calculates the quantity of each unit area based on the univariate sample point population, using the kernel function (Equation 2) in a local simulation to find its spatially smoothed estimate[15]. The potential model is a reflection of the degree of mutual attraction between the two sides of the study. The general potential model takes into account the service capacity or size of the nursing home, the impedance factor between the nursing home and the settlement, and the travel friction coefficient; the improved potential model adds the population size influence factor, taking into account the size influence factor of both supply and demand (Equation 3, Equation 4)[16]. The two-step mobile search method calculates the shortest travel time or distance from the center of gravity of the population to a pension institution, using time or distance cost as a criterion. The general two-step mobility search method takes into account the service radius of the facility, and only the threshold factor of the study object is added in the analysis, and the decrease of accessibility due to the increase of distance also needs to be considered. Therefore, scholars propose distance friction coefficient and barrier function, among which the Gaussian function is more realistic in the threshold range for spatial distance reduction and suitable for improving the two-step moving search method (Equation 5, Equation 6, Equation 7)[17].",
    "The spatial distribution is based on the relationship between the nearest neighbor index NN/ and 1, less than | is a cohesive distribution, equal to | is a random distribution, and greater than | is a more dispersive random distribution; meanwhile, according to the z-score, the distribution is cohesive in the range of less than -1.65, random in the range of -1.65 to 1.65, and uniform in the range of greater than 1.65\"5], The experimental setup of the study area was1.67 x 1011m?. , Euclidean distance and Manhattan distance were used to calculate the nearest neighbor index (Table 1), comparing the two results to better illustrate the distribution characteristics. From the calculation results in Table 1, the nearest neighbor indexes of both methods are less than 1, and the z- values are in the range lower than -2.58. According to the criteria and basis, the spatial pattern of pension institutions in Henan Province is judged to be cohesive distribution. Because the characteristic of human habitation is to live in groups and gather and develop in places with suitable environment to form an urban system, the development and distribution of pension institutions in the city also has the cohesive nature of human habitation. The kernel density estimation method is implemented using the kernel density analysis tool in ArcMap, and the appropriate bandwidth is selected to avoid local feature blurring, In this study, a bandwidth search radius of 30km was set, and the study area layers were gridded with 5km×5km edge length, using the comprehensive evaluation index of elderly institutions as the count to create a continuous surface, yielding a density value distribution interval of 0~0.02, and dividing the density values into five zones according to the standard classification method of minimum intra-class variation and maximum inter-class variation, with 0.001, 0.003, 0.006, 0.011 as interrupted values: low value zone to High value zone(Figure 1). From this, it can be seen that the pension institutions in Henan Province are mainly concentrated in Zhengzhou City, Luoyang City, Kaifeng City and Anyang City, followed by Nanyang City, Xinxiang City and Xuchang City; among the counties in Henan Province, the density of elderly institutions in Zhengzhou City and parts of the surrounding counties immediately adjacent to the city, Kaifeng City, Luoyang City and Anyang City is relatively high. Overall, the distribution of pension institutions in Henan Province is dense in the north and sparse in the south, with the provincial capital cities being the most dense and having a marginal development; the marginal counties and cities such as Nanyang City, Xinyang City and Anyang City have relatively high densities of pension institutions among all jurisdictional cities; the density values of pension institutions in Shangqiu City, Puyang City and Sanmenxia City have a development trend. In general, the density value of elderly institutions in the central city is the largest, and gradually decreases outward by circles, and the density value picks up when approaching the outermost circle. reduction in accessibility due to the increase in distance, and for some public facilities with more urgent timeliness, the distance factor has a greater impact and requires a higher accessibility to ensure the full performance of their functions, while for public facilities with non-urgent timeliness, the distance factor has less impact. Peeters found that the distance friction coefficient was between 0.9 and 2.29 in 2000[18]. It was found that the distance attenuation effect of non- emergency type of elderly institution facilities is weak, and friction factor takes the value of 1. In this study, the comprehensive evaluation index of elderly institutions as the service capacity of elderly facilities is calculated according to the formula of 2.3.1, and the evaluation index is expanded by a multiple in order to facilitate the representation of the accessibility values; kriging interpolation is used to visualize, and the municipal map of Henan Province is used as the benchmark, and by masking the spatial accessibility map of elderly institutions in Henan Province is extracted as shown in Figure 2, and the accessibility values and visualization results are classified into low, lower, medium, higher and high values according to the standard classification method for the purpose of highlighting the characteristics It is intuitively seen from the accessibility analysis chart that the spatial accessibility of pension institutions in the north and northeast of Henan Province is better, among which the spatial accessibility of elderly institutions in Zhengzhou City and Kaifeng City is higher, followed by Anyang City, Luoyang City, Xuchang City and Jiyuan City; the accessibility of elderly institutions in the south of Henan Province is weaker. According to the distribution of accessibility entropy weights, accessibility is higher in the central areas of Henan Province, such as Gulou District, Shunhe Huizi District and Longting District of Kaifeng City, and accessibility decreases from the central areas outward, with a slow decrease to the northwest and a fast decrease to the southeast, and the accessibility entropy weights show a trend of decreasing from the northwest to the southeast.",
    "The search radius of the two-step mobile search method depends on the size, environment, the level and ratio of medical and nursing staff, and the degree of perfection of facilities of the elderly institutions. Although this study comprehensively evaluates the elderly institutions in Henan Province, the effective service distance thresholds for each level still need to be studied, so a single effective service distance of 35km is still used here. the first step creates the OD distance cost matrix from the elderly institutions to the residents, and uses the comprehensive evaluation index of the elderly institutions to calculateR;; the second step creates the distance cost matrix from residential points to elderly institutions, and calculates the accessibility index value and its distribution according to the formula of 2.3.2; the calculation results are visualized using kriging interpolation, extracted by mask to the accessibility map of elderly institutions in Henan Province, as shown in Figure 3, with the classification of the same potential model, the accessibility values and visualization results are classified as low to high values. According to the results of accessibility calculation, the accessibility index values of Zhengzhou city, Anyang city and Luoyang city are ranked high, the entropy weight distribution map shows that the heterogeneity among regions is weak, and the accessibility of elderly institutions in Henan province as a whole is weakening from west to east and from northwest to southeast; the kriging interpolation analysis map shows that the accessibility performance of Zhengzhou city, Anyang city, Luoyang city, Jiyuan city and Nanyang city is good. Overall, the spatial accessibility of elderly institutions in Henan Province is higher in the north and lower in the south, higher in the west and lower in the east, the northern region is better than the southern region, the accessibility of the southern region is worse than the southern region except Nanyang City, the marginal region has development trend, the accessibility advantageous region is not prominent, and the distribution regularity is weak. The reasonableness of the two methods in representing accessibility is evaluated based on the calculated accessibility differences. Comparing the accessibility entropy weights and kriging interpolation values of the two methods, the relative accessibility of Sanmenxia, Xinyang and Nanyang are enhanced and that of Kaifeng is reduced in the regions with higher relative accessibility than the analysis results of the potential model by the two-step moving search method. Since the accessibility entropy weights of both methods are calculated using the same comprehensive evaluation indexes of elderly institutions and the number of elderly population, the results are directly subtracted from the accessibility values are subtracted to obtain the difference of the accessibility entropy weights, and the results are divided into two categories, below 0 and above 0, in order to visually highlight the differences. If the difference is less than 0, the accessibility value obtained by the two-step moving search method in the region is larger, and the evaluation of the region is more reasonable; if the difference is larger than 0, the accessibility value obtained by the potential model is larger, and the evaluation of the region is more reasonable. There are 19 counties and districts with accessibility difference greater than 0, and other counties and districts with accessibility difference less than 0; the number of counties and districts with difference greater than 0 is much more than those with difference less than 0. Therefore, the improved potential model is more reasonable to evaluate reachability of elderly institutions in Henan Province. Because the potential model is based on the potential of the research object, the higher the comprehensive evaluation of the elderly institutions, the stronger the attractiveness to the surrounding elderly population, and the better accessibility compared with other elderly institutions within the same distance; while the two-step moving search method is a statistical calculation within the service radius of the research object, and its results are limited and influenced by the service radius, which cannot better express the strength of accessibility. the the As a multi-grade, multi-facility, non-adjacent, non- emergency public service facility, the influencing factors of the spatial accessibility of pension institutions are various, including transportation, size class of pension institutions, distribution of elderly population, economy, financial expenditure, resident income, etc. Based on the regional distribution of influencing factors and the comparative analysis of regional accessibility, the specific correlation between each factor and accessibility of the region is derived, so as to obtain useful social value. The following is the factor analysis of economy, public service, elderly population, and per capita income ratio of residents in each city of Henan Province.",
    "To highlight the spatial characteristics of the influencing factors, GDP was divided into four categories with interrupted values of 100 billion, 150 billion, and 200 billion, public service levels were divided into lower, lower, higher, and higher, and the old age ratio was divided into five categories with 10%, 11%, 12%, and 13%, and the per capita income of each city was distributed in the lower middle group, and with reference to the national quintile income grouping of residents, the per capita income of Henan Province was The quintiles of income in Henan province are used to analyze the pattern[19]. The economic, public service and per capita income ratios in the northern part of Henan Province are significantly better than those in the southern part of the province, where the economic and public service rankings show a decreasing trend from northwest to southeast, and the per capita income ratio shows a decreasing trend from northeast to southwest; the elderly population in most of the southern part of Henan Province is larger, while the elderly population in the northern part is smaller, showing a decreasing trend from southeast to northwest. The elderly population in most areas in the south of Henan Province is larger, and the elderly population in the north is smaller, showing a trend of gradual decrease from southeast to northwest. In a comprehensive view, the economic development in the northern region is better, the public service level is high, the corresponding public service facilities are well funded and equipped, the quality of medical care is high, the transportation is more convenient with the economic development, the per capita income of residents is higher and more attention is paid to the improvement of the quality of life, the elderly population in most of the regions is smaller, the demand and supply of social institutions for the elderly are relatively more balanced, a variety of favorable factors contribute to the increase of the elderly population in the northern region of Henan Province. The accessibility of favorable factors, while the accessibility of the southern part is lower than that of the northern part due to the opposite unfavorable factors. In this paper, through data processing and experimental analysis, the entropy weight method is used to integrate relevant influencing factors and obtain comprehensive evaluation indexes of each pension institution, and the spatial distribution of pension institutions in Henan Province is cohesive according to the ratio and z-score of the nearest neighbor index method; the kernel density estimation method is used to show the distribution of pension institutions in each jurisdictional city specifically. From an overall perspective, the overall characteristics of pension institutions in Henan Province show a north-dense-south-sparse-edge development trend, mainly distributed in the northern region, with density values gradually decreasing in a circle from the central city outward, concentrated in Zhengzhou City, Luoyang City, Kaifeng City and Anyang City. Combined with the economic and per capita income of each city in Henan Province, the northern cities have a high economic ranking and the southern peripheral cities have a better per capita income and excellent conditions for the development of elderly institutions. The potential model adds the factor of the number of elderly population in each region, and considers the service capacity of elderly institutions and the influence factor of residential points, solves the travel impedance factor and the influence factor of elderly population size, and obtains the qualitative accessibility index value; the two-step moving search method adds the distance decay function, and solves the supply-demand ratio and accessibility index value of elderly institutions in two steps under a single limit distance. The spatial accessibility of pension institutions in Henan Province is characterized by high north to low south and high east to low west, and decreases from the central city outward. The accessibility is positively influenced by economic, public service level and per capita income of residents, and negatively influenced by the number of elderly population. Comparing the two accessibility analysis methods, the improved potential model obtains higher accessibility entropy weights for most areas in Henan Province and evaluates the spatial pattern of elderly institutions in Henan Province more reasonably. The two methods are used to analyze the spatial distribution characteristics of the elderly institutions in Henan Province, and the accessibility of the elderly institutions in Henan Province is studied by both methods, which reveals the spatial pattern characteristics of the elderly institutions in Henan Province, and the comparative analysis finds out the suitable methods to evaluate the accessibility of the elderly institutions in Henan Province, which makes the conclusions more based and reliable. However, there are some shortcomings: firstly, the two-step moving search method sets a single service radius of pension institutions, and although the comprehensive evaluation of pension institutions is carried out, there is no further division of levels, and variable service radius should be set to observe the analysis results of the two methods and discover a more accurate spatial pattern of pension institutions in Henan Province; secondly, only the influence factor of the size of the elderly population is added to the potential model, and the scale level also affects its attractiveness, although there is a factor for distance attenuation in the potential model, there is no threshold limit,"
]