[
    "Abstract: As the main group engaged in agricultural production in a country, farmers are responsible for the diet of countless citizens, and their interests undoubtedly need to be protected. Therefore, this article aimed to study the impact of changes in food prices on farmers' income and analyze the relationship between the two. Moreover, this article took the actual income of farmers in Gongyi City, Henan Province as an example to conduct a more detailed case analysis of the relationship between the two. At the end of this article, by comparing the relative price indicators of grain and the proportion of grain income in Gongyi City, it was concluded that there is a certain binding relationship between the two. The income situation of farmers is undoubtedly crucial for the development of agriculture. Chen W believed that the construction of digital rural areas would affect the net agricultural income of farmers [1]. Finger R stated that dynamic farmers can help improve the resilience of agriculture and food systems [2]. Amfo B argued that diversity in crop cultivation can help increase farmers' income [3]. Sapkota T B pointed out that nutrient management of crops can increase yield and thus increase farmers' income [4]. Sapbamrer R believed that effective management of organic agriculture can provide assistance for agricultural transformation [5]. There are many factors that can affect farmers' income. Among many factors that affect farmers' income, this article believed that changes in grain prices would be the main factor. Ljungqvist F C believed that the price of grains affects the economy of society [6]. Umar Z argued that there is a connection between oil prices and agricultural product prices [7]. Degroot D stated that climate change would affect food production, thereby affecting food prices [8]. Ihle R proposed that food prices and other commodity prices would be influenced by the international political situation [9]. Lawson J believed that speculative activities in the financial market would have an impact on food prices [10]. The changes in grain prices and how they affect farmers' income need to be studied and verified. This article first conducted statistics on the income situation of farmers, and compared the income between urban and rural areas, proving that farmers' income has been increasing year by year and has high development potential. Moreover, by analyzing the proportion of farmers' income, it was found that agricultural income gradually decreased in the total proportion of farmers' income. Taking soybeans and corn as examples, it was argued that grain prices (especially some major grains) may be influenced by many non-agricultural factors. Finally, by comparing the actual situation of Gongyi City with changes in grain prices and farmers' income, it was found that there is a certain binding relationship between the two. Most research viewpoints believe that the income situation of farmers is complex and influenced by multiple factors such as market orientation, agricultural modernization, support policies, and climate change. The current agricultural modernization and market-oriented policies can greatly promote rural development, but climate change and market fluctuations may also pose challenges. It can be said that the situation of farmers' income has always been a relatively complex economic issue. Yan BJ conducted comprehensive statistics on the income situation of farmers [11]. The comparison of per capita disposable income between urban and rural residents is shown in Figure 1. From it, it can be seen that the per capita disposable income of urban areas increased from 24051 yuan in 2011 to 46584 yuan in 2020, while the per capita disposable income of rural areas increased from 8403 yuan in 2011 to 18521 yuan in 2020. Li J also pointed out that there is an objective development gap between urban and rural income [12]. Although rural income has not kept up with the development level of urban income, the growth rate of rural income is higher than that of urban income, so the development potential of rural income cannot be ignored. Liao H P conducted statistics on the proportion of rural residents' income in a certain area [13]. The main statistical method is to observe the main sources of income of rural residents by distinguishing their income structure. Figure 2 shows the change in the proportion of agricultural income to rural residents' income. From it, it can be seen that agricultural income decreased from 68% of total income in 2011 to 35% of total income in 2020. Although agricultural labor is the main job of rural residents, its proportion in rural residents' income is constantly decreasing, because with the continuous development of industrialization and urbanization, rural areas have also been affected. Many other industries have begun to attract rural residents to engage, thereby diluting the proportion of agricultural income in total income. Zhang R's research pointed out that rural industrialization is the future direction of rural development [14].",
    "Figure 3 shows the income ratios of rural residents from different sources of income. In Figure 3, agricultural income accounted for 35%, and forestry income accounted for 2%; animal husbandry income accounted for 22%, and fishery income accounted for 1%; other income accounted for up to 40%. From it, it can be seen that with the recent changes in the industrial structure of rural areas, the proportion of other income has exceeded that of agricultural income, and other income may include many projects such as urban migrant work, rural industrialization, and tourism. Secondly, there is the income from animal husbandry. In the traditional small-scale agricultural economic model of rural households, agriculture and animal husbandry are undoubtedly the most important two types of income, and their respective proportions are generally directly related to the local ecological environment. For example, grassland areas are suitable for grazing, while water towns are suitable for rice cultivation. Finally, forestry and fisheries are relatively marginalized compared to agriculture and animal husbandry, but still maintain a certain proportion in today's rural areas. As a result of agricultural production, the price and cost of grain directly affect the market situation of agricultural products. Xu S also pointed out in his research that fluctuations in grain prices have a direct impact on farmers' income [15]. When grain prices rise, farmers can earn higher sales income, thereby increasing their total income and improving their livelihoods. On the contrary, a decrease in grain prices may lead to a decrease in farmers' income, as the prices of the agricultural products they sell are lower. In addition, changes in food prices can also affect farmers' production costs. If prices fall, farmers still need to pay high production costs, such as seeds, fertilizers, and labor, which may put pressure on their economic situation. Farmers also face market risks, as food prices are influenced by various factors such as weather, market demand, and global economic conditions, and price fluctuations can also affect farmers' decisions, including crop selection and sales timing. Li X Y took specific crops such as soybeans and corn as examples, pointing out that the rise in international food prices would have a significant impact on China's agricultural market [16]. Wang Q further pointed out that crude oil prices would have an impact on certain types of grain prices [17]. Figure 4 shows two ways in which the rise in crude oil prices affects the prices of food crops. From it, it can be seen that the increase in crude oil prices would lead to two effects, namely substitution effect and cost effect. The mentioned effect would stimulate the development of biodiesel, leading to an increase in demand for soybean oil. At the same time, it would also stimulate the development of fuel ethanol, leading to an increase in demand for corn. The ultimate increase in demand for soybean oil and corn would also lead to an increase in the prices of these two crops, ultimately affecting the livestock industry and increasing its production costs. The cost effect would lead to an increase in the prices of pesticides, fertilizers, and fuel costs. This would lead to an increase in the cost of grain production, leading to an increase in prices, and the cost effect would also lead to an increase in shipping costs, thereby increasing trade costs. That is to say, crude oil, as a byproduct of food crops, its price fluctuations would naturally have an impact on food crops. Lu LX pointed out that reducing agricultural costs would promote farmers' income growth [18]. According to the previous statistical research on the disposable income of rural residents and the proportion of various types of income, it can be seen that although in today's increasingly comprehensive industrialization, even rural areas mainly responsible for agricultural production have begun to decline in their proportion of income relying on agriculture. Although the proportion of agricultural income has been surpassed by the proportion of non agricultural income brought by some emerging industries or migrant workers, it still accounts for 35%. So, based on the current rural environment, although the status of agricultural income is not as good as before, it is still an indispensable part of income. After completing the statistical analysis of the overall environment, in order to further analyze the relationship between farmers' income and food prices, this article believed that it is necessary to conduct a case study of a specific region. Li E L's specific cultivation data on Gongyi City can help this article analyze [19].",
    "Figure 5 shows the proportion of crop planting area in Gongyi City. Among them, wheat accounts for the highest proportion, up to 45%, followed by corn, accounting for 35%. These two crops alone have already accounted for 80% of the crop planting area in Gongyi City. The remaining small-scale crops are peanuts, soybeans, cotton, vegetables, and some smaller crops, which account for 20% of the remaining arable land. From this, it can be concluded that wheat and corn are the main forces in the food supply of Gongyi City. These two crops bear the main food supply responsibility for the population in the region, while the rest of the crops are planted on a smaller scale due to dietary habits, soil types, or ecological characteristics. The soybean and corn crops mentioned earlier, which are affected by crude oil prices, account for 40% of the cultivation in Gongyi City, which is also a significant proportion. Therefore, the agricultural market in the region would also be greatly affected by other factors. Figure 6 shows the changes in the proportion of grain income in Gongyi City. However, as the proportion of agricultural income mentioned earlier took into account other sources of income such as migrant workers, rural industrialization, and tourism, which would increase over time, this variable must be excluded as non agricultural income. Therefore, the proportion of food income in Figure 6 was calculated by subtracting the non agricultural income from the denominator. It can be seen that the relative price index of grain has been declining since 2011, with occasional fluctuations along the way. This downward trend stopped in 2018, and then grain prices began to rise. As of 2020, the upward trend is still continuing. The trend of changes in the proportion of grain income is basically the same as the relative price index of grain. However, since 2015, although the changing trends of the two curves are still similar, the proportion curve of grain income has started to decline significantly, which may be due to the emergence of certain emerging directions in agricultural production or other reasons leading to the dilution of grain income. Overall, grain income is closely related to grain prices. As mentioned earlier, food income and even overall agricultural income have begun to decline in the proportion of modern farmers' income, and many new industries are gradually replacing agricultural production. As Wang G X said, migrant workers, as a population migrating from rural to urban areas, represent the huge demand for emerging industries [20]. Therefore, the impact of grain prices on the overall income of farmers may become increasingly low in the future. The idea of this article is to first point out the development potential of rural areas, and then discuss that food prices may be influenced by many non agricultural factors. Finally, based on the actual situation in Gongyi City, it was demonstrated that food prices are closely related to farmers' income. It can be said that the empirical analysis conducted in Gongyi City in this article is innovative, and in addition, the agriculture in Henan Province where Gongyi City is located is extremely developed, which has more practical significance. The shortcomings of this article are reflected in the lack of selecting another region to compare with. income increases, it seems that the importance of agricultural production has begun to decline. However, agriculture has always been the foundation of industrialization, so food prices still have a very high impact on farmers' production and life. In the future, when industry can feed back agriculture to a greater extent, farmers' income would be more guaranteed. This work was supported by 2023 Zhengzhou Social Science research project \"Impact of Main grain price changes and costs on farmers' income - Based on Empirical analysis of Gongyi City\" project number(ZXLX20230382)."
]