[
    "Abstract: The official implementation of the Family Education Promotion Law of the People's Republic of China makes family education become the focus of social attention. Through scientific research methods such as literature analysis, questionnaire survey, field investigation and individual talk, the author conducted in-depth investigation and exploration of rural family education in Henan area, it is found that there are a series of problems such as the lack of rural family education subjects, outdated education concepts, lack of professional talents, weak guidance ability, lack of support function, etc. Henan rural family education has become a relatively weak link in the family education system, which also highlights its related revitalization research is imperative and imminent. Therefore, based on the development status of rural family education in Henan province, this study explores the existing problems and analyzes the causes, and puts forward corresponding suggestions and measures to promote the revitalization of rural family education. Family is the first school of life, parents are the children's first teachers, to give children a good \"life lesson\", to help buckle the first button of life. Family education is the starting point and foundation of the whole education, and plays an irreplaceable role in shaping children's behavior habits, cultural accomplishment, moral conduct and values. From the Compulsory Education Law in 1995 to the official implementation of the Family Education Promotion Law of the People's Republic of China in 2022, the state has promulgated dozens of laws and documents on family education, highlighting that family education, especially in rural areas, has increasingly become the focus and key point of attention of all parties. \"Family education integrates the functions of rearing, nurturing and guardianship, covering the cultivation of children's personality, the establishment of intimate relationships, the formation of a sense of security, the cultivation of living habits, the development of moral character and the cultivation of learning interests.\" [1]However, according to the author's in-depth investigation and exploration of rural family education in Henan, it is found that there are a series of problems such as the lack of rural family education subjects, outdated education concepts, lack of professional talents, weak guidance ability, and lack of support functions. Rural family education in Henan has become a relatively weak link in the family education system, which should arouse the great attention of the whole society. Therefore, the revitalization of rural family education in Henan province is imperative and imminent. Rural family education refers to the cultivation, guidance and influence of rural parents or other guardians on their children's moral character, physical fitness, life skills, cultural accomplishment, behavioral habits and other aspects, so as to ensure the healthy physical and mental development of children. The purpose is to carry forward the fine tradition of the Chinese nation attaching importance to family education, guide the whole society to pay attention to family, private education and family tradition, enhance family happiness and social harmony, realize rural revitalization, and train socialist builders and successors with all-round development of morality, intelligence, physical fitness, the United States and labor. 1.1. The revitalization of rural family education in Henan province is conducive to consolidating the main responsibility of rural family, innovating the concept of family education in the new era, and tapping the source power of rural family education Family as the child's birth and growth of the first environment, parents as the child's first teacher, and family education has the characteristics of continuity and long-term, so parents will also become the child's lifelong teachers, the child's future growth plays an incomparable role. The revitalization of family education in Henan village precisely locates the main responsibility of parents, clarifies the requirements of parents to cultivate children, and once again affirming the importance, necessity and uniqueness of parents in the growth process of children; At the same time, the revitalization of rural family education in Henan can innovate the traditional concept of rural family education, give the value connotation of the new era, develop educational methods and methods, enrich the educational knowledge theory and educational technology skills of rural family education subjects, and further explore and activate the source power of rural family education. 1.2. The revitalization of rural family education in Henan Province is conducive to improving the guidance and service system, improving the multi-party cooperative education mechanism, and integrating and consolidating the cohesion of rural family education The rural family education guidance service system is an indispensable and important part of the family education guidance service system, and is an unprecedented pioneering cause, which plays an important role in supporting, guaranteeing and promoting family education, family construction and rural revitalization. The revitalization of rural family education in Henan can improve the institutional framework and strengthen the public property of rural family education services; It can strengthen network construction and form a network service system covering rural family education; It can strengthen the construction of resources and realize the precise docking of rural family education services; It can tap local resources and form a family education culture with Chinese local characteristics; It can promote cooperative education and improve the mechanism of family and society education in rural schools; It can strengthen the construction of talents and improve the level and quality of rural family education services.",
    "1.3. The revitalization of rural family education in Henan is conducive to cultivating high-quality rural talents, building high-quality rural construction teams, and bursting out the strategic combat effectiveness of rural revitalization Rural family education can explore potential talent resources, and is an important cornerstone for cultivating high-quality rural talents and high-quality teams. The revitalization of rural family education in Henan can base on the cultural background of the growth of rural youth, strengthen rural family education, highlight the local characteristics and regional advantages of rural family education, establish the \"four self-confidence\" of the development of rural family education, and then build a small family and a big classroom, so that rural talents can rise from the true feelings and emotional expression to the feelings of home and rational understanding, so that burst out the energy to revitalize rural economy, and take practical actions to built the beautiful hometown. On the one hand, due to social and historical reasons, rural family education is broken in the inheritance of family education, and the traditional education content, education mode, education experience and family tradition cannot be continued in high quality. On this basis, the innovative cognition of family education is also difficult to form a mature historical context. On the other hand, due to the limitations of economic development level, cultural knowledge level, scientific and technological level, as well as the constraints of the family education promotion Law's publicity, popularization scope and promotion mode, most rural families do not have an accurate understanding, positioning and understanding of the concept of family education, let alone elevate it to the due height. They only rely too much on their own understanding of education and carry out guidance, and the whole process of rural family education is full of randomness, blindness and low efficiency. \"Most parents in rural schools don't realize that parents are the first teachers in a child's life. They ignore the important role of family education in children's growth and development, and don't know what role parents should play in children's lives.\" [2]Most rural families have weak economic foundation, low income, weak cultural knowledge, limited vision platform, and the focus of the family is more inclined to find ways to increase economic income and improve family living conditions; However, the attitude, cognition, understanding and sense of responsibility towards family education are in a preliminary and immature stage. For example, the current education types and methods of rural families such as separated generation education, single-parent education and laissez-faire education expose the weakening of the subject of rural family education and the loss of responsibility, resulting in a series of problems such as the lagging development of rural family education and the imperfect growth environment of children. \"The cultural level and comprehensive quality of most parents in rural poor families are not high, which has become a constraint on rural family education.\" [3]The main members of rural families have low cultural accomplishment, backward educational concept, and single educational skills and techniques. Most rural parents despise or understand the laws of education development and children's growth. Therefore, in the process of family education, they attach importance to the development of children's intellectual education and neglect their all-round development; Rural families often attach importance to children's school education and ignore the creation of family education atmosphere, and attach importance to children's material and physical needs and ignore their spiritual and psychological needs, and pay too much attention to one's own authority and ignore the individual development of children. 2.4. System dilemma: the rural family education guidance service system is lacking, and the educational power is scattered and disabled Family education guidance service system refers to a country or a region to carry out family education knowledge popularization, theory learning, method guidance and resource services as a whole system, is an important organization and implementation carrier of home-school collaborative education. At present, rural family education has a low starting point, great difficulty, weak development foundation and lack of service system, which are mainly reflected in the inclination of national policies and insufficient investment, insufficient social attention and diversification of forces, insufficient school guidance and support intensity, and low concentration and efficiency of families. As a result, the rural family education guidance service is not comprehensive, not in-depth, not sound, not efficient.",
    "The shortage of family education talents is a national common problem, but also a prominent problem in rural family education. \"The family education guidance service team still needs to be improved in terms of training mechanism, establishment standards and evaluation, and there are obvious shortcomings in team construction.\" [4]At present, the lack of service ability of rural family education talents in Henan is mainly reflected in three aspects: first, the number of professional talents is insufficient, and rural schools and rural communities are extremely short of family education guidance service talents; Second, the professional quality is not high, the quality and level of the existing family education guidance service talents in the educational concept, educational resources and educational methods can not meet the needs of modern family education; Third, the professional service ability is not strong, and the rural family education guidance service talents lack the necessary systematic education, learning and training, and lack of room for improvement and development. The promulgation of \"People's Republic of China (PRC) Family Education Promotion Law\" accurately locates the responsible subject of family education, scientifically stipulates the contents and methods of family education, working mechanism and state support measures, and refines the responsibilities of women's federations and other relevant departments, which provides a legal basis and fundamental follow-up for us to revitalize rural family education. First, we should inherit, carry forward and innovate the excellent traditional culture of family education, and set up the complete historical context of family education. According to the current situation in Henan and local conditions, the relevant departments have awakened the cognition of rural family education through various ways, strengthened the concept of rural family education, consolidated the consensus of rural family education, enriched and innovated the connotation of rural family education era, and set up a complete historical context of rural family education. Second, we should strive to build an all-round and multi-level publicity channel, increase the publicity of laws and regulations such as the Family Education Promotion Law, and actively guide rural families to establish scientific education concepts, rationally determine children's growth goals, effectively fulfill the main responsibilities of family education, and create a good family atmosphere. Third, it is necessary to guide and help rural family education subjects to establish the concept of lifelong learning, constantly enrich the new cognition of family education, constantly increase the new skills and skills of family education practice, and ensure that their own family education cognition and understanding do not lag behind, do not lag behind, and do not be inefficient. 3.2. Gather the team together, gather the consensus on the revitalization of rural family education, and crack the main body's dilemma First, governments all over Henan should take economic development as a focus, actively promote local employment, deepen precise poverty alleviation work, provide effective vocational assistance to poor families, provide life assistance and guidance services, promote rural revitalization, and strive to make rural family education subjects able to stay at home, willing to stay at home, and stay at home for a long time. Governments all over Henan should strive to help rural family education subjects correct the behavior of educational role anomies, promote rural family education subjects to truly shoulder and fulfill the responsibility for children's education, and form high-quality family education capabilities. Second, the main body of rural family education should deepen its connection with the local rural teachers, grasp the children's learning situation and psychological characteristics in time, and can also actively consult the teachers about education problems, and in the process of communicating with teachers, gradually improve their original concepts, form a new cognition of education, and maintain curiosity and patience for children's education. Improve the educational competence of rural family education subjects as a whole. Third, parents should coordinate the relationship between their children and their grandparents, weaken the contradictions in education, and gradually set up correct educational concepts for each other, avoid the abnormal development caused by spoiling children, and attach importance to the value of family education. First, the main body of rural family education should adhere to emancipate the mind, innovate with the time, pay attention to the study of pedagogy, psychology and other theoretical knowledge, actively participate in the whole process of children's life and growth, in-depth understanding of children's physiological and psychological characteristics, improve educational methods under the premise of following the law of children's growth, and realize the transformation from universal education to personalized education , so as to provide a loose space for the healthy development of personality growth. The second is to regularly organize expert teams to carry out research, with the construction of family tutoring and family style as the main content, to help build a new position of rural morality and cultivate people, constantly enrich the forms of rural family education, provide intellectual support and scientific guidance for rural family education, and constantly promote the implementation of rural family education. Third, it is necessary to build a horizontal linkage system through the integration of rural family education resources, the integration of school education throughout the process, and the open integration of social resources, and carry out targeted rural family education guidance according to the different gender characteristics, physiological characteristics and cultural characteristics of parents to improve the level and quality of education.",
    "overall design, municipal system promotion, school-level pilot breakthrough, rural family demonstration, individual subjective initiative \"six in one\" way to build a vertical through the system. Second, it is necessary to clarify the responsibilities of relevant departments, arrange special personnel to be responsible, and hold joint meetings regularly or irregularly to discuss the deployment of rural family education. Third, it is necessary to build a regional education base alliance, establish a leading group for the revitalization of rural family education, actively explore mechanisms and systems for women's federations, school education and other departments to jointly support rural family education, and delimit pilot areas. Fourth, it is necessary to create regional family education brand activities, according to regional advantages, local cultural characteristics and regional development needs to create special joint activities, select influential figures in rural family education, and build a rural family education teacher grade training and identification system. Fifth, it is necessary to establish and improve the system of regular visits by the relevant departments of the communities or towns where left-behind children are located, to help the relevant families to assume the responsibility of educating children, and to discuss the strategies and methods of educating children together. Sixth, public welfare family education service organizations can make good use of the existing family education tutor system in the country, and do a good job in the inspection, evaluation and information feedback of family education status of rural children. Seventh, we should strengthen the construction of first-line teachers in rural areas, regularly promote the interconnection and mutual assistance between rural and urban family education, improve the communication and exchange mechanism of family education in urban and rural communities, and constantly narrow the gap between urban and rural family education. Eighth, we should further give play to the role of the social support system, multi-department coordination to promote the family education guidance service system covering urban and rural areas, relying on rural parent schools and family education guidance service sites, to promote the improvement of rural family, school and community connection and cooperation mechanism, to form an effective model of family, school and society collaborative education. Ninth, we need to strengthen scientific and technological support and improve the quality and effectiveness of services. We will give full play to the advantages of new media and online education, encourage and support the exploration and application of emerging technologies such as artificial intelligence, big data and 5G technology in family education, build an information sharing service platform, set up non-profit online parent schools and online courses, and improve the scale, efficiency and accuracy of family education guidance services. Open online family education and parenting education section to provide parents with diversified and appropriate teaching content and learning support and services adapted to their personality characteristics; Public welfare family education and training institutions launch corresponding online courses or online interactions, and First, family education majors should be established in provincial normal colleges to train talents with bachelor's degree or above for family education guidance and service; Second, we should expand the scale of master's and doctor's degree training in family education in key national normal colleges, and appoint provincial and municipal educational science institutions to train high-level family education research and guidance talents; Third, the state, provinces, municipalities and autonomous regions should support the compilation of family education guidance service courses and textbooks, and provide systematic training and professional learning for family education staff of education, women's federations and other institutions; Fourth, we should pay attention to the improvement of the theoretical level, knowledge level and guidance ability of rural family education staff and guidance service personnel, deeply explore and sort out the excellent education culture and outstanding talents of rural families, and provide sustainable human resources support and guarantee for rural family guidance services. The research on the revitalization path of rural family education in Henan can carry forward the fine tradition of the Chinese nation attaching importance to family education, help more rural families establish correct family education awareness, learn correct education methods and skills, build correct parent-child relationship and family relationship, guide the whole society to pay attention to family, tutor and family style, and enhance family happiness and social harmony. Training more talents for rural areas, gathering greater and stronger forces for rural revitalization, can promote and realize the high-level construction and high-quality development of rural family education revitalization, and further guarantee the cultivation of socialist builders and successors with all-round development of morality, intelligence, physical fitness, the United States and labor."
]