[
    "Abstract: We should face up to the relationship between rural grass-roots ideological and political education and rural folk beliefs, explore ways of interaction and agreement between the two, actively guide folk beliefs to adapt to the socialist road, and correctly handle the relationship between \"dominant law\" and \"multiple voices\" This can not only further improve the effectiveness of ideological and political education in rural areas, but also provide an important reference basis for new rural construction and government grass- roots management, so that folk beliefs can better serve the socialist modernization. Taking the faith of Guandi in Xiali Township, Henan Province as an example, this paper uses the method of case study, combined with local archives, literature and history materials, field surveys, etc., through interviews, participation in observation, questionnaires and other ways and methods, to investigate the value of folk beliefs in rural ideological and political education. The work of rural ideological and political education is related to the long-term stability of rural areas. It has always been one of the concerns of Marxist political parties to carry out ideological education for farmers and attach importance to the research on \"three rural issues\". Farmers account for the majority of China's total population and are an important force in socialist modernization. In the process of implementing the current rural revitalization strategy, folk beliefs are related to the ideological tendency, value orientation and political direction of farmers, which can provide positive energy for the economic development of rural areas, such as alleviating the pressure of farmers' life, enriching rural entertainment, assisting moral education, driving local economic development and other positive roles, and may also weaken the construction of rural grass-roots organizations. This paper focuses on how to play a positive role of folk beliefs in rural ideological and political education. Folk belief is a cultural phenomenon in a specific historical period, and also a fresh history textbook. It still plays a unique cultural function in today's modernization. On the one hand, folk beliefs have a bearing on traditional culture, which is the soil for the survival of intangible cultural heritage; On the other hand, in rural areas where cultural and entertainment life is relatively poor, colorful folk belief activities undoubtedly provide opportunities for farmers to relax after hard work and enrich the cultural and entertainment life in rural areas. It \"caters to and satisfies the spiritual and psychological needs of some people in society, and alleviates their burden and pressure\". [1] Folk beliefs have cultural attributes and are intertwined with Chinese traditional culture. Viewed and understood from the perspective of cultural history, folk belief is a profound traditional culture with its unique content and development process. With the development of religion, folk beliefs have been evolving and developing, adding religious elements and mysterious colors, while ingeniously combining local colors, including folk customs, folk taboos, local culture, etc., which can be worshipped by people and used as a topic after dinner. Cultural entertainment is an important feature of folk beliefs. \"At first, programs such as acting and spiritual wandering were the content and means of worship, and later evolved into general mass entertainment\" [2]. Especially in rural areas, acting is the most popular program. Many temples have a large space, which is used for believers' activities at ordinary times and for large-scale activities at festivals. For example, in the design of architectural structure, most of the temples are built with a pavilion stage, which also reflects the cultural characteristics of the temple beyond its sacredness. The recreational activities of the temple fair provide farmers with a chance to get away from farm work for a short time, and also reduce some constraints. Whether the temple fair is large or small, it is essential to set up a stage to sing opera. Drama performance is not only a way for people to pay homage to gods, but also a form of entertainment for people to entertain themselves. In addition to traditional opera performances, there are also a wide range of puppet shows, shadow plays, western scenes, as well as some acrobatics and fancy boxing and leg embroidery performed to sell \"panacea\" and \"ancestral secret recipe\". Full time storytellers, fortune tellers and quacks also occupy a place, bringing laughter to people. \"On such an occasion of religious activities, people can not only enjoy the present happiness, but also try to predict the future\" [3], so that people can experience unprecedented relaxation. In this grand gathering of thousands of people, it provides a way to bring individuals out of the family centered daily communication circle, expand the communication platform, and let individuals feel the pleasure of In China, most traditional festivals originate from folk beliefs, such as the Mid Yuan Festival, the Dragon Boat Festival, and the Mid-Autumn Festival. Most of these traditional festivals are related to sacrificial activities, and sacrifice is an important part of folk beliefs. \"People's cognition and awareness are all derived from the experience of the perceptual world, which determines that we must make corresponding arrangements for the surrounding world, ensure that the natural needs of human beings can be met, and help individuals better understand the true meaning of human beings as human beings\" [4]. The \"experience of the perceptual world\" contained in folk beliefs is an indispensable knowledge in the process of human understanding their own history. Folk beliefs contain a large number of stories, myths, legends, music, operas, arts, sculptures, etc. In the years when literacy was not popular, they have been passed down through oral transmission, singing from generation to generation, carving skills, etc., and become part of local culture and even beliefs. The cultural heritage of folk beliefs is also reflected in its strong permeability and inclusiveness. It is not as exclusive as western religions. As Voltaire, a French writer, described in his On Custom, \"none of the people who were burned alive by Mary was guilty of treason, and all of them were purely due to religious beliefs\". [5] Taking the inheritance and prosperity of the Guandi culture in Xiali Township as an example, the local Guandi culture provides an opportunity for folk performance, while the Guandi Temple Square provides entertainment venues for people. Every year on the sixth day of the first lunar month, the Lantern Festival, March 18, May 13, and the Mid Autumn Festival, there will be dragon and lion dances and Yangge performances. Especially during the temple fair, in addition to singing votive plays, there are also performances to reward gods. In the temple fair, people also got happiness.",
    "Streets and alleys are decorated with lanterns and colored flags, which are filled with a happy and peaceful atmosphere. These cultural activities are often self financing, and each person donates a few yuan to achieve a good entertainment effect, which undoubtedly plays a positive role in building a harmonious society. At present, Xiali Township has built 8 village level cultural compounds, 2 bronze ware teams, 16 waist drum teams and 5 small performance groups relying on Guandi culture. These healthy and positive cultural and entertainment lives have kept the masses away from casinos and feudal superstitions, cultivated their sentiments and improved the quality of the population. In addition, these recreational activities also play a certain role in easing the life pressure of farmers. Kant, a German philosopher, based his conception of critical philosophy on three issues: what can I know at the metaphysical level, what should I do in the moral category, and what expectations should I hold in the religious scope. He classified these issues as anthropology. In the development of human civilization history, the relationship between religion and morality is very close. Any so- called \"belief\" can only be accepted by the public under the banner of \"kindness\" and \"harmony\" in terms of argument. The continuous folk beliefs contain rich moral preaching, which is indeed a resource that can be developed. As Mr. Fei Xiaotong said, this situation is particularly prominent in rural areas. \"The maintenance of local social order is different from the maintenance of modern social order in many aspects\" [6]. The moral constraints of folk beliefs play an irreplaceable role in the affairs of rural areas. It seems that there is no explicit doctrine or doctrine in folk belief, but the contents emphasized in its spreading process, such as reducing disputes, getting along in harmony, and persuading people to be good, are gradually integrated into people's subconsciousness through simple fairy tales, folk legends and some practical cases, and become people's collective subconsciousness. In folk beliefs, keeping promises is very important. Xia Li Xiang's worship of Guandi can explain the universality of this kind of promise values among the people. As we all know, Guan Yu is the representative of \"faithfulness\" and \"commitment\" in the cultural symbols of the Chinese nation. This is also the embodiment of what German philosophers call \"moral laws\". The spirit of compromise in the operation of other human societies based on this virtue can often be embodied in this form of folk belief. The author once heard such a case in Xiali Township, \"The Li family and the Wang family, the friendly local villagers, were prepared to go to court because of the homestead dispute. However, in view of the high legal costs, they were persuaded to go to the Guandi Temple to let the Guandi judge the case. The monks in the temple used the name of the Guandi to ask them to 'fight for less than one foot and give more than one inch to each other. Instead of fighting, let each other give up and rebuild the relationship'. After the Li family and the Wang family gladly accepted the one foot homestead, the two families made up again.\". It is inconceivable that this kind of \"asking ghosts and gods\" ruling behavior occurs in modern society. It highlights the imperfection of China's legal system construction and cannot take into account the acceptance of judicial procedures of different classes. On the other hand, it highlights the prestige of folk beliefs in the hearts of people in regions with relatively low education levels. In fact, in the deep subconscious, what Li and Wang trusted was the principle of \"compromise\" in the social operation. However, this principle in their mind is manipulated and represented by Guan Yu, who is more humane, rather than seemingly cold legal provisions. Here, Guan Yu is also a symbol of \"law\", but more inclined to the \"moral\" level of law. We have reason to believe that if the Li and Wang families go through legal proceedings, they will finally comply with the court's decision. However, the judgment of the court has a mandatory effect, while the moral law is more flexible and depends on the consciousness of the parties. The case of Xia Li Xiang fully proves the influence of idolized moral laws in rural areas, and it is also a living fossil like expression of a common psychology and practical behavior in early human society. In the current situation of population quality and social composition in China, if we can correctly play these positive factors of primitive worship, we can play a complementary role in reducing social contradictions in rural areas.",
    "Folk beliefs have economic functions, which means that folk beliefs directly or indirectly participate in economic construction, promote external relations, and drive rural economic development. Under the condition of market economy, folk belief is not an independent social group, and its survival and development cannot be separated from economic support. Although the folk belief pursues the spiritual world, it cannot survive if it is completely divorced from the socio- economic system and has no economic strength. In essence, folk belief is an economic organization, which complements and promotes the economy. In rural areas, the gods of industry, agriculture or nature play an important role in the folk belief system. In the traditional society, due to the lack of modern science and technology, farmers, faced with various uncertain natural factors, whether they can have a good harvest depends entirely on the will of God, so they place their hopes on \"God\" and pray for the blessing of all gods. \"The ever- changing nature and the inspiration of animism of all things, along with the problems of life, old age, sickness and death, have all inspired the generation of religious ideas\" [7]. Take Xiali Township as an example. Up to now, the local Guandi Temple is still a landscape, with less mysterious atmosphere, and more of it has become a good place for tourists from other places. Nowadays, the rise of farmhouse music has attracted countless urban people to come for leisure, and the Earth Temple has also become a scenic spot. The old people in the village took the trouble to tell all kinds of myths, legends and supernatural stories to the tourists from other places. The tourists listened with interest and took pictures from time to time. There are rich and colorful stories in folk beliefs, which can stimulate people's interest and curiosity in tourism. \"Folk legends, myths, folk customs, etc. throughout the country greatly enrich the internal cultural connotation of folk belief landscape, improve the popularity of the scenic spot, and enhance the attraction of the landscape to tourists\". As a soft power, culture plays a more and more important role in economic development. Culture provides intellectual support for economic development, and economy provides financial guarantee for cultural development. Economic and cultural integration plays an irreplaceable role in attracting investment from local governments, especially the distinctive local traditional culture. \"A certain style of regional culture can strongly promote the development of regional economy. The popular\" culture building, economic singing \"is to fully integrate and utilize various local cultural resources to attract investment\". The Guandi culture of Xiali Township has played a driving role in attracting investment from local governments, attracting private investment. During the \"Jiulong Ancient Temple Material Exchange Conference\" on May 13, 2019, more than 40 merchants came to Xiali Township, 17 of whom were willing to develop here, and finally 12 small private enterprises signed contracts with Xiali Township. It is estimated that the production and processing of fragrant watches, paper, clothes and hats, furniture and investment in accommodation and catering will increase the local employment population by about 500 people after all of them are put into production, and the annual net output value will be about 5 million yuan. The successful holding of the Kowloon Ancient Temple Material Exchange Conference has brought rich income to merchants. In the interview, the boss who runs a grocery store in Xiali Street said, \"The turnover of these three days is more than the total turnover of two months.\" The old woman who placed a stall beside the street also said happily, \"It's too late to sew nine pairs of cloth shoes every day.\". Most of the vendors who come here to set up stalls are farmers from nearby villages. They sell their own vegetables and grains during the busy farming season. There are also small vendors who do business all the year round. They make a difference at the fair. Although the profit is small, it can increase income and improve life. According to statistics, during the temple fair every year, more than 10000 tourists are attracted in three days, and the total transaction amount is about 400000 yuan. With the development of society, the status and influence of cultural influence in economic development has attracted more and more attention. Cultural soft power has become an indispensable force in economic growth. Economic and cultural integration has gradually emerged and flourished. From a certain point of view, the economy relies on culture to obtain the motive force and intellectual support for progress. Economic entities that do not involve cultural elements develop slowly or are gradually forgotten; Economies with regional cultural color continue to grow. Today's economic development model of \"culture as a platform and economy as a performer\" fully integrates and utilizes local distinctive cultural resources to promote external contacts, attract investment and drive local development. The economic development of rural areas requires not only advanced productive forces, but also cultural soft power. \"Whether it is human society or ethnic groups in various regions, their natural development process is subject to the relationship between people and all aspects of society; the superstructure with certain social value also includes what happens with social development\".",
    "The report of the 20th National Congress of the Communist Party of China pointed out that the country is the people, and the people are the country. As the Communist Party of China has led the people in fighting to establish and develop the People's Republic, it has really been fighting for their support. In rural work, we should go deep into the masses and the grassroots, understand the thoughts of the masses of farmers, and safeguard and develop the actual interests of farmers, in order to be a good leader of farmers, grasp the ideological tendency and spiritual pursuit of farmers from the perspective of ideology and value guidance, and educate and guide the masses in a way that is easy to understand and popular. Folk belief is a double-edged sword, which has a dual impact on rural ideological and political education. On the one hand, folk beliefs have a broad mass base and are the focus of ideological and political education. On the other hand, the religious color of folk beliefs is bound to affect Marxist beliefs and weaken the effectiveness of the Party's ideological and political education. Therefore, a correct understanding of the relationship between folk beliefs and ideological and political education at the grass-roots level is the premise and foundation for the Party to cultivate socialist core values in rural areas in the new era. In the process of implementing the current rural revitalization strategy, as a rural ideological and political educator, we need to fully understand the importance and contemporary value of folk beliefs in our daily work, give full play to the positive energy of folk beliefs, and make them a positive factor in rural economic development."
]