[
    "Abstract: Henan Province has a large population in China. According to international standards, the province has already entered an aging society and is close to entering a deep aging society. It is expected that the total elderly population in the province will continue to increase rapidly in the next few decades. Starting from the current population situation and urban-rural distribution of Henan Province, this paper analyzes the current situation of the elderly population in Henan Province from the aspects of the national ranking of the elderly population, the age composition of the resident population, the scale of the elderly population and the gender structure of the elderly population, studies the impact of population aging in Henan Province from three aspects: three industries, social pension security and labor supply, and puts forward that Henan Province should seize the future demographic dividend period to accelerate economic development Further improve the old-age security system and develop the human resources of the young elderly, so as to deal with the impact of population aging on economic development in Henan Province and promote the coordinated development of economy and population aging in Henan Province. The aging problem of population has gradually emerged in China with the rapid development of economy in China, the increase of people’s income, the continuous improvement of medical treatment level and the attention of people to health care!!!, As the agricultural province with the largest population in China, the social problem of population aging in Henan is also becoming increasingly serious, which brings considerable burden to the economic development of Henan Province. This paper studies the impact of population aging on the economic development of Henan Province and puts forward corresponding countermeasures”), In 2000, the number of elderly people over 65 years old reached 84.68 million in China, which accounted for 6.69% of total population all over the country. In 2010, there were 118.83 million elderly people over 65 years old in China in accordance with the results of data from the Sixth National Population Survey, which accounted for 8.87% of total population in our country. In the past decade, there has been an increase of two percentage points. According to the latest results of National Population Census in 2020, the number of the elderly over 65 years old in China reached 190.59 million, which accounted for 13.5% of national population at present. In recent ten years, there has been an increase of five percentage points. Internationally, the measurement standard of population aging is generally that the elderly over 60 years old accounts for more than 10% of total population, or the elderly over 65 years old accounts for more than 7% of total population. There is a deeply aging society if reaching 14%, and there is a super aging society if reaching 20%\"). In conformity to this international standard, China has already entered an aging society\"). As the agricultural province with the largest population in China, the social problem of population aging is becoming increasingly serious in Henan. In accordance with the statistics and data of the Seventh National Population Census, the total population of Henan was about 115.26 million in 2020, among which the elderly aged 65 and above was about 15.67 million, which accounted for 13.6% of the total population of Henan. In the light of standard, Henan has also started to enter the society of population aging. On the basis of the estimation of data in the Seventh National Population Census, the number of elderly people would also increase explosively in Henan. Compared with the developed coastal provinces, Henan Province has a low level of economic and social development, a large population base of the elderly in urban and rural areas and an imperfect mechanism of basic old-age security in the society. At the same time, there also is the characteristic that the degree of population aging in rural areas is significantly higher than that of urban areas. As a consequence, the process of unique social aging with high speed in Henan Province will have a significant impact on the basic old-age security of people, the supply and demand of labor and the structural regulation and control of industry and other aspects in Henan Province. Because population aging is not only a basic problem of a country, but also related to the development of economic globalization. Consequently, it can provide objective and real basis for government to formulate macroeconomic policies, consumption policies and measures, as well as planning the policies of endowment insurance system through making a profound study of society problem of aging and its significant impact on the healthy development of economy and society. Only by taking full into account the basic reality of the serious aging problem of population in Henan, fully considering all kinds of factors that affect the healthy development of economy and society and coordinating various social relations can the economy and society of Henan develop steadily and continuously. Meanwhile, it is of great historical significance to realize all-round well-off society in order to construct harmonious Henan.",
    "Henan Province has a total land area of 167,000 square kilometers, which ranks 17th among all provinces and cities in China and accounts for 1.73% of total area in the whole country'*-4, The number for the total population of Henan Province has risen from 99.67 million in 2009 to 11.526 million in the Seventh Census in 2020 (there has been an increase of about 7.26 million for decades, which was an increase of 6.3% compared with the conclusion of Sixth National Census), which ranked the top in China and became “large” province with population. Among them, the number of urban population has always been in the trend of continuous growth, and people increased from 35.77 million to 55.1 million from 2009 to 2020. However, the number of rural population increased first and then decreased. People increased from 63.9 million to 71.49 million and then decreased to 60.16 million in the same period. With the diversion of rural population to urban areas, the level of urbanization construction in Henan Province also increased rapidly (see Table 1 and Figure 1). From 2009 to 2020, the urbanization rate increased from 37.7% to 55.4% in Henan Province. With the increase of resident population, the transformation of population distribution in urban and rural areas and the development of economy in Henan Province, the aging problem has emerged. From the perspective of the whole country, the aging of total population is relatively serious in Henan Province. According to the national census data in 2020, the population aged 65 and above is about 13.4019 million in Henan Province, which accounts for 7.0% of the elderly throughout the country. Compared with other provinces, municipalities and autonomous regions in the country, Henan ranks fourth in terms of the number of people aged 65 and above, which is second only to Shandong, Sichuan and Jiangsu Province (see Table 2). In 2020, the population aged 0 to 14 accounted for 23.14% of the total resident population, and the population aged 15 to 64 accounted for 62.92% of the total resident population. The remaining 13.94% was the aging population over 65 years old (see Table 3), which was 6.6 percentage points higher than the international standard of aging society (7%) and was close to 14% (international standard for deep aging societies) among the permanent resident population of Henan Province. This indicates that this province has already entered the aging society and has been close to entering the deep aging society. It is expected that the total aging population will continue to increase rapidly in Henan Province for decades. With the development of national economy in China, the living standard of people is getting higher and higher, and the condition of medical security is getting better and better. The life span of people has also been extended. Henan Province is no exception. Henan has a large population base. Thus, the number of aging population rose sharply in Henan Province. On the basis of relevant statistics, the elderly in Henan Province has increased to 13.4019 million in 2020 (see Table 2), which accounted for 13.94% of total resident population (99.36 million) (see Table 3). Compared with 2010 (the elderly was about 7.86 million, see Table 5), the elderly aged 65 and above has increased by about 5.55 million in ten years. The total number of the elderly is huge. It can be seen from Table 4 and Table 5 that the population aged 65 and above in the province is on the increase as a whole. The population aged 65 and above increased from 7.48% and 6.44% in 2000 to 10.60% and 8.34% in rural and urban areas in 2020 respectively. Nevertheless, the aging degree of rural areas in Henan Province is significantly higher than that of urban areas. During the two decades from 2000 to 2020, the elderly aged 65 and above increased by 3.12% in rural areas, while the population only increased by 1.90% in urban areas. The reason for the difference in the degree of aging between urban and rural areas in Henan Province is that the level of economic development in urban areas is far higher than that of rural areas. What’s more, a large number of rural young and middle-aged surplus labor have been absorbed to work in urban areas. In addition to children, a large number of the elderly are left in rural areas!”!, Based on table 6, the economic development level of Zhengzhou City in Henan Province is relatively high (GDP was 1.2 trillion yuan in 2020, and the real GDP was 96,100 yuan per capita). The proportion of population aged 15 to 64 was about 72% in the total population, which ranked the first in the province. Notwithstanding, the proportion of population aged 65 and above was only 9%, and the level of aging was the lowest in the province. In places with a relatively low level of economic development, such as Luohe City (GDP was 157.39 billion yuan in 2020, and the real GDP was 66,200 yuan per capita), the degree of aging was the highest in the province.",
    "Source of data: Data of the Seventh National Population Census of Henan Province The proportion of people aged 65 and above was as high as 16%. According to the international standard (14%), this was the deep aging, which is only 4 percentage points away from the international standard of super aging (20%); The degree of aging in Zhumadian City is second only to that of Luohe City (GDP was 308.28 billion yuan in 2020, and its real GDP was 40,700 yuan per capita). The number of people aged 65 and above accounted for 15.7% (ranking the second in the province). Compared with city with the lowest number of working age workers in the province, the number of people aged 15 to 64 accounted for 59.2% of population in the whole city, which was less than 60%. In accordance with the criteria of WHO for the age classification of the elderly, people under 64 years old cannot be called the elderly!*!. The younger elderly refer those aged 65 to 69, and the middle indicate those aged between 70 and 79. The oldest old refers to the elderly aged over 80 years old. In 2020, the average life expectancy has exceeded 77.6 years in Henan provincel”!, In large and medium- sized cities with better nutrition and medical care, life expectancy is higher. According to the data of the Seventh National Population Census, there was about 2.48 million elderly people over 80 years old in Henan in 2020, and there was 5.76 million people between 70 and 79 years old, which increased 1.09 million and 2.09 million respectively in contrast with 2010; In the same period, the number of the elderly aged 65 to 69 increased by about 2.46 million (see Table 7), and the proportion of middle- aged and elderly people also increased gradually especially those aged 70 to 79. In recent years, the average life expectancy of women has risen significantly more than that of men in China, which is the main factor in the gradual feminization of the elderly. In 2020, the life expectancy of men was 74.6 years old, and that of women was 80.8 years old. There was an increase of 2.8 years for men and 3.2 years for women over the past decade compared to 2010, which greatly exceeded the growth capacity of men. According to the results of survey in 2020, there were 439 centenarians in Zhengzhou City. Among of them, there were 357 females and 82 males. There were 297 centenarians in Luoyang City, among of them, there were 265 females and 32 males. The ratio of men to women was equal to | to 8.7. This was because women live longer than men due to biological differences. Population aging has changed the age structure of population in China, which resulted in the decrease in the proportion of total working age population in the total population!'®!, This change would affect the development direction of industry and was not conducive to the coordinated development of three industries. How to adjust the development direction of three industries to coordinate with the development of population aging was an important topic for industrial structure With the rapid development of market economy, industrialization and urban economy in China, a large number of young and middle-aged rural labor force in Henan Province left their hometown to move to areas with higher level of economic development, which resulted in a large reduction of existing agricultural labor population in the rural areas of province, and the labor force left behind in their hometown was mainly the labor force of the elderly. Originally, the educational level of rural workers was lower, and that of labor force for the elderly was lower. The results of comprehensive effect for the two factors of the outflow of young and middle-aged rural labor force and the low cultural level of the elderly labor force have seriously restricted the progress of agricultural science and technology, agricultural mechanization and modernization in Henan Province. Parallel with the developed provinces, such as Jiangsu and Zhejiang, etc., the agricultural labor productivity is generally low in Henan Province (see Table 8). As far as the secondary industry in Henan Province is concerned, the total profit of mining industry is 172.407 billion yuan, which ranks first in the industry. However, the number of labor absorption is limited with only 275,400 people!!?\"3!_ The manufacturing industry is far higher than other industries in terms of main business income, total profits and taxes and the number of labors absorption. However, most of manufacturing industry belongs to labor-intensive industries in Henan Province with low technology content and low profits. In order to reduce costs, it is forced to recruit the elderly to work because the wage level is low and it is not attractive to young labor force. It can be seen from this that the population aging in Henan Province has not had a great impact on the supply of labor force in the manufacturing industry of Henan Province. The major impact is the low cultural quality of the elderly, which affects the efficiency of manufacturing industry.",
    "The elderly are a kind of special social group. Due to the increasing number of such groups, the demand for medical, entertainment, labor services and other tertiary industries is increasing day by day, which objectively requires and promotes the development of the tertiary industry in the province. At present, the development level of the tertiary industry is still relatively low in Henan Province. The regional development is not balanced, and the difference between urban and rural areas is also very big. As a result, although the tertiary industry has made great progress in Henan Province in recent years, there is still huge space for development. To sum up, although the population aging has brought about considerable impact on the economic development of Henan Province, it has also brought about development opportunities, especially having a huge positive impact on the development of the tertiary industry. Accordingly, it is necessary to vigorously develop the service industry of the elderly, to promote the development of the tertiary industry and to realize the optimization of industrial structure in the province with the increase of aging population and the improvement of the consumption demand of the elderly in Henan Province, which is of great significance to achieve the development direction of three industries and coordinate with the development of aging of population. The rapid development of aging will lead to a rapid increase in the number of retirees in the province, and the continuous increase in the number of retirees will rapidly expand the proportion of expenditure of social insurance, social welfare, social assistance, social security business, etc. in the provincial financial expenditure. At the same time, the proportion of pension expenses and social security payment costs will also increase rapidly due to the existence of the dual system of social pension. Since the accumulation nature of social pension insurance fund belongs to the field of redistribution, the expansion of the expenditure share of this kind of fund is bound to directly endanger the investment share of social deposits and investment funds in Henan Province for a long term, which will further harm the national economic growth in the province. Nevertheless, the accumulation of social pension insurance fund is essentially derived from socialist business activities, so the negative impact of aging development on the national economy must be reflected in social pension insurance funds. The increase of aging will lead to the shortage of medical and health resources and the increase of medical prices. Because most of the elderly suffer from chronic diseases, which have a long cycle, poor cure rate and high cost. The medical consumption expenditure of the elderly is often higher than that of other groups. Taking senile cataract as an example, the medical expenses per capita of senile cataract inpatients in Chinese hospitals (among them, the proportion of senile cataract discharged patients aged 60 and above accounted for 89.6%) reached 7092.7 yuan in 2019 according to health statistics in China (see Table 9). The situation in Henan Province is not as optimistic as this situation. The implications of labor supply usually include the following three dimensions: from a macro perspective, labor supply refers to people aged 16 or above in the labor market who are working and constantly seeking new job opportunities; fom the meso perspective, labor supply is the number of workers absorbed by a company at certain wage level. From the micro perspective, labor supply refers to the total amount of labor that individual workers are willing to perform according to certain wage level. For a long time, the province has been faced with the problem of low labor productivity, and the underlying reason is the problem of labor supply and labor quality. With the increase of population aging, this problem will be gradually aggravated. Generally speaking, the physiological function of people gradually aging after 50 years old. With the growth of age, their physical fitness and mental activities gradually decline, and social reaction ability and learning level (especially intelligence) gradually decrease. Under the background of the rapid development of modern science and technology, the ability of mastering, contacting and understanding new things for older workers will be far lower than that of young workers. Although older workers also have a lot of work experience, the value of production technology far exceeds that of work experience. Accordingly, aging of population still has a mostly negative impact on the improvement of labor supply and labor productivity in the long run!!*°), On the basis of the actual situation in Henan Province, this paper puts forward the following countermeasures and suggestions in order to cope with the impact of population aging on economic development and promote coordinated development for economy and population aging in Henan Province: In the next ten years, our province will be in the period of demographic dividend. In this period, our province should seize the rare development opportunity of “demographic dividend”, grasp the potential opportunity of promoting economic growth and actively promote the economic and social development of our province. Vigorously developing productive forces is the fundamental measure to deal with the problem of population aging.",
    "First of all, we can attract more high-quality private enterprises to invest and develop in Henan Province, which creates more employment opportunities for the whole people of the province. To this end, the government should give policy support and actively absorb more high-quality private enterprises to settle in Henan so as to further strengthen the strength of undertaking industrial transfer in Henan Province on the basis of the development strategy of region. In commerce, financial services, insurance, high and new technology and other applications fields, the intensity of investment needs to be further strengthened. It is essential to actively develop the tertiary industry, promote the upgrading of industrial structure to coordinate it with the development of population aging. demographic dividend is weakened because most of agricultural workers have a low level of education. Based on the statistics data of Seventh National Population Census, the number of illiterate people aged 15 and above is 2.23 million in this province. Although the illiteracy rate has been greatly reduced, it still exceeds the domestic average level compared with Sixth National Population Census. Accordingly, it is necessary to further improve the cultural quality of agricultural labor force, increase the cultural education and training of agricultural labor force so as to enhance the advantages of agricultural human resources in the province and promote the development of primary industry for weakening the adverse impact of aging of population on the primary industry. Whether the endowment security system is sound or not is related to whether the elderly can spend their twilight years, is concerned about residents’ consumption, education, work, etc. and then affects the economic development of the whole society. In the light of the characteristics of Henan Province, it is necessary to establish sound endowment security system from urban and rural areas. First of all, it is necessary to promote the process of pension integration and abolish the dual system of pension system in rural areas. The dual track system of pension has caused great pressure on the financial revenue and expenditure of Henan Province. Furthermore, there is a big gap between the two groups of retirees in terms of rights and treatment and other aspects between the two groups of retirees from state-owned enterprises as well as the financial management of institutions and retired personnel, which has caused fabulous social inequality. Next, enterprises should cut down the payment standard for retirees, stimulate the initiative of payers, broaden the field of collecting, enhance fund investment and provide adequate pensions to ensure the stable treatment of retirees in enterprise, which accelerated the business progress of socialized management of retirees and effectively safeguarded the basic rights and interests of retirees. Eventually, it is necessary to vigorously develop the endowment service industry in the society and family. For example, neighborhood committees from all communities should pay a visit to the middle-aged and elderly without their children on a regular basis, promote the efficient integration between the endowment service of social and the endowment service of family, increase investment in the living service facilities of pension, construct more “healthy family apartments” that can be undertaken by more elderly people and further complete the endowment service system of community so as to realize perfect integration in the endowment service of social and the endowment service of family. To begin with, we should explore local talents in accordance with our own conditions, vigorously develop rural economy, improve income and absorb the return of migrant workers. Moreover, the development and expansion of rural economy can create some jobs within ability for the elderly in the locality and improve their income. This can lay economic foundation for the life of villagers in their old ages. Secondly, local government departments should also perform more responsibilities in the old-age security system in rural areas, introduce preferential policies of security for the elderly in the rural areas, further expand the coverage of basic living allowances and provide living assistance to the elderly from some poor families so as to ensure that the relevant funds and materials are paid on time. It is forbidden to defraud, false claims and other phenomena that do not meet the basic conditions, so that welfare policies of these elderly can effectively benefit people.",
    "Foremost, we should increase the training and education of young elderly, establish the system of lifelong education, and promote the knowledge innovation of young and old talents. The rational development and application of young and old talents not only enable these elderly people to do their own jobs, but also promote the healthy development of labor market. Furthermore, it can also reasonably reduce the pressure to support on communities and families. Secondly, the retirement age of special personnel should be extended. The retirement of special personnel engaged in professional and technical work, such as teaching and doctors, etc., can be postponed appropriately. Special personnel with high education must have higher education for corresponding years, so they tend to be older when they are engaged in post. Nevertheless, the age of average retirement for social workers is about 56.1 years old here and now. As a result, the working time of special personnel is relatively short, which leads to the waste of personnel to a certain extent. In the end, it is essential to improve the human resource management of the elderly and build and construct and strengthen the talent database of young elderly. At the moment, abundant theoretical knowledge and experience have been formed in the management of young, middle-aged and old labor force in our province and the whole country. In contrast to western developed countries, the work of human resource management for the elderly in China is not only lack of guarantee from the relevant system of government. But is also short of systematic human resource information network to provide employment information for them. To this end, government departments at all levels should issue relevant management laws and regulations and build an information resource database for the elderly to provide information platform for the market-oriented management of young elderly talents."
]