[
    "Abstract: Changes in operation performance demand a review of methods for the provenance of integrated factors. Irrespective of valuable opportunity given by the retailing industry to benefit local economies and communities, there are still however, management impacts that beseech managerial heed. In one of the greatest markets in China, the retailing industry need to be probed for any factors that may affect operation performance. Therefore, it is necessary to study the linear relationship between the managerial factors and the operation performance of the organization in the retailing industry. Based on the literature referred in the paper, the author tests the correlation within the independent variables of management competence, quality of financial, design of business process, quality of internal control, and employees’ competency as independent variables, and examined the linear relationship with the operation performance. Working as an important part of the domestic circulation, the retailing industry, has attracted much attention for its industrial structure and performance. In the developing countries with large population, consumption can be a strong driving force of GDP. In the current case of this paper, the author has taken Henan Province as an example, to test effects of management competence on operations performance, by using quality of financial data, design of business process as moderators and quality of internal control and employees’ competency as mediators. Management competence has a significant positive effect on operations performance, and in the articles of managerial competencies and their influence on managerial performance , it can be found that management competence can enhance the financial performance by the effort of managers devote. The effect can be aggregated in some mature companies. For SMEs, according to the findings of Pati (2021), management competence is positively related to the overall corporate performance. Managers need to enhance their degree of awareness of the external risks and opportunities. Moreover, in the retailing industry, as suggested by Shet (2021), managerial competence significantly associated with a high level of performance (as measured by improvement in profits, rates of return on invested capital and rates of return on total funds employed; and on the absolute rate of return on invested capital) .It can be suggested that in most industries(which also include the retailing) industry, management competence is a key variable which determine the performance of the organizations. Quality of financial disclosure can increase the effect of managerial competence on the operational performance, and according to the findings of Tejedo (2022), the composition and relevant competence of the managers can affect positively to the disclosure mechanism. As to the findings of Safran(1998), data with high quality can guarantee the success of the operation and provide objective basis for decision making. Quality of design of the business can enhance the effect of managerial competence on operation performance. According to Harika (2021), a sound set of business process can guarantee a sustainable development of operational performance. Moreover, the effectiveness of managerial actions on its operation performance can be affected by the internal control system and the competence of employees who carry out the orders sent by the management. In the first place, as to the findings of the Dean and Clarke (2003), the internal control system can greatly affect the operation performance and can prevent the manipulation of the management. In the second place, a well-designed training program made by the company’s management, can be deemed as a vital to sustained competitive advantage, by referring to the study of Birdi (2008). In summary, the classic theories can be the bases or theoretical framework for this paper. These relevant theories have suggested that there may be linear regression relationship between management competence and operation performance. Moreover, the quality of financial data, design of business process, internal control system and employees’ competency can also affect the operation performance. However, there is little relevant literature to refer to see if there is any linear regression model do exist within variables mentioned above, in the retailing industry of Henan Province, even if this population of the province is huge and the market scale is tremendous. Thus, this paper will continue to conduct statistical research to find out the linear relationships among those variables above. H1: Management competence has a significant positive effect on operation performance. H2: Quality of financial data can enhance the effect of management competence on operation performance.",
    "By using the 7 point’s Likert Scale, and 208 questionnaires were sent to the retailing companies in retailing industry of Henan Province. The relevant reliability test is carried out as below table 1. The Cronbach alpha is used to test the reliability of the questionnaire in this study, which is widely used in empirical data analysis. When the Cronbach alpha value of the scale designed in the questionnaire is even lower than 0.7, it indicates poor internal consistency of the variables in the scale, and the scale needs to be rewritten; When the Cronbach alpha value of the equivalent scale is higher than 0.7, it can indicate that the internal consistency of the multiple variables constructed for the scale According to the Cronbach Alpha results for each dimension in the table above, the Cronbach Alpha values corresponding to the six dimensions designed in this article are 0.969, 0.952, 0.970, 0.955, 0.956, and 0.927, and all of them are greater than 0.7, which indicating there is good internal consistency among the dimensions of the questionnaire. Therefore, the reliability of the results of this survey is good. From the above table 2, the KMO value in this study is 0.939, which is greater than 0.7. Therefore, the questionnaire data in this study meets the conditions for factor analysis. Moreover, by using principal component analysis, factors with eigenvalues greater than 1 were extracted from the scale. Based on the explanatory total variance results of each dimension of the questionnaire, there are 6 factors with eigenvalues greater than 1, and the total variance explanatory rate of the 6 factors is 83.088%, which is greater than 60%. Therefore, it can be considered that the scale designed in this article has a relatively good explanatory competence. From the statistical results of the mean descriptions of each variable(table 3), the mean of each variable ranges from 4.66 to 5.27, indicating that the perceived recognition level of the respondents towards the variables studied in this article is above average. than 3, indicating that each variable meets the conditions. The data from the survey questionnaire can be directly used for subsequent statistical analysis. The results of Pearson correlation analysis (table 4) showed a significant positive correlation between all the relevant independent variables and dependent variables of operation performance. Thus, further analysis can be conducted to verify the hypothesis of this article. In the tests of direct regression test and mediating test, the relevant ratios can be listed as follows table 5. By using hierarchical regression to test direct regression and the mediating effect, the significance of the regression coefficient between the independent variable and the dependent variable is first tested. Secondly, the significance of the regression coefficient between the independent variable and the mediating variable is tested. According to Model 2, management competence has a significant positive impact on the quality of internal control (β= 0.467, t=7.520, p<0.05); In Model 3, management competence has a significant positive impact on employee competence (β= 0.299, t=4.468, p<0.05). Finally, the significance of the regression coefficients of independent and mediating variables on the dependent variable was tested. According to Model 4, the quality of internal control has a significant positive impact on operation performance(β= 0.369, t=5.868, p<0.05), employee competence has a significant positive impact on operation performance(β= 0.286, t=4.906, p<0.05), management competence still has a significant positive impact on business performance(β= 0.177, t=2.861, p<0.05) indicates a significant partial mediating effect of internal control quality and employee competence on the impact of management competence on operation performance. Management competence can not only directly affect business performance, but also influence through the partial mediating effect of internal control’s quality and employees’ competence. Thus, H1, H4 and H5 is verified. The hierarchical regression is adopted to verify the moderating effect hypothesis of this article. According to the results of Model 1, it can be seen that management competence * financial data quality has a significant positive impact on operation performance (β= 0.453, t=9.078, p<0.05), and at this time, management competence still has a significant positive impact on business performance (β= 0.379, t=7.511, p<0.05), indicating a significant positive moderating effect of financial data quality between management ability and operating performance. According to the results of Model 2, it can be seen that management ability * business process design has a significant positive impact on operation performance (β= 0.325, t=5.919, p<0.05), and at this time, management competence still has a significant positive impact on operation performance (β= 0.328, t=5.772, p<0.05) indicates that business process design has a significant positive The paper also takes further validation to test the moderating effect of financial data quality and business process design, on the relationship between management competence and operation performance, through a simple slope analysis.",
    "The results (table 7) showed that when the quality of financial data was at a low level, the effect of management competence on operation performance was not significant (B=-0.054, 95% CI=[- 0.178, 0.070], including 0). When the quality of financial data is at a medium level, the effect of management competence on business performance is enhanced (B=0.349, 95% CI=[0.258, 0.430], excluding 0).When the quality of financial data is at a high level, the effect of management competence on business performance is strongest (B=0.752, 95% CI=[0.624, 0.880], excluding 0). When business process design is at a low level, the effect of management capability on business performance is not significant (B=-0.002, 95% CI=[-0.146, 0.142], including 0). When the quality of business process design is at a medium level, the effect of management ability on business performance is enhanced (B=0.305, 95% CI=[0.202, 0.407], excluding 0).When business process design is at a high level, management capability has the strongest effect on business performance (B=0.593, 95% CI=[0.452, 0.734], excluding 0). To enhance the operation performance, managers need to improve their competency, while improve the quality of financial data and business processes. Moreover, the managers’ competence on the operation performance also relies on the quality of internal control, which guarantee the workflow’s quality, and management competence also depends on the employees’ competence. By referring to the literature, and according to the planning theory or COSO framework, a well- prepared strategic plan can reduce many potential risks or loss. Moreover, the planning theory suggests that the managers need to carefully evaluate their selection of the decisions and assumptions, which will finally direct the activities of the organization. At present, researchers use a variety of measurement methods to study the factors to affect the operation performance, some of which are complex to build. However, till now, there is lack of a relatively unified and convincing standard, so it is difficult for the author to select indicators. This paper uses the questionnaires for analysis based on the relevant literatures, but these indicators also have relevant limitations. These indicators may not be perfect to evaluate the management’s action and organization’s operation performance. Therefore, the accuracy of the conclusion is worth for further modification."
]