[
    "Abstract: Sustainable development has long been an important topic in urban renewal. This paper examines the renewal of urban waterfront spaces from the perspective of growth, focusing on the growth of nature, humanity, and industry. By controlling key elements, the waterfront landscape can achieve a balance between the past and the future, and between nature and the city. Combining relevant theories and practical experience, this paper proposes implementation approaches for growth in four dimensions: natural work, spatial integration, cultural extension, and industrial iteration. Using the example of the renewal practice of the Changyuan moat in Henan Province, this paper explores how to integrate the historical ecosystem, ancestral cultural genes, old city industry cultivation, and urban development process to ultimately create a regionally characteristic, sustainable waterfront space. Waterfront space, as the most interactive area between human activities and natural processes, is affected by both city and water, which are in the eternal growth. As such, the growth of waterfront space should be studied from a combined perspective of urban and ecological. The concept of \"growth\" has increasingly been applied to the research and design practice of urban and rural planning, landscape forestry, and related majors [1]. For example, F L Wright applied the concept of \"growth\" to the field of architecture, advocating for organic architecture conforming to nature and promoting urban development with vitality. I L Mcharg (1969) combined ecology and waterfront landscape in \"Design with Nature,\" emphasizing the impact of time on waterfront landscape and viewing landscape as living creatures, with a long-term perspective [2]. G Hargreaves (2010) proposed landscape processlism, recognizing that landscape changes with time, space, and seasons, and advocating for the least intervention design by using natural forces to manage their growth process [3]. In recent years, China has also attached more importance to sustainable development with various theories and practices, such as the \"anti-planning\" theory [4], the \"green infrastructure\" theory, and the promotion of \"sponge cities.\" [5] This research proposes a growth-based approach that adopts natural, cultural, and socio-economic development strategies to seek integration between human needs and natural and humanistic processes in spatial and temporal dimensions. Nature, society, culture, and economy all play important roles in the renewal of waterfront spaces, and they are closely intertwined. When redesigning these complex systems, it is important to consider the natural ecology, spatial function, historical culture, industrial economy, and other factors comprehensively. By understanding and harnessing the growth and dynamic evolution of these four levels, we can create an organic and sustainable development system for waterfront spaces. After analyzing successful waterfront space renewal projects both domestically and internationally, several key points for promoting growth through renewal design have been identified. The renewal of waterfront space must take into account the natural environment and the role of nature. Ecological civilization construction in the new era emphasizes the need to protect and adapt to nature, based on the understanding of its resilience. Designers should follow the natural development pattern, allowing natural forces to do the work, while minimizing artificial interventions. The horizontal meandering of the water system and vertical gradient structure of the habitat should be maintained to ensure a balance between living and non-living things, promoting the sustainable development of the entire waterfront ecological environment. Spatial function integration is essential to guide the evolution of the waterfront landscape, enabling the functional combination of urban and waterfront spaces. The morphology and structure of the waterfront space is the basis and critical carrier of energy flow. The adjustment of space function can affect the growth process of the waterfront space. The breaking down of spatial boundaries and the arrangement of various activities in the same space encourages the growth of the waterfront space, spreading to the periphery. This flexible approach accommodates multiple possibilities and uncertainties, providing a broader development space for the waterfront. Reconnecting time and space, stimulating cultural identity, and fostering a sense of belonging is critical for urban waterfront renewal. The urban waterfront area holds the collective memory of the city, reflecting production and life, behavior habits, aesthetic concepts, and spiritual activities over time. By understanding the multi-level historical information of the site and the development characteristics of the water context in different periods, designers can reconstruct the intersection across time and space. Spatial historical information belonging to different time dimensions and the understanding of future needs are introduced to highlight the growth attribute of waterfront culture, preserving collective memory.",
    "Sustainable economic development is the driving force behind waterfront space renewal. The waterfront area is often the center of urban vitality, and its industrial layout should be designed to meet future demands for housing, office, leisure, and service facilities. Node penetration is emphasized in function setting to expand the radiation range of waterfront space and share the economic benefits of the area. Designers must take into account ecological, social, and economic benefits, extending the waterfront hinterland economy and realizing industrial iterative development. Changyuan City, located in the northeast of Henan Province, has a rich history spanning over 6,000 years. As part of the Yellow Flood Plain, the city has a unique urban pattern of a \"water- enveloped city\", with the moat guarding the starting point and core of the city from the very beginning. However, with the rapid development of the city, the moat river underwent a transformation from being \"surrounding\" to being \"surrounded\" (as shown in figure 1). This represents a shift in function from inward defense and protection to outwardly driving the development of the whole city. In light of this, preserving the cultural heritage of the ancestors, repairing the historical ecosystem, and revitalizing the city have become crucial tasks that are garnering increasing attention from both the government and the public. The Changyuan moat, with a length of 4 kilometers and a surface area of 8.4 hectares, has suffered from the negative impacts of rapid urban development and disregard for ecological environment (as shown in figure 2). As a result, the water system's continuity has been severely damaged, and the rigid impervious revetment has exacerbated water pollution and hindered the waterfront's ability to self-regulate and self-purify. To address these issues, the design first evaluated the shoreline conditions and ecological functions of the site and restored the natural ecological shoreline using local materials. Four types of stone revetment were constructed based on slope and curvature and surrounding land utilization, along with a continuous wetland purification system that enhances self-purification ability and self- regulation initiative. The result is a stable and healthy natural biological community that provides habitats for aquatic species (as shown in figure 3). A significant number of illegal constructions have encroached on both sides of the moat, closing off the interface between the river and the city. This has limited the potential for enhancing the value of waterfront space and the possibility of future growth. To address this, the design proposes the creation of small and micro spaces to increase the interaction between the city and the waterfront interface, fostering a harmonious coexistence between humans and nature. This involves clearing dangerous old buildings and unused land on both sides and creating a range of multi-space forms such as alleys, streets, squares, courtyards, gardens, and terraces to connect the city and the river. By forming a compound open space that encourages sharing and participation, large space can form the coastal vitality node, while small space drives the waterfront vitality to permeate. This will create a rich and diverse river-city interface that meets residents' daily needs for socializing, walking, gardening, sports, shopping, worship, and more (as shown in figure 4). Additionally, the design proposes service facilities to be arranged along the moat, based on important functional nodes such as wharves and small and micro spaces, according to the service radius. Using renewable materials and clean energy to ensure fairness in the distribution of service facilities such as commercial retail, sports facilities, and toilets, a comprehensive service node can be established along the river to meet the diverse needs of urban functions from a whole life process perspective. The moat in Changyuan holds significant historical and cultural value, and it should be respected and showcased as such. Along the moat, there are countless cultural resources that range from stories and memories to historical landmarks. Unfortunately, in the process of urban development, most of these resources have been lost, and there is a critical need to restore and protect them. To achieve this goal, the design first focuses on unearthing the historical memory of the old city and redefining the cultural sequence of the moat. By integrating traditional cultural landscape elements with Changyuan's history, the design aims to restore ecological, Confucianism, city, business, and education cultures. The result is an urban landscape that reflects the city's ancient elegance and modern charm (as shown in figure 5).",
    "Secondly, the design restores historical images and connects them to historical and cultural sites. By researching historical data, the design restores historical and cultural images, such as the \"City Gate Bazaar,\" \"The Stage of the Ancient Meeting,\" and \"Tower Climbing,\" using modern landscape techniques. Additionally, existing historical and cultural sites, such as the old city wall, are protected and activated, allowing people to experience and interact with them without destruction. This approach not only preserves the cultural heritage of Changyuan but also stimulates the sense of belonging of local residents. Changyuan is a vital economic hub in Henan Province with a significant advantage in its consumption market. The changing consumption patterns of both urban and rural residents have paved the way for the growth of immersive urban and rural tourism. The renovation of the moat presents an excellent opportunity to activate the city's travel industry. To ensure the sustainable development of the moat and its surroundings, it is crucial to integrate the existing water system and cultural resources. The central area should serve as the driving force for the surrounding area's development, ultimately revitalizing the water-based lifestyle for the public to enjoy. This will bring about not only environmental benefits but also economic advantages to the broader community, encouraging more areas to take part in and benefit from the waterfront area's development (as shown in figure 6). Under the concept of growth, designers are more inclined to focus on guiding nature to do work, constructing multiple scenes integrating natural environment and human space, continuing historical and cultural memory, realizing gradual renewal, and promoting the coordinated development of society and economy. The design practice of Henan Changyuan moat has formed a complete and systematic design strategy. At the same time of ecological restoration, culture, people, industry and water-city linkage are integrated, and the improvement of spatial quality drives the improvement of spatial income, transforming short-term urban renewal into long-term benefits of optimizing human settlement environment. This case provides a design approach that can promote the growth of landscape itself."
]