[
    "Abstract Food composition data serve as a foundation for public health policy and food safety. In China, local governments play a pivotal role in collecting, maintaining, and applying such data in line with national nutrition and health strategies. This study investigates the construction and governance of the food composition database in Henan Province from 2012 to 2022, analyzing how local authorities coordinated food sampling, laboratory testing, and data standardization. The Henan database, covering 378 food items and generating 7,185 data points, reflects both regional dietary characteristics and administrative capacity. The case reveals the strengths of local government-led data infrastructure in supporting national health goals, while also highlighting challenges such as data updating, cross-agency coordination, and public accessibility. Findings suggest that strengthening institutional collaboration and digital governance can enhance the long-term sustainability and policy relevance of local nutrition databases. In the context of growing global concern over food safety, nutritional health, and chronic disease prevention, food composition data have become a strategic public asset. These datasets inform national nutrition policies, guide public dietary recommendations, and support scientific research and food industry regulation. As such, their accuracy, comprehensiveness, and accessibility are critical to ensuring effective public health governance. In China, the national “Healthy China 2030” initiative emphasizes the development and continuous updating of food composition databases as part of a broader strategy to improve population health and promote scientific dietary practices. While national guidelines provide the policy framework, it is local governments that are primarily responsible for implementing food monitoring programs, managing sampling operations, coordinating laboratories, and ensuring data quality. This makes the local level a key arena for the governance of food and nutrition information. Henan Province, one of China's most populous and agriculturally significant regions, offers a representative case of how local government institutions engage in the construction of food composition databases. With its rich diversity of food products, strong food-processing industry, and sizable rural and urban populations, Henan has carried out extensive food sampling and data collection over the past decade. Between 2012 and 2022, the provincial Center for Disease Control and Prevention (CDC) oversaw the testing of 378 food items, producing 7,185 entries of nutritional and chemical data. This study is significant for three main reasons. First, it demonstrates how local governments operationalize national nutrition strategies through concrete institutional practices. Second, it contributes to the emerging literature on subnational data governance, particularly in the fields of health and food policy. Third, it highlights critical governance challenges—such as data standardization, inter-agency coordination, and information transparency—that may hinder the broader utility of nutrition databases in both policy design and public By analyzing the Henan experience, this study offers insights for improving the effectiveness and sustainability of food data governance at the local level, which is essential for ensuring public trust and achieving long-term health outcomes. The governance of food and nutrition data has attracted increasing academic attention in recent years, particularly in the context of public health, sustainable development, and evidence-based policymaking. Scholars have emphasized that food composition databases are not merely technical tools but also policy Globally, the development and maintenance of food composition databases have been led by a combination of central government agencies, academic institutions, and health authorities. In countries such as the United States, New Zealand, and the Netherlands, these databases are part of larger national health information systems that inform everything from food labeling to chronic disease prevention programs (Sivakumaran et al., 2018; Merchant & Dehghan, 2006). These initiatives often rely on coordinated multi-level governance mechanisms to ensure consistency and coverage across diverse regions and food types. In China, however, food and nutrition governance remains highly decentralized. While national plans such as the “Healthy China 2030” outline strategic goals for nutrition monitoring and database construction, their execution depends largely on provincial and municipal governments. Despite this decentralized model, research on the specific roles and capacities of local governments in this domain remains limited. Existing studies tend to focus on technical aspects of food sampling and nutrient analysis (Wang et al., 2020) or on the policy impact of national nutrition programs (He et al., 2012), with insufficient attention to the governance dynamics at the subnational level. Recent literature in local governance and public administration highlights the importance of local institutional capacity in implementing complex health and environmental policies. Studies have examined how local governments shape education, environmental management, and healthcare delivery through administrative coordination, policy innovation, and resource mobilization (Hoffman, 2020; Brezovnik, 2021). These insights are highly relevant to food data governance, which similarly requires cross-sectoral coordination, data management expertise, and public accountability.",
    "This study seeks to bridge the gap between technical and governance-oriented literature by situating the development of Henan’s food composition database within the broader discourse of local government roles in health data infrastructure. It builds on the growing recognition that effective nutrition policy requires not only sound data but also robust local institutions capable of managing, sharing, and applying that data for public benefit. Based on the local food composition and production characteristics, the monitoring program prioritized the selection of commonly consumed prototype foods, such as grains, vegetables, locally characteristic foods, and novel raw ingredients. Prepackaged foods with nutrition labels were sampled from food stores across counties, townships, and towns in the province. These products were mainly produced by small local enterprises and included labeled items and regionally distinctive aquatic products. The program also included monitoring of commonly consumed legumes and legume-based products, as well as the nutritional composition of traditional ready-to-eat local dishes with high consumption rates. Seasonal fruits and vegetables, especially those that are locally grown and widely consumed, were sampled for nutrient analysis. Additionally, foods sold on-site and prepared immediately—such as processed meat and fish products using methods like marinating, braising, stewing, and roasting—were included. In total, 35 categories of food were covered, including vegetables, fruits, edible fungi and algae, fresh meat and poultry, aquatic products, dairy, oils and fats, legumes, and nuts. Samples were selected based on high consumption frequency and relevance to the assessment of local dietary and nutritional health. Repeated and multiple samplings were conducted to ensure representativeness and reduce sampling errors. Sampling locations were chosen as randomly as possible. Special attention was paid to proper storage and transportation to prevent nutrient degradation due to processing, preservation, or logistics. Monitoring sites conducted sample collection, analysis, and testing based on the objectives and standardized annual work plans issued by the National Project Office. All nutrient contents were expressed per 100 grams of edible portion. During sample processing, any changes in weight were carefully recorded to calculate the edible portion and determine weight change factors. Detailed records were maintained, including the weight of each batch, total sample quantity, standard samples, and edible portions. Photographs were also taken during processing. Each processed sample was assigned a unique identification code, and the treatment method was clearly labeled following the sample name. A total of 378 food samples were collected, prepared, and analyzed, covering 10 major food groups across 18 cities in Henan Province. This monitoring effort produced a large amount of descriptive food information and 7,185 analytical test data points. The results are summarized in Table 3 below. The majority of the food types surveyed were concentrated in nine key cities: Zhumadian, Jiaozuo, Luohe, Hebi, Zhengzhou, Xuchang, Xinyang, Xinxiang, and Kaifeng. Among them, Zhengzhou, Zhumadian, Luohe, and Xinyang are densely populated with a high concentration of food enterprises, and are major production areas for grain, vegetables, and fruits in the province, providing a wide variety of food types. Xuchang and Kaifeng, on the other hand, are historically significant cities that preserve rich resources of traditional and regionally distinctive foods. A total of 1,460 food items were collected during this survey across 17 prefecture- level cities in Henan Province. According to the classification by food type, 333 items were prepared dishes, 440 were pre-packaged foods, and 687 were raw or unprocessed foods. Based on food category classification, a total of 21 categories were investigated, including 102 samples of livestock meat and products, 58 of eggs and products, 77 of dried beans and products, 152 of grains and products, and 49 of alcoholic beverages. Other categories included 68 samples of nuts and seeds, 58 of fungi and algae, 22 of miscellaneous items, 83 of poultry and products, 47 of dairy and products, 107 of vegetables and products, 99 of tubers, starches and products, 94 of fruits and products, 57 of instant foods, 45 of sugar, preserved fruits, honey, 60 of condiments, 66 of snacks and desserts, 54 of non-alcoholic beverages, 42 of infant foods, 53 of fats and oils, and 67 of fish, shrimp, crabs, and shellfish (Table 4). B. Ye: The Role of Local Governments in Food Nutrition Governance: A Case Study of the Food Composition Database in Henan Province, China By region, the surveyed food types were mainly concentrated in nine cities: Zhumadian, Jiaozuo, Luohe, Hebi, Zhengzhou, Xuchang, Xinyang, Xinxiang, and Kaifeng. Among them, Zhengzhou, Zhumadian, Luohe, and Xinyang are densely populated and home to many food enterprises. They are also major production areas for grain, vegetables, and fruits in Henan Province, with abundant food resources. Xuchang and Kaifeng, as cities with long-standing histories, preserve many local specialty food resources (Table 5).",
    "B. Ye: The Role of Local Governments in Food Nutrition Governance: A Case Study of the Food Composition Database in Henan Province, China Food composition data are an essential component of national foundational strategic data. This work requires integration with research in nutritional science of foods (including agricultural products and processed foods), and the expansion of food composition monitoring to scientifically collect data on nutrients, functional components, disease-related components, and harmful substances. Continuous updating and improvement of the national food composition database is crucial. China has a wide variety of regionally distinctive diets, and its diverse culinary traditions have shaped a unique food culture. However, compared with the well- developed food analysis systems and technologies in other countries, China’s food nutrition assessment efforts are still in a catch-up phase. This is mainly reflected in the insufficient variety of raw (unprocessed) foods in the database, the recent inclusion of nutritional data for prepared dishes, and the need for standardized analysis of processed food components. There is also a serious lack of data on specific foods such as breast milk and special dietary products, which severely limits the ability to meet the needs of specific populations and patients [9]. There remains significant room to expand the food nutrition indicators. Compared with the U.S. food composition database, China’s database lags behind in both food variety and the number of measured indicators. The Chinese food composition database needs further enrichment and refinement. Implementing a national food composition big data strategy under the theme of “joint development and sharing for the health of all” aims to provide equitable, accessible, systematic, and continuous nutritional and health services, achieving a higher level of public health [4]. According to the Anti-Food Waste Law of the People’s Republic of China, understanding the nutrient content in thus B. Ye: The Role of Local Governments in Food Nutrition Governance: A Case Study of the Food Composition Database in Henan Province, China foods, grasping national food consumption and dietary habits are of great importance for chronic disease prevention and building a Healthy China. In this study, a total of 378 types of food were analyzed in Henan Province, yielding 7,185 valid data entries. This significantly enriched the food composition database and helped improve the sampling and analysis of high-consumption foods and key products from major food-producing areas. It also contributed to expanding the reach of nutrition and chronic disease surveillance points across provinces and to the further development of the China Food Composition Database. However, the food nutrition database also has its limitations. These include variations in food composition across countries and seasons; the influence of crop cultivar or variety on food components; and differences between brands or production batches of the same formulated product. Some important food characteristics, such as the ingredient lists of industrially processed foods, are missing [10]. Furthermore, food labels often only partially cover the full range of ingredients and/or nutrients, leading to discrepancies—especially the lack of information on minor compounds such as flavor substances or chemical contaminants. In the near future, it will be important to include more of these foods and provide detailed information about their additives, flavorings, added fats, sugars, proteins, fibers, and salts, in order to differentiate between \"natural\" and \"artificial\" sources. Where possible, it would also be worthwhile to include other potential indicators of food health value—such as the ratio of soluble to insoluble fiber, or the glycemic index. These may become important features of future nutrition databases, enhancing their relevance to human health. Despite ongoing updates, limited resources make data aging inevitable. Therefore, food composition databases must continuously evolve alongside scientific advances."
]