[
    "This article traces the process behind the implementation of the “Air Silk Road,” a cargo flight connection between Luxembourg and Zhengzhou, the capital of Henan province. Its origins lie in economic competition between Henan and its neighbouring provinces, dating back a decade before the official announcement of the Air Silk Road in 2017. Provincial and municipal governments in Henan displayed opportunistic risk-taking behaviour in persistently pushing for the development of Zhengzhou’s air- port economy, but only timing and coincidence allowed the province to gain a foothold in the Belt and Road Initiative (BRI). With findings drawn from fieldwork in China between 2019 and 2020, we contribute to an understanding of the implementation of the BRI, the underlying rationale and the challenges inland provinces face in integrating into the world economy. In 2013, Chinese president Xi Jinping 习近平 announced the “Silk Road Economic Belt,” which was to stretch overland from China to Europe. Shortly afterwards, he made public plans for a related sea route, “21st Century Maritime Silk Road.”1 Together, these projects formed the “Belt and Road Initiative” (BRI). Interpretations of the BRI are contested. While some researchers interpret the BRI as a “grand strategy’” with geostra- tegic and geopolitical ambitions,2 others see it as a framework of fragmented decentralization and competing interests.3 Far less is known about the subna- tional aspects of the BRI, such as subnational actors’ driving interests. the © The Author(s), 2021. Published by Cambridge University Press on behalf of SOAS University of London. This is an Open Access article, distributed under the terms of the Creative Commons Attribution licence (https://creativecommons.org/licenses/by/4.0/), which permits unrestricted re-use, distribution, and reproduction in any medium, provided the original work is properly cited. doi:10.1017/ S0305741021001120 First published online 09 December 2021 Findings exist for the border and coastal areas of Yunnan,4 Guangxi,5 Jiangsu6 and Yiwu,7 but work on landlocked inland Chinese localities, with the excep- tion of Chongqing municipality and freight train connections between inland China and Europe, remains almost non-existent.8 Among the provincial BRI initiatives is the Zhengzhou–Luxembourg “Silk Road in the Air” (Zhengzhou–Lusenbao “kongzhong sichou zhi lu” 郑州－卢森堡 “空中丝绸之路,” Air Silk Road hereafter) between Luxembourg and Zhengzhou, the capital of central China’s Henan province. President Xi highlighted the Air Silk Road during a visit by Luxembourg’s prime minister, Xavier Bettel, to Beijing in 2017.9 By 2020, the Air Silk Road had developed into a cargo connection, with 12 weekly flights between Zhengzhou Xinzheng International Airport (Zhengzhou Airport hereafter) and Luxembourg Airport,10 and had expanded to Hungary’s Budapest Airport.11 The Air Silk Road is worth investigation for several reasons. First, it stands out in its preciseness and clear focus compared to other provinces’ initiatives, which vaguely seek to turn localities into “transport hubs” but which do not offer simi- larly catchy slogans. Of note is that, with regard to the fostering of international exchanges, Henan, like other central Chinese provinces,12 suffers from structural, historical and geographical disadvantages compared to coastal and border provinces. The Air Silk Road, as a flagship BRI project from a central Chinese province, is therefore a surprising and unlikely case. Against this background, this research traces the development trajectory of the Air Silk Road to offer a more nuanced understanding of its drivers and subnational motivations and of central China’s decentralized integration into the world economy. Our analysis goes back to the early 2000s, allowing us to anchor the Air Silk Road in its historical foundations. The Air Silk Road emerged from provincial economic competition and local hardships more than a decade before its launch in 2017, as well as within the context of China’s central government’s plans for regional transport infrastructure development. In addition, Henan’s provincial and Zhengzhou’s municipal governments pursued an approach of what we call “persistent opportunistic expansion.” At that time, Henan’s provincial govern- ment pushed for support from the central government in developing the airport economy in Zhengzhou to funnel international trade and investment into the region and to catch up with the rapid airport expansion in its vicinity. Opportunistic, entrepreneurial and risk-taking behaviour in making large invest- ments in the short term, as well as expanding central governmental directions in a persistent manner over a longer term, drove local cadres’ initiatives to achieve long-term economic gains. The coincidental search by the Luxembourg govern- ment for a new investor for its cargo airline, Cargolux, came at the right time and ultimately allowed for an acquisition by the Henan Civil Aviation and Investment Corporation (Henan minhang fazhan touzi youxian gongsi 河南民航 发展投资有限公司, HNCA hereafter). From then on, Henan’s provincial and Zhengzhou’s municipal governments paid several visits to Luxembourg to sign follow-up agreements, acknowledge existing achievements and offer a stepping stone to further initiatives. The Air Silk Road provided Zhengzhou with an inter- national capability while opening a long-term window for the province to access BRI-related support from the central government.",
    "Our findings make several contributions to the existing literature. First, they show that flagship BRI projects such as the Air Silk Road may find their roots in provincial economic interests and competition rather than being top-down endeavours. Accordingly, the BRI cannot be understood solely as a political and strategic venture; it follows significant local economically driven interests. Second, we show that local cadres’ risk-taking behaviour in pushing for the devel- opment of the airport economy favours not only short-term but also long-term economic benefits.13 Third, we show that despite political recentralization under Xi Jinping in recent years,14 subnational actors have some discretion to push their own agendas and even stretch the scope of central government policies if these agendas remain aligned with the broad direction of the central govern- ment. However, agents in central Chinese provinces have less leeway than their counterparts in coastal and border provinces. Our findings are drawn from two fieldtrips to China between November 2019 and February 2020. In total, we conducted 13 semi-structured interviews with provincial government officials, business representatives, scholars and stakeholders from international diplomatic services. We also undertook participant observations and observational trips to domestic transport construc- tion sites and cooperation centres in Zhengzhou. Finally, we analysed official provincial and municipal trade and investment statistics, government reports and documents, as well as Chinese and international media coverage. Despite the dearth of literature on China’s provincial integration into the global economy, there has been increasing scholarly interest in the role of China’s pro- vinces and municipalities in international relations and the BRI. For example, Audrye Wong highlights how the Yunnan government has successfully proposed pipelines, highways and railways to South-East Asia in its pitches to the central government.15 Similarly, Mingjian Li shows how Guangxi has built infrastruc- ture connections with ASEAN countries,16 and Mario Esteban and Yuan Li together illustrate Chongqing’s approaches in pushing for a cargo train connec- tion to Europe.17 In recent years, provinces and municipalities have hosted BRI information and business-exchange events,18 established their own provin- cial Silk Road funds,19 and invited international scholars to contribute to trans- national BRI research projects.20 Together, these factors demonstrate the increasing relevance of provincial and municipal actors in China’s international relations and the BRI and thus the necessity of research in this realm. In seeking to gain a better understanding of what drives subnational initiatives in China’s international relations and the BRI, the existing literature serves as a solid foundation, having identified several provincial and municipal strategies. Audrye Wong conceptualizes three approaches used by provinces to exert influ- ence: trailblazing, carpetbagging and resisting. Trailblazing refers to provinces taking initiatives in a bottom-up fashion. For example, without approval from the central government, subnational governments may make significant invest- ments by themselves early on and thereafter present their projects as a fait accom- pli to secure final support. Carpetbagging refers to subnational actors mirroring the central government’s rhetoric but pursing their own, sometimes different, goals. Resisting occurs when provinces opt to not follow the central government’s direction.21 Lee Jones and Jinghan Zeng refer to these phenomena as influencing, interpreting and ignoring.22 More specifically, provinces lobby the central govern- ment for approval and financial support for their projects. They submit reports and proposals23 and try to convince central government officials during joint semi- nars24 and visits from top leaders.25 Second, provincial governments establish coali- tions with powerful actors, such as central state-owned enterprises and the military,26 who are key partners when promoting specific projects in Beijing. Third, provincial and municipal governments frame projects in a way that appeals to central leaders’ interests.27 And fourth, provinces use the presence of business actors to justify a need use of these measures over extended periods of time, as demonstrated by the steps taken by Yunnan and Guangxi to establish relations with South-East Asia, which began in the early 1990s and 2000s respectively.29 While the above factors could, from a theoretical perspective, also apply to the Air Silk Road, the structural conditions in a landlocked inland province such as Henan provide a more difficult context for internationalization. For example, Zhengzhou was only added to the list of cities to be opened to the world in 1992.30 Unlike coastal provinces, Henan was unable to attract foreign investors or establish a variety of international commercial relations early on. Other pro- vinces did so and were able to build on those connections to form ties across the world.31 Furthermore, Henan is geographically disadvantaged compared to coastal and border provinces. Unlike Guangxi, Henan cannot establish cross- border economic development zones or host major regional economic forums such as the China-ASEAN Expo.32 And, unlike Yunnan, Henan cannot take advantage of neighbouring countries’ natural resources to push for cross-border economic projects such as pipelines.33 Lastly, Henan’s financial resources are lim- ited, making it more likely to remain dependent on support from the central gov- ernment. This is in contrast to rich provinces such as Jiangsu, which was excluded from China’s overarching framework document for the BRI, the “Vision and actions on jointly building the Silk Road Economic Belt and 21st Century Maritime Silk Road” (the Vision and Actions document hereafter), published in 2015.34 Jiangsu’s provincial government ignored the central government’s deci- sion and openly criticized it in this regard as “unwise” and continued with its own BRI plan.35 Given the absence of such structural advantages in Henan, the devel- opment of the Air Silk Road from a landlocked inland province is surprising and suggests the involvement of an as-yet unobserved factor.",
    "The Air Silk Road is even more puzzling: it is the only initiative from an inland Chinese province that has such detail and scope. Under the umbrella of the Vision and Actions document, provinces and municipalities have started issuing their own plans for the BRI. Out of the 16 provincial and municipal plans that are available to the public via China’s online Belt and Road Portal, five come from China’s inland provinces; however, none of these offers a similarly bold ini- tiative or catchy slogan as the Air Silk Road. For example, “The action plan of Hunan province to join the One Belt, One Road Initiative (2015–2017)” details target host countries, sectors and relevant companies in 62 specific projects,36 and Qinghai’s “Development and action plan for the Silk Road Cultural Industrial Belt (2018–2025)” rather vaguely encourages enterprises in the tourism and culture sectors to promote the province’s cultural reach.37 Against these observations, the specific cooperation between Zhengzhou and Luxembourg under the Air Silk Road initiative is an outlier of subnational transborder cooper- ation. The subsequent sections detail the emergence of the partnership, its drivers and core motivations, and the measures taken at the provincial and municipal levels. The Air Silk Road between Luxembourg and Zhengzhou has emerged as Henan’s dominant internationalization initiative under the BRI, the origins of which lie in the mid-2000s, when provincial and municipal governments actively sought to spur Henan’s economic development as well as its position within China, particularly in competition with neighbouring provinces. The idea of turn- ing Zhengzhou into an airport-based logistics hub thus pre-dates the Air Silk Road by almost a decade. The airport economy was born out of Henan’s difficult economic situation in the mid-2000s. Although Henan is China’s fifth largest economy, the province has long been a base for mainly agricultural production, responsible for produ- cing almost 10 per cent of China’s crops and 10 per cent of its meat as of 2005.38 Similarly, its population was almost 100 million in 2005, among the high- est in China, but with 69 per cent of the population living in rural areas,39 Henan ranked 17th in GDP per capita.40 When considering provincial internationaliza- tion based on outward FDI stock, Henan ranked only 18th in China in 2010. Although this was much better than neighbouring Hubei, Henan’s outward FDI stock was only slightly higher than those of Shanxi and Shaanxi and was significantly behind those of Anhui, Shandong, Hebei and Hunan.41 At this time, competition between China’s inland provinces intensified. One reason for this was that the central government’s Western Development Strategy (announced in 1999 and formally inaugurated in 2000) (Xibu dakaifa zhanlüe 西部大开发战略) had allowed for better infrastructure connecting China’s inland provinces with the coast. In addition, in 2004 China’s prime min- ister, Wen Jiabao 温家宝 began to promote the idea of the “rise of the central regions” (zhongbu diqu jueqi 中部地区崛起),42 which became the central govern- ment’s development framework for central China. The Rise of the Central Regions Plan seeks to develop hub airports in central Chinese provincial capitals, as well as railway and road connections along north–south and east–west trans- port arteries, to link central China with the rest of the country.43 As a result, Henan started to compete with its neighbouring provinces, particularly Hubei, Shaanxi and Anhui, to attract foreign investment and production and to develop its provincial transport infrastructure.44 Especially of note is that Hubei province began expanding its provincial capital airport, Wuhan Tianhe International Airport 武汉天河国际机场, throughout 2005.45 With heavy reliance on much slower and more regionally confined overland transport, Henan’s government feared economic losses if Henan could not keep pace, in which case the province would be reduced to a feeder to an emerging airport hub in its vicinity. This was not an unlikely scenario, because the position of Zhengzhou Airport vis-à-vis other provincial airports, such as those in Luoyang 洛阳 and Nanyang 南阳, was not clear. Additionally, overall infrastructure was regarded as too poor and airline connec- tions as too few.46 Confronted with economic hardship and pressure from neighbouring provinces, Henan’s provincial and Zhengzhou’s municipal leaders began to embark upon ambitiousmeasurestoenlargeZhengzhouAirport andkeeppacewithsurrounding developments.47 Henan’s government echoed the central government’s language, envisioning turning Zhengzhou into an international aviation hub48 – one with a specific focus on cargo traffic and direct flight connections, especially with East and South-East Asian countries and North America, as well as with the Middle East, Africa and the European Union.49 The vision was not without risk, as space for regional airport hubs in inland China was limited. Lacking many alternative options, the Henan provincial Party committee and the Henan government first gave approval to an economic pilot project, the Zhengzhou Airport Economy Zone (Zhengzhou hangkonggang jingji zonghe shiyanqu 郑州航空港经济综合试验区), in 2007.50 The plan outlined short-tolong-term targetsuntil2035. Direct flight connec- tions were to be opened with South-East Asia and North America by 2010. Furthermore, the airport zone was to be expanded from 4.6 square kilometres to an area of 138 square kilometres and supplemented with related connecting land trans- port infrastructure.51 Henan was first off the mark among the other provinces such as Shaanxi, which only announced the expansion of the Airport New City of its Xi’anXianyangInternationalAirportto146squarekilometresin2014.52Inaddition, theHenangovernmentdecidedtoinvestinaviationdevelopment,committing100mil- lionyuanannuallyforaperiodoffiveyears.53Bycontrast,totalprovincialexpensesin 2010 for other areas, such as environmental protection, amounted to more than 700 million yuan.54 building. First, it formed a powerful coalition with the Civil Aviation Administration of China (CAAC) (Zhongguo minyong hangkongju 中国民用航 空局) in 2009. As an authority under the central government’s Ministry of Transport, the CAAC became Henan’s direct link to Beijing and an important partner when support was needed from Beijing later on. In addition, the CAAC provided subsidies for expanding airport-related infrastructure.55 Second, Henan’s provincial and Zhengzhou’s municipal governments went after foreign investors to increase the province’s production and export capacities. One such investor was Foxconn, Taiwan’s producer of electronic devices for brands such as Apple, Dell and Nokia.56 Foxconn had started to build factories in inland China, such as in Hubei’s Wuhan.57 To keep pace, the Zhengzhou municipal government established the Foxconn Technology Group Zhengzhou Investment Project Coordination and Promotion Leading Group under the guid- ance of Zhengzhou’s mayor, Zhao Jiancai 赵建才, in 2007. The leading group tried persistently over a period of almost three years to persuade Foxconn to open production facilities in Zhengzhou.58 The provincial government offered incentives to foreign investors such as free land-use rights, buildings for plants and workers’ dormitories.59 In 2010, Foxconn finally agreed and set up its new asset,61 Foxconn’s decision was a result of Henan’s persistence over the previous years and the personal relationship between Henan’s Party secretary, Lu Zhangong 卢展工, and Taiwanese Foxconn founder, Kuo T’ai-ming 郭台銘.62 Subsequently, from 2010 to 2011, Henan’s foreign trade increased by 83 per cent, with a significant share being attributed to Foxconn’s production in Zhengzhou.63 central government. Shortly after the signing of the strategic cooperation agree- ment framework with Foxconn,64 China’s State Council approved the Zhengzhou Xinzheng Comprehensive Bonded Zone (Zhengzhou xinzheng zonghe baoshuiqu 郑州新郑综合保税区), located north-east of Zhengzhou Airport. This gave Zhengzhou a lead in the competition with its neighbouring provincial capi- tals. As the first bonded zone in central China and an extension of the initial area of the airport zone with processing facilities, logistics, port-based operations and other related services, the expansion put Zhengzhou ahead of other provincial airports.65 The close distance between the bonded zone and Zhengzhou Airport was favourable for production and for the import/export of components and goods, which became better integrated later on, for example, through a joint customs clearance system.66 After receiving approval from the central govern- ment, the Henan provincial Party committee and the Henan government contin- ued to draw up additional measures. In 2011, they established an enterprise under the Henan provincial government, the HNCA. The HNCA became the provin- cial government’s vehicle to implement a multitude of tasks in relation to the air- port economy zone, including transportation and aviation logistics, making it a lead actor in establishing the airport development zone.67 The subsequent development of the airport also took place under the national and provincial 12th Five-Year Plans (2011–2016) aimed at expanding the rail- road, railway and airport infrastructure development in central China, along with transport networks and airport hubs.68 The State Council also issued guid- ing opinions for the Central Plains Economic Zone (Zhongyuan jingjiqu 中原经 tral China.69 However, the central government decided that agriculture should be the major sector for development in Henan under the CPEZ, with development of the transport infrastructure receiving less attention. Not satisfied with this out- come, the Henan provincial Party committee and the provincial government began to lobby the central government using their pre-established links with the CAAC, and jointly introduced the Zhengzhou Comprehensive Experimental Zone for an Airport-based Economy.70 In 2013, Henan’s persist- ence yet again paid off when the State Council ratified the “2013–2025 Planning and development of the Zhengzhou Comprehensive Experimental Zone for an Airport-based Economy,” which included Zhengzhou Airport, the Zhengzhou Comprehensive Bonded Zone, and the emerging surrounding indus- trial parks, encompassing a total area of 415 square kilometres.71 Henan’s loca- tion in the centre of China and its favourable infrastructure connections to elsewhere in the country were an asset, but Henan’s early and bold investments to develop an economy around Zhengzhou Airport were also significant. With its related construction of highways, logistical demands of existing export capaci- ties associated with Foxconn and related manufacturers, and its free-trade zone and bonded logistics centre, Henan had something to offer.72 The chief of the CAAC, Li Jiaxiang 李家祥, summarized Henan’s bottom-up approach, saying, “Henan … has acted earlier as well as taken substantial measures,” which took place “in the new round of regional competition.”73 The incorporation of Henan’s airport plan into the CPEZ indicates a particu- lar success for Henan and Zhengzhou. This was the first time that an airport pilot zone had been upgraded to a national strategy.74 The upgrade also expanded Henan’s experimental zone into a strategy to open up central China and even western China, as Zhengzhou was designated a national air logistics hub, with both freight transit and distribution services and the additional ambitious goal of becoming a “mega hub” by 2025.75 Henan’s airport was yet another step ahead of those in other provinces.",
    "This shows that early provincial entrepreneurship, bold and persistent mea- sures, and incentive-driven behaviour to develop the local airport in line with interprovincial competition went beyond mere implementation of central govern- ment policies. The provincial and municipal governments made significant early investments, thereby taking high financial risks, and formed ties with Beijing by aligning with the CAAC. Having something to offer, Henan could push for its own agenda at the central level, even extending the scope of the central govern- ment’s development plan for the province. Those provincial initiatives were key to the local development strategy being elevated from a provincial to a national plan. The early origins of the Air Silk Road between Zhengzhou and Luxembourg can be traced back to a well-timed yet coincidental opportunity. In 2012, Qatar Airways decided to sell its 35 per cent stake in Luxembourg’s cargo airline, Cargolux, which the Luxembourg government then had to purchase. Since that time, Luxembourg had been trying to find a new investor.76 These events were external to Henan and beyond the control of the province. However, in May 2013, Luxembourg’s minister for sustainable development and infrastructure, Claude Wiseler, visited China with a delegation of representatives from Cargolux, Luxair and the airport operator, Lux-Airport. First, he introduced Luxembourg’s logistical capabilities to his Chinese counterparts, the minister and vice-minister of transport, Yang Chuantang 杨传堂 and Li Jiaxiang 李家祥.77 Owing to Henan’scooperationwiththeCAAC,LiJiaxianghadapositiveopiniononthepre- vious substantial measures taken by the province. It is therefore unsurprising that, based on that impression, Wiseler then travelled to Henan, where he discussed the idea of developing a logistics hub at Luxembourg Airport at the highest provincial level, notably with Henan’s Party secretary, Guo Gengmao 郭庚茂, and the governor of Henan province, Xie Fuzhan 谢伏瞻.78 Based on this first meeting, Henan’s provincial government sensed an emerging opportunity and became active in building and consolidating a relationship with Luxembourg. Henan’s long-term interest in developing its airport economy matched well with the comparatively urgent financial need of the Luxembourg government to find a new investor for Cargolux and with Luxembourg’s mid- term interest in attracting new flights to Luxembourg.79 Shortly after Wiseler’s trip to Henan, Henan’s vice-governor, Zhao Jiancai 赵建才, paid a high-level return visit to Luxembourg, where he expressed Henan’s interest in developing a European–Chinese logistics hub. This meeting also allowed for the start of negotiations regarding a potential investment by Henan in Cargolux.80 Soon after, in 2014, the governor of Henan province, Xie Fuzhan 谢伏瞻, and Luxembourg’s minister for sustainable development and infrastructure, François Bausch, signed an investment agreement according to which the HNCA could pur- chase a 35 per cent stake in Cargolux for US$120 million, allowing for an initial proposed scheduled of four weekly flights by Cargolux to Zhengzhou.81 However, the investment was not free of risk. At that time, Cargolux was experi- encing monthly deficits, and freight growth in general was slowing, especially in the Asian region where Cargolux was active.82 But Henan’s provincial government was determined to take on those risks and even promised an additional investment by the HNCA of US$15 million to extend the initial proposal for a logistics hub at Zhengzhou Airport via a “dual-hub strategy” with a European counterpart at Luxembourg Airport.83 Cooperation between Henan and Luxembourg was further secured through an additional agreement between Lux-Airport and its counterpart, the Henan Airport Group (Henan sheng jichang jituan youxian gongsi 河南省机场 集团有限公司), to cooperate in freight and passenger transport.84 In sum, the cooperation between Zhengzhou and Luxembourg came about because the timing was good and provincial leaders sensed a unique long-term opportunity to integrate with the global economy in exchange for making short- term investment commitments. The investments in Cargolux and in the dual-hub strategy appear great and risky, yet the provincial government had the capacity to put those resources together at short notice to grasp a rare opportunity and, with that, the potential for long-term gains. In 2015, more than a year after the HNCA had purchased a share in Cargolux, China’s central government issued the Vision and Actions document, a new framework which prescribed the roles of Chinese provinces in the BRI. The docu- ment gave Henan room to further expand its transport corridors to Europe. But, more explicitly, it also emphasized the role to be played by Zhengzhou: to become a leader in opening up the inland regions. Major tasks for the city included the construction of the airport and an international land port, the strengthening of customs clearance, the furthering of cooperation with ports in China’s coastal areas and border regions, and the implementation of e-commerce pilot projects for cross-border trade. In addition to the references made to Zhengzhou, the Vision and Actions document designated other central Chinese cities to play a key role in the BRI, in particular Wuhan and Xi’an, which is likely to spur on further interprovincial competition.85 The new document provided a further opportunity and framework, which Henan’s Development and Reform Commission (DRC) used to announce its own BRI plan, scaling up its local initiative to the central government, November 2015. While echoing the contents of the Vision and Actions docu- ment, the DRC went a step further and reiterated the existing but still vague idea of an “air silk road” (kongzhong silu 空中丝路).86 To secure support from the central government, the DRC aligned its interest in developing the local air- port economy with the central government’s Silk Road framework and provided its own interpretation of the BRI. A prompt reaction to the Vision and Actions document was important, because in 2014, competition with Xi’an intensified over the starting point of what both cities called an “air silk road,” which came after Zhengzhou had opened its flight corridor to Luxembourg, as Xi’an connected with Kuala Lumpur only a few days later.87 in In 2016, the idea of an “air silk road” caught on at the central level. China’s national and Henan’s provincial 13th Five-Year Plans reiterated the need for north–south and east–west horizontal and vertical railway and expressway arter- ies to connect Henan with the rest of China and for airport hub development.88 Furthermore, Zhengzhou was set to become an important hub for an “air silk road.”89 Further specification of these plans took place at the provincial and municipal levels.90 In 2017, the concept of an “air silk road” gained new momen- tum.91 In June of that year, President Xi highlighted the Zhengzhou– Luxembourg “Silk Road in the Air” during Prime Minister Bettel’s visit to Beijing – this was the first official announcement of the project.92 The announce- ment did not bear much risk of rejection, nor was it unexpected, as Luxembourg had already begun to develop links with Henan under the dual-hub strategy. Although the new framework gave a label to an ongoing process that had been unfolding over the previous years, the central government’s reiteration laid a path for follow-up measures, further deepening bilateral relations between Henan and Luxembourg. During Bettel’s visit, Cargolux and the HNCA agreed to further enhance their cooperation by establishing a joint venture airline, the Henan Cargo Airlines, with 25 per cent of the stake being held by Cargolux and the remaining shares by Henan through the HNCA, the Henan Airport Group and the Zhengzhou Airport Xinggang Investment Group Company (Zhengzhou hangkonggang xinggang touzi jituan youxian gongsi 郑州航空港兴 Henan’s government acted quickly following the official announcement of the Air Silk Road. In September 2017, the general office of the Henan government published a circular to implement the Air Silk Road and clarified individual actors’ responsibilities. The major actor, the HNCA, was tasked with 11 of the 13 implementation steps, which included the expansion of the cargo network, the founding of the joint venture airline and the establishment of a visa facilita- tion programme.94 Second, Henan published an overall plan for the development of the Air Silk Road, which listed major goals and was to be implemented between 2017 and 2025.95 In October 2017, the CAAC and the provincial general office issued a strategic plan for the development of a global cargo and transpor- tation hub, which outlined three implementation periods until an extended long- term period to 2035.96 High-level visits by top provincial and municipal leaders to Luxembourg acknowledged the cooperation through a series of follow-up agreements, making a reversal of the existing path unlikely. Shortly after Xi’s announcement in June, a delegation led by Henan’s vice-governor, Shu Qing 舒庆, who was also respon- sible for trade, tourism and foreign relations, paid a visit to Luxembourg in August. During that visit, the HNCA and the Henan Airport Group signed agreements with Cargolux to expand the airfreight infrastructure.97 One year later, a second delegation visited Luxembourg, this time headed by Henan’s Party secretary, Wang Guosheng 王国生 and including other leading provincial officials as well as the deputy general manager of the HNCA, Guo Yanhong 郭艳红, and the deputy mayor of Zhengzhou, Wan Zhengfeng 万正峰.98 A letter of intent between Luxembourg and China was issued, reaffirming the aim of cooperating in terms of passenger traffic to complement the cargo route.99 Furthermore, Cargolux signed an agreement with the Industrial and Commercial Bank of China (ICBC) and received a credit line from the Bank of China in 2018.100 The HNCA’s earlier investment in Cargolux offered a new window of oppor- tunity for Henan to expand its cooperation from Luxembourg towards a wider European market. In 2019, the Air Silk Road was complemented by a cargo con- nection via Hungary to Central Europe, with Cargolux launching its first direct flight between Zhengzhou and Budapest Airport in April.101 Again, this was a coincidental opportunity for Henan, because a cargo route between Luxembourg and Budapest had existed since 2002. In that way, the new connec- tion to Budapest, as a stopover during Cargolux’s return flight from Zhengzhou, could be added relatively easily.102 In May 2019, hoping to expand into Central and Eastern European markets, the HNCA also agreed to further the evolution of Budapest Airport into a new cargo hub in Central Eastern Europe, which consolidated the relationship.103 A forum was therefore held in Budapest, with the Chinese delegation headed by Henan’s deputy Party secretary, Yu Hongqiu 喻红秋.104 This new cooperation with Budapest emerged amid regional competition. The deputy managing director of the Xi’an Xianyang International Airport, Wang Zhendong 王振东, signed a memorandum of understanding with his Hungarian counterpart at the end of April 2019 during a BRI forum in Beijing.105 The choice of Hungary as a partner was smart. Introducing the Budapest stop- over was relatively easy, given Cargolux’s pre-existing flight connection. Hungary is also a core European partner for China as it provides a window into the European Union and towards Eastern Europe. Despite criticism from other EU member states towards China,106 relations with Hungary have been excellent for many years107 – indeed, Hungary’s state secretary of the Ministry of Foreign Affairs and Trade, Tamás Menczer, stated that they have been “never as posi- tive.”108 By choosing to cooperate with a strategically important partner for China, Henan once again extended the original scope of the Air Silk Road beyond Luxembourg and thus put itself in a favourable starting position to pos- sibly secure further support from the central government to expand its inter- national reach in the future.",
    "Tracing the development of the Air Silk Road over time allows for reflection and for several conclusions. China’s central government played an important role in elevating Henan’s airport economy zone to the national level and allowing the zone to become part of China’s international initiatives. With its five-year programmes and the Rise of the Central Regions Plan, the central government provided Henan with an umbrella framework under which provincial and muni- cipal leaders were able to pursue their interests. Additionally, the announcement of the Air Silk Road by President Xi in 2017 gave new momentum to Henan’s cooperation with Luxembourg and made it stand out from other provinces with regards to its use of the Air Silk Road framework. Such frameworks and approval by the central government enabled Henan to push its interests further. The above analysis reveals several strategies that were key to launching Henan’s Air Silk Road: lobbying the central government, build- ing alliances, framing interests using the central government’s language, and using domestic business interests to justify the need for a specific initiative. In these ways, Henan used strategies similar to those used by other provinces when influencing and interpreting the central government’s broad direction.109 However, Henan is not the only inland province to have used the above strat- egies to integrate with global value chains. For instance, Shaanxi also formed relations with the CAAC, which, in 2014, approved the Airport New City and provided financial support.110 And Henan was not alone in attracting foreign investors. In 2007, Foxconn had already begun to build its production factories in Hubei’s Wuhan.111 Other multinationals, such as HP, Acer and ASUS, settled in the Chongqing municipality in as early as 2009.112 Other provinces have also used the central government’s language to frame their interests, as did Shaanxi when presenting itself as the starting point of the Air Silk Road.113 those of other landlocked inland provinces: measures taken towards development came early and were persistent, bold and grasped emerging opportunities – an approach we call “persistent opportunistic expansion.” Although Wuhan was ini- tially ahead of Zhengzhou – it began the expansion of the Wuhan Tianhe International Airport in 2005 and had started to attract foreign manufacturers three years earlier than Zhengzhou – Wuhan lacked sufficient successful follow-up initiatives. For example, it was only in 2019 that the provincial govern- ment issued a plan to further expand its airport.114 Although the plan was com- prehensive and the anticipated size of the area was remarkable (501 square kilometres),115 Henan had already received State Council approval six years earl- ier to expand its airport economy zone to 415 square kilometres.116 Likewise, Shaanxi’s plan for its Airport New City was approved in 2014, yet Shaanxi was not only later than Henan in completing the project but also ultimately had a smaller planned expansion area of 146 square kilometres by 2020.117 This illustrates that Henan and Zhengzhou successfully combined bold initiatives relatively early on with persistent behaviour over a longer period of time, which made it possible for the province to come out ahead of its competitors. Yet meeting the above conditions was not sufficient to enable the inland prov- ince of Henan to elevate its provincial initiatives to a national and then an inter- national level. Coincidence and timing are often crucial factors for inland provinces who ordinarily struggle with a lack of opportunity to internationalize. As such, the province had to be ready. Without Luxembourg’s search for a new investor in Cargolux, Henan would not have been able to establish ties with Luxembourg and, from there – via Hungary – with other parts of Europe, and it would not have been able to consolidate its own bilateral relationships. However, coincidence and timing lie beyond the control of any province, and because a vast number of other conditions were necessary to establish this specific relationship, our findings illustrate that internationalization is extremely difficult for China’s landlocked inland provinces. This “persistent opportunistic expansion” makes the case of Henan different also from those of Chinese coastal and border provinces such as Yunnan and Hainan. Coastal and border provinces are, owing to their location or resources, in a better situation by default to trailblaze their own policies to shape transnational relations. Henan was more reliant on external factors, focusing more on carpetbagging – namely, the purposeful expansion and utilization of central governmental directions.",
    "Because internationalization is difficult, continuity and persistence are of vital importance. As such, Henan’s provincial and municipal leaders tried to secure the airport economy plan even when it became apparent that new leaders would come into office before its actualization. This finding expands on previous research which suggests that local leaders have only incentive-driven short-term interests.118 Henan thus tried to make the maximum use of existing initiatives to lock in already achieved stepping stones. For example, in Zhengzhou’s central business district, Henan is constructing a Henan–Luxembourg Centre (Henan–Lusenbao zhongxin 河南–卢森堡中心), which comprises business offices, commercial facilities and apartments.119 It is intended to give Henan an “international touch,”120 which is important in the long term for a province with limited international relations.121 Yet, for Henan, its initiatives appear to have been successful also in the short term. The acquisition of Cargolux has allowed Henan not only to gain access to the Western European market but also to benefit from the comparatively low airport fees at Luxembourg Airport122 and more stable cargo transfers to Europe.123 From 2014, the number of cargo flights between Luxembourg and Zhengzhou increased from two to 12 flights per week by 2019.124 With Cargolux transporting items to other countries includ- ingtheUnitedStates,Henanhasalsogainedaccesstomarketsfurtheroverseas.125 However, the development of the Air Silk Road was not as straightforward as it seems. As is the case in other policy areas, different parties pursue their own and at times diverging interests, and it is likely that such diverging interests were also at play at the genesis of what became the Air Silk Road. For example, Henan’s provincial government expanded the original scope of the Air Silk Road to include Hungary, although President Xi had initially confined it Luxembourg within his official announcement in 2017. Furthermore, a climate of fierce interprovincial competition across central China suggests that Henan had to expedite processes, a move which certainly did not go uncontested within the province as resources are limited. Finally, aspects of the Air Silk Road were contested internationally. For instance, the joint venture airline was originally envisaged with the name “Cargolux China” but was later on renamed “Henan Cargo Airlines.” In addition, Henan’s provincial government would have approved a 35 per cent share held by the European side, but the central govern- ment insisted on the lower share of 25 per cent.126 to Provincial agency and bold initiatives have their risks. For example, Christine Wong illustrates how financial overextension by decentralized agents can be a result of interprovincial competition.127 Problematic outcomes of this competi- tion are evident in the phenomenon of various cities sending empty cargo trains to Europe to compete with one another for central government subsidies.128 Yin-nor Tjia finds that competition for freight trains among inland cities can lead to developments that make no economic sense, such as longer transport routes.129 Provincial agency can also entail political risks for China as a whole. For example, Audrye Wong describes how Yunnan’s push for a cross-border pipeline caused a worsening of bilateral relations between China and Myanmar.130 In sum, our findings on the case of Henan counter previous works that advo- cate for interpreting the BRI as a geopolitical vision. Instead, our findings sup- port and align with previous research that has shown that what might appear as “grand strategy” can actually be the result of a long process. The Air Silk Road has evolved gradually over a protracted period of time, with its foundations lying in the central and provincial governments’ interests in developing Henan’s land and air-based infrastructure. It also shows the plan’s emergence as a clear result of subnational economic interests and interprovincial competition in cen- tral China. A nuanced understanding of provincial and municipal motivations, drivers and determinants is therefore crucial for developing a better grasp of the complexities inherent to China’s BRI, as well as the associated risks and implications. We thank Verena Weber and Yaning Zhang for valuable feedback on earlier ver- sions of this article. We would also like to thank Yan Liu for her research assist- ance. We are also grateful to the Deutsche Forschungsgemeinschaft (DFG) for providing funding for this project (Project No. 395165932). Wiebke RABE is a postdoctoral fellow at the Institute of Chinese Studies at the Freie Universität Berlin. Her work focuses on China’s foreign economic rela- tions, China’s infrastructure provision at home and abroad, and the interplay between China’s central and subnational actors. She holds a PhD in political sci- ence from the Hertie School.",
    "Genia KOSTKA is professor of Chinese politics at the Freie Universität Berlin. Her research interests are in China’s digital transformation, environmental polit- ics and political economy. She has a PhD in development studies from the University of Oxford."
]