[
    "Gunawan Aji1*, Ilham Ahmad Fahreza1 , Natasya Stifani 1, Fina Qoif Fiana1 1*,1Fakultas Ekonomi dan Bisnis Islam, UIN K.H. Abdurrahman Wahid, Pekalongan, 51161, Indonesia This research uses a qualitative descriptive approach and collects data through interviews about relevant literature or library materials, such as books, journals and websites, related to the research subject. The beverage industry has grown rapidly in recent years. There is no worry that many investors are interested in investing in Indonesia, and mixue is one of them. The Mixue franchise company was founded in Zhengzhou, Henan Province, China, in June 1997, and sells tea drinks and soft serve ice cream. The marketing mix or marketing mix is a marketing tool that forms a strategy for the company's marketing activities to achieve the company's vision and mission in an optimal way. This writing aims to analyze how the use of Marketing Mix has an impact on the Mixue beverage industry and whether it influences purchasing decisions in this industry. The results of this research show that Mixue Comal uses a Marketing Mix system, which consists of seven marketing components including product, price, place, promotion, people, processes and facilities which have a positive impact on the beverage industry and Mixue Comal purchasing decisions. In the current era of globalization, there is a lot of competition in various fields, especially economics. The economic field is very broad, especially in terms of business. Where almost everyone does business because they make money. With the rapid business growth in Indonesia, entrepreneurs have the opportunity to invest their money and start a viral beverage business (Ningsih et al., 2021). Modern drinks, which offer various types and variations at affordable prices, are increasingly developing into an increasingly popular business (Laili & Vania, 2023). One part of the economy that is developing rapidly is industry (Seran et al., 2020). The food and beverage industry experienced annual growth of 5.33% in the first quarter of 2023, becoming the fourth largest among other processing subsectors (Central Statistics Agency, 2023). The food and beverage industry continues to grow and does not appear to be experiencing a post-pandemic decline. When it comes to drinks, every year there will be a new drink that everyone is looking for. Many new trends or innovations in the beverage industry have emerged and are rapidly spreading to Southeast Asia, especially Indonesia, such as ice cream and boba tea (Rizal et al., 2023). many new types of drinks (Indriyani, 2014). One of them is Mixue. The Chinese company Mixue was founded in 1997 and sells ice cream, tea and boba drinks in more than 10,000 stores in Indonesia. It is known that Mixue uses the franchise concept to develop its business (Najla et al., 2023). Mixue Comal Branch increases its brand business by using social media. Mixue Comal Branch is also located in a strategic location. This Mixue product is very popular with many groups, including small children, teenagers and even adults. Consumers' decisions to buy certain goods or services are greatly influenced by the marketing mix. Marketing mix or commonly known as \"marketing mix\", is a marketing tool that creates a strategy for a company's marketing Based on the description above, the main problem that will be discussed is the influence of the application of Mix marketing on the Comal Branch Mixue beverage industry and whether it influences purchasing decisions in this industry. This writing aims to analyze how the use of Marketing Mix has an impact on the Mixue beverage industry and purchasing decisions in this industry. Mixue's interesting marketing methods and unique taste make it popular with the public (Rizal et al., 2023). Several factors support the success of Mixue products in reaching consumers, such as market size, consumer purchasing power, and distribution (Agustin et al., 2023). In recent years, the beverage industry has experienced rapid growth. It is not surprising that many investors are interested in investing in Indonesia. Examples of soft drink agribusinesses are Starbucks, Thai tea, Sharetea, and Chatime (Seran et al., 2020). Apart from that, Mixue is one of the ice and soft drink businesses that is growing rapidly (Najla et al., 2023). According to William J. Stanton. Marketing is \"an overall system of business activities that aims to plan, set prices, promote and distribute goods and services that meet the needs of existing and potential customers\" (Mardiyanto, 2021).",
    "Assauri (2013) said that marketing strategy is a combination of desires, goals and standard rules that are used to market products or services routinely at different levels and levels. The main goal is to help companies adapt to uncertain competitive conditions and environments (Prabowo et al., 2021). According to Triyono Prijosoesilo, General Chair of the Soft Drink Industry Association (ASRIM), Indonesia's population of 250 million is a driving factor in the growth of soft drinks in the country. He also stated that the soft drink market in Indonesia is growing very rapidly due to the high level of competition. The soft drink industry experienced quite positive growth, ranging from 1 to 2 digits, in line with economic growth, increasing purchasing power and increasing community mobility (Foodreview) Mixue franchise company was founded in June 1997 in Zhengzhou, Henan Province, China, and sells tea drinks and soft serve ice cream. In June 1999, the company underwent a transformation. Business owner Zhang Hongcao created his newest ice cream brand, Mìxuě Bīngchéng, which means \"ice palace built with sweet snow.\" (Najla et al., 2023). If a company has a clear, good and precise marketing plan, it will produce profits in the form of the company being able to operate well and this will be a positive thing for the company (Kolter, 2017). Mixue started operating in its first store at the Cihampelas Walk shopping center in Indonesia in March 2020 with the help of PT Zhisheng Pacific Trading. After that, the company will continue to develop through a franchise scheme in Java, Sumatra, Kalimantan, Sulawesi and Nusa Tenggara. By 2023, at least 21,581 Mixue stores were operating in China and twelve Asia-Pacific countries. The Zhang Brothers completely owned this company. The Indonesian Ulema Council The marketing mix, or marketing mix, is a marketing tool that combines price, location, product and company promotion to achieve the results desired by the target or marketer (Kotler & Armstrong, 2021). Marketing mix is the idea of incorporating marketing into real life. There are many ways to meet the needs of target buyers. The level of customer satisfaction before and after sales can change even though the product has many features (Cannon, et al, 2008). through various product choices. Based on the purpose of purchasing, consumer groups are divided into two, namely final consumers and organizational consumers. Final consumers aim to fulfill their needs, such as individuals and households. Meanwhile, organizational consumption is aimed at commercial purposes, increasing profits, or for the needs of its members such as industry, traders and non-profits. The marketing mix consists of the four “P” and it is useful to divide all its variables into four basic variables: product, place, promotion, and price. The purchasing decision process on consumer behavior is influenced by age, income and lifestyle. One way to study consumer behavior is to analyze consumer perceptions of a product (Hesti Budiwati, 2012). The author uses a qualitative descriptive research method. The results of these observations are then researched and described in written form. Qualitative research is a type of research that emphasizes the search for meaning, concepts, characteristics and descriptions of natural and holistic phenomena. Descriptive research is a type of research that not only collects data to create a picture or confirmation of certain concepts or symptoms, but also to answer questions about the state of the research subject. By using relevant books, journals and websites. According to Sugiyono (2016), observation and interviews were used to collect data. Apart from information obtained from observations in online media, interviews were also conducted with Mixue Comal managers and consumers. Mixue is a fast-growing Chinese ice cream and soft drink franchise. In addition, Mixue is available in three locations in Pemalang Regency. The location is on Jl. Raya Ahmad Yani, Balutan, Purwoharjo, Comal District, Pemalang Regency, Central Java. which is divided into four parts: In the Marketing Mix there is a four \"P\" concept where all components are needed and must work together in each component. Then, when drafting the marketing mix concept, all final decisions regarding the concept of all the “Ps” must be taken simultaneously because they are important in surrounding the customer in one circle. The research results show that Mixue uses a marketing Mix system which consists of marketing components including product, price, location, promotion, human resources, service and physical evidence.",
    "Decisions The marketing mix is described as a set of factors that can be controlled to regulate a company's response through its target market. This mix consists of what the company has done to be able to have a significant impact through consumer demand. product, price, location and promotion are indicators in this research (Febri Indra Prabowo, 2021). Based on research results, according to Mixue Comal customers and seen from Mixue Comal Instagram reviews and Mixue Comal Google Maps reviews, buyers are happy and satisfied with the services provided by Mixue Comal. Many menu choices are sold. Prices for ice cream and drinks are affordable and don't drain students' pockets, ranging from 8,000 thousand to 22,000 thousand. Mixue Comal's facilities are also very adequate, including chairs, tables, air conditioning, toilets and even a fairly large parking area. Mixue Comal also holds interesting giveaways and promotions. Mixue Comal's location is also very strategic, close to main roads and public places such as terminals, schools, Comal markets so it is very easy to reach. So marketing mix research has a positive influence on purchasing decisions at Mixue Comal. From the definition above, it is clear that the marketing mix is one of the many variables that influence marketing. Therefore, it is very important to combine these four variables to achieve the company's marketing goals. Based on theory and research analysis, it is said that the factors in the marketing mix influence Based on the research and analysis used, Mixue Comal uses a marketing mix with the concept of product, price, promotion, location, individual, process or service, and physical evidence to increase consumer interest. It also shows that Comal's marketing mix is quite effective in increasing consumer interest. Consumers are satisfied with the service provided, affordable prices, promotions and giveaways carried out by Mixue Comal Branch to attract consumers as well as its strategic location close to community access which is very easy for buyers to reach."
]