[
    "1School of Business, Zhengzhou Technology and Business University, Zhengzhou, China 2Faculty of Public Administration and Social Studies, Stamford International University, Bangkok, Thailand 3School of Marxism, Zhengzhou Technology and Business University, Zhengzhou, China 4School of Humanities and Management, Yunnan University of Chinese Medicine, Kunming, China How to cite this paper: Wang, P., Liu, D. D., Wu, X. J., & Li, Y. J. (2024). Workplace Mindfulness, Resilience and Subjective Well- Being to College Students with SDT. Open Journal of Social Sciences, 12, 567-589. https://doi.org/10.4236/jss.2024.124038 Copyright © 2024 by author(s) and Scientific Research Publishing Inc. This work is licensed under the Creative Commons Attribution International License (CC BY 4.0). http://creativecommons.org/licenses/by/4.0/ Open Access The Post-Traumatic Growth of college students significantly impacts the quali- ty of education and life. However, Post-Traumatic Growth of college students in China often exhibits subpar. Therefore, it is crucial to investigate ways to enhance college student’s psychological factors in China to improve their Post-Traumatic Growth. This research explored the relationship, path, and mechanism between three variables: Workplace Mindfulness, Resilience and Subjective Well-being and Post-Traumatic Growth. The research employed a questionnaire survey method targeting college students in Henan Province, China. In total, 522 questionnaires were distributed using a random stratified sampling method, with 500 considered valid. The findings showed that Workplace Mindfulness, Resilience and Subjective Well-being positively in- fluenced Post-Traumatic Growth by constructing a structural equation model and data analysis using Smart-PLS4.0 and SPSS27.0. Furthermore, Workplace Mindfulness and Resilience mediated the relationship between job perfor- mance through Subjective Well-being. In conclusion, the research revealed the significant impact of Workplace Mindfulness, Resilience and Subjective Well-being on the Post-Traumatic Growth of college students, offering theo- retical and practical guidance for enhancing their studying efficiency. How- ever, there were limitations, including restrictions in sample selection and re- liance on a single data source. Therefore, future research could further ex- pand the sample size, adopt diverse data collection methods, and consider the effects of other potential variables to obtain more comprehensive and accu- People everywhere have suffered from the COVID-19 pandemic that began in 2019, which has greatly affected their daily lives and production (Pokhrel & Chhetri, 2021). Similarly, the pandemic has created an unprecedented global situation that quickly exposed and amplified the medical vulnerabilities of coun- tries worldwide. Meanwhile, experts began to realize that combating the virus was only a part of the treatment, as it also led to long-lasting psychological issues such as subjective well-being decline, psychological trauma, and decreased adaptability (Campbell et al., 2021). During the three years of continuous out- breaks of the pandemic in various provinces of China, many university students were forced to stay at home or school, unable to go out normally or even attend their classes properly, which undoubtedly dealt a significant blow to the physical and mental development of these students, who have not yet fully matured. The prolonged isolation that prevented students from going out easily put them in a state of anxiety, with some students exhibiting varying degrees of anxiety or even depression, while others developed severe social phobia. In 2023, as China con- tinued to adjust its epidemic prevention and control measures, it marked the start of the post-pandemic era (Tang et al., 2022). As a result of the pandemic, university students have faced considerable challenges and inconveniences in their daily lives and in their learning, resulting in significant changes in their learning methods and experiences as well as a decline in their sense of well-being. Henan, with one of the largest populations in China and one of the provinces with the highest number of students, has also been significantly affected by the An individual’s capacity for resilience is his or her ability to adapt positively to adverse circumstances or to maintain appropriate functioning even in the midst of a disastrous situation (Morse et al., 2021). Recent epidemics have provided a research background to suggest that resilience can promote one’s sense of well- being—the ability to quickly restore happiness through resilience, Post-Traumatic Growth (PTG), and adaptability strategies after experiencing a terrifying event (Hartmann et al., 2020). According to Tedeschi and Calhoun, the greater the adversity experienced in PTG, the more it can stimulate one’s ability to resist trau- matic environments, and thereby improve or accelerate his or her post-traumatic growth experience (Tedeschi & Calhoun, 2004). However, past research has fo- cused more on the relationship between resilience and PTG (Morse et al., 2021), while studies on whether an individual’s worldview, future expectations, Workplace Mindfulness, and subjective well-being can have a positive effect on post-traumatic growth are almost non-existent.",
    "However, research over the past two decades indicates that not all individuals who experience adversity will suffer from psychological or emotional health is- sues. It is known that some individuals are experiencing positive emotions and growth. This is known as positive mental health (Brooks et al., 2020). These changes include Post-Traumatic Growth (PTG) and resilience (Finstad et al., 2021), particularly among college students who were significantly impacted by the epidemic, such as the shift from face-to-face to online instruction, restricted lifestyles, reduced summer vacation time, postponement of exams, and increased difficulty finding employment (Yao et al., 2022). However, some students have also overcome the adversity caused by the epidemic, learned to view life and study challenges correctly, and understood the reason behind the changes hap- pening in the world (Morse et al., 2021). As Yıldız has pointed out, the epidemic crisis not only affects the physical health of college students but also inevitably affects their emotions. Most college students experience stressful emotions such as loneliness, anxiety, depression, and fear, among others. In the face of the same problem, some college students are not greatly affected by the epidemic, main- taining a positive mindset towards their studies, actively adjusting themselves, and exhibiting resilience. Therefore, the psychological state of college students affected by the three-year epidemic is a topic worthy of in-depth discussion, as it can lead to a better development of the Self-Determination Theory (Yıldız, Consequently, this study is based on the Self-Determination Theory and aims to investigate the relationship between college students’ mindfulness, resilience, subjective well-being, and post-traumatic growth in their learning environment. The main research questions of this study are as follows: After experiencing a three-year epidemic, college students faced many inconveniences in their daily lives and studies, including significant psychological and emotional issues. Can they persist with their normal studies? Can they maintain mindfulness in their learning environment during the epidemic? Can they maintain resilience and adapt to changes in the external environment, ultimately achieving post-traumatic growth? This study will be conducted by surveying 500 college students from three different types of universities in Henan Province, with data collected and analyzed using Smart-PLS3.0 software. Specifically, the findings of this study ex- plore mindfulness, happiness, adaptability, resilience, and post-traumatic growth among college students affected by the recent epidemic. Throughout history, philosophers have regarded happy human beings as the highest good and the ultimate motive for human action (Diener, 2008). Diener proposes that subjective well-being refers to a cognitive evaluation of high levels of positive emotions and satisfaction with one’s life (Diener et al., 1999). Self-perceived standards of quality of life determine an individual’s subjective well-being, re- sulting in an overall evaluation of their current life status. Faced with the impact of the epidemic, different individuals experience different perceptual expe- riences, and subjective well-being is not only a subjective evaluation of overall life satisfaction at a cognitive level (Diener et al., 1985). This study focuses on how college students positively assess their lives, learning, and cognition in the context of the epidemic. According to the definition of resilience, it is “the ability or outcome to adapt successfully to challenging or threatening circumstances.” (Masten et al., 1990). Resilience also reflects an individual’s ability to maintain stability and balance in the face of a series of difficulties brought about by the epidemic, and individuals with resilience could experience positive experiences and emotions. Resilience is characterized by positive behavior and attitudes in adversity, the courage and perseverance to face difficulties in life, Possessing a positive attitude even in the face of adversity, as well as enjoying intimate relationships and extending one’s social circle (Masten, 2013). Key components of resilience include resilience, self-enhancement, and particularly positive attitudes maintained during the epi- demic (Feldman, 2020). Influencing the environment and determining event outcomes, as well as learning from negative and positive experiences and pur- suing meaningful life goals. Oshio et al. propose resilience as novelty seeking, emotional regulation, and positive future orientation. This study examines col- Originally originating in Eastern Buddhism, mindfulness refers to being aware of one’s surroundings, living in the present, and non-judgmental of others (Ka- bat-Zinn, 2005). Research in the fields of Human attention, cognition, emotions, psychology, and behavior are positively affected by mindfulness, according to psychology, neuroscience, and medicine (Good et al., 2016). Zheng et al. pro- posed that Workplace Mindfulness refers to an individual’s acceptance and at- tention to current inner experiences and external work environments. Their team also proposed that there are three dimensions of mindfulness in the workplace: awareness, attention, and acceptance. Their research has shown that Workplace Mindfulness has positive effects on employees’ psychological and emotional states, work attitudes, and work behaviors (Zheng et al., 2023). For college stu- dents, Workplace Mindfulness refers to awareness, attention, and acceptance in experiences related to study and life. Faced with the spread of the epidemic, on- line classes, exam delays, and even lockdowns, college students may experience anxiety, hypochondria, and even panic. If college students can use Workplace Mindfulness, they can first acknowledge the presence of negative emotions and focus their attention on the present experience, and take positive steps to im- The term “post-traumatic growth” (PTG) indicates a positive psychological change that is experienced by some individuals after they have experienced highly challenging experiences in life, which changes, interpersonal experiences, as well as life values are primarily impacted by these changes (Tedeschi & Cal- houn, 1996). Although PTG arises from traumatic experiences, the key factor for promoting growth is not the epidemic itself but the process of coping with it – attempting to resist the epidemic and eventually making progress – which de- termines to what extent college students can achieve growth. PTG involves posi- tive psychological changes that occur in highly demanding and stressful life situ- ations, initially involving three domains. In subsequent years, the domains of strength, relationships, life appreciation, acceptance of new opportunities, and spiritual changes were included (Maitlis, 2020). The two main factors in PTG are the degree of challenge to an individual’s basic beliefs about the world and the level of cognitive processing triggered by this challenge (Liu et al., 2020). In the PTG process, cognitive reflection and introspection are essential, and the occurrence of the epidemic event brings both suffering and an opportunity for change, allowing individuals to rediscover themselves, others, and the world and achieve personal growth (Tedeschi & Calhoun, 2004). This study analyzed the post-traumatic growth of college students under the epidemic using a five-item scale created by Self-Determination Theory (SDT) indicates that individuals have three types of motives when engaging in activities: intrinsic motivation, extrinsic motivation (Ryan & Deci, 2000). SDT is an empirical theory of human motivation and per- sonality in social contexts that distinguishes motivation as either autonomous or controlled. SDT explains the influence of the self-determined social environment on intrinsic motivation, the development of autonomous external motivations and self-regulation through internalization and assimilation, individual differ- ences in generalized motivation orientation, the operation of basic universal psychological needs critical for growth, integrity, and well-being, and the impact of different goal contents on happiness and performance. SDT argues that indi- viduals have an inherent tendency to internalize, assimilate, and integrate so- cially endorsed behaviors, values, and norms (Deci & Ryan, 2013). Differences in the degree of internalization and integration result in individuals displaying dif- ferent types of extrinsic motivation when engaging in non-inherently motivating behaviors, namely external regulation, identified regulation, and integrated reg- ulation (Kim & Kim, 2021). The COVID-19 epidemic has exposed the impor- This study focuses on the impact of workplace mindfulness, resilience, and sub- jective well-being on post-traumatic growth (PTG). Based on self-determination theory, the researchers propose the following hypotheses regarding the relation- ships between these variables and the theory: Practicing mindfulness in the workplace may enhance employees’ sense of autonomy. Mindfulness encourages individuals to consciously focus on the present moment and perceive their thoughts and emotions without judgment. It can help employees better understand their needs and values, enhancing their ability to make autonomous decisions. When employees can autonomously choose how to respond to challenges and stress at work, their subjective well-being may increase, which in turn promotes post-traumatic growth.",
    "College students with solid resilience can quickly recover and adjust when facing adversity, reflecting their high level of competence. According to self-determination theory, when individuals feel competent to face challenges, their need for com- petence is satisfied, thereby improving their subjective well-being. This positive mindset and emotional state may help employees grow more after experiencing College students with high subjective well-being are likelier to establish good relationships with others because they are likelier to exhibit a positive and friendly attitude. This positive social interaction not only satisfies their need for relatedness but may also provide them with more social support and resources, which can aid in their recovery and growth after experiencing trauma. Some scholars suggest that the concept of mindfulness redefines the way in which social workers interact with others. An increase in mindfulness can im- prove attention, reduce stress and negative personality traits, and ultimately en- hance individual well-being (Walsh et al., 2019). Literature has linked mindful- ness with satisfaction and well-being and demonstrated that mindfulness can improve perceived quality of life. Studies have shown a decline in well-being among the global population since the COVID-19 pandemic (Lades et al., 2020). Specifically, Workplace Mindfulness moderates the relationship between fear of COVID-19 and subjective well-being. Low levels of mindfulness are associated with lower subjective well-being, while high levels of mindfulness can help people positively perceive their subjective well-being and mitigate negative ef- fects of COVID-19 (Kramer et al., 2020), making it a protective factor for mental health (Jue & Ha, 2022). Empirical research has also shown that mindfulness training during the pandemic can effectively improve happiness and overcome certain psychological burdens (Accoto et al., 2021). Drawing from this literature, The meaning of post-traumatic growth (PTG) is the positive psychological development and subjective perceptual changes that individuals experience in highly challenging environments. It is often associated with severe mental and emotional distress. The COVID-19 pandemic, in terms of its duration, scope of impact, and severity of consequences, surpasses any previous catastrophic event, and is a large-scale traumatic event (Horesh & Brown, 2020; Schwartz et al., 2020). It is worth noting that mindfulness is a positive strategy for coping with traumatic stress from the pandemic, promoting post-traumatic growth, particu- larly in improving relationships with others (Accoto et al., 2021). At the same time, a report from Spain has indicated that volunteers with low levels of mind- fulness during the pandemic hinder their own post-traumatic growth (Gonza- lez-Mendez & Díaz, 2021). Workplace Mindfulness (consciously focusing on the present moment and perceiving one’s thoughts, emotions, and physical sensa- tions without judgment) can positively impact an individual’s subjective well-being. Workplace Mindfulness helps reduce stress and anxiety and improve work effi- ciency and satisfaction, thereby enhancing personal subjective well-being. During the COVID-19 pandemic, higher Workplace Mindfulness was asso- ciated with higher internal learning motivation, greater life satisfaction, and subjective well-being, as well as higher scores on measures to post-traumatic growth (Yun et al., 2020). Workplace Mindfulness and subjective well-being ap- pear to play important roles in PTG development. For instance, it has been proven that nurses with higher levels of mindfulness are more likely to feel a sense of occupational duty and are happier at work, which in turn leads to stronger job motivation and a higher likelihood of PTG (Mabey et al., 2021). Researchers studying 270 Italian volunteers who were affected most severely by the pandemic found that one’s understanding of the meaning of life is related to resilience, post-traumatic growth, and subjective well-being (Pino et al., 2022). For young people, the pandemic has disrupted developmental stages of perso- nality and social relationships, which could have long-term implications for their well-being and happiness in adulthood (Gonda & Tarazi, 2022; Pino et al., 2022). Particularly during the pandemic, the more subjective well-being an individual maintains, the more likely they are to overcome difficulties and repair psychologi- cal trauma more quickly (Jayawickreme et al., 2022). Meanwhile, Vinkers et al. are optimistic that the tide will turn and, after the pandemic, growth can be facilitated through promoting well-being, happiness, and increasing resilience (Vinkers et al., Previous research suggests that resilience has a significant impact on subjective well-being (Bajaj & Pande, 2016; Büyükçolpan & Ozdemir, 2023). Over the years, scholars have defined resilience in various ways. For example, resilience refers to the dynamic process that allows individuals to respond or adapt in ad- verse situations (Thornton & Sanchez, 2010). Some scholars consider resilience to be a personal trait that enables individuals to thrive in the face of adversity. Resilient individuals demonstrate greater perseverance when faced with adversi- ty, are better equipped to withstand threatening environmental conditions, ef- fectively manage stress and difficulties, and possess greater capacity to cope with stress in daily life (Smith, 2006). Resilience also includes positive adaptive pat- terns that are developed over time in response to adversity (Cartwright et al., 2018). Over time, individuals with high resilience are able to recover effectively from daily stressors.",
    "A literature review indicated that resilience has a positive impact on both psychological health and well-being. Moreover, individual resilience can help maintain subjective well-being in the context of trauma (Satici, 2016). Students with high levels of resilience may also have high levels of subjective well-being when facing online learning challenges because resilient students feel more op- timistic and believe that things will get better (Sari et al., 2020). This study therefore proposes the following hypothesis: More broadly, resilience is achieved through developing new skills, streng- thening social relationships, and broadening perspectives. It is the most direct in- fluence on the desire to stay and the most significant influence on post-traumatic growth that resilience perceived occupational interests. High levels of resilience promote post-traumatic growth (Liu et al., 2021). Resilience is a psychological ability that enables individuals to face adversity, tolerate occupational stress, and respond to negative environments caused by role, responsibility, or changes in the work environment, in order to continue to perform their duties in a better way (Paul et al., 2019). University students live and study in a dynamic environment, often facing challenges and changes, even encountering relationship conflicts, difficult environments, setbacks, and even failures (Paul et al., 2019). The COVID-19 pandemic is a traumatic event that has profoundly changed the living and learning environment of university stu- dents. The ability to cope with trauma, as well as develop a sense of resilience, contributes greatly to the happiness of university students (Finstad et al., 2021). Based on the literature reviewed above, the following hypothesis is put forward: According to the research conducted by Kramer et al. (2020), Workplace Mindfulness can reduce individual work stress and help individuals perceive positive feelings of happiness in the context of the pandemic, thereby helping individuals to improve the progress of post-traumatic reconstruction (Kramer & Kramer, 2020). Factors related to the development of PTG include higher levels of personality traits, optimism, and personal behavior that are willing to think about trauma through effort. Strong resilience and subjective well-being of indi- viduals are important factors for post-traumatic growth. During post-pandemic, resilience has increased individuals’ determination and courage to face difficul- ties and improved subjective well-being, leading to the promotion of post-trau- matic growth (Gonda & Tarazi, 2022). As Jayawickreme et al. (2022) have pointed out, when individuals adopt positive actions to obtain higher levels of subjective well-being, they ultimately promote post-traumatic growth. Resilience refers to an individual’s ability to adapt and recover when facing adversity, stress, setbacks, or trauma. Post-traumatic growth, on the other hand, refers to the positive psychological, cognitive, or emotional changes and growth that an individual experiences after going through trauma or suffering (Luo et al., 2022). Resilience, as a psychological resource for individuals facing adversity, can help people better cope with the challenges and stresses of life. When facing traumatic events, individuals with solid resilience are more likely to maintain a positive mind- set and emotions, and this positive subjective well-being subsequently promotes post-traumatic growth. Firstly, individuals with solid resilience can adjust their emotions more quickly when facing trauma, reducing the impact of negative emotions. This positive subjective well-being gives them the courage and moti- vation to face challenges. Secondly, the interaction between resilience and subjec- tive well-being helps individuals re-examine their values and life goals after trauma (Brooks et al., 2020). The process of self-reflection and adjustment assists individuals in discovering new meanings and directions in life, thereby achieving post-traumatic growth. Finally, resilience can enhance individuals’ social func- tioning and interpersonal relationships by improving their subjective well-being. Positive social interactions not only help individuals gain more social support and resources but also further promote their psychological growth and recovery after trauma (Dolz-del-Castellar & Oliver, 2021). Based on the above theoretical assumptions, a model of the relationship be- tween Workplace Mindfulness, Resilience and Subjective Well-being to PTG was constructed, as shown in Figure 1. There are a total number of 832,900 college students in Henan province, ac- cording to the Education Department of Henan Province according to Henan Provincial Education Bulletin. According to Krejcie and Morgan (1970), the sample with a total number of 832,900 people is 384 (Krejcie & Morgan, 1970). After obtaining approval from the local psychology ethics committee, partici- pants were recruited online. The questionnaire of this research was distributed from June to July in the selected seven private primary school teachers. The in- clusion criteria were that a college student with sufficient proficiency in Chinese or comprehension skills would complete all related questionnaires and online data collection. Participants were asked to provide basic demographic details in the questionnaire, which took approximately 30 minutes to complete. The number of people surveyed was 522, and the number of valid questionnaires re- turned was 500, with a validity rate of 95.78%. Following the exclusion of inelig- ible questionnaires using SPSS27.0 and Smart-PLS3.0, 500 valid responses were obtained.",
    "Two parts comprise the questionnaire. First, the Likert scale ranges from 1 (strongly disagree) to 7 (strongly agree). The second part consists of multiple- choice questions which is basic demographic information, including gender, major, hometown, monthly family income, and post-graduation plans. Table 1 displays the demographic information of the respondents to illustrate the struc- ture. The questionnaire survey was conducted from January 1st to January 5th in 2023. Data analysis was performed on 500 questionnaires collected. Among the respondents, 62.09% were female and 37.91% were male. As for educational backgrounds, 48.51% of students studied literature and history and 43.89% were science and engineering students. Most students (48.23%) had a monthly family income between 3000 and 5999 RMB. As for plans, 61.96% of students planned to take the postgraduate entrance exam after graduation. Details are shown in Table 1. The scales used in this study are mature scales that have been previously utilized by other researchers with good reliability and validity. The Workplace Mindful- ness Scale was based on the study by Zeng (2022) and consists of three dimen- sions, namely Awareness, Attention, and Acceptance, with a Cronbach’s α of 0.928, rho-A of 0.931, Composite Reliability of 0.940, and AVE of 0.635. The Re- silience scale was based on the well-validated scale developed by Masten et al. (1990) and includes three dimensions, namely Novelty Seeking, Emotional Reg- ulation, and Positive Future, with a Cronbach’s α of 0.926, rho-A of 0.930, Composite Reliability of 0.965, and AVE of 0.822. The Subjective Well-being scale was based on the scales developed by Diener et al. (1985), with a Cronbach’s α of 0.956, rho-A of 0.957, Composite Reliability of 0.937, and AVE of 0.534 (Diener et al., 2002). The Post-Traumatic Growth scale was based on the re- search by Tedeschi & Calhoun (1996), and consists of five dimensions, namely Relationships, New Possibilities, Personal Growth, Spiritual Change, and Appre- ciating, with Cronbach’s α of 0.970, rho-A of 0.972, Composite Reliability of 0.973, and AVE of 0.644. In this study, Partial Least Squares Structural Equation Modeling (PLS-SEM) was used to analyze the data. A causal model is developed by combining prin- cipal component analysis with multiple regressions in PLS-SEM. It is generally suitable for research involving exploratory theory development, predictive anal- ysis, and complex structural modeling (Hair Jr. et al., 2019). This powerful tool can explore causal relationships across model structures and measure items. Ad- ditionally, with its ability to handle complex model structures, it is suitable for analyzing variables in datasets that do not have normal distributions (Hair Jr. et al., 2019). Thus, Smart-PLS 3.0 and SPSS 27.0 were used in this study to analyze data. Descriptive statistics were performed using SPSS 27.0, and the results are presented as follows: For all data analysis, Smart-PLS 3.0 software was used. A two-stage PLS-SEM analysis and estimation was performed. In the first stage, the questionnaire’s va- lidity and reliability were investigated, and in the second stage, the pass coeffi- cients were calculated and validated and explanatory power of the structural model (Anderson & Gerbing, 1988; Hulland, 1999). The study explored the causal relationships among Workplace Mindfulness, Resilience, Basic Hope, Subjective Well-being, and Post-Traumatic Growth. Each construct contained several measurement indicators from previous literature. The external model generally evaluates items based on their reliability as well as their internal consistency, convergent validity, and discriminant validity. The re- liability of each item is validated by loading it onto relevant questions. Several questions can measure a construct, with a threshold of 0.6 for individual reliabil- ity (Black & Babin, 2019; Hair Jr., 2009). The composite reliability is shown in Table 2. According to Chin’s (1998) research, the comprehensive reliability (CR) value for all constructs is generally greater than 0.7, indicating good internal consis- tency of the constructs (Chin, 1998). The Average Variance Extracted (AVE) for each construct is considered in determining convergent validity as an indicator of the evaluation of the comprehensive reliability for each measurement factor loading. If the AVE > 0.5, it indicates good convergent validity for the construct (Fornell & Larcker, 1981). The results show that the AVE values for the variables in Table 2 range from 0.515 to 0.969, indicating good convergent validity in this study. At the same time, compared with the coefficient correlation approach, it is recommended that the square root of the AVE for each construct be greater than the correlation coefficient for that construct. Some of the results in Table 3 do not currently meet the criteria but are acceptable.",
    "Note: The bold numbers on the diagonal represent the square roots of the AVE for each construct, while the other numbers represent the correlation coefficients among con- structs. The results in Table 4 further confirm the presence of discriminant validity. It has been suggested that constructs exhibit acceptable discriminant validity when the factor loadings assigned to each latent structure are greater than those as- signed to any other structure (Hair Jr. et al., 2021). A preventive measure (CMV) has been taken by the researchers to avoid common methods. Based on the sin- gle respondent cognitive information and the self-reported scale, CMV may be reduced. An anonymous survey was used in this study, where items were ran- domly assigned, and the meaning of each item was attempted to be hidden. Ob- viously, the results of Table 3 and Table 4 indicate that construct validity is considerable. With this regard, they also show that CMV has no significant in- fluence on the results. CMV severity was also measured by Harman’s One-Factor Test in this study (Podsakoff & Organ, 1986). A factor analysis of 40 items in this study revealed that the first factor, which belongs to the non-integrated factor, explains 16.95% of the variance. As a result, CMV did not seem to impact this study’s outcomes. In this study, as a validation method for validating the path coefficients and R2, PLS was performed on the internal model to evaluate the hypotheses. The re- searcher employed path coefficients to describe the strength and direction of the variable relationships, which show causal relationships, whereas R2 refers to the percentage of variance explained in the dependent variable, demonstrating the predictive ability of the model. Based on the results of this study, a resampling of data was performed as the values tested were found to be more accurate than commonly used approximate limits (Purvis et al., 2001). To determine whether the variables were significantly related, this strategy was employed in the present study. Table 5 and Figure 2 demonstrate positive and significant effects between Workplace Mindfulness, Resilience, Subjective Well-being, and Post-Traumatic Growth. There is evidence that Workplace Mindfulness positively impacts Sub- jective Well-Being and Post-Traumatic Growth, promoting H1 and H2 (Workplace Mindfulness -> Subjective Well-being: β = 0.444, t-value = 11.745; Workplace Mindfulness -> Post-Traumatic Growth: β = 0.364, t-value = 6.633). So, Workplace Mindfulness has positive relationship on Post-Traumatic Growth and Subjective Well-being. H3, H4, H5 (Resilience -> Subjective Well-being: β = 0.404, t-value = 7.765; Resilience -> Post-Traumatic Growth: β = 0.407, t-value = 10.990; Subjective Well-being -> Post-Traumatic Growth: β = 0.125, t-value = 4.210). As a result, these coefficients indicate that the two variables are positively correlated. H6, H7 (Workplace Mindfulness -> Subjective Well-being -> Post- Traumatic Growth: β = 0.045, t-value = 3.643, Resilience -> Subjective Well-being -> Post-Traumatic Growth: β = 0.050, t-value = 3.535), meaning that this two groups of coefficients show that there is an obvious positive relationship between the three variables. Under the framework of self-determination theory, this study examined the pos- itive relationships between Workplace Mindfulness, Resilience, Basic Hope, Subjective Well-being, and Post-Traumatic Growth among 500 college students who experienced three years of pandemic through questionnaire surveys and data analyses. The results showed that Workplace Mindfulness was positively related to Post-Traumatic Growth and Subjective Well-being, which was consis- tent with the findings of Mabey et al. (2021), Walsh et al. (2019), and Yun et al. (2020), while emphasizing the impact of the pandemic on college students. Fur- thermore, a significant positive relationship was found between Subjective Well-being and Post-Traumatic Growth, indicating that individuals who expe- rienced a higher level of subjective well-being were more likely to experience post-traumatic growth, which aligned with the findings of Mabey et al. (2021). Similarly, Resilience was positively related to Subjective Well-being and Post-Traumatic Growth, in line with the previously reported results by Finstad et al. (2021). Moreover, the positive relationships among Workplace Mindful- ness, Resilience, Basic Hope, Subjective Well-being, and Post-Traumatic Growth were more pronounced in college students from higher-income families than those from families with a monthly income lower than 2999 Yuan, as revealed by demographic characteristics. Finally, Workplace Mindfulness, Resilience, and Ba- sic Hope were found to have a positive effect on Post-Traumatic Growth through Subjective Well-being, consistent with the previous research by Gonda & Tarazi (2022), and Jayawickreme et al. (2022).",
    "In the path analysis, Workplace Mindfulness was found to have the strongest impact on Post-Traumatic Growth (β = 0.444), followed by the relationship be- tween Workplace Mindfulness and Subjective Well-being (β = 0.404). Among the seven hypothesized paths, Resilience had the weakest effect on Post-Traumatic Growth through Subjective Well-being (β = 0.050). Regarding the four variables, the maximum R2 value was found for Accept (R2 = 0.861), followed by New Possibilities (R2 = 0.849), while the minimum value was found for Novelty Seeking (R2 = 0.590). This indicates that the Accept di- mension of Workplace Mindfulness and the New Possibilities dimension of Post-Traumatic Growth contributed more significantly to the model. Based on existing research concepts, this study draws on previous research to develop a structural equation model. It uses Partial Least Squares (PLS) to vali- date the stability of the model and test the model assumptions. University ad- ministrators and implementers can use this study to enhance post-traumatic growth in college students. First, the results of the data analyses indicated that Workplace Mindfulness, Resilience, and Subjective Well-being had a positive relationship with PTG. Second, Subjective Well-being mediated the effects of Workplace Mindfulness and Resilience on PTG. As one of the provinces with the most students in China, over 70% of the stu- dents in Henan are from rural areas, with half of them having a family income of between 3000 and 6999 yuan per month. Given their economic status, families may find it challenging to support their children’s living expenses and have limited disposable income. In this situation, both the students themselves and their par- ents have high expectations for academic improvement and demand positive ac- tions to overcome current difficulties, acquire knowledge required by the college and eventually achieve better personal development after graduation. It is recom- mended that families and students focus on enhancing their experience of subjec- tive well-being and resilience, which can facilitate faster post-traumatic growth and help them return to normal life and study with a positive mindset. Having a clear career plan can encourage students to focus more on future prospects instead of being affected too much by current living and studying conditions. According to survey data, over 60% of students plan to attend post- graduate exams after graduation, and approximately 20% hope to find a job af- terwards, indicating that they have clear academic goals. Taking action to carry out future plans, overcoming current difficulties, and enhancing resilience can improve their subjective well-being and facilitate post-traumatic growth, consis- tent with the findings of Pino et al. (2022). As hopes of the nation and their fam- ilies, college students who increase their motivation to overcome difficulties and maintain a forward-looking attitude towards the future will face challenges in life and study with a more positive and optimistic outlook, ultimately cultivating the courage and strength to overcome any obstacles. It was difficult for the researchers to establish a rigorous research process, re- search methods, and a research organization. The data collection procedures identified some limitations, which need to be addressed in future studies. Firstly, when collecting data using online questionnaires, data collection bias may exist in a completely autonomous environment, as some participants may subjectively answer questions, thereby affecting the external validity of the re- sults. Secondly, this study only investigated the characteristics of Henan prov- ince college students in the post-pandemic era and did not cover other provinces in China. Therefore, the results of the survey can only illustrate the tendencies of Workplace Mindfulness, resilience, basic hope, subjective well-being, and post- traumatic growth among college students in Henan Province. Since different provinces have varying levels of implementation of epidemic prevention policies, the effects generated in different universities may vary accordingly. Moreover, there are differences in the guidance provided by different types of universities, which may also cause data variation among different variables. If future studies can collect samples of students from different types of universities in various provinces, it may help to evaluate the relationship between Workplace Mindful- ness, resilience, basic hope, subjective well-being, and post-traumatic growth Lastly, given that China’s pandemic prevention and control effect varies from other countries, further exploration is needed to verify whether the results of this study can be replicated in other countries or regions.",
    "All the authors listed in the article have made a substantial, direct, and intellec- tual contribution to the article and have approved it for publication. All authors have read and agreed to the published version of the manuscript. This study was supported by funds Key Project of Henan Province Education Science Planning 2024 (2024JKZD050); General Project of Teacher Education Curriculum Reform Research in Henan Province 2024 (2024-JSJYYB-127); Gen- eral topic of soft science in Henan Province: Research on the mechanism of se- nior teachers empowering the construction of the teaching team of colleges and universities under the background of high-quality education development (24240040379). Institutional Review Board Statement: This is to certify that the research project identified below has received an approval on human research protection by the Human Research Ethics Committee, Stamford International College, which is in full compliance with international guidelines of human research protection of the Belmont Report (Code: STIU-HREC023/2023). The data are currently not publicly available due to participants’ privacy, but they are available from the first author upon reasonable request. We would like to thank the college teachers who carried out this project, as well as five senior education specialists and head teachers for their advice. We would also like to thank the anonymous reviewers for their insightful comments, which greatly improved the quality of this study."
]