[
    "multifaceted framework that includes economic, political, and cultural dimensions, with culture serving as the cornerstone. In the contemporary stage of historical development, temple fairs are transforming from the traditional trajectory of \"street vendor economy\" and \"ruralization\", gradually integrating \"high-end\" elements and seeking innovative development paths, which aligns with the historical evolution of temple fairs and holds the potential to generate novel future formats. Within this emerging paradigm, temple fairs can synergize with high-end platforms to create both virtual and physical platforms that facilitate interaction and exchange among technology, products, brands, and cultural tourism. This transformation is poised to generate new economic momentum, converting the temple fair economy into a genuine economic form and significantly enhancing city branding. The temple fair, as a folk activity, is a concrete form and practical carrier of Chinese rural culture. Under the conditions of economic and social transformation, its structure and function have undergone changes, shifting from folk appearance to cultural capital [1]. Over time, it gradually integrated various cultural elements, forming its own distinctive cultural identity. Taking the Fire God Altar Temple Fair as an example, it stems from the folk reverence for 'fire'. It is said that Emperor Yao appointed Ebo as the official in charge of fire and stationed him in Shangqiu. Ebo used fire to mark the eventually honored with the title. because he used fire to number the years and diligently taught his people. To commemorate him, later generations built temples on high platforms, known as the Ebo Altar and Fire God Temple. During the Tang and Song periods, with the prosperity of various activities, temple fairs became an important venue for folk art exchange and entertainment. The integration of art forms such as dance and drama added rich colors to the temple fair, attracting many people to actively participate. During the Ming and Qing dynasties, the temple fair transcended the limits of culture and transformed into a comprehensive platform for commerce, entertainment, and cultural exchanges, greatly promoting economic interaction and exchange as an indispensable part of socio-economic activities. So far, the temple fair has far exceeded the scope of rituals and has become a window to display local culture and folk customs, meanwhile playing a key role as an important hub for trade and commerce. During the temple fair, merchants from all directions gather with a wide range of commodities, which not only meets the needs of local residents, but also strongly promotes the coordinated development of regional economy. Temple fair culture is a cultural form with historical continuity and ethnic identity. Throughout the long course of historical development, the hardworking and wise Chinese people have created a cultural model with unique cultural significance [2]. Temple fair culture is a concentrated manifestation of regional culture, spiritual culture, and civic culture [3]. In Henan Province, there are many temple fairs with Mountain Spring Festival Temple Fair in Kaifeng, and the Chenghuang Temple Fair in Zhengzhou. The opera performances and folk activities of the Chenghuang Temple Fair in Zhengzhou vividly display the richness of local folk culture and traditional artistic charm, while the Wansui Mountain Spring Festival Temple Fair in Kaifeng features martial arts performances and modern Chinese style parades, creating a unique experience for visitors to travel back to the ancient Wuxia world. Temple fairs in Henan Province are not only vivid carriers of traditional culture but also collective wisdom of Henan people, carrying profound historical and cultural heritage. At the same time, as a bridge for trade exchanges, temple fairs effectively promote economic cooperation and communication between different regions, providing a platform for mutual benefit and win-win cooperation. The Year of the Dragon 2024 “Taste of Henan” Daxiang Temple Fair held on Longhu Financial Island in Zhengzhou, in accordance with the principles of “government-led, enterprise-organized, activity-driven, and mass participation,” employed a blended interactive approach of “online promotion and offline participation,” introducing well-known traditional folk projects and local specialty foods from the 18 prefecture-level cities and Jiyuan Demonstration Zone in Henan. By drawing on the operational experience of foreign carnivals and utilizing the “mobile + integration” model, it aimed to create a temple fair cultural brand with regional cultural characteristics. With Henan culture as its foundation, it concentrated on showcasing the highlights of food, tourism, commerce, and culture in this financial island of the Central Plains Science and Technology City and even the entire Henan Province so as to create an ecological scene where visitors could fully experience the Central Plains culture during the Spring Festival. Unlike traditional temple fairs in Henan, The Elephant Temple Fair stood out for its many technological elements and interactive, immersive experiential activities. Through this festive celebration, more people were able to see the unique charm of Henan's historical culture and rediscover the vibrant influence of the financial island brand of the Central Plains Science and Technology City, to promote the high-quality development of Zhengdong New District and the process of city branding.",
    "Modern Commercial Districts Traditional temple fairs are mostly concentrated in temples or ancient villages, whereas The Elephant Temple Fair is held in modern commercial districts. Zhengzhou Longhu Financial Island, located in the 5.6 square kilometer of central Longhu, spans approximately 1.07 square kilometers and features a circular urban layout. Situated within the China (Henan) Pilot Free Trade Zone, it is a key component of the financial agglomeration core function area of Zhengdong New District, and is hailed as Henan's “Lujiazui (financial centre).” The island boasts well-developed infrastructure, convenient transportation, and a vibrant commercial atmosphere. Zhengzhou Intime in PARK introduces a new commercial form combining “block + shopping mall + micro-landscape,” providing consumers with a rich modern urban shopping experience. Over 200 events, including container markets, outdoor camping music, pet mini runs, Hanfu cultural festivals, and sunset concerts, have been organized on the island, showcasing its capability to host large-scale events. These activities and trending topics have rapidly attracted public attention, achieving over a billion total exposures. Empowered by digital technology, the “Smart Financial Island” provides real-time monitoring of data on the island's operational status, including the flow of people, traffic, security, activities, and landscapes during The Elephant Temple Fair, allowing for immediate insights into the event's real-time status. The international design and planning of the area offer high-standard venues and facilities for The Elephant Temple Fair while the advantageous location and comprehensive infrastructure ensure the potential visitor flow. The fair's location itself also contributes significantly to shape the city's image. As a festival activity with strong folk characteristics in Henan, the food culture of The Elephant Temple Fair is also unique. Compared with temple fairs in Beijing, which introduce a large number of old Beijing specialty foods, or events like the Wansui Mountain Spring Festival Temple Fair, the Taihao Mausoleum Temple Fair, and the Qinhuai Lantern Fair, which incorporate regional specialties from various areas, The Elephant Temple Fair adopts the theme of “Finding the Taste of Henan at the Financial Island” and gathers distinctive foods from the 18 cities of Henan Province, inviting non-native residents spending the New Year in Zhengzhou to taste their hometown delicacies on the Financial Island. This approach creates a unique and inclusive food culture. Delicacies such as Daokou Roast Chicken, Lingbao Apples, Fangcheng Noodles, Puyang Zhuangmo, Jiaxian Heluo, Guxian Rouhe, and Gushi Goose Pieces bring local specialties into the public eye. The fair is not merely about eating and strolling; it also promotes the development of agricultural products and local specialty food industries, generating economic value while spreading the distinctive food culture of Henan. Intangible cultural heritage is often referred to as the “living fossil” of a city's historical culture. Integrating intangible cultural resources to uncover the cultural connotations of a city is essential for enhancing its cultural soft power and building its city brand[4]. Intangible cultural heritage has become an important engine for promoting the development of cultural undertakings and industries, especially the integration of culture and tourism. The “temple fair,” as the core field of traditional local arts and commercial exchanges, plays a key role in contemporary cultural production as a link between government organizations and civil society[5].The Elephant Temple Fair showcases four distinctive features in its selection of intangible cultural heritage (ICH) projects. single locality. These projects span various fields, including traditional handicrafts, folk music and dance, and traditional dramas. This diversity not only displays Henan's rich cultural heritage but also allows visitors to experience the charm of various ICH cultures in one fair. cultural heritage but also allows visitors to experience the charm of various ICH cultures in one fair. Secondly, The Elephant Temple Fair emphasizes interactivity and experiential engagement. The presentation of ICH projects at the fair goes beyond static displays, prioritizing engagement of visitors. They are able to hands-on experience paper-cutting, clay sculpting and other ancient handicrafts, through which they deeply appreciate the essence of ICH culture. This interactive mode of presentation enables visitors to gain a deeper understanding and appreciation of ICH culture. Thirdly, the fair incorporates innovative elements. While preserving traditional ICH projects, The Elephant Temple Fair actively explores paths for innovative integration, bringing ICH closer to contemporary life. For example, master clay sculptors not only demonstrate authentic traditional techniques but also skillfully incorporate popular culture symbols from modern anime and films into their creations. By combining traditional ICH elements with modern design, fashionable and practical products can be created, not only attracting more young visitors but also injects new vitality into the inheritance and development of ICH culture. Fourthly, the fair highlights local characteristics. Henan itself has a rich cultural heritage, and the temple fair customs of various cities within the province each have distinctive regional features. The Elephant Temple Fair Firstly, there is a diversity of ICH projects. Compared to other regional temple fair activities, The Elephant Temple Fair brings together numerous ICH projects from across the Henan region rather than focusing on a 3.4 Integration of Technological Elements, Interactivity, and Immersive Experiences Digital technology plays an active role in the construction of urban brand images by enhancing the efficiency of information transmission, increasing interactivity and participation, improving the technological content of the city, providing personalized experiences, and creating an open and transparent urban image[6].The Elephant Temple Fair blends Henan's traditional culture with modern elements by incorporating abundant technological features, enhancing visitor engagement, and creating an immersive environment. This combination offers visitors a feast for the eyes and ears. The fair introduces high-precision drone formations paired with traditional iron flower performances, preserving the visual enjoyment of traditional fireworks while utilizing modern technologies such as drones and cold fireworks to present a more dynamic and three-dimensional effect. By incorporating NPCs (non-player characters) that interact with visitors in real-time, the fair breaks away from the traditional one-way cultural display model, allowing every visitor to proactively enjoy the cultural experience, significantly enhancing interactivity and participation. Traditional festivities, folk dramas, and various performances such as the Majie Book Fair, Puyang Acrobats, Junxian Shehuo, Liyuan Theatre, and the Public Grand Stage highlight Henan's cultural characteristics and create a “most Henan” label for the fair. Additionally, the inclusion of modern cultural forms like the Chinese-style music festival and the fusion of drama with rock music infuses new vitality into traditional culture under the interpretation of modern music. This exemplifies how new technologies, new techniques, and new models in the new era The Elephant Temple Fair has also adopted a social media marketing strategy, the inherent freedom and openness of online communities, along with their interactivity, align with people's desire for a carnivalesque break from the norm and routine. Digital media has given rise to a plethora of internet celebrities and “internet-famous” cities, creating unique images that draw batches of tourists to visit and “check in.”[7] leveraging the Daxiang MCN's network of influencers with millions of followers, resulting in over 1.5 billion total reads. This influence-based marketing approach not only expanded the event's audience but also increased engagement and interaction among the target audience. To further enhance the promotional impact, The Elephant Temple Fair integrated comprehensive media resources, including several official media outlets such as Daxiang News and Mammoth News. This integration reinforced the event's official endorsement and heightened its social influence through preliminary warming-up and in-depth reporting. Such a cross-media promotional strategy ensured comprehensive coverage and precise communication of information. The promotional model of The Elephant Temple Fair characterized by “authoritative opening ceremonies, a content strategy blending culture and commerce, influence-based social media marketing, and integrated cross-media promotion” provides new insights and examples for promoting large-scale cultural events.",
    "In the broad scope of integrated marketing communication, each interaction between users and the “Zhengzhou Daxiang Temple Fair” presents an excellent opportunity for information dissemination and brand philosophy communication. The urban brand is a concentrated expression of a city's core competitiveness, and culture is at the heart of the urban brand. The construction of an urban brand can enhance the city's visibility and reputation, better attract tourists and investment, strengthen social cohesion and sense of belonging, and thereby promote the sustainable development of the city.[8] With the rapid development and transformation of the city, historical and cultural memories of cities are gradually forgotten by the younger generation. In this context, Zhengzhou, Henan Province, has meticulously crafted the “Daxiang Temple Fair” as a brand event, which not only provides a joyful gathering place for citizens and tourists but also serves as a platform for intuitively experiencing and understanding the city's brand. As a cultural feast for Zhengzhou, the Fair showcases a diverse range of activities, including specialty foods from all 18 prefecture-level cities, intangible cultural and Chinese-style music festivals. These activities provide participants with visual, auditory, and gustatory delights as well as allowing them to deeply experience the profound cultural heritage and unique charm of Zhengzhou and even Henan. By successfully integrating culture with marketing, the Fair has made every participant a promoter of the city's brand, further enhancing Zhengzhou's visibility and reputation. To move away from the paths of “street-stall economy” and “ruralization”, temple fairs have evolved to not only be entertaining but also economically beneficial. Booth rentals serve as the primary revenue source for these fairs, providing a stable economic foundation. Additionally, temple fairs attract large numbers of tourists who come to visit and consume, stimulating the growth of surrounding businesses, including retail, dining, lodging, transportation, and tourism. These events also create job opportunities for residents, increasing their income levels. For instance, over an 8-day period, Yuchuan tofu sales exceeded 20,000 pounds, while Kaifeng Ma Xingzhai's Tongzi chicken sales approached 3,000 transactions. Numerous folk artists, vendors, and temple fair enthusiasts traverse the skyscraper-filled financial district, offering residents flexible employment opportunities. Furthermore, The Elephant Temple Fair integrates modern elements such as drones, Xuchang diamonds, and Jun porcelain figurines into traditional temple fair culture and also leverages the cultural appeal of temple fairs to promote commercial brands, enterprise creation and new business opportunities in the market. This fusion of folklore and technology, as well as the synchronization of culture and economy, exemplifies a novel form of mutual barometer, showcasing the city's brand and effectively promoting city branding efforts. The Elephant Temple Fair has significantly enhanced the visibility of Zhengzhou. It is not merely a cultural event but a grand celebration of cultural tourism. By showcasing Henan's rich culture, authentic cuisine, and unique intangible cultural heritage, The Elephant Temple Fair has effectively attracted numerous tourists from home and abroad. These visitors, while enjoying the fair, deeply experience the profound cultural heritage of Zhengzhou and Henan, thereby significantly boosting the recognition of both Henan and Zhengzhou globally. This illustrates the synergy between culture and tourism. A diversified media promotion strategy is another key factor in the success of The Elephant Temple Fair. From traditional media outlets to emerging social media platforms, the event has received extensive coverage, with over 1.5 billion views across mass media. This cross-media promotional approach has not only increased the event's visibility but also significantly enhanced Zhengzhou's exposure and recognition. The widespread dissemination has rapidly increased the Fair's online presence, sparking a strong interest in Zhengzhou's temple fair culture among more tourists, thereby indirectly boosting the city's online visibility while also attracting more potential Traditional festival events usually revolve around specific historical events or legends, but with the diversification of tourism demands, the content of festival events is also continuously expanding and enriching. Nowadays, tourism destinations are increasingly aware of the importance of integrating local history, culture, and natural environment into festival events, thereby creating more diverse festival content to meet the needs of different tourists and provide a richer experience [10]. Urban brand image design plays an increasingly important role in contemporary society. It not only shapes the city's visual identification system but also centrally displays the city's culture, values, and spiritual outlook.[9] Hosting cultural activities that residents find appealing can serve as a cultural The Elephant Temple Fair not only provides a rich cultural feast for the citizens of Zhengzhou and tourists but also promotes the dissemination of Zhengzhou's urban cultural characteristics at a deeper level. By showcasing traditional Henan culture and local delicacies from various cities, as well as intangible cultural heritage creations, The Elephant Temple Fair has constructed a high-quality platform specifically for cultural dissemination in Zhengzhou. Through this form of temple fair, it enhances outsiders' understanding and recognition of Zhengzhou's urban cultural heritage. The organization of The Elephant Temple Fair reinforces its people's cultural identity and sense of belonging. Various folk performances, intangible cultural heritage exhibitions, and other activities set up during the temple fair allow participants not only to experience firsthand the traditional culture of Henan and Zhengzhou but also to stimulate their interest and love for these cultures. This strengthening of cultural identity contributes to boosting the cultural confidence of Zhengzhou citizens while also making the city's cultural characteristics more distinct and prominent. Through extensive media coverage, Zhengzhou's cultural characteristics are also disseminated worldwide, in which the organization of The Elephant Temple Fair on the distinctive value and profound impact of festival activities in urban brand development. Nevertheless, city branding is a long-term and complex process that requires sustained efforts and innovation. The successful organization of The Elephant Temple Fair offers invaluable insights into effective city branding. It underscores the imperative to delve deeply into local cultural resources, emphasizing the fusion of culture and economy as well as the harmonious integration of traditional cultural aspects with contemporary elements, encouraging innovation in festival formats. This approach facilitates the alignment of venue selection, content integration, and design with a comprehensive blend of technology, branding, products, markets, and cultural tourism and fosters the synergistic development of traditional temple fairs and modern technology, thereby maximizing the economic momentum and benefits of temple fairs.",
    "The Elephant Temple Fair integrates both traditional and modern elements, such as drone performances, catering to the needs of visitors of different age groups. This enhances the attractiveness of Zhengzhou to the outside world, generating significant interest in this city among a wider audience. Serving as a successful urban marketing endeavor, The Elephant Temple Fair not only displays Zhengzhou's rich cultural and touristic resources but also presents an image of an open, inclusive, and vibrant city to the world. This strengthens Zhengzhou's competitiveness in attracting talents, investments, and international cooperation, laying a solid foundation for the hosting of large-scale urban festival activities. This study, through an in-depth analysis of The Elephant Temple Fair in Henan Province, has revealed its positive effects in enhancing urban visibility, disseminating urban cultural characteristics, promoting the development of tourism and related industries, and enhancing the comprehensive attractiveness and competitiveness of the city, which sheds light"
]