[
    "This is an Open Access article, distributed under the terms of the Creative Commons Attribution 4.0 International license, which permits unrestricted re-use, distribution, and reproduction in any medium, provided the original work is properly cited. With the continuous improvement of China’s market economy and the intensification of global integration trends, the relationship between the supply and demand of China’s agricultural products has also undergone significant changes. From the previous short supply to the current oversupply, the sales of agricultural products have become a key factor restricting the development of the Chinese rural economy. Solving the prob- lem of agricultural sales has become the internal driving force to promote the steady development of family farms, which is also the fundamental purpose of this paper. Therefore, this paper makes an empirical analysis of the factors influencing the choice of agricultural products’ sales channels among 170 family farms in Henan Province using a logistic regression model. The results show that selling agricultural products from family farms to consumers, enterprises, and large sales households are the main sales channels, accounting for 17.3%, 15.3%, and 15.2% respectively. The proportion of Internet sales ranks seventh among the eight channels, which has not been widely rec- ognized. The regression results and assumptions are verified. The brand and certifica- tion of family farms’ agricultural products, business form of a farm, and understanding of the Internet have a significant impact on the choice of sales channels. According to the weight of influencing factors, the paper puts forward four suggestions for the selec- tion and innovation in sales channels of family farms’ agricultural products. In the process of the rapid development of modern agriculture, inno- vating agricultural management mechanisms and cultivating family farms play a key role in improving China’s agricultural efficiency and economic benefits. As an effective way to promote agricultural mod- ernization and rural urbanization, a family farm has become the focus of government and society. Through practical research, family farms are suitable for the correct development path of China’s agriculture. The steady development of family farms has very important practical significance for increasing farmers’ income and the healthy develop- ment of agriculture. In recent years, with the advent of the “Internet+” era, the improvement of networks and electronic platforms has pro- vided more choices and introduced innovations to the sales channels of farm products for China’s family farms. The slogan “Internet+” was put forward in 2012, mainly referring to the integration of all indus- tries by using the Internet, especially traditional industries and ag- riculture. In 2018, the No. 1 central document also pointed out that China should enhance the development of rural electric business, pro- mote the modern action of “Internet+” agriculture, support the construction of agricultural product e-commerce platforms and rural e-commerce service stations, and thoroughly implement e-commerce in rural areas. Henan Province is a strong agricultural province in China, and the construction of agricultural in- formatization has always been at the leading level in China. The development of family farms has also made some achievements. However, with the progress of science and technology and the intensification of global integration, the output of family farms’ agricultural products has increased. A large num- ber of foreign agricultural products have poured in, which makes the market competition for Henan agricultural products industry more intense. Due to the accelerated marketization process, the sales channels of agricultural products have changed from a single and traditional marketing channel in the past to a diversified and multi-level marketing model. Not only small farmers, processing enterprises, wholesalers, and retailers rely on the traditional production, supply, and marketing system formed by the production and sales at the market. There are also modern supply chains driven by new retail in- dustries such as supermarkets. At the same time, the prosperity of the Internet provides a new way for the marketing of agricultural products. Facing many sales channels, family farms are difficult to cope with the ever-changing conditions on the agricultural markets. In many cases, farmers choose the mar- keting channels of agricultural products only from the perspective of their interests, and the factors are not comprehensive enough. In this way, the expected effect may not be achieved. The selection of sales channels is very important to ensure a steady development of family farms.",
    "Given the above reasons, through field investigations and interviews, this paper collected data, analyzed marketing knowledge, and found influencing factors. The study gives conclusions and marketing strat- egies, which aim to provide the basis for the selection and innovation of agricultural products’ sales channels by family farms. Such a selection plays an important role and significance in promoting the circulation of agricultural products, steady development of family farms, and enhancing the process of agricultural modernization. At the beginning of the last century, an in-depth study was made on the production and sales of ag- ricultural products in the United States. Analyzing agricultural marketing, the whole circulation and marketing processes of agricultural products after leaving the producer was studied. Participants of the marketing channels, the transportation pro- cess of agricultural products, and the trading links of agricultural products were deeply expounded. Researching the impact of agricultural product sales, Bailey and Hunnicutt (2002) investigated the owners of beef cattle family farms and sales farms in Utah. The study showed that the adequa- cy of information and the openness of the mar- ket have a significant impact on the direct sales of family farms. The degree of market competition, product unsalable risks, and transportation loss- es have a significant impact on farmers’ choice of online sales mode. Berdegue et al. (2006) analyzed pomegranate farmers in Mexico by using a tobit model. The geographical conditions and the num- ber of fixed assets of farmers have a significant impact on whether their pomegranates can enter supermarkets, large enterprises, and other sales channels. Shiimi and Jordan (2011) investigated the sales channels of beef cattle in Namibia and used a probit model to show that transportation, information technology, and market information have a significant impact on the sales mode. It was believed that the restrictive factors of agricultur- al marketing mainly include the quality and safe- ty of agricultural products and after-sales service of agricultural products. Hu (2021) believed that China’s traditional marketing channels of agricul- tural products are changing to modern marketing channels. Investigating the selection of agricultural prod- ucts’ marketing channels is a complex process as there are different factors (e.g. characteristics of family farms and products), and thus there are many methods that can be used. Chen et al. (2014) proposed an analysis and decision-making framework for multi-channel evaluation, which can convert expert opinions into the weight of key criteria according to interaction, and deduce the ranking of marketing channel candidate schemes. Akdoğan et al. (2011) generated a C5.0 decision tree (DT) model through data collection and anal- ysis of marketing data to extract decision rules. Chang and Zhang (2016) used an endogenous switching probability model to deal with the po- tential of members in evaluating the determinants of marketing channel selection. Negi et al. (2018) evaluated the impact of transportation and com- munication networks on Indian farmers’ choice of rice and wheat market channels. Due to different national conditions, Chinese scholars have also conducted corresponding stud- ies on the sales channels of China’s agricultural products. Wu (2009) made an empirical analysis on the factors influencing farmers’ choice of fruit sales channels. It was pointed out that at present, modern procurement channels such as enterpris- es, supermarkets, and professional cooperatives show a significant growth trend. However, tradi- tional channels still occupy the main part of farm- ers’ fruit sales; traditional channels and modern channels can coexist in the market. Yang (2011) concluded that “family farm + fruit supermarket + consumer” is the most ideal grape circulation channel from the perspective of circulation cost and farmers’ profit. From the perspective of circu- lation efficiency, “family farm + agent + wholesale market + daily retailer + consumer” is the most ideal grape circulation channel. Zhang (2014) used an econometric model to analyze the impact of the “company + farmer” model of aquatic fami- ly farms in Henan Province on farmers’ income from freshwater fish farming. According to the ef- fects of different farming models, he believed that the “company + farmer” model can enable farm- ers to obtain better and more comprehensive pro- duction technology services and higher economic benefits. Chen (2013) found that compared with the wholesale market, the sales income of farm- ers through cooperatives or self-production and self-marketing increased significantly by analyz- ing the impact of different production and mar- keting docking methods on the sales income of tea growers.",
    "popularity of the Internet, the marketing channels of agricultural products have become wider. Afuall and Tucci (2001) proposed that all parts of the Internet system should be coordinated and work together, which can bring new opportunities for the development of enterprise marketing. Coe et al. (2004) believe that the Internet provides e-com- merce applications for farmers, making it easier for farmers to obtain information and shop online to promote their products. Kiang et al. (2000) believe that based on the Internet, the complexity of prod- uct customization, supply, logistics, and transac- tion is considered to be an important way to im- prove network marketing. Zhu et al. (2015) believed that enterprises conduct product marketing on the Internet, and Internet products are becoming more and more popular. Li (2012) believed that the on- line marketing of agricultural products is insepa- rable from the branding strategy, and further an offline and online agricultural market should be es- tablished to finally achieve the purpose of improv- ing the sales channel of agricultural products. To sum up the literature review, previous stud- ies provided suggestions for further perspectives, research ideas, and research methods, and laid a theoretical foundation for this study. However, it can also be seen that most of the previous studies start from a macro perspective and do not elabo- rate on the specific factors of sales channels’ se- lection. Many factors are affecting the channel selection. Choosing the correct sales channel can increase the income and promote the development of family farms. Therefore, this study has certain innovative significance and developed the follow- ing hypotheses: nate product information), they will use on- line electronic platforms to sell their products, and they are relatively unlikely to choose oth- er channels. The paper used a logistic regression analysis (a gen- eralized linear regression analysis model). At pres- ent, such an analysis has been widely used in many fields such as statistics, economics, chemistry, etc. The study first put forward the research hypoth- eses and assigned their value; second, the paper constructed the binary logistic model, brought the variables into the model for evaluation, eval- uated the model through SPSS 22.0 measurement software, and got the regression results. The influ- ence coefficient of family farms’ channel selection factors is obtained, which is further discussed and verified. Through logistic regression analysis, the study assessed the weight of variables to under- stand which factors affect family farms in their choice of sales channels, ways to correctly select the sales channels of agricultural products, and provided suggestions for the expansion and inno- vation of agricultural products’ sales channels. Firstly, through combing the existing literature on agricultural sales channels and field interviews, this paper summarized and put forward the factors affecting family farms in their selection of sales channels. These factors mainly include farmers’ characteristics, agricultural products’ character- istics, and family farms’ characteristics. Farmers’ characteristics include age, education, and under- standing of Internet sales. The characteristics of agricultural products include agricultural product sales area, brand, and certification. The character- istics of family farms include the operation form and the operating income. Secondly, the factors influencing the choice of the sales channel are modeled. In this paper, the binary logistic model is used to analyze the selection of ag- ricultural sales channels by family farms. The prob- ability of sales channel selection is expressed by where X is a multi-classification variable, and it is inappropriate to fit only one regression coeffi- cient by logistic regression. Therefore, the original multi-classification variable pX is transformed into multiple dummy variables, and each dummy variable only represents the difference between several levels. In this paper, dummy variables are brought in when estimating the model. The set value of a channel selection in this range is 1, and the value of no channel selection in this range is 0. Each analysis process only deals with one group to estimate whether the impact result is significant in more detail. The specific classification of variables’ codes is shown in Table 1. The data used in this paper are from the survey of 170 family farmers in Henan Province in 2020. A total of 173 questionnaires were distributed and 170 were obtained, including 162 effective ques- tionnaires. The questionnaire response rate is 98.27% and the effective rate is 95.29%. According to the statistical data, most farmers are between 40-49 years old, accounting for 58.9%. Most farm- ers have the education level of junior middle school Note: Green food in China refers to safe and high-quality edible agricultural products and products produced in an excellent ecological environment per the highest food standards.",
    "or below. 50.3% of farmers know about Internet sales. 40.9% of agricultural products are sold in the surrounding areas. 51.2% of family farms have their agricultural product brands. Among the agricultural product certification, 47.5% have a pollution-free certification, 27% – green food cer- tification, and 3.2% – organic food certification. 42.1% of family farms are self-employed business- es, and 34.3% are sole proprietorship enterpris- es. The income of 46.1% of family farms increas- es steadily. The statistical results of variables are shown in Table 2. According to the survey and statistics, the fam- ily farms’ sales channels mainly include enter- prises, online electronic platforms, fair markets, cooperative organizations, professional mar- kets, sales companies, large sales households, and consumers. Among them, consumers, en- terprises, and large sales households are the main sales channels. The sales to consumers account for the largest proportion, 17.3%, main- ly because family farms can sell agricultural products in the surrounding areas using their own human and material resources, with flexi- ble sales and large benefits for farmers, avoiding the expenses spent for middlemen and retailers. The second channel (direct sales to enterprises) accounts for 15.3%. Enterprises usually cooper- ate with family farms in the form of orders, the price and demand are stable, and uncertain fac- tors are reduced. 15.2% of family farms choose to sell their products to large sales households, mainly because this sales method has strong ad- aptability (can be adapted to various agricultur- al products) and is stable. The higher the sales of agricultural products, the better the farm income, which can mobilize the enthusiasm of farmers. In recent years, with the development of Internet technologies, online electronic platforms, as an emerging sales method, have developed rapid- ly. However, few family farms in Henan Province choose this channel, accounting for 9.30%, rank- ing seventh among all sales channels. This result is due to the low popularity of network knowledge among family farmers and poor understanding of Internet sales. There is no deep excavation of the potential of Internet sales (Table 3). Using SPSS 22.0 measurement software, the logis- tic model was estimated. According to the model results, the fitting and explanatory variables pass the statistical test. Some variables have a significant impact on the selection of sales channels for fami- ly farms. The specific impact mode, impact degree, and regression results are shown in Table 4. The results show that the main sales channels for family farms are consumers, enterprises, and large sales households, accounting for 17.3%, 15.3%, and 15.2% respectively. The brand and business form of family farms have a significant impact on the choice of most sales channels. The farmers’ age, education, understanding of Internet sales, the sales area of agricultural products, product certifi- cation, and other factors have a general impact on the choice of sales channels. According to the regression results of the logistic model by SPSS 22.0 measurement software, the hypotheses are discussed and verified. Considering H1, older farmers tend to choose en- terprises and markets as the main sales channels, which is consistent with the theoretical assump- tions. Among the 170 family farms surveyed, 82 chose enterprises. The main reason is that enter- prises offer guarantees and the income is stable. Therefore, the older the farmer, the stronger the dependence on this channel. The farm and the enterprise have formed a certain degree of coop- eration and trust relationship based on the trans- action, which is consistent with the assumptions. The fair market enables farmers to face the mar- ket directly, understand market information, and better guide their production, which is also a sales channel recognized by older farmers. Considering H2, the farmers’ education level did not pass the significance test, and thus has no im- pact on the channel selection, mainly because the sample investigated in this paper could not test the impact of this variable on the channel. Through the study of the existing relevant literature, it is found that farmers with high education levels tend to choose markets. Considering H3, farmers’ understanding of Internet sales has a certain impact on the choice of enterprises, fair market, and cooperative organ- izations as main sales channels. The regression co- efficients of the three items are negative. It shows that the more farmers know about the Internet sales, the less likely they are to choose enterpris- es, fair markets, and cooperative organizations as sales channels, which is consistent with the theo- retical assumptions. The reason is that if farmers know about Internet sales, they will be more will- ing to choose the internet-based online electronic platforms for sales to strengthen the scope of pub- licity, transmit more product information, reduce agency fees at all levels, and save costs.",
    "Considering H4, the sales area of agricultural prod- ucts has the most significant impact on the choice of enterprises and cooperative organizations as main sales channels. The regression coefficients of both variables are positive, indicating that the far- ther the sales area of agricultural products is, the more inclined it is to choose cooperative organ- izations, which is consistent with the theoretical assumptions. This is mainly because cooperative organizations are conducive to solving the contra- diction between “small farmers” and “big market”, reducing risks, centralizing scattered agricultural products, and making it possible to reprocess and realize value-added agricultural products. If farm- ers want to sell agricultural products further and radiate a wider range, a cooperative organization is a better choice. Farms selling agricultural prod- ucts in the city will also choose enterprises, which can help to avoid risks effectively. the regression coefficients of enterprises, coopera- tive organizations, and large sales households are negative, and the regression coefficients of online electronic platforms and consumers are positive. It shows that farms with branded agricultural prod- ucts are more likely to sell to consumers on online electronic platforms, and are less likely to choose other sales channels, which is consistent with the theoretical assumptions. Establishing a brand for a family farm is the extension of the quality of ag- ricultural products and their intangible benefits. It plays a very important role in the development of family farms and product sales. Therefore, sell- ing branded agricultural products through online electronic platforms can improve the popularity of the farm and expand its market share. Brands can better convey information to consumers, establish their uniqueness in the eyes of consumers, and bet- ter meet their needs. Branded agricultural products can also obtain greater benefits through direct sales. Considering H6, product certification has an im- pact on enterprises, markets, and cooperative organizations. The regression coefficients of en- terprises and cooperative organizations are posi- tive, and the regression coefficient of the market is negative. This shows that farms with certified agricultural products are more willing to choose enterprises and cooperative organizations, which contradicts the theoretical assumptions. This is mainly because enterprises and cooperative or- ganizations pay more attention to the quality and value of medium-sized agricultural products. Farms will be more willing to cooperate with en- terprises and cooperative organizations, which is conducive to product sales. Considering H7, family farms operating in the form of a company system tend to be more pop- ular for enterprises and markets that purchase their products and sell to consumers. Since a com- pany is a legal entity, it can obtain more resourc- es and will choose channels with stable and high income. The partnership family farm will choose to sell in the market rather than directly to con- sumers, which is consistent with the theoretical assumptions. sales households, but less likely to choose cooper- ative organizations. The reason is that large sales households can sell different agricultural products offering good stability. Family farms of sole pro- prietorship enterprises are generally small in scale, with loose establishment conditions and flexible access to or exit from the market, so they are more willing to sell to large sales households. In terms of family farmers’ characteristics, the age of family farmers has an impact on the choice of enterprises and markets; the older the farmer, the greater the impact on the choice of these channels. In terms of farms’ characteristics, the business form has no great impact on the online electron- ic platforms and has a significant impact on the choice of enterprises, fair markets, cooperative organizations, large sales households, and con- sumers. The regression coefficients of enterpris- es, cooperative organizations, and consumers are negative, while others are positive. The operating income of family farms has no significant impact on the choice of agricultural sales channels. A de- scription is not the main influencing factor. Based on the obtained results and analysis of rea- sons, several suggestions are put forward for the innovation and selection of agricultural sales channels. First, it is necessary to improve the cultural quality of farmers and carry out special train- ing. At present, family farmers in China are mainly people with a low average level of edu- cation, lack of theoretical knowledge on oper- ation and management, who rely more on ex- perience. Improving farmers’ cultural quali- ty is an objective requirement for promoting agricultural industrialization and developing modern agriculture. There is an urgent need for farmers to obtain new agricultural knowledge and skills as an effective measure to adjust the agricultural structure and promote production and income. To use the Internet sales, family farmers must master certain skills in Internet- related fields and be able to use the Internet to manage the production and operation activities. Governments at all levels attach great impor- tance to the training of new professional farm- ers, innovation of working ideas, and introduc- tion of effective measures. Therefore, it is vital to improve farmers’ academic qualifications, so as to continuously improve the level and sys- tematization of farmers’ education and training.",
    "Secondly, family farms should strengthen brand development in multiple directions. A brand is not only the main symbol that distinguishes some products from other competitive products but also a value concept and spiritual symbol, as well as an important embodiment of the core value of prod- ucts. Under the current background of agricultur- al industrialization, the competition for agricul- tural products is intense. If family farms want to stabilize and stand out in the completely compet- itive market of agricultural products, the most ef- fective way is to build their brands. Family farms should mainly establish brand awareness, fully re- alize the important role of brand building in mar- ket competition, actively learn and understand the knowledge related to brand building, improve their own products’ quality, and actively seek help from the government or relevant professionals. As for the advantages and characteristics of branded products, farmers need to select the appropriate target market and determine a brand positioning that not only meets the consumer demand but al- so has its unique characteristics. At the same time, a good job in the publicity and promotion of ag- ricultural brands is required, additionally to the expansion of the brand influence through direct sales, network marketing, agricultural products exhibition, and other channels. Thirdly, family farms should expand their sales channels and use the “Internet+” to achieve higher performance and better marketing through mo- bile e-commerce. In recent years, the new mod- ern marketing format has gradually set foot in the field of agricultural product sales and launched a fierce competition with the traditional direct sales, which makes family farms face great challenges. Farmers lack the right to speak in the market com- petition and can not effectively resist the reality of market risks. Family farms can take advantage of the Internet, cooperate with e-commerce, sign agreements with logistics enterprises and pay- ment platforms, and create a new model of online direct sales of agricultural products. By using the “Internet+”, the information can be transmitted quickly and directly between the two sides, elimi- nating unnecessary intermediate links, improving the efficiency of network marketing, reducing the marketing cost, and improving the circulation ef- ficiency of agricultural products. It can not only guarantee the quality of agricultural products but also make the two sides of the supply and demand get tangible benefits. Finally, agricultural modernization needs a lot of financial support. Government should increase agricultural subsidies and tilt special funds to family farms. They should speed up the improve- ment of the new agricultural social service sys- tem, timely release agricultural production infor- mation to family farmers through Internet plat- forms, and regularly train farmers to effectively improve their business activities and ability to ap- ply Internet technologies. In addition, the govern- ment should give full play to its role, strengthen the brand construction and publicity of agricul- tural products, actively promote projects such as “docking between farmers and supermarkets” and rural e-commerce, innovate the sales channels of agricultural products, and promote the sales of such products. Under the background of “Internet+”, there are many choices of the sales channels to distribute agricul- tural products of Henan family farms. Therefore, this paper assessed the current situation with the sales channels among Henan family farms, collated and analyzed the data through SPSS 22.0 measurement software evaluating the logistic model and verifying the hypotheses. It is concluded that certification, brand, and business form of family farms have an obvious impact on their sales channels. According to statistical data, among the agricultural products’ marketing channels of Henan family farm, the tradi- tional spot trading channel is still the mainstream channel. Among all eight sales channels, the Internet channel accounts for 9.40%, ranking seventh. Given the above results, this paper argues that under the background of “Internet+”, the selection and innovation of sales channels by family farms in Henan is not perfect enough. Especially it concerns net- work platforms as possible sales channels due to the factors of consciousness, poor facilities, and envi- ronment; thus, there is no perfect ability to tap the potential of the Internet. At the same time, with the abundance of materials, people have gradually changed from “full eating” to “good eating” and “healthy eating”. Agricultural products became trendy, building their brands and obtaining certifications, and occupy a great advantage in sales. Family farms still need to make efforts to strengthen their brand cre- ation and certification of agricultural products.",
    "However, the paper has some limitations. Due to China’s vast territory, it is not possible to conduct interviews throughout the whole country. Future studies can expand the scope of the investigation to identify problems and deficiencies in China’s agricultural sales channels, conduct in-depth analysis on optimizing agricultural marketing channels at the macro and micro levels. In addition, further studies can build a scientifically perfect research theoretical system, so that the sales channel system, channel structure, and main organization of agricultural products can achieve innovation and breakthroughs. Conceptualization: Lichen Niu, Oleksandr V. Nazarenko. Data curation: Lichen Niu, Oleksandr V. Nazarenko, Junmin Chen, Zetao Hu. Formal analysis: Lichen Niu, Oleksandr V. Nazarenko, Junmin Chen. Funding acquisition: Lichen Niu. Investigation: Lichen Niu, Zetao Hu. Methodology: Lichen Niu, Oleksandr V. Nazarenko, Junmin Chen, Zetao Hu. Project administration: Oleksandr V. Nazarenko, Junmin Chen. Resources: Lichen Niu, Oleksandr V. Nazarenko, Zetao Hu. Software: Lichen Niu. Supervision: Oleksandr V. Nazarenko. Validation: Oleksandr V. Nazarenko. Writing – original draft: Lichen Niu. Writing – review & editing: Lichen Niu."
]