[
    "inevitable trend to meet the needs of modern economic development and promote rural revitalization. Rural industrial convergence, defined as the integration of agricultural production with secondary and tertiary industries to form new formats, is a critical pathway for achieving this goal. Since 2014, China’s central policies have consistently emphasized the importance of rural industrial convergence, highlighting its role in enhancing agricultural value chains and fostering sustainable rural development. As a traditional agricultural province, Henan possesses favorable conditions for agricultural production, yet challenges such as low convergence efficiency, inadequate mechanisms, and regional disparities persist. This study evaluates the performance and identifies the obstacles to rural industrial convergence in Henan Province from 2013 to 2022. By constructing an evaluation system based on three industrial dimensions (primary, secondary, and tertiary), the research employs the entropy weight method, coupling coordination degree model, and obstacle degree model to analyze data from statistical yearbooks. Findings reveal that Henan’s rural industrial convergence has shown steady progress, with the coupling coordination degree improving from “severe imbalance” (0.168 in 2013) to “high-quality coordination” (0.955 in 2022). However, the tertiary industry remains the primary bottleneck (obstacle degree: 3.609), followed by the secondary (3.309) and primary industries (3.082). Key obstacles include imbalanced service sector development, insufficient industrial innovation, and weak farmer participation. Guided by the Actor-Network Theory (ANT), the study further examines the integration mechanism, identifying human actors (e.g., farmers, governments, enterprises) and non-human actors (e.g., technology, policies, markets) in the convergence process. The ANT framework reveals how these actors interact through problematization, interest allocation, enrollment, mobilization, and dissent resolution, shaping the dynamic network of rural industrial convergence. To address these challenges, differentiated pathways are proposed: (1) strengthening policy guidance and village-specific planning; (2) enhancing farmer participation and capacity-building; (3) attracting innovative entities to diversify industrial integration; and (4) improving benefit-sharing mechanisms to stabilize actor networks. The study concludes that overcoming institutional, technological, and market barriers is essential for deepening rural industrial convergence in Henan, offering theoretical and practical insights for achieving rural revitalization and sustainable development. In the new era, rural revitalization has become a national strategic priority in China, aiming to transform traditional agrarian structures and bridge the urban-rural divide. A critical component of this strategy is the integrated development of primary (agriculture), secondary (processing, manufacturing), and tertiary (services, tourism) rural industries. This integration seeks to enhance agricultural value chains, diversify rural economies, and improve rural livelihoods. While significant progress has been made nationwide, the pathways and challenges to effective rural industrial integration vary considerably across regions. Henan Province, as a major agricultural hub, presents a compelling case study for understanding these dynamics. Despite policy impetus, the practical implementation of rural industrial integration often faces complex challenges, including fragmented industrial chains, insufficient investment, talent shortages, and uncoordinated governance. Existing research primarily focuses on quantitative assessments of integration levels or economic benefits. However, there is a relative scarcity of studies that deeply investigate the specific obstacles hindering integration and the socio-technical mechanisms through which processes unfold. This research aims to fill this gap by not only quantifying the integration status and identifying bottlenecks but also by applying Actor-Network Theory (ANT) to unravel the intricate relational dynamics that shape the integration process. these The objective of this paper is threefold: (1) to quantitatively assess the development level and coupling coordination of rural industrial integration in Henan Province from 2013 to 2022; (2) to identify and analyze the primary obstacles hindering this integration using an obstacle degree model; and (3) to qualitatively explore the underlying mechanisms of integration and transformation through the lens of Actor- Network Theory, illuminating the roles and interactions of various human and non-human actors. Ultimately, this study seeks to provide actionable insights for policymakers and stakeholders to foster more effective and sustainable rural industrial integration in Henan and similar regions. The concept of rural industrial integration was first proposed by Professor Narachen Imamura of the University of Tokyo (1996), who proposed the concept of \"six times\". The industrialization theory advocates that agricultural development should not be limited to internal factors, but should also integrate the secondary and tertiary industries to inject new vitality into agricultural development. Zhang Lin et al. (2021) believe that the integrated development of rural industries refers to the premise of agricultural development, Bring the new formats and interest linkage mechanisms of the secondary and tertiary industries into their horizontal and vertical integration and spatial expansion, and apply them to agriculture.",
    "The process of aggregating multiple factors in the industrial production process, resulting in the emergence of new modes of production. Ren Peng (2022) believes that the integration of the primary, secondary, and tertiary industries in rural areas is the use of rural areas as spatial carriers, relying on agricultural production, and characterized by the mutual infiltration and organic reorganization of the primary, secondary, and tertiary industries. The Book of Changes (2022) believes that the integration of rural tertiary industries represents the gathering of different agricultural entities based on technology, factors, and interests, breaking down industrial barriers guided by the market, and forming a new agricultural pattern with multiple functions, new formats, and a complete industrial chain. In the extensive research on industrial integration and coupling, multiple scholars have constructed multidimensional analytical frameworks from different perspectives. The focus of academic research on the coupling of industrial integration varies. In the research on promoting the integration of rural tertiary industry through agricultural productive services, such as Yang Xue, a comprehensive and in-depth analysis framework was constructed from three core dimensions: breadth (i.e. the scope of industries participating in the integration), depth (degree and closeness of integration), and quality (integration effect and benefit). The coordination role of agricultural productive services in the process of rural tertiary industry integration was accurately calculated, providing important reference for understanding the integration mechanism; In empirical research on the coupling development of the cultural and tourism industry, scholars such as Fang Zhong emphasized industrial correlation as the core driving force of the coupling process, revealing that as the degree of coupling deepens, the boundaries between different industries gradually blur, ultimately leading to advanced forms of industrial integration. This discovery not only enriches the theory of industrial coupling, but also provides valuable insights for understanding the phenomenon of industrial integration in a wider range of fields [8]; Xue Lei and others took a different approach, focusing on the phenomenon of agricultural industry agglomeration. By constructing a four-dimensional indicator system that includes agglomeration intensity, agricultural specialization level, employment concentration trend, and industrial product quality optimization, production efficiency improvement, and ecological environment protection, advanced coupling coordination degree models were used to systematically evaluate the synergistic evolution relationship between agricultural industry agglomeration and green development models, providing a new perspective for the sustainable development path of agriculture [9]. Entropy Method: This objective weighting method was used to determine the weights of the selected indicators, avoiding subjective biases and reflecting the actual information content of the data. Coupling Coordination Degree Model: This model measures the interaction and coordination level between the primary, secondary, and tertiary industries. It assesses both the “coupling” (degree of interaction) and “coordination” (level of synergy) to provide a holistic view of integration development, categorizing it into levels ranging from “severe imbalance” to “high-quality coordination.” Obstacle Degree Model: This model identifies the key factors hindering integration by calculating the “obstacle degree” for each indicator. It allows for pinpointing the most significant bottlenecks that require targeted interventions. The formula for obstacle degree typically involves factor contribution, indicator deviation, and indicator weight. Qualitative Framework: Actor-Network Theory (ANT): To understand the mechanisms of integration beyond quantitative measures, ANT was employed as a conceptual lens. The quantitative analysis using the Coupling Coordination Degree model reveals a consistent upward trend in Henan Province’s rural industrial integration from 2013 to 2022. The coupling coordination level significantly improved from a state of “severe imbalance” in the initial years (e.g., 2013) to reaching “high-quality coordination” by 2022. This indicates a general positive trajectory and increasing synergy among the primary, secondary, and tertiary rural industries. Tertiary Industry: Demonstrated a steady increase in its contribution and development level, indicative of growing rural tourism, e-commerce, and service sectors. Secondary Industry: Experienced noticeable fluctuations and relatively slower growth compared to the other two sectors. This suggests challenges in rural industrial processing, manufacturing, and value-added activities, potentially due to investment gaps, technological limitations, or market access issues. Tertiary Industry as Primary Obstacle: Despite its steady growth, specific indicators within the tertiary industry, particularly employment level and related human capital aspects (skills, training opportunities), consistently emerged as the most significant limiting factors. This suggests a shortage of skilled labor, inadequate professional services, or limited attractive employment opportunities in rural tertiary sectors, hindering their full potential.",
    "Secondary Industry as Secondary Obstacle: The fluctuating performance of the secondary industry translates into its being the second most prominent obstacle. Issues such as insufficient processing capacity, lack of advanced manufacturing technologies, and inadequate investment in rural industrial parks contribute to this bottleneck. The application of ANT revealed that rural industrial integration is not a simple linear process but a complex network of “translations” among diverse actors: Problematization: The shared problem of “low agricultural value” or “farmer income stagnation” initially brought actors together. Local governments played a crucial role in framing this problem and proposing “industrial integration” as a solution. Interessement: Various policies (e.g., subsidies for agricultural processing, rural tourism development plans, land transfer incentives) served as “interessement devices” to attract enterprises, investors, and even motivate farmers to participate. Enterprises were interested in new market opportunities, while farmers sought higher incomes. Enrollment: Formal agreements (contracts between farmers and processing plants), policy mandates, and the establishment of cooperatives or industry associations were key to “enrolling” actors into specific integration projects. Technologies (e.g., cold chain logistics, e-commerce platforms) also enrolled actors by changing their work processes and market access. Mobilization: Successful integration initiatives demonstrated the “mobilization” of resources (financial, human, technical) within established networks. For instance, the collaboration between local government, agricultural cooperatives, and tourism enterprises to develop an integrated agri-tourism complex. Dissidence: Instances of “dissidence” were observed, such as farmers’ resistance to contract farming due to perceived unfair prices, or enterprises withdrawing due to high investment risks or market volatility. These moments highlighted the fragility of networks and the need for continuous negotiation and adaptation. The identified bottlenecks (e.g., tertiary industry employment) can be seen as persistent areas of “dissidence” where the network struggles to effectively enroll and mobilize specific resources or actors. The finding that Henan’s rural industrial integration has progressed to a “high-quality coordination” level is encouraging, reflecting successful policy implementation and increasing cross-sectoral collaboration. This aggregate improvement, however, masks underlying structural weaknesses. The persistent identification of the tertiary industry’s employment dimension as the primary bottleneck is a crucial insight. It suggests that while services and tourism are expanding, the rural areas struggle to retain or attract the necessary human capital, skills, and professional services due to rural-urban migration, lack of attractive job prospects, insufficient vocational training, or inadequate rural infrastructure to support a skilled workforce. Addressing this requires targeted investment in rural education, skill development programs, and creating more appealing living and working environments. The secondary industry’s fluctuating performance and its role as a significant obstacle point to the need for more robust industrial policies. This includes attracting high-quality processing and manufacturing enterprises, facilitating technology transfer, improving access to finance for rural businesses, and strengthening regional industrial clusters. The application of ANT provides a deeper understanding of why these obstacles persist and how integration either succeeds or falters. It demonstrates that integration is not merely about economic linkages but about the successful “translation” of diverse interests into a cohesive network. The identified bottlenecks represent points where the translation process is incomplete or problematic. For instance, if rural youth are not “interested” in tertiary sector jobs due to low pay or poor conditions, they won’t be “enrolled” into that part of the network, leading to the employment bottleneck. Effective integration mechanisms therefore require active facilitation by “translators” (often government or leading enterprises) who can mediate interests, build trust, and continuously adapt the network to external changes and internal dissidence. This highlights the importance of not just what policies are implemented, but how they are implemented to build and sustain robust actor networks."
]