[
    "Abstract: Affected by the prolonged impact of the new crown epidemic, the domestic economy is under tremendous downward pressure, the employment situation is becoming more and more serious, the increase and creation of jobs need to resort to the established model, on which to help improve people's livelihoods, effectively increase incomes, and safeguard the basic requirements of life. The stall economy can alleviate employment pressure to a certain extent in the post epidemic era. In the majority of grassroots areas, the \"stall economy\" has a broader space for activities, but at the same time will give the grassroots areas within the limited number of managers to bring the corresponding burden, the contradiction between the two need to re- examine and think again, through the G County stall economic governance of the status of the field survey found that the G County stall economic governance Through a field survey of the economic governance of street stalls in County G, it was found that there were problems such as the lack of significant policy effects, the absence of citizen self-organization, and the inadequacy of the coordination mechanism between the government and the citizen self-organization, etc. We analyzed the situation from the perspective of multiple subjective dimensions, and searched for effective measures that could help normalize the \"street stalls\" of the ordinary residents of County G, and achieve the coordination of the goals of individual freedom of operation and order management. Ground stall economy refers to a form of economy formed by obtaining a source of income through setting up ground stalls[1] . In 2020, the Premier of the State Council said that \"the ground stall economy is the fireworks of the human world, and the driving force of economic development\", and from time to time, China has taken an affirmative attitude towards the ground stall economy in the vast grass-roots areas, but the development of the ground stall economy tends to bring about chaos and disorder, which is a contradiction between economic development and urban management. The hidden problem behind the two is the contradiction between economic development and urban management. From the perspective of the theory of multi-subject governance, how to promote economic development while transforming the stall economy from disorder to order and entering the benign track of urban management is the main concern of this paper. business conditions of free-standing individuals, in particular, at the township level within a small 10-kilometer radius. At the same time, we also conducted detailed interviews and surveys on the management methods and measures of \"ground stalls\" within a small area of 10 kilometers, especially on the process of \"chasing\" and \"hiding\" of free- standing individuals, as well as on the business conditions in the past month (from late January to mid- to late February). The survey was conducted in two opposite directions, \"perceived from the outside\" and \"learned from the inside\", in order to obtain inspirational countermeasures for the future development of the \"stall economy\" in the grassroots areas and for the continuous improvement of the grassroots' order maintenance and management. We will also seek to obtain insightful countermeasures for the future development of the street vendor economy in grass-roots areas and for the continuous improvement of grass-roots order maintenance management. In China, the street vendor economy has gone through almost 5,000 years of dynastic changes and commercial transformations, and its cultural heritage is extremely profound. Although the social status of vendors is low most of the time, they are an indispensable link in the flow of goods and even in the process of economic development, and a direct reflection of social prosperity. In addition to information acquisition and collection through press activities and public announcements in relation to attitudinal measures in the neighboring counties within a radius of 60 kilometers from 2019 to March 2022, we also conducted detailed interviews and surveys on management of \"ground stalls\", remedial measures, and the the March 19, 2020, the county urban area comprehensive management law enforcement brigade law enforcement staff has to Changsheng Street, string Hill Road North for comprehensive management, focusing on rectification of vendors illegally occupying the road stalls, vehicles illegally parked phenomenon in the law enforcement site, the staff of the occupying business behavior to discourage, assist in the removal of vendors privately erected awnings, and according to the law of the illegal parking of vehicles to deal with. The above administrative enforcement measures can produce the effect of maintaining community order and optimizing the public environment in a very short period of time, At the same time, it is also very obvious to see the objective \"rejection\" and subjective \"crowding out\" of the relevant retail stalls. Therefore, there is a contradiction between the maintenance of environmental order and the small-scale commercial define clearly. In accordance with the national guiding ideology of economic development, in order to restore economic and social order, to meet the needs of the masses to play a positive role in life, in line with the \"convenient for the public, rational layout, fixed-point time limit, stalls away from the net\" principle, without affecting the urban traffic and amenity order on the premise of the county decided from June 5, 2020 until September 30, 2020 in the urban area to designate seven temporary stalls to ease the point, and through the official documents in the form of notification. Before and after the different time periods within the stall commercial activities policy, both the rationality of the Shunyi, there are details of the conflict, the requirements of different subjects are also in practice, which requires the cooperation of the main body of the multi-party and the integration of their respective mechanisms, the next will be from the case of the process of the details of the problem and the reality of the difficulties faced by the different subjects as well as new breakthroughs in the work of the beginning, focusing on finding a new stage, the face of special circumstances, the \"ground stalls\" under the new stage. In the next section, we will start from the details of the case and the real difficulties and new work breakthroughs faced by different subjects, and try to find the \"joint\" between the management of the order of \"stall economy\" and the implementation of the local economic policy under the new stage and in the face of the special situation, as well as to solve the contradictions and thorny problems of the different subjects' standpoints on facing the common problems.",
    "At present, G County stalls are mainly concentrated in the East Pai Fang Road and the East Third Ring Road intersection, the main street eighty-first intersection to the Jiulong intersection section of the seven, but in the Changsheng Street and the string of North Mountain Road and so on the phenomenon of mobile vendors along the street stalls have a new rise in the urban law enforcement team and the vendors are still staged between the \"you chased me to catch up with the\" play from the perspective of the theory of multi- subjective cooperation in the governance. From perspective of the theory of multi-body cooperative governance,[2] the following problems exist in the current situation of economic governance of street stalls in County G: the The above administrative enforcement measures can produce the effect of maintaining community order and optimizing the public environment in a very short time, but these measures will reduce the interests of the mobile vendor groups to a certain extent, and to a certain extent will make the mobile vendors as well as the consumers to the County G's policy on the mobile vendors to produce a crisis of acceptance, resulting in the phenomenon of \"where there is a policy at the top, there is a policy below\". The phenomenon of \"where there is a policy at the top, there is a countermeasure at the bottom\" will result. The reasons for this psychology and phenomenon are mainly as follows. On the one hand, for itinerant vendors, it takes them some time to adapt to the new business environment and meet the new customer expectations when they move their stalls from their original business places to the seven areas designated by the county government of G. At the same time, if the original scattered itinerant vendors are centralized and managed, they will gradually lose their \"mobility\" and develop into something like the \"policy from above, policy from below\" phenomenon. At the same time, if the original scattered mobile vendors are centralized, their \"mobility\" will be gradually lost, and they will gradually develop into fixed trading places similar to \"bazaars\", which will increase the competition among these small operators, and to a certain extent, this will activate the role of the \"stall economy\", but the excessive competition will make some small operators lose their jobs again, which makes it difficult to realize the policy expectations. On the other hand, for consumers, the original itinerant vendors can be found all over the streets and alleys, such as schools, communities and intersections, which gives consumers great convenience, but centralizing the management of the vendors will greatly reduce convenience, and will cause consumers to have a certain identity crisis towards the policy of the county government of G County. this Self-organization of mobile vendors is such as the third sector of the vendors self-governing guilds and so on, at present, the development of China's third sector there are still many imperfections, China's third sector is still lack of independence, and blurred boundaries between government departments; lack of funds and talents and other necessary conditions for the survival and development of the organization; poor norms, autonomy and non-profit-making lack of existence of \" The third sector itself has many deficiencies, not to mention the fact that relevant autonomous groups have not yet been established in County G. Mobile vendors are mostly managed by government departments, and there is a lack of participation in the governance of citizens and mobile vendors with a considerable degree of administrative coloring, making it difficult to break through to the next level. The lack of participation of citizens and multiple subjects in the governance of mobile vendors, with a considerable degree of administrative coloring, makes it difficult to break through the old economic management of stalls and makes it difficult to ensure efficiency and fairness in the practice of vendor governance in County G. the In this regard, the main manifestation is the lack of complete institutional safeguards for the governance of itinerant vendors in County G. The realization of participatory management for itinerant vendors and citizens is still on the way. The entry threshold for the establishment of mobile vendor guilds in China is too high, and the establishment of mobile vendor guilds needs to go through a series of processes, such as registration, application, submission of materials and verification of qualifications, and be approved by the civil affairs department and the department in charge of the business before it can be set up, or else it will be an illegal association. Currently, there is no relevant experience in setting up mobile vendor guilds in County G. Even if the guilds are ready to be set up, it will be difficult to establish mobile vendor guilds if their legal status has not been authorized by the relevant government departments.",
    "From the perspective of government tools, according to the perspective of the mandatory division of government tools, Canadian public policy scholars Hollett and Ramesh divided government tools into mandatory tools, voluntary tools and hybrid tools, then according to this division standard, G County mobile vendor remediation of this public policy belongs to the mandatory tools, then this kind of government tools if you want to obtain the trust and obedience of the relative people, so as to achieve policy If this kind of governmental tool is to gain the trust and obedience of the relative people, so as to achieve the policy goal, then it is necessary to ensure the rationality of the public policy, otherwise it will lead to the inefficiency or even ineffectiveness of the public policy, which will lead to government failure. Itinerant hawkers have existed since ancient times, and their existence must be justified. The existence of mobile vendors, on the one hand, for the residents, all kinds of vendors contain a variety of commodities, not only can bring convenience to the residents, to meet the various needs of people's lives, and for the residents for various reasons due to the lower working ability, and thus can not be engaged in normal labor, engaged in the work of the mobile vendors can be a certain amount of income, to alleviate a certain amount of pressure on their lives; On the other hand, for the government, itinerant vendors can increase jobs and increase gross national income. Regarding the regulation of itinerant vendors in County G, the practice there is to centralize all street vendors in seven locations, which to a certain extent reduces the convenience of residents' lives Generally speaking, the practice of market economy countries in dealing with the relationship between the government and the market, and between the government and the society, can be found that the government plays five roles, namely, the provider of public goods, the regulator of the macro-economy, the maintainer of the market order, the eliminator of externalities, and the redistributor of income and property. With the deepening of China's market economy reform, substantial progress has been made in the transformation of government functions, but the government's role is still characterized by these three deficiencies: the overstepping of the production role, the lack of the provision role, and the misalignment of the arrangement role. In the practice of vendor management in County G, the government's actions are somewhat in line with the performance of the misplaced arrangement role. The government's misplaced role is mainly due to its over- emphasis on government monopoly, and the government's massive monopoly on the provision of public goods and services that could have been provided by the market or society, thus compressing the development space of market forces and social forces. With the deepening of the market economy reform and the continuous improvement of citizens' political literacy, this vertical mode of management is less and Under the threshold of the theory of multi-body cooperative governance, industrial self-government organizations are a very important subject. At present, hawker self-government is quite popular in the international arena, and pilot projects in many parts of the country have been successful, so we can take advantage of the existing experience of mobile hawker self-government to fully explore the potential of various places and promote the self- government of hawkers in a wider scope, so as to make the self-government of hawkers and the management of the normalization of the self-government of hawkers, Institutionalization. In China, the establishment and operation of the autonomous organization of vendors is affected by the current administrative system and its reform process, which is very prone to bureaucratic problems, and is also vulnerable to the great resistance brought about by the reform of the administrative system. Currently, China's constitution and laws have strict restrictions on the freedom of civil association, making it difficult for vendors' self-organization to be established and for citizens to participate in it, which is precisely one of the problems in the vendor management practice in County G. Although the practice of concentrating all mobile vendors in seven square cities in County G can achieve certain results by relying on mandatory means, the indicators for measuring government performance are not only quantitative indicators, but also indicators of citizen satisfaction, which are not the only ones. Although County G's move, in response to Premier Li Keqiang's call, caused a lot of controversy in County G at the time, citizen self- organization - the Hawker Autonomous Association - is indispensable in order to increase citizen satisfaction with this activity.",
    "As the degree of political democratization in China continues to deepen, the public's awareness of public supervision in China has been strengthened, but the effect of public participation has not been satisfactory because of the lack of institutional safeguards. [3]It is manifested in many aspects, \"there is a policy from above, there is a policy from below\", for the orders and instructions of superiors, there are some public administrators on the surface of the promise, but in fact have \"economic man\" like self-interested motives, disregard for the public interest and do some illegal and disorderly behavior. Some public administrators appear to be asking the public for advice, but in reality they are only talking on paper and have not even communicated with the public, which has led to a significant reduction in the public's enthusiasm for participation in public affairs. Even incidents such as the one in Kaifeng in August 2020, in which four city police officers beat a vegetable shopper on the street and dropped her in their arms[4] have occurred from time to time. The result of these problems is that the public has become the master of the country on the surface, contributing to the development of the country, but in reality it is in a state of denial, which is the so-called \"carrot and stick\" approach, giving public resources to its supporters, but at the expense of Citizens play an important role in the model of multi- subject cooperation network, and public participation is also a proper meaning of modern democratic politics. In the context of China, public participation is manifested in citizens' participation in politics in accordance with the law, which is a collective term for the participation in the political life of the country by all democratic parties and personages without party affiliation other than the Communist Party of China (CPC). Citizens' participation in politics can help the Party and the government identify important issues in social life, give full play to the people's intelligence and wisdom to make suggestions for the construction and development of the country, and supervise the decisions and behaviors of the Party and the government. However, in the current situation, although the degree of public participation in public affairs is increasing, it is still at a relatively low level. The reason for this can be considered in two aspects, on the one hand, the public's awareness of participation in public affairs is not high enough, some people are constrained by their own ability, and some people have the mentality of \"not caring about their own affairs, hanging up\"; on the other hand, the current public participation channels are not smooth enough, and the number of participation channels as well as the degree of smoothness determines the depth of public participation. The number and smoothness of the channels determine the depth of public participation. In the case of County G, the public policy on the management of vendors is mainly made by the government of County G and implemented by the urban management and law enforcement brigade, in which citizens are less involved in the formulation and implementation of the public policy, and the channels for supervision are not smooth enough in the monitoring phase of the policy, which is the reason for the low degree of citizens' participation in the management of vendors in County G. At the same time, mobile vendors as one of the main subjects of the economic governance of stalls should follow the market order and public order, vendors in the operation will inevitably involve the occupation of public resources such as road resources, and the application of road resources involves static use and dynamic use of two aspects[5] , vendors need to carry out business activities within the demarcated public space on the one hand, and on the other hand in the process of mobility In response to the above mentioned unreasonable aspects of County G's regulation policy on itinerant vendors, this paper argues that a sound policy research organization should be established, especially a think tank or a think tank, which is a modern, comprehensive and interdisciplinary policy research organization composed of various experts and scholars to address specific social issues in line with the connotation of the theory of cooperative network governance. The role of a modern think tank is not only limited to providing policy information and policy proposals for government organizations, focusing only on solving current walks of life, such as popular education for citizens, and it can also act as a third-party performance evaluation agency, using think tanks to carry out the government's performance evaluation to avoid subjective bias brought about by self- assessment of the government departments, and even to make the members of the think tank join the government, so that the members of the think tank can be involved in the government. The use of think tanks to conduct government performance evaluation can avoid the subjective bias of government departments due to self-assessment, and can even make the members of think tanks join the government and make think tanks become the talent reserve organizations of government departments, which on one hand can improve the efficiency of government agencies and inject fresh blood into them, and on the other hand can make the research results of the researchers directly serve for the formulation of public policies, which is perhaps the biggest impact that think tanks can have on the government. In the case of County G, although the cleanliness of the city and the mobility of the vendors are not mutually exclusive, it is important to gain the trust of the people, listen to the opinions of professional policy research organizations, or use the socialization means of the new government tools to improve the scientific, democratic and rule of law degree of the public policy before making the policy.",
    "In response to the above-mentioned misalignment of roles in the G-county arrangement, there are three directions of solution: first, the Government will leave the goods and services that can be provided by society and the market to be provided by society and the market, with the government process but with the necessary function of provision. Currently China is carrying out the negative list system and power list system and other list governance model reform is its typical performance, the government only to a few key public affairs management authority to make requirements, and for other public affairs, the principle of \"no law can be prohibited can be,\" this approach will be able to greatly mobilize social and market forces, and thus achieve or enhance the public interest. This approach will be able to greatly mobilize the social and market forces, so as to achieve or enhance the public interest, for example, can be given to the city comprehensive law enforcement team to the necessary administrative discretion, while perfecting the operation of the power and supervision mechanism, not only to ensure that the city management department as the economic governance of the stalls of the \"meta-main body\", but also be able to fully stimulate the vitality of the stalls of the economy of County G[6] ; Secondly, we should pay attention to introduce Secondly, we should emphasize the introduction of competition mechanism, government expenditure is borne by the state treasury, and the loss incurred does not need to be responsible for the public administrators, therefore, in the past, the government has the problems of inefficiency, and the government agencies and personnel are constantly expanding. Now, in the process of providing public goods and services, the government introduces a competition mechanism similar to the internal market, when there are more than two suppliers of a kind of public goods, which can greatly improve the government's work efficiency; thirdly, it is to increase the customer's right to choose, i.e., to provide a richer range of public services to meet the customer's needs, so as to avoid the government's \"one-word rule\". This can avoid the government's \"one voice\". For County G, it can learn from the successful experience of the above three approaches, reduce the weight of the Government in the governance of vendors, and introduce more market and social forces, so as to make the stall economy regain its former vitality, and thus alleviate the downturn of the domestic economy and the pressure on employment. economy reform, the reform of China's administrative examination and approval system is deepening, the list management mode is being explored, and the industrial and commercial registration and management system deepening, all of which provide a fertile ground for the establishment and development of the third sector, such as trade associations. On the other hand, the establishment of hawker trade associations has great significance, it can be a reasonable and efficient allocation of social resources, as a new third sector, it will be a great enterprising spirit and efficient service to establish its image, in exchange for a greater space for development; it can also make up for the market failure and the government's failure for management of hawkers, if the government to manage, will lead to arbitrary and arbitrary powers, policies, unreasonable, and even damage the government's ability to manage hawkers. If there is only the invisible hand of the market to promote the development of the stall economy, it may lead to the decline or even the demise of the stall economy due to various reasons. If the industry association manages the stalls on its own, it can ensure the reasonableness of the policy and protect the weak stall economy to grow strong and strong. Therefore, in County G, the establishment of a hawker trade association has both sufficient and necessary conditions. However, the management and development of the vendor trade association still need necessary supervision, so as to avoid the occurrence of money and power transactions, the use of power for personal gain and other industrial chaos. is the Within the framework of the political system, one of the most crucial indicators to test whether the operation of public power is in accordance with the law and to avoid a crisis of public acceptance of the government is citizen satisfaction. Weber, the father of organization and management theory, believed that a rationalized and legalized organization is the most ideal unit to implement legal rule in modern society, and the government to ensure the legitimacy of the operation of its power needs to be repeatedly tested, and the result of the test is to obtain the approval of the citizens, so the basis of the test, i.e., the government's use of power directly affects the test results. The basis of the test, i.e. the use of government power, directly affects the test results. This requires the government to do the following: First, public administrators must ensure that citizens enjoy the full right to information, the right to expression and other rights, the government information is accurate, efficient, convenient, timely delivery to the hands of the public, the power in the system of the cage, so that the power to operate in the sun; Second, we must fully respect the status of the main body of the citizens, our country is a socialist country of the people's democratic dictatorship, the people are the master of the country, we must ensure that the citizens can Secondly, the subjective position of the citizens should be fully respected, China is a socialist country under the people's democratic dictatorship, and the people are the masters of the country. Therefore, County G should add citizen satisfaction as an important indicator in the performance evaluation of vendor governance, and focus on timely collection of citizen feedback, which not only enables citizens to receive a good political education in the process of participating in public affairs, but also provides strong intellectual support for the governance of vendors. Third, the effectiveness of the governance of the stall economy and the stall economy to help the residents of County G employment, to avoid returning to poverty into the performance appraisal system of government officials, to avoid the past in the evaluation of the performance of local government officials in the process of \"only GDPism\" practice, and effectively link the governance of the stall economy and the employment of the residents together.[7] In view of the low level of citizens' participation in public affairs in County G, efforts can be made from both the citizens and the government: on the one hand, it is necessary to improve the citizens' political and cultural literacy, call for and encourage the citizens to participate more in elections and hearings and other public affairs that can improve their political literacy, cultivate their voluntary spirit and mutual assistance qualities, and make the decisions to fully reflect the people's will; on the other hand, it is necessary to continuously improve the citizens' ability to participate in public affairs, so that citizens can subjectively participate in the management of public affairs with a better ability. Secondly, it is necessary to continuously improve citizens' ability to participate in public affairs, so that they are subjectively able to participate in the management of public affairs in a more favorable manner. To this end, it is necessary to improve citizens' willingness and ability to participate in public affairs management through publicity, strengthening political education for citizens, and making citizens participate in the practice of public management. On the other hand, it is necessary to continuously broaden and smooth or even open up the channels of political participation, to expand the orderly political participation of citizens from all levels and fields, and to more widely absorb the people's participation in the practice of public management, which objectively provides good conditions for improving the degree of citizens' political participation. In conclusion, expanding the level of citizens' orderly political participation is an important part of China's socialist democratic political construction, and its reform should be compatible with the current social transformation, and on the premise of safeguarding the overall situation, the level of citizens' political participation should be continuously improved. At the same time, it is also possible to establish a system of training and business study and exchange for ground-floor stall practitioners, so as to effectively improve the service consciousness and service level of ground-floor stall operators as tertiary industry service personnel.[8] but the problems left behind are very serious, in order to alleviate the pressure brought about by the downturn in the domestic economy, a variety of new economies are also rising rapidly, especially the red-hot live with goods is a huge boost for the domestic economic recovery. In this context, whether to rekindle the \"stall economy\" this torch, in the current for the economic recovery and development of County G has an indispensable role. Currently, there are many improvements that can be made in the measures of vendor management in County G, which can be divided into three major aspects: first, on the side of the government, the decisions made by the government departments in County G can still be improved, and the government pays too much attention to the role of the bureaucratic formal organization in the social governance; second, on the side of the third sector, the county has not yet set up the vendor industry association, which is difficult to defend the rights of such groups, and to some extent, it will also cause the problems of each group to be affected. This not only makes it difficult to protect the rights of these groups, but also creates a certain degree of fragmentation; thirdly, on the side of the citizens, the citizens' awareness and ability to engage in political participation are not high enough. To address the above problems, the cooperative governance theory is combined to build a cooperative network for vendor governance, so that the government, vendor industry associations, and citizens can participate in vendor governance, and thus gradually explore a model of stall economy development suitable for County G, thereby contributing to County G's economic development."
]