[
    "This study uses data covering 3,914 farm households, collected from Henan province in China, to investigate the links between the price of agricultural mechanization services and farmers’ exit from land operation. The results indicate that the increasing price of agricultural mechanization services leads to farmers leaving land operation, especially when the high sunk costs and the long-term breakeven period of self-owned machinery are considered. This effect is intensified by the rapid rural-urban migration in China. Further analysis reveals that the surge in service prices reduced land renting-in and encouraged non-grain production. Our analysis suggests that the agricultural mechanization service market in China tends to work against the survival of smallholder farmers. However, the price of agricultural mechanization services is conducive to eliminating less-productive farmers and cultivating new agricultural operators. In many Asian and African countries, the development of agricultural mechanization services has been an important approach to improving farm productivity and to substituting manpower (Houssou et al., 2013; Diao et al., 2014; Yi et al., 2019). Outsourcing parts *Tongwei Qiu, Associate Professor, College of Economics and Management, South China Agricultural University, China. Email: 15150561782@163.com; S. T. Boris Choy, Professor, Business School, The University of Sydney, Australia. Email: boris.choy@sydney.edu.au; Yifei Li, Editor of Management World, China. Email: liyfphd@ruc.edu.cn; Biliang Luo, Professor, National School of Agricultural Institution and Development, South China Agricultural University, China. Email: luobl@scau.edu.cn; Jing Li (corresponding author), Lecturer, School of International Trade and Economics, University of International Business and Economics, China. Email: 782358064@qq.com. The authors are grateful for support from the Key Project of National Social Science Fund of China (No. 20FGLA004). © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. of labor-intensive agricultural production is conducive to reducing the poverty of smallholder farmers in many developing countries (Zhang et al., 2017). In rural China, land fragmentation is a serious problem (Wang et al., 2007; Qiu et al., 2020a), and opportunities to achieve economies of scale by increasing the land available are restricted. For this reason, developing agricultural mechanization services is regarded as an important approach to achieving economies of scale of services (Yang et al., 2013). Since 2004, the Chinese government has enacted several policies to promote the development of such services. However, Foster and Rosenzweig (2017) found an inverse U-shaped relationship between the grain-cropping area and the rate of adoption of agricultural mechanization services in India. Similarly, in our study, the data collected from Henan province in China shows a slight inverse U-shaped relationship between the wheat-cropping area and the rate of adoption of agricultural mechanization services. If smallholder farmers can benefit from agricultural mechanization services, why do they use fewer? Foster and Rosenzweig (2017) posited that smallholder farmers tended to substitute family labor for mechanization, whereas large farms had the advantages of using self-owned machinery on a large operational scale. Moreover, smallholder farmers could not benefit from economies of scale. Because using agricultural mechanization services actually reduced their expected income from agricultural production, smallholder farmers were less likely to do this. In the past four decades, China has experienced the largest flow of rural–urban migration (Zhao, 1999). As a result, non-agricultural income has become the main income of rural residents. According to Johnson (2002), the share of labor engaged in agriculture dropped from more than 70 percent in 1978 to less than 50 percent by 2000 because labor left the agricultural sector in favor of off-farm employment (Deininger and Jin, 2005). Real wages also dramatically increased, even in the slack seasons in recent years (Zhang et al., 2011). This evidence indicates that the opportunity costs of agricultural production are much higher for farmers in China today, and that smallholder farmers would not like to engage in agricultural production. The price of agricultural mechanization services in rural China is not low. The data we collected from Henan province in China reveal that the average price of agricultural mechanization services, such as for plowing, sowing, and harvesting, for wheat production is more than RMB120 per mu, which exceeds the net profit of wheat production. The higher the service price, the more likely smallholder farmers are to exit from land operation. They also tend to exit because increased labor input and investment in machinery are very expensive for them. Although the Chinese government has stated that developing agricultural mechanization services is an important linkage between © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences.",
    "This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. Although many studies have analyzed other ways that farmers exit from land operation, such as through renting-out land and land abandonment (Feng et al., 2010; Liu, 2018), the impact of agricultural mechanization service prices on farmers’ exit from land operation is underanalyzed.' Moreover, the links between rural-urban migration and land operation are important issues in rural development (Feng et al., 2010; Kimura et al., 2011). Considering the increasing opportunity costs of engaging in agriculture and the significant rural-urban migration, the exit of farmers from land operation might be more sensitive to the price of agricultural mechanization services. Despite numerous studies finding that outsourcing part of the labor-intensive agricultural production can reduce production costs (Yi et al., 2019), smallholder farmers still want to exit from land operation because of the lack of alternatives for agricultural mechanization services and the higher salaries in non-agricultural sectors. This study analyzes two aspects of the price of agricultural mechanization services. First, we examine the effect of service prices on farmers’ exit from land operation. For many developing countries, the market for such services is underdeveloped, which might induce uncompetitively high prices and thus restrict agricultural development. Second, we consider rural–urban migration in analyzing the effect of the service price. With urbanization and industrialization in many developing countries, labor shortage in agricultural sectors will emerge sooner or later, and the evidence in China will provide important insights into future agricultural production. Our contributions are twofold. First, this study evaluates the impact of agricultural mechanization services on agricultural production. Although the literature has often highlighted the importance of agricultural mechanization services, few papers have investigated the response of smallholder farmers to the high price of agricultural mechanization services. Our study provides substantial evidence for developing this services. Second, we also analyze how smallholder farmers respond to the mechanization service price. For smallholder farmers, the salaries in the non-agricultural sectors are much higher than the income from land operation. They have less motivation to engage in agricultural production with increasing agricultural mechanization service prices, and investing in machinery is very expensive for them. Although using mechanization services can save agricultural labor, smallholder farmers still want to migrate to other cities if the cost of using mechanization services exceeds the net profit © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. The remainder of the paper is organized as follows. Section I briefly introduces the background of Chinese agriculture development and the theoretical framework for our analysis. Section III presents data, variables, and our estimation strategy. Section IV presents the econometric results, and Section V summarizes our main findings and some policy implications are provided. Over the past two decades, there has been rapid development in agricultural mechanization associated with the outsourcing of professional services in rural China (Yang et al., 2013). Although many studies in other Asian and African countries found that agricultural mechanization services improved farm productivity (Diao et al., 2014; Sims and Heney, 2017; Yi et al., 2019), whether smallholder farmers in rural China voluntarily participate in the market for such services is unclear. The average land size is small and the number of land plots per farm household is large, so it is unlikely that economies of scale can be achieved through the adoption of agricultural mechanization, as this would increase the service cost per unit of land (Foster and Rosenzweig, 2017). In 2000, the average number of land plots per farm household in China was 5.9, and the land size per household was 7.43 mu (Ministry of Agriculture of the People’s Republic of China, 2009). In 2015, the average number of land plots per farm household dropped to 3.27, and the land size per farm household decreased slightly to 7.26 mu (Ministry of Agriculture of the People’s Republic of China, 2017a). The Statistical Annual Report on Rural Management in China (Ministry of Agriculture of the People’s Republic of China, 2013, 2017b) documented that the number of farm households with no land increased from 13.75 million in 2012 to 18.54 million in 2016, and the number of farm households with less than 10 mu of land increased from 190.24 million in 2009 to 230 million in 2016. This indicates that numerous farm households have exited from the land operation.",
    "The dramatic increase in production costs is likely a determinant of farmers leaving land operation. Qiu et al. (2020a) noted that the labor costs in grain production accounted for 41.8 percent of the total production costs in 2014, compared with 35.1 percent in 1990. Data from the China Agricultural Products Cost–Benefit Compilation of Information (NDRC, 2015) showed that the labor cost per mu in grain production changed from © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. RMB188.39 in 2009 to RMB446.75 in 2014. The increasing labor costs induce the emergence of alternatives. Outsourcing agricultural mechanization services is one of the most important ways to substitute agricultural labor. Smallholder farmers still play a major role in rural China, and the sunk costs of self-owned machinery hinder their investments. Data from the NDRC (1991, 2015, 2017) show that the ratio of agricultural mechanization service costs to total production costs in grain production was only 3.5 percent in 1990. This ratio increased to 12.6 percent in 2014 and 13.1 percent in 2016. With the large amount of rural–urban migration, agricultural labor was reduced and the labor cost increased significantly. This led to production outsourcing to professional service providers (Zhang et al., 2017). However, the profit from grain production has declined dramatically in recent years. It is reported that the average profit from grain production dropped from RMB196.5 per mu in 2004 to RMB116.2 per mu in 2016 (NDRC, 2005, 2017). This drop in profit pushed farmers to abandon their farmland, or to lease their farmland, and pursue employment in non-agricultural sectors. Several studies proposed that rural—urban migration in China encouraged farmers to either leased their farmlands (Feng et al., 2010; Kimura et al., 2011) or abandoned them (Liu et al., 2010; Liu, 2018). That is, if the agricultural mechanization service price increases to a level that the smallholder farmers cannot tolerate, the farmers inevitably abandon land operation. The acceleration of real wages indicates that the era of surplus labor is over in rural China (Zhang et al., 2011), and labor costs in agricultural production will become a substantial burden and affect the well-being of the agricultural sector. To analyze the impact of agricultural mechanization service prices on farmers’ exit from land operation, we construct a theoretical framework in this subsection. We only first consider grain production because agricultural mechanization services are more commonly adopted in grain production than in non-grain production. Then we discuss the probability that farmers opt to produce non-grains with increasing service prices for grain production, considering the lower product price of grain crops versus cash crops. We therefore examine the correlations among the labor price, the price of grain crops, the agricultural mechanization service price, and the economic cost of investing in machinery. In theory, if the agricultural mechanization service price increases, farmers will invest in machinery or increase agricultural labor. However, the high opportunity cost of employment in agricultural production will reduce the likelihood that farmers substitute family labor for agricultural mechanization services. Moreover, investing in machinery © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. is very expensive for smallholder farmers because the sunk costs of machinery (not used during non-harvest time) is relatively high, and their small land size cannot ensure that they achieve economies of scale (Foster and Rosenzweig, 2017). According to neoclassical economics, the higher the price of an ordinary commodity, the lower the demand for it (Kreps, 2013). Although the Chinese government has stated that developing agricultural mechanization services is of great importance for pushing smallholder farmers to modernize production and improve farming productivity, the high price of such services has impeded the agricultural production of smallholder farmers. As discussed, smallholder farmers have limited access to cheaper alternatives for agricultural mechanization services in rural China. When the high service price harms the expected income from agricultural production, farmers voluntarily choose to lease or abandon their farmland. If the land rental market functions well, farmers lease their farmland to obtain land rent, which will provide more benefits to the farmers than engaging in agricultural production. In contrast, if smallholder farmers do not want to lease their land, land abandonment will be common. Farmers’ land use therefore depends on the benefits of agricultural production versus those of land rental or abandonment.",
    "With increasing rural–urban migration, farmers are more sensitive to price variations in agricultural mechanization services. Chaianov (1986) proposed that smallholder farmers tend to input excessive labor in agriculture. However, the scarcity of agricultural labor means that farmers cannot respond to price variations in agricultural mechanization services by adjusting agricultural labor. Under such condition, the increasing service price is more likely to result in farmers leaving farm work. What should not be neglected here is that the high cost of investing in machinery is another important precondition for farmers’ exit from farm work. Considering the much higher salaries in non-agricultural sectors and the low prices of grain products, smallholder farmers are more sensitive to the increasing service price. Although they can adjust the agricultural structure, the technical threshold and the high sunk costs for investing machinery restrict most farmers to non-grain production, and the decision to abandon land operation is made spontaneously. Hypothesis 2: With the increase in rural—urban migration, the positive effects of the agricultural mechanization service price on farmers’ exit from land operation are intensified. © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. The data used for our statistical analysis come from a farm survey conducted in 2017. The survey focused on the development of agricultural mechanization services and its effects. The farm-level data on agricultural production and the family characteristics were collected from Henan province in China. Henan serves as a good sampling area because it is one of the major cropping regions in China. According to the National Bureau of Statistics of China (NBS, 2018), the national rate of grain cropping is 70.94 percent, which is similar to the rate in Henan (74.09 percent). The plowing, sowing, and harvesting mechanization rates of wheat production for Henan and China (the national average) are also similar. The data from the NBS (2018) showed that, at the national level in 2017, the tractor-plowing rate, machine-sowing rate, and machine-yielding rate were 90.10 percent, 87.16 percent, and 92.67 percent, respectively. These rates are similar to those in Henan, which were 88.00 percent, 92.76 percent, and 93.48 percent, respectively. These indicate that Henan’s grain production and mechanization rate in wheat production are representative for the research. We carried out a two-wave farm survey in June and July 2017. The first survey was conducted in Zhengyang county because this county is located in the central plains and had the largest wheat cropping areas in Henan in 2016. From Zhengyang county, ten towns were chosen at random, and from each town, five administrative villages were selected at random. Then, from each village, 40 farm households were randomly surveyed. As 86 farm households had missing values, they were excluded from our analysis. The total number of observations in this survey is 1,914. In July 2017, the second survey was conducted. For data collection, we used a stratified random sampling approach to choose the farm households. First, one county was selected at random from the south, east, central, north, and west regions of Henan, respectively. The counties selected were Shangcai, Qixian, Wuyang, Anyang, and Xinan. Second, we divided all of the towns in each county into five groups according to their economic level, and one town was then randomly selected from each group. Third, the villages in each town were divided into two groups according to their economic levels, and one village was randomly chosen from each group. Finally, 40 farm households were randomly surveyed from each village. The total number of observations in the second survey was 2,000. The final sample size of the two-wave surveys is 3,914 farm households from six counties in Henan province. We selected Zhengyang as our surveyed sample because Zhengyang has the largest wheat cropping areas of Henan’s counties. This is conducive to identifying information © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences.",
    "This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. on the development of agricultural mechanization services in wheat production. Although the sampling procedures of the two surveys are different, the pooled dataset has a larger sample size, which helps us to avoid estimation bias. The potential risk of adopting different sampling procedures is also taken into consideration in our robustness checks. The dependent variable in our econometric model is whether a farmer exits from land operation. This variable is measured by one of the following two indicators: the dummy of exiting from land operation, and the exit rate. The variable of the dummy of exiting from land operation takes a value of 1 if a farmer reduces his land operation, and 0 otherwise. The exit rate equals the proportion of uncultivated land size to the contracted land size. The agricultural mechanization service price is the main independent variable. However, the household-level service price is unavailable for farmers who have exited from land operation. Moreover, the causality of the household-level service price on farmers’ exit from land operation has an endogeneity problem. Following Ma et al. (2016), we use the average proportion of the agricultural mechanization service price to the total production cost per mu in wheat production at the village level to measure the agricultural mechanization service price, which we then take as the relative price.2 As wheat is the staple food grain in Henan and the agricultural mechanization service prices of different grain crops are similar, the service price in grain production can represent the development of the services at the village level. Furthermore, there is no reverse causality of the village-level service price on the individual farmer’s exit from land operation. The rural–urban migration is another factor that we use to investigate the effect of the agricultural mechanization service price on farmers’ exit from land operation. Following Ma et al. (2015) and Qiu et al. (2020a), we use the proportion of the migrated laborers to the total number of laborers at the village level as an alternative measure for rural–urban migration. To a certain extent, using a village-level indicator can avoid the endogeneity problem. Village labor migration can also represent the development of labor markets and the opportunity costs of working in agriculture (Yan et al., 2016), and as such can represent the labor constraints of farm households to a great extent. © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. The characteristics of the households, land, and villages are controlled in our model. The household characteristics that we consider are family size (Yan et al., 2016), the children ratio, the elderly ratio (Xu et al., 2019), whether a family member is a party member (Ma, 2013) or a village cadre member (Qiu et al., 2020a), whether a family member has agricultural training, and whether the household has a motor- pumped well. In terms of land characteristics, we consider the contracted land size (Xu et al., 2019), the number of land plots (Yan et al., 2016), small land redistribution, large land redistribution,’ and land titling. We include these characteristics because prior studies showed that land property rights have a significant impact on land renting-out (Feng et al., 2010), and that land redistribution and land titling are used to represent land tenure security (Jacoby et al., 2002; Rao et al., 2016; Hong et al., 2020). The development of agricultural mechanization services at the village level is also controlled, as it can affect both the farmers’ exit from land operation and the service price. The proportions of farm households that use plowing or harvesting services at the village level are used together to represent the development of agricultural mechanization services. Both the service prices of plowing and harvesting are controlled, as they determine the agricultural mechanization service price and thus affect farmers’ exit from land operation. Finally, the distance between the village and the nearest town or county (Ma, 2013; Xu et al., 2019), the village landform, and the village’s traffic condition (Qiu et al., 2020b), and a county dummy are controlled for.* For more details, see Table 1.",
    "Several dependent variables — the land renting-in dummy, the land renting-in rate, the dummy for producing cash crops, and the share of cash crops — are used for further analyses. In further analysis I, the relationship between the agricultural mechanization service price, and land renting-in is identified. Following Feng et al. (2010), Ma (2013), and Qiu et al. (2020a), a dummy variable for land renting-in and the land renting-in rate are used to measure land renting-in. In further analysis I, the impact of the agricultural mechanization service price on non-grain production is investigated. Following Liu et al. (2018) and Qiu et al. (2020a), a dummy variable for producing cash crops and the share of cash crops are used to represent non-grain production. 3Small land redistribution means that only part of the village-level contracted land was redistributed, whereas large land redistribution means that all of the village-level contracted land was redistributed. 4Several prior studies that examined land rental and land abandonment (Ma, 2013; Xu et al., 2019) controlled for the characteristics of the head of a household such as education, age, and gender when analyzing farmers’ exit from land operation. We do not control for these characteristic because they cannot affect the village-level agricultural mechanization service price. Thus, omitting these variables will not result in endogeneity problems. © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. To identify the impact of the agricultural mechanization service price on farmers’ exit from land operation, we specify the following model: where Y denotes the exit of farmers from land operation and is measured by the dummy for exiting from land operation and the exit rate. C, is the price of the agricultural mechanization services and is measured by a village-level indicator. X is a vector of control variables of the household, land, and village characteristics. £, is a constant term. /, and f, are parameters of interest. ¢,is a random error term, which is assumed to be normally distributed. To investigate the effect of the agricultural mechanization service price and the labor constraints, we introduce an interaction term of the service price and village labor migration and then obtain Equation (2): where L, represents rural-urban migration and is measured by village labor migration. CL, is an interaction term. A, is a constant term. A, Ay. Ass and A , are the parameters to be estimated. The other variables are the same as those defined in Equation (1). Although an endogeneity problem might exist in our estimates, as we have stated in Section III.2, a reverse causal relationship does not exist between the village- level service price and farmers’ exit from land operation. The individual farmer’s exit from land operation cannot significantly affect the market price of the agricultural mechanization services. However, omitting unobserved variables might confound our analysis and result in an endogeneity problem. Although several village-level indicators — the development of agricultural mechanization services, the village landform, the traffic condition, the location, and the county dummy ~ are controlled, thus eliminating the omitted variable problem to a great extent, other socioeconomic factors might affect the village-level service price and farmers’ exit from land operation simultaneously. We therefore use the instrumental variable (IV) method to deal with the endogeneity problem. In this study, we use two IVs: the contracted land size per farm household and the contracted land size per capita at the village level. The contracted land size per farm household determines the market capacity of the agricultural mechanization services, which affects the economies of scale of the mechanical operations and the market prices. The contracted land size per capita represents the farm households’ labor constraints, and measures the demand for agricultural mechanization services. Both of these two IVs are exogenous to the village-level service price and farmers’ exit from land operation. This is because the village-level land size is determined by nature and by the © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences.",
    "This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. administrative division, and the land contract is national policy, which can be regarded as an exogenous shock (Sheng et al., 2019). As the dependent variable in Equation (1) is measured by both a dummy variable (dummy for exiting from land operation) and a continuous variable (exit rate), we use the IV probit regression model (IV-probit) and the two-stage least squares method (2SLS), respectively. Moreover, as two endogenous variables exist in Equation (2), we use the extended regression model (ERM), following Maitra and Rao (2014). We use the extended probit regression model (eprobit) when the dummy variable serves as the dependent variable, and use the extended linear regression model (eregress) when the continuous variable serves as the dependent variable. 1. Impact of agricultural mechanization service price on land operation Table 2 presents the results based on Equation (1) estimates for the impact of the agricultural mechanization service price on farmers’ exit from land operation. The results of a Durbin–Wu–Hausman (DWH) test indicate the presence of an endogeneity problem. The results of a weak identification test show that there is no weak IV problem. According to Wooldridge (2010), when more instruments exist than we need to identify in an equation, a test should be made of whether the additional instruments are valid in the sense that they are uncorrelated with the residual term. The results of a test of overidentifying restrictions in Table 2 show that the IVs used in the analysis are uncorrelated with the residual term, which means that the IVs are valid to some extent.5 The coefficients on the village-level service price are significantly positive at the 1 percent statistical level in columns (2) and (4) of Table 2. This finding indicates that, with an increase in the agricultural mechanization service price, farmers are likely to exit from the land operation, which confirms our Hypothesis |. Although several studies proposed that adopting agricultural mechanization services could improve farm productivity in rural China (Yang et al., 2013; Zhang et al., 2017; Yi et al., 2019), the dilemmas that smallholder farmers face — such as increases in labor costs and service prices — still remain underanalyzed. It is generally known that, in China, the problem of land fragmentation is serious. As such, smallholder farmers cannot achieve economies of scale. 5Strictly speaking, the exogeneity of IVs cannot be demonstrated. This is because the residual term is unknown, and the test of overidentifying restrictions only provides indirect evidence to demonstrate the validity of IVs. For this reason, the existing literature did not provide the results of a test of overidentifying restrictions (Sheng et al., 2019). We have described the IVs in this paper as naturally determined or policy-oriented, as proposed by Sheng et al. (2019), and they can be seen as exogenous indicators for smallholder farmers. © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. Although the Chinese government has promoted the marketization of agricultural mechanization services in recent decades, the average price of land preparation and harvesting is high for smallholder farmers, and agricultural mechanization service organizations are still lacking. The statistics show that the profit from grain production has hardly increased and has even dropped rapidly in recent years (NDRC, 1991, 2015). Thus, smallholder farmers have almost no motivation to engage in agricultural production. The high prices of agricultural mechanization services might encourage smallholder farmers to substitute family labor for the services and the large flow of rural—urban migration increases the opportunity costs of agricultural production. With the reduced profit from agricultural production, smallholder farmers would like to lease farmland to obtain rent, or abandon their farmland, both of which are responses to the increase in the service price.",
    "The scarcity of agricultural mechanization service organizations is an important determinant of the high service price in China. According to the China Agricultural Machinery Industry Yearbook (China Machinery Industry Information Institute, 2009, 2017), the number of intermediary service organizations reduced from 7,100 in 2008 to 6,500 in 2016, and the number of employees engaged in these service organizations dropped from 63,800 to 49,500 during the same period. This evidence shows that the market for agricultural mechanization services is underdeveloped. The lack of competition in this service market implies a monopoly to some extent; therefore, prices are likely to be high, which boosts agricultural production costs. Although Yi et al. (2019) have noted the importance of agricultural mechanization services for agricultural development in China, smallholder farmers still have to exit from agricultural production. Among the other control variables, the elderly people ratio has a positive relationship with farmers’ exit from land operation (columns (2) and (4) of Table 2). Elderly people have less ability to work, which encourages them to transfer the farmland. We also find that the number of land plots positively affects farmers’ exit from land operation because land fragmentation reduces farm productivity and increases the transaction costs of agricultural production (Wan and Cheng, 2001; Rahman and Rahman, 2009). Both large land redistribution and land titling are negatively correlated with farmers’ exit from land operation (columns (2) and (4) of Table 2). On the one hand, land redistribution increases the risk of land loss, which reduces farmers’ migration. This is because migrating to cities reduces the protection of farmland. On the other hand, land titling increases the farmers’ sense of the endowment effect for cultivated land, which might encourage them to engage in land operation. In addition, the development of a village-level plowing market reduces the exit of farmers from land operation. This is because the development of agricultural © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. mechanization services increases competition and thus reduces the service price. However, we find a positive relationship between the village-level harvesting price and farmers’ exit from land operation. This is because the demand for harvesting services causes the price to increase and this encourages farmers to exit. Other control variables show insignificant effects on farmers’ exit from land operation. Equation (2) estimates the impact of village-level service price on farmers’ exit from land operation considering rural—urban migration, which is presented in Table 3. As shown, the interaction term of the agricultural mechanization service price and village labor migration is positive at the | percent significance level for both the dummy for exiting from land operation and the exit rate. This finding indicates that, with the increase in rural-urban migration, the agricultural mechanization service price has an increasingly positive effect on farmers’ exit from land operation, which confirms our Hypothesis 2. With the large flow of rural-urban migration, farmers are likely to outsource the labor-intensive agricultural production to professional service providers (Yang et al., 2013; Zhang et al., 2017). However, the increasing price of such services reduces their expected income from agricultural production, which means that smallholder farmers have to substitute cheap production factors for agricultural mechanization. However, investing in machinery and increasing family laborers in the farm production are more costly. At the same time, the high salaries in the non- agricultural sectors attract more agricultural labor and the lengthy breakeven period of sunk costs for smallholder farmers hinders their investment in machinery assets, so smallholder farmers would like to exit from land operation. Since the economic reforms in 1978, China has experienced the largest flow of rural-urban migration in the world (Zhao, 1999). According to the Statistical Annual Report on Rural Management in China (Ministry of Agriculture of the People’s Republic of China, 2017b), less than 37.65 percent of rural labor engaged in agriculture in 2016. Zhang et al. (2011) found a dramatic increase in real wages even during slack seasons, which means that the era of surplus labor is over in China and that the structural changes due to labor shortages are affecting the well-being of the agricultural sector. The agricultural sector cannot provide enough employment to guarantee the livelihoods of most smallholder farmers (Rigg, 2006). Considering that smallholder farmers are less likely to invest in machinery and that the rural-urban migration will continue, the increasing price of agricultural mechanization services will inevitably cause farmers to exit from land operation.",
    "© 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. Notes: ***, **, and * indicate statistical significance at the 1, 5, and 10 percent levels, respectively. The robust standard errors are shown in parentheses. eprobit, extended probit; eregress, extended linear regression. In Tables 2 and 3, farmers’ exit from land operation is used as the dependent variable. If the positive impact of the agricultural mechanization service price on farmers’ exit from land operation is confirmed, it can be deduced that farmers have a lower likelihood of renting in farmland with the increased service price. This reasoning can serve as a robustness check for the estimates in Tables 2 and 3. Following Ma (2013), we use the dummy for land renting-in (whether farmers rent in farmland) and the land renting-in rate (the proportion of the rented-in land size) to represent land renting-in. Table 4 uses similar control variables and IVs to those in Table 3. The results of a DWH test confirm that there is an endogeneity problem in the causality of labor migration on land renting-in. The results of a weak identification test indicate no presence of a weak IV problem. The results of a test of overidentifying restrictions show that the [Vs used are valid. The coefficients on the village-level service price in columns (2) and (4) of Table 4 are negative at the | percent significance level. This finding indicates that, with an increase in the agricultural mechanization service price, farmers are less likely to rent in farmland. The increasing service price hinders scale operation. Considering that farmers decreasingly depend on farming in China today, exit from land renting-in means exit from agricultural production to a great extent. Although the coefficient on the interaction term in column (4) is significant, the agricultural mechanization service price shows an © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. increasingly negative effect on the land renting-in dummy with rural—urban migration, as shown in column (2). This finding means that the labor constraint is an impediment to land operation that amplifies the harm caused by the increasing price of agricultural mechanization services. In this study, the agricultural mechanization services are those related to wheat production. As wheat production is an agricultural tradition in Henan province, exit from land operation is almost equivalent to exit from wheat production. The expected income from wheat production decreases with an increase in the agricultural mechanization service price. However, some of the farmers produce non-grains to increase their agricultural income. As such, we investigate the relationship between the service price and the production of cash crops. Our results are presented in Table 5. To measure non- grain production, we use a dummy variable for producing cash crops and the proportion of cash crops to the total cropping area. The other control variables and the estimation strategy are the same as those used for Table 3. The results of a DWH test, a weak identification test, and a test of overidentifying restrictions are similar to those in Table 2. © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited.",
    "The coefficients on the village-level service price are positive at the 1 percent significance level for the [V-probit and 2SLS models (columns (2) and (4) of Table 5). This finding indicates that, with an increase in the agricultural mechanization service price for wheat production, farmers are more likely to produce non-grains. In theory, the decline in profit from grain production encourages farmers to engage in off-farm employment or to produce non-grains. Only if the incomes from off-farm employment and from producing non-grains converge will family labor be randomly distributed. At the same time, our finding implies that the agricultural mechanization service price not only contributes to farmers’ exit from land operation but also results in more production of non-grains. Although we argue that a pooled dataset can help us to identify comprehensive information, the sampling procedures of the two surveys are different, and different sampling procedures might confound the estimated results and mislead policymaking. Thus, we conducted a separate analysis using data from the second survey sample © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. that covers 2,000 farm households. We present the results in Table 6. The results of a DWH test, a weak identification test, and a test of overidentifying restrictions are similar to those in Table 2. Similar to our main findings, the coefficients on the village-level service price are positive at the 1 percent significance level in columns (2) and (4) of Table 6. We can conclude that using a pooled dataset does not confound our analysis. Another issue that might confound our estimates is the clustering of the farmers’ exit from land operation. Farm households in the same village tend to imitate each other, and hence peer effects exist (Qiu et al., 2020). Ignoring the clustered robust standard errors might confound the estimated results. In Table 7, we present the estimates obtained from an analysis in which we control for village-level clustered robust standard errors. The results of a DWH test, a weak identification test, and a test of overidentifying restrictions are similar to those in Table 2. Similar to our main findings, the coefficients on the village-level service price are positive at the 1 percent © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences. This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. significance level in columns (2) and (4) of Table 7. In other words, controlling for robust standard errors rather than clustered robust standard errors does not confound our estimates. Over the past two decades, there has been dramatic development of agricultural mechanization services in many Asian, African, and European countries. Although developing such services is considered as one of the most important approaches to encourage smallholder farmers to engage in modern agricultural production, few studies have analyzed the effect of the service price on farmers’ exit from land operation. In theory, the lengthy breakeven period of sunk costs for smallholder farmers restricts their investment in machinery. Furthermore, the large flow of rural-urban migration reduces the likelihood of them substituting family labor for agricultural mechanization services. In particular, China has experienced a large flow of rural-urban migration since 1978, and smallholder farmers have been confronted with high opportunity costs of engaging in agriculture, which might amplify the negative effect of the service price due to the © 2021 The Authors. China & World Economy published by John Wiley & Sons Australia, ©2021 Institute of World Economics and Politics, Chinese Academy of Social Sciences Ltd on behalf of Institute of World Economics and Politics, Chinese Academy of Social Sciences.",
    "This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. Using data collected from Henan province in China, we examined the relationship between the agricultural mechanization service price and farmers’ exit from land operation. The results indicate that, with an increase in the service price, farmers are more likely to abandon land operation. Moreover, we found that the positive effect of the service price on farmers’ exit from land operation increases with the migration of family labor. Further analysis shows that the high price of adopting agricultural mechanization services hinders land-scale operation and results in non-grain production. Our analysis reveals that the development of agricultural mechanization services is not inevitably beneficial for the survival of smallholder farmers. Many studies document the positive effect of adopting agricultural mechanization services on farm productivity but it cannot be ignored that whether smallholder farmers adopt such services largely depends on the market price. Although developing agricultural mechanization services is an important approach to helping smallholder farmers shift to modern agricultural production, farmers’ exit from agriculture due to the high service price is still inevitable. However, land scale management is the necessary process to promote modernized agriculture, which inevitably results in the exit of most smallholder farmers from agriculture. In recent years, cultivating family farms and new agricultural operators has become a main policy target for rural revitalization. This means that consolidating the basic position of family management in agriculture is more about historical matters than economic efficiency, and Chinese agriculture increasingly depends on new agricultural operators and modern technology. Relying on the agricultural factors market, such as the mechanization services market, may therefore reduce difficulties during the transition process, because this is conducive to farmers’ voluntary exit from agriculture."
]