[
    "Copyright © 2022 Beibei Liu and Yongyong Sun. This is an open access article distributed under the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited. At present, there is a huge gap between supply and deman of old-age services in rural areas of China. Developing rural mutual old-age services is of great significance to remedy the gap. Based on the survey data of 1200 rural residents in Hubei and Henan provinces, this paper adopts binary logistic regression mo el to analyze the influence of special trust and general trust on rural residents’ willingness to participate in mutual care for the aged. The results show that both special trust and general trust have an impact on rural resi ents’ willingness to participate in mutual support for the elderly, but the effect of special trust on rural residents’ willingness to participate in mutual support for the elderly is not significant. General trust has a significant promoting effect on rural residents’ willingness to participate in mutual care for the aged. Chinese rural residents’ trust in village cadres has a significant promoting effect on their willingness to participate in mutual assistance for the aged. The trust of ordinary friends significantly inhibited their willingness to participate. The educational level, living style, and economic status of Chinese rural residents have a positive impact on their willingness to participate in mutual care for the aged. Age, marital status, health status, and intergenerational relationship are inversely correlated with willingness to participate. According to the seventh national census data, the national population is 1,411.78 million, and the population aged 60 and above is 264.02 million, accounting for 18.70% (among them, the population aged 65 and above is 190.64 million, accounting for 13.50%). Compared with 2010, the propor- tion of the population aged 60 and above has increased by 5.44 percentage points [1]. The level of rural economic development is backward, the self-security ability of farmers is poor, and they do not have the economic ability and willingness to purchase professional pension services. The national security capacity is relatively inadequate. Although the coverage rate of rural old-age security (including resi- dents’ old-age insurance and minimum living security and “five guarantees”) is relatively high on the whole, the level of security is low and it cannot provide adequate old-age se- curity. In addition, both public and private pension insti- tutions in rural areas are lagging behind in development, and it is difficult to provide adequate pension services but also relatively common government failure and market failure phenomenon. In this case, the development of rural mutual support for the elderly has become an important option to solve the problem. Compared with the development of other forms of old-age security, there are certain comparative advantages in promoting mutual support for the elderly among rural residents. It can not only better meet the rural elderly will not leave home but also fully explore and use the existing rural endowment resources, effectively alleviate the shortage of pension funds, services, talents, and other resources in rural areas, and reduce the pressure County, Handan City, Hebei Province, established the rural mutual aid Happiness Home in 2008, Hebei, Gansu, Hubei, Guangxi, and other places have successively car- ried out the exploration of rural mutual aid old-age care innovation road. From the top-level design aspect, the Central government has incorporated mutual assistance for the elderly into national policies. From the Rural Revitalization Strategy Plan (2018-2020) in 2018 to the “No. 1 Document” of the Central Government, Resolutely Winning the Battle against Poverty in 2020, both em- hasize the development of mutual assistance for the elderly in rural areas. From the point of view of the current ractice model of mutual assistance for the aged in various laces, it can be divided into two main types: one is centralized mutual assistance, where the elderly are gathered together, and the elderly provide each other with ension services and spiritual comfort, such as “rural mutual assistance happy home” and village community care center. The other is diaspora, in which elderly people ive scattered at home and participate in mutual care services, such as the “Old Buddy Program” and the “Old Friends Circle”. Although different forms of mutual support for the elderly have achieved certain effects, but only a small scope of fire, unable to start a prairie fire, different mutual support for the elderly are facing an important problem, that is, rural residents have low willingness to participate in mutual support for the el- derly. Studies show that only 47.9% of the rural elderly are willing to participate in mutual support for the aged [2], showing the characteristics of low quality, low level, and low willingness of the elderly to participate [3] [4] that rural mutual care for the elderly is not[5]. Some scholars have also found that family size, living style, intergen- erational relationship, health status, economic status, and age and marital status in individual characteristic vari- ables have a significant impact on the willingness of rural elderly to support each other for the aged [2, 6, 7]. So far, few scholars have studied the specific impact and effect o: interpersonal trust on rural residents’ willingness to participate in mutual care for the aged. However, the mutual support for the aged in rural areas being explored in our country is essentially a voluntary social exchange, based on the voluntary cooperation of the elderly in rura areas, so who are the elderly willing to cooperate with the object? Who is not? Who influences older people’s will- ingness to cooperate? How to make use of these influ- encing factors to enhance the willingness to participate and promote the development of rural mutual care for the elderly? These are the questions to be answered in this paper.",
    "2.1. Interpersonal Trust. Before analyzing the connotation of interpersonal trust, we need to understand the connotation of trust. Some scholars regard trust as an individual behavior [8]. However, more scholars believe that trust is a positive expectation of others’ behavior [9-12]. That is, an individual’s positive expectation is that others will act in consideration of their own interests. Luhmann [12] divides trust into interpersonal trust and institutional trust. Inter- personal trust is based on the emotional connection established in interpersonal communication, while institu- tional trust is based on the regulation and restriction of norms, rules, and regulations in interpersonal communi- cation [13]. Barber divides interpersonal trust into general trust and special trust: general trust is an individual’s ex- ectation that those who maintain social interaction with im can act according to the role norms, usually the trust of others or strangers in the society; special trust refers to the expectation that the individual can fully shoulder the re- sponsibility and trust of acquaintances, friends, and family members [9]. As a subset of trust, interpersonal trust is a kind of interpersonal relationship in essence. Relationship means that both sides of trust play a role. Therefore, from the erspective of trust objects, many researches divide inter- ersonal trust into special trust and general trust; special trust is based on acquaintance relationship and general trust ‘acing general social members beyond acquaintance rela- tionship [14, 15]. In short, face-to-face communities, mutual knowledge, and strong social control lead to special trust 16]. General trust is more likely to occur in large com- munities where strangers or nonacquaintances are the majority [17]. Domestic scholars believe that Chinese trust is signifi- cantly different from that of the West [18]. The interpersonal trust in Chinese society results from the inner “love is different” and “people are different”, which is consistent with the “differential pattern” proposed by Fei Xiaotong. In other words, different types of interpersonal trust are individual- centered and gradually weaken from inside to outside with the opening of the intimate distance [19]. Family members, relatives, and friends are the most trusted, followed by the rest of the people, the lowest degree of trust is frequent business contacts, classmates, and most people in society [20]. In this study, interpersonal trust is divided into special trust and universal trust according to the different trust objects of rural residents and the relationship between them. The trust of family members, relatives, and neighbors based on blood relationship and geographical relationship is special trust. The trust of village cadre and other friends is universal trust. 2.2. Rural Mutual Assistance for the Elderly. Domestic re- search on mutual assistance for the elderly is quite abundant. From the perspective of research content, existing research on mutual assistance for the elderly has discussed its con- notation, historical evolution, development status, practice mode, participation intention, feasibility, development di- lemma, path, and other aspects [5, 21-25]. From the per- spective of research, existing studies have been analyzed from the perspective of institutional embeddedness, policy tools, historical anthropology, resocialization, and com- munity governance [26-30]. Combing the existing research results, it can be seen that, on the one hand, the existing research has not paid enough attention to the participants of asusor'] suoURO. aAneasS aiquotdde oy q pousAod axe sajayse YO ‘9sn Jo soqnu soy Aresqy'] ouL[U £o[EA\\ Uo (SuoLIPUOD-puE-sULID} HOD’ Kd[tMW-AaeIq_oUr[UO//:sdny) suoLEPUOS mutual care for the aged. Rural residents are the participants of rural mutual care for the aged, and their willingness to mutual care for the aged is the premise and basis for the realization of mutual care for the aged. On the other hand, some scholars began to pay attention to the role of trust mechanism in mutual care for the aged, but they focused more on social capital, pointing out that social capital can influence the pension behavior of rural elderly through interaction effect, reciprocity effect, and mutual trust effect [31] Abundant social capital can reduce all kinds of friction in the process of mutual aid and make mutual aid pension can still operate well [32]. Some scholars proposed to build trust mechanism, mutual norms, participation in the net- work to help the sustainable development of mutual care for the elderly. Trust is the core element of social capital, but few scholars have studied its specific influence and function on mutual pension.",
    "2.3. Interpersonal Trust and Willingness to Participate in Mutual Care for the Aged. Rural mutual assistance for the aged is a kind of voluntary mutual assistance and cooper- ation. In voluntary cooperation, individual behaviors will inevitably affect others, and others’ behaviors will also affect individual behaviors, and each individual will influence and interact with each other. These influences will be fed back to their actions of mutual assistance for the aged. Therefore, it is necessary to analyze the influencing factors of participation intention from the dynamic level. It has been proved by literature that trust is a necessary condition for the occur- rence of farmers’ cooperative behavior, and trust presents the form of differential pattern [34]. The “special trust” based on kinship and quasi-kinship is the action logic of Chinese farmers towards cooperation [35]. Trust is a key factor in promoting mutual pension participation. The cultivation of trust can promote people to reach tacit cooperation and form a good interaction between members of the organi- zation [36]. As a core subset of trust, interpersonal trust affects individual behavior choices through interpersonal communication and interaction in rural residents’ daily life and production, thus affecting their willingness to partici- pate in mutual care for the aged. 2.4. Research Hypothesis. Based on the above analysis, it can be considered that the interpersonal trust of rural residents may be a key variable affecting the willingness of rural residents to participate in mutual care for the elderly, but the different types of trust it contains may have different effects. With the gradual transformation of Chinese society to modern society, the trust relationship in rural and local society gradually develops from “special trust” to “universal trust”. Based on this, the following research hypotheses are proposed. Research hypothesis 1: Rural residents’ special trust has a positive impact on their willingness to participate in mutual support for the elderly. The more the rural residents trust their children, relatives, and neighbors, the more inclined they are to participate in mutual Research hypothesis 2: The general trust of rural residents has a positive impact on rural residents’ willingness to participate in mutual care for the aged. According to previous studies, there is a “differential order pattern” in the trust structure of Chinese people, and the special trust is much higher than the general trust. Therefore, hypothesis 2 can be divided into: the higher the trust degree of rural residents to other friends and village cadres, the higher their willingness to participate in mutual pension; other- wise, they are less willing to participate in mutual pension. Research hypothesis 3: Special trust has no significant impact on rural residents’ willingness to participate in mutual care for the elderly, while general trust has a significant impact. 3.1. Data Sources. The research data are from self-tuning data of the research group in 2019. In July 2019, members of the research group took Zhijiang City of Hubei Province and Dengzhou City of Henan Province as the basic sampling framework, and adopted random sampling method to select a number of villages in each place to conduct a questionnaire survey. The purpose of the survey is to investigate the sit- uation of rural residents’ mutual support for the elderly, and the respondents are mostly middle-aged and elderly people in rural areas. The content of the questionnaire mainly includes three parts: personal basic information, social network, and the current situation of rural mutual support for the aged. The measure items in the questionnaire are all from the integration of existing literature, and some of the research measures are from western literature, and the method of back-translation is used to ensure the accuracy of the description of measure questions in the questionnaire. The questionnaire survey was completed by one-to-one structured questioning. 1500 questionnaires were distrib- uted, 1200 were recovered, and 1056 valid questionnaires were obtained after eliminating invalid ones. A preliminary survey was conducted before the formal investigation to ensure the reliability and validity of the questionnaire. 3.2. Model Selection. In this paper, the willingness to sup- port the elderly is a binary variable, that is, willing and unwilling. Therefore, this paper selects binary logistic re- gression model. The model is set as follows: In the model, y; is the dependent variable, X; is the independent variable, f is the coefficient, and ¢ is the random disturbance term. Combined with this study, the final model is: where subscript I represents the ith rural resident to be interviewed. The explained variable is a 0-1 binary variable about the willingness of rural residents to participate in the mutual support for the elderly. If rural residents are willing to participate in the mutual support for the elderly, the value is 1; otherwise, it is 0. Special trust; represents the special trust of I rural residents interviewed, and universal trust; represents the general trust of the ith rural residents sur- veyed. Controls; represents the control variable of the ith rural resident.",
    "In this paper, IBM SPSS26.0 software is used to analyze variables at different levels. Model 1 only adds control variables for regression. Model 2 puts three variables of special trust on top of Model 1. Model 3 puts two variables of general trust based on Model 1. Model 4 puts all the variables for control variables, general trust, and special trust. The dependent variable is the willingness of rural resi- dents to participate in mutual care for the aged, and the index used to measure it comes from the survey question “Are you willing to provide mutual care for the aged? The answer is designed with two choices, ie., willing=1 and unwilling = 0, which is a dichotomous-dependent variable. The independent variables include special trust and universal trust. In the aspect of special trust, three vari- ables are set up: trust to children, trust to relatives, and trust to neighbors. In the specific investigation process, considering the understanding and acceptance ability of rural residents, the above three variables were trans- formed into the following questions: “I think children: most of them are not trustworthy, most of them are not trustworthy, the trustworthy and untrustworthy are evenly divided, most of them are trustworthy, most of them are trustworthy” “I think relatives: “I think neigh- bors: Majority untrustworthy, Majority untrustworthy, Majority untrustworthy, Majority untrustworthy, ma- jority trustworthy, majority trustworthy.” In terms of general trust, two variables are set: trust to village cadres and trust to other friends. These two variables were translated into the following question: “I think village cadres: the vast majority are not trusted, the majority are not trusted, the trustworthy and untrustworthy are evenly divided, the majority are trusted, the vast majority are trusted.” “I think other friends: most untrustworthy, most untrustworthy, trustworthy and untrustworthy, most trustworthy, most trustworthy.” “Most untrustworthy, most untrustworthy, trustworthy and untrustworthy half, most trustworthy, most trustworthy” reflects the trust intensity and is assigned 1, 2, 3, 4, 5, respectively. Control variables. According to the existing research conclusions, education level, family size, living style, in- tergenerational relationship, health status, economic status, age, and marital status among individual characteristic variables have a significant impact on the willingness of rural elderly to support each other for the aged [2, 6, 7]. In order to avoid research bias caused by omission of variables, other explanatory variables are controlled in this study, which are mainly divided into personal characteristics and family characteristics. One is personal characteristic variables, which mainly include gender, age, marital status, education level, and health status. Where, gender, assign “male” to 1 and “female” to 0; age is assigned according to different age groups; marital status was set as a categorical variable for four conditions in the questionnaire: unmarried, spousal, spousal (widowed), and spousal (divorced); education level, without any education is assigned 1, primary school is assigned 2, junior high school is assigned 3, senior high school is assigned 4, technical secondary school is assigned 5, and college or above is assigned 6; health status is the self- rated health status of the interviewees, and different health levels are assigned different values. The second is family characteristic variables, including intergenerational rela- tionship, living style, and economic status. Where the in- tergenerational variables were set as frequency of visits by adult children, with a value of 1 per week, 2 for half a month, 3 for one month, 4 for several months (from February to May), 5 for half a year, and 6 for one year or more. Residence mode is set as a classification variable for different situations. Economic status is set as personal income and is a con- tinuous variable(Table 1). 4.1. Descriptive Statistics of the Current Situation of Rural Mutual Assistance for the Elderly. Among the rural residents surveyed, 49.6 percent were male and 50.3 percent were female. Most of them had education below primary school, accounting for 53.7%. The age was 50-69 years old, ac- counting for 55.5%. Most of them were married, accounting for 83.5%; The health status was mainly relatively healthy and very healthy, accounting for 59.3%. The main source of monthly income is labor income, accounting for 62.4%. The majority of residents lived with their spouses or their children, accounting for 70.4% (see Table 2).",
    "Generally speaking, rural residents have a higher will- ingness to participate in mutual support for the elderly. To the question “Are you willing to provide mutual care for others?” When answering this question, 80.39% of re- spondents are willing to provide mutual care for the aged. Only 19.61% of the respondents answered that they are not willing to provide mutual care for the aged (see Figure 1). asusor'] suoURO. aAneasS aiquotdde oy q pousAod axe sajayse YO ‘9sn Jo soqnu soy Aresqy'] ouL[U £o[EA\\ Uo (SuoLIPUOD-puE-sULID} HOD’ Kd[tMW-AaeIq_oUr[UO//:sdny) In terms of gender, there is a certain difference be- tween male and female rural residents’ willingness to participate in mutual care for the aged. The willingness of female rural residents to participate in mutual care for the elderly was higher than that of male rural residents, and the willingness of female rural residents to participate in mutual care for the elderly reached 79.37%. In terms of age, rural residents of different age groups have different willingness to participate in mutual assistance for the elderly, showing the characteristics of younger people with higher willingness to participate and older people with lower willingness to participate. The willingness of rural residents under 70 years old to participate in mutual care for the elderly is higher, all above 80% level, and the willingness of rural residents under 50 years old to asusor'] suoURO. aAneasS aiquotdde oy q pousAod axe sajayse YO ‘9sn Jo soqnu soy Aresqy'] ouL[U £o[EA\\ Uo (SuoLIPUOD-puE-sULID} HOD’ Kd[tMW-AaeIq_oUr[UO//:sdny) suoLEPUOS puE SUL] oy 295 ‘[SZOZ/T 1/90] HO AreIqIT OUT AOIEAK ‘STPODET/ZZOT/SS 1 T'OL/LOPAUOD Aa], Arexqu outpuo//:sdyy Wo PopLo|UMOG “I *ZZOT “ERPS articipate in mutual care for the elderly is the highest. With the increase of age, the willingness to participate tends to decrease, and the willingness to participate of rural residents of all ages over 70 is around 60%. In terms of physical health, eople with better physical health have higher willingness to articipate, while those with poor physical health have lower willingness to participate. The rural residents of mutual endowment to participate are above the 80% level, health of rural residents’ mutual endowment to participate reflected to articipate in the transition between the good and bad health, very unhealthy and less healthy rural households mutual endowment to participate are around 65% level. In terms of marital status, there are differences among different marital status. Rural residents in the unmarried state are generally more willing to participate in mutual support for the elderly. In the married state, it is divided into different situations. Rural residents with spouse have a higher will- ingness to participate in mutual care for the aged, reaching 79.86%, while rural residents without spouse have a lower willingness to participate in mutual care for the aged, among which the widowed rural residents have the lowest will- ingness to participate in mutual care for the aged (see Table 3). Most elderly people in rural China want to spend their old age at home, and their favorite way to provide for the ged is family care. 74.47% of respondents hope to choose family pension, 19.75% social institution pension (nursing home), 2.41% mutual support pension, and 3.37% other options (see Figure 2). 2 Since ancient times, there has been a concept of ‘raising children for old-age” in China. For most of the derly in China, the main responsibility for supporting heir children is their children. The findings of this study onfirm this, 64.02 percent of the respondents said that hildren should be responsible for the elderly with chil- ren, followed by 8.05 percent who chose the elderly hemselves, 21.86 percent who chose the government, heir children, and the elderly, and 6.08 percent who chose he government (see Figure 3). Qaoomna 7 aa With the aggravation of China’s aging population, the family’s supporting function will gradually weaken. To solve the pension problem, we need to fun- damentally change the traditional pension concept. However, according to the survey of this study, elderly people in rural China have a low awareness of the mutua assistance pension model. 66.9% of respondents have not heard of mutual support for the elderly, 26.6% of re- spondents have heard of it but do not know much about it, and only 6.4% of respondents have heard of it very wel (see Figure 4).",
    "In China’s rural areas, with the aging of the population and the large-scale outflow of young and middle-aged labor force, the demand for elderly care services is increasing, and many elderly people have realized the necessity of mutua support for the elderly model. The survey of this study shows that 59.86 percent of respondents believe that it is necessary to develop mutual support for the elderly in the village, and people have recognized the necessity of mutual support for the elderly (see Figure 5). 4.2. Descriptive Statistics of Independent Variables and Control Variables. The core explanatory variables in this paper include special trust and universal trust element. Special trust mainly includes three variables: trust degree to children, trust degree to relatives, and trust degree to neighbors. General trust includes two variables: trust in village cadres and trust in other friends. Sex, age, education, marital status, and residence status were used as control variables. As shown in Table 3, in terms of the mean values of each variable, the mean values of the three variables in special trust are higher than those of the two variables in general trust. Among them, the mean value of trust in children is the largest, while that of other friends is the lowest. It shows that the current trust pattern of farmers based on family is obvious, and the interpersonal trust of farmers shows an obvious differential order pattern from close to sparse, from inside to outside. This is consistent with the traditional differential pattern theory and shows the family-oriented characteristics of traditional Chinese rural society summarized by previous researches. The difference is that the average trust degree of village cadres is higher than that of other friends. Since the reform and opening up, rural grassroots democracy construction has made certain achievements. Village cadres play a very important role in rural governance, and the average trust degree of farmers on village cadres is higher than that of other friends. 4.3. Multicollinearity Test. Before the regression analysis, considering that there may be internal correlations among variables such as rural residents’ trust in children, relatives, neighbors, village cadres, and other friends, this paper makes a multicollinearity diagnosis for each variable. Generally, when VIF > 3, there is a certain degree of multicollinearity between the respective variables. When VIF > 10, there is a high degree of collinearity between the respective variables. By selecting trust in children as the dependent variable and the remaining variables as the independent variables, the estimated results of collinearity test are shown in Table 3. VIF is less than 10. Based on all the estimated results, the collinearity correlation degree between the respective vari- ables is within a reasonable range (Table 4). 4.4, Binary Logistic Regression Results. In order to explain the effect of general trust and special trust on the willingness of rural residents to participate in mutual support for the aged, the regression results are shown in Table 5; three variables of special trust were added in model 2, two variables of general trust were added in model 3, and special trust and general trust were added in model 4. As the final model, the observed value of the Hosmer-Lemeshow statistic was 6.512, and the probability P was. 590 and is higher than significant level a, so the null hypothesis should not be rejected. It is considered that there is no significant difference between the distri- bution derived from the actual value of the sample and that derived from the predicted value, and the goodness of fit of the model is better. From model 1 to model 4, Nagelkerke r increased from 0.087 to 118, an increase of 35.632%. This shows that interpersonal trust plays an important role in asusor'] suoURO. aAneasS aiquotdde oy q pousAod axe sajayse YO ‘9sn Jo soqnu soy Aresqy'] ouL[U £o[EA\\ Uo (SuoLIPUOD-puE-sULID} HOD’ Kd[tMW-AaeIq_oUr[UO//:sdny) suoLEPUOS puE hypothesis 1 that the higher the trust level of rural residents towards their children and neighbors, the more likely they are to participate in mutual support for the aged, and vice versa, the less likely they are to participate in mutual support for the aged. However, the variable of trust in relatives has a negative effect on the willingness of rural residents to participate in mutual support for the aged. The possible explana- tion is that under the background of the current urbanization process in China, a large number of rural young and strong laborers have left their hometown and the outflow of rural labor forces blocks or limits the effectiveness of support. The old people in rural areas cannot rely on their children for their old-age support, while the rel- atives formed by blood relationship and asuaor suoumuo. oaneasD ajqvoridde amp Kq pouroros are sojonae VO ‘9sn Jo soqnu soy AreIqN'T OUI|UE AD[LA\\ WO (SUORNPUOD-pUL-sUDY/OD'Ao]LA\\-KxBIQhTOUTTUO//;sdyy) SUORIPUOD pur SUD 9xp 99g ‘[SZOZ/TI/9O] HO ArBIGHT UIUC ADIEA\\ “SZFODETIZZOT/SSI F-OI/MOpAUOD-opIA-AresquoUT|UO//:sdny WOY PaproUMoK] “I ‘ZZOZ “EPS Note. Standard error in parentheses, standard regression coefficient outside parentheses; *,**, and *** were significant at the level of 0.05, 0.01, and 0.001, respectively.",
    "geography can provide support to the old people nearby. When there is a need for old-age support, the old people can seek help from relatives; therefore, it is not a priority to participate in mutual support for the aged, so the trust of rel- atives has a negative effect on this variable. the higher their willingness to participate, which is consistent with the scholars’ theory of elite gover- nance. Trust to other friends and mutual support participation intention showed the opposite effect, the lower the trust to other friends, the higher the mutual support participation intention. First, the trust of other friends has an important impact on the will- ingness of rural residents to provide for the elderly, we should pay full attention to this factor. Secoond, the Rural Society in China is an acquaintance society, in which the active subjects have enough understanding of each other due to long-term contact, and the degree of Information asymmetry interaction is low, as a result, rural residents are more willing to choose acquaintances as cooperative partners to reduce the risk of old-age care. Therefore, the more they distrust other friends, they are more willing to choose mutual assistance based on acquaintances, the more willing you are to participate. general trust variable had a significant effect on the willingness to participate (P< 0.001). Hypothesis 3 of this paper is demonstrated. Special trust has no significant effect on rural residents’ willingness to participate in mutual care for the aged, while general trust has a significant effect. In today’s rural society, the interpersonal trust pattern of rural residents is changing: before the traditional blood relationship as the core of relative closeness which is formed by the special trust relationship with the stability of the society is gradually changing, special trust occupying the leading status in the pattern of relationships is changing, the situation of interpersonal trust rela- tionship gradually by the “special trust” the direction of “universal trust”; therefore, special trust has no significant effect on rural residents’ willingness to participate in mutual care for the aged, while general trust has a significant effect. Based on the above analysis, the main conclusion of this paper can be summarized as follows. (1) Both special trust and general trust have an impact on rural residents’ willingness to partic- ipate in mutual care for the aged, but the impact of special trust on rural residents’ willingness to participate in mutual care for the aged is not significant. General trust has a significant promoting effect on rural residents’ willingness to participate in mutual care for the aged. (2) Chinese rural residents’ trust in village cadres has a significant promoting effect on their will- ingness to participate in mutual assistance for the elderly. The trust of ordinary friends significantly inhibited their willingness to participate. (3) Gender, education level, living style and economic status of Rural Chinese residents have a positive impact on their willingness to participate in mutual care for the elderly; In particular, the degree of education has a significant promoting effect on the willingness to participate, the higher the degree of education of the elderly, the higher the willingness to participate in mutual support for the elderly. (4) There is an inverse correlation between age, marital status, health status, intergenerational relationship and rural residents’ willingness to participate in mutual care for the aged. The older people who live alone have poor health, poor intergenerational relationship with their children, and higher willingness to participate in mutual support for the aged. It should be pointed out that the willingness of rural residents to participate in mutual care for the aged will be affected by multidimensional factors. This study only ana- lyzes from the perspective of interpersonal trust, and a more systematic investigation can be carried out by combining macrolevel factors with microlevel factors. In addition, the sample of this study is a representative sample of Chinese rural residents, and the research conclusion is only appli- cable to Chinese rural residents. In future studies, we still need to further expand the sample range and improve the external validity and robustness of research conclusions. This study was supported by the project: A Study on the Construction of a New Rural Mutual Care Service Field Based on Social Networks (no. 18BSH164)."
]