[
    "Abstract. The role of the tertiary industry in economic development is more and more obvious. This paper, taking Henan Province as an example, explores the relationship between the internal structure of the tertiary industry and economic growth by building a multiple regression model. The study found that total retail sales of consumer goods and freight transportation volume have significant impact on economic growth. Henan Province should create a good consumption environment, continue to play the role of consumption driving economic growth. At the same time, the authority should give full play to geographical advantages, pay attention to the construction of transportation infrastructure, and provide transportation security for economic development. Since the implementation of reform and opening up, China has achieved rapid economic growth, and its total economic volume has reached the second place in the world, attracting worldwide attention [1]. However, there is no consensus on how China's economy can achieve leapfrog growth. Experts in different fields hold different views. In these views, structuralism holds that the evolution of industrial structure is the booster for China's rapid economic growth. The transfer of input elements between different sectors has obtained \"structural dividend\", thus achieving sustainable development. Most notably, with the rapid development of economic globalization, the tertiary industry plays an increasingly important role in the development of market economy [2]. The division of the primary, secondary and tertiary industries is a common way to divide the industrial structure in the world, but the countries are not completely consistent. In China, the tertiary industry refers to the service industry, which is other industries except the primary and secondary industries, specifically including transportation, storage and post, finance, real estate, accommodation and catering, scientific research, education, health and cultural industries, etc. The tertiary industry has rich connotation and its driving effect on economic growth has been paid more and more attention by the authorities. The contribution rate of the tertiary industry to GDP shows an increasing trend. According to the official website of China's National Bureau of Statistics, the contribution rate was 43.7% in 2009 and 59.4% in 2019, an increase of about 16% over the decade. China's industrialization has entered a later stage, and the tertiary industry has gradually replaced the secondary industry and become the leading industry of economic growth [3]. It can be found from the world economic development that the higher the level of a country's economic development, the higher the proportion of its tertiary industry in general. The booming development of the tertiary industry has become a global trend of economic development. Although the tertiary industry is developing rapidly, the degree of development varies greatly in different regions and provinces. As a populous province in the central region, the economic development of Henan province occupies an important strategic position in China. Although the role of the tertiary industry in the economic growth of Henan province continues to expand, its contribution rate to economic growth is still lower than the national level, which indicates that the development of the tertiary industry in Henan Province still has great potential [4]. Therefore, it is of great significance to study the relationship between the structure of the tertiary industry and economic growth, to better play the role of the tertiary industry, to promote the economic growth of Henan Province, and to realize the \"Rise of Henan Province\". The economic development of Henan Province has an important strategic position in the whole country. To accelerate the rise of the Central Plains and become an important national strategic support is both a requirement and a mission. \"Big But Not Strong\" has always been the label of Henan's economy. As a province where agriculture plays an important role, it is a clear path of economic development from realizing industrial development to paying more attention to the role of tertiary industry. At present, Henan Province has become the fifth largest economy in the country. To adjust the industrial structure and give full play to the role of the tertiary industry © The Authors, published by EDP Sciences. This is an open access article distributed under the terms of the Creative Commons Attribution License 4.0 (http://creativecommons.org/licenses/by/4.0/). By establishing a regression model of the relationship between the tertiary industry structure and economic growth in Henan Province, this paper explores the part of the tertiary industry structure that has the most significant impact on the economy of Henan Province, and puts forward policy suggestions for further optimizing the tertiary industry structure and promoting high-quality economic development.",
    "The development level of the tertiary industry is an important indicator of a country's economic development, which can be used to judge whether the economic structure is reasonable, whether the market is mature and whether the utilization of resources is adequate. Through the research, we can enhance the cognition of the structure of the tertiary industry, so as to improve the development environment of the tertiary industry. The connotation of the tertiary industry is very rich, each region has its own specific economic development resources and models, so it is necessary to formulate different development paths for it. To improve the development environment of the tertiary industry, we should start from the specific environment, resource advantages and development characteristics of the province, and make specific analysis of specific problems. This paper studies the relationship between the internal structure of the tertiary industry and the economic growth of Henan province, and puts forward suggestions from the perspective of optimizing the structure for realizing the leapfrog development of the tertiary industry. In the classical economic growth theory, Adam Smith thinks that the division of labor is an important factor to promote economic growth. National income per capita is an important indicator reflecting the economic development of a country. As for how to improve a country's national income per capita, Smith proposed to start from two aspects: On the one hand, it is necessary to increase labor productivity, in which division of labor plays an important role. On the other hand, there is a need to increase labor force, which can be achieved through capital accumulation. In Smith's theory of economic growth, he emphasized the influence of land, labor and capital on economic growth. Later, Ricardo explained economic growth from the perspective of income distribution, and proposed the importance of income distribution for economic development. An unreasonable income distribution system is not only not conducive to economic growth, but it will be detrimental to a country’s economic development. Around 1940, the British economist Harrod and the American economist Domar proposed an economic growth model, the Harrod-Domar model model. Their main idea is that capital is the only factor that determines economic growth and reveals the relationship between investment savings and economic growth. technological progress, rather than investment or savings, is the source of economic growth in the long run. Subsequently, economists have confirmed Solow's view through empirical analysis of economic growth. They found that in addition to the role of capital and labor, there was another exogenous variable that promoted economic growth, namely technological progress. Samuelson et al. supplemented and developed the model, thus forming the neoclassical growth model. The neoclassical growth model, however, does not account for the sources of technological progress. Since 1986, Romer, Lucas and others have been thinking about the previous economic growth theory, studying what determines the long-term economic growth rate. The research of these scholars is unified and summarized as the new economic growth theory. According to the theory, knowledge accumulation is not only the cause of economic growth, but also the result of economic growth. Unfortunately, this theory does not have a theoretical model accepted by most economists. At present, there are many researches on the factors that affect China's economic growth, involving a wide range of fields. Tang, Fu and Wang believe that technological progress is the result of technological innovation or technology introduction, and is manifested as an increase in total factor productivity [5]. However, the improvement of total factor productivity by technology innovation or technology introduction is only a necessary condition rather than a sufficient condition for the transformation of economic growth pattern. Theoretically, due to the impact of opportunity cost and reverse spillover of technology innovation, the effect of technology introduction on the transformation of economic growth pattern is more complex. Xu, Jia and Li believed that reasonable growth of real estate economy is of great significance to the healthy development of national economy [6]. At the same time, whether the real estate economic growth rate is too high or too low, it will affect the stable growth of the national economy. In order to ensure the healthy and stable growth of the national economy, we should maintain the reasonable growth of the real estate economy. Yang found that under different levels of development, the effect of finance on economic growth is different, which is manifested in the nonlinear characteristics of threshold effect and diminishing marginal efficiency [7].",
    "Gao summarized the theory of industrial structure evolution and summarized a series of evolution achievements [8]. The theory of industrial structure evolution can be traced back to the 17th century British economist Petty. Petty's theory shows that the improvement of labor productivity and the transfer of production factors from low efficiency industries to high efficiency industries play an important role in promoting economic development. Based on the classification of three industries, the economist Clark conducted statistics on the historical data of several countries, so as to obtain the general rule of industrial structure change in the process of economic growth. When the economy keeps growing and the national income increases, the labor force will follow the path of transferring from the primary industry to the secondary industry, and then from the primary and secondary industry to the tertiary industry. German economist Hoffman analyzed the industrialization process of nearly 20 countries from 1880 to 1929, especially the heavy industrialization. In the 1970s, American economist Kuznets further studied the main laws of industrial structure change, and made a more thorough investigation on the relationship between output value per capita and structural change from the perspective of labor structure, especially the structure of sector output value. He made a time series analysis of the industrial structure changes of economic development, and concluded that the tertiary industry has a strong characteristic of absorbing labor force. For the evolution of industrial structure, domestic scholars also try to demonstrate the evolution process and influencing factors of industrial structure of provinces and cities in China from different angles. Ma Hong and Sun Shangqing, famous economists in China, studied the relationship between China's industrial structure and economic development, and proposed that industrial structure is an important embodiment of the level of economic development of a country or region. The level of economic development and competitiveness of a country mainly depends on the industrial structure. Professor Fisher of the University of Otago, New Zealand, first proposed the concept of the tertiary industry in his book “the conflict between safety and progress” in 1935. The tertiary industry refers to the industry that does not produce material products [9]. Li summarized the concept and trend of the tertiary industry [10]. Wang analyzed the linkage between the tertiary industry and the national economy in detail, and divided the tertiary industry into six categories: transportation, warehousing and postal industry, wholesale and retail industry, accommodation and catering industry, financial industry, real estate industry and other types of industries [11]. The goal of this paper is to explore the impact of the tertiary industrial structure on economic growth in Henan Province. Through the establishment of multiple regression model to carry out empirical analysis, we can find out the parts of the tertiary industry that have greater and smaller impact on economic growth. Combined with the development background of Henan Province, the reasons are found and analyzed. Finally, we expect to put forward reasonable suggestions on optimizing the internal structure of the tertiary industry in Henan Province, which is conducive to the rational layout of the tertiary industry, stimulate the potential of economic development, and achieve sustainable development. Here we basically follow Wang's classification of the tertiary industry to select variables. Specifically, it includes the following nine variables: real estate investment completed this year (billion yuan), total retail sales of consumer goods (billion yuan), RMB loan balance of financial institutions at the end of the year (billion yuan), freight transportation volume (thousand tons), internal R&D expenditure (billion yuan), general public budget education expenditure (billion yuan), number of health institutions, added value of culture and related industries (billion yuan) and foreign exchange earnings from tourism (thousand US dollars). Set these nine variables as independent variables, and record them as X1, X2, X3, X4, X5, X6, X7, X8, X9. Finally, the GDP of Henan Province is set as the dependent variable, and GDP is used to measure the economic growth, which is recorded as Y. The data is from the statistical yearbook of Henan Province in 2019. Statistical Product and Service Solutions (SPSS) was used for regression analysis in this paper. The basic functions of SPSS include data management, statistical analysis, chart analysis, output management and so on. SPSS can be used for descriptive statistics, mean comparison, general linear model, correlation analysis, regression analysis, cluster analysis, time series analysis, etc.",
    "Multiple linear regression model is a linear regression model with multiple independent variables, which is used to reveal the linear relationship between dependent variables and multiple independent variables. The empirical model of multiple linear regression equation is as follows: The regression model used to study the relationship between the tertiary industry structure and economic growth of Henan Province is shown as follows: According to the established model, stepwise regression analysis was carried out with SPSS to eliminate multicollinearity. The results are shown in Table 1-Table 3. The adjusted coefficient R squared is 0.996, which is very close to 1, so the regression equation fits well, and the change of independent variables has a great impact on lependent variables. X2 and X4 pass the T test. According to the output results, the regression model can be obtained as follows: Y = 497.071 + 1.848X2 + 0.001X4 (3) In the above regression equation, the intercept term represents that when the independent variables X2 and X4 are zero, the value of Y is 497.071 billion yuan. The partial regression coefficient of 1.848 means that when X4 remains constant, Y increases by 1.848 billion yuan for every billion yuan increase in X2; The partial regression coefficient of 0.001 means that when X2 remains constant, Y increases by 0.001 billion yuan for every thousand tons increase in X4. This shows that X2, total retail sales of consumer goods, has a greater impact on GDP. This paper makes an empirical analysis of the economic growth of Henan Province driven by the tertiary industry with the method of multiple regression. After eliminating multicollinearity, total retail sales of consumer goods and freight transportation volume have significant impact on economic growth. Consumption is the stabilizer of economic growth. As a province with a large population, Henan Province has a great demand for various kinds of consumption, which has played a great role in promoting economic development. On the one hand, supply-side structural reforms provide urban and rural residents with more and better product choices and promote consumption. On the other hand, the increase in the level of economic development and residents' disposable income has spurred various types of demand and also promoted the development of production. Henan has a large population and the size of middle- income groups continues to expand, and its consumption cannot be underestimated. In the future, authorities should create a favorable consumption environment in terms of policies and laws, continue to stabilize the consumption scale and level of urban and rural residents, pay attention to the development of emerging markets and improve consumer satisfaction. can directly reflect the economic prosperity, to some extent is a barometer of the economy. Freight volume is closely related to the construction of transportation infrastructure. From the geographical point of view, Henan Province is located in central China, and Zhengzhou, its capital, is an important transportation hub, and various transportation modes are competing for development. In 2019, the Ministry of Transport designated Henan province as one of the first pilot areas for transport construction. In the future, the authorities need to seize the opportunities of transportation development and provide a _ good transportation environment for economic development."
]