[
    "aBanking Department , School of Economics, Finance and Banking, College of Business, Universiti Utara Malaysia, 06010, Kedah, Malaysia. bSchool of Innovation and Entrepreneurship, Pingdingshan University, Pingdingshan, 467000, China. Abstract Digital financial services (DFS) have gained significant importance since the Covid-19 outbreak, yet the elderly population remains understudied in this context. In China, the elderly population is rapidly growing, making it crucial to focus on enhancing their technology adoption behavior. This study attempts to fill the literature gap by considering the usage behavior of the elderly population toward digital financial services aged 65 and above, particularly in context of the Henan Province of China. This study employed a face-to-face survey method and primarily used PLS-SEM to analyze data collected from 382 individuals aged 65 and above in Henan, China. The findings suggest that behavioral intention significantly mediates the relationship between facilitating conditions, technology anxiety, perceived risk, perceived trust, and DFS usage behavior. Furthermore, the study identifies facilitating conditions, technology anxiety, and perceived risk as significant predictors. This research contributes to the literature by exploring the barriers and enablers of technology adoption among the elderly China, offering insights on bridging the digital divide and promoting financial inclusiveness. Expands the understanding of technology adoption among elderly individuals in China. Identifies key barriers and driving factors influencing their behavior. Provides insights into bridging the digital divide and promoting financial inclusion. The advent of digital finance has revolutionized the way financial services are provided. With characteristics such as high efficiency, low transaction costs, and high accessibility, digital finance is recognized worldwide as an effective means of reducing financial exclusion and promoting inclusive financial development. However, in the process of China's digital financial development, an issue has arisen: the adoption rate of DFS is considerably lower among the elderly than among the other groups. The 49th Statistical Report on China’s internet Development, released by the China internet Network Information Centre (CNNIC), shows that the number of elderly people aged 60 and above who use the internet is 119 million, and only 32.8% of these people have the ability to use digital financial platforms independently (CNNIC, 2022). Qi and Li (2019) reported that elderly individuals were 20.58% less likely to utilize these services than middle-aged individuals were, indicating reluctance among elderly individuals toward adopting digital financial services (DFSs), which creates inequalities in accessing DFSs. In addition, the limited adoption of DFS has resulted in various adverse outcomes, such as a reduction in consumption and economic expansion, along with economic inequality potentially impacting GDP growth (Zhang et al., 2020; He et al., 2020; Jiao, 2019; Qi & Li, 2019). Finally, the limited adoption rate of DFS among the elderly population may lead them to seek informal channels for their financial needs, such as private lending. This move exposes this demographic to elevated economic risks, including poor investment decisions and potential fraud (Jiao, 2019). Statistics indicate that the proportion of the elderly population (aged 60 years and above) in rural areas of Henan is significantly greater than that in urban areas and towns (22.69% in rural areas compared with 14.33% in cities and 14.39% in towns), highlighting a crucial aspect of Henan's demographic profile. Similarly, the population aged 65 and above in rural areas constitutes 17.36% of the total population, surpassing urban areas by 7.21 percentage points and towns by 6.81 percentage points (Zheng et al., 2023). These figures underscore a critical trend: the rural areas of Henan are experiencing a more accelerated rate of aging than urban centers are. This trend has profound implications for financial services and policies aimed at elderly individuals, particularly in terms of access to and the design of DFSs. The rural elderly population in Henan, potentially isolated due to the migration of the younger workforce and lack of traditional financial infrastructure, represents a key demographic for the study of financial inclusion and the potential impact of DFS. In addition, Zheg et al. (2023) argued that China is facing the digital divide problem in the sense that the younger population has easy access, whereas the elderly population still finds it difficult to adopt DFS. This has led to a serious economic divide within the country. The adoption of digital financial services among the elderly has also remained a significant issue in other countries. For example, Choi et al. (2024) reported that the South Korean context has lower levels of DFS adoption among elderly people. Furthermore, the phenomenon of lower adoption levels among elderly people also exists in developing nations; for example, Jena (2023) suggested that elderly people in India are hesitant to adopt digital financial services because of a lack of knowledge and perceived privacy risk. Similarly, elderly people in Malaysia exhibit a lower tendency to adopt digital financial services. Therefore, this study aimed (i) to assess the factors influencing the usage behavior of the elderly toward DFS and (ii) to assess behavioral intention as a key mediator in DFS adoption among the elderly in Henan, China.",
    "Digital finance is a concept in which licensed financial institutions harness digital tools to forge an integrated ecosystem, leveraging data synergies to deliver intelligent financial services to customers (Alkhwaldi et al., 2022). DFS refers to financial services delivered through digital channels such as mobile devices, cloud computing, digital platforms, and distributed ledger technologies (Agur et al., 2020). These services encompass traditional financial tools such as debit and credit cards, as well as innovative fintech solutions (Hassan et al., 2022). DFS includes digital currency, payments, loans, credit, securities, insurance, wealth management, and others (Awotunde et al., 2021). Moreover, digital finance offers many advantages to various stakeholders, including users of digital financial products, governments, financial service providers, and the overall economy (Hua & Huang, 2021; Shofawati, 2019). Facilitating conditions (FCs) are conceptually defined as the degree to which an individual believes that organizational and technical infrastructure exists to support the use of a specific system. Venkatesh et al. (2003) validated the connection between FC and usage behavior. In the context of digital technology, FC often directly influences an individual’s intention to use a new technology or system. FCs have been found to significantly affect the behavioral intention of people to use mobile payments for online transactions (Nur & Panggabean, 2021). Hence, on the basis of the literature, this research hypothesizes the following: Technology anxiety (TA) refers to an individual’s anxiety or emotional response to digital financial services. It is a negative psychological factor that affects users' willingness to adopt (Dragano & Lunau, 2020). Many researchers have noted that TA is a critical factor when studying user acceptance of new technological products or services (Hoque & Sorwar, 2017; Tsai et al., 2020). Mariano et al. (2022) argued that when elderly people encounter stereotype threats in the technological sphere, their anxiety and apprehension toward technology usage increase, diminishing their anticipated ease of use. Hence, this research hypothesizes the following: Perceived risk (PR) refers to the psychological expectation of elderly people about negative outcomes when digital financial services are used, that is, the possibility of elderly people anticipating that they may suffer losses (Amirtha et al., 2020). Chaveesuk et al. (2021) investigated the utilization of digital payments in the retail sector in the context of Thailand and highlighted the significant influence of PR on the adoption of digital payment technology. Hence, this research hypothesizes the following: Perceived trust (PT) refers to the extent to which consumers feel a sense of security, integrity, and reliability in the service or product provider (Cao et al., 2018). Rahman and Rahman (2023) supported this relationship in the sense that trust significantly influences the use of digital financial services, particularly when consumers face an increased risk of uncertainty. Hence, this research hypothesizes the following: The impact of behavioral intention on usage behavior has been studied extensively, especially in the digital context. This is particularly true when consumers engage in financial transactions via digital media. Past research has shown that behavioral intention significantly affects consumers’ usage behavior when driven by factors such as effort expectancy and performance expectancy (Meiranto et al., 2024). This increased level of behavioral intention strongly affects usage behavior. Furthermore, Karyoto et al. (2024) confirmed the findings of previous research that assessed the link between behavioral intention and usage behavior. Thus, this research hypothesizes the following: Facilitating conditions are crucial constructs used in technology adoption and acceptance research and were initially formulated by Venkatesh et al. (2003) in the UTAUT model. Essentially, it denotes the perception that necessary resources and assistance are available to ensure smooth operation and troubleshooting when a particular technology or system is used. A study conducted by Nur and Panggabean (2021) revealed that FC significantly affects the behavioral intention (BI) of online transactions that utilize mobile payments. Alalwan et al. (2018) utilized an extended UTAUT model to examine the drivers of customers' BI and internet banking adoption behavior in the context of Jordan and introduced perceived risk as a new external variable in their model. Their conclusions revealed the significant influence of FC on the adoption behavior of internet banking applications. Hence, this study proposes the following hypothesis: Technology anxiety (TA) is an adverse emotional reaction triggered when individuals utilize technology in practical situations due to fear or discomfort. Dewi et al. (2020) reported that the emergence of new technology, in addition to benefiting users, also induces feelings of compulsion, chaos, and isolation. This, in turn, triggers anxiety, fear, and a sense of defeat, causing users to evade or limit their exposure to new technologies (Bhatt, 2022; Tsai et al., 2020). Elderly people generally possess lower levels of technological skills and self-efficacy (Moudud-Ul-Huq et al., 2021). As a result of declining physical conditions and unfamiliarity with information technology, elderly individuals exhibit higher levels of TA than younger individuals do (Meng et al., 2022). Hoque and Sorwar (2017) affirmed the connection between TA and BI in the context of mHealth technology. However, this relationship has not been proven in digital finance. Therefore, this study hypothesizes the following.",
    "Bauer (1960) emphasized that consumers encounter various uncertainties when engaging in purchasing activities and that every purchase entails unforeseen consequences and associated risks. Amirtha et al. (2020) conducted a study focusing on the influence of perceived risk (PR) dimensions on BI toward e-shopping behavior, and the findings revealed that PR influences online purchase behavior. Chaveesuk et al. (2021) investigated BI and the actual utilization of digital payments and highlighted the significant influence of PR on BI when digital payment technology is adopted in Thailand. Their study was conducted in the context of COVID-19, and whether its findings remain applicable in the postpandemic era needs to be confirmed. Therefore, this study hypothesizes the following. In the context of a DFS, trust pertains to a user's belief that a service is reliable, secure, and operates in the user's best interest. Elderly people, in particular, need to trust digital services because they may be more concerned about security, privacy, and fraud. Mansur et al. (2019) explored the link between technology concepts and online shopping behavior and highlighted the vital role of trust in promoting customers’ BI to adopt e-commerce. De Leon (2019) investigated the drivers of BI affecting retail bank customers' use of mobile banking. These findings emphasize the significant impact of trust on individuals’ intentions to adopt mobile banking services. Although studies have demonstrated that trust has an effect on behavioral intentions, the relationship among elderly people in this area has yet to be proven. Therefore, this study hypothesizes the following. Behavioral intention is an important mediator in the relationship between FC and the concept of usage behavior across different digital contexts. The present body of literature indicates that facilitating conditions such as the availability of resources, technical support, and usage training significantly affect BI, which ultimately influences the usage behavior of digital consumers. This is evident from several studies; for example, Safitri et al. (2024) reported that habits, facilitating conditions, and technology anxiety significantly affect users’ behavioral intentions, leading to an increased level of positive usage behavior. Similarly, Tsai et al. (2020) further supported the findings of Karyoto et al. (2024), particularly in the context of e-wallets. Safitri et al. (2024) argued that facilitating conditions significantly mediate the relationship between customers’ perceived ease of use and their behavioral intentions. Khan and Abideen (2023) argued that the behavioral intention of users is shaped by the consumer’s perception of risk associated with the product or service. This significantly affects consumer usage behavior toward a product or service. Thus, on the basis of the literature, the following hypotheses are proposed: H10: Behavioral intention significantly mediates the relationships among facilitating conditions, technology anxiety, perceived risk, perceived trust, and usage behavior of elderly people. To assess the factors influencing the usage behavior of the elderly toward DFS and evaluate behavioral intention as a key mediator in DFS adoption among the elderly in Henan, China, we employed a quantitative approach via structural equation modeling with the PLS method. The questionnaire designed for this study was composed of three parts. The first contained items concerning the respondents’ demographic details. The second part of the questionnaire consisted of items on technology and digital literacy. The third part of the questionnaire consisted of scales consisting of items measuring the constructs under study, which mainly used a 5-point Likert scale for response recording ranging from “Strongly Disagree” to “Strongly Agree.” Furthermore, these scales were adopted from various studies; for example, scales measuring facilitating conditions and technology anxiety were adopted from Hoque and Sorwar (2017). The scale for measuring perceived risk was adopted from a study by Wu et al. (2017). The scales for perceived trust, behavioral intention, and usage behavior were adopted from Tian et al. (2023). Before the formal study was conducted, a pilot study was performed to establish the reliability and validity of the scales used in the study. Moreover, the results of the pilot study, particularly concerning reliability and validity, were assessed via Smart PLS-4. Cronbach’s alpha was used to assess the internal consistency of the variables. A pilot study revealed that the Cronbach’s alpha values were greater than 0.70, indicating good internal consistency among the items. In addition, the AVE values were greater than 0.500, indicating an acceptable level of convergent validity of the constructs. Additionally, the content validity of the questionnaire was assessed.",
    "Researchers collected data from 420 respondents, and 382 completed questionnaires were included in the analysis. This resulted in a response rate of 90.95%, which was considered quite good. The self-administered survey method was used to collect quantitative data from elderly citizens in Zhengzhou, Henan Province, China, who were aged 65 years or above. A closed- ended questionnaire was developed and used to collect data. Table 1 classifies the respondents on the basis of their gender, age, current residential area, education level, and occupation. Sampling is the process of selecting a specific subject from a predetermined population to represent the population according to predetermined criteria. To facilitate generalizability, this study utilized simple random sampling. Simple random sampling enables the researcher to consider the characteristics of the population. For this reason, simple random sampling has been used(Campbell et al., 2020a). Furthermore, to ensure the inclusion and targeting of the intended audience from the desired demographic, the present study employs simple random sampling in accordance with the predetermined sample size. This entails the selection of senior citizens who have prior experience or familiarity with digital financial platforms. The use of simple random sampling is critical in survey research, particularly when working with a sizable target population. This approach guarantees the collection of precise and statistically significant data by mitigating sampling errors (Jariyapan et al., 2022a; Jena, For data analysis, this study used a quantitative research approach to assess the relationships among the variables given in the model under study via structural equation modeling (SEM) in Smart PLS version 4. Moreover, a measurement and structural model were used to perform data analysis in the Smart PLS. The structural fitness of the model was assessed via a measurement model, and the structural model was used to test the hypotheses. This study employed nonrandom purposive sampling, as this approach appears to be suitable for data collection. The measurement model was used to assess the reliability and validity of the constructs. The results of the measurement model are presented in the following Tables 2,3 and 4. Analysis of the measurement model revealed that all values were within the acceptable range. For example, refer to Table 2, which shows the results of construct reliability and validity. The Cronbach’s alpha and composite reliability values for all the constructs fell within acceptable ranges, as specified by Sekaran and Bougie (2016). Sekaran and Bougie (2016) argued that the values for both aforementioned reliability parameters should be equal to or greater than 0.70. In addition, Table 2 indicates that the average values extracted (AVE) also lie within the recommended range. Hair et al. (2022) argued that AVE values should be equal to or greater than 0.50. Therefore, in accordance with the recommendations of Hair et al. (2022), all the constructs under study are convergently valid. Furthermore, Table 3 presents the results of discriminant validity using the Fornell–Larcker criterion. The current study used this criterion, which involves the comparison of values yielded by the correlation matrix with AVE squared-root values in diagonals. According to Table 3, all AVE squared root values in AVE diagonals were greater than the intercorrelations with other variables, confirming discriminant validity. Additionally, this study also verified the presence of discriminant validity by displaying values of the heterotrait‒monotrait correlation ratio (HTMT), the value of which should be less than 0.90 for discriminant validity (Sarstedt et al., 2021). Considering the insights provided by Sarstedt et al. (2021), the results presented in Table 4 confirm the presence of discriminant validity among the constructs. After performing the measurement model analysis, researchers attempted to assess the structural model by testing the hypotheses developed in the second section of this study. In this section, the researchers assess the structural model via path analysis and the fitness of the given model. Moreover, the bootstrapping technique was chosen at the 5% significance level. This means that the minimum threshold value of the t statistic is set to 1.96. This will help us to determine whether the hypothesis is accepted or rejected. According to Table 4, all the direct hypotheses except H4 are supported. The P values of all hypotheses except H4 are less than 0.05, which implies that facilitating conditions, technology anxiety, perceived risk, and behavioral intentions significantly affect usage behavior, whereas perceived trust appears to have an insignificant effect on the dependent variable under study. Hence, the collected sample did not provide enough statistical evidence to support the direct relationship between perceived trust and usage behavior. Similarly, the P values of all hypotheses from H6 to H9 are less than 0.05, which implies that facilitating conditions, technology anxiety, perceived risk, and perceived trust significantly affect behavioral intentions. Table 5 presents the mediating results obtained from the sample.",
    "According to Table 5, all the direct hypotheses except H4 are supported. The P values of all hypotheses except H4 are less than 0.05, which implies that facilitating conditions, technology anxiety, perceived risk, and behavioral intention significantly affect usage behavior, whereas perceived trust appears to have an insignificant effect on the dependent variable under study. Hence, the collected sample did not provide enough statistical evidence to support the direct relationship between perceived trust and usage behavior. In contrast, previous studies by Liu et al. (2019) and Hooda et al. (2022) demonstrated a positive correlation between trust and users’ adoption of emerging technology. These findings contradict the results of this study. This discrepancy may be attributed to the focus on the elderly group, for whom the adoption of digital products may depend more on external support (e.g., facilitating conditions) or internal emotional factors (e.g., technology anxiety). Even when trust in digital products is present, a lack of technical support or heightened technology-related anxiety may still impede their use of DFS. Similarly, the P values of all hypotheses from H6 to H9 are less than 0.05, which implies that facilitating conditions, technology anxiety, perceived risk, and perceived trust significantly affect behavioral intention. Table 5 presents the mediating results obtained from the sample. According to Table 6, behavioral intention has a positive and significant mediating effect on the relationship between facilitating conditions. Hence, H10a is supported. Moreover, behavioral intention has a negative and significant mediating effect on the relationship between technology anxiety and usage behavior; thus, H10b is supported. Behavioral intention has a negative and significant mediating effect on the relationship between perceived risk and usage behavior. This finding indicates that H10c is also supported. Interestingly, the present data failed to support the link between perceived trust and usage behavior, indicating that H10d was not supported. Figure 3 shows the results of the measurement and structural model, in which the loadings for all the constructs are shown. In addition, Figure 3 displays the beta coefficients that belong to the structural model. After testing the hypotheses, it was necessary to perform a model fitness analysis via different approaches, such as SRMR, F2, VIF, and R2, as recommended by Garson (2016). However, this research employed the SRMR approach for the validation of the model because it highly minimizes type 1 error in the sample and proves to be the best estimator for structural modeling (Pavlov et al., 2021). The SRMR represents the approximate fitness of the model. Moreover, Hu and Bentler (1998) proposed that the given model has a good level of fitness if the SRMR value is less than 0.08. In addition, Hair et al. (2014) relaxed the SRMR value to 0.10. However, in Table 7, the SRMR value for our model is 0.038, which is much lower than the cutoff value of 0.08. Note:This figure includes both measurement and structural models, as loadings for all variables have been provided along with beta values present on paths referring to the structural model. First, statistical evidence has shown that facilitating conditions have a positive and significant effect on the usage behavior of elderly people, whereas statistical evidence also shows that technology anxiety and perceived risk negatively and significantly influence the usage behavior of elderly people. Interestingly, the findings also showed that there was an insignificant impact of perceived trust on the usage behavior of elderly people toward DFS. Second, all the mediation effects were significant. For example, the statistical evidence from the given sample revealed that behavioral intentions significantly and partially mediate the relationship between facilitating conditions and usage behavior. This means that elderly individuals will positively increase their usage behavior if they are provided with more facilitating conditions. Behavioral intention negatively and partially mediates the relationship between technology anxiety and user behavior, thus implying that the more elderly people feel anxiety while using technology, the less likely they are to adopt technology. Moreover, behavioral intention also negatively and partially mediated the relationship between perceived risk and user behavior. This finding suggests that increased levels of insecurity or exposure to other kinds of risk significantly reduce behavioral intentions, which ultimately results in elderly people avoiding the adoption of DFS. Finally, behavioral intentions fully mediate the relationship between perceived trust and usage behavior. Thus, increased levels of perceived trust increase the behavioral intentions of elderly people, which increases their tendency to exhibit positive usage behavior. Hence, all direct path hypotheses except H4 are accepted. Moreover, the direct path results in our study strongly align with those of previous studies (Nur & Panggabean, 2021; Dragano & Lunau, 2020; Amirtha et al., 2020).",
    "The results of this study, particularly in the context of digital financial service adoption, align with those of Srivastava et al. (2024) and Anane and Nie (2022). However, the results regarding the effect of perceived trust on usage behavior contrast with those of Suryawan and Santikasari (2024) and Utomo et al. (2024), which strongly support the role of perceived trust in shaping usage behavior in the context of the DFS. This insignificant effect of perceived trust on usage behavior can be justified in the sense that elderly people value the family and their social circle more, owing to which the trust factor is overshadowed. Furthermore, the mediation results of this study are consistent with the results of a previous study conducted by Gadiman et al. (2023). It is suggested that DFS providers must encourage and enhance facilitating conditions for digital consumers, particularly the elderly market segment, to encourage the behavioral intention and usage behavior of elderly digital consumers. In addition, DFS providers need to devise strategies that may reduce technology anxiety and potential risks associated with digital platforms. This will help digital consumers adopt more technology-oriented behaviors. It is further suggested that usage behavior is affected in the following ways. First, usage behavior is directly affected by facilitating conditions, technology anxiety, and perceived risk. Second, usage behavior is also affected by the partially occurring mediating role of behavioral intention, whereas it is also affected by the full mediating role played by behavioral intention and perceived trust acting as an antecedent of it. This study assessed the drivers and deterrents influencing the adoption behavior of DFS among elderly individuals via the Alipay and WeChat Pay platforms. From the findings of this study, it can be concluded that if elderly people are provided with technical support and usage training, along with reduced levels of technological anxiety, they are most likely to increase their behavioral intention, which in turn makes them adopt digital platforms for their financial transactions and other activities. Moreover, if the elderly population perceives reduced levels of risk or if the service provider increases their sense of security or credibility in the digital service, they are more likely to exhibit favorable behavioral intentions, which ultimately enhance the usage behavior of the elderly population toward DFS. Finally, the findings of the study will be helpful for policymakers to fulfill the needs and concerns of elderly citizens in China related to the usage of digital finance services and highlight the challenges and barriers related to the adoption of digital finance services among the targeted population of China. The theoretical contribution of this research can be explained in the sense that it validates the unified theory of acceptance and use of technology (UTAUT) in the Chinese context by assessing determinants that significantly drive adoption behavior in the elderly population. Second, this study focuses on building an empirical model to understand the mechanism of usage behavior. Moreover, future research should involve studying this model in different contexts in terms of different population segments or areas, with the possibility of adding other variables to a model to make it more comprehensive and predictive. In this study, all procedures involving human participants were conducted in accordance with institutional and/or national research committee ethical standards. Prior to the study’s commencement, ethical approval was obtained from the university's ethics committee. The committee reviewed and approved all aspects of the study to ensure compliance with ethical principles and standards. The participants were informed about the study's purpose and procedures before participation and provided written consent. All the data collected during the study were treated with strict confidentiality and anonymity to protect the privacy and well-being of the participants. Any identifiable information was removed or anonymized before analysis. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper."
]