[
    "1 Sustainable Architecture and Landscape Design, Politecnico di Milano, Milano, 20133, Italy 2 Architecture - Built Environment Interiors, Politecnico di Milano, Milano, 20133, Italy Abstract: The construction of pit cave dwellings is a longstanding custom in China. However, as living standards have increased, this distinctive style of building is being gradually forgotten. Sanmenxia, Henan Province is known for its unique clay, which has contributed to the advancement of construction and architectural design. The region's unique climate, which is warm in the winter and cool in the summer, has also made people more nostalgic, which has led to a boom in the tourism industry. It's urgent to figure out how to revitalize and change the historic structures that will soon decay and vanish into something new in order to stay relevant.This essay explores the distinctive architectural style of China's pit cave dwellings, capturing its essence and adapting it to modern demands. It also serves to highlight the disappearing ancient architectural and cultural form while revitalizing the abandoned kiln and bringing it back to life. Enhancing the recreational area for the locals and drawing attention to the region's distinctive culture, the abandoned kiln will be transformed into a tourist destination with cultural activities. courtyards, New models of tourism development, Cultural heritage, Cultura inheritance, Landscape protection, Sustainable rural construction, Ecological protection, Heritage protection, Regional culture. Unique clay in Henan Sanmenxia achievements of special building forms and architectural structures, with characteristics of warm in winter and cool in summer, the improvement of living standards and the tourism industry is booming at the same time, also awakened people's nostalgia, how to renew and renovate the old buildings will soon be dilapidated and disappeared to become a new force to keep up with the times is imminent. the The tourist center is a structure and architectural complex that is situated next to or around a picturesque area and serves as a place for visitors to rest, stay overnight, eat and drink, see exhibitions, attend lectures, participate in cultural exchanges, observe unique folk crafts and customs in the area, buy trinkets, learn about cultural history, and inherit traditional culture. When the virus subsided, people were eager to shed their masks and explore the outside world. The epidemic era also made us appreciate how important it is to experience the beauty of the world, which is why the travel and tourism sector took off. The strongest evidence that people prefer to view attractive locations with cultural and historical backgrounds over plain landscape is the growing trend of learning while playing. Cities with lots of picturesque locations or scenic areas need tourist centers. In addition to implementing real name management to control individual tourist behavior and distributing visitor flow in a reasonable and uniform manner, these departments also have the ability to plan and organize tourism-related events, minimize human and material resource waste, and encourage sustainable economic and The goal of Henan Province's historical and cultural city establishment is to put in place a system for safeguarding each city's historical and cultural legacy. The provinces that have been designated as historical and cultural cities are all those that have substantial historical research, rich collections of cultural artifacts, or exceptional commemorative significance, and all of these things happen to be intact historical and cultural legacy. There are many scenic spots worth visiting around Miaoshang Village in Sanmenxia City, Henan, such as Yangshao Village Ruins, Guo State Cemetery, Baolun Temple Tower, Miaodigou Ruins, Hongqing Temple Grottoes, Beiyangping Ruins, Anguo Temple, Buzhao Zhai Zhai Ruins, Lushi City God Temple, Xin'an Ancient City Ruins, the Shihao Section of the Xiaohan Ancient Road, including Miaoshang Village, are 12 national scenic spots. There are also 4A-level ancient villages in scenic spots such as Shaanzhou Dikengyuan, which has the famous Shaanzhou Top Ten Food Bowls, and Swan Lake National Wetland Park. China's distinct geology and culture have produced a distinctive folk cultural heritage that includes subterranean Pit and cave courtyard, which are remnants of the ancient people's methods of living in caves. As the times change, so do the purposes that structures serve. Many historic structures are no longer able to accommodate modern needs. The decision to demolish them is tough for individuals because of their unique historical and cultural significance. Therefore, a key concern in architectural renovation is how to revitalize structures that have lost their original purposes. The the Considerable progress has been made in restoring historic districts, dilapidated industrial structures, warehouses, and other properties. For example, the Louvre is now a museum instead of the former residence of over fifty kings and queens. China's Kuanzhai Alley in Chengdu has generated economic value in addition to preserving its historical significance, and the 798 Old Factory Building in Beijing has been converted into an art area As a national major cultural relic protection unit, Miaoshang Village, Sanmenxia City's distinctive Chinese underground courtyard is also listed. China will have the chance to display its creative response to bringing the energy of the modern day into this ancient architectural complex.",
    "This design examines a distinct architectural type seen in China: cave dwellings, takes its features and adapts them to a form that satisfies modern requirements; Bring attention to the increasingly vanishing historic architectural styles and culture while giving abandoned cave dwellings new, expressive, and functional shapes; Converting deserted cave houses into tourism hubs would increase visitor numbers and support the region's distinctive culture while enhancing the quality of life for locals. Demonstrate the preservation and highlighting of its historical significance while generating income. Because so many of the village's youth have moved into the city, Miaoshang Village has been steadily abandoned, leading to numerous collapses and damages. It has improved and is well-preserved, with historical significance for visiting and learning, after the state designated it as a major protected unit. The number of visitors to Henan, both domestic and foreign, is growing. However, a number of incidents involving transportation disruptions, crowding and scarcity of people in popular tourist locations, arbitrary pricing and fraud, and subpar services have hurt Henan's tourism industry as well as China's reputation for providing good service. Only then can the tourism industry be standardized, the international tourism service industry truly go out of the country and culture go global, and a large tourism center be established in Miaoshang Village. Travel information of tourists will be managed in real names, the number of people and special cars in various scenic spots will be reasonably scheduled, and a comprehensive and worry-free tourism model will be created. A residential architectural complex of enormous significance for the inheritance of intangible cultural assets, the pit courtyard community in Sanmenxia City is worth researching both historically and culturally. Tucked away in a sunken section of the Loess Plateau, the \"underground quadrangle\" is a typical dwelling design reminiscent of cave architecture. The portion below ground has been kept exposed while the above ground portion has been gradually covered. One of the seven national essential cultural relics protection units at the moment is the Pit Kiln Courtyard in Miaoshang There are many underground pit buildings here that are in good preservation. While returning to Beijing in the late Qing Dynasty, Empress Dowager Cixi passed the night in a pit courtyard. It provided Empress Dowager Cixi with a semblance of peace for her wandering and lonely soul, even though it was not as gorgeous and cozy as in the Forbidden City. There is a serene environment that soothes the soul as soon as one enters this area. Owing to the underground location of most buildings, individuals frequently \"only hear their voices, but do not see their people.\" The only signs of the passage for each household leading down to the pit are the large trees at the entrance. The clay dwellings carved out of the caves are entirely constructed in the shape of a classic walled courtyard. There is an obvious sense of order and seriousness to the square sunken space, which is placed neatly beneath the surface of the ground. There are square boxes on the ground here that lead to the subterranean courtyard and the arched tunnels. Because of its unique stress structure, the space is hollow and won't collapse. Aesthetic fatigue is inevitable due to the repetitive sinking and squareness, which calls for specific features to be triggered but can be effectively incorporated into the appearance and cultural traits of old villages. Following the possibility assumption that multiple plans should be made based on an understanding of the actual situation of the site and comparing the characteristics of each plan to obtain the optimal solution for the form, I should make use of the surrounding mountain landscape and agricultural wheat field landscape, both of which are excellent cultural landscape resources. The building's arched form, which is adaptable, striking, and unique, is the second dynamic feature that the site needs to include in order to provide life to the entire town. The definition of nature in the mind of designer Zhu Pei is not limited. When a house is constructed amid a forest, it is referred to as a natural building rather than just a green structure. It is evident that this is a crucial angle and rule for human survival in this world. For instance, human construction has evolved from passive burrowing to active construction as a result of natural selection. The picture we see, the Hanging Temple, is a perfect combination of cave dwelling and nest dwelling. People discovered the cave and began to build a nest like house in front of it in order to introduce sunlight. This is a very primitive idea, but it takes into account both the environment and climate.",
    "Not only does nature influence human survival, but it also influences human architecture. A lovely little rabbit, whether it be plump or delicate, illustrates a fact of nature: in order to stay warm, rabbits must shrink and have a small surface area in cold climates. its limbs, legs, and ears. Its ears and limbs will enlarge when it gets to tropical regions, thus it will need to expand its surface area. In the 1950s and 1980s, cave dwellings first appeared. Cave dwellings—a type of building that can be finished quickly as long as there are lots of people and no money— have grown quickly as a result of economic regression and a substantial increase in the pace of natural population expansion. Mankind has steadily transitioned from subterranean to above-ground living since the reform and opening up. Furthermore, because there are so many pit courtyards, it is difficult to view the opulent past because fewer and fewer people are living in caves and because abandoned pit courtyards are either buried or collapsed. Thus, as natural cycles of change occur, so too should the manner that buildings have grown to accommodate shifting times and demands. Zhu Pei felt it was important to ground the architecture and establish a museum with fresh experiences when he was constructing the Jingdezhen Imperial Kiln Museum. He did a lot of research at Jingdezhen because of this. visited isolated historic villages in the region to discover the history of this metropolis and its cellular development. The homologous relationship between kilns, people, and porcelain is referred to as a blood-related isomorphic relationship. Beautiful porcelain is cultivated by this blood tie, and porcelain is the reason Jingdezhen thrived after emerging from kilns.Cities are born in kilns, and kilns are the cells that make up cities. With the original design of the kiln body, the Imperial Kiln Museum seeks to recreate this interaction and reinterpret historical events. The arched areas of Zhu Pei's museum are reminiscent of the ancient forms of a dragon kiln and a gourd kiln. Because heat is required for porcelain to burn, smoke is produced and heat must flow from bottom to top. Thus, the lecture hall that we observe is genuinely reproducing this kind of event. The circular aperture in this skylight replicates the firewood feeding and monitoring holes from the past. It also showcases the distinctive, magnificent porcelain of Jingdezhen. It appears that the square and arched architectural forms of the tourist activity center can be used to extract elements. It won't be overly secretive and understated if the entire activity center is subterranean, and visitors won't find it easy to miss the breathtaking arrangement of the complete village from above. To draw in tourists, the building should feature a portion above ground as well as prominent arched components. Nonetheless, the structure as a whole is essentially spread across several stories above ground and one subterranean level. As a result, the structure shouldn't be too tall, should only have three stories, and should respect the historical setting. It's not always necessary to preserve the original appearance of historical buildings when renovating them. We can only gradually bring the current dusty and sluggish historical situation back to life by appropriately treating and modernizing the blend of old and new buildings. To really energize the countryside and rejuvenate the old and new buildings, various factors should be incorporated into the plan of building functions, traffic flow lines, everyday behavior of local inhabitants, avoidance of tourists' daily demands, and development of commercial forms. According to the design concept, the renovated Miaoshang Village aims to provide a distinctive architectural complex that combines traditional elements with contemporary community services. According to the concept of sustainable rural development in the country, we shouldn't destroy regional ecosystems supporting plants and animals, or the means of subsistence for farmers. Based on the natural growth principle, we integrate new periods and imaginative functional requirements to create a peaceful coexistence between humanity, nature, and the original environment. The shift toward more transparent and stress-free tourist development in the future is the adoption of tourism models that genuinely promote relaxation and tranquility. Buildings that fulfill contemporary practical requirements while preserving traditional tastes can only be achieved by skillfully fusing cultural accumulation and site backdrop. In order to comprehend the knowledge and skills that the local farmers have amassed over thousands of years of house building, we need continually consult with the locals during the design process. In addition, we ought to acknowledge and honor the historic underground and ground-level civil cave dwellings' architectural designs.",
    "We should comprehend the benefits and drawbacks of such subterranean cave homes via firsthand experience and by speaking with the occupants. We should also embrace and preserve their advantages. Poor lighting and ventilation, together with the discomfort of connected rooms because of the stress principle and consequent loss of construction space, are issues that need to be given serious attention. At the beginning of the new period, we will keep the values of solidity, practicality, and attractiveness while reinforcing and improving the homes based on current technologies and methods to properly suit the living demands of locals and tourists. To enhance the lighting and ventilation, I will incorporate a variety of lighting terraces in various sizes and shapes, drawing inspiration from modern design ideas. An advantageous cycle of natural ventilation can be encouraged by opening the ventilation covers on the patios whenever the weather permits. There will be mystery above ground and a distinctive cave below as this courtyard with ventilation and illumination becomes a novel setting. The tourist activity center was first designed to give a lot of visitors a place to settle down and gradually experience the traditional crafts and agricultural culture of the area, as well as the peaceful life of stargazing at dawn and dusk. It is also vital to include locals in the wave of tourism service reform at the same time. Elderly people living in leisure can sell their handicrafts while feeling great satisfaction in their life values; each resident is a unique and beautiful scenery, and they can utilize their own inherited handicrafts to open training schools and teach more visitors the skills of traditional culture; Simultaneously, employment prospects in management and security have drawn many young people to the area, allowing them to support their families and make steady contributions to the development of their hometown. Therefore, we need to provide new amenities for visitors from other countries as well as useful places where locals can enhance their quality of life and incorporate new ideas. We can infer from these factors that the primary uses must comprise living quarters, retail space, office space, exhibition space, reading space, recreational area, traditional handicraft teaching space, multimedia space, etc. We ought to have a special subterranean cave dwelling mode for our residence. There should also be more expensive services, like a living style that overlooks the entire village panorama on the ground and can look up at the starry sky at night. Pitt courtyards are cheap and vibrant, accommodating large numbers of people from all over the world. An official homestay can be identified by this kind of underground homestay, which also offers independent rooms, tea rooms, reading rooms, and other amenities akin to those found in a five-star hotel, for certain special needs groups. As prices rise, more chances arise for families from diverse economic backgrounds to experience and generate income in rural areas. According to current research, certain flow lines and browsing modes for exhibition spaces are essentially established and developed. Based on prior research, we have integrated creative and locally extracted unusual arch components to set the entire show area apart from typical exhibition halls, complete with distinctive building signs. To keep individuals from experiencing visual fatigue, there is a place where they may observe and rest at the same time. The primary shortcoming of the original pit and cave structure is its excessive privacy and one terminus, with very few distinct twists. The original layout is insufficient for open buildings, such tourist cultural activity centers, to meet the requirements of an unobstructed, well-connected building. To tear down barriers and establish connecting points, our first step will be to self-link individual cave houses. In the second phase, we can connect one cave to another, and after that, three or four additional caves. In this manner, the caverns come together as a whole without interfering with the ground traffic pattern or landscape configuration. Naturally, in order to create a distinctive subterranean courtyard and guarantee a restful night's sleep for guests, homestays operating in open functioning caverns ought to be as autonomous and silent as feasible. Overall, the building's size and space are distributed, with functional and recreational areas arranged throughout, giving visitors a rich spatial experience.",
    "This cave restoration project has a variety of elements, and the differences between the before and after are even more striking. It alludes to the house renovation design of online personality Ye Liangchen. The goal of the remodeling plan is to create a modern, bright, and easily navigable home within the building, all while accommodating the needs of the family residing here and offering as many possibilities and Take down the poorly oriented building on one side, leave the main building intact, and add new, functional blocks to it in a staggered pattern to organically create multiple courtyards. In order to make the previously dark cave transparent and bright during the day even without turning on the lights, this technique should be used in the renovation of Miaoshang Village in Sanmenxia. It would preserve the courtyard while increasing the number of indoor courtyards through staggered spaces and upward lighting. Not only does Ye Liangchen's home preserve the arches found in the cave, but it also combines arches into the design of the doors and windows. As a result of the arch deformation, even the canopy in front of the main kiln entrance has a semi- curved shape. It blocks the blinding glare of the Western sun in addition to wind and rain. The house appears brighter in every area because to the curved features, which also give the design a more cohesive, three-dimensional appearance.We ought to incorporate inspiration from this innovative element extraction approach into our design studies as well. In actuality, since the majority of the building is subterranean, the portion above ground must be visually appealing. Without a doubt, the arch design is a cheery and dynamic feature that references the original structure both above and below ground. As a result, the activity center's roof should be tall and arched. The internet celebrity mansion uses a timber grid and a huge glass curtain wall, which significantly enhances lighting and gives the space a mottled taste of light and shadow. This design approach is very important for subterranean buildings, and the shifting wooden grid is another kind of innovative ecological processing enhancement that helps to divide and block the space. Its foundation is the idea of using locally available materials to save expenses and naturally include local features and ambiance, which facilitates the building's integration with the surrounding area. Hence, the materials are typically wood and rammed earth, which can be further classified as indoor and outdoor materials, although only in this case are the structure and finish essentially identical to those of local stone. Though technological advancements have made it possible to use today's manufacturing methods to rammed soil, we can still strengthen the building's particle adhesion and reduce its susceptibility to cracks and fractures by adding surface waterproofing agents and natural slurry adhesives to the water film; To maintain warmth and improve the rammed earth wall's breathability, simultaneously agitate and add specific loose particles, increasing the building's overall breathability. Local breathable ceramic bricks can be used as veneer decoration for the main wall facing the underground courtyard to change and distinguish the building from the earth above and below, improve the building's feeling of turning and three dimensions, and strengthen its connection to the past and sense of time. To create a modified connected arch structure, concrete beams and columns must be added for support. For the huge arches above the ground, the mortar is wrapped in plain concrete, and the directly exposed arched plain concrete is reinforced with stainless steel keel support. To preserve the natural and unadulterated atmosphere of the entire settlement center, the interiors of the leisure chairs, desks, eating tables, exhibition cabinets, etc., should be constructed entirely of wood with minimal embellishment or polish. Regarding construction materials, the Niamey 2000 project was created to meet the existing housing issue in Niamey, the capital city of Niger. Regarding the choice of materials, the branch factory has a strong position. Its objective is to protect locals from the hot weather by using unburned soil from the area, passive cooling techniques, and some concrete reinforcement to create shade. The materials used for this are local. Cities' buildings may have very diverse interiors, but this has little bearing on how well they integrate.",
    "Will the resurfacing of a sizable portion of the pit courtyard with rammed earth look uninteresting? Regarding this matter, a standard design example would be the Red Brick Art Museum, which is a structure composed solely of red bricks. Even though the structure is made of a limited number of materials, the designer has used this one building to produce hundreds of red brick stack designs that are sometimes narrow, sometimes expansive, sometimes flat, sometimes rugged, sometimes closed and introspective, and occasionally mottled with light and shadow. It is evident that a single material combined with cutting-edge design modifications and procedures won't cause aesthetic weariness. The demands of people for spiritual well-being are growing as their living standards rise and they become dissatisfied with a basic material life consisting of food, clothing, and shelter. Along with providing for their family, people who work hard to earn a living also desire to travel with their families, see beautiful mountains and rivers, use new services, and immerse themselves in other cultures. In the future, people's lives and consumption will begin with broadening their horizons and experiencing more novel things.Thus, the future direction for the growth of all tourism cities will be to regulate tourism resources, schedule visitor numbers sensibly, and offer clear and comprehensive services throughout the entire process for towns and areas with abundant tourism resources. Our traditional culture is becoming more and more significant under the guise of government funding for the regeneration of towns and villages. The biggest safeguard for traditional culture is inheritance because traditional handicrafts and architecture are becoming less and less frequent. The growth of the tourism sector and cultural transmission should go hand in hand and be complementary to one another. In addition to the functional qualities of a building's worth to the individual, people frequently judge buildings on the basis of their look and overall spatial experience. A recommendation article can propel a building into the top ranks of popular buildings in the ever evolving internet world of today, drawing more visitors to visit and explore. But a building's utilitarian qualities will always be its most valuable asset. Modernity in style and well-executed photo effects are especially crucial since we should ride the waves of the internet era. Nonetheless, we must simultaneously fully assimilate the essence of traditional culture, safeguard historic knowledge while incorporating it into the legacy of traditional culture, and give careful consideration to the design and functionality of the next generation of building. In addition to making it well-liked online and appropriate for travel photography, we should also make it user-friendly and convenient. This may provide a boost to the long-term growth of tourism destinations."
]