[
    "Abstract: After a great disaster, people’s psychology often produces related problems and shadows. On July 20, 2021, people’s homes were destroyed after a rainstorm in Henan, China. The death or injury of a loved one. Some survivors even saw people die in front of their eyes. These are the reasons why people are traumatized. However, in modern society, people do not attach importance to the intervention of others and the importance of psychological counseling. Instead, they advocate self-regulation and self-digestion of these pains, fears, and anxieties. However, these cannot be resolved only by using personal power. As a result, people’s psychological state has become increasingly worrying. This paper uses the comments in the short video about the incident to study the information that can be displayed in the comments. For example, the content of comments by reviewers, the IP address of reviewers, and the number of likes or comments. The results show the psychological impact on people in Henan Province. Some of them have psychological trauma after the disaster. Besides, People in provinces adjacent to Henan Province had noticeable feelings, impressions, and attention to the event. Disasters are large-scale events that endanger people’s safety and cause property damage [1]. After a major disaster, people are at high risk of developing mental illness due to the loss of their homes, the injury or death of family members, the collapse of houses and the destruction of streets, or the death of others in front of their eyes. Different disasters will cause different degrees of psychological damage, and the same disaster brings further damage to people [2]. Many people cope better in times of disaster [3], but many experiences some PTSD and psychological disorders [4]. People are more likely to develop PTSD, a mental illness that appears after a traumatic event, causing them to relive the event in nightmares or their minds [5]. Since July 17, 2021, continuous heavy rainfall has occurred in Henan Province. Continuous torrential rain and heavy rain have caused flooding in Henan Province. The problem was even more severe in the subway in the provincial capital of Zhengzhou, where a large amount of rain poured into the subway system, trapping the subway that was in operation at the time. The subway doors could not be opened simultaneously but flooded into the subway cars. People in the subway cars saw the water rising a little bit, the water gradually rose, and some people saw others gradually give up their strength and eventually die in the cars filling with water. After the incident in Zhengzhou, people’s © 2023 The Authors. This is an open access article distributed under the terms of the Creative Commons Attribution License 4.0 (https://creativecommons.org/licenses/by/4.0/). psychological problems after the disaster gradually emerged. Some survivors can still vaguely see the heavy rain in those days and hear the fierce sound of rain. Families of the victims felt sad, worried, or great sadness and disbelief. People who have left a psychological impact are surrounded by these feelings of fear and insecurity all the time, which are the stressful emotions of people after the disaster. After sudden stress events, fear, anxiety, or depression will seriously damage cognitive function and even cause cognitive dysfunction, thus trapping people in physical and mental difficulties and causing loss of acting ability and interest. They may be affected directly because they are at the site of the disaster or indirectly because they have loved ones at the site or have known information about the disaster [6]. The social environment can significantly affect people’s psychological state [7]. In today’s society, we believe in not showing our pain quickly, hoping to self-heal; Society also wants to avoid talking about some too-heavy topics, trying to dilute everything through time. Society does not pay much attention to people’s psychological repair, and there is little hope that people can recover from psychological trauma in such cases. Efforts should be made for holistic rehabilitation of the affected population [8]. People began to be interested in the psychological effects of disasters and the environmental effects on mental health [9]. Oliver Gruebner, Sarah R Lowe, Laura Sampson, Sandro Galea, et al. collected the data of 418 adult residents most seriously affected by the hurricane after the disaster through telephone survey data and questionnaires and analyzed the spatial clustering of depression results of the respondents. The DSM-5 Post-Traumatic Stress Checklist (PCL-5) was used to measure post- traumatic stress, and depression was measured using the 9-item Patient Health Questionnaire (PHQ- ⑨). It was concluded that mental health problems were concentrated in communities geographically closer to the sea, indicating spatial differences in risk within and across the region [10].",
    "However, because the surveyors wrote the questionnaire questions, the research content was limited. Moreover, due to the high labor cost of the telephone questionnaire and the geographical restrictions, the surveyors could only take the people who were still in the region at that time as the survey objects, and the number was limited. Moreover, there were biases among the interviewees, some of whom were reluctant to disclose their information. Therefore, the data collected by the questionnaire needs to be completed. Short video platforms are widely used for entertainment because they can accurately recommend personalized content. Because short video platforms can hide users’ personal information, short video platforms have become a place for people to vent their emotions. People are more likely to reveal their thoughts on short video platforms. Therefore, this paper first found three videos about Zhengzhou flood incident on the Douyin app and crawl the comments under the three videos. The three videos were released five months, three months, and one month before the week of the incident. The study’s object is the reviewer’s IP territory and the content in the comments. Through the IP territory of the reviewer, the attention of this event in different provinces is studied, and the regional law of this event is introduced. One hundred comments were randomly selected from each video, and people’s emotions were derived from the 100 comments. As the event’s first anniversary got closer, whether people’s emotions became more pessimistic or gradually emerged from the gloom and became more positive was studied. Besides, the results show that region is an obvious factor in the difference in psychological response after a disaster. The province where the disaster occurred had the highest degree of attention to the event and the degree of psychological impact, followed by neighboring provinces. The farther away the disaster occurred, the lower the degree of impact. As shown in Figure 1, in the five months preceding the event’s anniversary, there were 1020 comments, with 907 users participating in the comments, covering the period from early January to the end of January. The comment IP includes 348 comments from Henan, 78 comments from Jiangsu, 52 comments from Hebei, 49 comments from Zhejiang, 48 comments from Guangdong, 37 comments from Anhui, 32 comments from Shaanxi, and 31 comments from Beijing, and There are 28 comments from Hubei, 23 comments from Sichuan, 20 comments from Jiangxi, 20 comments from Liaoning, 20 comments from Shanxi, 19 comments from Hunan, 17 comments from Shanghai, 14 comments from Xinjiang, 13 comments from Guangxi, 13 comments from Heilongjiang, 11 comments from Fujian, and 11 comments from Guizhou, There were 11 comments from Tianjin, nine comments from Gansu, seven comments from Yunnan, seven comments from Chongqing, six comments from unknown IP, two comments from Jilin, and one comment from Hainan, the United States, Ningxia, Qinghai, Iraq, and Taiwan. As shown in Figure 2, in the three months preceding the event’s anniversary, there were 1006 comments, with 497 users participating in the comments, covering the period from early March to the end of March. The comment IP includes 428 comments from Henan, 90 comments from Guangdong, 78 comments from Shandong, 66 comments from Jiangsu, 41 comments from Anhui, 32 comments from Hebei, 24 comments from Guangxi, Hubei, and Zhejiang, 23 comments from Jiangxi, 21 comments from Beijing, 20 comments from Shanghai, and 17 comments from Fujian. There were 14 comments from Hunan and Shaanxi, 12 comments from Liaoning and Sichuan, 11 comments from Tianjin, nine comments from Shanxi, eight comments from unknown IP, seven comments from Heilongjiang, six comments from Inner Mongolia, six comments from Yunnan, six comments from Chongqing, four comments from Jilin, and two comments from Gansu, Hainan, Taiwan, and Macao. There is one comment from Japan. As shown in Figure 3, a month before the event’s first anniversary, there were 996 comments, with 997 users participating in the comments, covering the period from early May to the end of May. The comment IP includes 665 comments from Henan, 35 comments from Guangdong, 29 comments from Jiangsu and Shandong, 25 comments from Anhui and Zhejiang, 20 comments from Hebei, 18 comments from Beijing and Hubei, 15 comments from Shanxi, 11 comments from Shaanxi, Shanghai, and Sichuan, nine comments from Yunnan, eight comments from Liaoning and Inner Mongolia, and Hunan There are seven comments from Jiangxi and Xinjiang, six comments from unknown IP addresses, six comments from Tianjin, six comments from Chongqing, four comments from Guangxi, three comments from Fujian, three comments from Guizhou and Taiwan, two comments from Heilongjiang and Qinghai, and one comment from Gansu, Jilin, and Ningxia.",
    "As shown in Figure 4, the total data for the three months is as follows: a total of 2381 users participated in reviews, 1441 from Henan, 185 from Shandong, 173 from Guangdong and Jiangsu, 104 from Hebei, 103 from Anhui, 98 from Zhejiang, 70 from Beijing and Hubei, 57 from Shaanxi, and 50 from Jiangxi, There are 48 comments from Shanghai, 46 comments from Sichuan, 44 comments from Shanxi, 41 comments from Guangxi, 40 comments from Hunan and Liaoning, 31 comments from Fujian, and 28 comments from Tianjin, There are 40 comments from Hunan and Liaoning, 31 comments from Fujian, 28 comments from Tianjin, 23 comments from Inner Mongolia, 22 comments from Heilongjiang and Yunnan, 21 comments from Xinjiang, 20 comments from unknown IP, 19 comments from Chongqing, 14 comments from Guizhou, 12 comments from Gansu, and 7 comments from Jilin, There are 6 comments from Taiwan, 3 comments from Hainan and Qinghai, 2 comments from Ningxia, 2 comments from Macao, and 1 comment from the United States, Japan, and Iraq. According to the final aggregate data analysis, the area with the highest attention level for the incident is Henan Province, where the event occurred, indicating that local people pay more attention to the event. Shandong Province ranks second in attention to the event, Hebei Province ranks fifth, and Anhui Province ranks sixth. Shandong Province, Anhui Province, and Hebei Province are adjacent to Henan Province. This indicates that people’s attention to events is related to the distance from the place where the event occurred to the place where people are located. Although Jiangsu Province is not close to Henan Province, due to the close geographical location of the two provinces and the high frequency of floods and waterlogging disasters found in Jiangsu Province after searching based on data, it can be inferred that the people of Jiangsu Province have a high degree of attention to the incident. As shown in Table 1 and Figure 5, five months before the anniversary of the incident, the number of participants was 907, and 1019 comments were made. Three months ago, the number of participants was 497, with 1006 comments; A month ago, the number was 977, with 996 comments. In a random selection of video comments five months before the first anniversary of the incident, 37 comments expressed the general idea of wishing the deceased rest in peace and praying for their blessings; 14 comments mentioned uncompleted engineering houses damaged by the impact of the flood event; Thirteen comments paid tribute to rescue workers at the time; The content displayed in the ten comments is that the commentator was an experienced or rescuer of the incident; Nine comments express empathy for the despair of those experiencing the event; The remaining 17 comments are unrelated to the event. In a random selection of video comments three months before the first anniversary of the event, 42 comments expressed empathy for the despair of the person experiencing the event; 21 comments expected the deceased to rest in peace; 17 comments referred to uncompleted project housing; 6 articles paid tribute to the rescue workers at that time; The reviewers of the three comments were those who had experienced the event at that time; The remaining 11 comments are unrelated to the event. In a random selection of video comments one month before the anniversary of the incident, 45 comments expressed the idea of wishing the deceased rest in peace; 33 comments expressed empathy for the despair of the person experiencing the event; 10 articles paid tribute to the rescue workers at that time; The reviewers of the nine comments are the witnesses and rescuers of the event; The three comments are unrelated to the event. Five months ago, the highest number of likes was 36,942 in the video’s comments section, which was posted from Guizhou province and described a nightmare scene as a child. The second most popular comment, 31594, came from Hebei Province, describing a childhood nightmare. The third most popular comment was 19740 from Shaanxi Province, describing the horror of going home alone. In the video’s comment section three months ago, 2708 was the highest like. The comment was from someone who witnessed the incident in Henan Province, describing the experience of being rescued and the psychological shadow after the disaster. The second highest praise, 1197, also from Henan, describes scenes of the ferocity of the flood at that time. The third highest praise was 1136, which expressed sorrow over the incident.",
    "In the video’s comments section a month ago, the highest praise was 66, from Hubei Province, which paid tribute to the rescue workers during the disaster. 63 was the second most liked the comment from Shandong Province, expressing shock at the extent of the impact of the incident. The third most liked comment was from Jiangsu Province, with 46 likes. The commenter, a former rescuer, expressed his horror at the incident. Except for the comments on the video five months ago, the comments with high praise in the comments of the video three months ago and one month ago were all related to the incident. The main direction of the comments was the memory and fear of the incident or the tribute to the rescuers. Moreover, the IP addresses of the comments were from Henan Province or neighboring provinces, indicating that the incident had a more significant impact and influence on Henan Province and neighboring provinces. In this paper, under the circumstances that people suffered physical and mental trauma due to the great disaster, and the society or even people themselves do not pay attention to it, this paper studies and analyzes the content in the comments section of videos on short video platforms. In this paper, the hefty rainstorm in Zhengzhou on July 20, 2021, is taken as an example to study the psychological state of people after the disaster and the related factors. Around July 20, 2021, an unprecedented rainstorm occurred in Henan Province. The huge rainstorm flooded the city quickly, and the water level could even reach 1.5 meters. People on the land could not escape the siege of the flood, and people in the subway were even more difficult to escape. The flood gradually poured into the subway, and the water level rose bit by bit. Some people died because of the high water level, and some suffocated because of the lack of oxygen in the carriage. These have left a psychological impact on the victims, survivors, witnesses, and their families, and even some people who are not involved in the event. Therefore, this paper aims to study the degree of the psychological impact of the disaster on people. The comments in the comment section were copied and pasted into Excel, and bar charts, subdivision tables, and other methods were used to study the impact of this event on people’s mental state and related factors. These have left a psychological impact on the victims, survivors, witnesses, and their families, and even some people who are not involved in the event. Therefore, this paper aims to study the degree of the psychological impact of the disaster on people. The comments in the comment section were copied and pasted into Excel, and bar charts, subdivision tables, and other methods were used to study the impact of this event on people’s mental state and related factors. The results showed that Henan Province, as an event occurrence province, paid more attention to the event and was affected more. As neighboring provinces, Shandong, Hebei, and Anhui paid more attention to the event and were affected more. Jiangsu Province is a frequent flood disaster, and attention is also greater. Studies of highly praised comments show that the psychological impact on people in the province and neighboring provinces is even more severe."
]