[
    "Abstract. China's capital market has undergone a process of development, in which the industries of various sectors have been continuously improved with steady growth. For a long time, Henan Province, as China's largest grain province, has lacked strong financial investment support for its local food processing industry. With the support of China's national policies, Henan's food processing industry has broad prospects and has attracted a large number of investors. The financial data of seven related companies was collected as a data source for this research. The purpose of this study is to provide investors in the food industry in Henan province with a stock selection model based on two valuation methods, P/E and P/B ratio. At the same time, the profitability and growth potential of enterprises are also taken into account in the stock selection criteria. Through continuous sorting and filtering, finally, the two stocks with the best overall performance are selected and the investment targets are determined. The study introduces several basic indicators for selecting stocks and is designed to provide investors with experience and scientific guidance. After the reform and opening up, China has witnessed a rapid development of industry and capital markets. With the support of financial approaches and government preferential policies, China has become one of the countries around the world that has the most comprehensive and systematical industrial category, and in this process, different regions in China has founded different local industries by utilizing advantages of geography, population and other local resources. In China, Henan province is distinguished by having the largest population and vast land for agriculture. Therefore, the food processing industry and agricultural and sideline product manufacturing industry in Henan province have grown into an enormous volume by virtue of these advantages, and once became the leading enterprise in the country. Recent study lists some of the current circumstance of financial support provided to these enterprise in Henan province, in which existing problems like weak capital market support and lagging investment are all serious factors to consider [1]. As a developing country with a huge population, the security of food provision is a prominent concern for consistent and stable development of Chinese economy, and a comprehend valuation process into some of the leading companies should be done [2]. This study targets at utilizing valuation assessment models to make comparative analysis between several selected food processing and agricultural products processing industry in Henan province, and thus to construct an optimized investment portfolio which could amortize risk and create maximum profit. Showing the basic financial statements of these food processing company would be benefit for wiser choice of investors. There has been a lot of previous research in stock selection on a basis of P/E and P/B ratio. Basu has made significant contributions to the study of the correlation between return risk and the price- to-earnings ratio [3]. Based on the current stock market data, he formed two sets of stock portfolios, low P/E ratio and high P/E ratio, through research he concluded that the investment yield of these two stock portfolios was 16.3% and 9.3% respectively, and after adjusting for various factors such as taxation, the return rate of the low P/E portfolio was much greater than the risk return, which verify the importance of the investment value theory. Wang takes Jiajia Food Co., Ltd. as an example and uses the price-to-earnings ratio mode based on the company's 2010-2014 annual report data in his article on the investment value of listed companies based on the price-to-earnings ratio model, and then he combines the company's fundamentals and the comparison of listed companies in the same industry to conduct an empirical analysis of the company's investment value. Finally, he concluded that when investors formulate investment memorandum, they should not only pay attention to P/B ratio, but also resort to the profitability and development potential of listed companies, and also refer to fundamental information such as the Shanghai Composite Stock Index and the trend of the stock market to make rational investment judgments [4]. Gong published the article \"The Price-to-Earnings Ratio Stock Selection Method of an Ordinary Investor\", in which he introduced the specific steps and rationality of stock selection with reference to the price-to-earnings ratio [5]. Zhang and Huang introduced the application of the price-to-earnings ratio in the current Chinese stock investment market. They analyzes the influencing factors of the price-earnings ratio as well as puts forward a few opinions on using the price-earnings ratio to estimate the value of China’s stock [6]. The statistics used in this research are from China Stock Market & Accounting Research Database. These statistics are collected based on the following keywords: first, all enterprises in Henan are selected; second, the processing of agricultural products and the food processing industry were selected. In this way, seven enterprises in Henan Province that meet the conditions were screened and then chosen to be the resource of the analysis. The data of these companies will be analyzed from multiple dimensions. Graphs would depict the respective fluctuation of P/E ratio, P/B ratio and other valuation criteria of these companies, and among these seven companies, two or three of them would be selected as an investment portfolio for the maximization of profits and stability [7]. In the following sections, the research will introduce the data sources and the basis for selecting the data. The seven companies will be ranked and scored separately based on P/E, P/B, profitability, and growth performance. Ultimately, the two stocks that performed best overall in terms of valuation, profitability and growth would be These statistics are from the past three fiscal years which date from 2019-2021. Recent data are more favorable for predicting the oncoming stock market outcome. Past three years have witnessed the impact of epidemic, and companies that have demonstrated strengths in profitability and valuations under the impact of the pandemic are also more likely to sustain better performance in the coming years. Basic financial statements at the end of the year respectively including balance sheet, income statement and cash flow statement are collected in the process of analyzing. The data provided by the database is tabulated through the tools inserted in Excel.",
    "The research would firstly analyze and sort the chosen seven companies based on two criteria: Price-to-Earnings Ratio and Price-to-Book Ratio. Both of the two ratios are important criteria of evaluating the company’s equity and investment potential. In this process, each company would be ranked based on the value of P/E and the standard deviation of the data over three years. After that, each company will receive a corresponding score based on the ranking. The companies with the highest scores have the most outstanding performance. Analysts use a number of ratios to gauge the market value of the firm. The most common is the firm’s price-earnings ratio (P/E). P/E ratio is a universal valuation of a company’s equity, from which we can access whether a stock is over- or under- valued based on the idea that the value of a stock should be proportional to the level of earnings it can generate for its shareholders. In general, the lower the price-earnings ratio of a stock, the lower the profitability of the market price relative to the stock, the shorter the payback period, the smaller the investment risk, and the greater the investment value of the stock; The converse is the opposite. Price-to-Book Ratio, also called market-to-book ratio, is the ratio of its market capitalization to the book value of stockholders’ equity. It is another important ratio to evaluation a company’s performance. Analysts often classify firms with low price-to-book ratios as value stocks, and those with high price-to-book ratios as growth stocks. The price-to-book ratio is the ratio of the stock market price to the net assets per share, reflecting the stock price corresponding to the company's net assets per yuan under the condition that the net assets per share of the listed company remain unchanged. The company's assets in essence represent a resource to obtain future benefits, due to the uncertainty of future earnings, it is impossible to accurately estimate the present value of future earnings, so in reality, the current purchase value of corporate assets is often manifested as the intrinsic value of the enterprise. After the stock screening based on various valuation methods, some other basic indicators will further confirm the potential of the stock [8]. The stock selection process needs to rely on the support of some of the company's other financial indicators. Several other selecting dimensions of stock would be applied and further analysis and compare would be done. Profitability refers to a company’s capability of generating revenue. It is beneficial to investors to rationally analyze the company's profitability level, comprehensively use a series of evaluation and appraisal measures, use scientific and reasonable methods to analyze the company's profitability and make predictions for the future, adopt scientific and reasonable effective methods to improve the company's profitability level, optimize the company's internal capital structure, and strengthen the effective management of the market, so as to achieve the purpose of maximizing the company's profits [9]. Two indicators of a company’s profitability chosen in the research are Gross Profit-to-Assets ratio and gross profit margin. Gross Profit/Assets ratio, namely GP/A ratio, is an important measurement of the profitability of stocks. Novy-Marx shows that in the full universe of stocks (Gross Profit)/Assets is the best predictor of returns [10]. Gross Profit Margin is the percentage of gross profit to sales revenue (or operating income), where gross profit is the difference between revenue and operating costs corresponding to revenue. For the growth potential of these companies, both revenue growth rate and EBIT growth rate would be analyzed. The company's ability to grow is also one of the factors worth considering when choosing an investment target. The company's ability to grow is related to the future revenue situation, which directly affects the earnings of the stock. Revenue growth rate of main business revenue is the ratio of the increase in the operating income of the enterprise in the current year to the total operating income of the previous year. Revenue growth rate indicates that compared with the previous year, the increase or decrease of the main business income is a vital indicator for evaluating the growth status and development ability of the enterprise. Earnings Before Interest and Tax (EBIT) is colloquially a profit without interest or income tax, which can also be called pre-interest profit. EBIT, as the name suggests, is a profit before interest and income tax are paid. So EBIT growth rate could reveal a company’s growth capability.",
    "The price-to-earnings ratio method is currently the most common method used in the world to measure the valuation of a stock. As an important ratio in financial analysis, P/E ratio reflects the relationship between years of cumulative growth and the value embodied in the current stock price. It is commonly believed that the stocks that have P/E ratio between 10~20 would show maximum value in terms of investment potential. Higher P/E ratio means that the stock price is overvalued and therefore indicates higher risk. From the chart and the graph, we could select the stocks with the most stable and relatively lower P/E ratio. On this basis, 000895, 002216, 002582 and 300908 are selected for their better performance. Stock 300829 and 600186 fail to maintain a lower P/E ratio, while 001215 are not considered for incompleteness of data. In general, the lower the price-to-book ratio of a company, the greater the investment value; and the higher the price-to-book ratio, the smaller the investment value. From the above results, stock 002582, 300908, 000895, 002216 still stands out for lower and stable P/B ratio. Stock 002582, 300908, 000895 and 002216 have the highest score so that they are the four stocks selected based on two basic valuation methods. In order to maximize the benefits and design a more reasonable portfolio, it is necessary to further analyze the profitability and growth ability of these four stocks. After a comprehensive analysis and final calculation, stock 002582 and 300908 are chosen as the final investment target for excellent P/E and P/B ratios, and outstanding performance in terms of profitability and growth performance. This study combines P/B ratio, P/B ratio and various other financial indicators, including profitability and growth potential to evaluate the companies and to make good investment decision. The research integrates the financial data of seven food processing and agricultural products processing industry in Henan province in the past three years according to the above criteria. First, seven company’s P/E ratio and P/B ratio are listed and visualized, and in this process, companies whose P/E and P/B ratio are lower and more stable are more favorable for investment. Subsequently, due to market uncertainty and various other factors, indicators of profitability and growth ability were also introduced to make a more comprehensive choice. Similar methods are utilized and finally the stock 002582 and 300908 that show the best performance and gained the highest score are chosen as the final investment memorandum. The research is of reference value for investors interested in Henan's food security strategy and food processing industry. For cautious investors, the choice of stocks can not be blind. Appropriate stock selection strategies will help investors better manage financial resources, reduce investment risks, and achieve maximum returns. The purpose of this study is to present an analysis-based stock selection process using two common valuation methods and other financial indicators. This study provides investors with a general reference direction when selecting stocks, and provides a basic stock selection model based on the price-to-earnings ratio and price-to-book ratio. There are some problems in the research, such as insufficient accuracy when organizing statistics and lack of more advanced arithmetic, which can be solved in future related studies."
]