[
    "Abstract. Using the data of A-share listed companies in Henan Province from 2016 to 2020 and the digital inclusive financial index of Peking University, this paper empirically tests the impact of the development of digital finance in Henan Province on the scientific and technological innovation ability of enterprises. The study found that the development of digital finance helps to improve the scientific and technological innovation ability of listed enterprises in Henan Province. At the same time, financing constraints, as an intermediary variable, mask the impact of digital Finance on scientific and technological innovation of enterprises. Digital finance can more significantly affect the scientific and technological innovation ability of listed enterprises with greater financing constraints.The purpose of this study is to explore how word finance indirectly promotes the improvement of scientific and technological innovation ability of enterprises by alleviating financing constraints and other channels, and to clarify the intermediary role of financing constraints in it. At the same time, this study focuses on this specific region of Henan Province, combines its economic development characteristics and the development status of digital finance, and fills the gap in the research on the impact of digital Finance on scientific and technological innovation at the regional level. By refining the analysis to the provincial level, we can more accurately reveal the regional effect of digital finance. With the rapid development and application of digital financial technology, digital finance has become one of the important engines to promote economic development and technological innovation. The work plan for the development of digital economy in Henan Province in 2024 puts forward a series of policies and measures to support the development of digital economy, which provides a good policy environment and support for the development of digital finance in Henan Province. In the report on the work of Henan provincial government in 2024, it is clearly pointed out that Henan Province will rely on the smart island system to accelerate the construction of the incubation and growth chain of technology enterprises in 2024, accelerate the improvement of enterprise innovation capabilities, and promote the full coverage of R&D activities of industrial enterprises with high quality. This study has important application value for the improvement of scientific and technological innovation ability of enterprises in Henan Province. From the perspective of the effect of digital Finance on enterprise development, Wang Bo (2024) pointed out the far-reaching impact of digital Finance on the enterprise sector [1]. With the rapid development of digital finance, the restrictions encountered by enterprises in financing have been effectively alleviated. Specifically, digital finance not only improves the financing ability of enterprises, but also significantly promotes the growth of total factor productivity, optimizes financial Content from this work may be used under the terms of CC BY-NC 4.0 licence (https://creativecommons.org/licenses/by-nc/4.0/). Published by Warwick Evans Publishing. performance, and stimulates the innovation vitality of enterprises. These positive changes have jointly promoted enterprises to move towards a higher quality stage of development. From the perspective of the development of digital finance in Henan Province, Chen Junhui (2024) deeply analyzed the vigorous development trend of Henan Province in the field of digital economy [2]. He stressed that the digital economy has become a strong driving force for economic growth in Henan Province and plays an important role in promoting deep industrial integration and economic model innovation. The close relationship and interaction between digital finance and technological innovation of enterprises have been widely recognized by the international academic community. Specifically, Yang J's research shows that digital finance plays a positive role in reducing financing pressure and reducing capital costs, which promotes the development of green innovation [3].Lin B further pointed out that digital finance has not only increased the quantity of green technology innovation, but also achieved a significant improvement in quality, making it an important driving force for green innovation in China [4]. In China, scholars have also discussed the relationship between digital finance and enterprise innovation investment from different dimensions. Fan Fulin (2023) focuses on digital Inclusive Finance, pointing out that it alleviates the financing constraints faced by scientific and technological enterprises in the process of scientific and technological innovation to a certain extent [5]. Qian Lihua (2023)'s research also highlights the important role of digital finance in technological innovation of small and medium-sized science and technology enterprises [6].",
    "This study focuses on Henan Province, a region with unique economic development background and digital finance development characteristics, and fills the gap in the research on the impact of digital Finance on scientific and technological innovation at the regional level through empirical analysis at the provincial level. This regional perspective not only enriches the research level of the relationship between digital finance and technological innovation, but also provides an empirical basis for understanding the differences in the development of digital finance between different regions and their different impacts on technological innovation. At the same time, this study uses a more comprehensive data sample and an authoritative digital inclusive financial index to ensure the accuracy and reliability of the research results. At the same time, by building a reasonable measurement model, this paper deeply analyzes the relationship between digital finance, financing constraints and scientific and technological innovation ability of enterprises, which provides a methodological basis for similar research. Digital finance plays an important role in improving the scientific and technological innovation ability of Listed Companies in Henan Province. By providing efficient and convenient financial services, digital finance not only reduces the financing cost of enterprises, but also accelerates the flow of funds, so that listed companies in Henan Province can invest in R&D more quickly and promote scientific and technological innovation. In addition, the popularization of digital finance also promotes the transparency and sharing of information, provides more innovative resources and cooperation opportunities for enterprises, and directly enhances the scientific and technological innovation capabilities of Listed Companies in Henan Province. Based on this, the following assumptions are made. H1: Digital finance has an incentive effect on the scientific and technological innovation ability of listed enterprises in Henan Province. In enterprise innovation activities, capital is an indispensable element. Often, the greater the R&D investment of a company, the company will be in trouble because of the shortage of funds, and the greater the financing constraints, the R&D investment of enterprises will be relatively small. However, the development of digital finance provides new solutions for these enterprises. Through digital means, digital finance can reduce the financing cost of companies with large financing constraints to a greater extent, broaden financing channels, and effectively alleviate the financial pressure of these enterprises. Based on the above, the following assumptions are made. H2: compared with companies with smaller financing constraints, it has a stronger impact on the scientific and technological innovation ability of listed enterprises with larger financing constraints. This study uses all A-share listed companies in Henan Province from 2016 to 2020 as a sample, and carries out the following processing: (1) excluding financial and real estate listed companies. (2) Enterprises that have st or have been in st * during the sample period are excluded. (3) In order to avoid the adverse impact of sample data extremes on the study, the main continuous variables were condensed by 1% up and down, and finally the data of 47 listed companies in Henan Province were obtained. This study selects the digital inclusive financial index of Henan Province (2016-2020) as an indicator to represent the development of digital finance in the region. The index is derived from the Peking University Digital inclusive finance index and has been compiled by the research team of the Peking University Digital finance research center and ant group research institute since 2016. Using ant group's large amount of data on digital Inclusive Finance, the index includes the total index of digital Inclusive Finance as a primary indicator, covering secondary indicators such as coverage, depth of use and degree of digitalization. The financial index data of all listed companies are from CSMAR database. Hao Qingmin (2023) believes that R&D investment can effectively stimulate scientific and technological innovation of enterprises. At the same time, the proportion of R&D investment in business income can reflect the investment of enterprises in scientific and technological innovation [7]. In this study, we selected the Provincial Digital inclusive finance index (2016-2020) compiled by the digital finance research center of Peking University as the explanatory variable. The index includes the total index and three secondary indexes, namely, the coverage of digital finance, the depth of digital finance use and the digitalization of digital finance. Due to the large difference between the value of digital financial index and the value of technological innovation intensity of enterprises, in order to ensure the appropriate neutrality of regression results, we have standardized all digital financial index indicators, that is, divide them by 100. This can better reflect the overall situation of the development of digital finance in Henan Province, and also make the relationship between digital finance index and the intensity of technological innovation of enterprises more interpretable.",
    "This paper uses SA index to measure the financing constraint level of sample listed enterprises, which is better than KZ and WW index because of its robustness and no endogenous problems. According to Ju Xiaosheng. (2013), SA index is reliable and easy to calculate. In order to avoid endogenous interference, the absolute value of SA index is used to measure financing constraints [8]. The calculation method is based on the size and age of enterprise assets, and the greater the absolute value, the heavier the financing constraints. During the study period (2016-2020), the SA index of all sample companies was less than 0. This paper decides to use the absolute value of SA index as a method to measure the level of financing constraints. The SA index is measured by the following formula: According to the existing literature (Ren Jinghui, 2023), this paper selects the following control variables [9]: asset liability ratio (Lev), net profit margin of fixed assets (froa), management cost ratio (manage), equity concentration index (Top1), dual, government subsidy intensity (sub) and return on assets (ROA). (1) An empirical study on the direct impact of digital Finance on scientific and technological innovation of listed enterprises in Henan Province. The purpose of this study is to study the direct impact of digital Finance on the technological innovation level of high-tech small and medium-sized enterprises. Drawing on the research of Ren Jinghui (2023), we have established a two-way impact model, considering fixed time and industry effects. Taking R&D investment intensity (inno) as the explanatory variable, digital inclusive financial aggregate index (difi) and its three-dimensional degree as the explanatory variable, combined with a number of control variables, this paper makes an empirical analysis. (2) An empirical study on the indirect impact of digital Finance on scientific and technological innovation of listed enterprises in Henan Province. In order to verify whether the role of digital finance in promoting technological innovation of technology-based small and medium-sized enterprises is limited by financing constraints, this paper uses the step-by-step regression method proposed by Baron and Kenny, also known as causal analysis method, which aims to test whether financing constraints play a role in the model as an internal mechanism, thus affecting the role of digital finance in promoting technological innovation. For this purpose, we set up a mediating effect model to explore this relationship in detail. To verify the intermediary role of financing constraints (SA) in the promotion of enterprise innovation ability (inno) by digital Finance (difi), and to clarify the path of digital finance indirectly promoting technological innovation by alleviating financing constraints. (See Figure 1). The performance of Listed Companies in Henan Province in scientific and technological innovation is clearly shown by descriptive statistics. There is a significant difference in the scientific and technological innovation ability of Listed Companies in Henan Province, ranging from 0 to 21.62, with an average of 4.696, indicating that the overall level is low and uneven. At the same time, the digital inclusive finance index of Peking University (2016-2020) shows that the development of digital Inclusive Finance in Henan is medium (average 2.897, range 2.231-3.408), covering breadth, depth and digitalization, and there is room for improvement. See Table1 for specific statistics. In this paper, the Pearson correlation coefficient test is used for independent variables, dependent variables and control variables to initially evaluate the relationship between the variables we provide, whether there is a linear relationship, and the strength and direction of this relationship. As shown in Table 2, the correlation coefficient between most variables is less than 0.3, and some are less than 0.5. Only the correlation coefficient between two variables is 0.7, but most variables can be preliminarily judged that there is no multicollinearity. It is not enough to rely only on correlation coefficient to judge multicollinearity. We also need to evaluate whether there is multicollinearity between independent variables in combination with the variance inflation factor (VIF) of the calculated variables. A high Vif value indicates that there may be serious multicollinearity, which is generally considered to exist when Vif>5 or Vif>10. The test results are shown in Table 3: the variance expansion factor between variables is less than 5, which further shows that there is no multicollinearity between variables.",
    "Table 4. Shows that at the 1% significance level, digital Inclusive Finance significantly promotes the scientific and technological innovation ability of enterprises in Henan Province, with a coefficient of 1.860, confirming its positive effect. In terms of subdivision, the coverage, depth of use and degree of digitalization all have a significant positive impact on the scientific and technological innovation ability of enterprises, with coefficients of 1.677, 1.794 and 3.241 respectively, supporting hypothesis H1. Government subsidies, net profit margin of fixed assets, management fee rate and equity concentration positively promote innovation, while two job integration and asset liability ratio inhibit innovation. Based on the basic regression model, this study adds financing constraints to test its mediating effect. Based on the basic regression model, it carries out regression tests on the digital inclusive financial index and financing constraints (SA), as well as on the level of scientific and technological innovation, digital inclusive financial index and financing constraints (SA) of enterprises. The results are shown in Table 5. The results show that digital Inclusive Finance has a significant positive impact on financing constraints, and the financing constraints index increases by 0.106 for every unit. Using Wen Zhonglin (2014) method, it is found that the indirect effect is significant, that is, the digital inclusive finance part affects the scientific and technological innovation of enterprises through financing constraints [10]. However, the symbols of direct effect (c1) and indirect effect (a0b0) are opposite, showing masking effect, indicating that financing constraints complex regulate the relationship between digital Inclusive Finance and technological innovation of enterprises. In particular, under the background of the epidemic, financing constraints have intensified, and digital finance has promoted the scientific and technological innovation ability of enterprises more significantly, which verifies hypothesis 2. Finally, we calculated the ratio of indirect effect to direct effect, which is the absolute value | a0b0/c1 |, and the result is 7.39%. This ratio reflects the relative contribution of mediators to the total effect. Despite the masking effect, the intermediary variable still affects the relationship between the independent variable and the dependent variable to a certain extent. When studying the relationship between digital finance and enterprise innovation, we should consider the possible endogenous problem, that is, the error term in the model may include other factors that affect both digital finance and enterprise innovation but are not explicitly included in the model. In order to estimate this relationship more accurately, we use the method of Tang Song (2020) to control the high-order joint fixed effect of \"time X industry\"[11]. The model is as follows: After using the high-order joint fixed effect model, we got the following significant results. From regression Table 6, we can see that the coefficient of the digital inclusive financial index is 7.682, and it is significantly positive at the significance level of 1%. The results show that digital inclusive finance plays a positive role in promoting enterprise innovation. Compared with the basic regression model, the significance and size of each variable coefficient in the high-order joint fixed effect model are basically the same. This further confirms the robustness of the basic regression results, that is, the positive impact of digital Inclusive Finance on technological innovation of enterprises is not an accidental phenomenon, but has a sound statistical basis. Chen Xiaoming (2023) pointed out that the radiation effect of digital Finance on technological innovation is greater than the siphon effect, and the development of local digital finance promotes green technological innovation, showing the radiation effect of \"taking neighbors as good\"[12]. Therefore, the average of the digital inclusive financial index in other provinces except Henan Province was constructed and brought into the regression model as an explanatory variable to test (Table 7.), and the regression results did not change. The main regression results under both measures remained robust. There may be limitations in relying only on the proportion of R&D to measure the level of scientific and technological innovation. Therefore, in the robustness test, the proportion of R&D personnel in enterprises is taken as an indicator to measure the level of scientific and technological innovation of a company, and the regression results are shown in Table 8. In the context of further explaining that the proportion of R&D personnel in enterprises is used to measure the level of scientific and technological innovation of the company, in column 1 of Table 8, we analyze the impact of digital Finance on scientific and technological innovation of enterprises. The results show that the coefficient of digital finance is 4.318, and it is significantly positive at the significance level of 1%, and the results are robust. Columns 2 to 4 respectively test the impact of digital finance coverage, use depth and digitalization on enterprise scientific and technological innovation. From the test results, the coefficient of these three secondary indicators is also significantly positive, which shows that the results are highly robust.",
    "After an in-depth study of A-board listed enterprises in Henan Province from 2016 to 2020, this paper reveals the close relationship between digital finance and scientific and technological innovation capabilities of enterprises. The results show that the vigorous development of digital finance in Henan Province has significantly improved the scientific and technological innovation ability of enterprises. Further intermediary effect test shows that in the context of financing constraints, digital finance plays a more significant role in promoting the scientific and technological innovation ability of enterprises in Henan Province. This means that digital finance not only provides enterprises with broader financing channels and reduces financing costs, but also stimulates the innovation vitality of enterprises and promotes the overall improvement of scientific and technological innovation ability in Henan Province by optimizing the allocation of financial resources. In depth discussion of the relationship between digital finance and technological innovation ability of enterprises, although this paper has made a preliminary analysis based on the primary and secondary indicators of the digital inclusive financial index, there are still many aspects worthy of further research in the future: (1) Future research can further refine the different components of digital finance, such as mobile payment, Internet lending, supply chain finance and so on, in order to explore their specific impact on the technological innovation ability of enterprises. This subdivision research helps to more accurately identify which specific areas of digital finance have the greatest promotion effect on enterprise innovation, and provides more specific guidance for policy making. (2) In view of the small sample of superior companies in Henan Province, this study failed to further refine the analysis of enterprises in different regions and industries. Future research can expand the sample scope to cover enterprises in more regions and industries for heterogeneity testing. This will help to identify the differences between different regions and industries in the relationship between digital finance and technological innovation, and provide more targeted suggestions for policy formulation. (3) Digital finance and technological innovation are both rapidly developing areas, so although the data from 2016 to 2020 used in this study are representative, they may not fully reflect the long-term dynamic relationship between the two areas. Future research can carry out long-term tracking research to capture the dynamic relationship between digital finance and technological innovation, and provide more timely and accurate decision-making basis for enterprises and governments."
]