[
    "Taking the economic income and consumption structure data of rural residents in Henan Province from 2006 to 2020 as an example, the change from 2006 to 2020 was briefly introduced, and then the relationship between them was deeply calculated by a grey relational analysis (GRA) model. The results showed that from 2006 to 2010, the economic income had the highest relational degree with food, tobacco, and alcohol in the consumption structure, which was 0.8321, and had the lowest relational degree with housing, which was 0.6216. From 2011 to 2015, the economic income had the highest relational degree with culture, education, and entertainment in the consumption structure, which was 0.9451, followed by other supplies and services, which was 0.9017, and housing, which was the lowest (0.6125). From 2006 to 2020, the economic income had the highest relational degree with daily necessities and services in the consumption structure, which was 0.8862, and the relational degree with resi- dence was the lowest, which was 0.4125. Among different income components, the net property income had the least impact on the consumption structure. The results suggest that the consumption of rural residents in Henan Province has gradually shifted to enjoyment, and some optimization has occurred. Driven by China’s policy of benefiting the people, the economic income of rural residents has been continuously enhanced, and the consumption structure has also undergone some changes. Therefore, analyzing the economic income and consumption structure of rural residents has practical significance [1], which can contribute to optimizing the consumption structure and promoting economic development [2]. The relationship between incomeandconsumptionisanimportantpartofcurrentresearch [3]. Cao et al. [4] analyzed the connection between consump- tion, income, and population of urban households in China and estimated a consumption function. They found that for all households, the income elasticity for food ranged from 0.7 to 0.8, and the income elasticity of housing was 0.8–0.9. Mikheeva et al. [5] studied household income and consumption in various regions during the epidemic and found that even in areas where income increased, expenditure decreased, with the percentage of percentage on goods increasing while the proportion of expendi- ture on services declining. Chen et al. [6] studied the relationship between energy usage and income of rural poor people in China and found that when the input of poor people exceeded the relative poverty line, the increase in their energy demand was non-clean commercial energy. Sandhu et al. [7] analyzed the household income and consumption patterns of agricultural laborers in three different climate zones in Punjab. They found that the income from temporary agricultural activities accounted for more than 40% of the total household income of laborers and This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. high proportion of the consumption. Yi et al. [8] examined how digital inclusive finance contributes to enhancing the rural consumption structure and found that there were remarkable differences in the optimization of rural consumption structure between the eastern region and the central and western regions. The eastern region benefited more, while the impact in the central and western regions was limited or even negative. Xu et al. [9] studied the impact of high-speed rail (HSR) on the con- sumption expenditure and structure of urban and rural residents in China. They found that HSR significantly increased the con- sumption expenditure of urban and rural residents, promoted the upgrading of rural consumption structure, but inhibited the upgrading of urban consumption structure, providing some references for the government to refine their investment strate- gies in transportation infrastructure. Ma et al. [10] analyzed the complex relationship between rural economic transformation and household consumption structure (HCS) and found that urbanization and agricultural mechanization showed particu- larly significant effects on the enhancement of HCS. Shao et al. [11] analyzed the provincial panel data for both urban and rural areas between 2010 and 2021. They discovered that population aging had a significant negative impact on the overall consump- tion level of urban residents while having a positive enhancing effect on the consumption level of rural residents. Lei et al. [12] analyzed the influence of the endowment insurance system in China on the consumption structure in rural areas and found that the endowment insurance effectively optimized the rural consumption structure and increased the overall consumption level by 0.0024%. Grey relational analysis (GRA) is an important and popular method in the economic field. It has performed well in aspects such as evaluating regional economic develop- ment quality and analyzing energy consumption and economic growth [13]. Therefore, this paper used GRA as a research tool. At present, there are relatively few related studies of GRA in the analysis of consumption structure. The research in this paper can provide some new support for the application of GRA in this field. Regarding the research subject, at present, most studies consider national data, and there are relatively few in-depth studies on a certain province or municipality. The research on a province or municipality is of great significance in aspects such as policy guidance and urban development. Henan Province is a province with a large population [14] and is also a major agricultural province. The consumption of rural residents is a crucial factor in driving the economic growth of Henan Province. According to the data in 2022, the consumption level of rural residentsisstilllow.Intheperspectiveoftheselectionofresearch As China’s economy continues to grow and people-oriented policies are further promoted, the economic income of rural residents has also seen steady growth. During 2006–2020, the economic income of rural residents in Henan Province has changed (Table 1).",
    "The data indicates that the economic income of Henan residents experienced a steady rise from 2006 to 2020, and the per capita disposable income rose from 5409 yuan in 2006 to 24,810 yuan, which verifies China’s efforts in rural economic development in recent years. According to Table 2, in 2006, the per capita consumption expen- diture of rural residents was 2422 yuan, only 35.53% of that of urban residents, and this figure rose to 12,201 yuan in 2020, only 59.1% of that of urban residents. However, it is evident that the gap between urban and rural consumption levels has been reduced to a certain extent. In Figure 1, wage income refers to the remuneration obtained through labor, such as main job salary, part-time income, bonuses, and allowances; operational income denotes the net income from production and business activities; net property income denotes the net income obtained through owning assets such as funds, real estate, and land, such as deposit interest and rent; net transfer income denotes unidirectional transfer pay- ments from the government or society to residents, such as pen- sions and unemployment benefits. From Figure 1, it can be seen that from 2006 to 2020, all kinds of income had a large growth. In 2006 and 2011, wage income and business income were the main sources of income, and in 2020, nettransferincomeexperiencedalargegrowth.Overall,although there are some changes in the composition of economic income, theproportionofoperationalincomewasstilllarge,andthemain income was from the primary industry. In Table 3, the percentage of food, tobacco, and alcohol was the largest, followed by housing; however, the percentage of food, tobacco, and alcohol was constantly declining, from 40.9% in 2011 to 27.8% in 2020, while transportation and communications showed an increase. conducts an analysis using the GRA model [15]. GRA has a good performance in the processing of irregular data [16] and has been applied in various scenarios, such as engineering design [17], site selection [18], and project selection [19]. It also has good appli- cations in the analysis of income and consumption structures. Peng [20] analyzed the influence of basic education in Guang- dong Province on the consumption structure of residents based on GRA. Zhang et al. [21] adopted the GRA model to analyze the correlation between the energy consumption structure and eco- nomic growth in Shandong Province. The research showed that the GRA model can present a relatively intuitive result and is a veryreliableresearchtool.Itisparticularlypractical,especiallyin the case of a small amount of data and incomplete information. It can determine the degree of influence on the system behavior by calculating the relational degree among various factors. The steps of GRA are shown below. TABLE 3 | Consumption structure of rural residents in 2006, 2011, and 2020 (data source: Statistical Yearbook of Henan Province). The higher the relational degree calculated by the GRA model is, the higher the relational degree between the factors is. The GRA model is applied to the analysis of the economic income and consumption structure of rural residents. Resi- dents’ economic income is used as the reference sequence, ( ) written as 𝑥 0(2),· · ·,𝑥 0(1),𝑥 0(𝑛) 𝑥 0 = , and the rural residents’ consumption structure (food, tobacco, and alcohol) in Henan Province is used as the comparative sequence, written as: 𝑥𝑖 = ( ) 𝑥𝑖(1),𝑥𝑖(2),· · ·,𝑥𝑖(𝑛) . The original data from 2011 to 2020 were collected from the Statistical Yearbook of Henan Province, and the mean value method was used for dimensionless processing: where 𝑥𝑖 represents the mean value and 𝑥𝑖(𝑘) is the original data. For reference sequences 𝑥′ 0 and 𝑥′ 𝑖 obtained after processing, the difference value is calculated: As shown in Table 4, from 2006 to 2010, the items that had the highest relational degree with residents’ economic income were food, tobacco, and alcohol, reaching 0.8321, followed by clothing, reaching 0.8234. This result showed that during this period, the expenditure on subsistence consumption remained dominant, while the consumption on enjoyment was less. From Table 5, it can be found that the item with the high- est relational degree from 2011 to 2015 was education, culture, and entertainment, reaching 0.9451, while the relational degree with residence and food, tobacco, and alcohol was low, at 0.8423 and 0.6125 respectively, indicating that under the influence of increasing income, rural residents paid more attention to educa- tion, culture, and entertainment when consuming.",
    "From Table 6, it can be found that from 2016 to 2020, household goods and services had the highest relational degree, while cloth- ing and residence were the lowest. There was a gap between the resultsofTables5and6,indicatingthatwiththefurtherimprove- ment of economic income of rural residents, they paid more attentiontoenjoymentconsumptionandpursuedmoreimprove- ment of life quality. In the case of economic development, hous- ing was more stable, and the use and replacement cycle of houses became longer, so the relational degree was lowest. Although res- idence still accounted for 24.1% of the consumption structure in 2020, since the expenditure on residence was stable compared with other items and did not change significantly due to changes in income, the relational degree was relatively low. From Figure 2, it can be seen that with the continuous rise of eco- nomic income, consumption concepts have gradually changed. The demand for culture, education, services, and entertainment hasgraduallyincreased,whilethedemandformaterialshasgrad- ually decreased. More attention has been paid to high-level spir- itual and cultural needs, which reflected the optimization of the consumption structure. Inordertofurtherunderstandtherelationshipbetweenruralres- idents’ economic income and consumption structure, the grey relational degree between different income components and con- sumption structure was calculated. were greatly affected by wage income. By comparing the relation- ship between operational income and consumption structure, it was found that clothing, food, tobacco, and alcohol were greatly affected by operational income (relational degree: 0.8942 and 0.8534), indicating that rural residents mostly used operational incomeforsubsistenceconsumption.Therelationaldegreeofnet property income was small, and one of the items with a big dif- ference from other income was residence. The relational degree between net property income and residence was 0.6052, and the degree between the other three incomes and residence was around 0.5. This is because the net property income mostly came from interest, rent, and so forth, that is, the residential consump- tion was significant. The transferred net income was also usually used for subsistence consumption, so it had a great impact on related expenditures, such as food, tobacco, and alcohol (0.8745), household goods and services (0.8835), and clothing (0.8325). As shown in Table 7, among the four types of income, the rela- tional degree between net transfer income and consumption structure was the highest, reaching 0.7756, followed by opera- tional income and wage income. The relational degree between net property income and consumption structure was the lowest, only 0.5223. Considering the characteristics of different income components, net transfer income denotes various transfer pay- ments from the state, units, and social groups to families, such as pensions, unemployment benefits, and old-age pensions, which are related to the social security system. The improvement of the social security system enables rural residents to have more income to invest in consumption. Thus, it shows a relatively high correlationwiththeconsumptionstructure.Netpropertyincome usually refers to rent and dividends, with characteristics such as non-labor and risky. Currently, rural residents have low property income, which plays a small role in stimulating consumption. Figure 3 shows the relational degree between different income components and different consumption types. As can be seen from this figure, wage income accounted for a large proportion of the economic income of rural residents, but expenditures on edu- cation, culture, entertainment, and transportation and commu- nications were significant; therefore, expenditures on education, culture, entertainment, and transportation and communications According to the results, the consumption structure of rural res- idents has changed with the rise in economic income. For the further optimization of the consumption structure of rural resi- dents in Henan Province, this article puts forward the following suggestions. Resources and technologies should be invested to help farmers increase their income [22]. Agricultural insurance and subsidies should be used to reduce the fluctuation of rural residents’ oper- ational income due to natural disasters [23], improve the circula- tion and sales of agricultural products, and help rural residents better withstand market risks. E-commerce should be further popularized [24]. More attention should be paid to the education level of rural residents [25] to improve employment skills. For the current gap between urban and rural consumption lev- els, in addition to improving the economic income level of rural residents, we should also start with the change of consumption concepts, increase publicity efforts, advocate rural residents to establish new consumption habits, urge the establishment of a goodconsumptionenvironment,andadvocatehealthyconsump- tion of education, culture, and entertainment.",
    "In addition, the government can further broaden the income sources of rural residents and promote the better development of the rural economy by developing tourism [26]. The government should further optimize the rural social secu- rity system [27] and tap the consumption potential of rural res- idents by enhancing the education level, medical environment, and infrastructure in rural areas. Based on the analysis of rural residents’ economic income and their consumption structure, this paper calculated the data of HenanProvincefrom2006to2020andfoundthatruralresidents’ economicincomeincreasedandtheirconsumptionstructurealso changed to some extent from 2006 to 2020. The GRA results revealed that the impact of rural residents’ economic income on education, culture, and entertainment gradually increased, while the influence on food and residence decreased, proving the opti- mization of the consumption structure. The research results have verified the reliability of the GRA model in analyzing the cor- relation between economic income and consumption structure. It can effectively process uncertain data and reflect the correla- tion between different incomes and consumption structures. The resultsarealsoeasytounderstand.However,thismethodalsohas some limitations. It ignores the nonlinear relationship between factors and lacks the statistical significance test of the results. There are some limitations in the reliability of the results. More- over, only the data of one place in Henan Province was studied. The small research sample had a regional limitation. It is still uncertain whether there are similar characteristics in the eco- nomic income and consumption structure of rural residents in other provinces and cities. Therefore, in future work, the limita- tions of the GRA model will be considered by conducting a more in-depth study on the correlation between the economic income of rural residents and their consumption structure."
]