[
    "Abstract: In contrast to previous times, social media has profoundly transformed various elements of the world, such as the methods of conducting business and disseminating information. Given the emergence of this new trend, it is imperative that we acquire knowledge and develop a more profound understanding of this transformative shift. This study seeks to describe and analyze various phenomena and statistics pertaining to the unique trend of live-streaming e-commerce as a thriving business model. By employing a rigorous analysis and data presentation approach, we investigate the underlying operational principles that elucidate the functioning of live streaming. Additionally, the paper examines the consumer preferences and characteristics (such as price, product features, age, gender, and geographic location) that manifest in their behaviors on the Douyin platform. Finally, the results and efficacy of the live stream on Douyin are assessed using several parameters, namely revenue, sales, and exposure. The findings indicate that the primary audience for live streaming consists of middle-aged females, predominantly located in Guangdong, Jiangsu, and Henan provinces. Despite the subpar quality, these consumers exhibit a preference for inexpensive products. Further analysis reveals that live streaming yields significant profitability and extensive product exposure, although with a lower conversion rate (CVR) compared to traditional marketing methods. Due to the advancements in social media apps, particularly during the COVID-19 epidemic, their use has expanded beyond basic entertainment to encompass business-related functions such as marketing and e-commerce. Douyin, the Chinese counterpart of TikTok, serves as a prominent illustration of a social media application. Douyin, which was introduced in September 2016, quickly established itself as the leading platform in the short video business due to its large user base. The rise in content viewership has coincided with a corresponding growth in the number of content authors, resulting in the birth of Internet influencers. Formerly, they uploaded concise videos to divulge their own experiences to the general audience. This paradigm shift occurred when influencers recognized the potential to generate revenue based on the size of their follower base. Consequently, numerous content providers rely on Douyin as their primary means of generating income. In Douyin, influencers have various avenues via which they can get revenue. One method is through direct marketing. A brand will select influencers whose followers align with the brand's target © 2024 The Authors. This is an open access article distributed under the terms of the Creative Commons Attribution License 4.0 (https://creativecommons.org/licenses/by/4.0/). demographic and compensate them to promote a product in their subsequent videos. An alternative method involves acquiring prizes while engaging in live-streaming activities. Within the Douyin platform, customers have the option to purchase Doubi, a virtual currency, which can then be used to acquire prizes for the live-streamers. Upon purchasing these incentives or presents, viewers have the option to bestow them upon their preferred live-streamers. Creators can utilize Douyin as a platform to engage and locate potential consumers who have an interest in the creators' offerings, hence facilitating individual transactions. In addition, firms can engage in live-streaming marketing to collaborate with internet influencers who will subsequently promote and sell their products. The techniques for earning money on Douyin are not just limited to those mentioned above, but also include additional options. Live streaming is the most challenging but also the most lucrative approach, as it typically necessitates a substantial fan base and a skilled crew for effective management. This research will primarily examine the utilization of live-streaming for marketing and e-commerce purposes on the Douyin platform. Due to its novelty in the social media business, there is a scarcity of research articles dedicated to the exploration of live-streaming as a cultural phenomenon. A recent study utilized data from a web survey website in China to examine the factors that influence consumers' decision-making process. The study found that streamer attractiveness, para-social interaction, and information quality play a role in cognitive assimilation and arousal, which in turn impact buyers' behaviors [1]. In the subsequent year, more investigation was conducted on six distinct factors, namely the live streamer's public image, interaction, product individualization, price, promotion, and platform loyalty, in order to assess their impact on consumer purchase choices. According to the findings, the way products are visually presented and the public perception of live streams significantly influence consumers' choices when buying products [2]. An analysis conducted on a sample of 10,087 streamers on Douyin reveals a direct relationship between the extent of product variety and the sales performance of streamers. Nevertheless, the sales volumes are independent of the gender of the streamers [3]. The study was conducted on a sample of 796 participants and found that the level of customer loyalty to mobile smartphone shopping is significantly impacted by the quality of content and the strength of the interaction between the consumer and the platform [4]. While mobile smartphone shopping and live-streaming are distinct activities, mobile smartphone shopping can be a component of live- streaming E-commerce on certain occasions. Nevertheless, the majority of these studies analyze the various aspects that impact customers' consumption behaviors. The current research gap pertains to the lack of widespread discussion on several aspects of live streaming.",
    "This paper will explore live-streaming in Douyin through deep presentation and analysis of live- streaming as a way to earn money. The data for analysis will come from the backstage data from Douyin’s official website and another backstage data platforms (feigua and datastory). There will also be direct observation of live-streaming E-commerce on Douyin. This paper provides a well- rounded understanding of Douyin’s live-streaming, which can give a perception of this kind of e- commerce industry in China and provide some importance data regarding live streaming in Douyin. Besides, as live-streaming and social media are new, not much research has been done, making a new area for further extensive research. Before further discussion, the difference between traditional e-commerce and live-streaming e- commerce must be clarified. The main difference is the presence of live-streamers. For traditional e- commerce, individuals search for information about the products by themselves. On the other hand, during the latter, live streamers proactively deliver messages about the products and persuade the consumers to make the transaction [2]. The similarity is that buyers can consume the products right away on the internet. In other words, live-streaming is a type of e-commerce that provides a platform Viewers can access the live broadcast through three primary methods. To initiate live streaming on Douyin, users can simply tap the Live-Streaming button (Zhibo) located at the top of the screen when entering the app. An alternative method involves tapping the profile image icon on the screen, albeit this functionality is limited to instances when the producers are actively live-streaming. Users will be able to tap on the icons while navigating through the videos or on the friend or following lists. Another scenario occurs when consumers are sometimes presented with live-streaming content while browsing through videos. Upon accessing the live-streaming platform, users have the opportunity to engage in several activities beyond simply watching the video. These activities include making comments and browsing the remarks posted by others. In addition, there are buttons available for consumers to make direct purchases of the products and send gifts to the live-streamers. Live streaming is not an easy task yet requires professional teams to operate. The process of live- streaming varies a bit based on different streamers, but the overall process for a streamer is summarized in the figure 1 below. First, in order to become streamers, they must possess a dedicated following and an active account for doing live broadcasts. It is imperative to have a minimum of 1000 followers in order to facilitate the identification of potential brand collaboration opportunities. Furthermore, it is advisable for live streamers to establish partnerships with suppliers in order to market their merchandise. Notably, renowned internet influencers are more inclined to engage in collaborations with prominent firms. Additionally, streamers have the ability to produce pre-recorded films in advance of their live streams in order to generate anticipation and inform viewers about the approaching live event. The videos will provide information on the duration and featured products. Fourth, to achieve the optimum results, the order of presenting the products will be carefully assigned. Typical way for product arrangement: Attracting product -> Profit product -> Attracting product -> Profit product. Attracting Products are meant to attract consumers through their lower prices and practical functions but bring little profit. These products will ensure click-through rates and boost viewer retention. On the other hand, as the viewership numbers increase significantly due to the appeal of the Attracting Products, the profit-generating products will be showcased to the viewers, resulting in the highest possible financial gain due to their substantial profitability. Fifth, setting the Scene: The background is essential in attracting new viewers entering the live stream due to many psychological reasons. The next part is Live-Streaming, in which the streamers will follow the plan and do the marketing while guiding them to buy the products. Many tips and structures are used by the streamers to reach those effects. Those tips include some verbal tricks and ways of persuasion. Besides, it is optional to have Paid Promotion. The team can buy Qianchuan, which increases the feeds of live streams to potential users based on the social media algorithm. The paid promotion can increase the number of viewers and therefore more exposure to the public.",
    "Furthermore, the subsequent elective stage involves Video Production. Following the conclusion of the live stream, the team will curate the most notable moments from the live streaming and transform them into concise video clips. By disseminating these notable moments on Douyin, a larger audience will become aware of and start to track these content creators, so ultimately augmenting the viewership for their subsequent live broadcasts. Additionally, certain teams may want to make the live broadcast data available to the general public. By doing so, certain internet video creators can utilize these recordings for additional editing and re-creation purposes. The videos they produce will be published online, so achieving the same outcome, as marketing and promotion will also be conducted through this medium. Finally, the teams can focus on the data from the live broadcast and conduct an analysis, including metrics such as sales figures, the target audience's consumption patterns, the conversion rate per view, and the average duration of stream engagement. It is important to closely observe the precise vocabulary and behavior of the live-streamers. The backstage data of Douyin reflects the behaviors of the consumers as their preferences are shown through it. This section will provide a deeper insight into the characteristics of consumers. The first aspect to measure is the price as it has been shown that the pricing of the product can directly influence the satisfaction of purchase, which plays an important role in customers’ satisfaction. Especially in the competitive market in China, a slight price change can hugely influence the behaviors of the consumers [6]. Thus, price should be a factor that we should evaluate. Aspects related to price include the product price and discount price. Figure 2 illustrates the distribution of transactions across various price ranges. There is an inverse relationship between price and the quantity of transactions, where a rise in price leads to a decrease in the number of transactions. When the price falls between the range of 0-50 RMB, it accounts for the biggest proportion of transactions done during Douyin's live stream, specifically 42.96%. The second largest proportion, at 26.36%, occurs when the price range is between 50 and 100. The third highest percentage, at 12.60%, is observed in the price range of 150-200. To clarify, 93.14% of the products available on Douyin are priced below 200 RMB, while 69.32% of the products are priced below 100 RMB. Furthermore, according on the statistics provided by Feigua, the average price of the products sold is 72 RMB. The transactions depicted in figure 3 are computed by aggregating the transactions conducted at the identical discount rate. Certain discounts that are not selected may be deemed insignificant and inconsequential. Based on the graph, 55.56% of products with discounts are sold at a discount rate of 27%. Conversely, when the discount is a mere 10%, the products that are sold only make up a meager 0.2% of the total products that have a discount. When a linear relationship is established, it can observe that the proportion of transactions made for discounted products increases as the discount amount increases. Put simply, higher discount rates result in increased sales. Consumers on Douyin's livestream platform have a propensity for products that offer more discounts, indicating a preference for lower prices. Based on the information presented in the two graphs above, it can be inferred that consumers have a preference for affordable products. During a live stream, customers are more inclined to target things that are reasonably priced. Aside from pricing, the attributes of products are likely to be a factor that can indicate consumers' actions. Consumers make final decisions based on product attributes when they are making judgments [8]. Moreover, throughout the process of assessing and selecting among different products, the attributes of the product are categorized as either favorable or unfavorable, and consumers will carefully study these factors before arriving at a final conclusion. This decision-making process is referred to as the compensational rule [9]. Therefore, the significance of product characteristics is emphasized, underscoring the necessity of utilizing them as a means to mirror consumers' habits. To find out the features that the consumers prefer the most, the paper will analyze the bullet comments in the live stream, which will reveal consumers’ concerns and focus on the products. This data is collected from Feigua and formed into a pie graph. The author first selects all the bullet comments into a sheet (table 1). The others section contains all the categories of bullet comments that are not related to product features such as shopping experience and streamers.",
    "To further analyze, it needs to eliminate the ones that are not related to product features. Thus, the author forms a pie graph based on the categories of bullet comments that are related to product features, meaning that we will not count the percentage of Others, shown in figure 4. To clarify, the qualities refer to the presence of genuine certifications, importation from foreign nations, and safety of use for the products. Furthermore, appearance pertains to the visual aspect of the product's packaging. Based on figure 4, it is evident that consumers prioritize color and size as their primary concerns. The color, comprising 24.4% of the factors considered, indicates that they prioritize the visual aspect of the products. Conversely, the significant proportion of 14.5% indicates that they also prioritize the suitability of the products for their needs. In this context, \"size\" mostly pertains to the dimensions of clothing, denoted by labels such as L, M, or XL. In contrast, consumers shockingly place little importance on the quality of the goods, since it only accounts for a mere 7.5% of the overall characteristics and quality. This suggests that the durability, safety, and product warranties have minimal impact on their purchasing decisions. Finally, consumers prioritize things that possess visually attractive aesthetics and are exceptionally suitable, even if they lack in quality. This figure 5 shows that most viewers are between the ages of 24 and 40 as their total consists of 71.28%. Therefore, middle-aged people are more likely to use live streams as a shopping tool. In terms of gender, a sheet is constructed based on Feigua to summarize the consumers’s gender and their behaviors. Table 2 reveals that the majority of participants in live-streaming are females, with a gender ratio of around 4 to 1 in favor of females. To clarify, out of a total of 10,000 viewers in a live stream, there are 2,500 males and the remaining 7,500 are females. Significantly, the Target Group Index (TGI) for females is almost twice as high as that for males, indicating a greater inclination among females to show interest in products available on Douyin's live broadcast and subsequently make purchases. A TGI value exceeding 100 indicates a high level of consumer receptiveness towards marketing efforts. Consequently, these findings indicate that females have a greater inclination to use and engage in consumption during live streaming compared to males. The geographic location of the consumers also offers a profound grasp of consumers using Doyin’s live streaming. By analyzing the geographical data, the paper can determine the regions with the highest number of active users on Douyin's live streaming platform. In order to ascertain this, the author gathered the proportion of viewership in various provinces and Autonomous Regions in China, as reported by the Feigua database, and subsequently divided it by the population of each province, as documented in the Population Census of China. Only some provinces are chosen based on their higher percentage, and the autonomous regions are with a * mark after their name. Visualizing the difference in a readable way, we multiply all the results by 1*10^8, shown in table 3. As described by the percentage, Guangdong province has 12.1% of live-streaming viewers, which is the highest for China followed by Jiangsu and Henan with 6.8% and 6.7% respectively. As the province with the most active viewers, Guangdong leads by 5.3% from the second-highest province Jiangsu, and has nearly a percentage 2 times higher than Zhejiang and 3 times higher than Anhui. This reflects that active viewers are all located in Guangdong province. Typically, provinces with larger populations will exhibit a higher percentage compared to those with smaller populations. In order to address this bias, the researcher can assess the computed values that are depicted in the graph. The comparison of the proportion of individuals in each province who utilize Douyin's live streaming can be made by dividing it by the population. While the estimated values may not precisely represent the ratio, they can nonetheless assist us in predicting the ranking and magnitude, regardless of the impact of population fluctuations. According to the table 3, Tianjin has the highest value, indicating that the proportion of the population in Tianjin who engage in live streaming is more than in other places. Following Tianjin, having a value of 11.53, Guangdong, which has the most live-streaming viewers, is the second most with 9.602, and Zhejiang is the third with 9.292. Only 7 geographic locations (Tianjin, Guangdong, Zhejiang, Shanghai, Beijing, Jiangsu, Chongqing) on the table have a value higher than 7.5. One similarity with these places is that they are all prosperous and known for their economy.",
    "As the behaviors of consumers are discussed in the previous section, the paper also needs to analyze from the perspective of streamers and suppliers. As many efforts are made by them, the results of the live streams will be presented. Revenue is the most direct way to measure the effectiveness of live-streaming as earning profit is always the main goal for all the firms and live-streamers. One measurement of revenue can be Gross Merchandise Value(GMV). According to Feigua data, the average GMV for live-streaming is between 25,000 RMB to 50,000 RMB. As GMV is calculated by multiplying the number of transactions and Average Order Value (AOV), it is nearly the same as the calculation of revenue which is the product quantity sold and price[10]. The sales figures might provide information regarding the quantity of items sold during the live stream, regardless of the price. According to the Navigate database, the projected gross revenue for clothing-related products in 2023 falls within the range of 5 to 6 billion dollars. Using 2023 as an illustration, the month of January, which experiences the least amount of sales, is projected to have sales ranging from 250 million to 300 million. Incorporating sales figures from additional product categories will result in far greater and astonishing amounts. The average sales output each minute ranges from 0 to 50. The average conversion rate, defined as the proportion of viewers who make a purchase, typically ranges from 0% to 5% [12].Under a live feed of 100 viewers, on average, only 0 to 5 individuals will make purchases as a result of the marketing and persuasive efforts during the live streams. Figure 6 below displays the conversion rate for each quarter in 2023, as indicated by the statistics on Navigate.. The conversion rate for Douyin for each quarter(Q1, Q2, Q3, and Q4) is 1.33%, 1.44%, 1.27%, and 1.33% with a mean of only 1.34%. According to the paper that analyzed data from the Google Ads benchmark report, Facebook Ads benchmark report, and Bing Ads benchmark report, the conversion rate (CVR) for Bing Ads is 2.94%, for Facebook Ads it is 9.21%, and for Google Ads it is 4.40% [13]. Despite several constraints, the effectiveness of marketing on Douyin is inferior to that of traditional marketing methods. Exposure is essential for the promotion and establishment of a brand's image. Regular exposure to commercials and familiarity with products will enhance the intention to make a purchase [14]. An additional investigation is conducted on Thai males and females aged 25-44, which demonstrates that frequent exposure is positively associated with consumers' opinion of a brand and their intention to make a purchase [15]. Hence, exposure serves as a dependable metric for assessing the efficacy of marketing efforts. Upon analyzing the Navigate database, it was found that the average daily exposure for live streams (specifically those promoting products for a single brand) was 1.65 million in Q1, 1.82 million in Q2, 1.83 million in Q3, and 3.06 million in Q4 of 2023 [12]. According to Feigua's analysis, viewers typically spend an average of 58 seconds when exposed to live streaming. Additionally, the average length for a live stream is 4 hours, 4 minutes, and 6 seconds. The extended duration of each exposure, averaging over 1 minute [10], serves to highlight both the effectiveness and intensity of the radiation. Overall, the presentation and debate revolve around the data and facts pertaining to live streaming on Douyin. Live streaming, unlike typical e-commerce, offer enhanced interactivity since streamers actively provide information about the products. Furthermore, the essential stages involved in creating a conventional live stream encompass: Initiating an account, selecting a product, conducting a preliminary show, organizing the product, Establishing the environment, engaging in paid promotion through live streaming, producing the video, and ultimately reflecting on the process. Furthermore, evidence indicates that buyers have a preference for purchasing inexpensive products that offer substantial discounts, particularly within the price bracket of 0-50 RMB. The findings also suggest that consumers tend to prioritize the color of products over their quality when making purchasing selections. Additionally, live streaming is predominantly utilized by middle-aged individuals as a means of consumption. Moreover, it is seen that women have a greater propensity to engage in live streaming compared to men, as evidenced by their higher Total Gross Index (TGI) value. This suggests that women are more inclined to make purchases while participating in live streams. Significantly, the majority of livestream watchers are located in Guangdong, Jiangsu, and Henan. Excluding the population, the economically developed regions in China, such as Tianjin, Guangdong, Zhejiang, Shanghai, and Beijing, have the highest proportion of viewers. Furthermore, the Gross Merchandise Value (GMV) each live stream ranges from 25,000 RMB to 50,000 RMB. Lastly, the aggregate sales of exclusively clothing-related merchandise will amount to approximately 5-6 billion units in 2023. The average conversion rate (CVR) for Douyin's live streams in each of the four quarters of 2023 is only 1.34%. Additionally, each live stream attracts an average of 2.09 million viewers per day in 2023, with each viewer spending an average of 58 seconds on the live stream.",
    "Regarding the constraints, it is important to note that as all the databases are from China, the findings may not be applicable to locations beyond China. Furthermore, China boasts a multitude of live-streaming sites, including Douyin, Tabao, and Kuaishou, each catering to distinct user demographics. Kuaishou specifically focuses on attracting consumers residing in second and third- tier cities in China. Specifically examining Douyin in this instance may yield varying outcomes when Although live broadcasting is popular, it may be improved to standardize it. Live broadcasters utilize many methods to appear convincing and sell their products. The misleading marketing transaction will cause several issues. For instance, the product doesn't match the sample, is fraudulent, and doesn't exceed national safety regulations. Streamers also swear and act lasciviously in public, which affects the internet atmosphere. Finally, some streamers refuse to pay taxes. Live streaming has many more concerns than those listed above. As more people stream, more restrictions and monitors are needed to fix these illegal situations. Future scholars can study live broadcasters' persuasion methods and why they work. Further studies should explain customer behavior and preferences' causes. Different types of live-streaming and streams marketing different things require specific investigations to acquire a deeper understanding. Studies can compare traditional and live-streaming e-commerce to determine which is optimal. Successful live stream case studies should help explain Douyin's business model and functioning. As vital as live streaming and e-commerce for the future, investigations should anticipate its viability in other countries, especially emerging ones."
]