[
    "Abstract. The recovery of SMEs in the manufacturing sector is significant to rescuing China's real economy. Some researchers have analyzed the difficulties and causes of SMEs in the manufacturing industry in the post-epidemic era from the whole production supply chain and proposed countermeasures at the enterprise level. Still, there needs to be more in the actual situation of SMEs and government intervention. Therefore, this study uses questionnaires and interviews to analyze the data of SMEs in the manufacturing industry and related government staff in Henan Province and Hebei Province. It is found that the disruption of raw material supply, the reduction of the demand side, and the sluggish business environment brought by the epidemic have caused SMEs to face difficulties such as increased operating costs, capital and logistics chain exercise, etc. The government can recover the manufacturing industry as soon as possible in the post-epidemic era by reducing taxes, providing subsidies, and other financial support by the government in conjunction with improving financing capacity and digital transformation by SMEs. With the slowdown and suspension of the manufacturing industry due to COVID-19, the impact on China's economy continues to expand as the decline in jobs it provides and its share of total employment. Consequently, China's pillar industry manufacturing sector has shown a precipitous decline during and after COVID-19. At the theoretical stage, studies on the recovery of the manufacturing industry in the post-epidemic era focus on the problems of \"return to work and production\" of employees, including the increase in operating costs and the low actual number of employees at work, etc. These ignore the downward trend caused by the development of e-commerce and the flow of talents to virtual and real estate industries and the government’s role. Research on the challenges behind the layoffs in the manufacturing industry caused by the epidemic, the high competitive pressure on small and medium-sized enterprises(SMEs) caused by the shift from the export-oriented corporate market to the domestic one, the significant decline in the number and happiness of employees, and the macroeconomic control by the government in the recovery process are also severely lack of which did not make good use of government support to break the barriers in the post-epidemic era. Therefore, this study focuses on the latter two issues, aiming to help the government grasp the natural and effective recovery situation of manufacturing among small and medium-sized enterprises in the post-epidemic era, provide practical recovery measures, and also help small and medium-sized enterprises in the manufacturing industry break the bottleneck of recovery and break the unfavorable factors that hinder the development. The recovery of small and medium-sized enterprises, which occupy the majority, is significant to rescuing China's real economy. This study starts from the field of public administration. It uses questionnaires and interviews to research the current situation of SMEs' recovery at the post-epidemic era stage, with a more direct research method and a more narrow-focused research perspective. First, a questionnaire containing 21 questions on the resumption of production, financing, revenue difficulties, etc., was distributed to small and medium-sized enterprises in the tire manufacturing industry in Hebei and Henan Provinces. The data were collected from the two levels of employees and managers of the enterprises. Secondly, the questionnaires containing 20 questions on policy formulation, implementation, feedback, etc., were distributed to the government departments related to the tire manufacturing industry to answer. In addition, this study will use the qualitative questionnaire and interview method. The analysis is based on the questionnaire data and interviews with both enterprises and government subjects to study the operation of the tire manufacturing SMEs and the efficiency of related policy support given by the government during the epidemic. The issues of this questionnaire are distributed by adopting the principle of stratified sampling, and the selection of interview samples follows the principle of saturation, which means designing interview questions and selecting interview subjects in a targeted manner until more in-depth and extensive conclusions are drawn. The study will analyze both enterprises and the government, examine the core challenges of recovery for small and medium-sized enterprises in the tire manufacturing industry in the post- epidemic era, analyze the causes of the problem, and identify practical macro intervention measures from the government level.",
    "Currently, the manufacturing, supply chain, demand side, and foreign trade of China's manufacturing industry face significant obstacles and challenges. From the perspective of production and manufacturing, the most prominent problem in small and medium-sized manufacturing is the ' resumption of production ' problem faced by enterprises, and up to 84.5 % of enterprises believe that the ' increase in production and operation costs of enterprises ' is the most significant impact of the epidemic on them [1]. The increase in the price of production and operation of enterprises is mainly concentrated in the decline in production efficiency due to the low rate of employee arrival, as well as the massive gap in cash flow of enterprises during the shutdown period, the high cost of housing rent, equipment depreciation, personnel salary guarantee, loan interest and the significant demand for epidemic prevention materials brought about by the resumption of work make the production cost increase rapidly [2]. In the supply chain, different territorial anti-epidemic policies, traffic controls, and price increases pose significant challenges to transporting and dumping raw materials and finished products [3]. On the product demand side, the manufacturing Purchasing Managers ' Index (PMI) was below 50 % from March to May 2022, reflecting the economic recession of the manufacturing industry [3]. Finally, in foreign trade, China's export difficulties caused by the epidemic have forced some enterprises to import parts from abroad, resulting in a position of trade outflow [2]. At the same time, the dishonesty of enterprises caused by poor traffic has jointly led to the dilemma of trade cooperation. From the supply side, the resource advantage country relies on the resource advantage to reduce the export through trade to meet its own needs. High-end raw materials include critical IP import, high-end reagents, precision instruments, and other equipment; scarce raw materials are common in electromechanical products, chemical products, fossil fuels, iron ore, etc. [4]. Represented by the above raw materials, the reduction of supply makes the manufacturing industry unsustainable. From the supply chain on the one hand, the decline in production capacity caused by the postponed resumption of production in China has led to a reduction in the demand for upstream raw materials, which has affected the front-end enterprises of the supply chain. On the other hand, as the epidemic intensifies globally, the problem will be multiplied and amplified through the global supply chain network, bringing a reverse impact on China. From the perspective of the international business environment, the effect of the epidemic and the measures of international trade have hindered a more comprehensive range of people, logistics, and capital flows, and the global industrial chain is facing the risk of chain scission. The impact is mainly manifested in decline in worldwide demand and supply contraction directly caused by the shutdown of enterprises in developed countries, which aggravates the pessimism of the global economy. The uncertainty brought by the epidemic hinders corporate investment and household consumption and other impacts both supply and demand [5]. From a technical point of view, the new round of information technology blowout development has enabled developed countries to reduce the differences in production costs and production convenience with developing countries through the use of information technology so that the cost of moving back in the production chain has become lower. Therefore, the epidemic has increased the possibility of countries worldwide changing the layout of global supply chains through information technology, increasing the uncertainty faced by China's manufacturing industry [6]. In the context of the epidemic, the manufacturing industry faces many problems. This study takes the tire manufacturing industry as an example. The employees and managers of different levels in small and medium-sized enterprises in the tire manufacturing industry are investigated through questionnaire surveys and in-depth interviews. The selection of interview samples follows the principle of meaning saturation. The interview questions are designed, and the interviewees are selected in a targeted manner until conclusions with more depth and breadth are drawn. According to the results of questionnaire interviews, this research found that the overall impact of the epidemic on enterprises is relatively significant, and many enterprises still need to be maintained. The reasons for the operational difficulties are mainly the inability of enterprises to start usually and the problem of capital operation. The countermeasures taken by enterprises show a diversified trend, primarily to reduce expenses and compress costs. In addition, the most desirable solution for enterprises is direct government support, such as tax incentives and interest relief.",
    "First, Increased uncertainty in production supply. Under the influence of the new coronavirus epidemic, the manufacturing industry of small and medium-sized enterprises, mainly labor-intensive production, is constantly at risk of shutdown, unable to ensure the continuity and certainty of production and manufacturing. The uncertainty of the epidemic has led to an increase in business operating costs, labor costs, land rents, and taxes; frequent shutdown is challenging to maintain the regular operation of enterprises and production efficiency; second, the demand-side contraction effect has increased. As the demand side is the terminal of the industrial structure, the epidemic has reduced people's desire for consumer goods, which has spread to the manufacturing industry and hindered its development. In addition, the trade channels for foreign exports have also been disrupted, and orders have been canceled due to external factors such as logistics and policies caused by the epidemic; third, Capital is the most crucial support for the regular operation of enterprises. Under the epidemic situation, the flow of corporate funds could be smoother. The superposition of rigid expenditures such as costs, wages, interest, and venue rents brought about by the inventory backlog further makes it difficult for small and medium-sized manufacturing industries to sustain—poor circulation of funds. After the epidemic outbreak for a long time, most small and medium-sized manufacturing industries are facing capital chain rupture; fourth, the fracture of the logistics chain leads to difficulties in the circulation and transportation of raw materials and products, raw materials, or finished products due to transport or accumulation of dishonesty caused by the loss of customers or a large number of imported goods [7]. The causes of the above problems are concentrated in the obstruction of raw material trade and the attack caused by the domestic epidemic, the block of supply at the front and back ends of the supply chain, the international trade circuit breaker brought by the epidemic, the sluggish business environment and the uncertainty brought by the new round of information technology, including digital economy and blockchain, to the manufacturing industry. The performance is as follows: On the supply side, due to the uncertainty of the epidemic and the uncertainty of the global economic situation, raw material exporting countries rely on resource advantages to meet their development as a prerequisite to reduce foreign exports, resulting in limited raw materials for China's manufacturing industry; In terms of the supply chain, the shutdown of enterprises caused by repeated domestic epidemics makes the upstream and downstream links of the industrial chain unbalanced. Secondly, the impact of the global outbreak on China is multiplied through the supply chain. In terms of the business environment, the downward trend of the global economy is significant, which hurts consumption and investment. At the same time, restrictive policies make the international business environment harsh, and the global industrial chain faces the risk of chain scission. Regarding technology, the instability of production in developing countries caused by the epidemic indirectly prompted developed countries to strengthen their scientific and technological upgrading, thus changing the show’s layout worldwide [8]. Aimed at the Renaissance of small and medium-sized manufacturing in China, this research needs to upgrade the industrial structure, update the manufacturing means, and Restore the capital chain as soon as possible. Under the macro-control of the government, At the same time, manufacturing enterprises' micro-cooperation is needed, highlighting their sense of social responsibility. The government will cut taxes and fees and deepen the reform of enterprises to improve regulation and service. The government subsidizes or relieves social security, rent, and employee salaries. It will introduce multi-dimensional and universally applicable support policies, such as phased rent cuts, reimbursement of hiring costs for enterprises, and operation subsidies. The government will reduce the time required for government approval and implement management on the list of business permits to stimulate manufacturing enterprises' vitality. In terms of funds, financial support will be provided to improve the financing environment. Give priority to helping industries greatly affected by the epidemic and accurately locate and implement policies to help small and medium-sized enterprises in distress [9]. The government will establish a communication mechanism between banks and enterprises. According to the specific conditions of enterprises, banks should appropriately lower the threshold of enterprise loans to help enterprises maintain their operations. Under the premise of ensuring information security. The government will accelerate information sharing on market entities' registration, administrative penalties, judicial decisions and enforcement, and tax and social security payments. To help banks improve their ability to serve small and medium-sized enterprises. The government will strengthen cooperation with financial institutions and implement a risk-sharing model to help enterprises overcome risks. Reduce the negative impact of labor shortage. The government can provide specific housing for workers and subsidize employees’ wages in enterprises. Reduce the cost of enterprise due to labor shortage and other factors Affected by the epidemic, enterprises should make a reasonable budget to prevent the financial risks caused by insufficient funding. In addition to the daily annual and monthly budgets, it is necessary to make corresponding forecasting plans for sudden external threats [10]. Improving the financing capacity of enterprises､ and expanding their capital supply. Small and medium-sized enterprises should actively respond to the government's funding policy. Strengthen the cooperation with financial institutions, expend funds, and relieve the problem of capital shortage. In terms of sales channels, enterprises can occupy supporting markets. Domestic retail, domestic supporting, overseas retail, and overseas supporting, from the perspective of enterprises. When the product is not smooth in the domestic market due to the epidemic, it can expand its share overseas to adjust sales prices to grab more of its halving in production and sales. Accelerate the realization of digital factory production. This study found that the shortage of manufacturing labor force is a significant factor restricting enterprises' output under the epidemic background. To effectively alleviate the negative impact of labor shortage, enterprises should accelerate the digital production of factory layouts. To form a comprehensive collaboration of hardware and software in the factory, truly digitized and online, and open up the entire data link within the enterprise. Further, with data as assets, technology as a means, and talent as the basis, the technology platform system can be built to support continuous business innovation.",
    "The epidemic brought a heavy blow to tire manufacturing enterprises. In the post-epidemic era, with the gradual liberalization of the epidemic policy, enterprises and the government must work together to eliminate the adverse effects of the epidemic. The theoretical creativity of this study lies in the fact that a typical manufacturing enterprise, tire manufacturing, was selected to investigate the internal operation of the main body of the enterprise, employees and managers, and government officials. And questionnaires were distributed to discuss the real problems faced by the manufacturing SMEs during the epidemic, to ensure the authenticity and reliability of the data sources of this study, and to understand the internal development dilemmas faced by the manufacturing SMEs. At the same time, the study will seek solutions and assistance from the government, interview managers with a background in manufacturing enterprise management, and obtain the government's views and policies on enterprise development. Then the study will place the issue in the field of public administration, understand the government's assistance on how to help enterprises resume production, and better solve the operational problems of enterprises under the epidemic. From the government's perspective, the study proposes countermeasures to improve the business environment, reduce the epidemic's impact on the development of the actual manufacturing industry, and provide new ideas for advancing This study takes the tire manufacturing industry as the main body of the research and has an in- depth understanding of the internal staff and management. The data sources are direct and honest, but due to practical limitations, only a specific type of enterprise in the manufacturing industry was investigated, so the representativeness of the overall manufacturing industry needs to be improved to a certain extent. The interview content of public officials is reasonably designed. Still, due to the actual conditions, it is impossible to have a comprehensive and in-depth understanding of the policy support for the manufacturing industry by governmental entities. Also, there is a particular defect in the universality of suggestions and countermeasures. The shortcomings of this study can be solved and improved in the future under a more extensive and unrestricted research environment."
]