[
    "ABSTRACT-Considering the dynamics of the fast-changing and often unpredictable global environment, a formal, reliable, and comprehensive framework for analyzing a business’ strategic posture may be useful. This paper examines an assessment tool, Igor Ansoff’s seminal contributions to strategic diagnosis. That tool focuses primarily on identifying and enhancing a firm’s strategic financial performance potential through analysis of an industrial sector environmental turbulence level relative to the firm’s aggressiveness and capability responsiveness. A small business survey conducted in the Henan Province of China after the COVID-19 lock-down analyzes the future strategic financial performance potential of the province’s small businesses as well as the interactions among the businesses’ external environmental turbulence level, aggressiveness, and capability responsiveness. This paper is based on a computer research model based on the seminal work of Igor Ansoff. Its main innovation is represented by the fact it extends beyond the traditional steps method in the strategic decision- making process. Even though that is considered critical for determining the future course and optimal strategy of a firm, Ansoff adds that the traditional steps method fails to examine the interrelationship of all the strategic decision-making variables, particularly what he refers as the “firm’s strategic posture”. In 1987, Igor Ansoff developed an interactive computer program for strategic management analysis. The program was designed to integrate the analytical power of a PC with the experiential knowledge of a firm’s senior management. The program, ANSPLAN-A, was intended to serve as an internal consulting tool and would include input from line managers who were responsible for strategy implementation [3]. This tool is both a descriptive as well as a prescriptive. In this paper we will use mostly the descriptive aspect of it. capability responsiveness (CR) must be in alignment in order for the firm to achieve optimal future financial strategic potential. Thwaites and Glaister assert that, “to succeed in an industry an organization must select a mode of strategic behavior which matches the levels of environmental turbulence and develop a resource capability which complements the chosen mode” [11]. Based on Ansoff’s paradigm, a questionnaire was prepared to measure SPA, to measure its three components ETL; SA; and general management CR, and, subsequently, to check alignment based on the combination of the three levels. As part of a class project, 148 students of the MGT 301 Course, Principles of Management, at SIAS University in Zhengzhou, Henan, interviewed small businesses in their province. Before conducting the interviews, the students completed a short training on the questionnaire terminology in April 2020, at the end of the lockdown period and past the peak of the COVID- 19 pandemic. Approximately 70% of the interviews were of people in the service sector, with the balance from the manufacturing sector. The interviewees were business managers and/or owners. ANSPLAN-A’s objective is Strategic Posture Analysis (SPA). Its foundation is the Strategic Success Paradigm, which states that an industry environmental turbulence- level (ETL) assessment, a firm’s strategic aggressiveness (SA), and general management © The Authors, published by EDP Sciences. This is an open access article distributed under the terms of the Creative Commons Attribution License 4.0 (http://creativecommons.org/licenses/by/4.0/). that encompassed sector, industry, and marketing. Possible responses were on a scale from 1 (placid and stable) to 5 (surprise-full and discontinuous). Table 1 presents the ETL questions posed to respondents. The average responses to the three descriptor question categories were 3.06 for “Innovation Turbulence,” 2.81 for “Macro Environmental Turbulence,” and 3.30 for Marketing Turbulence. The average of the three averages is the “Environmental Turbulence Level (ETL)” and that result was 3.06. Capability responsiveness (CR) is general management’s ability to “engage in behavior that will optimize attainment of the firm’s near and long-term objectives” [8]. CR is assessed in two complementary ways, first in terms of responsiveness behaviors (responsiveness to changes in the external environment) and second via capability profiles (of the firm that produced different types of responsiveness). CR data were assessed using three surveys question levels measuring “General Managers Capabilities,” “Firm Culture,” and “Firm Structure.” Table 2 presents the CR questions posed to respondents. The average responses to these question categories were 3.26, 3.31, and 3.23, respectively. “Firms Capability Responsiveness Level (CR)” was assessed at 3.27. Next to be assessed were the firms’ SA levels. The firms’ “Marketing Aggressiveness” and “Innovation Aggressiveness” were both measured. The interviewers posed a series of seven Marketing and Innovation Aggressiveness descriptor questions. Table 3 presents the SA questions posed to respondents. The average results of the Marketing Aggressiveness and Innovation Aggressiveness question categories were 3.11 and 3.19, respectively. The average of these two averages was 3.15 and represents firms’ Strategic Aggressiveness Level (SA).",
    "- the seminal work initiated in 1965, defining the foundation of Strategy and Strategic Management [1]., - The School of Planning approach [3]., At the peak of his academic career Ansoff developed the less notorious empirically proven Strategic Success Paradigm. That was empirically validated in numerous cases, by scholars and practitioner around the world [5]. At this point, the first alignment “gap” between ETL and CR was calculated using this equation: Gap = (ETL) – (CR) or 3.06 – 3.27 = (.21). This number represents the “Capability Responsiveness (CR) Gap.” Continuing the analysis, the second alignment “gap,” this time between ETL and SA, was determined. Gap = (ETL) – (SA) or 3.06 – 3.15 = (.09). This number represents the “Strategic Aggressiveness (SA) Gap.” Ansoff provided guidance and clarification about the importance of aligning CR/SA with the ETL to achieve optimal strategic success [3].. Empirical evidence confirms that a “gap” in CR and/or SA would adversely affect firms’ optimal future financial performance. An excellent alignment, as in our results, proves exactly the opposite. Refer to Table 4, below, for details about gap assessment. After Prof. Ansoff passing, his prolific research suffered a downturn. One exception to that trend was represented by Kipley’s work [8]. which considerably updated Prof. Ansoff’s Paradigm, in light to the secular shift to global secular phenomena like globalization, technology etc. Currently Ansoff’s paradigm appears robust and up-to date even considering a chronic increase to the environmental turbulence level that Ansoff’s observed at the end of last century [9]. Ansoff’ has been viewed by other representative scholars, like Harry Mintzberg just as a rationalist to a fault, insisting that everything quantifiable should be quantified [10]. Mintzberg also stated “ Corporate Strategy remains the most elaborate model of strategic planning in the literature [10]. As Ansoff himself stated “Rather than quantify, I seek patterns in complexity which can help managers to do their work in the overwhelmingly complex and turbulent world of today and tomorrow. During the past 25 years, since my first book Corporate Strategy was published, my progress has been from a limited cognitive economic rationality to a broader perspective which embraces economic, psychological, sociological, and political rationalities which are all necessary to an understanding of today’s world of organizations and their behavior.” [4] In the Henan Province in China, COVID-19 had a negligible effect on the future external environment of small businesses. ETL results are well-aligned in terms of both CR and SA. The CR and SA gaps calculated were minimal, even at sub-component levels (“Managers, Culture, Structure gaps” and “Innovation and Marketing gaps”). Henan’s small businesses did not suffer any kind of significant disruption during the COVID-19 lockdown period and their future financial performances should continue to be strong. It is desirable that in the future the useful and updated tools of Strategic Posture Analysis would be recognized in a broader more holistic perspective could be again globally used by contemporary scholars and practitioners to demonstrate their intact efficacy and validity [7]."
]