[
    "Against the backdrop of rapid growth in the tertiary sector, red tourism centered on revolutionary narratives is flourishing, attracting increasing numbers of visitors. This study examines the spatial patterns and influencing factors of 408 red tourism sites in Henan Province using spatial analysis techniques and the geographic detector method. Analysis reveals uneven distribution of these sites, with concentrations primarily in the Yellow River basin and southeastern Henan. Spatial analysis of the study subjects reveals a pronounced clustering pattern among these sites. Simultaneously, geographic detector analysis identifies natural, economic, and social factors as significantly influencing the spatial distribution of these attractions. Based on these findings, the paper examines the relationship between the spatial layout of red tourism sites and regional tourism development and economic growth, proposing recommendations for rational planning and development of red tourism attractions. Red tourism represents a uniquely Chinese tourism category with distinct characteristics, functioning as a social system engineering project. It embodies multidimensional values encompassing economic, political, and cultural dimensions, emerging progressively within China's tourism development process as one of the tourism types with Chinese characteristics. In recent years, with rapid economic growth, increasing numbers of people have recognized the potential and importance of the tourism industry. As one of the regions rich in red tourism resources, Henan Province has become a popular destination for numerous visitors. Henan's red tourism sites encompass numerous revolutionary historical relics and cultural landscapes, such as the Central Plains Revolutionary Base Area, red culture education bases, and the Victory Monument of the War of Resistance Against Japanese Aggression. These attractions draw substantial visitor numbers while positively impacting the region's tourism industry and economic growth. However, challenges have emerged in the development and management of these sites. Issues like uneven distribution of attractions, waste of tourism resources, and overdevelopment directly impact the appeal and economic benefits of red tourism destinations. Therefore, conducting in-depth research on the spatial patterns and influencing factors of Henan's red tourism sites holds significant theoretical and practical value for effectively addressing these challenges and enhancing their attractiveness and economic returns. Red tourism sites are not merely destinations for leisure; they bear the unique revolutionary memories of their respective lands. Martyrs sacrificed their lives to forge a peaceful homeland for the Chinese people. As descendants, we must remember history and honor these heroes— this is the very essence of red tourism sites. Globally, red tourism research has emerged as a prominent field. However, existing studies predominantly focus on the significance, characteristics, and development planning of red tourism, with limited research on the spatial patterns and influencing factors of specific red tourism sites. Therefore, investigating the spatial patterns and influencing factors of red tourism sites in Henan Province will fill a gap in this field and contribute to deepening the understanding of their unique features and economic value. As one of China's major economic and populous provinces, Henan's rich human and geographical conditions provide a foundation and guarantee for the development of red tourism. Yet, opportunities coexist with challenges. Faced with the ever-increasing demand for tourism, various regions have witnessed phenomena detrimental to red tourism and the revolutionary spirit, such as distorting history and blindly following trends. While some research on red tourism has addressed this issue, quantitative and comprehensive analyses utilizing tools like geographic detectors are only emerging. Therefore, by examining the spatial patterns and influencing factors of red tourism sites in Henan Province, this study analyzes the distribution characteristics and spatial autocorrelation of these sites. It explores how natural, economic, and social factors impact their spatial distribution and proposes recommendations for optimizing the spatial layout of red tourism sites. This research aims to provide scientific evidence and policy support for the sustainable development of red tourism sites in Henan Province. specialized software to effectively apply theoretical principles to practical problems. Lucy investigated the impact of agricultural industries on rural economies by analyzing spatial distribution patterns of inputs and outputs across 52 farm samples, revealing connections between agricultural spatial layout and rural development[1] . Ewa Kiryluk-Dryjska and colleagues, using Polish rural areas as a case study, employed linear regression models and other methods to investigate the decisive factors determining the spatial distribution and development of agriculture. They further explored the relationship between these decisive factors and agricultural policies[2] . Murphy applied the central place theory to measure the structural characteristics of express delivery networks, concluding that the hierarchical level of delivery points plays a crucial role—particularly in defining their service coverage and functional divisions.[3]. Li Jun and other scholars captured the POI (Point of Interest) data of YTO Express, and carried out visual processing on the national cargo distribution routes based on ArcGIS software. Accordingly, they analyzed the facility layout and the characteristics of express cargo flow of YTO Express nationwide[4]. Shen Qiao conducted a spatial pattern analysis of red tourism attractions in Shanxi Province and proposed the conclusion of developing red tourism by leveraging the advantages of old revolutionary base areas, ethnic minority- inhabited areas, and border areas[5]. Scholars led by Yang Zaitian, in accordance with the development trends of the global tourism market and combined with the current development status of red tourism in Hunan Province, carried out a detailed and comprehensive analysis of the resources of the province's anti-Japanese war cultural tourism attractions. They summarized suggestions on vigorously exploring, expanding, and utilizing the potential advantages of red resources[6] In examining influencing factors for rural and cultural tourism, experts have innovated both theoretically and instrumentally, yielding robust and reliable analytical outcomes. Perdue et al. proposed a classic demographic model explaining how demographic factors — including age, gender, education, and employment—influence residents' support for future tourism development[7] . Basset K explored cultural heritage tourism from a novel perspective, proposing the critical criterion of \"whether the quality of cultural heritage tourism resources influences outcomes\"[8] . Csapo M J employed questionnaires and field interviews to investigate island tourists' environmental perceptions, emphasizing the role of socio-cultural factors in enhancing island tourism environments and promoting cultural tourism.[9] . Ilia A S analyzed conditions for cultural tourism development in Mexico's Izamal town, including infrastructure and visitor flow[10].George analyzed two competing tourist attractions in Pennsylvania, USA, and concluded that destination tourism resources are the main factor influencing the development of the tourism industry.[11] Pearce D G (1998) argued that in the field of providing tourism public services, the intervention by the Paris government is more common, and such governmental behavior has played a positive role in promoting the development of Paris' tourism industry[12]. Balaguer argued that the agglomeration development of the tourism industry not only helps enhance the comprehensive competitiveness of the regional tourism industry, but also plays a positive role in driving the growth of the local national economy[13]. Zhong Lili specifically explored the impact of differences in the demographic characteristics of residents in tourism destinations on their support for tourism development. She found that factors such as residents' gender and household income level are all related to their level of support.[14] This study selected 408 red tourism sites officially announced by the Henan Provincial Department of Culture and Tourism as the research subjects, forming the foundational content of this investigation. Geographical data for prefecture-level cities in Henan Province was sourced from the National Fundamental Geographical Information Center Website. Concurrently, area data and road network data for all prefecture-level cities in Henan Province were obtained for research purposes. These datasets were utilized to examine the spatial distribution characteristics of red tourism sites in Henan Province.",
    "The Nearest Neighbor Index measures the spatial distribution of point features by using random distribution as a standard, describing the degree of spatial proximity among point elements.[15] Kernel Density Analysis is frequently used to characterize the spatial distribution features of various point elements[16]. It is a spatial visualization statistical method that conducts statistics on point elements within a region and fits them into a smooth conical surface to reflect the occurrence probability of point elements in regional units. The higher the occurrence probability, the denser the distribution of point elements[17]. This method can be used to explore the agglomeration of red tourism attractions in Henan Province at the municipal scale. In geography, The geographical concentration index analyzes the spatial distribution of the whole region[18]., we can determine the distribution patterns of red tourism sites in Henan Province. In geographical research, this indicator is frequently employed to investigate the degree of clustering within a study area. Its value ranges from 0 to 1, with results closer to 1 indicating a higher level of aggregation among the objects under study. Moran's I index is commonly used to test and determine the global autocorrelation of landscape distribution within a study area[19], there by revealing the spatial distribution patterns and correlations of spatial data. The geographic detector model is a statistical method for detecting spatial differentiation and revealing the driving forces behind such phenomena[20]. This study employs the factor detection and interaction detection functions of the geographic detector. Factor detection explores whether a specific influencing factor causes spatial variation in a phenomenon and identifies the reasons for such variation. Interaction detection is an analytical method that investigates the dependent variable by identifying interactions among different factors. Using the Nearest Neighbor tool in ArcGIS 10.8, the nearest neighbor index of red tourism sites in Henan Province was analyzed. Results indicate that the nearest neighbor index R=0.412 < 1, with a Z-score of -25.039 < -2.58, passing the 1% significance level test. This confirms that the spatial distribution of red tourism sites in Henan Province exhibits a clustered pattern with strong statistical significance. Using spatial analysis tools to generate a kernel density map further reveals the spatial clustering patterns of red tourism sites in Henan Province. Analysis of the map indicates that high-density clusters of red tourism sites have formed in Xinyang, Luohe, Zhengzhou, and Jiaozuo. Distribution density is relatively low in other regions, directly linked to these four cities possessing profound red historical legacies and well-developed tourism infrastructure systems. Calculations show that the Geographic Concentration index for the distribution of red tourism sites in Henan Province is 26.67%. If the distribution were uniform, the geographic concentration index would be 23.58%. Thus, the actual distribution index exceeds the uniform distribution index, indicating that the distribution of red tourism sites is relatively concentrated. Calculating the Gini Coefficient reveals a value of 0.952 for Henan's red tourism sites, yielding a distribution uniformity index of 0.048. This result indicates that red tourism sites exhibit concentrated distribution across the province's 18 prefecture-level cities, with uneven distribution. Using spatial analysis tools in ArcGIS 10.8, it is found that the spatial distribution of red tourism sites in Henan Province exhibits distinct spatial clustering characteristics. Through Geographic Detector calculations, the influence values of each factor on the spatial pattern of red tourism sites in Henan Province were obtained. The interaction detection function in Geographic Detector was employed to investigate the interactive effects of various influencing factors on the spatial distribution patterns of red tourism sites in Henan Province. The figure indicates strong nonlinear synergistic effects among influencing factors, with some exhibiting dual-factor enhancement. The influence q-value for the number of sites (X2) is 0.37, while that for the tertiary industry share (X4) has an influence q value of 0.15, and their interaction reaches 0.87. The interaction between economic output value and road mileage is particularly strong, making it the most influential factor affecting the spatial distribution of red tourism sites in Henan Province. Spatial analysis of Henan's red tourism sites using ArcGIS tools revealed significant spatial distribution imbalances. Spatial distribution pattern analysis indicates an overall uneven distribution across the province. Spatial density analysis, calculated by density per prefecture, revealed significant disparities in distribution density across regions. Jiaozuo and Luohe, with relatively smaller geographical areas, exhibited excessively high density of red tourism sites, further highlighting their uneven distribution. Building upon spatial distribution and density analysis, quantitative assessments using indicators like geographic concentration indices and spatial correlation analysis consistently point to the dispersed and uneven distribution characteristics of Henan's red tourism sites. This overall dispersed yet locally clustered distribution structure hinders interregional connections, exchanges, and cooperation among these sites. The spatial imbalance will ultimately evolve into developmental disparities, thereby impacting the growth of red tourism in Henan Province.",
    "Transportation plays a pivotal role in all aspects of regional development. Industry experts categorize the six key elements of tourism as \"eating,\" \"lodging,\" \"transportation,\" \"sightseeing,\" \"shopping,\" and \"entertainment.\" As one of these elements, transportation serves as the medium connecting travelers to attractions. The accessibility of roads directly influences the distribution of red tourism sites and the economic and social benefits they generate. Geographic detector analysis reveals that the detector score for highway mileage (X6) is 0.14. While its individual influence ismodest, its impact significantly increases when combined with other factors. Notably, its interaction with permanent resident population (X5) reaches 0.68, exhibiting a nonlinear enhancement trend. In summary, most red tourism sites are located in areas with well-developed transportation infrastructure, while regions with inadequate transportation facilities have relatively fewer sites. Enhancing transportation levels across the board would undoubtedly uncover more red tourism sites, thereby promoting the development of red tourism in Henan Province. As a unique segment within China's tourism industry, red tourism is a multifaceted sector integrating various industries. The success of any tourism industry hinges primarily on visitor numbers, which are most significantly influenced by total population. Geographic detector analysis reveals that the Permanent resident population (X5) yielded a value of 0.42, ranking first among all influencing factors. This indicates its significant impact on the spatial distribution of red tourism sites in Henan Province. Due to the unique nature and limitations of red tourism, most sites are located in rural areas with lower population density. Consequently, many red tourism sites remain unknown to the public, directly affecting visitor numbers at these sites in Henan Province. Deeply excavating and developing Henan's natural and cultural resources for red tourism, creating a distinctive brand unique to Henan, and offering personalized services are crucial measures to address the uneven spatial distribution of red tourism sites in the province. Actively exploring red stories, locating red sites, and uncovering red figures should be pursued. By integrating contemporary new media, Henan can develop a multi-brand, integrated tourism The completeness of tourist transportation routes and accessibility are essential factors every traveler must consider before departure. The convenience and diversity of transportation options directly impact the development of red tourism. Since most of Henan's red tourism sites are located in rural areas and regions with complex terrain, highways and railways are the most critical transportation modes. For highways, upgrade rural road standards and strengthen connections between red tourism areas and major urban thoroughfares to establish a province- wide red tourism transportation network. For railways, expand coverage in relevant regions and increase train services to red tourism destinations. Using ArcGIS spatial analysis tools, including calculation functions such as the nearest neighbor index, geographic concentration indices, and relevant features of the Geographic Detector, we analyzed the spatial distribution patterns and influencing factors of red tourism sites in Henan Province. The conclusions are as follows: In terms of spatial distribution patterns, the nearest neighbor index indicates that Henan's red tourism sites exhibit clustered distribution. High-density tourism clusters have formed in Zhengzhou, Xinyang, Jiaozuo, Luohe, and other areas, while sites in other regions remain relatively scattered. This demonstrates varying degrees of clustering in the distribution of Henan's red tourism attractions. Regarding spatial equilibrium, calculations of the geographic concentration index confirmed the concentrated distribution of red tourism sites. Further validation and in-depth analysis using the Gini coefficient ensured scientific rigor. Results indicate uneven distribution across Henan's 18 prefecture-level cities. Overall spatial correlation analysis reveals positive correlations among red tourism sites. Distribution is not uniform but exhibits distinct clustering patterns across cities. Natural factors form the foundational conditions for developing and expanding red tourism sites, economic factors determine the upper limit of their construction, and social factors directly influence their development. Each exerts varying degrees of influence on the spatial distribution of Henan's red tourism sites, with elevation, GDP, and permanent resident population having the strongest impact and exhibiting the most pronounced interactions. To further optimize the spatial distribution pattern of Henan's red tourism sites and promote the development of red tourism in the province, efforts should focus on: - Deepening the exploration of red stories - Building distinctive red tourism brands - Optimizing tourism transportation infrastructure - Enhancing the transportation network - Improving service standards and quality in the tourism sector.",
    "This work is supported by Henan Province Philosophy and Social Sciences Research Project on Strengthening the Province through Education in 2025, Project number: 2025JYQS0248"
]