[
    "Abstract. Paying attention to the re-employment situation of the community elderly is a positive response to the aging of the society and sustainable economic development, and the re-employment of the community elderly is expected to take on the task of “breaking the situation”. Based on the data of questionnaires and semi-structured interviews in Boai County, Jiaozuo City, Henan Province, this paper uses Logistics regression model to empirically analyze the factors that affect the re- employment willingness of the community elderly from three levels: individual, family and society. The study found that there are gender differences in the willingness to re-employment of the community elderly, and there is a significant relationship between age, health status and the willingness to re-employment of the community elderly, and the healthy young elderly tend to have a stronger willingness to re-employment; there is a significant relationship between the support of family members and the willingness to re-employment of the community elderly; living with their children is also an important factor affecting the re-employment of the community elderly. Finally, this paper puts forward countermeasures and suggestions to improve the re-employment situation of the community elderly from the aspects of policy formulation and publicity, platform construction, social worker intervention etc. According to international regulations, the population over the age of 60 is called the elderly, among which the population aged 60-70 is called the young elderly. The community elderly is the geographical division of the elderly, which refers to the elderly who are over 60 years old and live in the community. The community elderly are usually unemployed due to retirement, age threshold or health reasons, with pensions, children and other sources of income. According to the United Nations, population aging is defined in a country or region where the proportion of the elderly aged 60 or above in the total population exceeds 10%, or the proportion of the elderly aged 65 or above in the total population exceeds 7%. With the development of social economy, the population migration in China is becoming more and more frequent, and the phenomenon of population aging is becoming more and more serious. Data from the seventh national census shows that the elderly population aged 60 and above is 264.02 million, accounting for 18.70% of the total population, of which 190.64 million are aged 65 and above, accounting for 13.50%. In addition, compared with 2010, the number of people aged 15-59 and over 60 decreased by 6.79% and increased by 5.44%, respectively. The intensification of the aging trend is accompanied by the decline of the fertility rate, which will objectively lead to social problems such as the reduction of labor force and the increase of dependency ratio of the elderly, and increase the social burden [4-5]. Compared with 2019, the number of China's labor force decreased by 0.8% in 2020, the number of people over the age of 16 dropped by 1.3%, the employment pressure of young people is increasing, the supply of jobs in the market exceeds demand, and the employment situation is grim. With the increasing aging of the population, encouraging “seniors” to enter the labor market again has become a common way to deal with the aging population at home and abroad. As the representative of “seniors”, the re-employment problem of the community elderly has been gradually developed and paid attention to. The re-employment of the elderly in the community can not only make up for the labor gap to a certain extent, reduce the social burden of providing for the aged and the life pressure of their children, but also play the role of human resources for the elderly [5, 7]. The Blue Book on Aging: a Survey report on the living conditions of the elderly in Urban and Rural areas in China shows that there are more than 90 million working people over the age of 60. Besides, the Fifth Plenary session of the 19th CPC Central Committee put forward the “implementation of the national strategy to actively deal with the aging of the population”, which is the first time in the plenary session of the Party to actively deal with the aging of the population as a national strategy. In particular, the “active development of human resources for the elderly and the development of silver economy” refers to promoting and supporting the re-employment of the young elderly and solving the contradiction between supply and demand of talents brought about by aging, which is of great practical significance. In November 2021, the CPC Central Committee and the State Council issued the opinions on strengthening the work of the elderly in the New era, which clearly encouraged the elderly to continue to play their role and explore flexible employment models suitable for the elderly. it also gives a detailed explanation on the ways and ways to support the re-employment of the elderly. Therefore, in this context, the study of re-employment of community elderly has a certain theoretical and practical significance.",
    "Nowadays, the re-employment of the elderly in the community has been encouraged and developed to a certain extent, but the current situation of re-employment is still not optimistic. The employment rate of the two age groups of 60-64 and 65-69 in China is only 49.1% and 36%. The re- employment of the community elderly is faced with practical difficulties, such as age restrictions, narrow employment channels, lack of self-quality and so on, which limit the re-employment opportunities of the community elderly to varying degrees and reduce their re-employment kinetic energy [12, 13, 14]. Xu and Lu (2021) called for appropriate postponement of the retirement age, payment of old-age insurance and special legislation on the re-employment of the elderly. Lei and Wang et al. (2020) mentioned the development of professional and hierarchical education for the elderly to improve the comprehensive quality of the elderly; the integration of multi-resources to build a platform for the development of human resources for the elderly to provide technical support for the re-employment of the elderly. At present, the academic research on the re-employment of the elderly is mostly focused on the theoretical level, but the depth of quantitative research is not enough. Therefore, focusing on the county and district level to study the current situation and influencing factors of re-employment of community elderly will help to explore the “way to break the situation” of their practical predicament. So, this paper will use the combination of qualitative and quantitative research methods, through questionnaires and semi-structured interviews to investigate the urban community elderly in Boai County, Jiaozuo City, Henan Province. First of all, this paper studies the current situation of the re- employment of the community elderly, analyzes the plight of the re-employment of the community elderly, and then uses SPSS software to empirically analyze the factors that affect the re-employment of the community elderly. Finally, according to the empirical results, we put forward some countermeasures and suggestions to promote the re-employment of the community elderly. Through this study, we hope to have a detailed understanding of the situation and influencing factors of the re- employment of the community elderly in the county , and provide a reference basis for the relevant research on the re-employment of the community elderly. The remaining structure of this paper is: the second section is the literature review related to the re-employment of the community elderly; the third section is the analysis of the current situation of the re-employment of the community elderly; the fourth section is the research on the influencing factors of the re-employment of the community elderly; the fifth section is countermeasures and suggestions. By combing and integrating the existing research on the re-employment of the community elderly, we mainly carry out from the following four aspects: The aging of population in China has the characteristics of “getting old before getting rich”, “aging before preparation” and “rapid aging process”. It not only has the universality similar to that of other aging countries in the world, but also has the particularity created by special national conditions. Aging reduces the demographic dividend that has promoted China’s economic development for a long time, and brings pressure on the sustained economic growth of our country. Tu and Jin (2021) believe that the insufficient supply of labor, the intergenerational contradiction brought by the increasing burden of old-age care, and the hindrance of economic development are the realistic background of the development of human resources for the elderly. Song and Yu (2011) think that the re-employment of the elderly is also an effective measure to improve the happiness and value of the elderly. In addition, some scholars believe that the re-employment of the community elderly is also a concrete manifestation of the realization of individual labor rights [4,11,16]. To realize the re- employment of the elderly is not only the general trend of the aging development of our country, but also the key measure to transform the social burden into a “longevity dividend” [1,17]. Wan (2013), based on the social survey of 16 districts in Shanghai, found that the community elderly have a strong demand for re-employment. However, the current situation of re-employment of the elderly is worrying: the traditional concept of providing for the elderly, lack of employability, imperfect re-employment service system, social exclusion and path dependence on policy-making make high-quality elderly resources can only achieve a low level of employment, which results in a waste of human resources. Zheng and Huang (2018) pointed out from a macro point of view, the re- employment of the elderly in China is faced with the rich labor force brought about by the population structure, the accumulation of the working population to the cities caused by the changes in the economic structure, the publicity of hidden unemployment brought about by the system transition, the lack of laws related to the employment of the elderly, strict retirement system and other restrictions. At the micro level, Tu and Jin (2021) found that the re-employment of the community elderly is faced with the reality of few re-employment platforms and channels. In addition, some scholars studied the path of legal protection of the re-employment rights of the elderly, they pointed out that the re-employment situation of the elderly is different in different industries, and the legal retirement age and the dual division of social insurance system and labor relations are major obstacles to the re-employment of the elderly in China.",
    "The willingness and status of re-employment of the community elderly are affected by many factors, among which gender and age are the most common factors, the desire for re-employment of the younger male elderly is stronger[12,14,19,20]. The research of Wang and Liu (2022), Tian et al. (2014) shows that the education level and economic status of the elderly are also significantly related to their willingness to re-employment[18,21]. On the other hand, Gong and Wang (2014) think that there is no significant correlation between education level and re-employment desire of the elderly. Lei et al. (2020) pointed out that “family opinion” and “retirement wage level” are also related to the willingness and status of the elderly to re-employment based on a case interview in Xi’an. Some scholars say that “happiness” is an important factor affecting the re-employment of the elderly, and the “happiness” of the elderly is mainly related to their economic status. In addition, some scholars empirically analyzed the influencing factors of community elderly re-employment from other angles, such as Song and Cao (2021) proved the correlation between social network status and elderly re- employment. Zhang (2021) proposed that living with children affects the re-employment of the elderly through participation in the care of grandchildren. Based on the empirical analysis of CHARLS data, Zhu and Yi (2015) concluded that the utilization rate and participation rate of old- age insurance and medical insurance affect the re-employment of the elderly in different degrees, and have different performance in rural and urban areas. In view of the practical difficulties faced by the re-employment of the elderly, scholars put forward countermeasures from the following five paths: policy formulation, concept change, legal protection, market support and social security. In terms of policy formulation, many scholars called for the reform of the current retirement system and the introduction of delayed retirement policy[1,12,16,21]. Zheng and Huang (2018) pointed out that the retirement age should not be extended blindly, and it is necessary to adopt a flexible retirement system. Gong and Wang (2014) proposed that different re- employment policies should be adopted for different types of elderly groups. It is also a good idea to subsidize enterprises that accept the elderly. In terms of concept change, the concept of gender equality in the labor market is mentioned by many scholars[12,21,16]. Wang and Liu (2022) proposed that the government and society should establish a “positive concept of old age”, which will fully understand the value of the elderly. Based on legal protection, Tian and Shen (2014), Wan (2013), Xu and Lu (2021) etc., all suggested special legislation or legal protection for the re-employment of the elderly[1,11,21]. Market support is reflected in two aspects: the labor demand side market and the elderly training market. In labor demand side market, Tong and Ding (2019) proposed to innovate the salary payment system by drawing lessons from foreign experience. In training market for the elderly, to promote the professional and hierarchical development of education for the elderly, to build an education system for the elderly, and to improve the comprehensive quality and re- employment ability of the elderly is a cluster of voices in the academic circle[12,18]. In terms of social security, Lei et al. (2020) proposed to build a human resources platform for the elderly, and some scholars suggested that the re-employment of the elderly should be guaranteed from the aspects of medical care and social insurance[16,22]. Zhang (2021) suggested establishing a comprehensive service site for the community elderly, equipped with home supporting facilities, and providing family care services. The establishment of talent centers for the elderly and supporting social organizations to provide supplementary posts for the re-employment of the elderly is also a response Based on the literature review, we have an in-depth understanding of the relevant research on the re-employment of the community elderly , mainly from four aspects: necessity, predicament (current situation), influencing factors and policy suggestions of the re-employment of the community elderly. And the existing research mostly uses the method of empirical analysis to study the willingness and influencing factors of re-employment of the elderly in the community, which provides a reference for the study of this paper. However, through the existing research, it is found that when considering the factors affecting the re-employment of the elderly in the community, the selected factors are mainly at the personal level and family level, while less attention is paid to the social level. On this basis, this paper adds social factors to comprehensively analyze the willingness and influencing factors of re-employment of the community elderly. Besides, in the empirical analysis of the influencing factors of community elderly re-employment, the existing studies mainly use big data’s methods, such as (CHARLS) data, provincial panel data, etc., which are carried out from the macro level, but there are few related studies focusing on the re-employment of the community elderly at and below the county level. Focusing on the re-employment of the elderly at the county and district level can depict the current situation and practical difficulties of the re-employment of the elderly in the community with a smaller “mouth” and a purer “texture”, and explore the deep mechanism of the factors affecting the re-employment of the elderly in the community. Therefore, this paper investigates the urban community elderly in Boai County, Jiaozuo City, Henan Province by means of questionnaire survey and semi-structured interview. More in-depth exploration of the mechanism behind the re- employment of the elderly in the community will help to better promote the re-employment development of the elderly in the community.",
    "Through questionnaires and semi-structured interviews, this paper investigates the community elderly in Boai County, Jiaozuo City, Henan Province, in order to understand the community elderly’s willingness to re-employment and its influencing factors. This survey adopts the random sampling method. A total of 230 questionnaires were distributed, of which 213 were effectively recovered, and the effective rate of the questionnaire was about 92.6%. The subjects were the community elderly, covering people aged 60-80. We will deal with the information collected and use Stata software to carry out descriptive statistical analysis and Logistic regression analysis to explore the factors affecting the re-employment of the community elderly. This section makes a descriptive statistical analysis on the distribution of re-employment characteristics and re-employment will of the community elderly. The research is mainly carried out from three aspects: individual level, family level and social level. As can be seen from Table 1, in terms of gender, both male and female community elderly show a strong willingness to re-employment, and there is little difference between different genders. In terms of age, the community elderly aged 60-69 have a strong willingness to re-employment, indicating that the community elderly will comprehensively consider their own conditions such as their health status when facing the problem of re-employment. The community elderly over 70 years old also show a certain willingness to re-employment, which is also consistent with the improvement of the health status of the elderly and the social development of our country, and is expected to play an active role in the development of “silver age dividend”. In terms of education level, although the community elderly junior high school degree shows the strongest willingness to re-employment, but on the whole, the re-employment desire of the community elderly decreases with the improvement of education level. From the perspective of health status, the healthy community elderly is more in line with the needs of re-employment and have the strongest willingness to re-employment. Based on the economic sources, the community elderly has a strong willingness to re-employment from all kinds of economic sources, and the community elderly with “farming” as the main economic source have the most significant willingness to re-employment. The area of agricultural land for the elderly in urban communities is relatively small, the economic sources obtained through “farming” are very limited, and there are idle seasons, so the income obtained through “farming” is not stable. Therefore, the willingness to re-employment of the community elderly with “farming” as the main source of income is significantly understandable. From Table 1, the willingness to re-employment of the community elderly with a family population of 5-8 is the most significant. The reason is that the community elderly with smaller families have less non-labor force and less pressure to provide for them, while the community elderly with more families have more children and the elderly can get more care. Therefore, the community elderly whose family size is between 5 and 8 people show a relatively strong willingness to re-employment. In terms of family economic situation, the community elderly with an annual family income of “1-50 000 yuan” have the strongest willingness to re-employment, and most of the community elderly whose family economic income is above “100000 yuan” have no willingness to re-employment. Economic factors are the main factors that affect the willingness of the community elderly to re- employment. The community elderly whose family income is less than 10,000 yuan may show a weak willingness to re-employment with the help of the government or relevant parties. In the situation of living with their children, the community elderly who do not live with their children are more willing to re-employment. Not living with children means that they have less tasks to take care of their grandchildren and share the pressure of their children, and they can spend their time and energy more freely, hoping to subsidize their families and realize their own value by choosing re-employment. From the point of view of their families’support, the community elderly whose families support their re-employment have a stronger willingness to re-employment. We use cumulative length of service and monthly income before retirement to measure the social adaptability of the community elderly. From the perspective of cumulative length of service, there are only 8 community elderly with cumulative seniority of 20-25 years, without discussion for the time being, there is a trend that the longer the cumulative seniority is, the stronger the willingness to re-employment is. The longer the cumulative length of service indicates that the longer the working time before retirement, the stronger the “inertia” of the pace of life brought by the working state, which affects the social adaptability of the elderly in the community. In terms of monthly income before retirement, we can see that the community elderly who have a monthly income of less than 3000 yuan before retirement have the strongest desire for re-employment, and the lower monthly income before retirement may enable them to have a lower pension or other sources of income after retirement. The economic factors have a more significant impact on the willingness to re-employment of the community elderly than that of social adaptability. From the re-employment difficulty score, the community elderly with higher re-employment difficulty score have more significant re- employment willingness. In terms of social insurance, the community elderly basically participated in social insurance, which is consistent with the coverage rate of urban social insurance in our country, and the community elderly who did not participate in social insurance showed a stronger willingness to re-employment. It can be seen that social insurance can reduce their willingness to re-employment by reducing the economic burden of the community elderly. In the case of knowing or enjoying policy support or training, the community elderly who know or enjoy policy support or training have a strong willingness to re-employment, it can be seen that the support, guidance and publicity of the government and relevant parties can promote the willingness of the elderly to re-employment.",
    "The explanatory variables of this paper are “gender”, “age”, “educational level”, “health status”, “pre-retirement occupation”, “economic source”, “family population”, “family economic status”, “living with children or not”, “family supports re-employment or not”, “participating in social insurance or not” and “understanding or enjoying re-employment policy or training or not”. The explained variable is “being willingness to re-employment or not”. This paper divides the explanatory variables into three aspects, namely, personal level, family level and social level, and analyzes the influencing factors of community elderly re-employment according to the actual situation. We set and assign each part of the explanatory variables before the data analysis. At the personal level, we divide gender variables into “male” and “female”, age variables into “60-69 years old” and “over 70 years old”, and educational level variables into “primary school and below”, “junior high school”, “senior high school” and “university and above”. The health status variables are divided into “healthy”, “average” and “poor”. The economic source variables are divided into “state, enterprise and institution leaders”, “technical, professional or R&D personnel”, “general administrators, teachers”, “enterprise workers”, “self-employed, freelancers”, “agriculture, forestry, animal husbandry, fishermen”, “unemployed” and “others”. The economic source variables are divided into “pension”, “children and family members”, “farming”, “doing business” and “no economic source”. At the family level, we divide the family population into three categories: “1-4”, “5-8” and “9-12”; the family economic status is divided into “less than 10,000 yuan”, “10,000-50,000 yuan”, “50,000- 100,000 yuan” and “more than 100, 000 yuan”; the variable of living with children is divided into “yes” and “no”; the variable of whether the family supports re-employment is divided into “yes” and “no”. At the social level, we divide the variables of whether or not to participate in social insurance into “yes” and “no”, and whether we understand or enjoy the re-employment policy and training into “yes” and “no”, as shown in Table 1. We analyze the influencing factors of community elderly re-employment from the aspects of individual, family and society, and carry out Logistic regression analysis. The results of regression analysis are shown in Table 2. As can be seen from Table 2, at the personal level, the relationship between gender variables and the re-employment of the community elderly is more significant, which is consistent with the conclusion of Lei et al. (2020) based on the case interview in Xi’an. The desire for re-employment of force of the family, the male community elderly has a higher desire for re-employment, which is related to the traditional social role of men in the family, and need to bear the main economic pressure of the family, while the female community elderly need to undertake more tasks to take care of their grandchildren, so it is difficult to get away from family affairs, thus affecting their willingness to re- employment. It is noted that the female community elderly also show a certain willingness to re- employment, we can see that women tend to gradually come out of the traditional family roles and begin to share the family economic burden with men; the age variable and the community elderly's willingness to re-employment are significant at the statistical level of 5%. Compared with the community elderly over 70 years old, the re-employment willingness of the young community elderly aged 60-69 is often more significant. The young people are better in physical and mental condition, and they are more favored by the labor market compared with the middle-aged (70 years old and above). There is no significant relationship between the educational level and the re-employment willingness of the community elderly, although it can be seen from the data that there is a negative correlation between the educational level and the re-employment willingness of the community elderly. However, the level of education is not a direct factor affecting the re-employment of the community elderly, the significant level of this variable is not high. The significant level between health status variables and willingness to re-employment is very high, both at the statistical level of 1%. It can be seen that the better the health of the community elderly, the stronger their willingness to re-employment, and their physical condition is the key factor affecting the willingness to re- employment in the community. This is consistent with the investigation and study of Gong and Wang (2014). In the pre-retirement occupation, \"farmers, forestry, animal husbandry, fishermen\" and \"self- employed, freelancers\" have a significant willingness to re-employment. The community elderly in these two types often lack a stable and reliable source of livelihood and want to ensure their livelihood through re-employment. The relationship between the economic source variable and the re- employment willingness of the elderly in the community is not significant, and the economic source of the community elderly may only have an indirect impact on their willingness to re-employment, and the impact of income on the re-employment will of the community elderly may be more direct and significant. At the family level, the relationship between the family population and the willingness to re-employment of the community elderly is not significant, and the number of families cannot infer the number of non-working population, which should be one of the main reasons for the insignificance of this. In terms of family economic situation, the willingness to re-employment of the community elderly with an annual household income of more than 100000 yuan is significant at the statistical level of 10%. The higher the family income, the more secure their livelihood is, and the weaker their willingness to re-employment is. There is a significant relationship between the living with children and the willingness to re-employment of the community elderly. The community elderly who do not live with their children have a higher willingness to re-employment, and their burden of taking care of their grandchildren and helping their children is lighter. They have more time and energy to spend on affairs outside the family, and have a higher willingness to re-employment. Lei et al. (2020) also reached the same conclusion. The family support and the willingness to re-employment of the community elderly are significant at the statistical level of 5%. As the individuals closest to and most closely related to the community elderly, their opinions have an important impact on the Data source: a survey of the community elderly in Boai County, Jiaozuo City, Henan Province from August to September 2022. Note: *, ** and *** are significant at the statistical level of 10%, 5% and 1%, respectively.",
    "Today, with the increasing trend of social aging, the re-employment of the community elderly can take on the task of \"breaking the situation\". Based on the sample survey of urban areas in Boai County, Jiaozuo City, Henan Province from August to September in 2022, through descriptive analysis and Logistics regression analysis, this paper makes a comprehensive analysis of the re-employment will of the community elderly from the individual level, family level and social level, and draws the following conclusions: at the personal level, the desire for re-employment of the community elderly is more significant among the elderly who are in good health, the source of livelihood is unstable, the young age is young, and the male community elderly are more willing to re-employment. At the family level, the community elderly who do not live with their children and whose families support their re-employment have a more significant willingness to re-employment. At the social level, social adaptability, social insurance, policy support and training have no significant impact on the re- employment of the community elderly. However, it can be seen that most of the community elderly do not understand or enjoy the re-employment policy or training. Based on the conclusions, we put forward the following policy recommendations. First, the government and other relevant departments should establish a positive concept of old age, encourage the elderly to realize their value through re-employment, and explore a flexible delayed retirement policy. Second, the government and other relevant departments should do a good job in publicizing gender equality, promoting the concept of gender equality in society and the labor market, and promoting women to be liberated from family affairs and be treated more fairly in the labor market. Third, build a more perfect medical security system, weave urban medical and health and social security networks, and improve the health level of the elderly in the community. Fourth, the government and relevant departments actively introduce policies to promote re-employment, improve supporting facilities for re-employment, carry out re-employment training activities, and county and district governments actively implement superior instructions and arrangements, and do a good job in publicity, training and support. Fifth, give full play to the positive role of the community in the re- employment of the elderly, introduce social work services, hold re-employment publicity activities, link relevant resources, raise the re-employment awareness of the community elderly, and increase the re-employment opportunities of the community elderly. Sixth, make effective use of Internet information technology to establish a public platform for re-employment information, collect information on the supply and demand of re-employment for the elderly in the region, and use the network platform to open up re-employment channels for the community elderly."
]