[
    "Against the backdrop of the digital economy and the strategic importance of strengthening China's cultural power, cultural and tourism IP has become a crucial engine driving economic transformation and upgrading in regions rich in cultural resources. This paper integrates value chain theory with survival field theory. Based on panel data from 17 prefecture-level cities in Henan Province and 10 prefecture-level cities in Anhui Province from 2018 to 2023, it constructs a three-dimensional mechanistic model encompassing the \"digital empowerment IP value chain, IP field value transformation, and high-quality development.\" This empirical research utilizes mediation effect testing, heterogeneity analysis, and fuzzy set qualitative comparative analysis ( fsQCA ). reconstructs the cultural and tourism IP value chain through the five core links of value mining, creation, dissemination, operation and monetization , and the contribution of data elements to IP value creation reaches 37.2%; cultural and tourism IP mainly empowers regional high-quality development through four paths of \"innovation ecosystem cultivation, cross-industry integration, consumption scenario activation, and brand capital aggregation\". Among them, the mediating effect values of industrial integration and consumption scenario activation are 0.213 and 0.187 respectively, indicating that the two are key mechanisms for value transmission; the interaction term between digital infrastructure and cultural resource endowment produces a significant positive regulatory effect (coefficient 0.089), which is particularly prominent in intangible cultural heritage activation IP and county-level IP. A comparative study of Henan and Anhui provinces shows that Henan excels in the explosive creative power of IP, while Anhui excels in sustainable IP operations and long- term value creation. Based on these findings, this article proposes a differentiated development strategy centered on \"value chain collaboration, co-development of venues, and regional complementarity.\" This strategy provides a theoretical basis and practical paradigm for achieving high-quality IP-led development in regions with similar cultural The global digital economy has surpassed $30 trillion , with China's digital economy accounting for 41.5% of GDP. Digital technology is reshaping the development of the cultural tourism industry . Henan Province, the core cradle of Chinese civilization, boasts five World Heritage sites and 13 national historical and cultural cities. In recent years, it has seen the emergence of iconic IPs such as \"Tang Palace Night Banquet\" and \"Song Dynasty City That Never Sleeps .\" Total cultural tourism revenue is expected to reach 1.2 trillion yuan in 2023 , accounting for 12% of GDP[1]. However, significant challenges remain in practice. On the one hand, digital technology has provided new tools for the development of cultural tourism IP, such as AI restoration and metaverse scenarios. On the other hand, regions like Shangqiu in eastern Henan and Zhumadian in southern Henan have insufficient levels of IP digitization. Traditional IPs like the Longmen Grottoes remain trapped in the \"ticket economy,\" with a derivative value conversion rate of only 60% of the national average. Anhui, leveraging IPs such as \"Bozhou Intangible Cultural Heritage\" and \"Ancient City of Huizhou,\" has generated over 800 billion yuan in comprehensive cultural tourism revenue[2]. However, both regions face common bottlenecks. Henan's IP is easy to become popular but difficult to maintain long-term popularity. For example, the half-life of the popularity of \"Laojun Mountain Snow Scene \" is only 3 months. Anhui's intangible cultural heritage IP is not yet digitalized, with derivative income accounting for only 12%, lower than the national average of 25%.[3] In the digital economy era, the development of cultural and tourism IP has become a crucial engine driving regional economic growth and cultural heritage. China's digital economy now accounts for 41.5% of GDP, and its deep integration with the cultural and tourism industry is continuously reshaping the industry ecosystem. Henan Province, a province rich in cultural resources and boasting success stories such as \"Tang Palace Night Banquet,\" faces challenges such as insufficient long-term IP operations, unbalanced regional development, and low conversion rates of derivative value. Breaking through these value bottlenecks and facilitating the transmission of cultural and tourism IP to high-quality urban development are core issues that urgently need to be addressed. Addressing these core issues will not only fill the research gap in the intersection of high-quality development combining the digital economy and cultural and tourism IP, but will also provide theoretical support for Henan Province's transition from a \"culturally rich province\" to a \"culturally strong province,\" thus possessing significant academic and practical value.",
    "Existing research focuses on two main areas: first, technological empowerment, such as the immersive transformation of IP scenarios through VR/AR technology (Yan Luyao, 2024) and the precision empowerment of IP dissemination through big data (Duan Zaoer , 2023); and second, value transformation. Shen Xiyan (2023) proposed a transmission chain of digital elements, IP innovation, and industrial upgrading, but did not analyze the entire value chain[4]. Its shortcomings lie in ignoring the impact of IP type heterogeneity on empowerment effects and lacking a cross-regional comparative perspective. Duan Zao'er (2023) breaks down the cultural IP value chain into five stages: content creation, derivative development, marketing, consumer interaction, and revenue distribution. He notes that digitalization has blurred the boundaries between these stages. However, this study focuses on the cultural and creative industries, paying insufficient attention to the experiential nature and regional dependence of cultural tourism IP. Using Anhui as an example, Ding Shichao (2024) finds that the extension of the cultural tourism IP value chain is limited by the compatibility between digital infrastructure and cultural resources, but does not quantify this impact coefficient[5]. A three-dimensional survival model of physical, digital , and social fields, emphasizing the role of digital technology in activating the field of traditional IP . However, this study mainly focuses on case descriptions, lacks large-sample empirical testing, and does not explore the transmission mechanism of field integration on economic development[6]. Existing research suffers from theoretical fragmentation, empirical simplification, and overly generalized strategies. This paper's innovations lie in: (1) theoretically integrating value chain theory and survival field theory to construct a multidimensional mechanism model; (2) methodologically employing panel data from Henan and Anhui provinces to analyze IP types and regional heterogeneity; and (3) strategically combining the comparative advantages of the two regions to propose differentiated development paths. This article follows the four-dimensional logical chain of theoretical construction, mechanism analysis, empirical testing, and countermeasures proposal[7]. First, it defines the core concepts and theoretical basis; secondly, it constructs a two-link mechanism model in which the digital economy empowers cultural and tourism IP and cultural and tourism IP drives high-quality development; thirdly, based on the panel data of 17 cities in Henan Province, it tests the theoretical hypotheses through econometric models; finally, it proposes targeted countermeasures based on typical cases. (Literature research method: systematically sort out the core literature in the fields of digital economy, cultural tourism IP, and high-quality development, and build a theoretical framework. @)Econometric analysis: Stata 17.0 software was used to verify the hypotheses through benchmark regression, mediation effect, and moderation effect tests, and fsQCA was used to identify configuration effects. â‘¢Case comparison method: Four typical IPs, including Kaifeng's \"Song Dynasty City That Never Sleeps\" and Anyang's Yin Ruins, were selected to analyze the differential effects of digital The research data covers 17 cities in Henan Province from 2018 to 2023, primarily sourced from the Henan Statistical Yearbook, the Digital China Development Report, the Henan Provincial Department of Culture and Tourism's annual report, the Wind database, and the Baidu Index[8]. Limited data, such as IP operating costs, was supplemented through in-depth interviews with 20 cultural and tourism enterprises . Missing values were addressed using linear interpolation. Based on the \"Statistical Classification of the Digital Economy and Its Core Industries (2021),\" the digital economy is defined as an economic model that utilizes data resources as a key factor, digital technology as a core driver, and encompasses both digital industrialization and industrial digitization[9]. This is operationalized into three secondary indicators: the proportion of digital industrialization output value to GDP, 5G base station density ( units per 10,000 people), and internet penetration rate (%). Integrating the views of Yan Luyao (2024), it refers to the multiple spaces for the existence and development of cultural and tourism IP, including: () physical fields (scenic spots/ intangible cultural heritage workshops ); (2) digital fields (VR exhibition halls/metaverse scenes); (3) social fields (short video topics/fan communities), and the three are integrated and symbiotic through digital technology. With reference to the indicator system of Shen Xiyan (2023) and Ding Shichao (2024), 18 secondary indicators were constructed from the five dimensions of \"innovation, coordination, green, openness, and sharing\" (Table 1), and the entropy method was used to calculate the comprehensive index[10].",
    "Based on Porter's value chain theory , Duan Zao'er (2023) argues that digitalization has shifted the cultural tourism IP value chain from a linear series to a networked collaborative model, with the core being the value penetration of data elements across all links. This article analyzes how digital technology restructures each link in IP value generation. Bourdieu's field theory , Yan Luyao (2024) proposed that digital technology breaks the boundaries of traditional IP fields , achieving field integration through \"digitalization of physical fields, scenario-based digital fields, and value-based social fields .\" This article analyzes the transmission path of IP value to economic development[11]. Cai Fang (2022) pointed out that digital technology enables industrial upgrading by \"reducing transaction costs, optimizing resource allocation, and giving birth to new business models\", Lu Dadao (2023) emphasizes the importance of regional comparative advantages and complementarity. This article is used to interpret the differences and complementarities of the IP development models of Henan and Anhui[12]. The digital economy is systematically reshaping the value creation path of the cultural and tourism industry , running through the five core links of value mining, content creation, dissemination and diffusion, operation management and derivative monetization, forming a complete closed loop from cultural resource identification to the full release of IP value. Digital technology enables in-depth identification and structured extraction of traditional cultural resources. Bozhou, using high-precision 3D scanning technology, systematically established a digital resource library for paper-cutting, accurately identifying 32 core cultural genes, such as \"auspicious patterns\" and \"folk symbols,\" providing strong underlying material support for subsequent IP creation. The Henan Museum, leveraging AI semantic recognition and image analysis, systematically analyzed oracle bone inscriptions, extracting the core visual and narrative elements of the \"Oracle Bone Code\" IP, quadrupling the efficiency of cultural exploration[13]. This session focused on transforming traditional elements into new, experiential IPs through digital media. In Taishun, Zhejiang, the mortise and tenon joint structure of a traditional covered bridge was transformed into a virtual IP character called \"Shun Shun.\" Leveraging CG animation, the film produced a series of short films, which have been viewed over 450 million times online, achieving a modern interpretation of traditional architectural culture. Meanwhile, the Qingming Riverside Park in Kaifeng constructed a metaverse of the \"Northern Song Dynasty Tokyo City,\" transcending physical limitations and achieving an IP upgrade from static cultural relic display to dynamic, contextual experiences. New media platforms are reshaping IP dissemination mechanisms, establishing a communication paradigm characterized by targeted delivery, user engagement, and multi-level diffusion. The ancient city of Huizhou in Anhui Province launched an intangible cultural heritage skills challenge on Douyin (TikTok), with related topics accumulating over 2 billion views and driving a 120% year-on-year increase in local visitor traffic. Henan's \"Tang Palace Night Banquet\" built a communication matrix across multiple platforms, including Bilibili and Xiaohongshu, successfully achieving cross-platform dissemination , moving from within a specific niche to breaking through barriers within other niches , and creating a chain-like communication effect of \"content-user-recreation.\" Relying on big data to improve the accuracy and responsiveness of IP operations. Henan Province's Smart Cultural Tourism Platform integrates 27 types of data, including transportation, weather, and consumption, to achieve real-time forecasting and scheduling of visitor flows for projects like the \"Song Dynasty City That Never Sleeps,\" boosting visitor satisfaction from 82% to 95%. Bozhou Intangible Cultural Heritage Workshop, through analyzing user behavior profiles, developed targeted parent-child paper-cutting experience courses, increasing course repurchase rates by 35% and significantly optimizing service matching efficiency. Digital technology has greatly expanded the boundaries and forms of IP monetization. The Yin Ruins in Anyang issued oracle bone inscription digital collectibles (NFTs), with 50,000 sold out in three minutes, opening up a new path for non-physical derivatives. Huangshan Scenic Area partnered with the popular game \"Genshin Impact\" to launch a virtual scene collaboration, offering customized scenic exploration quests, which drove a 200% increase in merchandise sales. These practices confirm that \"IPs with derivative product revenue accounting for more than 60% tend to have stronger growth and sustainable profitability.\" IP fields has given birth to a digital cultural and creative ecosystem. Zhengzhou relies on the \"Only Henan\" IP to build a digital cultural and creative industry park, attracting 156 companies and investing over 1.2 billion yuan in R&D; Hefei takes \"Bao Gong IP\" as the core and builds an innovation chain of \"content creation-technology development-authorized operation\". The output value of digital cultural and creative industries will increase by 45% in 2023.",
    "IP serves as a link to connect multiple industries. Kaifeng's \"Song Dynasty City That Never Sleeps\" has driven a 230% increase in revenue for related industries such as catering, homestays, and performing arts, and the proportion of the tertiary industry has increased by 4.2 percentage points; Bozhou's \"Medicine Capital IP\" integrates the traditional Chinese medicine industry with health and wellness tourism, forming an integrated business model of intangible cultural heritage experience and healthy consumption. The integration of different areas has created new consumer demands. Taishun has created a \"bridge blessing\" scene through AR technology, extending the tourists' stay time from 2 hours to 5 hours; Luoyang's \"Longmen Grottoes\" launched a VR restoration experience project, and the proportion of young tourists increased from 35% to 62%, and per capita expenditure on cultural and tourism consumption increased by 89%. Cultural tourism investment exceeded 30 billion yuan in 2023 ; \"Huangshan IP\" drove 18 cross- border cultural and tourism cooperation projects, and foreign exchange earnings increased by 38%. The digital economy is systematically reconstructing the value generation logic of cultural and tourism IP from the four core links of creation, dissemination, operation and derivation, forming a complete empowerment closed loop from technology input to continuous value- added. Digital tools such as AI and VR have effectively broken through the time, space, and cost constraints of traditional cultural IP creation. For example, the Longmen Grottoes in Luoyang used AI intelligent restoration technology to efficiently repair incomplete statues, shortening the original three-year IP development cycle to six months and reducing development costs by 40%. The Qingming Riverside Park in Kaifeng relied on VR virtual scene reconstruction technology to vividly reproduce the historical features of the \"Northern Song Dynasty Tokyo City,\" achieving a visual and experiential expression of cultural connotations. Based on this, it is proposed that: Proposition 1: The depth of digital technology application is significantly positively correlated with the efficiency of cultural tourism IP creation. The higher the level of technological investment, the shorter the IP development cycle and the stronger the cultural expression. New media platforms such as Douyin and Xiaohongshu have built an efficient communication mechanism from content production, social fission to emotional resonance. In 2021, \"Tang Palace Night Banquet\" fermented through Douyin's topic , with over 5 billion views in 72 hours, achieving a leap from a single performance to a national cultural and tourism IP; \"Only Henan Drama Fantasy City\" attracted over 20 million viewers through online cloud theater live broadcast, significantly improving offline conversion rate. Based on this, it is proposed: Proposition 2: There is a significant positive correlation between digital communication intensity and the influence of cultural tourism IP. The greater the platform traffic, the stronger the IP's cross-regional influence and audience reach. Relying on the cultural tourism big data platform, IP operations are transforming from experience-driven to data-driven. Henan Province's smart cultural tourism platform integrates multi- source data to achieve real-time monitoring and scheduling of passenger flow. In 2023, the \"Song Dynasty City That Never Sleeps\" optimized performance schedules based on data analysis, and visitor satisfaction increased from 82% to 95%. Luoyang Laojun Mountain optimized its cultural and creative product structure based on visitor consumption behavior data, and the repurchase rate increased by 30%. Based on this, it is proposed: Proposition 3: The level of data utilization is significantly positively correlated with the operational benefits of cultural tourism IP. The stronger the data integration and analysis capabilities, the higher the user satisfaction and overall benefits of the IP. Digital technology is driving the expansion of IP derivatives from traditional physical forms to virtual formats . The Anyang Yinxu digital collection featuring oracle bone inscriptions sold out 50,000 copies in three minutes, generating over 10 million yuan in derivative revenue . The Henan Museum launched AR archaeological blind boxes, which digitally simulated the archaeological process, driving a 300% increase in cultural and creative revenue . Based on this, we propose: Proposition 4: The degree of digital industry integration is significantly positively correlated with the derivative value of cultural tourism IP. The deeper the industry integration, the broader the channels for IP value realization and the more diversified the revenue structure. Cultural and tourism IP has gradually built four clear value transmission paths, systematically promoted the high-quality development of the city, and formed a complete closed loop from value creation to the manifestation of external effects.",
    "Cultural and tourism IP has significantly promoted innovation in the \"culture + technology\" industry. For example, the Henan Museum collaborated with ByteDance to develop a \"Digital Cultural Relics Library,\" integrating traditional cultural relic restoration techniques with modern AI algorithms. This not only enhances the digital preservation of cultural relics but also incubates 15 digital cultural and creative enterprises. Meanwhile, Zhengzhou is developing a digital cultural and creative industrial park centered around the \"February 7th Memorial Tower\" IP, attracting over 500 million yuan in R&D investment and projecting a 45% increase in digital cultural and creative output value by 2023 , effectively stimulating the city's innovative vitality. Cultural tourism IP effectively connects the primary, secondary, and tertiary industries, achieving cross-sectoral coordinated development. Kaifeng's \"Song Dynasty City That Never Sleeps\" IP has driven a 200% increase in the number of nearby restaurants and restaurants, boosted the average occupancy rate of regional homestays to 92%, and driven an 8.2% increase in Kaifeng's tertiary industry by 2023. Xuchang, leveraging its \"Jun Porcelain\" IP, has introduced digital firing technology to develop high-end industrial ceramics, pushing the ceramics industry's annual output value to over 3 billion yuan, achieving a deep integration of traditional cultural tourism and modern industry. Digitally empowered cultural and tourism IPs have significantly enhanced their consumer appeal and market reach. \"Only Henan Drama Fantasy City,\" leveraging immersive digital environments, has attracted over 2 million visitors annually, 65% of whom are from outside the province, driving a 38% year-on-year increase in cultural and tourism consumption in Zhengzhou . The Luoyang Peony Culture Festival, through digital livestreaming, successfully attracted 18 million offline visitors, generating over 20 billion yuan in overall spending and significantly boosting domestic demand. International IPs have significantly enhanced a city's cultural image and its ability to attract key cultural elements. The \"Tang Palace Night Banquet\" IP increased Henan culture's nationwide recognition by 70%, attracting leading companies such as Tencent and Alibaba to launch 12 digital cultural and creative projects by 2023 , with investments exceeding 10 billion yuan. Leveraging the brand power of its \"Commercial Capital\" IP, Zhengzhou has successfully recruited over 300 high-end cultural and tourism management and operations professionals, continuously optimizing the city's innovative development ecosystem. Explained variable: Urban economic high-quality development index (HQD), synthesized based on the indicators in Table 1 using the entropy method. Core explanatory variable: Cultural and tourism IP influence index (IP), which uses the entropy method to weightedly synthesize \"dissemination popularity, passenger flow, and cultural and creative income.\" Key independent variables: Digital Economy Development Index (DE), which uses the entropy method to weightedly synthesize \"the proportion of digital industrialization, 5G base station density, and Internet penetration rate.\" Mediating variables: industrial integration degree (IND) ( measured by the integration coefficient of the cultural tourism industry with the primary, secondary and tertiary industries), and consumer demand intensity (CON) ( measured by the proportion of cultural tourism consumption expenditure). Control variables: Referring to existing studies, urban GDP ( GDP ), population size (POP), fiscal expenditure (FIS), and urbanization rate (URB) are selected as control variables. Among them, ð‘–is the city, ð‘¡is the year, ðœ‡áµ¢is the individual fixed effect, ðœ†â‚œis the time fixed effect, and ðœ€áµ¢â‚œis the random error term. Table 2 shows that the coefficient of the cultural and tourism IP influence index (IP) is 0.238, significantly positive at the 1% level, indicating that cultural and tourism IP has a significant positive driving effect on the high-quality development of the urban economy. The coefficient of the digital economy development index (DE) is 0.312, significantly positive at the 1% level, indicating that the digital economy can independently empower high-quality development. Among the control variables, the coefficients of GDP and URB are both significantly positive, consistent with the laws of economic development. Table 3 shows that the mediating effect value of industrial integration (IND) is 0.213 (accounting for 74.2% of the total effect), and the mediating effect value of consumption scenario vitality (CON) is 0.187 (accounting for 65.2% of the total effect). Both passed the Bootstrap test (95% confidence interval does not include 0), verifying the two core transmission paths. The coefficient of the interaction term (IPVÃ—INFÃ—CR) was 0.089 (significant at 1%), indicating that the higher the degree of match between digital infrastructure and cultural resources, the stronger the IP empowerment effect. Group tests showed that the high-infrastructure group (coefficient 0.356) was significantly higher than the low-infrastructure group (coefficient 0.192); the high-resource group (coefficient 0.312) was significantly higher than the low- resource group (coefficient 0.205).",
    "(1) IP type heterogeneity: The empowerment coefficient of intangible cultural heritage activation IP is the highest (0.328), followed by creative derivative IP (0.291), and the lowest is historical heritage IP (0.245), which confirms the conclusion of Yan Luyao (2024) that \"intangible cultural heritage IP has greater potential for digital activation.\" (2) Regional heterogeneity: Henan's creative derivative IP coefficient (0.302) is higher than Anhui's (0.256), while Anhui's intangible cultural heritage activation IP coefficient (0.341) is higher than Henan's (0.298), reflecting the differences in comparative advantages between the two regions. Three highly enabling configuration paths were identified (consistency > 0.85, coverage > 0.3): â‘  High digital economy + strong IP creation + high infrastructure (coverage rate 0.42): such as Zhengzhou's \"only Henan\" IP; â‘¡ High cultural resources + strong IP operation + consumption scenario activation (coverage rate 0.38): such as Bozhou intangible cultural heritage IP; â‘¢Digital economy Ã— IP monetization Ã— open development (coverage rate 0.35): such as Huangshanâ€™s â€œcultural tourism + digital collectionâ€ IP. The Henan cultural tourism IP model, exemplified by \"Tang Palace Night Banquet\" and \"Song Dynasty City That Never Sleeps,\" is characterized by \"content innovation and rapid monetization.\" Its core strength lies in fully tapping into its rich historical and cultural heritage, achieving explosive growth through creative content design and strong visual impact. In 2023, topics related to Henan's cultural tourism industry exceeded 50 billion views on Douyin, demonstrating its robust ability to generate buzz and reach audiences. However, this model also has significant shortcomings, primarily in the relatively weak back- end development of the IP value chain. Compared to Anhui's 24% share of derivative revenue, Henan's IP derivative business revenue accounts for only 18% of total revenue, indicating that a comprehensive ecosystem for long-term monetization, such as physical goods, digital collectibles, and copyright licensing, has yet to be established. A prime example is the Kaifeng \"Song Dynasty City That Never Sleeps\" project. By meticulously recreating Song Dynasty architecture and featuring immersive performances, the project has successfully achieved explosive growth in annual visitor numbers exceeding 18 million, demonstrating its exceptional front-end traffic generation capabilities. However, its derivative businesses, such as digital collection development and cross-border IP licensing, are still in their infancy, lacking a fully formed closed-loop operational system for \"traffic, retention, and conversion,\" hindering the deep unlocking and sustained monetization of IP value. The Anhui cultural tourism IP development model, exemplified by Bozhou's intangible cultural heritage and Huangshan Scenic Area , is distinguished by its deep integration of venues and long-term value chain operations. This model's strengths lie in the systematic digital preservation of intangible cultural heritage resources and their cross-industry integration capabilities. For example, Bozhou has established 12 intangible cultural heritage digital workshops to collect, restore, and visualize traditional skills. Huangshan has successfully partnered with renowned gaming IPs to develop virtual attractions and themed props, achieving cross-industry IP value-added. Currently, revenue derived from this type of IP accounts for 24% of total revenue, demonstrating strong monetization capabilities. However, this model still has certain limitations, primarily in its relatively lacking creative power. Compared to similar IPs in Henan, Anhui's top IPs only receive 60% of the play volume on social media platforms, indicating that there is still room for improvement in terms of content penetration and reach. A typical example is the Bozhou paper-cutting IP. Through the three-in-one operation strategy of \"digital resource library construction - intangible cultural heritage course development - digital collection authorization\", it not only achieved an average annual income of over 30 million yuan, but also extended its IP survival cycle to 8 years, which is significantly higher than the average 3-year survival level of similar IPs in Henan, reflecting Anhui's significant advantages in long-term IP operation. Henan demonstrates significant advantages at the front end of the IP industry chain, including creative incubation, content production, and dissemination and promotion. Its mature digital content creation capabilities and extensive media resources provided a powerful impetus for the initial explosion of IP. Anhui, on the other hand, excels in the long-term operation, commercial development, and value preservation of IP, accumulating extensive experience in the development of physical derivatives, offline scene operations, and sustained monetization. The two regions' complementary strengths can jointly build a complete collaborative chain spanning \"creative incubation - operational implementation - value sharing.\" For example, Henan's \"Oracle Bone Code\" IP has garnered widespread attention for its profound cultural symbolism and innovative narrative. Collaboration with the Anhui Intangible Cultural Heritage Digital Workshop has further transformed the IP into diverse physical derivatives, including ceramics, wood carvings, and embroidery. These products are then marketed through Anhui's mature e-commerce operations and offline channels. This type of collaboration not only extends the lifecycle of the IP but also opens the path from cultural value to commercial value, truly achieving a \"1+1>2\" synergistic effect.",
    "To explore value, Henan and Anhui provinces will collaborate with key universities and research institutions to build a \"Digital Library of Henan and Anhui Cultural Genes,\" systematically integrating core cultural elements such as oracle bone inscriptions, opera, intangible cultural heritage patterns, and traditional architecture. By incorporating artificial intelligence technology for intelligent analysis and labeling, and drawing on Bozhou's proven experience in 3D scanning and digital archiving, this will enable high-precision collection and structured development of cultural resources. The project aims to digitize over 80% of the key cultural resources in the two provinces by 2025, laying a solid data foundation for subsequent IP creative development. In the creation and dissemination phase, leveraging a cross-regional IP creative platform, Henan's creative capabilities in \"content breakthroughs\" and Anhui's practical experience in \"precision dissemination\" are deeply integrated to establish a systematic, integrated mechanism of \"short video content production - big data user matching - multi-platform distribution.\" This mechanism aims to improve content creation efficiency, achieve precise engagement between IP content and target audiences, and expand social influence through a three-dimensional dissemination matrix, forming a new paradigm for cross-provincial IP dissemination. Regarding derivative monetization, the two provinces will jointly establish a \"Digital Cultural and Creative Industry Park\" to promote a three-in-one monetization model combining \"NFT digital collections + physical derivatives + cross-border licensing.\" By combining policy guidance with market operations, they will promote the transformation of IP resources into diversified consumer products. The goal is to achieve a 30% share of cultural and tourism IP derivative revenue in both provinces by 2026, significantly enhancing the economic benefits and market competitiveness of the IP industry. Regarding the digitization of physical spaces , VR immersive renovations will be implemented at iconic scenic spots such as the Longmen Grottoes and Huizhou Ancient City. High-precision 3D modeling and virtual reality technology will be used to recreate historical scenes and enhance visitors' immersive experiences. The plan is to achieve full coverage of digital guide systems at all 4A-rated and above tourist attractions by 2025. Drawing on the successful AR interactive scene in Taishun, Zhejiang, the project will actively deploy augmented reality interaction nodes, promote a new \"virtual and real\" touring model, and systematically enhance the digital level of scenic area services and the visitor experience. In terms of digital venues , Henan and Anhui provinces will jointly develop the \"Yu-An Cultural Tourism Metaverse\" platform, organically integrating high-quality resources such as the Kaifeng Metaverse Song Dynasty scene and the Huangshan virtual scenic area, creating a comprehensive closed-loop process encompassing \"online travel, offline experience, and social sharing.\" This platform not only provides a highly realistic virtual tour experience but also supports online reservations, digital collection redemption, and offline consumption, achieving two-way traffic guidance and deepening value from digital scenes to physical scenic areas. In terms of maximizing value in social media , we strive to cultivate highly engaged IP fan communities. By regularly hosting user-generated activities such as the \"Intangible Cultural Heritage Challenge\" and the \"Historical Scene Re-enactment Competition,\" we encourage public participation in content production and dissemination. We leverage social media and short video platforms to expand dissemination effectiveness, driving the effective conversion of user- generated content into consumer behavior, ultimately transforming social traffic into sustainable consumer traffic and brand loyalty. Henan Province will prioritize strengthening IP creative incubation capabilities and digital infrastructure, striving to create a development model centered around a \"creative derivative IP cluster.\" To further this goal, plans are underway to establish IP innovation labs in key cities such as Zhengzhou and Luoyang. These labs will focus on addressing key bottlenecks in the continuous innovation and operational mechanisms of IP content, addressing the current \"lack of long-term operational capabilities,\" and systematically elevating the level of IP industrialization and commercialization. Anhui Province will focus on enhancing the creative power and brand influence of IP content. By actively attracting established content creation and operations teams from Henan and other regions, the province will focus on cultivating emerging formats featuring \"intangible cultural heritage IP + digital collections.\" Furthermore, pilot projects for cross-border IP integration will be launched in culturally rich regions such as Bozhou and Huangshan, promoting the deep integration of traditional cultural elements with modern consumer scenarios and building an IP ecosystem with Anhui characteristics.",
    "At the cross-regional collaboration level, the two provinces will jointly establish the \"Henan- Anhui Cultural Tourism IP Alliance\" to actively explore a collaborative mechanism characterized by \"creativity in Henan, operations in Anhui, and shared market share.\" This mechanism aims to leverage Henan's strengths in content creation and incubation, and Anhui's expertise in operational implementation and market transformation, achieving resource complementarity and maximizing efficiency. Furthermore, the two provinces will jointly apply for national-level digital cultural tourism pilot zones , securing policy and resource support to jointly promote the high-quality development and comprehensive operation of regional cultural tourism IP. In terms of policy support, Henan and Anhui provinces jointly issued the \"Henan-Anhui Cultural Tourism IP Digital Development Action Plan (2024-2026),\" which defines key tasks and support measures for the digitalization of cultural tourism IP over the next three years. A special development fund with a total scale of 1 billion yuan is planned to provide subsidies of up to 30% for innovative projects such as digital collection development and metaverse scene construction, effectively reducing companies' initial investment costs and stimulating market innovation. At the technical support level, the two places actively promote the in-depth integration of industry, academia and research, and jointly establish the \"Digital Cultural Tourism Technology Research Institute\" with technology companies such as Huawei and ByteDance, focusing on the research and development and application of key technologies such as IP value assessment models, copyright traceability and risk warning systems, providing reliable technical guarantees and decision-making support for IP digital operations. In terms of talent development, we will support local universities in adding majors related to \"Digital Cultural Tourism IP\" to promote the alignment of curriculum systems with industry needs. At the same time, we will implement a dual-track training program for \"Intangible Cultural Heritage Inheritors + Digital Technology\" to strengthen the two-way empowerment of traditional inheritors and digital skills. We will strive to cultivate more than 2,000 professionals with comprehensive skills each year, reserving core human capital for the long-term development of the industry. Reshaping the value chain of cultural and tourism IP through five key links: value discovery, creation, dissemination, operation, and monetization . Research shows that data plays a core role in the entire value chain, contributing up to 37.2% to IP value creation and exhibiting a significant positive interaction with cultural resources. This suggests that the combination of cultural heritage and digital capabilities can significantly enhance the value output of IP. In promoting high-quality development, cultural and tourism IP primarily relies on two core pathways for empowerment: first, expanding value through industrial integration, with a mediating effect value of 0.213; and second, enhancing experience and economic conversion efficiency through the activation of consumer scenarios, with a mediating effect value of 0.187. This transmission mechanism is also significantly regulated by the level of digital infrastructure, indicating that the level of infrastructure development directly affects the effectiveness of IP empowerment. Among different types of cultural tourism IP, those focused on the revitalization of intangible cultural heritage exhibited the strongest empowerment effect (coefficient 0.328), highlighting its profound cultural connotations and contemporary value. Furthermore, Henan and Anhui demonstrate complementary IP development paths: Henan possesses strong creative potential, while Anhui excels at sustainable operations. Both regions possess broad potential for resource integration and collaborative development . This study still has certain limitations. First, the data used spans from 2018 to 2023, which fails to capture the latest impacts of the rapid development of AI big-model technology on the IP creation ecosystem after 2023. In particular, the innovative changes enabled by generative AI in storytelling, character design, and content production have not yet been fully reflected. Second, in terms of case selection, current research focuses more on leading IPs with significant influence, with insufficient coverage of small and medium-sized IPs, and their survival status, monetization paths, and digital transformation challenges have not been thoroughly analyzed. In response to the above-mentioned shortcomings, future research can be further expanded in the following aspects: First, extend data collection to 2025, continue to track the latest developments in the deep integration of AI technology and the IP value chain, and especially strengthen the empirical and mechanism analysis of the empowerment mechanism of AIGC (AI generated content) in the IP creation link; second, lower the research object, actively pay attention to the transformation path, innovation strategy and survival model of small and medium-sized IP in the digital context, and gradually build an IP ecological research map including multiple subjects, so as to enhance the universality and practical reference value of the conclusions.",
    "This work is supported by Innovation and Entrepreneurship Training Project for College Students of Anhui University of Finance and Economics in 2024, Project number: 202410378245."
]