[
    "University of Technology Sarawak, School of Business and Management, Centre on Technological Readiness and Innovation in Business Technopreneurship, Sibu, Sarawak, Malaysia, e-mail: chincheehua@uts.edu.my Citation: Chin, C.H., Chan, W.C., Ming, L., & Chin, C.L. (2025). Revealing the Competitiveness of Rural Tourism: Exploring Tangible and Intangible Resources in Sarawak (Malaysia) and Henan Province (China). Geojournal of Tourism and Geosites, 58(1), 18–31. https://doi.org/10.30892/gtg.58102-1387 Abstract: Tourism activities significantly impact a country’s economy, environment, community, and visitors. In the Malaysian context, rural communities have adopted rural tourism as an alternative source of income. The competitiveness of a tourism destination is crucial for the long-term profitability of rural tourism destinations. The tourism experience is a critical factor for tourists when choosing a destination. Therefore, it is essential to focus not only on attractions but also on a destination’s infrastructure, image, and hospitality. However, current literature lacks a single study that examines the impact of both tangible and intangible resources on the competitiveness of rural tourism destinations, using mobile technology as a moderating variable with a multi-group analysis approach. Thus, the present study aims to investigate the tangible and intangible tourism assets that determine the competitiveness of rural tourism destinations, with the moderating effects of mobile technology use. The results were then compared between Sarawak, Malaysia, and Henan province, China, to provide a better understanding of rural tourism destination competitiveness in the Asia region. A total of 525 datasets were collected (233 from Sarawak and 292 from Henan) for analysis in the current study. A partial least squares multi-group analysis (PLS-MGA) was employed to compare Sarawak and Henan. The results revealed a strong and positive correlation between rural tourism destination competitiveness and factors such as destination appeal, destination image, and service quality. Furthermore, it was found that mobile technology use moderated the relationship between destination image and rural tourism destination competitiveness. Theoretically, the findings contribute to existing literature and the theory of competitiveness by offering additional insights into destination competitiveness. The results also serve as an important reference for scholars interested in extending research on destination competitiveness, particularly in the field of rural tourism. Practically, tourism practitioners in Sarawak, Malaysia, and Henan province, China, can use the findings as a reference for decision-making, especially in policy-making and marketing strategies. ICT developers can also refer to this study when designing mobile technologies, with a focus on better integrating mobile technology into tourism infrastructure. Finally, both the limitations of the study and suggestions for future research are discussed. Tourism activities significantly impact many countries’ economy, environment, community, and visitors (Irani et al., 2022; Nadia et al., 2022). The tendency of rural communities adopting rural tourism as a substitute source of income has also been observed in Malaysia's rural areas (Chin et al., 2022). As a result, it has been proven that in developing and developed countries, rural tourism is a great development strategy for the community of rural areas (Chi & Han, 2021). Various facilities will emerge in rural areas through rural tourism, including hotels, transportation, accommodations, and souvenir centres, which directly or indirectly contribute economically to the community. Additionally, the interaction between visitors and the local community will enhance the community's knowledge (Nurlena et al., 2021). Therefore, rural tourism has become a priority for tourism industry development today because an increasing number of tourists seek rural destinations to relax and escape from everyday stress (Jacobs et al., 2020). In the government's strategic planning for tourism development, which includes resource allocation and policy formation, evaluating destination competitiveness has become essential. Furthermore, the term \"destination competitiveness\" is also commonly used to describe sustainable development in the travel and tourist industry (Zainuddin et al., 2021). This drives many countries invest in destination development due to tourism's global economic success. Competitiveness in the rural tourism refers to the competence of a rural destination to captivate and retain tourists by offering unique, appealing, and sustainable experiences that stand out from other tourism options. This competitiveness is necessary for the sustainable profitability of rural tourism destinations, especially amid rising domestic and international competition (Rafee et al., 2024). Furthermore, tourism experience is the most important factor for tourists to choose a destination. Hence, it is imperative to emphasize not just attractions but also destinations’ infrastructure, image, and hospitality (Chan et al., 2023). For this, tourism asset is a major concern to ensure the tourism competitiveness. Tourism asset are categorised into tangible and intangible assets (Santos et al., 2020). While man-made attractions like tourism infrastructure and natural resources are regarded as tangible assets, the destination's reputation and image are regarded as intangible assets (Apostolopoulos & Gayle, 2002). The present investigation regards destination appeal and tourism infrastructure as tangible assets, as they provide visitors with a physical sense of fulfilment. Conversely, intangible tourism assets include destination image and service quality, as they provide psychological motivation and satisfaction that attract travellers.",
    "Technological change is driving economic development, shifting competitive advantages from natural resources to technology. Consequently, many organizations are using mobile technology to stay competitive (Chan et al., 2022). Thus, the use of mobile technology as an enhancer is vital to be investigated in various sectors. As a result, past studies has examined the use of mobile technology as a moderator in learning and education platforms (Seckman, 2019). According to the Sarawak’s post-covid development strategy for 2030, tourism is one of the major sectors that Sarawak would embark in, and digital transformation is the enabler of the development plan (Sarawak Economic Action Council, 2021). Nevertheless, there has not been any research that uses mobile technology as a moderator to study the tangible and intangible tourism assets in Sarawak and Henan in relation to the competitiveness of rural tourism destinations, which can influence the regions' total destination competitiveness. Past studies focused on the nature resources, cultural heritage, communities, accessibility, and so on of the destination competitiveness (Chin et al., 2014; Chin et al., 2022; Chong et al., 2018; Lo et al., 2019; Zili, 2022). Nonetheless, in the current literature, no single study examines the impact of both tangible and intangible resources on the competitiveness of rural tourism destination by using mobile technology use as a moderating variable in Sarawak and Henan. Furthermore, no study has used the partial least squares multigroup analysis (PLS-MGA) method to examine these impacts between Sarawak, Malaysia, and Henan province, China. To bridge the aforementioned gaps, this study developed a research framework grounded in the theory of competitiveness and examine how tangible (such as destination appeal and tourism infrastructure) and intangible (such as destination image and service quality) tourism assets impact the competitiveness of rural tourism destinations. Additionally, the study will examine the use of mobile technology as a moderating variable in examining the rural tourism destinations in Sarawak and Henan. Additionally, a PLS-MGA will be conducted to compare the perspectives between Sarawak, Malaysia and Henan Province, China. According to Sarawak's post-covid development strategy 2030, the present study is anticipated to support the Sarawak state's growth in the information and communication technology (ICT) and rural tourism sectors. It is believed that this study would also help the Henan province to maintain a sustainable rural tourism industry. Additionally, by presenting empirical data from the perspectives of two distinct countries, the current study is anticipated to contribute to the theory of competitiveness in the context of rural destination competitiveness and act as a reference for researchers undertaking future research. According to the World Economic Forum, a territory's productivity is determined by a combination of policies, institutions, and circumstances that make it competitive. The productivity level affects the economy's welfare and investment returns, with higher competitiveness leading to better growth, greater investment returns, and serving as a key indicator of economic development (Zeibote et al., 2019). Competitiveness theory incorporates the concepts of competitive advantages and comparative resources, which are commonly utilised to form the theoretical basis for developing research models related to destination competitiveness by the scholars (Ritchie & Crouch, 2003; Thong et al., 2023; Zehrer et al., 2017). Factor endowments, including facilities and natural resources, that are readily available in a destination are referred to as comparative advantage, whereas efficient long-term utilization of these resources is referred to as competitive advantage (Nadalipour et al., 2019; Thong et al., 2024). Competitiveness theory's central ideas of comparative and competitive advantage provide a strong theoretical and applied foundation for analysing the reciprocal link between the four suggested determinants (destination appeal, tourism infrastructure, destination image, and service quality) of destination competitiveness of rural tourism. Given that the explanations on how human-made (such as tourism infrastructure, destination image, and service quality) and natural (such as destination appeals) elements work together to improve destination competitiveness in rural tourism, the Theory of Competitiveness is relevant to this study. This includes both competitive and comparative advantages from the tourists' perspective. The growing importance of rural tourism as a major source of income for local communities and economic activity has drawn the attention of industry stakeholders, governments, and non-governmental organizations (NGOs) (Saravanan & Sundara Rajan, 2024; Yaccob et al., 2023). The ability of a destination to boost tourism spending, regularly draw more visitors, assure they have incredible experiences at reasonable prices, improve the standard of living for community members, and protect the environment for future generations all contribute to the competitiveness in the tourism sector (Knežević Cvelbar et al., 2016). Moreover, Roman et al. (2020) articulated that competitiveness can be measured using both hard criteria, such as economic infrastructure and structural changes, and soft criteria, like education, human capital, reputation, and services. Soft criteria are more difficult to measure and are associated with longer cycles, whereas hard criteria are simpler to measure and may be evaluated over shorter time periods. In more economically developed regions, the reliance on soft criteria for development and competitiveness is greater. Hence, according to Rafee et al. (2024), the rural destination can be competitive if the destination preserve and sustain the natural environment, ensure the cultural experiences, innovative in the tourism activities, improve accessibility, execute effective marketing strategy, collaborate with the local community, and adapt to the visitors’ preferences. Past study had proved the importance of studying rural tourism destination competitiveness for tourism sustainability of a nation (Jia et al., 2022).",
    "Krešić & Prebežac (2011) define destination appeal as encompassing the destination's people, landscape, tourist activities, culture, history, climate, and food. Essentially, destination appeal pertains to the cultural and natural resources of a tourism destination, instead of its constructed facilities. Natural resources or amenities are essential parts of the tourism assets that make up rural tourism (Nooripoor et al., 2021). The fundamental elements that make a destination appealing are its core attractions, which serve as the key factor to draw travellers and influence their decision to choose one location over another (Lee et al., 2009). The \"pull factor\" that contributes to the competitiveness of rural tourism destinations is the destination appeal. The destination appeal includes both attractions and impediments, as recommended by the Calgary’s tourist competitiveness model (Elbaz et al., 2023). Therefore, it is believed that a destination appeal plays a significant role in determining a destination competitiveness. Past studies has evidenced the destination appeals impacting destination competitiveness positively (John et al., 2023; Wilde & Cox, 2008). Therefore, it can be hypothesized that: H1: Destination appeal is positive significantly associated to the rural tourism destination competitiveness. Destination image defined as the aggregate of qualities, attributes, and advantages that visitors associate with a destination. It represents the opinions and perceptions that tourists have of a particular place as a whole (Line & Hanks, 2016). Destination image encompasses cognitive, affective, and conative dimensions, shaping perceptions and emotions about a place and influencing behavioural intentions toward that destination (Tasci et al., 2022). Furthermore, destination images can be divided into projected and received images from the standpoints of marketing and tourists' behaviour. While the projected image plays a central role in shaping the received image, these two perceptions often diverge significantly. Numerous elements, including psychological, cultural, political, historical, economic, personality characteristics, and other sociodemographic aspects, are held accountable for the differences between projected and received images (Bui et al., 2022). Destination image plays a crucial role in influencing purchasing behaviour, fostering repeat visits, building tourist loyalty, and enhancing destination competitiveness include rural tourism destination competitiveness (Moliner-Tena et al., 2024; Woyo & Slabbert, 2023). Positive experiences related to a rural destination's tourism assets, products, and local community behaviour can enhance tourists' perception of the destination image, thereby directly influencing rural tourism destination competitiveness (Tse & Tung, 2022). The strong correlation between destination image and destination competitiveness has been demonstrated by earlier studies (Slocum, 2023). Hence, it is hypothesized that: H2: Destination image is positive significantly associated to destination competitiveness in rural tourism. Service quality encompasses all activities undertaken by a tourism practitioners to meet tourists’ expectations to achieve satisfaction (Meidina et al., 2022). In another word, Service quality refers to a destination's capability to offer services that enrich the visitor's experience (Cronjé & du Plessis, 2020). Tourist satisfaction is often linked to the concept of service quality at a tourist destination, which reflects the overall quality of the tourist offerings at that location (Arıcı et al., 2023; Boro, 2022). Enhanced service quality not only result in higher customer satisfaction and loyalty, but also fostering repeat visits and boosting profitability (Kerdpitak, 2022; Pandey et al., 2022). On the other hand, low-cost tourism encourages the establishment of reasonably priced travel packages and services. This decrease in visitor spending impacts tourism competitiveness and significantly affects the tourism service quality (Burbano et al., 2022). Destinations must compete globally to attract tourists by offering high-quality travel services. Therefore, improving consumer satisfaction and service quality has emerged as a key strategy for increasing destination's tourism performance and competitiveness (Ibrahim & El-Maksoud, 2022; Nastabiq & Soesanto, 2021). Given its ability to improve service performance, increase market share, and generate profits while offering a sustainable competitive advantage in rural destination, service quality is viewed as a vital competitive advantage (Susanto et al., 2022). Previous research has demonstrated the connection between service quality and destination competitiveness (Ferreira & Perks, 2020; Mustafa et al., 2020). Grounded on the discussion above, a hypothesis is developed as below: Infrastructure refers to the basic facilities, instruments, and installations that must be constructed in order for the public's economic and social systems to work (Dalimunthe et al., 2020). The development of tourism necessitates the completion of infrastructure that supports sustainable development (Mai et al., 2020). Tourism Infrastructure consists of physical facilities and amenities in an area created to serve tourists, community members, and certain specific objectives (Nguyen, 2021). The availability of tourism infrastructure has a significant impact on travellers’ decisions over the choice of travel destination (Chi et al., 2020). Hence, tourism infrastructure is an imperative factor, which can be more important than transportation in attracting tourists arrival (Seetanah, 2006). Studies on the competitiveness of rural tourism destinations are crucial because of the emphasis of the ongoing progress and development of tourism services, along with the development of basic infrastructure (Mustafa et al., 2020). By providing travellers with necessary travel facilities, tourism infrastructure has the potential to increase competitiveness and encourage more tourism revenue (Nguyen, 2021). Therefore, improved infrastructure would enhance tourist travel experiences which indirectly and directly impact tourist arrival rates. Previous investigations has demonstrated the strong correlation between the tourism infrastructure and the competitiveness of destination (Agina & Nwambuko, 2023; Yan et al., 2022). Henceforth, a hypothesis is proposed as follow: H4: Tourism infrastructure is positive significantly associated to destination competitiveness in rural tourism.",
    "Mobile technology is any portable electronic devices that have a liquid-crystal display (LCD), equipped with many software applications, and able to project digital images by operating with a touch screen or digital keypad. Mobile gadgets that are often used include tablets, mobile phone, laptop computers, and so forth (Fietzer & Chin, 2017). Tourism is an economic sector where mobile technology plays a crucial role. It assists businesses with daily operations, enhances customer experiences, and makes destinations more attractive to potential visitors, thereby promoting sustainable tourism (Giotis & Papadionysiou, 2022). The content that presented by the mobile technology is greatly appreciated by the tourists especially in their trip for the purpose of information seeking, making reservations, ticketing, and many more (Camilleri et al., 2023; Parapanos & Michopoulou, 2023). The use of mobile technology as a moderator variable has yet been noticed in any research to examine the tangible and intangible tourism assets in relation to the competitiveness of rural tourism destinations, despite the growing trend in the tourism sector. However, as a result of the changes of tourist industry by the technology, mobile technology can be an inventive instrument for boosting the competitiveness of tourist destinations and tourism assets by producing more comparative and competitive advantages (Lasisi et al., 2023; Mandić & Garbin Praničević, 2019; Rucci et al., 2022). Being the first, this study explores how leveraging mobile technology use may enhance the tangible and intangible tourism assets in order the competitiveness of rural tourism destinations in Sarawak and Henan. Thus, it is hypothesized that: to boost Based on the abovementioned literature review and formulated hypotheses, the research framework of the present research is depicted in Figure 1. The research employed a quantitative methodology, employing numerical assessment and examination to ascertain the potential correlation between the suggested independent variables (destination appeal, tourism infrastructure, destination image, and service quality), dependent variable (rural tourism destination competitiveness), and moderator (mobile technology use). Purposive sampling, a non-probability sampling approach, was used to select respondents. Participants were visitors from Sarawak, Malaysia, and Henan Province, China, who were at least eighteen years old and have visited rural tourism destinations. In Sarawak, the primary study locations include the Annah Rais Bidayuh Longhouse (Kuching), Bario Kelabit Highlands (Miri), Rumah Benjamin Angki (Kanowit), Kampung Po Ai Melugu (Sri Aman), and Bawang Assan Homestay (Sibu). This research was conducted cross-border with researchers from Henan, China. Henan is a significant tourism province in China due to its long history, rich culture, and abundant natural tourism resources (Zhao & Wang, 2021). The province has prioritized tourism growth, rich in rural tourism resources, expanding at a faster pace than Sarawak, making it valuable to compare the two regions (Du et al., 2024). The findings could benefit the rural tourism industry in both areas. The G*Power software was utilized to figure out the minimum sample size. Grounded on the developed research model, a priori power analysis with a power of 0.95, significance level of 0.05, and medium effect size (0.15) was applied. A minimum sample size of 160 from each region is required. A closed-ended questionnaire has been distributed to the respondents at the selected research sites. The measurement items were adapted from previous research (Chi & Qu, 2008; Dwyer & Kim, 2003; Su et al., 2017). The questionnaire has been divided into two major sections which is Section I and Section II. Section I is designed to collect demographic information about the respondents. Whereby, Section II is developed by the adapted measurement items from past studies, gathering respondents' perceptions of the influence of both tangible and intangible resources on the competitiveness of rural tourism destinations, with mobile technologies serving as a moderating variable. The respondents' level of agreement with the measurement items will be evaluated using a seven- point Likert scale, which goes from 1 (strongly disagree) to 7 (strongly agree). To promote higher accessibility and a greater survey response rate, this study utilized online platforms: Google Forms in Sarawak and WenJuanXing in China for data collection. The data was gathered between December 1, 2022, and February 28, 2023. The two main statistical software programs that used to analyze the data of the present study are SPSS and SmartPLS. Prior to the measurement and structural analysis, preliminary analysis will be carried out using the SPSS in order to eliminate missing data and straight-line issues. Following that, the research will employ PLS-MGA in compliance with the suggested 5000-bootstrap technique (Hair et al., 2023). SmartPLS software was used for the PLS-MGA analysis. PLS-MGA was used to assess the constructs' validity and reliability and then identify the correlations between the suggested independent, dependent, and moderator variables (Hair et al., 2022, 2023; Henseler et al., 2016).",
    "In this study, the survey was participated by a total of 535 tourists visited the rural tourism destinations within the study selected regions (i.e., Sarawak and Henan province), nonetheless, as straight-lining responses on a similar scale of 3s were witnesses, thus 10 responses were omitted from further analyses. As a result, only 525 (N=233 from Sarawak and N=292 from Henan) rows of data remained and used for auxiliary analyses. SmartPLS version 4.0 (Ringle et al., 2015) was used to perform PLS-MGA analysis. Additionally, the data was gathered from a single source, thus the test of full collinearity was performed to assess the issue of common method bias (Kock, 2017), where the values of variance inflation factor (VIF) should not surpass 5. According to the findings of the current study, the common method bias is absent as presented in Table 1 (VIF ≤ 5). Numerous evaluations based on the research model were carried out to guarantee the reliability and validity of the data obtained. To determine the measuring scales' discriminant validity, convergent validity, and reliability, the confirmatory factor analysis (CFA) was performed. Table 2 illustrates that all items' loadings and average variance extracted (AVE) satisfied the minimum criteria of 0.50 (Bagozzi et al., 1991; Fornell & Larcker, 1981). Additionally, the composite reliability (CR) of all the constructs reached 0.70 or higher (W. W. Chin, 2010), confirming the internal consistency. Moreover, Heterotrait-Monotrait (HTMT) criterion (Table 3) is a more reliable and accurate method in determining discriminant validity (Henseler et al., 2015). The correlation between two constructs is estimated using the HTMT criterion under the assumption of perfect measurement (i.e. perfect reliability). This correlation, also known as the disattenuated correlation, reflects the true correlation between the constructs and free from measurement error. A disattenuated correlation of 1 signifies a lack of discriminant validity between the two constructs (Hair et al., 2022). Table 3. The Constructs’ Discriminant Validity (HTMT Criterion) (Note: DA: Destination Appeal; DI: Destination Image; MTU: Mobile Technology Use; DC: Rural Tourism Destination Competitiveness; SQ: Service Quality; TI: Tourism Infrastructure) Furthermore, the findings on convergent validity from the Sarawak and Henan as well as the full sample are shown, revealing that the measurement model provided adequate proof of validity and reliability. The measurement invariance of composite models (MICOM) is a crucial initial evaluation that must be completed before the beginning of multi-group analysis (MGA). This step is vital to ensure that the research models produce consistent results, despite of whether the characteristics are identical or varying. In the current study, the proposed research model was assessed using this invariance test to guarantee that both respondents from both Sarawak and Henan interpret the measurements in a similar manner. Following the guidelines of (Henseler et al., 2016), the MICOM process typically includes three steps: configural and compositional invariance tests, as well as examining the equality of means and variances. Table 4 reveals that the factor structure and the number of constructs and measurement items loaded in the measurement models for Sarawak and Henan were the same. Testing for configural invariance between the Sarawak and Henan was part of the MICOM analysis. Subsequently, a permutation test was employed to evaluate compositional invariance in order to guarantee the composite scores of the two groups were identical. In the present research model, compositional invariance is indicated by the c value of 1 and falls within the 95% confidence interval, which is presented in Table 4. Lastly, the equality of composite mean values and variances between the two visitor groups (actual and potential) was assessed and is presented in Table 4. The ratios of composite mean values and variances for each construct did not significantly differ, according to the statistical results. Therefore, the model estimates are consistent for both Sarawak and Henan, demonstrating the richness and relevance of related components. Using SmartPLS version 4.0 (Ringle et al., 2024), the outcomes of the hypothesis testing are displayed in Figure 2 and Table 5. T-values for one-tailed hypothesis tests should typically be at least 1.645 (p < 0.05) or 2.33 (p < 0.01). Based on the current statistical data for the full sample, four of the eight direct relationship hypotheses were found to be supported. This suggests that there is a direct and positive relationship between destination competitiveness of rural tourism and destination attractiveness (H1), destination image (H2), and service quality (H3).",
    "Table 5. Hypotheses testing’s summary (Note: DA: Destination Appeal; DI: Destination Image; MTU: Mobile Technology Use; DC: Rural Tourism Destination Competitiveness; SQ: Service Quality; TI: Tourism Infrastructure; S: Support; NS: Not Support) Furthermore, it was discovered that the association between destination competitiveness of rural tourism and destination appeal (H6) was moderated by the mobile technology use. Subsequently, Table 6 presents the coefficient of determination (R2) for the intention to stay at urban homestays was 0.576 for the full sample, 0.377 for Sarawak, Malaysia, and 0.450 for Henan, China. This means that over 57.67%, 37.7%, and 45% of the constructs were explained, respectively, suggesting a substantial model (Cohen, 1988). PLSpredict was then employed to evaluate predictive relevance. This method uses a holdout sample through a 10-fold process to produce individual-level predictions for a construct or item (Shmueli et al., 2019). Predictive relevance is deemed strong if all item in PLS-LM differences is less than those in the linear regression (LM) model. It is deemed moderate if the majority of the differences are lesser. When a small percentage of items satisfy this requirement, the predictive relevance is deemed to be low (Shmueli et al., 2019). The majority of the prediction errors in this PLS model were less than those in the LM model, suggesting a moderate level of predictive power for the entire dataset. Due to the fact that all of their prediction errors were smaller than the LM models, both the Sarawak and Henan showed significant predictive power (Table 7). The analysis proceeded with a PLS-MGA, utilizing the Welch-Satterthwait Test, to explore discrepancies between Sarawak and Henan provinces (Sarstedt et al., 2011). Path coefficient variances between these datasets are detailed in Table 8. The initial purpose of this study was to evaluate the differences across proposed hypotheses, specifically whether the influence of each determinant on destination competitiveness is more pronounced of rural tourism in Sarawak compared to Henan province. According to the statistical findings (refer to Table 8), hypotheses H2 and H6 were substantiated. Table 8. Areas’ Path differences (Note: DA: Destination Appeal; DI: Destination Image; MTU: Mobile Technology Use; DC: Rural Tourism Destination Competitiveness; SQ: Service Quality; TI: Tourism Infrastructure) Notably, the path coefficient for H2 was significantly higher in Sarawak (β = 0.495) than in Henan province (β = 0.041). Similarly, for H6, Sarawak exhibited a stronger path coefficient (β = 0.142) compared to Henan province (β = - 0.058). Conversely, the remaining hypotheses indicated weaker path coefficients in Sarawak than in Henan province. Using mobile technology use as a moderating variable, the current study examined the tangible (destination appeal and tourism infrastructure) and intangible (destination image and service quality) assets with regard to the competitiveness of rural tourism destinations. Eight hypotheses were developed to predict the proposed relationships. Table 5 and Figure 2 presented the result and the decision of the current study. As indicated in Table 5, in accordance with full sample’s result, H1 (destination appeal; β: 0.347, t: 7.941), H2 (destination image; β: 0.322, t: 7.412), H3 (service quality; β: 0.143, t: 2.739) is significantly associated to destination competitiveness of rural tourism. Hence H1, H2 and H3 are deemed as supported. This result is parallel with the past studies (Ferreira & Perks, 2020; John et al., 2023; Mustafa et al., 2020; Slocum, 2023; Wilde & Cox, 2008). Furthermore, the association between destination image and destination competitiveness of rural tourism is moderated by mobile technology use (β: 0.142, t: 2.713), supporting H6. This result also corresponds with the conclusions drawn from prior studies (Lasisi et al., 2023; Mandić & Garbin Praničević, 2019; Rucci et al., 2022). Surprisingly, H4 (tourism infrastructure; β: 0.066, t: 1.452) is found to be not supported in full sample. To narrow it down, H4 is supported in Henan province, China (β: 0.206, t: 3.284) but found to be insignificant in Sarawak, Malaysia (β: 0.057, t: 0.702). This might be due to the infrastructure’s quality difference. Tourism infrastructure is one of the significant supporting factor for destination competitiveness as evidence by previous studies (Chambers, 2010; Rheeders, 2022). The full sample found to be not supported might due to Sarawak’s less developed infrastructure especially at the rural area to support the competitiveness (Bernama, 2023a, 2023b). Whereas, Henan province has one of the best infrastructure at the rural area in China (Zhou et al., 2023). Therefore, the result reflected that Henan is found to be supported but not Sarawak may be due to the different quality of the infrastructure of both areas.",
    "Moreover, it is discovered that the relationship between destination appeal and destination competitiveness of rural tourism is not moderated by the use of mobile technology, which disproves H5 (β: -0.016, t: 0.390). This hypothesis is rejected in both area (Sarawak; β: -0.096, t: 1.240) (Henan; β: 0.048, t: 0.855). The reason behind may because mobile technology usually used for information seeking, information sharing and making reservation in in a trip (Fan et al., 2019). Whereby, the fundamental of destination appeal in the rural tourism setting is the tangible attraction of the destination such as natural resources or man-made facilities which the tourists can feel, see, smell, and touch (Lee et al., 2009; Nooripoor et al., 2021). Therefore, information seeking and sharing provided by mobile technology maybe a tool to know about the destination attractions, but it cannot be enhancing the destination appeal in terms of providing complete tourism experience involving human senses. However, in order to ensure a satisfaction of a tourists, great tourism experience is needed (Liu et al., 2023), whereby tourists’ satisfaction is one of the core factor that influence destination competitiveness (Bernini et al., 2020). Thus, the use mobile technology cannot moderate destination appeal and destination competitiveness of rural tourism. Furthermore, it is discovered that there is no discernible moderating influence of mobile technology use on the association among service quality and the destination competitiveness of rural tourism (β: 0.033, t: 0.722). Henceforth, H7 is rejected with both rejected result from Sarawak (β: 0.000, t: 0.001) and Henan (β: 0.028, t: 0.349). The result may suggest that service quality is basically based on the human interaction and hospitality of the service providers. There are some parts of the services can be delivered by mobile technology, but the core services need the human touch to deliver. As articulated by Li et al. (2021), technology may be useful in some part of service delivery, but its unsociability, lack of humanity, and psychological loss are the disadvantages of the tourists receive the services from technology. Tourism is a cultural, social, and economical phenomenon that people travel to other places for different experiences (Baggio, 2019). Therefore, the core service quality delivery should be by human and built facilities to allow the tourists experience the local culture and hospitality, whereas the mobile technology can only assist in certain part of service delivery. This may explain the insignificant of mobile technology use in moderating service quality and destination competitiveness of rural tourism. Finally, the outcomes suggested that the association among tourism infrastructure and destination competitiveness of rural tourism is negatively moderated by the use of mobile technology, indicating that H8 (β: -0.131, t: 2.923) with both Sarawak (β: -0.046, t: 0.694) and Henan (β: -0.110, t: 1.723) has been rejected. This result may suggested that although mobile technology can provide information about the infrastructure (Akdu, 2020; Fan et al., 2019), but there is no direct influence toward the quality and availability of the infrastructure itself. The idea of smart tourism is integrating mobile technology into physical infrastructure to provide the better service to the tourists by equipping the information only (Park et al., 2020). However, the mobile technology has yet to be able to directly manage the infrastructure as the complexity and difficulty of integrating mobile technology into the existing management system (Han et al., 2021). This could be the cause of the negative moderating effect that mobile technology use has in the association among destination competitiveness and tourism infrastructure in rural tourism. Many improvements and innovations in mobile technology are needed to be fully integrated into the tourism infrastructure in order to provide good travel experience to the tourists. In conclusion, this study suggests the destination competitiveness of rural tourism is positively and strongly correlated with tangible tourism asset (destination attractiveness) and intangible assets (destination image and service quality). In addition, the employment of mobile technology use positively moderates the association between destination image and destination competitiveness of rural tourism. The disparate findings between Sarawak and Henan indicate notable differences in each region's tourism resources. As a result, this study offers vital empirical evidence for assessing the competitive of both Malaysia and China's rural tourism. The present investigation is expected to contribute to the current literature as well as the theory of the competitiveness in the form of providing more insights to the destination topic related to destination competitiveness. The result serves as an important reference for scholars who are interested in extending the study of destination competitiveness especially in the field of rural tourism. The result also serves as empirical evidence to prove the recommendations of Theory of Competitiveness. Other than that, the tourism practitioners from Sarawak, Malaysia and Henan province, China can use the current study as a reference in decision making especially in policy making and marketing strategy. The ICT developer can refer the current study in developing the mobile technology, such as a better way to integrate mobile technology into the tourism infrastructure.",
    "The current research is limited in terms of research sites as there is only two areas (Sarawak & Henan) were selected from Malaysia and China. Besides, the current study only limited in the tourism assets such as destination image, destination appeal, service quality, and tourism infrastructure to determine the destination competitiveness. There are many more factors to destination competitiveness of rural tourism were not included in the current investigation. Furthermore, this study adopted the cross-sectional study which the data was gathered in same period of time, whereas the perception of the respondents may differ in different period of time. It is advised that in order to obtain more comprehensive data to ensure higher accuracy of the findings, future research can be expanded to include additional states in Malaysia and provinces in China. Moreover, many tourism assets such as natural resources, cultural heritage, and accommodation that can determine the destination competitiveness can be included in the future study. Lastly, the future study can adopt longitudinal approach to collect more comprehensive and accurate data. Author Contributions: Conceptualization, C.C.H. and L.M.; methodology, C.C.H. and C.W.C.; software, C.C.H. and C.W.C.; validation, C.C.L. and L.M.; formal analysis, C.C.H.; investigation, C.W.C. and C.C.L.; data curation, C.C.H.; writing - original draft preparation, C.C.H. and C.W.C.; writing - review and editing, C.C.L. and L.M.; project administration, C.C.L. All authors have read and agreed to the published version of the manuscript."
]