[
    "Abstract. With the rapid development of Chinas economy, politics and culture, university community has experienced the rise of \"unit compound\" in the city, and then the transition to urban community is tortuous. In the city, there are more and more old residential areas, accounting for a higher and higher proportion. \"Unit compound\" architectural performance, architectural appearance, road traffic, public supporting facilities, community culture and other aspects can not meet the contradiction between peoples growing needs for a better life and unbalanced and inadequate development, the community infrastructure supporting facilities and public service facilities urgently need to improve. Taking the old family affiliated college of Anyang Normal University in Henan Province as an example, according to the current situation and some existing problems, according to these problems, aiming at the characteristics of the old community in colleges and universities, the article puts forward some effective and feasible methods for the transformation of family affiliated college. In order to achieve the goal of enhancing functions, inheriting cultural context and reconstructing vitality, the optimization countermeasures and ideas of public service facilities layout are put forward from the aspects of supplementing public welfare facilities, excavating stock space, improving community micro- environment and promoting public participation. Unit community generally refers to the social life community built before the 1980s, funded by the state and the unit as the main body, and the internal staff of the unit as the main population. [1] due to the land utilization is low, the staff is not much, so this period is 4-6 more layer, the community space more relative to the new community, is a barren field more, building better spacing between large green, decades of trees is more, housing construction extremely high strength of economy, building on the layout is commonly determinant in configuration. Most of the people in the college community are the college staff and their families. The family area is a combination of living, leisure and development. The housing is distributed in the way of certain welfare, and the price is lower than that of commercial housing. This group has a relatively consistent code of conduct, social cognition and lifestyle, and because work and life are highly consistent, also bring a sense of belonging to many faculty, the neighborhood atmosphere is stronger. Along with our country economic environment of continuous change, the unit community has been in continuous development and evolution, most colleges and universities by working unit system to community system transition process, presents a very positive and play history and culture of colleges and universities strong tradition, also formed a good neighborhood atmosphere, gradually transformed into spontaneous management, It strengthens the sense of belonging and identity to the community, alleviates the stress of the modern workplace, and reduces the cost of transportation. However, with the development of marketization, the form and function of some family areas have been solidified for a long time, which is difficult to adapt to the internal requirements of today's marketization living mode. Many faculty and staff have moved out of the university community, replaced by more elderly aborigines and young tenants. Most of the elderly aborigines are retired workers, while most of the young tenants are white-collar workers nearby, who live here out of economic conditions and convenience to work. It is pointed out in the paper \"Current Situation and Countermeasures of Construction of Public Service Facilities in Old Community of University Units -- A Case study of Chang 'an University's Main Family Courtyard\" that the living area of Chang 'an University's staff and their families covers an area of about 18 hectares. After 2000, some low-rise houses were demolished. In the paper \"Research on The Content and Countermeasures of\" Micro-Transformation \"of Old Urban Residential Areas\" [2], it is different from the previous large-scale demolition and construction, and is also different from the traditional urban renovation, mainly transforming the facade decoration, environmental beautification, etc., to strive for the mode of low cost, convenient implementation and short cycle. Small changes do not require a lot of financial support, and the addition of modern ideas is bound to make residents' lives more modern. In the paper \"Exploration on Renovation Methods of Old Residential areas under New Shanty Reform Policy\", the author mainly hopes to transform residential areas by implementing government subsidy policies for owners' renovation, optimizing management of community reconstruction, and improving greening and environment. The elevator installation is more difficult to carry out, covering an area of land is on the one hand, investment is on the other hand, the implementation is more difficult.",
    "In most European countries, the reconstruction of existing buildings mainly focuses on reducing resource waste and environmental pollution under the policy and economic support provided by the government. Represented by France, Germany, the two countries old building reconstruction, from the perspective of the energy-saving renovation, support to encourage social capital to join, to improve the residents' participation, these measures not only solved the old building structure security, and energy conservation, environmental protection, and solved the problem of the architectural image and city landscape, and through modification increased the residents actually used the area of the building, The basic pipe network has been upgraded and reformed, and the roads and greening have been optimized and improved. The British government encourages the formation of a tripartite cooperation mechanism involving government, social capital and community participation, which effectively promotes urban renewal from a single level of renewal to a more extensive and holistic renewal of old residential areas. [3] Anyang normal college predecessor was founded in 1908, akira DE fu anyang normal ChuanXiSuo, after many years in 2000 changed its name to anyang normal college, anyang normal college is old families in the 1970 s by the school for school cadre formerly anyang teacher's college accommodation is built, families because of the trees planted earlier, more than 50 years of poplar and pine, It is a rare urban greening resource, and most residents of the community enjoy the cool and chat under the trees, which has a strong cultural atmosphere. However, due to the time-old construction of the family area, the construction scale is small, the structural apartment type is single, and the supporting infrastructure is aging, according to the characteristics of the old community of university units, Put forward some effective and feasible transformation methods for the renovation of family courtyard can not only rebuild the vitality of family courtyard, but also complement the public welfare facilities and enhance the function of cultural heritage. Combined with the research data, the public management and service facilities, educational facilities and cultural facilities in the research area were studied respectively, and the contents and functions of the facilities were summarized. Public management and service facilities: There are many retired elderly workers in the family home of Anyang Normal University. Their children are not around all the year round, so supporting facilities such as nursing homes for the aged are essential. Educational facilities: There is a college student internship base in the family area, and there are secondary schools attached to Anyang Normal University, primary schools and senior high schools nearby, with relatively complete educational facilities. Cultural facilities: Due to the geographical location, Anyang Normal University is close to the urban area, surrounded by cultural center, Triangle Lake Park, and other municipal cultural facilities. The supporting cultural facilities are relatively simple, with only one teaching and staff activity center. This project is located in anyang Normal University family area, Wenfeng District, Anyang city, Henan Province. The transformation direction of the old family area is to keep up with the pace of the development of The Times, strengthen the concept of scientific and technological innovation, and absorb experience to promote the transformation of the family area of colleges and universities. In addition, to some extent, the old community of university units carries the history and culture of the traditional campus and has its own cultural deposits and historical origins. It is this characteristic that determines its uniqueness. In ancient times, Meng and His mother moved three times, which also shows that an environment with good historical and cultural deposits is particularly important to people. However, in the process of transformation, it is bound to be restricted by various factors, so the historical and cultural elements of colleges and universities should be retained and extracted as far as possible in the process of transformation. The transformation of the old communities of colleges and universities should continue and develop this characteristic, and at the same time, take new requirements into comprehensive consideration to make it radiate new vitality. With the improvement of living standards, people are also increasing demand for public service facilities, also constantly improve the quality of public service facilities, should give priority to the complement and improvement of the public welfare service facilities, in terms of community service facilities, staff activity center can be transformed into old age community center, older age and chess studio facilities, In addition, with the rapid development of the electronic industry, it is necessary to equip express stations, express cabinets and other express business space requirements. Due to the rich educational resources around the community, the allocation of educational facilities is mainly for the cultural and interest training of the elderly.",
    "The old community should not only pay attention to the utilization of public service facilities, but also improve the quality of living environment and space. Most of the trees in the family area of Anyang Normal University are decades-old trees, which purify the air for the community and have far-reaching significance for green development. The old and children should be maintained as a place to enjoy the cool and chat in summer. After maintaining the trees, seat stone piers should be installed around them, which not only protects the original green plants, but also meets the new concept of modern green development. The open space of the old community of university units should not only meet the simple design requirements of landscape, but also become a place for the colorful life of community owners. Through the rearrangement of street space and the reorganization of all kinds of green plants, the environmental quality of the old community of university units can be effectively improved while meeting the use function.[4] Old village neighborhood closer, with very strong flavor of fireworks, neighborhood compared with high-rise apartments closer now, and you won't feel cold, can let a person find the scenery pleasing to both the community of more close to nature, so the unit old community residents, they have long gave high attention to community development. Encouraging residents to participate in community affairs and enhance their right to speak is not only conducive to enhancing residents' sense of community belonging and responsibility, but also conducive to increasing community cohesion and belonging. Therefore, strengthening public participation and advocating multi-party cooperation can effectively promote the transformation of community public service facilities to humanization and diversification. [5] In China entered a stage of rapid development of urbanization, urban development from the transformation of \"speed\" to the \"quality\" of the macro background, the people to pursue higher and higher living standards, the construction of community college units old problem increasingly prominent, many regional facilities obsolete, has been difficult to meet the demand of modern people's life, in the era of planned economy residential area form a complete set of standards is generally low, Therefore, there is a general shortage of public facilities in the old community of colleges and universities in Our country. unit old community as a living environment system in colleges and universities, in the development of updates to eliminate the current one-sided pursuit of short-term set up more staff, residents and should fully consider the living environment of the coordinated development of each system, focus on staff community, with comprehensive, dynamic development of the update of the development of the strategy, Comprehensive optimization of the university unit housing, in the renewal of development to achieve a systematic update of living conditions, to provide a comprehensive improvement of the community environment for the staff, shaping the unique vitality of the community."
]