[
    "Abstract. With China's economic development and social progress in recent years, people must improve their work skills through adult education in order to meet market demands. This paper will take Henan Province as an example, Adult education is crucial for the improvement of the population's knowledge base and for the economic development of Henan Province. The PLS-SEM model and OLS regression model are used to conduct questionnaires and in-depth interviews with the target population in Henan Province. The survey results are analyzed qualitatively and quantitatively by SPSS software. allowing the research conclusion to be drawn. The final results of this paper show that motivation is relatively strongly associated with adult learning satisfaction and personal growth, whereas age, time, situational barriers, and environmental barriers are associated with adult learning satisfaction and personal growth. With the rapid development of China’s economy and society, adult education is also developing at an alarming rate. It is a tendency to meet the demand for improving the national quality of the country as a key issue, and the market demand also leads to a growing demand for adult education. Adult education is very important to improve labor productivity, and a high labor productivity will greatly promote economic growth. From the perspective of receivers of adult education, people in China attend adult education courses to fulfill the needs of work or their interests, but the results of their learning are limited. There are many reasons for this, for example, poor learning atmosphere, unreasonable curriculum setting, outdated teaching facilities and so on. Problems related to the teachers include shortage of instructors and insufficient teaching experience, etc. Kola et al. (2015) believes that the indicators to measure the effectiveness of teaching activities include student evaluation, student motivation, learning environment, teachers’ personal quality, teachers’ professional development, teaching delivery and interpersonal relationship between teachers and students. According to Patil et al. (2016), effective teaching requires an interactive classroom environment to stimulate and encourage students. Effective teacher-student interaction is based on various activities. Considering the above the author of this research studies the effectiveness of teaching activities from the perspective of learners. For adults who want to actively participate in educational activities, there may be barriers to their participation in these educational activities. Sharp, Johnston and Rivera (1967) conducted a pioneering study in this regard and identified that there are two basic types of educational barriers, external (situational) and internal (structural) (personality) barriers, which can impact adult learners’ participation in educational programs. Khodadad Azizi et al. (2018) also divided the influence factors of adults’ learning into internal factor and external factors. Internal factors include learner’s motivation, current knowledge, physical conditions, and learning disabilities, while external factors include age, peer, teacher behavior, parental support, and classroom environment. Ramli et al. (2018) studied the relationship between external factors, internal factors and academic achievement, and concluded external factors to be family environment and academic environment, and internal factors to be learning motivation and interest. Based on the above literature review, we put forward several hypotheses. H1: The effectiveness of adult education is influenced by learners’ motivations. H2: The effectiveness of adult education is influenced by age of the learner. H3: The effectiveness of adult education is affected by learners' learning time. H4: Situational barriers affect adult learners' willingness to learn. H5: Physical environment barriers affect learners' willingness to accept adult The sample of this sampling survey is planned to be selected from several large-scale adult education institutions in Zhengzhou, such as Zhengzhou Chengding education, Beijing cumulus education Zhengzhou campus and Zhengzhou Beida Qingniao Zhengzhou campus. The simplified formula proposed by Yamane (1967) is used to calculate the sample size. the planned sample size is determined to be 400, randomly distributed from several large adult education institutions in Zhengzhou. It is mainly about the basic information or demographic characteristics of the respondents, which is carried out through a checklist, including 5 variables: gender, age, income, educational level and learning time. Mainly through the quantitative form, it contains 4 variables. It is planned to use Likert scale to divide the value of each variable into 5 levels: very disagree, disagree, neutral, agree and very agree. Data collection mainly collects the original data through questionnaires and expert interviews. The raw data required for quantitative and qualitative analysis mainly includes information from 400 respondents. These respondents are the lists of students and teachers obtained through various adult education institutions. According to these lists, a sample population is randomly obtained as the data source of the study.",
    "The questionnaire is mainly used to collect quantitative data and is mainly sent to educational institutions electronically for respondents to fill in. Qualitative research also needs to determine the sample size. According to the research of vasileiou et al. (2018), the best sample size is 20-30 interviews. Therefore, 20-30 people will be recruited to participate in expert interviews. The basic information of the interviewees mainly includes 5 variables: gender, age, income, educational level and learning time. In this study, the basic information of the interviewees was obtained through the questionnaire survey, and then the frequency and percentage of the variables were obtained through the characteristic analysis of SPSS statistical analysis software. The descriptive analysis of the survey show the 55.5% of the respondents are females while 44.5% of the respondents are males. of respondents were between 26 and 35 years old; 17.3% of respondents were between 36 and 45 years old; 15.5% of respondents were between 46 and 60 years old; The remaining 1.6% were over 60 years of age. When it comes to the income, nearly three quarter of the respondents are medium-lower incomers while the rest one quarter of the respondents are high incomers. As for education level, 72.0% of the respondents are college or university graduate; 15.8% of the respondents have master and PHD postgraduate, the rest of the respondents are those graduated from high middle school or lower level than high middle school. When asked how many hours spent on adult education weekly, 68.0% of the respondents answer that they spend 1-2 hours a day, 5-10 hours a week; 23.0% of the respondents answer that they spend 3-4 hours a day, 15-20 hours a week; 7.8 % of the respondents answer that they spend 7-8 hours a day, 35-40 hours a week; the rest of the respondents answer that they spend More than 35-40 hours a week. As can be seen from the above table, motivation, age, time, Situational barriers and Physical barriers are significantly correlated with Satisfaction to adult education. The hypothesis test proposed in this study will be tested by using Linear Regression of MRA. Linear Regression is a method that uses regression analysis in mathematical statistics to test the relationship between two or more variables. In model 1 and 2, satisfaction to adult education are chosen as dependent variables and motivation, age, time, situational barriers and Physical barriers are treated as independent variables. Satisfaction to adult education = 1.945 + 0.314 * motivation + 0.08 * age - 0.07 * time + 0.018 * Situational barriers + 0.122 * Physical barriers Personal growth = 2.33 + 0.284 * motivation - 0.051 * age + 0.089 * time + 0.011 * Situational barriers + 0.075 * Physical barriers. The research results show that among these five factors, motivation has relative stronger relationship with satisfaction to adult education and personal growth. That means motivation has much more impacts on the effectiveness of adult education that other four factors. The analysis of interview content shows that adult education is an important part of the education system in Henan Province and an organic part of the lifelong education system. It is interdependent and interrelated with formal education. The expansion of college enrollment not only promotes the rapid development of higher education, but also promotes the expansion of adult education audience. But the reality is that China's adult education has become a golden way to expand social circle and obtain certificates. Many schools provide adult education for profit. Although some schools do have reasonable curriculum, many famous universities also outsource adult education. Based on the theories related to adult education, such as Pedagogy, autonomous learning and transformational learning and the previous studies on factors affecting the adult education, several hypotheses have been developed. To test the hypotheses, questionnaire survey have conducted and the collected data is analyzed with regression model, The test results of the hypothesis were finally obtained as follows: The results show that: among the 5 hypotheses of the effectiveness of adult education, the hypothesis of motivation is Accept, and the hypothesis of physical environment for satisfaction is Accept; The hypothesis of age, time and situation barriers is Not Accept. First, learning motivation is the most important factor in the effectiveness of adult education. If a learner is willing to accept adult education, other factors, such as age, time, situational barriers, physical barriers, can not be the reasons to hinder his learning.",
    "Second, age, time, situational barriers and physical barriers have a weak relationship to the effectiveness of adult education. If a learner does not want to participate in adult education, these objective reasons may become the reason why he does not want to learn. Therefore, if we want to improve the effectiveness of adult education, we must improve learners' learning motivation, which is the most important factor."
]