[
    "Abstract. Currently, there exists a certain foundation of research within the academic community pertaining to the ecological and environmental benefits as well as the high-quality economic development. However, limited attention has been given to investigating the synergetic development between China's ecological and environmental benefits and its high-quality economic growth. This article employs data reflecting the ecological and environmental benefits and high-quality economic development of Henan Province, and establishes an evaluation model for assessing the synergy between ecological and environmental benefits and high-quality economic development in Henan Province. The indicator weights are determined using the coefficient of variation method and the entropy method, and empirical analysis on the synergy between the ecological and environmental benefits and high-quality economic development in Henan Province is conducted. The research findings indicate that the synergy between ecological and environmental benefits and high-quality economic development in Henan Province demonstrates a pattern of alternating growth and decline, and is generally at a low level of synergy. This study can contribute to the existing research on the synchronized advancement of ecological environmental benefits and high-quality economic growth in provincial regions of China. Balancing the relationship between economic development and ecological environmental protection so as to promote sustainable development has always been an important theme in the current era. Numerous nations and international organizations are dedicated to mitigating environmental impact while promoting economic growth through the adoption of renewable energy, circular economy principles, and green technologies, with a focus on reducing carbon emissions and resource consumption. In 2019, the European Commission introduced the 'European Green Deal' as a comprehensive framework to facilitate climate change mitigation and foster sustainable development across Europe. In 2022, the leaders of Asia-Pacific Economic Cooperation economies collaboratively devised the 'Bangkok Goals for a Bio-Circular Green Economy,' which deliberated strategies to advance a bio-circular green economy. However, the progress of economic development and coordinated efforts for ecological conservation are still impeded by persistent global environmental issues and obstacles such as disparities in technological levels and financial investments among countries. Since the 19th National Congress of the Communist Party of China, the Party Central Committee with Comrade Xi Jinping at its core has gained a profound understanding and accurate grasp of the stage and laws of China’s economic and social development. It has been determined that China’s economic development has entered a new normal, shifting from a phase of high-speed growth to a stage of high-quality development. It is imperative for China to promote a transformation in the quality, efficiency, and driving forces of economic development in order to advance high-quality development that embodies the new development philosophy. At the symposium on ecological protection and high-quality development in the Yellow River Basin held in Zhengzhou, Henan in September 2019, General Secretary Xi Jinping explicitly delineated the vital relationship between ecological preservation and high-quality development within the Yellow River Basin, along with outlining the substantial strategic tasks for the future (Xi, 2019) [1]. Henan Province, as the cradle of Yellow River civilization, plays a pivotal role in supporting ecological protection within the Yellow River Basin. Exploring the synergistic relationship between ecological environmental benefits and high-quality economic development in Henan Province is crucial for promoting sustainable economic growth and spearheading the establishment of a new development paradigm centered around green transformation. The ecological and environmental benefits encompass the overall efficacy and advantages derived from construction projects in preserving and enhancing the quality of the ecological environment. According to the definition provided in the Agricultural Dictionary, ecological benefits encompass the advantageous impacts and favorable outcomes that ensue from adhering to ecological balance principles in production, thereby enhancing human productivity, living conditions, and environmental circumstances within natural biological systems. Environmental benefits encompass the advantages that individuals obtain from utilizing environmental resources and engaging in human social activities, while also serving as an indicator of the ecological impacts caused by these activities. The concept of high-quality development was first proposed at the 19th National Congress of the Communist Party of China in 2017, and since then it has garnered significant attention and extensive research within China. The People's Daily proposed in 2017 that \"high-quality development entails the capacity to meet the escalating demands of individuals for an enhanced standard of living, embodies the novel concept of development, and is characterized by innovation as its primary impetus, coordination as an inherent attribute, environmental sustainability as a pervasive aspect, openness as an indispensable approach, and inclusivity as its fundamental objective [2]. Ren and Wen (2018) [3] propose that in the new era, China's high-quality development will be determined by factors such as the population's quality and structure, resource and environmental quality, capital accumulation quality, technological progress quality, foreign trade quality, and institutional factors.",
    "Currently, China’s economy has achieved a series of accomplishments in high-quality development. The Economic Research Institute of the National Development and Reform Commission of China (2019) [4] highlighted that in recent years, China’s economic development has undergone systematic changes, encompassing enhancements in the quality and efficiency of the supply system, along with a gradual improvement in its stability. Since the end of 2012, China's GDP growth rate has maintained stability, accompanied by a well-balanced international balance of payments. Furthermore, China has successfully achieved comprehensive development towards a moderately prosperous society. Notably, there have also been remarkable improvements in ecosystem stability and expanded coverage of public services (Xie, 2022) [5]. The Henan Province in China has made initial progress in attaining high-quality economic development. Li (2021) [6] proposed that the economic output of Henan Province is continuously expanding, with emerging industries such as artificial intelligence and new energy becoming new growth drivers. The introduction of new technologies has yielded significant achievements, while small and medium-sized enterprises are steadily enhancing their technological innovation capabilities. Currently, numerous scholars have undertaken extensive research on the intricate relationship between economic development and ecological environment. Guo (2008) [7] highlighted the existence of a reciprocal relationship between ecology and economic development, offering a guiding framework for achieving mutually beneficial outcomes in ecological preservation and economic progress. In addition, one of the most representative research findings from foreign scholars is the Environmental Kuznets Curve (EKC) proposed by Grossman and Krueger (1995) [8], which suggests an inverted U-shaped relationship between environmental protection and economic development. In recent years, Chinese academics have increasingly focused their attention on the harmonization of economic development and ecological environment, undertaking pertinent studies from various regional perspectives. Zhang and Jiao (2015) [9] employed a coupled coordination model to analyze the coupled coordination and evolution of economic development and ecological environment in the Yangtze River Delta region. Su (2021) [10] conducted a comprehensive analysis of the interactive coupling development process between the ecological environment and socio-economic aspects in Ningxia. Scholars have also conducted computational analyses on the coupled coordination of economic development, green innovation, and ecological environment in the Yellow River Basin, based on the spatiotemporal coordinated evolution characteristics (Liu & Zhang, 2022) [11]. Some scholars have taken a nationwide perspective. They comprehensively assessed the impact and contribution of the ecological environment to economic development, as well as the influence of changes in the ecological environment on various production factors (Fan, 2019) [12]. In summary, the existing body of scholarly research on ecological environmental protection and high-quality economic development is extensive. However, it also exhibits certain limitations: Firstly, although numerous studies have already focused on and confirmed the interactive relationship and coupling coordination relationship between economic development and the ecological environment, there is relatively less investigation into the synergistic relationship between high-quality economic development and ecological environmental benefits. Moreover, the current research predominantly focuses on national-level and large-scale regional and watershed levels. This article aims to investigate Henan Province as a research subject, constructing a model that demonstrates the synergy between ecological environmental benefits and high-quality economic development. By comprehensively applying the coefficient of variation method and entropy value method, this model will be utilized to assess the level of coordinated development between ecological environmental benefits and high-quality economic growth in Henan Province. The findings aim to provide valuable insights for promoting ecological environment protection and fostering high-quality economic development in both Henan Province and the central China region. In 1971, the field of synergetics was established by German physicist Haken (2004) [13], who proposed a comprehensive and systematic theory in this domain. The composite system synergy model offers a robust assessment of the collaborative effects exhibited by the studied entities. The positive operation of a composite system relies on the coordination and harmonious integration among its components or subsystems. The greater the synergy degree between the elements of the system, the more it facilitates orderly and positive development, thereby achieving an overall effect where '1+1>2'. This article will take the ecological and environmental benefits and high-quality economic development as a composite system. Through empirical analysis of the synergy of this system will be conducted, a clear understanding of the synergy between the ecological and environmental benefits and high-quality economic development in Henan Province over the past decade since 2013 can be gained. This will provide theoretical references for the sustainable development of regional ecology and economy in the context of the new era.",
    "The ecological benefits interact with and complement high-quality economic development, establishing a mutually advantageous and symbiotic relationship. The strategic guidance and synergistic effect of the 'Five Development Concepts' are indispensable for achieving high-quality economic development. Therefore, this article aims to explore the mechanism that fosters synergy The ecological environment serves as a driving force for the advancement of high-quality economic development. Firstly, reinforcing the construction of the ecological environment and pursuing the enhancement of ecological benefits can compel traditional economies to bolster green innovation and institutional innovation in order to accomplish a transition towards sustainability. Secondly, the pursuit of an enhanced ecological environment can facilitate the unleashing of potential for coordinated and sustainable development. Thirdly, enhancing the ecological environment's quality entails safeguarding its natural value and bolstering its natural capital. The eruption of ecological and environmental benefits, fourthly, contributes to the expansion of ecosystem capacity, thereby accelerating the promotion of eco-benefits for the people and ecology serving the people. Drawing on the Five Development Concepts, high-quality economic development can serve as a guiding force and catalyst for the effective implementation and benefits of ecological environment protection. The innovative concept of high-quality economic development can provide a novel impetus for ecological construction. As China's population, environmental challenges, and resource constraints intensify, enhancing the technology-driven construction of ecological civilization is conducive to comprehending the intrinsic mechanisms and evolutionary laws governing natural ecology issues. Furthermore, adhering to the principle of coordinated development and establishing a robust and efficient mechanism for coordinating interests will facilitate the formation of a novel framework for constructing ecological civilization characterized by diverse governance and collaborative management. Actively responding to the concept of green development facilitates the acceleration of the transition towards a greener development model, thereby promoting optimization adjustments in industrial and energy structures. Embracing the concept of open development is beneficial for assimilating advanced ecological governance practices in international cooperation. The holistic perspective embodied in the concept of shared development can enhance the participation, supervision, and evaluation of the entire populace in ecological conservation, while continuously elevating the level of ecological civilization construction by harnessing the creative potential of the general public. This article presents compiled data on various indicators within the framework of ecological and environmental benefits and high-quality economic development, utilizing National Bureau of Statistics data spanning from 2013 to 2022, alongside references from the Henan Statistical Yearbook and pertinent national economic and social development statistical bulletins. This article regards the ecological and environmental benefits and high-quality economic development as a composite system. Define the composite system as S = (S,,S,), where S, represents the subsystem for ecological environmental benefits and S,represents the subsystem for high-quality economic development. The subsystem is denoted as Sj € [1,2]), with its order parameter being c; = (cj C2» ween Cin) where Bj S Gj Sajz,n2Li=12,...... NAir By represents the critical values of c;; when the system is in a stable state. Assuming (ci, Cjayeeeees Cis) as a positive indicator, its value exhibits a positive correlation with the level of system orderliness. Conversely, assuming (Cjst1) Cistarrerees , Cin) as a negative indicator, its value demonstrates a negative correlation with the level of system orderliness. In equation (2), w; represents the weight assigned to each parameter. In this paper, w, is determined through a combined approach utilizing both the coefficient of variation method and entropy value method. Step 1: Utilizing the coefficient of variation method. The coefficient of variation method is a technique that mitigates the impact of dimensional disparities, enabling comparison among data sets with varying units or magnitudes. Its fundamental principle can be summarized as follows. Step 2: Adopt the entropy method. The entropy method calculates the information entropy of indicators to determine the weight of the indicators based on the relative degree of change and their impact on the overall system. The following are its basic principles: Step 3: By integrating the weights w,; and w2; obtained from the two methods mentioned above, the combined weight w; can be derived. According to the principle of minimum information entropy, it is possible to compute: The synergy degree of ecological and environmental benefits with the high-quality development of the economy exemplifies the comprehensive coordination between ecological and environmental systems and economic high-quality systems. The formula employed in this article is as follows: Zw (13) The variable Z,(t) represents the order contribution degree of the ecological environmental benefit subsystem at time t, while Z,(t) denotes the order contribution degree of the high-quality economic development subsystem at time t. Zj%) represents the synergy degree of a composite system, Z(¢) € [—1,1]. The higher the numerical value, the stronger the level of synergy observed in the composite system. Conversely, a lower degree of synergy is observed between two systems.",
    "Figure 3. The variation of synergy degree in the ecological and environmental benefit system, the high-quality economic development system, and the composite system in Henan Province. The ordered degree of the two subsystems and the collaborative degree of the composite system can be determined based on equations (2) and (13). The specific outcomes are illustrated in Figure 3 and summarized in Table 4. From the perspective of subsystems, the overall synergy of both the ecological and environmental benefits subsystem and the high-quality economic development subsystem in Henan Province exhibited an upward trend from 2013 to 2022. Furthermore, the growth rate of synergy in the high- quality economic development subsystem slightly surpassed that of the ecological and environmental benefits system. From 2013 to 2016, the ecological and environmental benefits system operated at a moderate level of synergy. However, starting from 2017, it steadily increased and attained a moderate and high level of synergy. For the system of high-quality economic development, it exhibited a mild level of synergy from 2013 to 2017, which transitioned into a moderately high level of synergy starting in 2018. From a complex systems analysis perspective, Figure 3 illustrates that the synergy between ecological and environmental benefits and high-quality economic development in Henan Province has exhibited a fluctuating trend over the past decade. The overall value remains stable within [0,0.2], indicating a low level of synergy. During the period from 2013 to 2019, the synergy level of the composite system exhibited significant fluctuations, displaying an alternating pattern of growth and decline, while consistently maintaining low levels of collaboration. From 2019 to 2020, the synergy of the composite system in Henan Province exhibited a significant improvement, reaching its pinnacle in 2020. However, during the subsequent two years, there was a rapid decline in the value of the composite system to 0.0424, even surpassing the level observed in 2013 In 2013, the establishment of Zhengzhou Airport Economy Comprehensive Experimental Zone made a promising start. In addition, the Zhengzhou Central Branch of the People's Bank of China provided comprehensive support for agricultural re-lending and guided financial institutions to expand their agricultural credit lending, which effectively mitigated the challenges associated with ‘difficulty in accessing financing' and ‘high cost of borrowing’. In terms of the construction of ecological civilization, Henan Province has implemented comprehensive environmental improvement measures. Furthermore, substantial advancements have been achieved in the promotion of obsolescent production capacity elimination. Consequently, within the timeframe of 2013-2014, the two major systems and composite system exhibited an escalating level of synergy. During the period of 2014-2015, rapid industrialization and urbanization in Henan Province resulted in a substantial surge in coal and petroleum fuel consumption, leading to severe air pollution and frequent occurrence of haze weather. The issue of urban air pollution was increasingly prominent and posed a constraint on further economic development, thereby resulting in a decline in the synergy level of the composite system. From 2015 to 2017, the economic development in Henan province remained heavily reliant on energy and raw materials, following a resource-dependent and extensive growth trajectory. This extensive economic model characterized by high pollution, excessive consumption, and low efficiency emerged as a bottleneck impeding further progress and sustainable development in Henan's economy. Consequently, the deceleration of the synergy growth rate pertaining to high-quality economic development resulted in a further reduction in the overall synergy of the intricate system. From 2017 to 2019, Henan Province consistently implemented the new development concept, deepened supply-side structural reforms, optimized its economic structure, and witnessed a significant increase in the proportion of the tertiary industry. Furthermore, it organized and implemented the “Forest Henan Ecological Construction Plan (2018-2027)\", which opened a new phase of land greening. Under the impetus of this series of developmental achievements and measures, the synergy of the three systems rose steadily. The synergy growth rates of the three major systems all showed improvement during the period from 2019 to 2020. In 2019, the total GDP of Henan Province reached a significant milestone of 5 trillion yuan, consolidating its position as a prominent economic province. The growth rates of industrial investment, private investment, and real estate investment experienced a continuous rebound. Moreover, Henan Province continuously strengthened pollution control, restored ecosystems, and significantly reduced the number of heavily polluted days.",
    "From 2020 to 2021, Henan Province implemented a comprehensive green and low-carbon transformation strategy, achieving remarkable advancements in the fight against pollution. However, the consumption growth in Henan Province was constrained due to the impact of the COVID-19 pandemic. Therefore, the synergy degree between ecological and environmental benefits witnessed an accelerated growth rate, while the synergy degree of high-quality economic development exhibited a deceleration in its growth trajectory. Under this influence, the synergy degree of the composite system showed a downward trend. The growth rate of the high-quality economic development system remained unchanged in 2021- 2022, while there was a decrease in the synergy growth rate of the ecological and environmental benefits system. Therefore, the overall synergy of the composite system continued to decline. The economic performance of Henan Province exhibited a sustained recovery and demonstrated positive developmental trends during these two years. However, the prominent contradiction between the substantial resident population and limited resources, coupled with the inadequate ecological awareness among citizens, continued to impede the favorable advancement of ecological environment benefits in Henan Province. Table 4. The synergy degree of Henan Province's ecological environment benefit system, high- quality economic development system, and composite system from 2013 to 2022. Firstly, the synergy of the ecological and environmental benefits system maintained a trend of annual growth, and the overall development of the ecological environment was generally positive. However, in the past two years, the growth rate has slowed down. By analyzing the raw data of indicators, it can be found that the growth in forest coverage was not significant, and the per capita water resources were still far below the national average. Therefore, the improvement of ecological environment benefits in Henan Province still faces certain pressures. Secondly, the economic development of Henan Province is showing a positive trend towards high- quality growth. The synergy growth rate of high-quality economic development exhibited slight fluctuations over the period from 2013 to 2022, yet consistently maintained an upward trajectory. From the perspective of various indicators of a high-quality development system in the economy, the proportion of the total import and export volume of foreign-invested enterprises to GDP and the proportion of local fiscal education expenditure to GDP in Henan Province showed an overall downward trend. These factors to a certain extent constrain the level of high-quality economic development in Henan Province. Thirdly, efforts should be made to enhance the synergy of ecological benefits and high-quality economic development composite system. The synergy of the composite system between ecological benefits and high-quality economic development in Henan Province exhibited frequent fluctuations from 2013 to 2022, consistently maintaining a low level of overall synergy. It is evident that the synergy of ecological and environmental benefits with high-quality economic development in Henan Province is precarious, indicating an immature collaboration that requires further refinement. The Henan Provincial Government should undertake a large-scale land greening campaign, implement the construction and enhancement project of ecological province for forestry, strengthen the natural forest protection system, and enhance the ecological carrying capacity of forestry. The water resource development in Henan Province should be strengthened through the promotion of agricultural water conservation, acceleration of industrial water reduction and emission control, innovation and improvement of water-saving mechanisms. Additionally, it is imperative to establish and revise local regulations pertaining to environmental and resource protection, in order to integrate the construction of ecological civilization into the framework of legal governance. Firstly, efforts should be made to promote the elimination of outdated production capacity and address overcapacity. Henan Province should implement a new round of technological transformation and promote mergers and reorganizations to address overcapacity issues. Furthermore, policy guidance and market pressure can be employed to steer low-quality and inefficient enterprises. Secondly, accelerate the green transformation and upgrading of traditional industries. The development of clean production industries and clean energy industries should be guided in Henan Province. Furthermore, it should incentivize enterprises to adopt cutting-edge technology and efficient governance equipment in order to facilitate the implementation of clean production transformation. It is imperative for Henan Province to prioritize the effective utilization of foreign capital and enhance control over the quality of foreign economic cooperation. Additionally, there should be an emphasis on strengthening policy guidance to foster external economic cooperation. For instance, policy support can be enhanced through measures such as implementing policies allowing overseas investors to reinvest profits directly, temporarily exempting them from withholding income tax, and providing personalized tax services.",
    "Based on the analysis, Henan Province still has shortcomings in promoting inclusive development. On one hand, it should align the level of education and other social undertaking development with economic growth while augmenting its financial allocation towards education. On the other hand, Henan Province should address the varying scales of healthcare expenditure among local governments. It is necessary for Henan Province to firmly follow the path of coordinated and win-win ecological environment construction and high-quality economic development, continuously promoting the coordinated governance of ecological environmental benefits and high-quality economic development. One the one hand, the driving role of ecological environmental benefits in high-quality economic development should be brought into play. Henan Province should integrate ecological environmental protection into the entire process of economic and social development, establish a green, low-carbon, and circular economic system, and accelerate the formation of a green production and lifestyle, in order to promote high-quality economic development through high-level ecological environmental protection. On the other hand, leverage the guiding role of high-quality economic development on ecological environmental benefits. Henan Province should thoroughly implement the new development concepts to facilitate the sustainable transformation of economic development and enhance ecological environmental benefits. Additionally, continuous efforts are needed to strengthen the ecological economy and address ecological issues through market-oriented and industrialized approaches."
]