[
    "With the progress of The Times and the slogan of the risk of the Central Plains getting cloud and cloud, the cities of Henan province have made progress and development to varying degrees in terms of economy, culture, science, and technology However, the development of the cities of Henan Province still needs our attention Through the city's economic resilience city in Henan province was studied by the comparative analysis of the difference of economic resilience, using the data from 2007-2020 by entropy method and spatial autocorrelation method to the analysis of the time and space, to explore the city of Henan province space time evolution process and law of economic resilience, then we can understand the economic resilience. The evolution situation of Henan province of the central plains, the results are as follows: (1) The resistance of urban economy in Henan province shows a stable trend over time and is most not affected by COVID-19 (2) Spatially, the economic resistance of cities in Henan province is concentrated The economic resistance of the cities is generally higher in the north than in the south, and the economic resistance of the cities in the west is generally higher than that of the cities in the east On the whole, the economic resilience of the cities is concentrated in the central cities (3) Economic innovation capacity, including R&D expenditure, technology market turnover and the number of students in colleges and universities, the ratio of actual utilized foreign capital to GDP has a great impact on economic resilience In the future development process, more rational use of foreign capital and the improvement of innovative economic system are needed. Under the background of reform and opening up and economic globalization, China's urbanization and industrialization level have been rapidly improved, China's urban economy has achieved leapfrog growth, and urban development has entered a new era. Urban economy is the foundation and core of urban development and the premise of other aspects of urban construction. However, in recent years, due to the global financial crisis, Sino-US trade frictions, changes in the world pattern, and the outbreak of the global new crown epidemic, urban economic development has experienced certain fluctuations. Under the background that China's economic development enters a new stage and external environmental instability factors persist, identifying the temporal and spatial characteristics of urban economic resilience and seeking effective explanations of economic resilience factors are important issues in urban development research, which provide theoretical basis for strengthening urban economic resilience and improving economic shock coping ability.[1]With the outbreak of COVID-19, the global economic recession and the continuous deterioration of the global environment, China's economy will face more risks and uncertainties in the future, and will also be affected by a Content from this work may be used under the terms of CC BY-NC 4.0 licence (https://creativecommons.org/licenses/by-nc/4.0/). fates Published by Warwick Evans Publishing. wider range and a greater degree. Economic resilience has suffered unprecedented challenges. We need to invest more energy in improving economic resilience. Henan Province is located in the Central Plains and plays an important role in connecting the east, west and north geographically. It is known as \"Jiuzhou hinterland and the thoroughfare of ten provinces.\"Henan economy has an important strategic position in the national economy, and the economic resilience of Henan Province cities is also an important part of the national economic resilience. Since the Central Plains Rising Strategy was put forward in 2003, the economy of Henan Province has received more attention and support, and its economic strength has also stood out in China. How much ability do cities in Henan Province have to resist and redevelop in the face of shocks and risks? Under the current global environment, through the study and analysis of the spatio-temporal evolution of urban economic resilience in Henan Province, it is of great significance to investigate the information of urban economic resilience in Henan Province and to forecast the future of Henan Province for improving the economy of each city in Henan Province, promoting the national economy and consolidating economic resilience. Based on the literature, this paper defines economic resilience as: the ability of urban comprehensive economic system to stabilize itself in the face of external shocks, or to recover or even create new highs after being damaged.Martin(2012) divides the mechanism of economic resilience into four stages from the perspective of adaptability theory. The first stage is the resilience of shock occurrence economic system, which reflects the vulnerability of urban economic system in the face of shocks. The second stage is the ability of self-adjustment and recovery of the economic system after the shock, which is related to the sensitivity of the economic system; the third stage is the ability of the economic system to reorganize its internal structure in order to adapt to the external changes after the self- recovery period, that is, the ability to reorganize, which can enhance the adaptability of the economic system; the fourth stage is the ability of the economic system to create a new development path driven by learning and innovation, and realize the sustainable development of the system.At present, there is no completely unified standard for the international rating system of urban economic resilience. Therefore, this paper will combine the evaluation criteria of urban economic resilience at home and abroad and Martin's research, and divide the evaluation criteria of urban economic resilience into four aspects, namely: economic resilience, economic recovery capacity, economic adjustment capacity and economic innovation capacity. See Table | for details: Set the number of cities to n, set the number of index items to m, and establish a section data matrix: X={Xj}(G=H1, 2, 3...... n, j=l, 2,3...... m, n=18, m=14), X;, The detailed data processing steps are as follows: T, is the data obtained after standardizing the j-th indicator of the i-th city,min (X;; ) is the minimum value of the j-th rating indicator data for different cities, max (Xj ) is the maximum value of the jth rating index data of different cities. The purpose of adding 0.00001 is to avoid the situation that the standardized data is 0 and cannot be calculated.",
    "Second, calculate the ratio of the value of the jth evaluation index of the ith city to the sum of all index values, and the specific formula is: According to formula (3), for a given evaluation index j, the smaller the difference in 7;, the greater the value of €;. When 7; is all equal, ¢;=max=1; The larger the difference in 7; , the smaller the ij ij> difference in €;, and the more the evaluation index affects the comparison between cities. Therefore, the coefficient of difference can be defined as 8;=1-€;. The measurement values of the four sub-target parts can be obtained by weighted average of the quantitative standard values of the evaluation indicators in each part, and the specific calculation formula is as follows: After obtaining the measurement values of each part, the final comprehensive economic toughness value of the whole system is equal to the sum of the measurement values of each sub-target part. The specific calculation formula is as follows: See Table 2 for comprehensive economic resilience values of cities obtained by entropy weight method, from which broken line Figure | can be obtained: According to the data in Table | and Figure 1, it can be observed that the overall economic resilience of each city in Henan Province has not changed much with time. Except Luoyang, Jiaozuo and Kaifeng, the comprehensive economic resilience of other cities basically tends to stabilize. Obviously, in the past fourteen years, the economic toughness of Zhengzhou City has a fault leading advantage in the whole Henan Province, basically maintaining between 0.960 and 0.990, and even reaching the peak in 2020 for 14 years, fully demonstrating that Zhengzhou, as the capital of Henan Province, is the economic center of the whole province. Luoyang ranks second, and Luoyang's economic toughness is second only to Zhengzhou over the years. Fluctuation range of 0.321-0.410, in addition to 2011 almost Jiaozuo catch up, the rest of the time are also ahead of the rest of the city a long distance. Secondly, Jiaozuo in 2014 before the city is also ahead of other cities, but in 2011 decreased year by year to 2014, basically stable at about 0.210. Kaifeng, Pingdingshan, Anyang, Hebi, Xinxiang, Puyang, Xuchang, Luohe, Sanmenxia, Nanyang and Jiyuan basically fluctuate between 0.110 and 0.210, only Kaifeng is lower than 0.110 in 2007, 2009, 2010 and Puyang in the past three years. The last echelon is Shangqiu, Xinyang, Zhoukou and Zhumadian. Except Shangqiu exceeds 0.110 in 2008 and 2019, all fluctuate below 0.110. In addition, Zhoukou's economic toughness is still at the bottom of the province over the years. The economy is relatively backward. The economic resilience capacity values of cities obtained by entropy weight method are shown in broken line figure 2 : As can be seen from Figure 2, the fluctuation of economic resilience of all cities over the years is relatively large, especially Hebi, which increased by 64.12% from 0.076 in 2011 to 0.124 in 2012; Zhengzhou, which increased by 20.74% from 0.188 in 2010 to 0.227 in 2011; Nanyang, which decreased by 38.10% from 0.063 in 2017 to 0.039 in 2018; From 0.107 in 2019 to 0.080 in 2020, Jiaozuo decreased by 25.23%, Luohe and Sanmenxia decreased first and then increased to the same level as before in 2008-2010. Unsurprisingly, Zhengzhou's economic resilience is still far ahead of the whole province. Except Zhengzhou, Jiyuan is ahead of other cities every yea, and Zhoukou is still the lowest level of the whole province. The values of economic recovery capacity of each city obtained by entropy weight method are shown in broken line figure 3: It can be seen Figure 3 that although the economic recovery capacity of each city in Henan Province fluctuates over the years, the overall fluctuation is not large. Only Jiyuan as a whole shows a \"U\"- shaped change trend of decreasing first and then increasing, and Luohe as a whole shows an inverted \"U\"-shaped trend of increasing first and then decreasing. The growth rate and decline rate reached 30.95% and 29.09% respectively. Zhengzhou's economic recovery ability still ranked first in the province, but the gap between other cities and it narrowed. Moreover, the fluctuation of Zhengzhou City in the past 14 years was more violent, and the annual change was more obvious. The economic recovery ability of Jiyuan and Luoyang was similar, ranging from 0.053 to 0.072. Kaifeng, Pingdingshan, Anyang, Hebi, Xinxiang, Jiaozuo, Puyang, Xuchang, Luohe, Sanmenxia, Nanyang, Thirteen cities of Shangqiu and Zhumadian are basically concentrated between 0.011-0.053. Except Luohe reaches 0.055 in 2018 and fluctuates greatly, others are in a relatively stable evolution process. Zhoukou and Xinyang are close, changing below 0.010, representing the lowest level of urban economic recovery ability in Henan Province, but Zhoukou has not reached the bottom for more than half of the time and even increased to 0.011 in 2020.",
    "The values of economic adjustment capacity of each city obtained by entropy weight method are shown in broken line figure 4: From Figure 4, it can be seen that over the years, Zhengzhou and Luoyang's economic adjustment capacity trends tend to be consistent, starting from the highest value in 2007, suddenly reduced to a minimum value in 2008, and then rose sharply the next year. It is worth noting that Puyang's economic adjustment capacity has been increasing year by year, with an obvious upward trend. Especially Jiyuan, which has not changed for more than ten years, is at the lowest level and basically 0; the rest of the cities are also basically fixed in 2007 to 2009 fluctuations, and then has remained stable. Zhengzhou's economic adjustment capacity is still very clear occupied the first place,most of the time exceeded 0.2; closely followed by Luoyang, fluctuations before 0.1-0.15; The remaining cities are not obvious gap, are within 0.5. The values of economic innovation capacity of each city obtained by entropy weight method are shown in broken line figure 5: From Figure 5, it can be seen that over the years, the economic innovation capacity of all cities in Henan Province except Luoyang, Jiaozuo and Kaifeng has not fluctuated strongly, and has been in a relatively stable state. The economic innovation capacity of Luoyang changed weakly before 2013, and suddenly decreased by 40.95% to 0.061 in 2014, and then suddenly increased by 137.87% to 0.145 before it basically stabilized; Jiaozuo, however, suddenly increased from 0.080 in 2010 to 0.186 in 2011, reaching the highest value in fourteen years except Zhengzhou, and then suddenly decreased to 0.094 in the next year, with the largest change range. Kaifeng's economic innovation ability also experienced fluctuations from 0.030 in 2013 to 0.112 in 2014 and then to 0.027 in 2015. There is no doubt that Zhengzhou's economic innovation ability leads other cities in Henan Province with absolute advantages. Luoyang's economic innovation ability has not opened a large gap, but most of them are between 0.1 and 0.15. The economic innovation ability of other cities is lower than 0.1, and most of them remain stable, while Hebi is always at the lowest gradient. After getting the economic toughness of each city in Henan Province at each time point, we should investigate the spatial correlation of economic toughness of each city in Henan Province, so as to better understand the spatial difference and connection of economic development of each city in Henan Province. This paper will select Moran'l to analyze and study this problem. Moran'l is divided into global Moran index and local Moran index. That is, to carry out global autocorrelation and local autocorrelation analysis. The following are the specific steps: First, do global autocorrelation to judge the degree of spatial agglomeration of urban economic resilience in the whole system. The global index tells us whether there is agglomeration or outlier in the space. The calculation formula is as follows: x; and Xj respectively represent the economic resilience values of the i-th and j-th cities; x represents the average economic resilience of each city, S$” represents the variance of economic resilience of each city, and [ W;, ]represents the spatial weight matrix. In this paper, based on literature and relevant knowledge, the commonly used 0-1 matrix is adopted to represent this problem. That is, if two cities have adjacent boundaries, [ W;; ] will be assigned a value of 1; If two cities are separated, W,] will be assigned a value of 0. From Table 3, it can be observed that during the fourteen years from 2007 to 2020, the global Moran index of economic resilience of all cities in Henan Province is greater than 0, the z score is greater than +1.65, and the p value is less than 0.1. Therefore, it can be understood that the economic resilience of all cities in Henan Province has a spatial aggregation phenomenon over the years. In the process of urban development, coordinated progress may occur due to geographical connections, and all cities in Henan Province are located in the Central Plains. With similar historical culture and development concepts, cities will communicate and learn and elements flow between cities, and the integration of cities promotes economic agglomeration.",
    "Second, we do the local autocorrelation and the local Moran exponent tells us where there are outliers or where there are clusters and the formula is: x, and Xj respectively represent the economic resilience values of the i-th and j-th cities; x represents the average economic resilience of each city, S* represents the variance of economic resilience of each city, and [ W,;] represents the weight matrix of neighboring spaces. Stata software is still used for data processing, and Moran scatter plots for 2008, 2012, 2016, and 2020 are randomly selected as shown in Figure 6: The Moran scatter plot in Figure 6 confirms once again that there is spatial aggregation of economic toughness in cities in Henan Province. It can be found that Luoyang has always been in the first quadrant, that is, Luoyang and its nearby cities have high economic toughness; Jiaozuo has always been high, and its own starting time is also high, and then decreases; Zhengzhou has high values at any time, but its surrounding cities are not always high, so it always hovers between H-H and H-L; Kaifeng City, Pingdingshan, Xinxiang , Xuchang, Sanmenxia and Jiyuan are basically in the second quadrant, that is, their own economic toughness is low and the surrounding is high, among which Pingdingshan and Xinxiang hover between the first quadrant and the second quadrant; Anyang , Hebi, Puyang, Xuchang, Luohe, Nanyang, Shangqiu, Xinyang , Zhoukou and Zhumadian always remain in the third quadrant, that is, the economic toughness of Henan Province and their surrounding cities is at a low level. In 14 years, cross-section data are randomly selected for analysis. Due to major events such as the 2008 Beijing Olympic Games and the new crown epidemic at the end of 2019, the data of 2007, 2008, 2012, 2016, 2019 and 2020 are selected to divide the urban economic resilience into four levels: high level, high level, low level and low level. Arcgis software is used to draw their spatial distribution, as shown in Figure 7: From Figure 7, it can be found that Zhengzhou and its surrounding cities have always possessed extremely high economic resilience, constituting the economic center of Henan Province. The economic resilience of cities in Henan Province takes Zhengzhou as the center and spreads around in the form of a network. The economic resilience of border cities is generally low. With the change of time, the cities with high economic resilience in Henan Province are concentrated in the central and western regions, southwest regions and southwest regions. The northwest gradually evolved to move closer to the central and western regions. Zhengzhou has always been the city with high economic resilience, and Luoyang is the only city located at a higher level gradient most of the time, and occasionally there are other cities. Obviously, the economic resilience of the eastern and southern cities has not improved with the advancement of time, and has been at a low level, which is the weakest part of Henan's urban economic resilience. On the whole, the urban economic resilience of Henan Province has no particularly obvious change with the evolution of time. According to entropy weight method, the weight of each evaluation index in each year can be obtained as shown in Table 4: From Table 4, we can know that the weight coefficient of technology market turnover is the highest, all greater than 0.2; the number of students in colleges and universities is next, all greater than 1.138; the ratio of actual foreign capital to GDP and R&D expenditure are next, and the weight coefficient of these evaluation indicators is basically greater than 0.08; The fourth gradient includes, from high to low, the proportion of tertiary industry in GDP, GDP per capita, the proportion of added value of non-public economy in GDP, urbanization rate, the proportion of fixed assets investment in GDP, financial self-sufficiency rate and urban registered unemployment rate, which are basically between 0.03 and 0.08; The last gradient includes the proportion of primary industry in GDP, per capita disposable income of urban residents and urban Engel coefficient, all of which are less than 0.03. To sum up, it can be found that, Zhengzhou City can basically lead other cities with absolute advantages. Zhengzhou, where both industrial and financial undertakings gather. It is precisely because it is a provincial capital city. It is noteworthy that luoyang's performance is equally outstanding, and it is ahead of all other cities except zhengzhou. luoyang, vigorously develops its economy, and its overall economic strength is equally excellent. In addition, jiaozuo is a city with a high degree of industrialization in henan. But the cities in the south of Henan Province, especially Nanyang, and the cities in the north of Henan Province, especially Anyang, have reduced their economic resilience in the process of evolution, and the cities from the east to the south of Henan Province are still at a low level of economic resilience.",
    "Generally speaking, the economic resilience of the cities in Henan Province has not changed dramatically with the change of time. Puyang in the south and northeast is located on the edge, and its economic resilience is backward; the spatial distribution of most cities has not changed much, but the fluctuation of Kaifeng and Anyang is clearly shown. Zhengzhou City, Luoyang, Hebi, Puyang, Xuchang, Luohe, Shangqiu, Xinyang City, Zhoukou City and Zhumadian City keep their aggregation basically unchanged. On the contrary, Jiaozuo, Pingdingshan and Xinxiang have slight changes in spatial aggregation or dispersion, which is not static. But on the whole, the economic toughness of Henan Province is mainly close to the central part. Combined with the full text, there is a big gap in the economic resilience of cities in Henan Province, especially Zhengzhou, which is far ahead of other cities. Combined with geographical location, we can find that the main reason is that a large number of factors of production concentrated in Zhengzhou, although there are individual cities such as Luoyang and Jiaozuo development efforts to Zhengzhou, but there is still a large gap, not to mention other cities. First, overall arrangement and comprehensive development. In future economic planning and construction, Henan Province should not only insist on Zhengzhou as the center, but also expand to the surrounding areas, especially to the south, and strive to reduce the gap between cities. Whether it is commerce or industry, it should reduce the phenomenon of excessive concentration, give full play to the advantages of each city, and promote the development and progress of each industry. Zhengzhou has produced a driving effect and a siphon effect on the surrounding cities by virtue of its superior economy. The goal in the future is to reduce the continuous outflow of production factors from other cities in the process of Zhengzhou leading other cities forward. It not only emphasizes economic synergy, but also needs attention in ecology, society and culture. Cities such as Zhumadian, Xinyang, Zhoukou and Nanyang need us to pay more attention. Combined with the characteristics of each city, we will vigorously develop the most promising industries in the local area, give each city a more accurate positioning, carry forward the strengths of each city, and avoid shortcomings. Most cities in Henan Province are ancient cultural cities with rich historical deposits and natural scenery. Second, strengthen exchanges and optimize industries. Henan's economic center has long been located in the central city dominated by Zhengzhou. Henan's marginal cities are far away from Zhengzhou and have less influence on Zhengzhou. In addition to strengthening the links between cities within Henan Province, more exchanges and communication with neighboring cities in other provinces are needed to promote win-win cooperation. Cities should practice new development concepts, further optimize industrial structures, deepen open reforms, promote the realization of a more efficient market structure, and further promote economic development. Third, we should pay attention to innovation and consolidate the foundation. Through analysis, we know that economic innovation ability has the greatest influence on economic resilience. Therefore, we should vigorously develop scientific research innovation ability, increase investment in R&D funds, strengthen trade activities in technology market, deepen scientific and technological system reform, attach importance to education construction, achieve \"rejuvenating the city through science and education,\" and promote the development of the whole province from point to point. To provide more jobs, optimize population structure, and continuously increase per capita GDP. In terms of economic adjustment, encourage investment to promote capital circulation, strengthen cooperation with domestic and foreign enterprises, absorb more foreign funds outside the province, and rationally utilize foreign capital to achieve its own progress. In terms of economic recovery, optimize the social protection mechanism, strive to achieve comprehensive support for the young and support for the old, increase per capita disposable income, and reduce urban Engel coefficient. Emphasize the leading position of innovation. Other aspects go hand in hand to jointly create stronger economic resilience and achieve high-quality urban development in Henan Province."
]