[
    "1Faculty of Social Science, Arts and Humanities, Lincoln University College, Malaysia. Selangor 47301 2City University Malaysia *Corresponding author: Ajmera Mohan Singh With the acceleration of the aging society, the elderly group has increasingly become the focus of social attention. As the capital city of Henan Province, the aging situation of Zhengzhou not only has distinct regional characteristics, but also reflects the general trend of the aging society in our country to a certain extent. The elderly are an indispensable part of the society, and their cultural needs and living conditions are not only related to personal well-being, but also an important yardstick to measure the development level of the public cultural service system and the practical ability of people-oriented thought in the field of public service. At the same time, with the improvement of residents' pension level, the elderly's demand for cultural consumption has gradually increased. The cultural needs of the elderly group are unique and diverse, and the construction of public cultural space aiming at the needs of the elderly has broad market prospects. On this basis, the research focuses on the strategy research of new public cultural space under the background of aging, and gradually solves the problem of new public cultural space in the current development of aging cities from thought to theory to practice. It provides a more convenient and comfortable lifestyle for the elderly in public cultural space activities. From the perspective of narrow cultural category, the concept of \"cultural space\" refers to the public cultural places in the city represented by museums, cultural centers, art galleries and libraries, which have clear functional positioning. However, with the changes of The Times, a new type of public cultural space has emerged, which breaks through the traditional definition and restrictions, and is no longer limited to a specific form of business. The new public cultural space brings together a variety of functional forms such as exhibition, art, reading, and catering, highlighting humanity and publicity, and emphasizing the participation of different audience groups. Through new construction methods and operation mechanisms, new spatial functions, new humanistic connotations and new audience participation, we will create a diversified new public cultural space. With the coming of the aging society, the demand of the elderly for public cultural space is also increasing. Public cultural space has not only become an important place for the elderly to socialize, entertain and learn, but also a key factor in improving their quality of life. Therefore, based on the rapid development of aging, the pension service system in our country is not mature, and the economic development and the number of elderly groups increase day by day, this paper puts forward the study of public cultural space strategies from the perspective of aging. The project is committed to exploring how to effectively meet the cultural needs of the elderly in an aging society by optimizing public cultural space, improve their quality of life and happiness, and then stimulate the cultural vitality of the city, laying a solid foundation for the sustainable development of the city. Under these realistic background, it is of great practical significance to explore the new paradigm of public cultural space in Zhengzhou. It will not only help to promote the optimization and upgrading of community public cultural space, meet the cultural needs of the elderly, but also provide a scientific basis for the planning and community management of new public cultural space in Zhengzhou, and promote the harmonious development of society. Zhengzhou City in Henan Province is constantly exploring innovation in the construction of public cultural service system, actively promoting the construction of new public cultural space, and providing citizens with a richer and more diversified cultural experience. Zhengzhou City has made a series of remarkable achievements in the construction of public cultural facilities. However, due to a variety of constraints, including the level of economic development, traffic network and population distribution pattern, public cultural space in Zhengzhou still presents certain limitations. The spatial distribution shows a pattern of dense in the middle and sparse in the edges. From the layout of public facilities in each administrative district, it is not difficult to see that it is consistent with the overall layout, showing a centralized state in the center of the administrative district and scattered distribution of peripheral facilities.",
    "The uneven development of various regions in Zhengzhou has a certain impact on the development of public space suitable for the elderly, showing a development trend of alienation from business trips. This imbalance directly leads to the imperfect construction of infrastructure, and then leads to the shortage of public cultural facilities in quantity and scale limitations, making it difficult to give full play to the basic function of improving residents' cultural quality. Specifically, the main problem faced by the elderly in the pursuit of cultural and recreational activities is the serious shortage of suitable venues for the elderly activities, resulting in their having to compete for limited public space; As well as the lack of order and planning in the organization of cultural activities, it affects the participation experience and effect of the elderly. Therefore, in order to solve the contradiction between supply and demand, it is necessary for Zhengzhou to further improve the public cultural service system, improve service quality, increase service types, and rationally plan activity venues according to the characteristics of the elderly group, so as to ensure that the elderly can enjoy a rich cultural life in an orderly and harmonious environment. At present, there is no specific aging standard for urban public space. The aging adaptability of public cultural and sports facilities and venues should be the focus of the aging adaptability of urban public Spaces. Nowadays, the efficiency of barrier-free or aging adaptability transformation of public sports and fitness venues or facilities is too low, and the coverage is too narrow, which leads to certain security risks in some public Spaces [1]. There are gaps in the guiding practice and quality assessment of age-appropriate renovation, and the age- appropriate applicability and safety of facilities and sites cannot be guaranteed. In terms of public cultural services, especially for the elderly, there is a problem of relatively single form of activities. The current cultural endowment activities cannot meet the diversified needs of the elderly in terms of types, forms and contents. The existing cultural activities are mainly singing, dancing, chess and so on, which have relatively low requirements for objective conditions. However, as the literacy level of the elderly population continues to improve, their needs for cultural activities are also changing. More and more elderly people are eager to participate in more professional and elegant activities, such as painting, playing the piano, calligraphy and so on. These activities can not only enrich their spiritual and cultural life, but also help improve their quality of life [2]. In addition, for the elderly, a special and increasingly large social group, the provision of psychological counseling services is particularly scarce. Older people often face multiple life challenges such as changing roles after retirement, fluctuating health conditions and changes in family structure. These complex life changes often lead to various psychological problems. And then hinder the formation of a positive and healthy pension mentality. Aiming at the problem of poor expression channels for the needs of the elderly, it is found through investigation that the elderly are relatively weak in actively seeking the cultural and sports space required by the government or society. Although some elderly people will report their needs for public cultural services to the neighborhood committee or street office, more elderly people do not know how to express their demands. After receiving the information, the processing and feedback efficiency of the neighborhood committee or street office is also low. In addition, the effective transmission of elderly care service information is crucial. At present, the elderly have difficulties in adapting to the intelligent era, and the lack of age-appropriate design on online platforms will affect the service effect. With the increase of age, the physiological characteristics of the human body gradually change. These changes are particularly significant in the elderly stage, and have a certain impact on their daily life. For example, the deterioration of the motor system, the deterioration of the sensory ability, the degeneration of the nervous system, the degeneration of these functions leads to the decline of the flexibility of the limbs and bodies of the elderly, and the action becomes slow; Slow response, reduced thinking ability and memory and willpower decline, resulting in the elderly's ability to weaken the cognition of space and environment, so it becomes more and more difficult to adapt to the new environment, accustomed to staying in the old environment that makes them feel familiar and comfortable.",
    "Physiological degradation leads to changes in the physiological needs of elderly groups. First of all, safety needs are more sensitive to unsafe factors in the environment in the case of declining physical functions. All these factors will make elderly people have higher requirements for public cultural space. In the design of public cultural space, reasonable planning and design should be made for the size and material of ramps, steps and footpaths, etc. At the same time, how to organize traffic flow lines should be considered to ensure the walking safety of the elderly [3]. Secondly, convenience needs, with the decline of physical strength and function, the distance that the elderly can walk to is small, so the space for activities of the elderly should be as close as possible to their homes. Moreover, comfort needs and the particularity of the physiological state of the elderly lead to their sensitivity to temperature and light environment, and conditions such as too cold and too hot and dazzling light are common factors causing the discomfort of the elderly. Therefore, when designing the cultural space for public activities, attention should be paid to the combination of environment and climate. That is, to provide the rest of the static space for the elderly should also provide the exercise space for the elderly activities, and on this basis for the setting of landscape greening, rich plants can increase the oxygen content in the place and make the elderly physical and mental pleasure, with the gradual improvement of material conditions, spiritual needs are also improving. With the changes of physiological characteristics and needs, the psychological state of the elderly shows significant changes. These changes do not exist in isolation, but are closely related to the physiological aging process. First, retirement or leaving the workforce shifts older people from the role of workers to the role of dependents. This shift can lead to a huge drop off on a psychological level. The focus of life and activities shifted from society to the family. This change of role often leads to the breakdown of the old people's original psychological balance, which is easy to cause a sense of loss. Then there is the generation of loneliness: due to the characteristics of the current Chinese family structure, many children have no time to accompany the elderly, resulting in greatly reduced communication opportunities with the elderly. Lack of companionship and care from children for a long time makes some elderly people feel lonely, which becomes a common psychological characteristic of them [4]. Moreover, the accumulation of depression: with the decline of physical function, the immune system function of the elderly is reduced, and the risk of disease is increased. This not only affects their physical health, but also has a negative impact on their mentality. Many older people gradually lose their positive attitude. Finally, the emergence of feelings of inferiority: Many older people face challenges in life due to the decline of physical functions and the change of social roles [5]. For example, they may become forgetful during household chores or experience difficulties in caring for grandchildren. These small setbacks may trigger their sense of self-blame, and the accumulation and psychological pressure over a long period of time may eventually lead to feelings of inferiority in the elderly. These psychological characteristics of the elderly will be accompanied by certain psychological needs, these needs are not single, but diversified and complicated. For example, the need for a sense of belonging: Older people often desire to participate in group activities or integrate with others, rather than being marginalized by physical aging. They want to be respected and recognized in group activities or interactions with others. The need for neighborhood interaction should encourage rich neighborhood interaction activities to eliminate the loneliness of the elderly. Greatly enrich the daily life of the elderly. Privacy needs: The elderly have a great demand for personal space. When their privacy is violated, the elderly will feel insecure psychologically and cause mental discomfort. Dependency needs are mainly reflected in the elderly's dependence on the space environment and on trusted people [6]. The dependence on the spatial environment is manifested by the elderly's dependence on the long- term living environment and the sense of belonging provided by familiar places. In view of the diverse psychological needs of the elderly group, it is necessary to pay attention and efforts of the family and the society to create a happy aging environment for the elderly.",
    "As an important part of the society, the aged group's physiological and psychological characteristics determine their use of public cultural space to a large extent. With the growth of age, the physical function of the elderly is gradually declining, and the psychological needs are also increasingly rich, which makes them display unique characteristics in the selection and use of public cultural space. As the elderly are less mobile, they pay more attention to the convenience of cultural space. This includes transportation accessibility, spatial layout rationality and accessibility of facilities. The survey found that the scope of activities of the elderly was mostly limited to the neighborhood, and they were more inclined to choose the cultural space within walking distance. For the maximum walking time to reach the public cultural space in the community, especially the physical exercise space, the elderly generally accepted range is less than 15 minutes. Once the travel time is too long, or the space is too remote, the use of these Spaces will drop dramatically. In addition, due to the different construction times of communities and the uneven distribution of public cultural space, the layout forms of cultural and sports facilities or venues for the elderly also show diversity. Some community facilities are centralized, so that the elderly can enjoy a variety of one-stop services; other communities have scattered facilities that require the elderly to move around. However, regardless of the layout, once these facilities are far away from residential areas, travel costs increase for the elderly, who tend to abandon or reduce the use of these Spaces due to inconvenience. Therefore, convenient transportation and barrier-free facilities have become important factors for the elderly to choose cultural Spaces. These facilities not only reduce their travel costs, but also increase their motivation to use cultural Spaces. The use time of public cultural space by the elderly shows obvious regularity. Morning and evening are the peak activities of the elderly, which is related to the elderly's work and rest habits and physical conditions. They are more likely to do outdoor activities when the light is good and the climate is suitable. Usually choose these times for morning exercise, walking, chatting and other activities. While noon and afternoon are relatively calm, the elderly are more inclined to rest at home or carry out personal interests and hobbies. When the elderly use the public cultural space, they have a high demand for time flexibility. They want to be able to do their activities at a time that is convenient for them, rather than being limited by a fixed time. Therefore, the public cultural space should provide flexible time arrangements to facilitate the participation of the elderly at any time. The activities of the elderly in the cultural space have a certain spatial dependence. They are more likely to choose familiar, comfortable and safe Spaces for activities. This spatial dependence reflects the elderly's psychological identity and sense of belonging to cultural space [7]. Pay attention to the environment design of cultural space and cultural atmosphere to enhance the sense of belonging and identity of the elderly. Through the design of spatial elements with regional characteristics and cultural connotations, the cultural identity and pride of the elderly are enhanced. The elderly have diverse needs for activities in public cultural space, including personal interests such as fitness, cultural entertainment, etc. The elderly have diverse needs in cultural space, including fitness, cultural entertainment, learning and communication, personal interests, and emotional sustentation, as well as social participation activities such as social interaction and volunteer service. For example, in terms of fitness, the elderly are keen on tai chi, square dance, yoga and other low-intensity, high-interest activities. These activities not only help them exercise and strengthen their physique, but also allow them to make new friends and expand their social circle during sports. In terms of culture and entertainment, the elderly like to participate in calligraphy, painting, music, dance and other artistic activities. These activities not only enrich their spiritual life, but also let them feel the charm and fun of art in practice. Older people are also keen to participate in a variety of social interaction and intellectual learning activities. They enjoy attending lectures, seminars, book clubs and other activities to broaden their horizons and broaden their knowledge. These activities not only let the elderly maintain their enthusiasm for learning, but also let them gain a sense of accomplishment and satisfaction in the communication.",
    "The diversity of public cultural space activities of the elderly groups makes them hope that cultural space can provide diversified activity facilities and services to meet the needs of different levels and different interests. These activities not only meet the spiritual needs of the elderly, but also promote their healthy physical and mental development. Therefore, public cultural space should provide a variety of activities and facilities, through the holding of lectures, exhibitions, performances and other activities, to enrich the cultural life of the elderly, promote their physical and mental health development. The Third Plenary Session of the 20th CPC Central Committee deliberated and adopted the Decision of the CPC Central Committee on Further Comprehensively Deepening Reform and Promoting Chinese-style Modernization, which clearly stated that it is necessary to establish a mechanism for high-quality cultural resources to reach the grassroots level. At the same time, we are required to focus on the two keywords of \"quality\" and \"direct access\" to do a good job in system design, encourage urban communities, urban renewal actions, and construction opportunities such as \"a quarter of an hour for the convenience of the people's living circle\", and effectively increase the efforts to provide high-quality cultural public products for the grassroots and special groups. In this context, the exploration and practice of Guizhou in the construction of public cultural service system undoubtedly provides us with a worthy example. Guizhou is committed to creating high-quality public cultural services that can be enjoyed \"at home\", and realizing the convenient experience of \"15 minutes walking outside, there are books to read, lectures to listen to, and cultural activities to participate in\". Let more and more people have access to books, lectures and cultural activities at their doorsteps. This initiative has not only greatly enriched the spiritual and cultural life of the masses, but also demonstrated the late-comer advantage of Guizhou in the construction of public cultural service system. The successful experience of Guizhou province lies in its perfect public cultural service system and the mechanism of high-quality cultural resources reaching the grassroots level, which has also enhanced the sense of gain and happiness of the masses. Inspired by this experience, combined with the current situation of public cultural space in Zhengzhou, the unique psychological and physiological characteristics of the elderly group, and their characteristics in the use of public cultural space, in the construction of new public cultural space, with the community as the fulcrum, the construction of small but fine cultural center, radiation and drive the cultural development of the surrounding area, forming a good effect of \"point with surface\". These cultural centers can combine reading, lectures and entertainment activities. At the same time, by gradually expanding the coverage of cultural services in a multidimensional way, so that more elderly people can enjoy high-quality cultural services. In the use of public cultural space, the elderly group shows unique characteristics of convenience, time domain, space dependence and diverse activities. They tend to choose cultural places with close distance and convenient transportation, and their activity time is relatively fixed, and they have a strong dependence on and belonging to a specific space. At the same time, their needs for cultural activities are diverse, covering reading, lectures, leisure and entertainment. In view of these characteristics of the elderly group, the fulcrum function of the community can be improved and amplified, and a representative community public space for the aged can be selected as a \"point\" to form a demonstration effect through in-depth analysis and transformation. In turn, the successful experience will be promoted to the whole city or a wider region to achieve a comprehensive improvement in the \"surface\". This strategy aims to improve and amplify the fulcrum role of the community, promote the overall progress of the construction of public space for the elderly, and provide a more comfortable environment for the elderly. At the same time, these community-type cultural centers should integrate reading, lectures, cultural activities and other functions to provide a comfortable, convenient and fully functional cultural activity place for the elderly. Relying on the existing resources of the community, including the renovation and opening of the old activity places, the aim is to provide a safe and suitable environment to meet the diversified activity needs of the elderly [8]. On this basis, we have actively developed various forms of activities, these activities not only significantly promote the physical and mental health of the elderly, but also greatly enrich the cultural connotation of the community, and successfully create a strong cultural atmosphere for the elderly. Such as reading club, health talk, handicraft display, etc., to attract the active participation of the elderly in the surrounding area. These activities can not only enrich the spiritual life of the elderly, but also promote communication and interaction within the community, and can also form a good effect of \"point with face\". At the same time, by gradually expanding the coverage of cultural services, more elderly people can enjoy high-quality cultural services, and promote the cultural prosperity of the whole city.",
    "The concept of active aging is deeply integrated into the public service system, which constitutes the core element of promoting the construction process of urban public cultural space suitable for aging. The core of this concept is that it emphasizes the subjectivity and initiative of the elderly in social life, advocating that the elderly are not only the object of social care, but also actively participate in and contribute to the valuable force of society. The concept of active aging abandons the traditional perspective that regards the elderly as a vulnerable group in need of care [9]. It encourages the elderly to maintain vitality, continue to play an important role in social life, and realize the double improvement of self-value and social value. Under the guidance of this concept, the planning and design of urban public cultural Spaces can be more accurately focused on the actual needs and preferences of the elderly. Through meticulous planning and humanized design, the public cultural space can better adapt to the physical function and psychological characteristics of the elderly, so as to provide them with more comfortable and convenient service experience. This change not only helps to improve the quality of life of the elderly, but also promotes social harmony and inclusiveness at a broader level, laying a solid foundation for building an age-friendly society. In order to carry out the aging construction of urban public space smoothly, it is necessary to create the aging atmosphere of the whole society. This requires the government, society, the market and individuals to enhance the awareness of old-age services, from policy formulation, resource allocation to daily services, to fully consider the needs and interests of the elderly. Through extensive publicity and education, the traditional social cognition and attitude toward the elderly are gradually changed, and a more active and proactive service style for the elderly is formed. To establish a correct sense of old-age service is the premise of improving the quality and efficiency of the old-age service system. It is necessary to fundamentally change the traditional cognition and attitude towards the elderly, from a negative and passive perspective to a positive and active attitude. This requires that we fully recognize the great value of the elderly to society, and recognize and respect their due rights, including the rights and interests of education, social interaction, culture and entertainment. At the same time, more attention should be paid to the endogenous potential of older people, that is, their knowledge, experience, skills and wisdom, which are valuable resources for social development. By effectively stimulating and guiding the release of these potentials, we can not only create more opportunities for the elderly to realize their self-worth, but also inject new vitality and impetus into the progress and development of society. In order to ensure the accurate collection of the effective supply and demand of the elderly public space, it is necessary to optimize the existing communication channels. The realization of this goal requires that in the process of information transmission, we should not only consider the publicity and popularization of the supply of public space for the elderly at the social level, but also pay attention to the true expression of relevant needs of the elderly population. It is necessary to play the role of organizational platforms such as neighborhood committees and street offices, strengthen the notification and publicity of elderly groups, and ensure that elderly people have a basic understanding of relevant facilities. In addition, we also need to work to improve the degree of aging of the information platform, so that it is more in line with the use of the elderly, so as to more effectively deliver information. This requires us not only to make improvements at the technical level, such as designing an easy-to-operate interface and friendly interaction, but also to provide information services specifically for the elderly, such as setting up a special information channel for the elderly and collecting information on cultural and sports services concerned by the elderly. In practice, we can provide free registration and borrowing services for the elderly by setting up a service window for the elderly or equipped with special service personnel, so as to alleviate their troubles when using the information platform. This service can not only improve the efficiency of information acquisition for the elderly, but also enable them to enjoy a more convenient service experience.",
    "In order to ensure the accuracy of public cultural space services for the elderly, the primary concern is the difference of physical health status and regional characteristics of the elderly in different ages. It is necessary to deeply understand the physical condition of the elderly group, and accordingly design the elderly public space that meets the actual needs of different age groups. In addition, when providing services, the community should provide targeted public cultural services for the elderly in combination with the economic situation of each region and the specific needs of the elderly groups. So as to realize the accuracy of service supply. The supply of public cultural space cannot rely solely on the government, which will increase the work burden of the government and may lead to inefficient use of resources. In order to realize the efficient supply of public cultural space, it is necessary to promote more social forces to participate in the supply of public facilities for the elderly. This can not only share the work burden of the government, but also effectively integrate and use various social resources, so as to better meet the cultural needs of the elderly. With the rapid development of the aging society, the government is faced with great challenges in providing high level and high quality public cultural and sports services. Therefore, we should encourage, improve and strengthen the participation of non-governmental organizations and other social forces in the construction. Non-governmental organizations, such as the Association of elderly organizations and the Sports Association for the elderly, have significant voluntary characteristics compared with market institutions. This feature enables them to collect information about the needs of the elderly more effectively, so as to provide public cultural services that are more suitable for the actual needs of the elderly. At the same time, ngos can also increase the power of supervision and evaluation to a certain extent to ensure the continuous improvement of service quality. On the other hand, these organizations are able to fully take into account the special needs of the elderly group and reflect them in specific services. For example, by organizing the elderly to participate in various sports and fitness exchange activities, ngos not only provide a platform for the elderly to show themselves, but also lead more elderly people to join the team of cultural activities for the elderly, forming a good cultural atmosphere. Taking Zhengzhou City as an example, cultural and sports organizations for the elderly can be actively established, and the power of these organizations can be used to broaden the channels of service supply for the elderly, and further improve the quality and connotation of public cultural services for the elderly. In order to give full play to the diverse role of non-governmental organizations in the construction of public cultural space for the elderly, the government should give more policy support and financial support. At the same time, the guidance and management of ngos should be strengthened to ensure the standardization and effectiveness of their service activities. Through close cooperation between the government and non-governmental organizations, we will jointly promote the prosperity and development of public cultural services for the elderly and create a better living environment for the elderly. Under the social background of the increasing aging trend, the construction and transformation of the new public cultural space in Zhengzhou, as the core city of the Central Plains, is particularly important and complicated. In this process, we must fully consider the actual needs of the elderly groups, rely on the community as a key fulcrum, and constantly improve and enlarge the basic role of the community in cultural services, so as to build a \"point to face\" all- round cultural services pattern. On the other hand, it is necessary to reshape the concept of old- age services, the core of which is to emphasize the main status of the elderly in social life and its positive contribution. In order to achieve this goal, it is necessary to further optimize the existing communication channels, build a service platform for elderly groups, and ensure that elderly people can truly and effectively express their cultural service needs, so as to improve the pertinency and effectiveness of services. In addition, Zhengzhou should also strive to enhance the pluralistic supply capacity of ngos. We will deepen the participation of social forces and guide social organizations, enterprises and volunteers"
]