[
    "Using the integration strategy of cultural tourism and cultural creation as the entry point, this paper aims to preserve innovation and external communication of intangible cultural heritage in Henan Province, China. It does this by combining the intangible cultural heritage with the Henan Province's cultural tourism and cultural creation industries and examines the present state of inheritance innovation and external communication of intangible cultural heritage in the form of \"culture+,\" \"tourism+,\" \"internet+,\" and other forms.It also looks at how inheritance innovation, publicity, and promotion of intangible heritage have been updated to promote the protection and expansion of this kind of cultural asset while also enabling a broader public understanding of intangible cultural heritage in Henan Province. The geographical differences between industries have steadily been blurred by economic growth and technological advancement, and the driving force of integrated development has been shown. The integration of the tourist and cultural sectors constitutes one example.The \"integration of culture and tourism\" has emerged as the most fundamental tactic and market consensus in the process of policy regulation, industry transformation, and project innovation in China's culture and tourism industry since the 2018 merger and restructuring of the National Tourism Administration and the previous Ministry of Culture. Xi Jinping, the general secretary, noted thatthe cultural industry and the tourism industry are inseparable, and we should insist on shaping tourism with culture and emphasizing culture with tourism, and promote the integrated development of culture and tourism”.1 In addition to expanding the area for each of their growth, the combined development of the two encourages the mutual penetration of culture and tourism, both are being advanced simultaneously.In this context, Henan Provincial Party Committee in 2021 put forward the “strategy of integrated development of culture, tourism, culture, and creativity”. Combining intangible cultural heritage with the tourist sector is a powerful approach for it to adapt to the current context and encourage its spread as a living cultural legacy.The land and water support each intangible cultural asset, which vividly conveys the people's cultural heritage, unique spiritual values, way of thinking, imagination, and cultural consciousness. As one of the birthplaces of Chinese civilization, an essential historical axis for the transmission and advancement of Chinese culture is Henan Province. Because of its long history and unique culture, it has formed characteristic intangible cultural heritages, such as Luoyang Tang Sancai, Zhuxianzhen woodblock prints, Shaolin Kungfu, Huaiyang mud dogs, Huixian paper-cutting, Nanyang jade carving, etc. One crucial strategy to encourage its spread is the merging of culture, tourism, and cultural production. The development of human civilization is demonstrated by intangible cultural heritage, which also keeps the record of human history intact for millennia, serves as a vital conduit for traditional culture, is the creative expression of national wisdom, and brings together the labor and knowledge of people from one generation to the next. Even though it represents national culture, intangible cultural heritage has steadily lost favor with the passage of time and environmental changes. As a result, it has to be effectively promoted and distributed today. There are currently 1,372 items and 3,145 sub-items in the list of intangible cultural heritage maintained by the Chinese government; 42 of these artifacts are listed as intangible cultural heritage by UNESCO, making it the country with the most inscribed items worldwide. The 3,145 sub-items on China's list of intangible cultural treasures fall into 10 main categories, which include performing arts, traditional activities, manual skills, and other areas. The broad assortment and many classifications of the intangible cultural heritage of China attest to its rich history and boundless allure.2 The sharing, passing down, and conservation of intangible cultural resources have long been top priorities for the Chinese government at the national level. To enhance the growth of the outstanding traditional culture of every person, The Fourteenth Five-Year Plan Outline specifically suggests the comprehensive carrying out of the task for the transmission and advancement of outstanding Chinese traditional culture in addition to the strengthening of the systematic safeguarding of the intangible cultural legacy. Because of this, figuring out how to overcome the \"dissemination of intangible cultural heritage\" has evolved into a difficult assignment for cultural development; the problem of how to transcend the special space of history so that more people recognize, accept, and cherish the intangible cultural legacy that has to be given careful thought during the dissemination process.",
    "Looking around the world, for the preservation, distribution, and exchange of cultural heritage are intangible initiatives among nations, UNESCO has created the Intangible Cultural Heritage List. Along with promoting the dissemination of China's intangible cultural assets, this also facilitates communication and exchange with other intangible cultural heritage of the country, adds to the sustainability of cultural heritage that is not tangible, and advances the development and prosperity of human civilization. 2.0 THE INNOVATION AS WELL AS THE INHERITANCE OF HENAN PROVINCE'S CULTURAL HERITAGE THAT IS INTANGIBLE, AS WELL AS ITS DISTRIBUTION TO THE OUTSIDE WORLD, HAVE OPENED UP NEW OPPORTUNITIES AS PART OF THE INTEGRATION STRATEGY OF TRAVELING FOR CULTURAL REASONS AND CULTURAL PRODUCTION New technology promotes the development of a culture-based knowledge economy, The \"culture +,\" \"tourism +,\" \"Internet +,\" and other creative and cultural sectors have grown quickly, and the combination of culture and tourism has become a trend that cannot be avoided. Intangible cultural heritage projects, all kinds of outstanding traditional culture have great tourism development value, suitable for different types of tourism projects, such as scenic spots and traditional culture combined with live performances - only Henan - theater illusion city, the project is the depth of the fusion of technological innovation, science, and culture, which breaks through the spatial dimensions of history, to the way of the characters to show the broad range of culture of the Central Plains. The project combines technology and culture in a way that transcends the history's geographical dimension and demonstrates the diverse culture in the Central Plains through character group portraits, giving the audience a more objective understanding of Henan, which is crucial for boosting the region's growth and establishing the cultural confidence of the Henan people;the murals that are moving in the Sui and Tang dynasties in the city of Luoyang and the ruins that are alive allow the tourists to intuitively touch the history; and the large-scale live performance of the “Zen Shaolin Musical Ceremony” has a stunning effect, which makes the tourists from China and foreign countries The large-scale live performance “Zen Shaolin Music Ceremony” has a shocking effect, making Chinese and foreign tourists all have a deep impression of “Shaolin Kungfu”, and these live performances have greatly enhanced the attention of Henan Province in the international arena. In recent years, to create a strong internal drive for the expansion of the creative and cultural sectors, projects related to the inheritance and maintenance of intangible cultural resources have been given top attention in Henan Province. This has been done in conjunction with the growth of the tourism and cultural industries. After years of efforts, Henan Province's efforts to preserve its intangible cultural assets have yielded some successes, but there are still some problems: Agricultural society gave the development of intangible cultural heritage. As contemporary society has evolved and people's lifestyles and ideologies have changed, the original environment for intangible cultural heritage has also changed significantly, leaving many projects without successors and their audiences shrinking. In addition to Henan Province's Intangible Cultural Heritage Center and a few more cities and counties, although many places in the province have set up Institutions that safeguard intangible cultural heritage, they only add a piece of “Intangible Cultural Heritage Center” to the original art museum or cultural center, and the staff of immaterial cultural treasures continue to work part-time at the original venues, and there is a lack of systematic training and learning, which makes it difficult to promote the work. 3.3 Inadequate planning for the development of intangible cultural heritage and a lack of creativity in artistic and cultural goods Nowadays, some intangible cultural heritage cultural creations appear on the market with serious homogenization and lack of overall planning, such as embroidery, Tang Sancai, etc. Even some merchants make inferior products for the sake of profit, which seriously affects the external influence of intangible cultural heritage. Although a few elements of intangible cultural heritage can be industrialized, which include jade carving, Jun porcelain, and Tang Sancai, due to the short-sightedness of some operators, resulting in poor product quality, lack of aesthetic quality, and the phenomenon of homogenization is serious. Intangible cultural heritage products are of various categories, even if the same category has many producers and craftsmen, the industry mostly stays in the stage of individualization and fragmentation, and there is a lack of overall development and dissemination planning.",
    "Known as the \"underground cultural relics of the country's first, above ground cultural relics of the country's second,\" Henan is the birthplace of the Chinese people, the source of the nation, the dignity of the ancient capital, the text of the foundation, the stem of culture, and it boasts a wealth of resources and a lengthy history.3Henan has established a solid cultural basis for the transmission and advancement of intangible cultural treasures, which is situated in the central plains, and widely recognized historical and cultural cities like Kaifeng, the former capital of nine dynasties, and Luoyang, the earlier beans capital of thirteen.There are four ancient capitals—Luoyang, Zhengzhou, Kaifeng, and Anyang—eight national historical and cultural cities, five world cultural heritages, 113 national intangible cultural heritages, and 420 key cultural relic protection units in the Central Plains, which is home to the Fuxi Taihao Mausoleum, the Yellow Emperor's hometown, the Grand Canal, the Silk Road, and other key landmarks of Chinese civilization. The genealogy of the origin and inheritance of Chinese culture has been fully preserved in the region. With 420 national significant cultural relics protection units, 113 national intangible cultural heritages, five world cultural heritages, and eight historical and cultural cities across the country, It is the center for the exhibition and transmission of classical Chinese culture and creative thinking, and it is a significant area for the innovation and transmission of the historical civilization of the Chinese Summer. It is also the region with the highest quality cultural resources in the country if not the entire world.4It is possible to both successfully safeguard intangible cultural assets and grow the local cultural tourism business by using its distinctiveness and culture to propel local tourism. As one of the ten primary approaches anchored by the \"two guarantees,\" the 11th Henan Province Party Congress encourages the development of the plan of bringing together culture, tourism, culture, and creativity, emphasizing the need to develop full-chain culture and tourism businesses with rich characteristics, to grow the cultural industry with creativity at its core, and to establish Henan Province as a hub for Chinese cultural innovation and inheritance, and a global destination for tourism and culture. Strengthening the local intangible cultural heritage culture's feeling of identity, increasing public awareness of the entire society, and continuously improving people's initiative to inherit and protect intangible heritage are all necessary for effective intangible cultural heritage inheritance. More individuals will be inspired to participate in the preservation, advancement, and development of intangible cultural assets as a result. To combine intangible cultural heritage with education, focus on the educational attributes carried by the tourism industry, explore the educational value of intangible cultural heritage, and try to develop the study travel and tourism sector, for more children and young people to be taught by the wonderful culture by bringing the intangible cultural heritage to the university campus. Meanwhile, “museums”, “intangible cultural heritage venues”, and “cultural centers” these other locations may be utilized to spread awareness of and provide education about intangible cultural heritage. Due to its unique geographical environment, Henan has a significant quantity of different types of intangible cultural heritage projects and sources for travel, which has the benefit of the growth of “intangible cultural heritage + scenic spots”.The intangible cultural treasures and traditional cultural resources of Henan Province may be integrated and optimized, and regional cooperation can be strengthened, innovate the expressions of different heritages, and fully display their cultural elements. Branding cultural and creative products is essential for the continuous preservation and distribution of intangible cultural heritage, and it also plays a significant role in the ongoing growth of the cultural and creative industries and intangible cultural heritage projects. For example, some of the best cultural and creative brands nowadays are Beijing's “Forbidden City Cultural and Creative Products”, Luoyang's “Boli Cultural and Creative Products”, Xi'an's“City Wall Gifts”, Chengdu's “Panda Post Office”, etc. Extend the meaning of intangible cultural heritage initiatives and picturesque locations to provide visitors with a more authentic experience, such as Qingming Shangheyuan to build a theme park of intangible cultural heritage, the intangible cultural heritage of folklore, fine arts, music, dance, opera, acrobatics, and handicrafts and so on, integrated. In addition to that, folkloric intangible cultural heritage can also be paired with the advantages of customary Chinese holidays, such as the Spring Festival, Dragon Boat Festival, Mid-Autumn Festival, the traditional twenty-four seasons, and other traditional festivals to carry out cultural promotion.",
    "Nowadays, the cultural tourism industry is being covered by data as it integrates and develops with the Internet, big data, and artificial intelligence synergistically. Henan intangible cultural heritage external communication can take advantage of the Internet, integrate online and offline resources to realize digital intangible cultural heritage tourism; create more sensory experiences through VR, AR, and other technologies; combine paper media and new media; and use the trendy short video and live broadcasting to enhance the creative presentation and contagious power of intangible cultural heritage and enable people to comprehend it more naturally. Conclusion: With the integration strategy of culture, tourism, and cultural creation, it is essential to safeguard and publicize the intangible cultural heritage of Henan through the means of “culture + tourism + science and technology” by combining the cultural characteristics of Henan Province, and to carry out reforms and innovations under the premise of preserving and passing on the cultural assets of local characteristics. In addition to being the most effective way to safeguard intangible cultural assets, it is also a vital step in transforming Henan from a huge cultural province into a strong one and in influencing the province's reputation for tourism and cultural intellectual property both domestically and internationally."
]