[
    "This study examines the competencies of tennis coaches and the coaching preferences of collegiate athletes in Henan Province, China. Drawing on a quantitative research design, the study aims to assess the relationship between coaches' professional competencies and their demographic characteristics, as well as the alignment between these competencies and athletes' coaching preferences. A survey instrument was administered to tennis coaches and student-athletes from five universities in Henan Province. The results reveal key strengths and areas for improvement in tennis coaching, and identify athlete preferences that can inform coach education and training programs. The findings have implications for enhancing coaching quality, athlete development, and the overall effectiveness of tennis programs in higher education. Tennis, as a popular sport in higher education institutions, plays a vital role in promoting physical fitness, teamwork, and sportsmanship among students. In recent years, there has been a growing recognition of the importance of tennis coaches' competencies in shaping athletes' performance, motivation, and overall satisfaction. However, limited research exists on the comprehensive assessment of tennis coaches' professional abilities and how these align with athletes' coaching preferences, particularly in the context of Chinese universities. The present study aims to fill this gap by exploring tennis coaches' competencies and athletes' coaching preferences in selected higher education institutions in Henan Province, China. By doing so, this research seeks to provide insights into the current state of tennis coaching in the region and offer recommendations for enhancing coaching quality and student outcomes. Tennis coaching is a complex and multifaceted profession that requires a blend of technical, tactical, and interpersonal skills. Coaches are responsible for designing effective training programs, managing athletes' physical and mental well-being, and fostering a positive team environment. In the context of higher education, tennis coaches also play a pivotal role in promoting sports culture, enhancing students' extracurricular experiences, and contributing to their holistic development. Content from this work may be used under the terms of CC BY-NC 4.0 licence (https://creativecommons.org/licenses/by-nc/4.0/). Published by Warwick Evans Publishing. Despite the growing popularity of tennis in Chinese universities, there are concerns about the quality of coaching and its impact on athletes’ performance and satisfaction. Previous studies have highlighted various challenges facing tennis coaches, including limited resources, inadequate training opportunities, and a lack of standardized coaching frameworks (Li et al., 2018; Chen & Wang, 2017). Furthermore, there is a dearth of research examining how coaches' competencies align with athletes' expectations and preferences, which is crucial for ensuring the effectiveness and relevance of coaching practices. The primary objective of this study is to comprehensively assess tennis coaches' professional competencies in selected higher education institutions in Henan Province. This includes evaluating their abilities in sports planning and management, communication and integration, training and practice orientation, and reflection and professional development. Additionally, the study aims to explore athletes' coaching preferences, focusing on their views on reinforcement strategies, technical instruction, mistake-contingent approaches, punishment, organization, and general communication. Furthermore, this research seeks to investigate the relationship between coaches' competencies and athletes' coaching preferences. By examining the congruence between coaches' skills and athletes' expectations, the study aims to identify areas for improvement and develop recommendations for enhancing coaching quality and effectiveness. The study draws on the Self-Determination Theory (SDT) as its theoretical framework. SDT posits that individuals are motivated by three basic psychological needs: autonomy, competence, and relatedness (Deci & Ryan, 2000). Applied to the context of sports coaching, this theory suggests that athletes are more likely to be motivated and engaged when their coaches support their autonomy, foster a sense of competence, and promote positive relationships. By assessing coaches' abilities to address these needs through their coaching practices, this study seeks to gain insights into the extent to which coaching aligns with athletes' intrinsic motivation and well-being. 2) What are the coaching preferences of athletes in these institutions, and how do they vary across demographic factors such as age, gender, and years of playing experience? Tennis coaching in higher education settings has garnered significant attention in recent years, with research focusing on various aspects of coaching effectiveness, coach-athlete relationships, and athlete development. This literature review aims to summarize key findings from previous studies on tennis coaching competencies and athlete preferences, providing a theoretical background for the current research.",
    "Early studies emphasized the importance of coach's technical expertise and tactical knowledge in enhancing athlete performance (Smith, 2004; Jones & Williams, 2006). However, with the evolution of coaching philosophy, researchers began to recognize the significance of softer skills such as communication, motivation, and emotional intelligence (Gardner & Moore, 2009; Cote, 2010). For instance, Cote (2010) argued that coaches who possess strong interpersonal skills are better equipped to foster a positive training environment, which is crucial for athlete engagement and long-term development. Subsequent studies have delved deeper into the multidimensional nature of coaching competencies. Heydarinejad and Adman (2019) categorized coaching approaches into task-oriented, relationship- oriented, and combined styles, highlighting the need to understand how different styles impact athlete outcomes. Their findings echoed previous research suggesting that successful coaching requires a balance between technical instruction and psychosocial support (Reeves & Buckley, 2007). From a psychological perspective, Self-Determination Theory (SDT) has emerged as a prominent framework for understanding athlete motivation and coach-athlete interactions (Deci & Ryan, 2000). SDT posits that individuals are more likely to engage in activities and persist in the face of challenges when they perceive those activities as autonomous, competent, and related to their personal goals (Ryan & Deci, 2002). Applied to coaching, this means that coaches who adopt an autonomy- supportive style, encouraging athletes to take ownership of their training and goals, are more likely to foster intrinsic motivation and improved performance (Ntoumanis, 2012). Furthermore, research on athlete preferences has shed light on the gap between coaches' perceived competencies and athletes' actual needs and expectations. Athletes tend to value coaches who not only possess technical expertise but also demonstrate empathy, adaptability, and a commitment to continuous learning (Potrac et al., 2013). A study by Fielden et al. (2015) found that athletes preferred coaches who provided clear feedback, offered personalized attention, and created a supportive yet challenging training environment. While much progress has been made in understanding coaching competencies and athlete preferences, there are still gaps in the literature, particularly regarding the context-specific nature of these concepts. Research in different cultural and educational settings has highlighted the need for tailoring coaching approaches to suit local needs and preferences (Gardner et al., 2012). For instance, studies conducted in Asia have shown that athletes in this region place greater emphasis on coach-athlete relationships, harmony within the team, and respect for authority figures (Li et al., 2018). Given this background, the current study aims to contribute to the literature by exploring tennis coaches' competencies and athletes' coaching preferences in the context of higher education institutions in Henan Province, China. By doing so, we hope to provide insights into the unique challenges and opportunities faced by coaches and athletes in this setting, and offer practical recommendations for enhancing coaching effectiveness and athlete development. In summary, the literature review highlights the multifaceted nature of coaching competencies, the importance of athlete preferences, and the need for context-specific approaches to coaching. By building on this foundation, the current study seeks to extend our understanding of tennis coaching in higher education institutions in Henan Province, China. This study employed a descriptive-correlational research design to investigate the professional competencies of tennis coaches and the preferred coaching styles of student-athletes in selected higher education institutions in Henan Province, China. The research aimed to establish the relationship between coaches' competencies and athletes' preferences, as well as to identify factors influencing these variables. A total of 16 tennis coaches and 112 student-athletes from five colleges and universities in Henan Province participated in the study. The sample was chosen using the total enumeration method to ensure that all eligible participants from the selected institutions were included. This approach allowed for a comprehensive assessment of the target population. Data were collected through two adopted survey questionnaires: \"Professional Competencies in Tennis Coaching\" by Cortella et al. (2016) and \"A System of Approaches and Behavioral Assessment of Athletic Coaches\" by Smith et al. (2011). These instruments were translated into Chinese to ensure clarity and understanding among the participants. A pilot test was conducted with a small sample of participants to refine the questionnaire and ensure its reliability and validity. The questionnaires were administered to both coaches and athletes, addressing different aspects of coaching competencies and coaching preferences, respectively. The coaches' questionnaire assessed their competencies in four main areas: Sports Planning and Management, Communication and Integration, Training and Practice Orientation, and Reflection and Professional Development. The athletes' questionnaire evaluated their preferences for coaching styles across six dimensions: Reinforcement, General Technical Instruction, Mistake Contingent, Punishment, Organization, and General Communication.",
    "The data collection process involved obtaining permission from the respective schools, recruiting participants, and administering the surveys. Upon completion, the data were coded and analyzed using descriptive statistics, independent samples t-test, one-way ANOVA, and Pearson's r correlation analysis to address the research questions. Ethical considerations were upheld throughout the study, ensuring confidentiality, informed consent, and protection of participants' rights. In summary, this study's methodology encompassed a comprehensive research design, rigorous data collection procedures, and appropriate statistical analyses to provide insights into the professional competencies of tennis coaches and the coaching preferences of student-athletes in higher education institutions in Henan Province, China. In the domain of sports planning and management, tennis coaches demonstrated a high level of competence. They were particularly skilled in creating emotionally and physically safe sport environments, as evidenced by a top-ranked mean score of 4.00 (Marinho et al., 2020). This dedication to providing a supportive atmosphere conducive to both psychological well-being and optimal performance underscores their commitment to athlete welfare. Additionally, coaches were adept at developing practices and training sessions that consistently yield positive results, as indicated by a mean rating of 3.94 for this competency (Smith & Kendall, 2012). Their ability to maintain efficient and orderly training facilities (mean score of 3.88) also contributed to a positive training environment. However, there were opportunities for improvement in certain organizational aspects. Coaches' mean scores for \"organizing and planning sports activities,\" \"planning and executing sports training programs,\" and \"coordinating technical teams\" were relatively lower, with a mean score of 3.69, suggesting room for enhancement in these areas (Marinho et al., 2020). By prioritizing professional development in these domains, coaches could further optimize their effectiveness in sports planning and management. In terms of communication and integration, tennis coaches also showed a strong foundation. They excelled in fostering team cohesion and effective communication, as evidenced by the top-ranked indicators of \"promote the integration and collaboration in the team\" and \"transmit rational, clear, and concise information,\" both receiving a mean score of 3.94 (Li et al., 2018; Marinho et al., 2020). Coaches were also competent in communicating with athletes individually and in groups, promoting the integration of athletes in difficulties, and leading and managing athletes' activities effectively. However, there were areas for potential improvement, particularly in delegation tasks and providing feedback on athletes’ performance, which received lower mean scores (Chen & Wang, 2017; Guo & Xu, 2017). In the domain of training and practice orientation, coaches demonstrated a strong ability to prepare athletes and teams for competitive events. The competency \"prepare an athlete and a team for the competition\" received the highest mean score of 3.94, indicating a strong consensus among respondents that coaches excel in this area (Li et al., 2018). Coaches were also skilled in guiding athletes during competitions, planning practice sessions considering individual and team needs, and establishing goals adjusted to the team's level. However, there were opportunities for improvement in modifying athletes' behaviors when necessary and preparing them for a variety of situations in competition. Regarding reflection and professional development, coaches showed a robust culture of continuous improvement. The commitment to \"continually improve through self-reflection, mentorship, professional development, evaluation, and self-care\" received the highest mean score of 3.88 (Li et al., 2018). Coaches were also effective in creating environments that facilitate adult learning and adopting innovative techniques for better training and practices. However, there was room for improvement in formal learning engagement, such as attending training and seminars on tennis coaching and management (Wu & Liu, 2016). Student-athletes expressed a strong preference for coaches who actively engage in providing technical instruction and strategic guidance. Coaches who prioritize providing tactical advice and demonstrating techniques necessary for improved performance were highly appreciated (Chen & Wang, 2017). Conversely, coaches who occasionally halt practice to emphasize techniques or strategies were perceived as less consistent in their instructional approach (Huang & Zhang, 2020). The overall mean score of 3.58 across evaluated variables indicates a preference for clear and consistent coaching practices. In terms of mistake-contingent strategies, athletes generally preferred approaches that focused on learning and improvement rather than punishment. Similarly, they valued coaches who organized practices and maintained clear communication channels. Athletes preferred coaches who were organized, provided timely feedback, and fostered a positive and supportive atmosphere.",
    "Interestingly, the analysis revealed significant differences in athletes' preferences based on their years of playing experience. Newer players (with 1-2 years of experience) perceived coaches' competencies in sports planning and management, as well as their effectiveness in training and practice orientation, more positively than more experienced players. This suggests that newer athletes may value structured and controlled approaches more than their more seasoned counterparts. The study established a moderate positive correlation between athletes' perceptions of coaches' competencies and their preferred coaching styles. Specifically, athletes who perceived their coaches as highly competent in sports planning and management, communication and integration, training and practice orientation, and reflection and professional development were more likely to prefer coaching styles that aligned with these competencies. This finding emphasizes the importance of aligning coaching practices with athlete preferences to enhance coaching effectiveness and athlete development. In conclusion, the results of this study provide valuable insights into the professional competencies of tennis coaches and the coaching preferences of student-athletes in higher educational institutions in Henan Province, China. By addressing areas for improvement in coaching practices and tailoring The findings of this study contribute to the understanding of tennis coaching practices in higher education institutions in Henan Province, China. The results provide valuable insights into the professional competencies of tennis coaches and the coaching preferences of student-athletes, as well as the relationship between these two variables. Firstly, the assessment of tennis coaches' professional competencies revealed that they excel in several key areas. Coaches demonstrated a strong foundation in creating emotionally and physically safe sport environments, which is crucial for athletes' psychological well-being and optimal performance. This aligns with previous research that highlights the importance of supportive coaching climates in fostering athlete development (Smith & Smoll, 2011). Furthermore, coaches were highly rated in developing practices and training sessions that consistently yield positive outcomes, indicating their adeptness in designing effective training programs. In terms of communication and integration, coaches consistently excelled in fostering team cohesion and effective communication. This underscores their commitment to creating an environment where athletes understand their roles clearly and work collaboratively. The ability to maintain open communication channels and address challenges collaboratively is vital for team unity and problem- solving (Chen & Wang, 2017). Additionally, coaches demonstrated competence in managing athlete activities and overseeing practice sessions, though there were areas for improvement in providing feedback and advice during skill execution. The assessment of training and practice orientation revealed that coaches excel in preparing athletes and teams for competitive events. This competency is central to coaching effectiveness, as it ensures that athletes are adequately prepared both physically and mentally for competitions (Li et al., 2018). However, there were opportunities for improvement in modifying athletes' behaviors and preparing them for a variety of situations in competition. A more consistent approach to these aspects of coaching could enhance athletes! adaptability and overall performance. The evaluation of coaches' reflection and professional development highlighted their dedication to continuous learning and improvement. Coaches engaged in self-reflection, mentorship, and professional development opportunities, indicating a robust culture of learning within the coaching community. This is in line with the Self-Determination Theory (SDT), which emphasizes the importance of autonomy, competence, and relatedness in fostering intrinsic motivation and personal growth (Deci & Ryan, 2008). By nurturing these psychological needs, coaches can create a supportive environment that encourages athlete development and satisfaction. Regarding student-athletes' coaching preferences, the study found that they had a strong preference for coaches who prioritize positive reinforcement, clear technical instruction, and effective communication. These preferences align with research indicating that athletes respond positively to coaching styles that emphasize encouragement, skill development, and a supportive coaching environment (Riemer & Chelladurai, 2016). Student-athletes also valued well-organized training sessions and a consistent coaching approach that aligns with their developmental needs and goals. The correlational analysis between coaches' competencies and athletes' coaching preferences revealed significant positive relationships in several areas. Specifically, coaches' competencies in sports planning and management, communication and integration, and training and practice orientation were positively correlated with athletes' preferences for coaching styles. This suggests that coaches who possess strong competencies in these areas are more likely to align with athletes' preferred coaching styles, leading to increased satisfaction and enhanced performance outcomes. However, it is important to note that there were some discrepancies between coaches' self-assessed competencies and athletes' perceptions of these competencies. This highlights the need for ongoing communication and feedback between coaches and athletes to ensure that expectations and preferences are aligned. By fostering an open dialogue, coaches can adjust their coaching practices to better meet athletes'needs and preferences, leading to improved coaching relationships and performance outcomes.",
    "Furthermore, the study found that certain demographic factors influenced athletes' perceptions of coaches' competencies and coaching preferences. Specifically, athletes' years of playing experience significantly impacted their assessment of coaches' competencies in sports planning and management, training and practice orientation, and overall competency. Newer athletes tended to perceive coaches more positively in these areas compared to their more experienced counterparts. This could be attributed to the fact that newer athletes may have less established expectations and criteria for evaluating coaches' performances. Age and gender did not significantly influence athletes' perceptions of coaches' competencies, suggesting that these variables are less important than playing experience in shaping athletes' assessments. However, it is worth noting that these findings may be specific to the context of this study and may differ in other cultural or athletic settings. In conclusion, this study provides valuable insights into the professional competencies of tennis coaches and the coaching preferences of student-athletes in higher education institutions in Henan Province, China. The results highlight the importance of coaches' competencies in several key areas, including sports planning and management, communication and integration, training and practice orientation, and reflection and professional development. Furthermore, the study reveals that athletes have strong preferences for coaching styles that emphasize positive reinforcement, clear technical instruction, and effective communication. The findings emphasize the need for coaches to continuously develop their professional competencies and to align their coaching practices with athletes' preferences and needs. By doing so, coaches can foster positive coaching relationships, enhance athlete satisfaction and motivation, and ultimately improve performance outcomes. Future research could explore these issues in more depth, investigating potential differences across different athletic contexts and cultural settings. Additionally, longitudinal studies could provide insights into how coaching relationships and preferences evolve over time, as athletes progress through their athletic careers. The study revealed a varied demographic among tennis coaches, including differences in age, educational attainment, years of coaching experience, and participation in seminars and training sessions. Respondents among tennis players exhibited diversity in sex, age, grade level, and years of playing experience. These factors are pivotal in shaping coaching strategies tailored to individual player backgrounds, optimizing coaching efficacy and player development. Coaches consistently rated highly in professional competencies such as sports planning and management, communication and integration, training orientation, and professional development. Emphasizing continued professional growth in these areas is crucial for maintaining coaching effectiveness and meeting the evolving needs of athletes. Significant disparities were observed in how tennis coaches and players perceived coaching competencies. These differences were influenced by demographic factors including sex, age, grade level, and years of playing experience among players. Addressing these gaps through improved communication and alignment can enhance coaching effectiveness and player satisfaction. Student athletes expressed preferences for coaching styles emphasizing positive reinforcement, clear technical instruction, well-organized training sessions, and effective communication. These preferences are critical for maintaining athlete motivation, engagement, and performance, suggesting a need for coaches to tailor their approaches to meet these expectations. Variations in coaching style preferences were evident based on demographic factors such as sex, age, grade level, and years of playing experience among student athletes. This highlights the importance of adaptive coaching styles that accommodate diverse athlete profiles to foster optimal learning, motivation, and team cohesion. The study established a significant relationship between how players perceive coaches’ competencies and their preferences for coaching styles. Aligning coaching styles with perceived competencies can enhance coach-player relationships, cultivate a supportive coaching environment, and maximize athlete development potential. Effective coaching in sports hinges not only on technical proficiency but also on the ability to understand and adapt to the unique needs of individual athletes. The recommendations drawn from this study aim to enhance coaching practices by leveraging insights gleaned from the assessment of tennis coaches' competencies and athletes' preferences. By tailoring coaching strategies, fostering continuous professional development, improving communication channels, and embracing athlete- centered approaches, coaches can foster an environment conducive to athlete growth, motivation, and performance. These recommendations are rooted in empirical findings that underscore the importance of personalized, culturally sensitive coaching approaches in optimizing athlete development and overall team dynamics. Tailor coaching strategies based on individual player profiles, including demographic factors such as age, playing experience, and educational background. This personalized approach can enhance athlete engagement, motivation, and overall performance.",
    "Encourage ongoing professional growth among coaches, particularly in areas identified as crucial by both coaches and players, such as sports planning, communication, and training orientation. Regular participation in seminars and training programs can keep coaches updated with current best practices and methodologies. Improve communication channels between coaches and players to bridge gaps in perception regarding coaching competencies. Clear and frequent communication helps align expectations, build trust, and foster a supportive team environment conducive to athlete development. Recognize and integrate diverse coaching styles that cater to varied athlete preferences, including reinforcement methods, technical instruction clarity, and organizational structures. Flexibility in coaching approaches can accommodate different learning styles and maximize player engagement. Shift towards athlete-centered coaching methodologies that empower players to actively participate in decision-making processes regarding training, competition, and goal-setting. This approach fosters autonomy, responsibility, and ownership among athletes, leading to enhanced performance outcomes. Establish mechanisms for continuous feedback from athletes regarding coaching effectiveness and satisfaction with coaching styles. Regular assessments help coaches adapt and refine their approaches to better meet evolving player needs and preferences. Consider cultural and contextual factors when designing coaching programs, especially in multicultural settings. Awareness of cultural nuances can foster inclusivity, respect diversity, and create a positive team environment that supports athlete growth and well-being. Conduct longitudinal studies to track the impact of personalized coaching strategies on athlete development over time. Evaluate the effectiveness of implemented recommendations through regular performance assessments, feedback loops, and objective measures of player progress."
]