[
    "Ma, Zhaoxin; Niu, Ling; Chang, Yongqiang; and Kong, Xinyue (2022) \"Implementing Path of Zhengzhou University's Establishment of Football Academy,\" International Journal of Physical Activity and Health: Vol. 1: Iss. 2, Article 36. Under the new policy background of the 2020 \"Opinions on Deepening the Integration of Sports and Education and Promoting the Healthy Development of Adolescents\", as the highest educational institution in China, higher education institutions should shoulder the responsibility of cultivating high-quality talents to meet social needs. As the highest-quality higher education institution in Henan Province, Zhengzhou University's innovation and exploration of teaching methods and talent training models under the background of the integration of sports and education will play a leading role in the development of higher education in Henan Province. Through combing and analyzing the existing policy documents, firstly, explore the reasons, significance, and social background of the construction of the football academy; secondly, analyze the theoretical basis for the construction of the football academy in the context of relevant policies, and analyze the demand for talent training required by the policy. It was combining with the construction situation of my country’s football academy at this stage, implementing the specific requirements of the integration strategy of sports and education, establishing the guiding ideology of “diversified integration” after establishing the academy from the three levels of discipline establishment, talent training, and talent transfer. Investigate the needs of the talent market at the stage, determine the direction of talent training, and discuss how to set up specific majors for domestic enrollment after the establishment of the college. Based on this, it proposes the professional setting direction and specific curriculum arrangement and assessment methods for talent training from five aspects: education and teaching, sports competitions, sports medicine, sports media, economics, and management. Finally, it discusses the difficulties faced by students, teachers, and employment development after graduation in the process of football academy construction and how to use existing resources and related policy support to solve the difficulties. As an innovative way of running a school, the Football Academy provides new opportunities for the reform and innovation of sports talent cultivation. In the torrent of sports and education integration reform, make full use of existing resources, integrate and mobilize various high-quality resources in the region, and finally transform them into the winning resources for the new development of our school's sports discipline in this innovative school- running method. After the football academy is established, it will become a link between campus football and professional football in the province, and a breeding base for national high-quality football industry Integration of Sports and Education and Promoting the Healthy Development of Adolescents\", as the highest educational institution in China, higher education institutions should shoulder the responsibility of cultivating high-quality talents to meet social needs. As the highest-quality higher education institution in Henan Province, Zhengzhou University's innovation and exploration of teaching methods and talent training models under the background of the integration of sports and education will play a leading role in the development of higher education in Henan Province. Through combing and analyzing the existing policy documents, firstly, explore the reasons, significance, and social background of the construction of the football academy; secondly, analyze the theoretical basis for the construction of the football academy in the context of relevant policies, and analyze the demand for talent training required by the policy. It was combining with the construction situation of my country’s football academy at this stage, implementing the specific requirements of the integration strategy of sports and education, establishing the guiding ideology of “diversified integration” after establishing the academy from the three levels of discipline establishment, talent training, and talent transfer. Investigate the needs of the talent market at the stage, determine the direction of talent training, and discuss how to set up specific majors for domestic enrollment after the establishment of the college. Based on this, it proposes the professional setting direction and specific curriculum arrangement and assessment methods for talent training from five aspects: education and teaching, sports competitions, sports medicine, sports media, economics, and management. Finally, it discusses the difficulties faced by students, teachers, and employment development after graduation in the process of football academy construction and how to use existing resources and related policy support to solve the difficulties. As an innovative way of running a school, the Football Academy provides new opportunities for the reform and innovation of sports talent cultivation. In the torrent of sports and education integration reform, make full use of existing resources, integrate and mobilize various high-quality resources in the region, and finally transform them into the winning resources for the new development of our school's sports discipline in this innovative school-running method. After the football academy is established, it will become a link between campus football and professional football in the province, and a breeding base for national high-quality football industry talents. It will also provide a strong impetus for the development of"
]