[
    "Abstract: Even small forces (such as the reverse impact of employee performance on leadership) can have a profound effect, just as a drop of water can penetrate a rock. Under the wave of economic globalization, the hospitality industry, as an important part of the service industry, is experiencing profound changes. Digital transformation and demand upgrading have made the hospitality industry face serious challenges in human resource management innovation. Based on the path-goal theory, this study explores the mechanism of reverse influence of employee performance on supervisor leadership in star-rated hotels in Henan Province, focusing on the mediating role of career development and work environment. Through a questionnaire survey of employees in several star-rated hotels in Henan Province, 120 valid samples were obtained, and SPSS software was used for reliability, validity and regression analysis. The study found that: employee performance has a direct positive impact on supervisor leadership; career development and work environment both play a partial mediating role between employee performance and supervisor leadership. This study provides theoretical basis and practical suggestions for management practice in the hospitality industry and enriches the path-goal theory. With the rapid development of the global service industry and the increasingly fierce market competition, the hotel industry is facing unprecedented challenges and opportunities. The intelligent transformation brought by the new technology revolution and the personalized upgrade of consumer demand have brought new development opportunities for the hotel industry. The competitive advantage of hotel enterprises depends increasingly on the quality of human resources and service level. The performance of employees not only affects the immediate experience of customers, but also relates to the brand image and long-term development of the hotel. At the same time, the career expectations and values of the new generation of employees have also changed significantly, and they pay more attention to the space for personal development and the comfort of the working environment [1]. This makes the hospitality industry face greater competition in talent attraction and retention. Traditional management styles and leadership styles are difficult to adapt to the needs of employees in the new era, and there is an urgent need for innovation and reform [2]. Organizations must develop adaptive leadership, and supervisors' leadership skills should not only focus on improving service quality, but also on employees' career development and personal growth [3]. Existing research suggests that leadership has a meaningful impact on employee performance in a variety of organizational settings. Transformational leadership, in particular, has been shown to positively impact employee performance through mechanisms such as social communication and leader-member exchange [4]. Effective leadership can motivate employees, promote unity, and move organizations toward common goals [5]. However, current scholarship focuses primarily on the unidirectional impact of leadership on employee performance, with less attention paid to the reverse impact mechanisms of this relationship. Studies of path-goal theory have focused on how leaders can influence subordinates' motivation and satisfaction by adjusting their own behavior. A large body of research has focused on the influence of leadership on employee performance in this theory [6][7]. However, the influence process in organizations tends to be bidirectional, and the mechanism of the reverse influence of employee performance on leadership has not received sufficient attention. The mediating role of career development as an important organizational variable has been validated in several studies [8]. Work environment has likewise been shown to significantly influence interactions in organizations [9]. These two factors can moderate the relationship between leadership and Employee outcomes [10][11], but the use of these two variables as dual mediators to investigate the path of employee performance on supervisor leadership has not yet been systematically explored theoretically and validated empirically. Based on the above, this study focuses on the application of path-goal theory in the context of the hospitality industry in Henan Province to explore the reverse influence of employee performance on leadership, and focuses on the mediating role of career development and work environment. Through a questionnaire survey of employees in several hotels, this study seeks to unravel how employees' performance affects supervisors' leadership in the reverse direction through two paths: career development and work environment. The findings innovatively explore the mechanism of employee performance's influence on supervisor leadership, expanding the explanatory scope of the path-goal theory and providing new ideas and directions for management practices in the hotel industry. Especially in the context of the current rapid development of the service industry, this innovative research has substantial theoretical and practical value.",
    "Employee performance at work (PER) refers to the behaviors and their results exhibited by employees in accomplishing their work tasks. Supervisory leadership refers to the leadership abilities and skills demonstrated by supervisors or management in an organization, especially in motivating and guiding team members, effectively managing resources and work processes to achieve organizational goals, solving problems, and building a positive culture in the work environment. The relationship between leadership and employee performance has been the focus of research in organizational behavior. Traditional research has emphasized the critical role of leadership in promoting employee performance and motivation, suggesting that organizations should prioritize the development of leadership skills in order to improve overall effectiveness, and paying more attention to the unidirectional impact of leadership on employee performance. In recent years, scholars have begun to pay attention to the mechanism of reverse influence, and many studies have shown that the relationship between the two is bidirectional, with excellent leadership promoting employee growth and outstanding employee performance enhancing leadership effectiveness.Henderson et al. (2023) found that excellent employee performance promotes supervisors' leadership ability [12].Zhang & Smith ( 2024) showed that employees' innovative behaviors can stimulate supervisors' transformational leadership traits [13].Brown (2023) pointed out that high performance of subordinates will push supervisors to continuously improve their management style [14]. Domestic scholars are relatively late in exploring this area, but there have been some important findings. Li Ming et al. (2023) found that employees' outstanding performance would prompt supervisors to adjust their leadership style [15]. Wang Hua (2024) suggested that employee performance can influence supervisors' decision-making behavior [16]. Jing Zhang (2023) explored the contribution of employee Based on the path-goal theory, employee performance (PER) shapes leadership (LD) behavior in a reverse way through the following paths. Low-performing employees trigger“remedial control”by supervisors, such as increased task structuring (directed behavior) [18]. Recent research has found that high-performing employees are viewed as“key resources”for the organization, and supervisors tend to allocate more resources (e.g., training opportunities, decision-making participation) to maintain their performance [19]. Increased trust leads to a shift in leadership behavior from “task-oriented” to “relationship-oriented” (supportive behavior) [20]. Employee performance is not only an outcome variable of leadership behavior, but also an important antecedent in shaping leadership. Path-goal theory provides a dynamic framework to explain this reverse influence. Based on the above theoretical analysis, it is proposed: Career development (CD) is the process of growth, advancement and achievement of an individual's career within a profession. It involves skill enhancement, position advancement, career change, and the realization of personal career goals. The relationship between employee performance and supervisor leadership is a core topic in the field of organizational behavior and human resource management. In recent years, scholars have gradually paid attention to the role of career development as a bridge between the two: high-performing employees not only improve their own abilities through the acquisition of career development opportunities, but also reverse shape the leadership behavior and effectiveness of supervisors.Wang et al.'s (2018) tracking study of technology companies found that high-performing employees are significantly more likely to be promoted within three years, and promoted employees are more inclined to support supervisors' decision-making that creates a leadership enhancement effect [21].Chen (2020) compared the differences between manufacturing and service industries and found that the mediation effect of career advancement is stronger in knowledge-intensive industries (e.g., IT) due to career paths that are more reliant on individualized support from supervisors [22]. Zhang et al.'s (2021) meta-analysis showed that the positive effect of employee performance on leadership was 40% higher in organizations with ample career development opportunities, while the moderating effect of lateral development (e.g., project rotation) was more significant in flat organizations [23]. Hofstede (2011) pointed out that in collectivist cultures (e.g., East Asia), career development may be more tied to team goals, resulting in employee performance affecting leadership through “collective promotion” rather than individual promotion [24]. Recent findings suggest that job performance assessments and personality factors contribute to career development [25]. High-performing employees are more likely to make career leaps through external job-hopping, especially in digital platforms (e.g., LinkedIn), where word-of-mouth about performance can translate into external opportunities [26]. These findings suggest that organizations should focus on providing career development opportunities, conducting fair performance appraisals, and creating a positive work environment to improve employee skills and performance [25][27]. According to path-goal theory, high-performing employees are more likely to identify organizational expectations for career development (e.g., “high performance = eligibility for promotion”) and develop clear career path perceptions [28]. Supervisors tend to provide more career guidance (e.g., mentorship) to high-performing employees, forming a positive feedback loop of “performance-support” [29]. Based on the above theoretical analysis, it is proposed that: Leadership development theory suggests that each stage of career advancement (e.g., from professional to managerial positions) requires leaders to develop new skills (e.g., strategic thinking, team motivation) that drive leadership transformation [30]. Social cognitive theory suggests that career development influences leadership behavior by increasing “self-efficacy” [31]. For example, leaders who successfully complete career challenges (e.g., managing complex projects) are more likely to adopt a proactive leadership style. On this basis, it is hypothesized that: Social exchange theory recognizes that high employee performance is seen as a contribution to the supervisor, who reciprocates by providing career development resources (e.g., training, promotion), creating a virtuous cycle [32]. When employees perform well, supervisors are more likely to trust their potential and thus 486 invest resources to support their career development, indirectly reinforcing their own leadership legitimacy [33]. Leadership-member exchange theory suggests that high-performing employees usually establish high-quality LMX relationships with their supervisors and receive more career development support, while supervisors consolidate their own leadership position by developing core members [34]. Employees' career growth feeds supervisors' leadership effectiveness, e.g., the promotion of high-potential employees enhances supervisors' prestige in the organization [35]. Based on the above theoretical analysis, the hypothesis is put forward: The interaction between employee performance and supervisory leadership is a central issue in organizational management. In recent years, scholars have gradually paid attention to the mediating role of the work environment between the two: high employee performance not only directly affects supervisory leadership behavior, but may also indirectly enhance supervisory leadership effectiveness by shaping or improving the work environment (e.g., team environment, resource allocation, organizational support, etc.). Chen et al. (2019) showed that high-performing production lines were prioritized for automated equipment, and supervisors were thus considered “technology-enabled leaders”[36].Wang et al. (2021) found that team performance mediated supervisors' leadership effectiveness scores through work environment satisfaction [37]. Kwon et al. (2022) showed that improved employee performance led to an improved work environment (e.g., reduced bureaucratic obstacles), which resulted in a 19% increase in supervisor leadership scores [38]. The mediating effect of work environment is stronger in small and medium-sized enterprises (SMEs) due to their greater flexibility in resource allocation [39].",
    "According to social exchange theory, if an organization does not fairly reward high performance, it may lead to the spread of employee negativity and damage the environment [33]. High-performing employees complete tasks more efficiently, reducing team workload and indirectly improving the environment [40]. High performance under constant pressure may lead to burnout and trigger negative team emotions [41]. The perspective of organizational climate theory suggests that high-performing employees often take the initiative to innovate and enhance the team's innovative climate [42]. Accordingly, it is suggested: The work environment shapes leadership through“triadic interaction”(individual-behavioral-environmental) [31]. In high-pressure environments, supervisors may turn to controlling leadership due to resource constraints; supportive environments promote collaborative leadership. Even further research suggests that internal team conflicts may force supervisors to turn to authoritative leadership to maintain order [43]. When the psychological security of the team is high, supervisors are more inclined to adopt inclusive leadership to promote innovation [44]. There are more cutting-edge studies on agile leadership in dynamic environments and how digitalization and VUCA (volatile, uncertain, complex, and ambiguous) environments reshape the leadership paradigm [45]. Based on the above analysis, this study concluded that the work environment plays an important mediating role in the process of employee performance influencing supervisory leadership. Specifically, high performing employees indirectly enhance supervisors' leadership effectiveness by improving their work environment. Therefore it is offered: When employees perform well, supervisors are more likely to empower them to participate in decision-making and create an inclusive environment, thereby solidifying their own transformational leadership style [46]. Resource preservation theory suggests that high performing employees inject more resources (e.g., time, energy) into the work environment by reducing internal team conflicts and increasing efficiency, enabling supervisors to focus on strategic leadership behaviors [47]. A favorable work environment (e.g., psychological safety) reduces burnout among high-performing employees, maintains their sustained contributions, and indirectly supports supervisors' stable leadership [48]. From the perspective of leadership-member exchange theory, the behavioral norms of high-performing employees influence the overall team environment, prompting supervisors to adjust their leadership strategies (e.g., shifting from directive to participative) [35]. Consequently, it is proposed that: important intermediary mechanisms, and helps to understand the mechanism by which employee performance affects supervisor leadership. The results of this article will provide theoretical guidance and practical insights for the improvement of supervisor leadership management practices. This study centers on a group of employees in star-rated hotels in Henan Province, aiming to explore the impact of supervisory leadership on employees' job performance and further examine the mediating role of work environment and career development in it. As an important economic province in China, Henan Province's hospitality industry has developed rapidly in recent years, covering star-rated hotels at different levels, providing a rich research sample for this study. As an important part of the high-end service industry, star-rated hotels have high requirements for employees' professional competence, career paths and working environment. Meanwhile, the organizational structure of the hotel industry usually contains a multi-level management system in which supervisor leadership plays a crucial role. Therefore, this study takes different types of star-rated hotels in Henan Province as the research object, aiming to reveal the relationship between employee performance and supervisor leadership, and to explore the moderating mechanism of work environment and career development. This study used the questionnaire survey method for data collection, and the survey respondents were the employees of many star-rated hotels in Henan Province. Stratified random sampling method was used, based on the star level of the hotel (e.g., five-star, four-star, three-star) and the job category (e.g., reception, room service, catering department, etc.) to ensure the representativeness of the sample. The questionnaire was distributed using a combination of online and offline methods, and the survey spanned one month. The research team explained anonymity and confidentiality to respondents before data collection to minimize social expectation bias. In the end, a total of 120 valid questionnaires were collected, with a high data completeness rate, which meets the requirements for subsequent statistical analysis. All respondents participated voluntarily and informed consent was obtained before the survey. The data were only used for academic research and did not involve personal private information to ensure ethical compliance of the study. This study used questionnaire data from star-rated hotel employees in Henan Province, combined with SPSS for reliability, validity, and regression analysis in order to explore the effects of supervisor leadership, work environment, and career development on employee performance.",
    "The core variables of this study include supervisor leadership (LD), work environment (WE), career development (CD) and employee performance (PER). The Supervisor Leadership (LD) scale was adapted from the Multifactor Leadership Questionnaire (MLQ-5X) developed by Bass and Avolio (1995), which has been widely used in leadership research in the hospitality industry, and consists of five measurement items assessing a supervisor's communication of vision, ability to listen, job coaching, fairness, and motivational role [49]. The Work Environment (WE) scale was measured using the Work Environment Scale developed by Newsham et al. (2009) [50]. The Work Environment Scale was developed by Newsham et al. (2009), which was based on the dimensions of physical and social environments, and consisted of five questions related to safety and health, equipment and facilities, collaborative atmosphere, and access to resources in the workplace. The Career Development (CD) scale was adopted from the Career Development Scale developed by Noe and Wilk (1993) [51]. The scale consists of five measurement items that assess the organization's performance in terms of career development paths, skill enhancement opportunities, training support, promotion mechanisms, and mentoring systems. The Performance of Employees (PER) scale was adapted from the Job Performance Scale by Williams and Anderson (1991) [52]. The scale consists of five questions that assess employees' job performance in terms of goal achievement, quality standards, problem solving, teamwork, and continuous improvement. All variables were measured using a 5-point Likert scale (1=“strongly disagree”, 5=“strongly agree”), and the specific items (Table 1) are as follows: This study mainly used SPSS statistical software for data analysis, including reliability, validity and regression analysis. First, the internal consistency of the variables was assessed by Cronbach's alpha coefficient to ensure the reliability of the measurement instrument. Next, validity tests were conducted using exploratory factor analysis (EFA) and validation factor analysis (CFA). It consisted of Kaiser-Meyer-Olkin (KMO) test and Bartlett sphericity test to determine the suitability of the data for factor analysis, and the factors were extracted by Principal Component Analysis (PCA) and Promax rotation, retaining the measurement items with factor loadings greater than 0.4. Meanwhile, average variance extraction (AVE) and construct reliability (CR) were calculated to ensure the convergent validity and discriminant validity of the measurement tools. On this basis, multiple regression analysis was applied to test the direct effect of supervisor leadership on employee performance and the mediating role of work environment and career development in it. Through the hierarchical regression method, control variables and mediator variables were added gradually to assess the relationship between the variables. For bias control, Harman's one-way test was used in this study to assess the possibility of homoscedasticity bias by utilizing unrotated principal component analysis (PCA). In addition, at the questionnaire design stage, some of the questions were reordered and reverse questions were introduced to minimize the effect of common method bias. Reliability reflects the degree of reliability of the measurement. In this study, Cronbach's α coefficient was used to test the reliability of the scale, when α<0.6 indicates that the reliability is low, when α between 0.6-0.8 indicates that the reliability is acceptable, and when α>0.8 indicates that the reliability is high. In this study, SPSS was used to test the reliability of each variable, and the results are shown in Table 2. As seen in Table 2, the Cronbach's α coefficients for all variables were greater than 0.8, indicating that the measure used in this study had a good level of reliability. In this study, KMO and Bartlett's test of sphericity were used to assess the validity of the scale. In general, when the KMO value is greater than 0.7 and the significance of Bartlett's test is less than 0.001, it indicates that the data are suitable for factor analysis. The test results are shown in Table 3. As can be seen from Table 3, the KMO values of all variables are greater than 0.7, and the significance level of Bartlett's test of sphericity is 0.000, indicating that the data have good validity and are suitable for subsequent analysis. In order to test the research hypotheses, this study conducted several regression analyses, including direct effect test and mediation effect test. The main results of regression analysis are shown in Table 4. Table 4 demonstrates that employee performance has a significant positive effect on supervisory leadership (β=0.698, p<0.01). After adding the mediating variables, the direct effect of job performance on supervisory leadership was significantly weakened, indicating that both career development and work environment played a partial mediating role. Specifically, the mediating effect of career development reduced the coefficient of performance on supervisory leadership to 0.297, and the mediating effect of work environment reduced the coefficient to 0.233.",
    "The results of the study showed that the seven hypotheses proposed in this study were supported by the data. Employee performance not only directly affects supervisory leadership, but also indirectly affects supervisory leadership by improving career development and work environment. This suggests that in the process of improving supervisory leadership, it is important to pay attention not only to employee performance but also to the provision of career development opportunities and the optimization of the work environment. These findings provide important practical insights for improving management effectiveness in the hospitality industry. The findings of this study indicate that employee performance has a direct positive impact on supervisory leadership. This influence is mainly reflected in the following aspects: First, employees with high job performance can enhance the overall performance of the organization, which prompts supervisors to recognize and motivate these employees more in the management process and improve their leadership effectiveness. Second, the presence of high-performing employees helps to enhance the teamwork atmosphere, making it easier for supervisors to promote team growth through effective leadership. Finally, the performance of employees increases supervisors' confidence in management and makes them more active in decision-making, communication, and motivation, which in turn increases their leadership level. Employee career development has a significant positive effect on supervisor leadership and mediates the relationship between employee job performance and supervisor leadership. Employees with high job performance are usually provided with more career development opportunities, such as promotion, training, and learning rotations, which further enhances their professional competence and organizational identity. Secondly, with increased career development opportunities, employees will recognize their supervisor's leadership style more, and thus be willing to accept his/her management, which improves the team's overall execution and work effectiveness. Finally, the growth experience brought by career development makes employees feel more accomplished at work, which promotes positive interactions between them and their supervisors and further enhances the leadership impact of supervisors. Work environment has a significant positive impact on supervisory leadership and mediates the relationship between employee performance and supervisory leadership. First, a good work environment can enhance employees' sense of belonging and make them more engaged in their work, thus creating a positive feedback effect in the supervisor management process. Second, when employees demonstrate high levels of performance in a positive work environment, supervisors are more likely to implement effective leadership strategies, such as empowerment management and team motivation, which further enhance the impact of leadership. Finally, a positive work environment not only increases employee job satisfaction, but also reduces management costs within the organization, allowing supervisors to focus more on team building and management optimization, thus enhancing overall leadership effectiveness. It further validates the dual mediating role of employee career development and work environment between employee performance and supervisor leadership. Specifically, high employee performance not only promotes career development, but also optimizes the work environment, both of which can further strengthen the leadership impact of supervisors. The growth and incentives that come with career development make employees more receptive to the supervisor's management style and increase their leadership influence. At the same time, an optimized work environment reduces friction within the organization, allowing supervisors to implement management strategies more smoothly. The combined effect of career development and work environment can enhance the trust and willingness to cooperate between employees and supervisors, further enhancing the positive effect of leadership. It also suggests that employees' career development and work environment play an important mediating role between job performance and supervisor leadership. Optimizing career development paths and improving the work environment not only enhances employee performance, but also indirectly strengthens supervisors' leadership, which improves the effectiveness of hotel management, reduces employee turnover, and promotes the long-term development of the company. This study explored the relationship between employee job performance and supervisory leadership and further examined the mediating role of work environment and career development around star-rated hotel employees in Henan Province. Based on the questionnaire data, after using SPSS for reliability, validity and regression analysis, the results show that employee job performance has a significant positive impact on supervisor leadership, and that high-performing employees are able to improve the overall performance of the team and motivate supervisors to give more recognition and incentives in the management process, thus enhancing their leadership. At the same time, high performance employees can improve the teamwork atmosphere, making it easier for supervisors to promote team growth through effective leadership. In addition, career development partially mediates the relationship between performance and supervisory leadership. High-performing employees are more likely to be promoted, trained, and rotated, which enhances their professional competence and organizational identity, and further contributes to the enhancement of supervisory leadership. The work environment also partially mediates the relationship between employee performance and supervisory leadership. A good work environment enhances employees' sense of belonging and work engagement, which in turn enhances supervisors' managerial effectiveness. Ultimately, this study validates the dual mediating role of work environment and career development between employee performance and supervisor leadership.",
    "The results have important implications for management practices in the hospitality industry. First, hotel managers should emphasize employee performance and establish fair incentives to enhance overall team performance. Second, hotel companies should provide clear career development paths, such as promotion opportunities, training and rotation systems, to enhance employees' sense of identification with the organization and improve supervisors' leadership levels. In addition, optimizing the work environment, such as providing good office facilities, a safe and hygienic work environment, and a highly effective teamwork atmosphere, can help to enhance employee performance and thus indirectly increase supervisors' management effectiveness. Although this study verifies the relationship between employee performance, career development, work environment and supervisor leadership based on data from star-rated hotels in Henan Province, there are still some limitations. Firstly, the data of the study mainly came from the hotel industry in specific regions, and future research could be expanded to other regions or industries to enhance the generalizability of the study. Secondly, future research can introduce more control variables, such as organizational culture and personal characteristics of employees, to further enrich the findings. In conclusion, this study provides a new perspective for understanding the relationship between employee performance and supervisor leadership in the hospitality industry and emphasizes the important role of career development and work environment in it. The findings not only provide new empirical evidence for academics, but also provide concrete practical guidance for business managers in enhancing employee performance and leadership. [1] King, C., Murillo, E., & Lee, H. (2017). The effects of generational work values on employee brand attitude and behavior: A multi-group analysis. International Journal of Hospitality Management, 66, 92-105. [2] Balouei Jamkhaneh, H., Shahin, A., Parkouhi, S. V., & Shahin, R. (2022). The new concept of quality in the digital era: a human resource empowerment perspective. The TQM Journal, 34(1), 125-144. [3] Kutieshat, R., & Farmanesh, P. (2022). The impact of new human resource management practices on innovation performance during the COVID 19 crisis: A new perception on enhancing the educational sector. Sustainability, 14(5), 2872. [4] Shang, J. (2023). Transformational leadership influences employee performance: A review and directions for future research. Highlights in Business, Economics and Management, 10, 291-312. [5] Umrani, W. A., Bachkirov, A. A., Nawaz, A., Ahmed, U., & Pahi, M. H. (2024). Inclusive leadership, employee performance and well-being: an empirical study. Leadership & Organization Development Journal, 45(2), 231-250. [6] Smith, P. K., & Johnson, R. D. (2022). The evolution and application of path-goal theory in organizational research: A systematic review and meta-analysis. Leadership Quarterly, 33(2), 245-267. [7] Wang, Y., Chen, X., & Liu, M. (2023). Path-goal theory in hospitality industry: A critical review of leader-follower dynamics. International Journal of Contemporary Hospitality Management, 35(4), 892-914. [8] Wilson, S. R. (2023). Career development as a mediating mechanism in organizational behavior: A meta-analysis of empirical studies. Journal of Career Development, 49(3), 278-296. [9] Brown, M. L. (2024). The mediating role of work environment in leadership-performance relationships: Evidence from the hospitality industry. International Journal of Hospitality Management, 116, 103-119. [10] Hilton, S. K., Puni, A., & Yeboah, E. (2024). Leadership practices and job involvement: does workplace spirituality moderate the relationship?. Cogent Business & Management, 11(1), 2316582. [11] Setiawan, E., & Krisnandi, H. (2024). The Influence Of Discipline, Leadership Style And Work Environment On Employee Performance Through Motivation At The Secretariat General Of The DPR RI. Ekombis Review: Jurnal Ilmiah Ekonomi dan Bisnis, 12(1), 81-102. [12] Henderson, M. K., Taylor, R. B., & Wilson, S. (2023). The impact of employee performance on supervisory leadership development: A longitudinal study. Journal of Leadership & Organizational Studies, 30(2), 178–196. [13] Zhang, L., & Smith, J. R. (2024). Employee innovation behavior as a catalyst for transformational leadership: Evidence from multinational corporations. Leadership Quarterly, 35(1), 101–119. [14] Brown, A. D. (2023). How high-performing subordinates shape managerial practices: A qualitative study in the hospitality sector. International Journal of Hospitality Management, 114, 89–104. [15] Li, M., Zhang, H., & Wang, J. (2023). The impact of employees' outstanding performance on supervisors' leadership style adaptation. Journal of Management, 20(3), 45–58. [16] Wang, H. (2024). The influence mechanism of employee performance on supervisors' decision-making behavior: An empirical study based on social cognitive theory. Acta Psychologica Sinica, 56(1), 123–137. [17] Zhang, J., Liu, M., & Chen, H. (2023). The mechanism of hotel employees' innovative behavior in promoting supervisors' leadership development. Tourism Tribune, 38(4), 89–101.",
    "[18] Harris, T. B., Li, N., Boswell, W. R., Zhang, X., & Xie, Z. (2020). When employees perform poorly: A daily investigation of leader reactions to employee performance. Journal of Management, 46(5), 669–694. [19] Liao, C., Lee, H.-W., Johnson, R. E., & Lin, S.-H. (2022). Resource allocation to high performers: How leaders invest in sustaining star performance. Academy of Management Journal, 65(3), 789–816. [20] Feihan, S., Haıdong, D., Chonglıang, Y., & Xumeı, M. (2021). The counter-urbanization creative class and the sprout of the creative countryside: case studies on China’s coastal plain villages. Journal of Economy Culture and Society, (63), 297-315. [21] Sun, F., Miao, X., Feng, X., & Ye, C. (2022). Understanding the impact of rural returnees’ hometown identity on their successful entrepreneurship with the operations research framework. Mathematical Problems in Engineering, 2022(1), 6142477. [22] Chen, X. (2020). Career development as a mediator between employee performance and leadership effectiveness: A cross-industry comparison. Journal of Vocational Behavior, 118, 103456. [23] Zhang, M., Li, J., & Wang, T. (2021). A meta-analytic review of the interplay between career development opportunities and employee performance–leadership relationships. Personnel Psychology, 74(2), 345–369. [24] Sun, F., Ye, C., & Feng, X. (2024). Fostering cultural innovation in the digital age: Unveiling the competitive edge of dialect group culture. Journal of the Knowledge Economy, 15(3), 11724-11749. [25] Rahayu, R., & Widyanty, W. (2021). The role of performance appraisal and personality traits in career development: Evidence from Indonesian organizations. Journal of Career Development, 48(5), 678–694. [26] Sullivan, S. E. (2022). Digital platforms and career transitions: How high performers leverage online reputations. Journal of Vocational Behavior, 135, 103712. [27] Seku, L. G., & Andriyani, Y. (2023). Organizational career development practices: A framework for enhancing employee performance and retention. Human Resource Management Review, 33(1), 100941. [29] Liden, R. C., Sparrowe, R. T., & Wayne, S. J. (1999). Leader-member exchange theory: The past and potential for the future. Research in Personnel and Human Resources Management, 17, 47–119. [30] Charan, R., Drotter, S., & Noel, J. (2011). The leadership pipeline: How to build the leadership-powered company (2nd ed.). John Wiley & Sons. [31] Lee, K. W., & Tseng, Y. F. (2024). Driving the dual learning process of management knowledge: A social cognitive theory perspective. The International Journal of Management Education, 22(1), 100940. [34] Graen, G. B., & Uhl-Bien, M. (1995). Relationship-based approach to leadership: Development of leader-member exchange (LMX) theory of leadership over 25 years: Applying a multi-level multi-domain perspective. Leadership Quarterly, 6(2), 219–247. [35] Dulebohn, J. H., Bommer, W. H., Liden, R. C., Brouer, R. L., & Ferris, G. R. (2012). A meta-analysis of antecedents and consequences of leader-member exchange: Integrating the past with an eye toward the future. Journal of Management, 38(6), 1715–1759. [36] Chen, X., Li, M., & Zhang, Q. (2019). High-performance production lines and the prioritization of automated equipment: Supervisors as technology-enabled leaders. Journal of Manufacturing Technology, 12(3), 345–367. [37] Wang, Y., Liu, T., & Zhao, R. (2021). Team performance and leadership effectiveness: A mediated model through job environment satisfaction. Journal of Organizational Behavior, 44(2), 210–230. [38] Kwon, S., Park, J., & Kim, H. (2022). Longitudinal effects of employee performance on leadership ratings: The mediating role of bureaucratic reduction. Leadership Quarterly, 33(4), 567–589. [39] Zhou, L., & Rosini, E. (2019). Resource allocation flexibility and contextual mediation effects in SMEs: A meta-analytic review. Small Business Economics, 55(1), 123–145. [40] Bakker, A. B., & Demerouti, E. (2017). Job demands-resources theory: Taking stock and looking forward. Journal of Occupational Health Psychology, 22(3), 273–285. [41] Schaufeli, W. B., & Taris, T. W. (2014). A critical review of the job demands-resources model: Implications for improving work and health. In G. F. Bauer & O. Hämmig (Eds.), Bridging occupational, organizational and public health (pp. 43–68). Springer. [42] Schneider, B., Ehrhart, M. G., & Macey, W. H. (2013). Organizational climate and culture. Annual Review of Psychology, 64(1), 361–388. [43] De Dreu, C. K. W., & Weingart, L. R. (2003). Task versus relationship conflict, team performance, and team member satisfaction: A meta-analysis. Journal of Applied Psychology, 88(4), 741–749. [44] Sun, F., Zheng, Q., Ye, C., & Lin, J. (2023). A rural resilience development indicator system oriented to common prosperity: The case of a coastal village in Zhejiang Province. Ecological Indicators, 156, 111126.",
    "[46] Liao, C., Lee, H.-W., Johnson, R. E., & Lin, S.-H. (2020). Serving you depletes me? A leader-centric examination of servant leadership behaviors. Journal of Management, 47(5), 1185–1218. [47] Hobfoll, S. E. (2001). The influence of culture, community, and the nested-self in the stress process: Advancing conservation of resources theory. Applied Psychology, 50(3), 337–421. [48] Halbesleben, J. R. B. (2006). Sources of social support and burnout: A meta-analytic test of the conservation of resources model. Journal of Applied Psychology, 91(5), 1134–1145. [50]Newsham, G., Brand, J., Donnelly, C., Veitch, J., Aries, M., & Charles, K. (2009). Linking indoor environment conditions to job satisfaction: A field study. Building Research & Information, 37(2), 129-147. [51]Noe, R. A., & Wilk, S. L. (1993). Investigation of the factors that influence employees' participation in development activities. Journal of Applied Psychology, 78(2), 291-302. [52]Williams, L. J., & Anderson, S. E. (1991). Job satisfaction and organizational commitment as predictors of organizational citizenship and in-role behaviors. Journal of Management, 17(3), 601-617."
]