[
    "Abstract: The new government accounting system has put forward new requirements for the financial management of colleges and universities. The financial department of colleges and universities are facing new challenges. The accounting tasks are increasing and the accounting pressure is constantly increasing. However, the settings of financial department and staffing have not changed much, which affects the quality of financial work in colleges and universities, and is not conducive to the healthy development of colleges and universities. This paper analyses the factors that affect the establishment of financial department in colleges and universities through investigation, and puts forward suggestions for solving the problem. In order to comprehensively deepen the reform of the government accounting system, the Ministry of Finance stipulates that from January 1, 2019, public institutions should implement the new government accounting system, and establish a government accounting standard system with Chinese characteristics and an accrual basis for comprehensive government financial reports system. The main feature of the new government accounting system is “dual functions, dual basis, and dual reports”, and the new government accounting system has put forward new requirements for the financial management of colleges and universities. The questionnaire mainly focuses on the basic information of colleges and universities and the relevant situation of the financial department setting of colleges and universities in Henan province. The questionnaires were mainly distributed and collected online through Wenjuanxing platform. A total of 200 questionnaires were sent out, 135 valid questionnaires were collected, and the recovery rate was 67.5%. The main information collected by the questionnaire includes: the geographical location of the university; the type of the university; the scale of the university, such as the number of students and total income; as well as the setting of financial department. Under the general environment and new requirements of the reform of the government accounting system, the financial department of colleges and universities are facing new challenges, the accounting tasks are increasing, and the accounting pressure is increasing, but the financial department and staffing have not changed much, which has led to the structural contradiction of financial management in colleges and universities. How colleges and universities can better play their role in the tedious and complex daily financial work, improve the financial management level of colleges and universities, and promote high-quality and high-level development of colleges and universities is an inevitable practical problem facing colleges and universities. Based on this, it has important theoretical and practical significance to study how to set up financial department in colleges and universities under the background of the new government accounting system. This article uses the implementation of the new government accounting system as the research background, takes the financial department setting in colleges and universities in Henan Province as the starting point, and this article uses questionnaire to learn more about the actual conditions of the financial department setting in colleges and universities in Henan Province, in order to explore and discover the main problems existing in colleges and universities, and propose possible solutions based on the relevant theories of Figure 1 shows the results of the geographic location of colleges and universities in Henan province. As shown in the Figure 1, the universities located in Central Henan region (Zhengzhou, Pingdingshan, Xuchang, Luohe) are the most, accounting for 40.74%, followed by Northern Henan region (Anyang, Xinxiang, Jiaozuo, Puyang, Hebi, Jiyuan), accounts for 40%, which means that more than 80% of the colleges and universities are mainly located in the Central and Northern Henan regions, and the proportion of colleges and universities in other regions is relatively small, which is in line with the actual location of colleges and universities in Henan Province, because most colleges and universities in Henan Province are currently located in central and northern Henan. This result various colleges and universities on their official websites, we have summarised the financial department setting of colleges and universities in Henan Province, as shown in Table 1. In terms of university types, more than one third of the surveyed universities (36.3%) belong to comprehensive universities, followed by agriculture and forestry universities, normal universities and science and technology universities, accounting for 17.78%, 17.78% and 17.04%. Other types are relatively scattered. From Table 1, we can see that all of 35 colleges and universities have set up accounting section and planning and finance section. More than half of colleges and universities have set up general (management) Section (77.14%), funds settlement section (68.57%), and toll management section (45.71%). Revenue management section, information management section, agency accounting section, etc. are less setting in colleges and universities. Table 2.1 reflects the actual situation of the financial department setting in Henan Province, which is completely consistent with the actual situation. The result verifies the reliability of the survey data again.",
    "Figures 3 and 4 reflect the scale of colleges and universities. From the above figures, we can see that more than half of colleges and universities in Henan Province have students between 20,000 and 30,000, and one-third of colleges and universities have a total income of 500-700 million yuan, this shows that there are currently a large number of students in colleges and universities in Henan Province, student-teacher ratio is not high, and the incomes are relatively tight. This is completely consistent with the actual situation that Henan Province is a province with a large population and a relatively low per capita GDP, which once again proves the reliability of the survey data. the From Figure 5, we can see that the scale of colleges and universities, funding structure, spending scale, etc. will affect the setting of financial department in colleges and universities, the degree of business complexity in colleges and universities, internal control requirements, the degree of emphasis on financial work, the degree of financial informatization, and financial software in colleges and universities, the staff capacity, etc., will also have a very important impact on the setting of financial department. This provides direction for our next step to optimize the financial department setting in colleges and universities. The establishment of financial department in colleges and universities is the starting point of financial management work, and it is also the key to the smooth development of financial management work in colleges and universities. According to the data of financial department set up by university, we found that the following problems commonly exist in the establishment of financial department in universities: First, the universities set up positions in an accounting-based financial model, and lacked management-oriented positions and departments; Second, colleges and universities have weak awareness of financial subjects, lack of cost and performance concepts, and no corresponding department setting; Third, colleges and universities lack risk awareness, scattered organizational structures, and weak management functions, which are not conducive to risk avoidance; Fourth, there is poor communication among the various financial departments in colleges and universities, and the staffing of important positions is insufficient. Based on the above problems, we put forward the following suggestions for optimizing the setting of financial department in colleges and universities: people, while others do not understand at all and can’t get involved. When there is a problem, if one or two people are not there, they will be in a hurry, and the work will not be able to be carried out; On the other hand, it will also lead to the phenomenon of staying in a job for too long, which may easily lead to the phenomenon of staff taking bribes or embezzling the economic interests of the unit by taking advantage of the convenience of work. These two aspects are not conducive to the development of financial work in colleges and universities. Regular job rotation system can effectively avoid the above problems. The implementation of the new government accounting system requires colleges and universities to adopt a “dual function, dual basis, and dual reporting” accounting system, and put the management function of college financial work on the agenda. If colleges and universities only pay attention to teaching and researching, ignore the importance of financial management, then this awareness will greatly hinder the development of colleges and universities in the new situation. In addition to increasing the emphasis on financial work, colleges and universities also need to strengthen the training of accounting staff and improve the overall quality of accounting staff. Due to the staffing reasons, it is difficult for the finance department of colleges and universities to introduce new talents. At present, the staff structure of the finance department of colleges and universities is aging, and the level of education and professional is uneven. The implementation of the new government accounting system not only requires accounting staff in colleges and universities to correctly handle various daily complicated reimbursement accounting work, but also continuously strengthen the study of new knowledge. New accounting system and new accounting rules must be continuously strengthened. This has put forward new requirements for the quality of accounting staff in colleges and universities in all aspects. If colleges and universities neglect to cultivate the political and professional qualities of accounting staff, it will inevitably affect the financial management work of the entire college, which will not only reduce the efficiency of financial work, but also cannot guarantee the quality of financial work.",
    "On the one hand, the non-rotation of positions will cause accountants to not pay attention to improving their abilities and cause the phenomenon of single skills and uneven working ability. Budgets, final accounts, preparation of financial statements, year-end accounting processing and other important links are often carried out by one or two At present, the country is vigorously promoting management accounting, the development of enterprise management accounting is advancing by leaps and bounds, and management accounting in administrative institutions is still in the primary stage. In the process of setting up financial department in colleges and universities, the relevant functions of management accounting should be considered, and the financial department in colleges and universities should be set up based on management accounting. Because most colleges and universities are still under the accounting-based financial management model, the financial structure setting based on management accounting is still in the exploratory stage. When setting up financial department in colleges and universities, by introducing management accounting, setting up corresponding functional departments, and then adjusting the configuration of financial institutions and accounting staff, improving the work efficiency of financial institutions in colleges and universities, maximizing the use of existing resources in colleges and universities, improving the conditions for setting up financial institutions in colleges and universities, and further optimize the financial structure settings and accounting staff allocation in colleges and universities. The establishment of financial department and the allocation of accounting staff in colleges and universities is a complex task, and it is also an important basic task. This work is related to the healthy and normal operation of the financial work of the entire university, and affects the long-term development of the university. At present, it is necessary for all university leaders and managers to pay much more attention to the financial work of colleges and universities, strengthen the training of accounting staff, and strive to complete financial work with the highest possible quality within the limited scope of financial staff. Secondly, it is to improve and perfect the construction of internal control in colleges and universities, form a good internal control environment in colleges and universities, and provide institutional guarantee for financial work in colleges and universities. Finally, according to the requirements of building a management-oriented financial model and its corresponding organizational structure, the focus of work should be on increasing income and reducing expenditure, establishing the concept of benefit and risk awareness, rationally allocating, and using funds, and ensuring and promoting the scientific and rapid development of college education. This work was funded by the Education Department of Henan Province. It was a special project of the financial management of the Education Department in 2020. The project name is “The setting of financial institutions in colleges and universities under the new government accounting system”. The project number was 2020C26."
]