[
    "Develop and enhance of information interaction abilities in the context creating competitive advantage in SMEs is essential in today's economic climate. The present research investigates the relationship between information interaction and gaining competitive advantage for SMEs in Henan, China. Moreover, the mediating role of value co-creation in SMEs is examined. Comprehensive literature review reveals organized information interaction in human resources, information infrastructure, and intangible resources have a significant influence on gaining competitive advantage for SMEs. Lack of investigation of value co-creation as the mediating variable is one of the main motivations of the present study. This is quantitative research where data is collected from senior executives and directors working for China-based via simple random sampling. SMEs that are involved in the information technology industry. The questionnaire is designed with five-point Liker scale of measurement ranging from strongly disagree to strongly agree. SPSS and Smart-PLS are used to analyse the research data. The study has significant practical and theoretical implications positing a relationship between information interaction and gaining competitive advantage. Keywords: Competitive advantage, Value co-creation, Information interaction, Human resource management, China-based SMEs The business environment is constantly changing due to the advancement of communications and internet technology, which is revolutionizing management styles, customer communiqué, and company processes. The value co-creation system and developments in information technology have transformed the market position of users, and companies must encourage user engagement, happiness, and loyalty through information sharing to produce reciprocal advantages and win-win collaboration. The resource-based paradigm did not anticipate these changes, but companies must now develop a new information system that promotes interaction among consumers, user groups, and value chain stakeholders to create a user-centric experience. This study defines and explores the idea of information interaction capacity and examines its influence on co-value creation from the viewpoints of resource-based theory, value co-creation theory, and information interaction theory. The business environment is constantly changing due to advancements in mobile internet technology, which is disrupting both internal and external settings, management styles, customer communication, and company processes (Efrat & yna, 2021). These changes have also revolutionized users' interactions and value co-creation, transforming their market position. In order to establish reciprocal benefits and win-win collaborations between businesses, users, and partners, companies must prioritize user engagement, satisfaction, and loyalty through sharing information with users, user communities, partners, and each other (Darmouni & Sutherland, 2021). Contemporary information technology has made it easier and faster for customers to access data whenever and wherever they need it, increasing their alternatives and flexibility. To create a user-centric experience that facilitates full information exchange with the company's products, services, and employees, companies must rethink their infrastructure and technology platforms. Companies utilize information exchange to boost user engagement, generate successful co-creation experiences, and capture the value of co- creation (Darmouni & Sutherland, 2021). Olvera-Lobo and Castillo-Rodriguez (2018) suggest that companies need to create a new information system that promotes collaboration among customers, user groups, and stakeholders in the value chain. This will allow for the development of new data sources to create value. The introduction of mobile internet, cloud computing, big data, and the Internet of Things has started a new industrial and scientific revolution that challenges businesses' core capabilities, competitive edge, and ability to generate value. This study aims to define and explore the concept of information interaction competency in the next-generation IT environment, including its components, aims, and features. The study examines the influence of information interaction ability on co-value creation, and develops a theoretical framework for analyzing this ability. It investigates the meaning of various types of information interaction capacity (IIC) from the value chain and multi-agent perspectives, builds a classification system, and summarizes four types of IIC. The study validates the information interaction ability scale through empirical research on large-scale questionnaire survey sample data, and analyzes the results. The paper emphasizes that businesses can gain a competitive advantage by deploying and integrating three types of information interaction resources for value co-creation among value network members. Developing information interaction capabilities is crucial for companies to prosper in the modern business environment. Theoretical research on corporate information interaction capabilities is limited, and this paper contributes to the development of this area by introducing and refining the concept of information interaction capacity and constructing a theoretical model of information interaction capability on value co-creation.",
    "The China Internet Network Information Center, CNNIC, released its 35th Internet Development Statistics Report in February 2015. The report revealed that China had a total of 649 million Internet users as of December 2014, with 557 million accessing the Internet via mobile devices, indicating an 85.8% utilization rate for mobile Internet access. Additionally, 90% of Internet users in China were found to be using mobile instant messaging. These figures demonstrate the rise of the mobile Internet in China (Zahra and George, 2019). The mobile Internet represents a new generation of information technology that differs from the technology of the industrial age. It places greater emphasis on the interaction of information and provides a new avenue for the sharing of data. Technological advancements in the information industry, such as mobile internet, the internet of things (IoT), Web 3.0, cloud computing, and big data, have contributed to a golden age of computing (Wamb et al., 2017). These advancements have the potential to change people's ways of life, economic models, and social production. The development of new information technology has shifted the way individuals, groups, and things communicate. The impact extends beyond technology and influences social, economic, and cultural spheres. The widespread use of new technology can reshape people's lives, economic models, and social production. The mobile Internet has disrupted the traditional desktop-centric computing model and introduced a mobile-centric, app-based service form. This has caused significant changes in the way people interact with information. As a result, individuals now communicate information differently due to the advent of the mobile Internet. The Internet, industrial sensors, mobile phones, and various other fixed and mobile devices are all contributors to the phenomenon known as \"big data,\" which is comprised of organised, semi-structured, and unstructured data (Yuliping, 2013). IBM usually places the challenge of big data in either the \"3V\" or \"4V\" category. Big data is essential to the operation of several different IT applications, including mobile networks, cloud storage, Internet of Things devices, and Web 3.0. WeChat is a widely used messaging application in China. A typical cloud service that is capable of managing extremely large amounts of data. Its friend list, official account, and other features all have an impact on how information is transmitted between individuals, companies, and friends. The rise of new technologies such as mobile internet, big data, wearable technology, and web 3.0 has disrupted the process of creating value for many companies. The traditional information asymmetry in the trading market has shifted, with businesses and customers now exchanging knowledge. The focus has also shifted from enterprise-centric value creation to user-centric value creation, where businesses and customers work together to generate value. This change occurred about a decade ago, and companies now analyse results based on actual actions rather than basic assumptions. The application of information technology (IT) has become a key enabler for businesses to build systems, transform their processes, enhance management efficiency, and facilitate communication between users and enterprises. Moreover, IT has evolved into a strategic organizational capability that positions the user at the center of the experience and promotes the creation of collaborative environments between enterprises and users. In order to achieve value co-creation, traditional IT needs to be transformed expeditiously into interactive and experience-oriented IT. The conventional IT capabilities of an organization must be reimagined as interactive competencies that can contribute to the overall creation of user experiences. The adoption of this interactive capability presents new and improved strategic opportunities for enterprises. Thanks to the latest generation of information technology, consumers have greater access to a wider range of options and legal protections (Chen et al., 2020). This is because the new technology allows consumers to obtain information in a more convenient and effective manner (Chen et al., 2020). To keep up with these changes, businesses must redesign their infrastructure and technology platforms to create an experience environment centered on individuals that is capable of facilitating all-round information interaction with enterprise products, processes, and employees (Li et al., 2021). As users become the focal point of information interaction, it is essential for businesses to engage with information to enhance user interaction, build effective co-creation experiences, and achieve the benefits of collaborative work (Li et al., 2021). As a result of these shifts in the environment, traditional competition based on the value chain has been replaced by information-based rivalry (Teece, 2018). The competition in the digital age focuses on information contact between businesses and users, with this interaction often centered on the user rather than the business (Teece, 2018). In today's world, interaction, including conversation and communication, has become the most important ability for businesses, supplanting marketing as the most important talent (Nguyen et al., 2020). Enterprises now have a material foundation to construct this \"new capability\" and achieve value co-creation based on user experience due to the fast development and implementation of the new generation of information technology (Nguyen et al., 2020).",
    "The latest generation of information technology has provided consumers with a broader range of options and greater legal protections. This is made possible by the technology's ability to deliver information conveniently and effectively. Consequently, businesses need to reconfigure their infrastructure and technology platforms to support an experience-oriented environment that centers on individuals and enables comprehensive information interaction between enterprise products, processes, and employees. The reason for this is that users are increasingly becoming the focal point of information interaction. Thus, businesses must possess the capacity to engage with information to enhance user interaction, facilitate effective co-creation experiences, and realize the benefits of collaborative work. With the proliferation of new online firms, Internet thinking is gaining momentum and disrupting traditional industries. This shift extends across all sectors, as the Internet is not simply a physical object or software, but a mental framework and approach to the future. In order to compete in this new environment, organisations must develop information interaction capabilities to enhance communication, access, risk management, transparency, value co-creation, and win-win results with partners, ultimately leading to significant competitive advantages. The concept of information interaction capability is a novel idea that expands the research field of information interaction, enriches the capability foundation of value co- creation, and provides theoretical guidance for the transition from one information interaction paradigm to another. It also inherits and develops upon the resource-based theory, offering new perspectives and ideas for future research on enterprise capability. This has implications for established businesses, particularly those in manufacturing, as they have yet to recognise the power of information contact and often lack an enterprise-wide effort to create this strategic competence. Thus, the investigation of the enterprise's information interaction capability and its theoretical framework represents a unique effort in local enterprise management research with a focus on Chinese businesses, particularly older ones, adapting to the shifting information technology landscape. In the context of the next generation of information technology environment, studying information interaction capability and its influence on value co-creation seeks to answer the question of how enterprises can build new core competencies, gain long-term competitive advantages, complete transformation and upgrading, and ultimately lead the new normal of economy. This research aims to find a solution to these challenges by examining the relationship between information interaction capability and its impact on value co-creation. By combining traditional industries with information interaction skills, businesses can achieve significant competitive benefits and contribute to China's economic transformation and upgrading, ultimately creating value co-creation businesses and helping to accept the new economic normal. This paper presents several key concepts that require further elaboration. Information interaction capabilities of a company may be defined as its ability to employ various technologies and resources to communicate and collaborate with diverse stakeholders (Chen & Lin, 2018). Value co-creation is the process by which a company collaborates with its customers and other stakeholders to create new value that benefits all parties involved (Vargo & Lusch, 2008). Competitive advantage refers to the unique advantage that a company has over its competitors in terms of its products, services, or other factors that make it more attractive to customers. This advantage can be measured by metrics such as revenue or profit (Porter, 1985). The scope of this study is focused on exploring the measurement of information interaction capabilities, examining the relationship between information interaction capabilities, value co-creation, and competitive advantage, and identifying information interaction capabilities in small and medium-sized enterprises (SMEs) in China. The study aims to investigate how SMEs in China can gain a competitive advantage through value co- creation by enhancing their information interaction skills. The research will focus on SMEs in various industries in China and will involve collecting data through surveys and interviews to identify the information interaction capabilities of these companies. The study will also analyze the relationship between information interaction capabilities, value co-creation, and competitive advantage in these SMEs. The research findings will provide insights into how SMEs in China can leverage information interaction capabilities to enhance their competitive advantage and succeed in the market. This literature review aims to synthesize existing research on the influence of information interaction capabilities on value co-creation and competitive advantage of firms in China, identify key gaps in the literature, and provide recommendations for future research.",
    "The early value co creation hypothesis states that a company's ultimate objective is to create value with the assistance of its clients. When they work together, suppliers, partners, alliance members, and customers create a value co-creation system (Normann and Ramirez, 1994). According to Wikström's initial position, consumers can participate in the value creation process of businesses in a variety of links, including design, manufacturing, marketing, service, and distribution (1996). In a similar way to how businesses create value, consumers also do so. The significance of interaction in generating value has never before been recognised. It is best to learn anything through collaborative or participatory processes. Ramirez was the one who initially proposed the idea of value co-creation (1999). He believes that the term \"value Galaxy\" best describes the interaction and synergy that underlie value co creation, and that interaction serves as the main unit of analysis for value co creation. More business owners and scholars have begun to focus value coproduction since the turn of the century. If businesses want to be competitive in the future, they must focus on value co-creation. The creation of value shifts from independent creation by enterprises to co creation by customers and enterprises; the basis of value shifts from products and services to co creation experience; and the value creation process shifts from focusing on supply and demand matching to constructing an experience network. These concepts are based on the work of Prahalad and Ramaswamy (2004), who suggest a new value co-creation approach from a strategic management standpoint. The shared experience of the creators and the product or service that they've worked together to create is at the heart of value co creation. The \"conversation\" refers to customers' and users' active engagement and decision-making on subjects of mutual interest (ren Jifan, Xu Jin and Liang Xinhong, 2014). Individual customer motives have evolved away from basic product or service purchase and towards the whole quality of their acquisition trip. In the context risk management, \"risk\" refers to the possibility of end-user interests being jeopardised during product or service sales and consumption. The popular thinking suggests that corporations are more prepared to deal with threats than ordinary individuals. As a result, when communicating with clients, firms almost always emphasise advantages and minimise risks. Risk management assumes that consumers who actively engage in the value creation process are interested in knowing about and assuming responsibility for any risks connected with a certain product or service. Fourth, increased openness; in the traditional market, corporations typically exploit the knowledge vacuum between themselves and their clients. Nevertheless, as the next generation of Technology rapidly progresses, firms' advantages as information oligarchs are swiftly disappearing. Businesses would be wise to adopt a more open strategy in view of the increasing availability of information about their goods and technology to customers (Prahalad and Ramaswamy, 2004; Ren Jifan, Xujin and liangxinhong, 2014). The fifth co-creation experience is the result of communication between businesses and customers. As the foundation of consumer value evolves from physical things to a holistic co creation experience, we must pay particular attention to the joint design of firms and users, as well as all interactions between users, communities, and value network members. According to Prahalad and Ramaswamy (2004), value cocreation is the process of value co creation from individual consumers to companies and their experience networks, and then back to individual consumers, rather than the old business-to-business and business-to- consumer models. Customers generate value when they actively engage in all stages of the product life cycle, from conception to distribution. From this vantage point, the value co- creation theory based on customer experience gives a holistic understanding of the notion. Businesses in poor nations may utilise the value co-creation concept, which is based on consumer input, as a road map to success. Vargo and Lusch's (2008) argument that all economies are service economies has garnered considerable support from a macroeconomic perspective of economic growth and evolution. As a result, as compared to Prahalad and Ramaswamy, the value co creation theory based on service led reasoning has a restricted knowledge of value co creation. Notwithstanding the fact that the aforementioned theoretical schools have varied perspectives on value co-creation and varying interpretations of its significance.",
    "Yet, the two theoretical strands stated above offer similar paths for firms to achieve value co creation. The interaction between users and companies has arisen as a new centre for value creation, according to the consumer experience-based idea of value co-creation, and together, consumers and businesses build value through continual two-way communication and cooperation. To realise value co-creation, it is critical to establish and improve the quality of a wide range of interaction activities between users, enterprises, and value network nodes, as well as to build a customised user experience for end-users (Prahalad and Ramaswamy, 2004; Cova and Salle, 2008; Wuwenzhen and chenqijie, 2012). Businesses must reinvent the experience environment and build a flexible experience network in order to give customers with a personalised experience. Furthermore, as highlighted by Vargo and Lusch, contact is the better alternative for organisations to achieve value co creation (GR ö nroos, 2008; Zhou Hua, 2013). It is obvious that communication and cooperation are essential for successfully creating shared value. The resource-based theory of business holds that a company is made up of several resources that collaborate to accomplish a common goal. There are differences in competitiveness due to the vast array and diversity of resources that are available to businesses. Resources, such as financial resources, can be used for a number of reasons, claim proponents of the resource-based approach (Goyal, Ahuja, & Kankanhalli, 2020). The allocation of a specific use of various resources is a business decision; once chosen, this option cannot be changed. Since the reserve was established by a choice based on an earlier allocation, the organisation will always have access to it. This resource reserve will therefore constrain and influence the company's subsequent actions, suggesting that resource development tends to diminish the company's flexibility (Kapoor, 2018). A company with a 100 million Chinese Renminbi in the bank can invest in practically any industry, but after spending that money on raw materials and chemical equipment, it can only produce a small number of chemicals. Businesses continue to think about the best ways to use and develop their resources, nevertheless, as doing so may increase their specificity, value, and production efficiency (Winkler & Wulf, 2019). The aforementioned company, which is limited to producing chemicals, could recover $200 million in revenues if the judgement is accurate. When there is uncertainty in the external environment, such as society, the economy, industry, technology, and so on, decision makers are unable to make accurate evaluations of Simply said, complexity defines the interaction of various aspects in a business's external environment and the manner in which rivals respond to and change that environment. When decision-makers, executors, and stakeholders do not have common aims and instead try to change decision-making practises to benefit themselves more, intra- organizational conflict results. These factors provide each option a lot of room for variation, and the results will be very contextual and unexpected. The controlled resources of the organisation will undergo considerable variations after some time in operation due to the complexity of the enterprise's experience and the significance of little decisions that are challenging to measure. Getting a business back on track once it has strayed from its initial course may be very challenging. The resource-based hypothesis contends that firms' varying degrees of access to useful resources help explain why some are more profitable than others, and why those with more advantageous resources can extract economic rents from their competitors. Resources that serve as a source of competitive advantage must meet five criteria: high value, scarcity, uniqueness, and non-substitution. strategy research,\" carried out a comprehensive and methodical study of competitive advantage. It has been said by Porter that \"A company has a competitive edge in the market when the value that it generates as a result of the myriad of activities it engages in is greater than the costs that are involved with the generation of that value. The cost advantage and the distinguishing advantage of a business are the two components that make up its competitive advantage \". Barney (1991), a seminal figure in the field of resource-based theory, offered the following definition of competitive advantage: \"When a company executes a value creation strategy at a time when none of its other competitors are doing the same, the company gains a competitive advantage over its competitors. The term \"sustainable competitive advantage\" refers to a situation in which competitors are unable to simply replicate the benefits obtained through the value generation process \". According to Grant, an additional influential figure in the RBV theory, \"competitive advantage means that a corporation may consistently achieve a higher profit margin than its competitors or a competitive scenario with this possibility.\" So, Grant's definition of a competitive advantage includes not just a short-term advantage but also an advantage that lasts for a longer period of time. In point of fact, academic researchers concentrate their efforts more on tracing the roots of a company's distinct advantage in the market. In addition to this, if the benefits of this strategy cannot be duplicated by other companies, then this strategy can be considered to have a sustainable competitive advantage.",
    "In most cases, owners of businesses enjoy not one but two distinct advantages over their competitors: the capacity to both enjoy a high standard of living and to enjoy a long and healthy life span. It may be possible for the ideas of \"live well\" and \"life long\" to more effectively reflect the competitive advantage that enterprises in the Internet age enjoy. This is especially true for newly established Internet businesses. Jack Ma, chairman of the board at Alibaba, believes, among other things, \"Only by developing into a platform that is accessible to all users can online businesses hope to enjoy a prosperous and long-lasting future presence on the internet. They hope that in ten years, they will have had a regular life and developed normally. They have to make significant adjustments to the way they think about organisational, talent, and cultural problems \". The President of the Huawei Group, Ren Zhengfei, is of the opinion that \"The short-term success of a company is directly proportional to its financial indicators and its capacity to remain operational. On the other hand, the long-term success of a company is determined by the robustness of its strategic pattern, the vitality of its business ecological environment, and its dedication to achieving sustainable growth. It is possible for it to pull through the ordeal and live a long and healthy life.\" In both human civilization and the natural world, information for all of time predominates. In most contexts, information may be understood to refer to things like news, knowledge, intelligence, etc (Silver & Vegholm, 2009). But, information, knowledge, and intelligence are not always interchangeable terms in the same way that news is. The scientific community as a whole is in agreement that information, in addition to material and capacities, is one of the three primary components that comprise the objective world. There have been a great deal of different interpretations of material offered by scholars from ancient times up until the current day (Stockdale, Lin, & Stoney, 2015). Cybernetic scholars, on the other hand, view information as the content and names that people exchange with the external world in the process of adapting to it and making that adaptation work back on it. Information scholars, for example, view information as something that is used to eliminate uncertainty (Huarng & Yu, 2011). Some academics are of the opinion that information is something that represents the shapes, connections, and distinctions of things, and that information is held not in the items themselves but rather in the distinctions that exist between them. In addition to this, information is understood to be the processed data that is tailored to the requirements of the users' decision-making processes. In a nutshell, information is both an abstract and a complicated idea, and there is not yet an established definition of information that is both comprehensive and correct. The meaning of information has been developed by the traditional definitions provided by the aforementioned academics, who have approached the concept of information from a variety of perspectives. In this article, we argue that information is both the subject matter and the name of two-way exchange with the outside world. To put it another way, information is characterised by transferability and exchangeability, and it would be augmented by the term \"exchange.\" The very act of interaction is fraught with a plethora of connotations. On the one hand, interaction encompasses the concept of harmony, which refers to coordination and compatibility (Efrat & yna, 2021). On the other hand, interaction literally comprises the meanings of alternation, mutuality, and reciprocity. The use of communication technology to establish a mediated environment in which people, individuals and groups, and groups may take part in the exchange of messages with one other, either synchronously or asynchronously, is what scholars mean when they talk about interaction (Mathews & Healy, 2017). In a setting, similar to a market, interaction is no longer restricted to the exchanging of messages; rather, it now encompasses monetary transactions as well as the trading of goods, services, and personal experiences relating to relationships. In the realm of computing, interaction refers to a process in which the user feeds information into the computer system, and the computer then replies to that information. Users of a computer system have the ability to engage in communication and conversation through a process known as interaction. This mechanism is tool-centered, medium-supported interactivity. Interaction in a computer environment is said to involve both human-computer interaction and interpersonal engagement, according to a variety of items. While interacting in a digital setting, it is necessary to pay attention to the manner in which one interacts as well as the effectiveness of that contact utilising a variety of instruments, including ICT. As a result of advances in information technology, the interaction that takes place in a computer environment has placed an excessive amount of emphasis on the utility of the product in order to achieve greater levels of productivity. The idea of interaction originates from the design of human-computer interaction in the discipline of computer science, which is where the field of interaction design comes from.",
    "interaction of information between businesses and their customers, business partners, and staff is the subject of this study. The term \"interaction\" refers to the transmission of information, the interchange of information, and the consistency of information; the term \"mutual\" relates to interaction, sharing, and the addition of value. Therefore, this paper considers that information interaction is not only unidirectional information transmission or two-way information exchange, but also continuous, repeated, and deep information interaction between subjects to achieve the minimization of information distortion and the maximisation of information value-added between subjects, which means information consistency and information value-added between subjects to achieve the maximisation of information value-added between subjects to achieve the minimization of information distortion between subjects to achieve the maximisation of information value-added between subjects to achieve the maximisation of information value (Adams & Comber, 2013). Therefore, information interaction possesses the following qualities: I continuity, in that information interaction is continuous in time; (ii) repetition, in that information interaction is not done just once but rather repeated many times; and (iii) depth, in that information interaction is not simple or superficial information but rather information that is complete, accurate, and deep. The enterprises are able to achieve outcomes that cannot be realised by information transmission and information exchange if they engage in information interaction that is continuous, repeated, and deep. This helps to minimise information distortion and maximise the amount of information that has value added to it. This study investigates the fundamental components of information interaction capacity by employing Grant's (1991) resource classification framework as the primary research tool. The components that make up IICS can be broken down into three categories: information interaction infrastructure, information interaction human resources, and information interaction intangible resources. The most important feature of information interaction capability is interactivity, which is the most important feature that distinguishes information interaction capability from other enterprise capabilities. According to the definition of interaction in this article, interactivity is the behavior or activity state of enterprises, users and partners. Barney and hesterly (2012) believe that only when resources are valuable, scarce, difficult to imitate and used by organizations can resources maintain sustainable competitive advantage, that is, VRIO framework. The VRIO framework is an update to the VRIN framework. The VRIO framework is irreplaceable under the condition that the original VRIN framework is difficult to imitate. At the same time, the organizational process is added as a way to utilize the potential of resources. This paper holds that IICS is a core competence based on information interaction resources, which has inherent value, scarcity, difficulty in imitation, difficulty in substitution and organization utilization. Take Xiaomi as an example. When competitors are still selling mobile phones, Xiaomi has formed a sense of user participation through its relatively strong IICS, which is unique and scarce. Whether it is the research and development of new mobile phones, the iterative upgrading of MIUI, or the choice of hardware configuration, to a large extent, it is the crystallization of user participation. It is estimated that 1/3 of the functions of MIUI are determined by rice noodles and 2/3 by Xiaomi itself. This sense of participation is a unique gain for users. To put it bluntly, Xiaomi sells a sense of participation. In addition, for users, Xiaomi is not only a mobile phone product, but also a user experience created through IICS, specifically including the showing off demand and sense of presence: when Xiaomi started to make mobile phones in 2011, it organized an activity of \"I am a mobile phone controller\" through the social network platform to let users show off their used mobile phones and show off to friends. Xiaomi organizes a lot of similar activities every year to meet the users' need to show off and sense of presence. Moreover, the sense of achievement: in Xiaomi community, many sections are managed by users. They feel that they have a sense of achievement by helping other users. Xiaomi satisfies users' sense of achievement, which is the essence of Xiaomi. Technical know-how and other knowledge assets, such as employee training, technical skills, etc., are examples of personnel-based resources (Barney,2021). People, which can be either in-house or drawn from the wider pool of talent accessible to an organisation, comprise the \"information interaction human resources\" (Bharadwaj, 2020). According to the authors of this paper, the technical and management expertise of all personnel and personnel involved in information interaction between enterprises and users or user communities, other members of value networks, and internal employees of enterprises constitute information interaction human resources.",
    "Personnel involved in information interaction need both technical knowledge in that field and managerial expertise (Bharadwaj, 2000). Companies with strong technical skills are able to analyse, develop, design, and implement a wide range of information interaction methods, software, and tools; they are also able to interact with users through a variety of new forms of social marketing, including microblogs, wechat, and online forums. Management skills encompass the knowledge, practises, and conventions of an organization's structure and processes, as well as the procedures and approaches to coordination and management that boost the productivity of information interaction staff. Longevity in the field allows for the development of complementary technical and information interaction management abilities. The ability to effectively handle information exchanges is often recessive and develops slowly throughout life. They exist only in specific businesses and regions. These are the primary means through which businesses may get a foothold in their industries. Xiaomi's MIUI, for instance, has used developing information interaction tools like microblog and Mobile Forum extensively in the research and design stage to conduct in-depth information contact with consumers. Also, Xiaomi has established a unique information platform for interacting with consumers in order to increase the efficiency of information contact with users (Danneels,2018). Tencent CDC employs a number of design strategies to guarantee a high-quality user experience. They include user role, scenario, and task analysis, as well as information interaction techniques and software tools tailored to the user experience. To greatly enhance the collaboration efficiency of various professional designers, the programme facilitates communication between interaction designers, visual designers, and development engineers to realise seamless cooperation between interface designers and functional staff. In addition, Tencent CDC has organised several internal groups and systems to increase the efficacy of data exchange (Drnevich and Kriauciunas, 2019). Departmental routes for sharing information, such as the daily project morning meeting; Prowork, a tool for managing design projects created by Tencent CDC to boost designers' productivity, etc. Information interaction infrastructure consists of interactive tangible resources and a sharing platform centered on events. Tangible resources include technology and physical assets used by enterprises, such as factories, equipment, raw materials, etc. (Barney, 1991). Interactive tangible resources refer to the tangible resources involved in the process of information interaction between users and enterprises or cooperation (varadarajan, Srinivasan and vadakkepatt et al., 2018). This paper holds that the information interaction infrastructure is to jointly create experience and experience environment. Based on the new generation of information technology, it is to build an open sharing platform with events as the core, including information interaction technologies such as data management services, infrastructure, network communication services, application software, big data platform and other physical equipment resources. First of all, the information interaction infrastructure is the foundation for enterprises to carry out information interaction applications and services with other information interaction subjects. It is an infrastructure built to meet the human resources and intangible resources of information interaction. Its purpose is to enhance the enterprise's information interaction ability. Secondly, unlike the information technology infrastructure, which only involves the hardware and software resources of information technology, the information interaction infrastructure includes hardware and software resources, but is not limited to information technology. For example, in order to improve the experience of different types of users, Tencent's \"user research and experience design center (hereinafter referred to as CDC)\" has built a special \"user experience room\" room to create a warm experience environment for users (Barney,2019). Furthermore, the information interaction infrastructure is a platform composed of hardware and software resources owned and available by all enterprises from inside and outside the enterprise. Take Xiaomi as an example. Wechat, microblog, forum and QQ space are important media for Xiaomi to interact with users and Xiaomi's internal information. However, these infrastructures are not \"owned\" or \"controlled\" by Xiaomi. However, they are resources that Xiaomi can \"use\" and belong to Xiaomi's information interaction infrastructure. A strong information interaction infrastructure can provide a technical platform for responding to rapidly changing user needs and develop innovative information technology applications to support new business processes and business activities (Bhatt and Grover ,2015). When enterprises deal with the rapidly changing market environment and technological uncertainty, the infrastructure with flexibility and sharing can make enterprises more competitive. For example, INDITEX, a Spanish retailer, is a pioneer in the fast fashion industry. It takes 4 to 12 months for most retailers to bring new products to the market. Zara takes only two weeks. Behind Zara's ability to respond quickly to the market is its intensive and efficient management and powerful information exchange infrastructure: all Zara production orders come from the sales of the day, current inventory and sales forecast in the past two weeks in all exclusive stores around the world, as well as the e-mails and phone calls of front-line employees about customers' clothing needs, The latest fashion information collected by fashion \"buyers\" distributed in various fashion occasions, through excellent standardized product letters (Bi, Davison and Smyrnios,2017).",
    "The most important contribution made by RBT was determining the unique value that an organization's intangible assets bring to the table. Intangible assets of a corporation include things like its culture, business processes, management models, brands, and knowledge assets (Barney, 2021). According to Bharadwaj (2020), businesses are able to reap benefits from the numerous and diverse intangible resources that they possess. These resources have their roots in the social structure and historical backdrop of the organisation (Bharadwaj, 2018). In the cutting-edge IT environment of today, it is absolutely essential to have a solid understanding of how to use information interaction to produce superior intangible resources for enterprises. When two organisations work together, the information they share can only add to what each of them already possesses. It lays an emphasis on user-centric, user-driven, and fast adaptable production, manufacturing, logistics, and supply chain operations. Throughout the promotion phase, the Hukou tablet-centric marketing strategy is emphasised. When it comes to customer service, having a CRM that was designed and constructed with the end-perspective user's in mind is of the utmost importance. For instance, Xiaomi has opened up the process of producing goods, services, brands, and sales to promote customer input in order to create a more fulfilling experience. This helps Xiaomi provide a better overall product (Girod and Wittington,2017). The statements made in the article suggest that Xiaomi's \"Participatory\" consumption model has at its core an interactively focused business process. The creation of business processes that are centred on interaction is likewise significantly reliant on the other two information resources that involve interaction. When an organisation has competent information interaction human resources, it has a greater likelihood of establishing a positive dialogue platform within the organisation, with its users, and with other members of the value network. This will allow all of these stakeholders to participate in the enterprise's entire business process while also serving as a material basis for the interaction-oriented business process (Gonzalez-Benito and Isuarez-Gonzalez,2016). The concept of value co-creation was first discussed by Normann and Ramirez, who also included background information on the word. After researching the value chain analysis of various companies, Normann and Ramirez concluded that the globalisation of goods and services as well as the speedy transformation of the strategic environment had caused the focus of strategic analysis to shift away from the value chain. When all of the stakeholders engaged in the value creation process, including suppliers, business partners, alliances, and customers, work together to accomplish common goals and review the performance of the system along the way, value is generated in the value creation system. IKEA is a good illustration of this new logic of value creation since it is no longer a link in the value chain; rather, it is a constellation centre where services, goods, and design all come together. This shift means that IKEA can no longer be considered a component in the value chain (Iansiti and Clark,2014). Increasing a company's chances of being successful in general is one of the primary reasons why gaining a competitive advantage is so important for firms. In order to achieve and maintain a competitive advantage, businesses require resources and competencies that are difficult for their competitors to replicate (Barney, 2020). A source of competitive advantage can be found in information interaction resources such as capabilities, infrastructure, human resources, and As shown in Figure 1, the conceptual frame illustrates the rationale of this study, in which, the variables hold the assumption that companies emphasize and develop their information interaction capabilities to explore the relationship between information interaction capabilities, value co-creation and competitive advantages. In China, there is a substantial corpus of studies on how organisations' information interaction skills influence value co-creation and competitive advantage. Yet, the existing corpus of knowledge has unsolved questions. There may be a scarcity of empirical studies on the effects of information interaction skills on value co-creation and competitive advantage in Chinese enterprises. While various researchers have examined the relationship between information interaction skills and competitive advantage (e.g., Kshetri, 2014; Wu & Wu, 2017), its expression in the Chinese context has gotten less attention. Because the Chinese market is unlike any other, this is a big vacuum. Cultural norms, regulatory constraints, and market conditions, for example, can all have an impact on how information interaction skills translate into value co-creation and competitive advantage.",
    "Another area where the literature may benefit from more research is the role of human resources in the relationship between information interaction skills and value co- creation/competitive advantage. Even though some studies have examined the importance of human resources in developing and leveraging information interaction capabilities, there is a need for more research on how specific human resource factors, such as training, recruitment, and retention, impact value co-creation and competitive advantage in the context of Chinese firms (e.g., Jiang et al., 2015). With regard to the above literature discussion and the present research objective, the following indirect and mediating hypotheses is developed: H5: Value co-creation mediates the relationship between information interaction with human resources and competitive advantage in SMEs, China H6: Value co-creation mediates the relationship between information interaction infrastructure and competitive advantage in SMEs, China H7: Value co-creation mediates the relationship between information interaction intangible resources and competitive advantage in SMEs, China This is a positivist, objective, quantitative research. The sampling technique, research population data collection, research design, and data analysis are discussed in this section. This study will use a cross-sectional survey research design. The survey will be administered to a sample of SMEs operating in Henan Province, China. d through a structured questionnaire that will be distributed to the selected SMEs. The questionnaire will comprise closed-ended questions and will be administered through an online survey platform. The independent variable in this study will be information interaction capabilities, while the dependent variable will be a competitive advantage. The mediating variable will be value co-creation. The all-encompassing method that will be applied to finish the research is referred to as the \"research design,\" and the word \"research design\" is the term that is used to define it. The strategy for the study also includes the methods of data gathering and analysis that will be used. The reliability of the research and the credibility of the findings are directly related to the quality of the research design used in the study. For this investigation, an exploratory research technique was utilised. This strategy is appropriate when there is a lack of information or expertise about a phenomenon, or when the researcher does not have a clear understanding of the research question they wish to answer. The primary objective of exploratory research is to generate new ideas, improve the understanding of those that already exist, and identify questions that need to be investigated in further detail. Exploratory research designs are also adaptable, giving the researcher the ability to modify their methodology and the questions they ask as the study progresses. A survey in the form of a questionnaire was used for this investigation so that data could be collected. If you require information from a large number of individuals in a short amount of time and on a limited budget, a questionnaire survey is your best bet. In the interest of this investigation, an online questionnaire will be used to conduct a survey of forty Chinese small and medium-sized firms (SMEs) operating in the information technology sector. Using a scale that ranges from one (strongly disagree) to seven (strongly agree), respondents will be asked to indicate the degree to which they agree or disagree with each statement using the Likert scale. Participants in this study are senior executives and directors working for China-based SMEs that are involved in the information technology industry. We selected this demographic because they are the main decision-makers in the businesses and have a deeper awareness of the elements that drive value co-creation in their particular firms. In this study, there were a total of 250 people participated in the survey, which is regarded to be an adequate sample size. The G-power formula is used to calculate the sample size. In this study, simple random sampling is used. The goal of the sample is to randomly choose senior managers and directors from China-based SMEs that are working in the information technology industry. The selection criteria for the sample will include the participants' levels of knowledge and experience in the information technology field, as well as their responsibilities as decision-makers in the businesses to which they belong. The selection of a sample that is most relevant to the research topic may be accomplished through the use of purposive sampling, which also contributes to the validity of the findings that are obtained. A questionnaire is designed to collect the data.",
    "In conclusion, the research project must consist of vital components such as the research design, research method, population, and sampling strategy. The questionnaire survey technique and the exploratory research design are suited for this study because they provide for flexibility in the research topic and efficient data gathering respectively. The population of top managers and directors from China-based SMEs that are active in the IT sector was chosen because they have the necessary expertise and experience to provide insights into the factors that influence value co-creation. These individuals were chosen because China is home to a large number of SMEs. In conclusion, a method known as purposive sampling was applied in order to pick a sample that is best suitable for the research topic and also contributes to the validity of the findings obtained by the study. A questionnaire, which is an example of an instrument for collecting data that is self- administered, was utilised as the research instrument in this study. The literature research was used to inform the development of the questionnaire, together with the comments of subject matter experts. The purpose of the survey was to determine how well small and medium-sized enterprises (SMEs) in China interact with information, create value together, and gain a competitive edge. Part A of the questionnaire is designed to collect demographic information about the respondents, while Part B of the questionnaire is designed to include questions relating to the study variables. The questionnaire is divided into two sections. It was initially necessary to carry out a pilot study with a sample size of fifty people in order to establish the content validity of the questionnaire items. Before releasing the final questionnaire, the pilot study is conducted to test the reliability and validity of the questionnaire. One of the most important aspects of any research project is the data analysis. The use of statistical software tools such as SPSS (Statistical Package for the Social Sciences) and Smart PLS (Partial Least Squares) has become increasingly important. These software tools are designed to assist researchers in analyzing complex data sets and modelling relationships among variables. SPSS is a widely-used software package for statistical analysis. It provides a range of functions for analyzing data, including descriptive statistics, inferential statistics, and data visualization. With SPSS, researchers can perform a wide range of statistical tests, including t-tests, ANOVA, regression analysis, and factor analysis. On the other hand, Smart PLS is a software package for structural equation modelling (SEM). SEM is a statistical method used to test complex models of relationships among variables. Smart PLS is particularly useful for research in the social sciences, where complex models of causality are often used. In research, SPSS and Smart PLS are typically used in combination to analyze and model complex data sets. SPSS is used for descriptive statistics and preliminary analyses, while Smart PLS is used for more advanced analyses such as structural equation modelling. The use of these software tools in research has several benefits. First, they enable researchers to handle large data sets and complex models with ease. Second, they provide a range of analytical techniques that can be used to test hypotheses and build models. Third, they facilitate the communication of research results through clear visualizations and reporting. For the present study, a descriptive summary of the collected data will be presented using SPSS software. It involves determining patterns, correlations, or trends based on the interpretation of data that has been obtained through the use of analytical and logical thinking. Data screening was performed so that errors in data entry may be found. This screening included: (missing data, outlier, normality, linearity, homoscedasticity, multicollinearity, validity, reliability, descriptive data and test of response bias). SPSS is used to test the reliability, validity, and normality of the data. Moreover, descriptive data is reported by the use of SPSS software. SMART-PLS is used to test the relationship between the study variables as well as model fit and prediction power. The theoretical and practical importance of information interaction capacity cannot be understated, and research into the capabilities of information interaction and value co- creation can provide insight on the modernization and transformation process in traditional firms. The findings of the present study will have a significant practical implication for SMEs in Henan Province, China, particularly in terms of value co-creation, competitive advantage, and information interaction. Utilizing information interaction plays a vital role in value co-creation and competitive advantage. SMEs should develop effective systems and processes that facilitate seamless information sharing, collaboration, and knowledge exchange within the organization human resource management, infrastructure and intangible resources. This may involve implementing advanced technologies, adopting data-driven decision-making practices, and promoting a collaborative work environment. By harnessing the power of information interaction, SMEs can enhance their agility, responsiveness, and innovation capabilities, leading to improved performance and sustained competitive advantage.",
    "The present study highlights the importance of value co-creation in SMEs. Managers and decision-makers in these organizations should prioritize establishing collaborative relationships with customers, suppliers, and other stakeholders. By involving these stakeholders in the co-creation process, SMEs can leverage their knowledge, expertise, and resources to create superior value propositions. This approach can foster long-term relationships, customer loyalty, and ultimately drive business growth. The theoretical implications of this article add to the body of knowledge on value co- creation, competitive advantage, and information interaction in SMEs, particularly in Henan Province, China. The study makes a connection between competitive advantage and information interaction skills. This study adds to the body of knowledge on how businesses may use information technology and capabilities to gain and maintain a competitive advantage by emphasising the value of information interchange, knowledge sharing, and collaboration within SMEs. This context-specific analysis provides valuable insights into the unique challenges and opportunities faced by SMEs in this particular region and enhances our understanding of the broader applicability of the study's findings. The present study provides novel approaches for studying local company management in China and suggests that research on the capabilities of information interaction and value co- creation can provide insights into the modernization and transformation process in traditional Chinese firms. Companies need to develop their information interaction abilities in the context of the latest IT developments to gain a significant edge in today's economic climate. Therefore, the theoretical and practical importance of information interaction capacity cannot be understated. It is critical to draw attention to the limitations and restrictions that this study possesses. To start, the research is restricted to Chinese enterprises, thus its conclusions might not be applicable to organisations in other countries or places. Second, because the research is based on company self-reported data, it may have been biased or presented inaccurately. As a result of the research's constrained scope, it is conceivable that not all significant factors that influence the relationship between information interaction skills, value co-creation, and competitive advantage were considered. The Institutional Review Board (IRB) ethical guidelines were followed in conducting this study. The participants were informed of the purpose and parameters of the study, and their confidentiality and anonymity were ensured. All individuals gave informed consent before completing the questionnaire. The data collected from the participants were absolutely confidential and only utilised for study."
]