[
    "Abstract: After decades of reform and opening up, China's development structure is constantly upgrading, and the quality of development is also constantly improving. As one of the main sources of clean energy, electric energy plays a vital role in people's production and life. Therefore, how to better serve all aspects of the society with power production technology is the current development must pay attention to the topic. This paper focuses on the analysis of the current situation of electric power production technology and its future development trend. Therefore, under the circumstances that logistics resources are limited and logistics activities are increasingly dependent on the market and industrial structure, Henan Province should scientifically plan and rationally allocate and use logistics resources in implementation of \"One Belt, One Road\" strategy to achieve the best input and output, improve the overall efficiency and level of logistics; vigorously develop local economy from the perspective of system coordination, realize coordination among logistics enterprises, logistics industry coordination, as well as inter-industry coordination and regional coordination. Power technology is more commonly used in the application of production, enterprise production needs many types of power equipment, combined with software technology, such as information technology and multimedia technology, power technology should be constantly aimed at these equipment innovation, reduce unnecessary waste, improve the production efficiency of enterprises.In China's economic construction, industrial structure and social investment are of vital importance. Investment is the driving force of economic growth, while industrial structure is related to economic aggregate and economic development level. Social investment determines the direction of industrial structure adjustment. Industrial structure affects the focus of social investment. The two factors restrict each other and promote each other, and jointly promote the economic development of our country. With the application of high-tech and information technology, different kinds of equipment have become more and more complex in recent years. At the same time, different maintenance strategies also tend to be applied for different components of equipment, making it difficult to grasp the law of equipment air material in typical equipment consumption and leading to heavier workload of air material in typical equipment consumption forecasting. To meet the needs of equipment maintenance, an organization need to store a certain variety and quantity of air material in typical equipment in advance. To ensure that air material in typical equipment stored in the organization is of reasonable quantity and good quality and can timely and reliably guarantee the equipment maintenance needs, a scientific and valid method of air material in typical equipment consumption forecasting must be given. If the storage capacity of air material in typical equipment is too small, the equipment’s successful completion of the training mission can not be guaranteed; if the storage capacity of air material in typical equipment is too much, it will cause overstock which affects economic benefit of the components. Many scholars have conducted in-depth studies of methods of air material in typical equipment consumption forecasting (LIU Xiao-qun, 2005). They also have done scientific researches on spare parts consumption forecasting (LI Yu-feng, 2014). Through the analysis of the previous literature, it can be found there are few undertaken research works of the methods of air material in typical equipment forecasting based on a variety of maintenance strategies (WANG Liang, 2005). A certain type of equipment is maintained with a combination of inspection and regular maintenance (WANG Tie- ning, 2009). Within one year, in the normal training phase of the equipment, the equipment can be inspected and after the end of the training, regular maintenance of the equipment can be carried out (LI Yu- feng, 2014). There may exist two maintenance strategies called “non-replacement” and “condition based replacement” in the inspection of the air material in typical equipment; there may exist three maintenance strategies called “non- replacement”, “certain replacement” and “condition based replacement” at the regular maintenance of equipment. “Non-replacement” after inspection refers to the strategy not to replace air material in typical equipment after failure or problem is found in inspection when the replacement condition is not available; “condition based replacement” after inspection refers to the strategy to replace air material in typical equipment after failure or problem is found in inspection when the replacement condition is available; “non-replacement” after regular maintenance refers to the strategy not to replace air material in typical equipment after failure or problem is found in regular maintenance when the replacement condition is not available; “certain replacement” after regular maintenance refers to the strategy to replace air material in typical equipment no matter the component is damaged nor not during regular maintenance when the replacement condition is available; “condition based replacement” after regular maintenance refers to the strategy to replace air material in typical equipment if the service time of the air material in typical equipment exceeds a predetermined value during the regular maintenance when the replacement condition is available (LI Yu-feng, 2014).",
    "The determination of the storage capacity of air material in typical equipment should be based on the consumption law of the air material in typical equipment. How to scientifically predict the air material in typical equipment consumption of the equipment under the circumstance of various maintenance is a key issue in this text. Electric power technology started from the silicon whole electronic product flow device in the late 1950s and early 1960s, and its development has gone through the rectifier era, inverter era and frequency converter era, promoting the application of electric power technology in many new fields. From 1960s to 1970s, the development and application of high-power silicon rectifier tube and thyristor opened the rectification era of power electronics technology, and electrolytic, traction, transmission and other industries developed rapidly. From 1970s to 1980s, AC motor frequency control technology developed rapidly. Frequency conversion speed regulation technology converts DC into alternating current of 0 ~ 100 Hz. The large-scale use of GTR and GTO brought power electronics technology into the era of inverter, but the inverter only stayed in the low frequency range at that time. In the eighties, due to the development of computer, large-scale integrated circuit to very large scale integrated circuit rapidly forward, so people thought of integrated circuit and high voltage, high current combined together. Icbts and MosFeTs were born. This completes the traditional power electronic technology to modern power electronic technology leap. Later, modern power electronics technology combined with computer communication equipment, applied to all aspects of our lives. Through an analysis of the problem of lacking of spare parts consumption data in some environments, this paper combines spare parts consumption data in different environments, applies equipment reliability theory and probability theory to establish spare parts consumption combination models. The calculation method could be used to solve the difficult problem of developing a reserve program of spare parts since it is not easy to find out spare parts consumption rule. The models provide a theoretical basis for calculating reserves of spare parts scientifically and have an important guiding significance. The maintenance strategy of equipment components determines how the component will be replaced in the next year, therefore it is closely associated with the air material in typical equipment consumption generated by the equipment in the next year. In addition, the four main factors including components lives, remaining lives of components, the age of the equipment and next year’s operation time have a direct impact on the air material in typical equipment consumption generated by equipment in the next year [6]. (1)Next year’s operation time. Under the condition that the other factors that influence air material in typical equipment consumption are unchanged, the length of equipment operation time determines the quantity and amount of air material in typical equipment consumption. The longer the next year’s operation time is, the larger the quantity and amount of air material in typical equipment consumption is; the shorter the next year’s operation time is, the smaller the quantity and amount of air material in typical equipment consumption is. (2)The age of the equipment. The length of the age of the equipment decides the equipment maintenance level in the next year. When different levels of maintenance are undertaken for the equipment, the maintenance strategy adopted by the same component may not be the same. Therefore, determination of the air material in typical equipment maintenance strategy for next year should be based on the age of the equipment. Remaining lives of air material in typical equipment. Remaining lives of air material in typical equipment refer to the interval time from the counting date after the air material in typical equipment has been working for some time to occurrence of malfunction. Remaining lives of air material in typical equipment are also random variables. If the air material in (3) Air material in typical equipment lives. Air material in typical equipment lives refer to the interval time from usage of air material in typical equipment as new products (0 time) to occurrence of malfunction. Air material in typical equipment lives are random variables, and hence the time when the air material in typical equipment has malfunction is uncertain. However, under normal circumstances, the longer the average air material in typical equipment lives are, the smaller the air material in typical equipment consumption quantity.",
    "Demand analysis of professional ability Targets to these students of logistics management for objects who work in production logistics in line with manufacturing enterprise and service logistics for logistics enterprise, mainly including four levels, such as basic ability, professional ability, occupation ability and key ability. Basic skills are basic operational skills in logistics work. Professional competence is professional ability and knowledge required for a certain specific job, by which students can complete technical work independently and fulfil post responsibilities with strong sense of accountability. Occupation ability is the ability and knowledge of cross- specialty and interposition basing on basic ability and professional competence, which is sustainable development ability. people are high level persons in the whole project team, who have clear analysis thought of whole project operation and organization in this level. Then, people at this level can lead a project team and make effective planning schemes in order to motivate team members to work effectively. Key ability is to improve core competitive ability. When environment or jobs have changed, people can rapidly adapt environment and acquire new skills and knowledge, which have systematic learning ability, suitable ability, clear role definition and organization innovation ability, and so on. Key ability is to emphasize cultivation of learning ability, not limited to a specific professional knowledge and ability, but including ability of team organization and team coordination, planning ability, design ability and innovation ability, etc. These abilities can be cultivated more effectively in practical environment so that scene practical teaching construction should be paid more attention in the process of students’ vocational ability training. Theoretical courses are mainly taught by teachers and students are mostly stay in the stage of “understanding- memory” Shallow learning and passive learning, which lack problem analysis and thinking ability. Practice teaching mainly takes initiative to search learning and grasp knowledge in interactive course or activity by taking actions with brains, doing in the process of learning and learning in the process of doing, which develop students' practical ability, team cooperation ability, strain ability, analytical ability and life-long learning ability (Wang, 2015). Power electronics technology is a very important branch of electronic technology, this technology was discovered as early as the 1950s, but not widely used, after continuous study of the birth of the application of frequency converter, this technology is widely used in various industries, after continuous innovation, so that the power electronics technology tends to be intelligent, scientific and technological. It is very obvious that the transmission capacity of the traditional power electronics low-frequency technology signal is relatively low, the band support is not much, the strength is not obvious, more and more do not meet the rapid development of social needs, the most obvious difference of modern electronic power technology is to become high frequency, so that the intensity of the band increases, the signal transmission efficiency is higher, fully meet the needs of power electronics technology. In recent years, the level of domestic science and technology is improving rapidly, and the development of information, networking and science and technology is getting faster and faster, thus effectively promoting the development of domestic industries Degree, the electric power industry is also developing rapidly towards the direction of intelligence and automation. The protection technology of power transformer can obviously improve the stability of transformer equipment and reduce the difficulty of transformer maintenance, which is very useful. Automatic disconnect protection is often used in small scale transformer equipment. This method has obvious advantages, including simple operation, high convenience and simple circuit. However, in the new period, due to the transformer equipment has put forward more stringent requirements for system protection, the sensitivity of automatic disconnection technology is low. From the perspective of improving practicability, the relevant operators should actively improve the sensitivity of automatic disconnection technology. Thus, the automatic gas disconnection mechanism is established to promote the stable operation of transformer equipment. Because of the rapid development of Internet technology computer industry in the new era computer technology in the electric power technology has played a greater role. With the help of computer technology, the monitoring state management of transformer equipment can be effectively carried out, and combined with the fault situation for accurate positioning, for the related operation to lay a good and stable foundation for troubleshooting work.",
    "The application of power transformer protection technology, first, practical engineering application, transformer is generally installed in the outdoor environment, affected by weather conditions prominent role, especially lightning weather. Therefore, the lightning arrester must be placed around the power transformer equipment in time, which has a positive effect on reducing the negative effect of thunderstorm weather, and can obviously improve the reliability of the power supply system. Second, the daily maintenance of the power transformer, taking into account that the transformer is in the external environmental conditions all year round, vulnerable to rain, snow, dust and other substances erosion, which will lead to transformer rust corrosion and other problems. To this end, the relevant operators must regularly or irregularly carry out transformer equipment inspection, and timely derusting work, so as to effectively improve the efficiency of transformer equipment, improve its effect. Along with higher education entering into the phase of connotative development in our country, more and more colleges and universities focus positioning of talent training reform on demand of industrial development. Last few years, a large number of areas and schools have carried on a series of research from varying degrees such as talent training mode, professional development and practical teaching, which aiming at improving students’ professional ability and cultivating applied talents with high quality suitable for production logistics in manufacturing enterprise and service quality in logistics enterprise. The most important way of cultivating students’ professional ability is to strengthen practical teaching except theoretical teaching training. In recent years, practical teaching of applied colleges has obtained some achievements, and students’ practical ability also has improved greatly, however, there is a certain gap between enterprise actual demand and talents cultivation target, including lack of systematic arrangement of practical curriculum, lack of practical fields and facilities, lack of practical teaching experience for teachers, which lead to quality of practice teaching to be further improved. Therefore, how to grasp real-time requirement of logistics industry in Applied colleges and combine with subject characteristics, then, construct practical teaching system to improve students’ professional ability and advantage of employment competition, finally, explore sustainable development of higher quality application talents has become the top priority in application colleges and universities (He et al., 2016). Cloud computing and power big data technology, among which SQL statement technology is very important. In the cloud computing system, through the use of SQL statements, the relevant information in the power system can be stored and managed to ensure the safety of data processing in the power enterprise. In the operation of electric power enterprises, combined with cloud computing and power big data technology, power distribution data can be analyzed according to the total amount of current used and the situation of current transmission area, so as to ensure the rationality of power supply in the power system and meet the needs of systematic distribution of power resources. And in the integration of cloud computing and power big data technology, through the use of SQL statement technology can be timely built program system form, to ensure the security of big data information processing. The overall efficiency of high power system information resource processing is. Hierarchical processing technology refers to the integration of cloud computing and power big data technology through the analysis of power system operating conditions, and the construction of hierarchical information processing technology combined with power supply conditions of power enterprises. Hierarchical processing technology can solve the use of power system, establish power information collection system, power information storage system and power information application system. According to different structural requirements of power resources, branch management of big data resources can be carried out to enhance the connection and cooperation between various systems, and promote the efficient development of the power industry. The development of cloud computing and power big data technology In the current operation of power enterprises, we should combine cloud computing and power big data technology to carry out solution innovation: security coordination of power control system. In the design of intelligent power system, electric power enterprises need to innovate the use of cloud computing and power big data technology according to the use of power system, and make off-line analysis of the running status of power system and the allocation of power resources by broadening the application of integrated technologies such as power grid, data processing and simulation model. Show the use value of cloud computing and big data in power enterprises to improve the simulation processing efficiency of power system. Optimize the power flow calculation model. In power system power flow calculation, through the integration of cloud computing methods, It can avoid the phenomenon of inaccurate calculation results and improve the overall efficiency of power system operation. Moreover, the integration of power flow computing with cloud computing and big data can improve the unreasonable operation of power information in the past, innovate the operation mode of power system and improve the overall efficiency of system operation. Improve the fault recovery efficiency of power system. In the current operation of the electric power industry, due to the increase of the demand of the power grid, if the phenomenon of large disturbance occurs in the operation of the power grid, the power system will fail to meet the stable operation demand of the power system. Therefore, in the cloud computing and power big data technology innovation, power enterprises should realize the development needs of the industry, improve the scheme design through the use of distributed new technologies, ensure the randomness and intermittency of the power system operation, and meet the demand of diversified power technologies.",
    "The development of electric power enterprises want to improve the efficiency of the enterprise, must pay attention to the innovation of electric power technology, can try to use the Internet penetration, improve the electric power technology is digital and intelligent, so that the operation technology of electric power innovation, to meet the needs of the development of the electric power industry. Nearly all the segments about aviation ammunition equipment maintenance materials include acquisition, storage, supplying and management have close connections with the aviation ammunition equipment maintenance materials consumption information. The application of the aviation ammunition equipment maintenance materials consumption models based on the reliability of the units under condition- based maintenance could be extended and the aviation ammunition equipment maintenance materials consumption models could also be improved aiming at solving different problems."
]