[
    "Citation: X. Lin, “Strategic allocation of building carbon emission rights within urban frameworks: A case study of Henan Province under China’s dual carbon objectives,” J. Urban Dev. Manag., vol. 2, no. 4, pp. 222–236, 2023. https://doi.org/10.56578/judm020405. Abstract: TheadventofChina’s“dualcarbon”objectivesnecessitatesstringentcarbonemissionreductionsacrossall sectors, notablywithintheconstructionindustry, whichaccountsforasignificantproportionofthenation’semissions. This study presents a comprehensive examination of the allocation of building carbon emission rights, underpinned by an index system specifically designed for the construction sector, to adhere to the overarching goals of carbon neutrality. Ten refined indicators were developed, encapsulating principles of fairness, efficiency, and sustainability, including metrics such as construction stock and the value added by the construction industry. Employing a methodological framework that integrates a centralized Data Envelopment Analysis (DEA) approach, the entropy method, and k-means clustering, this research delineates an effective strategy for the allocation of carbon emission quotas. The initial allocation for Henan Province in 2023 revealed a geographical variance, characterized by higher quotas in the west compared to the east, with Zhengzhou City allocated 16.53 Mt of carbon emissions—3.59 times greater than that allocated to Zhoukou City, the municipality receiving the lowest quota. Subsequent optimization and adjustment led to the identification that, out of eighteen cities and municipalities, ten require no immediate modification to their carbon emission rights. Meanwhile, four cities were found to have a surplus, and four faced a deficit. The findings not only offer actionable insights for the implementation of urban-level carbon reduction strategies but also enhance the discourse on the allocation of building carbon emission rights, thereby contributing to the broader aim of achieving carbon neutrality. The refined approach and empirical demonstration within Henan Province serve as a pivotal reference for similar endeavors in other regions, emphasizing the necessity for tailored, data-driven allocation strategies that account for local economic activities and construction practices. Keywords: Building carbon emission rights; Urban allocation; Index system; Allocation model; Carbon neutrality; Data Envelopment Analysis; Entropy method; K-means clustering Historical carbon dioxide accumulation and future emissions determine the level of global temperature rise, and the scientific and rational allocation of limited carbon credits is essential for achieving the temperature control goals of the Paris Agreement [1]. National Economic and Social Development Fourteenth Five-Year Plan and 2035 Vision Outline explicitly require that carbon dioxide emissions per unit of Gross Domestic Production (GDP) be reduced by 18%. Based on the industry perspective, the greenhouse gas emissions from the construction industry are pronounced. Rapid urbanization has led to the continued development of the construction sector, and the study [2] points out that in the Chinese reinvented energy scenario, the building sector consumes the most energy but also has the highest potential for energy savings and emission reductions, at 74%. According to the 2022 China Building Energy Consumption and Carbon Emission Research Report, the total carbon emissions from the national construction industry in 2020 will be 5.08 billion tons of CO2, accounting for 50.9% of the national carbon emissions. Following the progressive improvement of the “1+N” policy framework of the “dual-carbon” strategy at the national level, the “2022 China Urban and Rural Construction Carbon Emission Research Report” has taken into consideration the carbon emissions of buildings at the city level for the first time. In 2020, the aggregated value of carbon emissions from urban buildings nationwide will reach 2.06 billion t CO2, and carbon peaking in the field of urban and rural construction will be implemented at the city level. In the context of cap-and-trade, the allocation path of building carbon emission rights in China should be actively sought to promote improving the building carbon emission rights allocation system [3]. Currently, the carbon market for buildings in China lacks a set of scientific and systematic carbon emission right allocation systems, and the carbon quota allocation scheme has yet to reach a consensus at the city level. Thus, exploring the allocation of building carbon emission rights from the municipal perspective under total carbon emission control will be conducive to the further division of emission reduction responsibilities and further promote carbon emission reduction among provinces and municipalities. Existing research on carbon emissions from buildings mainly focuses on carbon emission measurement [4, 5], peak prediction [6], spatial correlation effect [7], and analysis of influencing factors [8, 9]. Scholars measure the carbon emissions of each region based on the LCA theory [10, 11], IPCC [12], MFA [13], etc., to further predict the peak situation through scenarios and models such as LEAP [14]. When factorizing carbon emissions, IPAT[15], LMDI[16], andtheSTIRPAT[17]methodshavebeenwidelyrecognizedbyacademicsandarecommitted to analyzing the driving mechanism of carbon emissions from the perspectives of society, the economy, and the ecological environment in an all-round way.",
    "steel [18], chemical industry [19], transportation [20], and other industries [21, 22]. It also focuses on aspects of the allocation index system [23], allocation method [24], and allocation scale [25]. The construction of the allocation index system mainly includes allocation principles and allocation indexes; scholars mainly focus on the principles of fairness and efficiency, as well as the dynamic coupling between the two. The principle of fairness embodies the emission reduction responsibility and emission reduction capability, which mainly cover the indicators of population size [1], GDP [26], and historical cumulative carbon emissions [3], while the principle of efficiency embodies the emission reduction potential, such as carbon emission intensity [27, 28], energy structure [29], and research and development capability [1], among other indicators. With the deepening of scientific assertions such as “clear waters and green mountains are invaluable assets” and “common prosperity,” the principle of sustainability has gradually attracted scholars’ attention, including indicators such as natural carbon sinks and urbanization rate. The commonly used ones at the level of allocation methods for carbon emission quota include the synthesis and data envelopment analysis method [30–32]. Zhao et al. [33] proposed a comprehensive allocation method based on input-output and entropy methods to allocate carbon emission rights to 41 industries or sectors in China under the constraint of a carbon intensity target. Feng et al. [34] combined the bankruptcy allocation method to obtain a local compensation scheme in which the benefiting municipalities provide compensation to the impaired municipalities, which provides a new idea for optimizing the efficiency of carbon allocation among regions. Momeni [26] and Cheng et al. [35] carried out the centralized DEA reallocations for 33 countries and the provincial areas of China, respectively. DEA and the improved DEA model have become common methods for studying the allocation problem. Scholars usually use the improved DEA method to select the best for the carbon quota scheme. Cucchiella [36] and Fritzeen et al. [19] started from the perspective of maximizing the overall efficiency of the country and developed a series of studies on quota allocation from the provincial perspective. Currently, there are many discussions on the allocation of carbon emission rights at the global, national, inter-provincial, and county scales, but it has not been widely implemented at the city level, especially with less research on the allocation of carbon emission rights in the construction industry, so it is necessary to research the allocation of carbon emission rights in the urban area. Therefore, this paper takes achieving the dual carbon goals as the starting point, identifies the key factors affecting theallocationofbuildingcarbonemissionrights, constructsanallocationindexsystembasedonallocationprinciples, uses the entropy weight method for the initial allocation of carbon emissions rights, and uses a centralized DEA model to optimize and adjust quotas. This set of schemes is empirically tested in Henan Province, providing a theoretical basis for the subsequent establishment of a unified building carbon market that contributes to reducing and controlling emissions. Section 2 constructs a universally applicable carbon emission rights allocation indicator system, taking into account the principles of fairness, efficiency, and sustainability. Section 3 outlines the allocation approach, elaborates on the methods used in this study, and focuses on the construction of the allocation model. Section 4 conducts an empirical analysis on the allocation of carbon emission rights at the city level in the construction industry in Henan Province, providing detailed results and discussions. Finally, Section 5 summarizes the conclusions drawn from the results of this study. Fair distribution is the most widely studied principle of distribution, which best reflects the principle of “common but differentiated responsibilities.” The principle of fairness refers to considering distribution from a fair and just perspective, and only by making more emission reduction entities feel that a fair distribution plan can be widely accepted. The principle of fairness aims to fairly and reasonably allocate carbon emission rights to provinces and cities. This paper identifies four indicators, namely construction workers, construction stock, construction industry added value, and historical carbon emissions. In the carbon emission rights allocation system, the employees in the construction industry are changed from the indicators of population size [24]. The higher the indicator value, the more quotas need to be given to ensure fair distribution, which is a positive indicator. The construction stock indicator is extracted from the factors affecting building carbon emissions; an increase in its area directly leads to an increase in carbon emissions, so it should be allocated more quotas to ensure fairness, which is a positive indicator. The value added in the construction industry is adapted from the GDP indicator [1, 23], and the larger the value is, the better the development of the construction industry in the allocated region, which is a positive indicator. The historical carbon emissions reflect the principle of “polluter pays,” and the area with a high cumulative history should bear a higher responsibility for emission reduction, which is a negative indicator.",
    "The principle of efficiency refers to optimizing the allocation of carbon emission resources based on the input- output ratio and maximizing unit carbon emission output as much as possible, manifested in both economic efficiency and management efficiency. From the perspective of economic efficiency, it means that carbon quotas should be allocated to emission entities with higher utilization efficiency in order to achieve maximum economic benefits with limitedresources. Fromtheperspectiveofmanagementefficiency, quotaallocationshouldconsiderwaystominimize management and transaction costs. The principle of efficiency aims to maximize output with limited inputs. In this paper, three indicators are identified to characterize the potential of emission reduction in the construction industry in each province and city: building carbon emissions intensity, coal consumption ratio, and investment in construction science and technology. The building carbon emissions consult the carbon emission intensity [25] indicator in the public field; the higher value represents lower carbon production efficiency, which is a negative indicator. The ratio of coal consumption is changed from the energy structure [32] indicator; the high proportion indicates that the emission reduction potential is more significant under the current technology level, and to optimize the structure of energy use, the carbon quota can be appropriately reduced, which is a negative indicator. The construction science and technology investment are changed from the R&D capacity [1, 25] indicator; larger R&D expenditures in the construction industry indicate greater potential for emission reductions, which manifests itself as a positive indicator. Almost all economic activities are inseparable from energy. When allocating carbon quotas, in addition to considering emission reduction effects, attention should also be paid to the impact on regional development sustainability, and the rights and interests of “survival emissions” and “development emissions” in each region during the development process should be appropriately tilted towards areas with lower levels of development. The principle of sustainability reflects the differences in environmental capacity and the disparity in economic development between different provinces and cities, so the allocation of quotas should be realized in conjunction with the actual carbon sink capacity of the allocation area. This paper identifies three indicators: urbanization rate, cover rate of solar energy equipment, and forest stock. The urbanization rate reflects the urbanization development of the regional construction industry, which is a negative indicator. The cover rate of solar energy equipment indicator is established through expert interviews and is expressed by the ratio of the area covered by solar equipment to the total extent of regional buildings, which further promotes the sustainable development of the city by adopting solar equipment to replace non-renewable energy sources, which is a positive indicator. The forest stock reflects the environmental capacity of the allocated regions, which is a positive indicator. To summarize the above, the constructed indicator system is shown in Table 1. The problem of carbon emission right allocation involves multiple input-output and outputs from the decision- making unit. Considering that the overall emission reduction target will be constrained under aggregate control, DEA is deemed a suitable method for carbon quota allocation. To avoid the allocation results of previous models such as DEA, SBM, or ZSG-DEA, in which a single region achieves the optimal result while the overall efficiency is reduced [35]. This article combines the entropy weighting method with the centralized DEA method. This makes up for the entropy weighting method’s sensitivity and uncertainty and improves how carbon is distributed between regions. Under aggregate carbon emission control, the cities are grouped using the K-means cluster analysis method. Then, the entropy method is used to measure the weights of each indicator, and the initial allocation of the carbon emission rights of each city is made based on the consequences. The quota amount is added up according to the group, and the centralized DEA model is constructed to optimize and adjust the carbon emission rights within each group. Note: + indicates that the indicator is positively correlated with the carbon credit quota and has a positive value in the data processing; - indicates that the indicator is negatively correlated with the carbon credit quota and has a negative value in the data processing. Due to the possibility of similarity in resource endowment and economic strength among regions, cities with similar characteristics should be included in the same allocation system, which is conducive to improving the city’s carbon emission quota allocation system. To a certain extent, it can circumvent the problem of too extreme allocation due to too significant a difference. Thus, drawing on Cheng et al. [35], the K-means clustering approach based on the Monte Carlo method based on the ten refinement indicators stated above was used to accomplish the urban clustering grouping.",
    "In this paper, the entropy value method is used to determine the weights of the indicators. The weights of each allocation indicator are calculated through the data difference characteristics of the allocation indicators, and the final allocation ratio is derived by combining the carbon emission-related data of each city. The specific steps are as follows: (1) Identification of indicators. xij is the value of the jth indicator for the ith municipality, i is a specific city (1 ≤ i ≤ n), j is the corresponding indicator (1 ≤ j ≤ m); (2) Standardized processing. The direction of action of the ten refined indicators is fully taken into account to eliminate quantitative effects; Finally, the difference between the allocation year and the total amount of carbon emissions in the base year is calculated and multiplied by the corresponding city’s allocation ratio to get each city’s incremental allocation amount. After obtaining the initial allocation result by the entropy method, according to the clustering and grouping results in the previous step, the carbon emission rights are summed up as the total amount of re-optimization and adjustment, which provides the basis for redistribution. After the initial allocation is completed, in order to reduce the uncertainty of the entropy value method and avoid the overall low efficiency of traditional DEA applications, it is necessary to take into full consideration the changes in emission reduction targets, economic development, and energy-saving technological advances. In order to adapt to changes in actual situations, the initial quota within the group is adjusted based on the principle of efficiency. The centralized DEA model aggregates members within groups, takes the total amount of reallocated emissions as the upper limit, and reallocates the emission rights according to the efficiency of each region, which provides an effective method of reallocating and trading emission permits in the cap-and-trade system under the premise of determining the amount of surplus and deficit. Suppose that there are N DMUS defined as DMUj (j=1, 2, ···, n), and controlled by the provincial government agency, each DMUj consumes m inputs xij (i=1, 2, ···, m), producing s-1 desired outputs yrj (r=2, 3, ···, s) and 1 undesired output y1j. The central government wants each district to have as much desired output as possible for a given level of inputs and as little undesired output as possible, and the total amount of undesired result should not exceed an upper bound α. The model is as follows. 1p is the excess quota of the pth city, n− 1p is the missing quota of the pth city, xij is the ith input of the jth city before adjustment, xip is the ith input of the jth city after adjustment, yrj is the rth desired output of the jth city before adjustment, yrp is the rth desired output of the jth city after adjustment, y1j is the non-desired output of the jth city before adjustment, y1p is the non-desired output of the jth city after adjustment, S+ 1p and S− 1p are slack variables, α is the upper bound of the non-desired output. When @,,=1 and the effective boundary is composed of effective DMUs, DMU, is the coordinate of the projected DMU on the effective boundary that is the same as its original coordinate Oya AjpY1j = Yip), in the given third constraint, nip — nj, = 0. Since the principle of this model is linear programming, the optimal solution is selected from the set of basic feasible solutions, so at least one of the two linear dependent variables is a non-basic variable and is 0 (i.e., nip : Np = 0). Therefore, ny, = nj,,, = 0, which means that the emission limit of the evaluated DMU is correct and does not need to be changed. Otherwise, the evaluated DMU is inefficient and requires emission limit trading. This section focuses on the perspective of the construction industry and conducts empirical research on carbon emission rights allocation using Henan Province as an example. It mainly includes two aspects: calculating the total amount of carbon emission rights allocated in the year, then conducting the initial allocation and optimization adjustment of carbon emission rights according to the methods in Section 3 to obtain the final quota allocation result.",
    "To clarify the total amount allocated to the carbon emission quota, it is necessary to make a reasonable prediction of the future spatial carbon emission intensity reduction target and the national economic growth rate. In this paper, we consider the relationship between carbon emission intensity and the GDP of Henan Province to estimate total carbon emissions. First, buildings’ carbon emission intensity in 2023 is estimated, and from the carbon emission accounting platform in the “2022 China Building Energy Consumption and Carbon Emission Research Report,” the carbon dioxide emission of buildings in Henan Province in 2020 is estimated to be about 145,987,400 tons. Since the urban carbon emission accounting work is not accurate to the industry level, the carbon emission space of buildings can be projected based on the length of carbon emissions in each city, and the size of carbon emissions in each city’s buildings is shown in the following formula. The emission share of each city is shown in the following equation: where, C is the carbon emissions of each city, t is the year of carbon emissions calculation, and c is the share of carbon emissions from buildings in each city in 2020. Then estimate the carbon emission intensity in 2023. From the gross domestic product of Henan Province in 2020, it can be calculated that the carbon emission intensity is 265.45 kg CO2 per million yuan, with 2020 as the base year. AccordingtotheStateCouncil’s“14thFive-YearPlan”ComprehensiveWorkProgramforEnergyConservation and Emission Reduction, by 2025, the carbon emissions per unit of gross domestic product will decrease by 18% compared to 2020. Assuming that the whole industry carries out emission reduction work at a uniform velocity, the provincial emission reduction target in 2023 is 10.8%, and the carbon emission intensity target of buildings in Henan Province in 2023 can be calculated by the following formula to be 236.78 kg CO2/million yuan. where, E2023 is the carbon emission intensity of buildings in 2023, E2020 is the carbon emission intensity of the base year, and a is the residual coefficient: 89.2%. Then, the GDP of Henan Province in 2023 is predicted, taking the GDP of all cities in Henan Province in 2022 as the benchmark. With a planned growth rate of 6%, the value of production in Henan Province in 2023 is estimated to be 6,502.5 billion yuan by the following formula: where, σ is the planned GDP growth rate of each city, and finally, multiplying the carbon emission intensity with GDP to get the total amount of carbon emission allocation allowances for buildings in Henan Province in 2023 is 153,966,100 tons of CO2, and this is used to allocate the municipalities from top to bottom. According to the city building carbon emission right allocation index system for city clustering, using SPSS26.0 software to realize the clustering process, after iteration due to the clustering center not existing or only minor changes, the final 18 cities are divided into three groups, the P value of each indicator is less than 0.05, all are meaningful, indicating that the indicators are representative, and the results of the grouping are shown in Table 2. Fromthesignificanceofmeanclustering,theP-valuesofconstructionemployees,constructionstock,construction value added, forest stock, and construction technology investment are zero, indicating that the indicators are representative. The P-values of building carbon emission intensity, historical carbon emissions, urbanization rate, solar equipment coverage ratio, and coal consumption ratio are distributed between 0.02-0.05, especially the P- value of building carbon emission intensity, which is 0.49, indicating that although the indicators have passed the significance test, areas with high historical carbon emissions and emission intensity have better energy structures. In Group 1, the construction industry employees, construction stock, added value of the construction industry, investment in construction technology, solar energy coverage ratio, and forest stock in Zhengzhou City are relatively high, so they receive higher carbon emission rights. In Group 2, the building stock and economic development level of each city are relatively low, but the regional energy is abundant, and the development level of the construction industry needs to be further improved. Coal consumption is relatively high, and its energy structure can be further optimized through technological development. In Group 3, the building stock and economic development level of each city are moderate, with relatively more investment in building technology and regional energy use. The development level of the construction industry has reached a stable state, but further strengthening of enterprise transformation and upgrading is needed. The energy structure can also be further optimized through technological development.",
    "There are two main reasons for the analysis: firstly, in areas with high levels of economic development, the optimization of energy use structure is further accelerated, and the use of clean energy causes high carbon emissions from fossil fuels. The regional emission reduction payment ability is strong, and relevant practitioners and most residents have a high awareness of energy conservation and emission reduction. Therefore, there is a phenomenon of large building volumes, high total carbon emissions, but better energy consumption structures and lower emission reduction costs. Then, there are various official statistical methods for carbon emissions at the city level and the required carbon emissions per unit of output value. The calculation process of indicator values is often based on existing research methods, which may lead to deviations between the data and the actual situation. The entropy value is calculated by applying Eqs. (1)–(3). The coefficient of variation and the weights of the refinement indicators are derived through Eqs. (4) and (5), respectively, as shown in Table 3. According to Table 3, the weight vector of the carbon emission right allocation index system is W=(0.1533, 0.2316, 0.1411, 0.0383, 0.0417, 0.0594, 0.1842, 0.0261, 0.0472, 0.0772)T. Overall, the weight of the fairness indicator accounts for the most significant proportion of 0.564, and the weight of the indicators of the principle of efficiency and the principle of sustainability account for 0.285 and 0.151, respectively. From the weight of the indicators, it can be seen that the weight of the indicators for building stock, construction workers, added value of the construction industry, and investment in construction technology is relatively high, all above 0.1, indicating a significant impact on the allocation of carbon emissions in public buildings; the coal consumption ratio and forest volume have a secondary impact on distribution, distributed between 0.05 and 0.08; and the impact of urbanization rate, solar coverage ratio, and historical carbon emissions is relatively small, distributed below 0.05. The entropy method is used to calculate the comprehensive score of each indicator and the allocation ratio, based on the difference between the allocation year and the total carbon emissions of the base year, multiplied by the allocation ratio of the corresponding city to get the incremental allocation quantity of each city, taking 2020 as the base year, and summing up the incremental allocation quantity to get the carbon emissions from buildings in 2023. Based on the clustering grouping results, the total amount of allocation for each grouping and the amount of allocation for each city can be calculated, as shown in Table 4 and Figure 1. The number of allocations indicates that construction employees, construction stock, coal consumption ratio, scientific and technological inputs, and historical carbon emissions play the primary role in the number of carbon emission rights allocated to buildings. From the results of grouping, Group 2, represented by Kaifeng and Pingdingshan, has the most allocated quantity, with 80,346,200 tons of carbon quota allocated, accounting for 52.18%; Group 3 has 57,085,300 tons of carbon quota allocated, accounting for 37.08%, among which Luoyang and Nanyang share more quota. The carbon credits share shows how the dataset is aggregated at different levels. Considering the concentration of carbon emission right quota, Zhengzhou, Luoyang, Pingdingshan, and Nanyang in the west Henan region have a higher degree of polarization, and the overall carbon emission right quota allocation span is more significant, with Zhengzhou city having the highest quota share of 16.53 Mt CO2 emissions, accounting for 10.74%, and the difference between it and Zhoukou city, which has the lowest quota, is 3.59 times. Considering the municipal level, the result of building carbon emission right allocation has spatial variability. The West Henan region, represented by Zhengzhou, Luoyang, and Nanyang, has a total of 111.85 Mt of building carbon emission right quota, accounting for 72.64%. Such cities have a large building stock, a relatively better energy consumption ratio, and a more comprehensive coverage of solar energy equipment. They have invested more expenses in research and development studies in the construction industry, so they have been allocated a higher carbon emission rights quota. The East Henan region, represented by Kaifeng and Zhumadian, received fewer carbon emission rights, with 42.12 Mt. The reason is that these cities have relatively low building stock and value-added in the construction industry, high carbon emission intensity, and the ratio of coal consumption needs to be optimized. They should adjust the development strategy of the construction industry as soon as possible to change the current situation. However, they received relatively more allowances due to the high capacity of agricultural carbon sinks in Nanyang, Zhoukou, and Xinyang.",
    "Table 4. Results of the initial allocation of carbon emission rights for buildings in 18 cities based on the entropy method Based on the centralized DEA model to redistribute the building carbon emission rights, the construction employees, construction stock, carbon emission intensity, science and technology investment as inputs, the value added in the construction industry as desired outputs, and the amount of carbon emissions as non-desired outputs, run by using the MATLAB and DEAP2.1 software, we can derive the amount of the adjusted carbon emission rights allocation, which is shown in Table 5 and Figure 2. It can be seen that the centralized DEA model is optimized for building carbon emission quotas, which makes the total amount of adjusted carbon quotas decrease. Considering the municipal level, the allocation of carbon emission rights is relatively flat across the three gradients in the north-south pattern of the province and in total. According to the efficiency value of each city and the allocation of surplus volume and deficit volume analysis obtained, a total of 10 cities have not changed the amount of carbon emission allowances (1). Such areas of construction carbon emissions and the development of the local construction industry match, the implementation of the policy is in line with the development of the local economy, and the carbon emissions do not need to be adjusted for the time being. However, we should be prepared for the dangers of peace and security, improve production efficiency, strengthen the management of the industry, and make long-term plans for emission control and reduction. In the east-west pattern, carbon emission rights show a situation of “east gains and west losses.” With 8 non-effective cities (θp < 1), there are four surplus cities, including Kaifeng, Hebi, Puyang, and Zhumadian, as well as four deficit cities, including Jiaozuo, Nanyang, Xinyang, and Zhoukou. The carbon emission space of buildings shows a trend of “high in the west and low in the east.” Under the constraint of the goal of reducing carbon emission intensity, the larger the carbon emission space, the more sufficient the carbon emission reserve, the greater the development space of the construction industry, or the more tradable building carbon emission rights are available, the higher the carbon emission reduction starting point, such as in cities such as Kaifeng and Puyang. Suppose the carbon emission space is near zero or negative, such as in Nanyang, Zhumadian, and other cities; it indicates that there is less space for the development of the construction industry, and it is necessary to adjust the development strategy of the construction industry as soon as possible or to purchase carbon emission rights from carbon-rich regions. Surplus regions produce more desired outputs with the same inputs while bringing in fewer non-desired outputs. Without affecting local economic development, they can improve production efficiency, promote emission reduction and management technologies, and encourage differential pricing based on primary market pricing and the sale of surplus carbon emissions to promote carbon trading. Deficit regions are high- and medium-pressure areas for reducing emissions. They are places where the amount of carbon emissions doesn’t match the growth of the city and where the industrial structure and energy consumption patterns need to be optimized so that they can change and improve over time without stopping the city’s growth, or where people need to take the initiative to find cheaper places to buy carbon emission rights. Due to the difference in focus and position, scholars have proposed different allocation schemes and followed different principles. Based on literature research and expert interviews, this study identifies 10 carbon emission influencingfactorsfortheconstructionindustryandsummarizesthemincombinationwiththeprinciplesofallocation, reflecting individual responsibility, historical responsibility, and emission scale responsibility through the principle of fairness. The principle of efficiency reflects the potential for emission reduction in the construction sector, the degree of optimization of energy use structures, and the level of energy-saving technology. The principle of sustainability protects the rights and interests of “survival emissions” in the development process of the regional construction industry. Based on the K-means clustering, the P-value is less than 0.05, which means that the indicators are representative, and the indicators are normalized to further verify the rationality of the indicator system. The radiation capacity of Zhengzhou, Luoyang, Pingdingshan, and Nanyang needs to be fully utilized to establish a mechanism for synergistic carbon reduction in the municipal area. At the same time, in the future, it is necessary to take into account their economic, technological, and policy implementation advantages, optimize the carbon emission energy structure and green building design of regional buildings throughout their life cycle, and drive a cross-regional building emission reduction linkage system from point to point. If the carbon reduction pressure index is used to determine the reduction pressure, i.e., the ratio of the profit and loss to the original carbon emissions, and the grading standard is: between 0.5 and 1 is a high-pressure region for emission reduction, between 0 and 0.5 is a medium-pressure region for emission reduction, and less than or equal to 0 is a low-pressure region for emission reduction, there are three medium-pressure cities in the eight non-effective cities, namely Jiaozuo, Nanyang, and Zhoukou, which are all located in the provincial boundaries, and the energy consumption structure of these cities is dominated by coal, and the energy utilization rate is lower than the energy utilization rate of the cities in the region.",
    "The energy consumption structure of these cities is dominated by coal, the energy utilization rate is lower than the average level of Henan Province, the economic level is not dominant, and there is room for further optimization of low-carbon transformation. There are still some deficiencies in this paper. The allocation principles followed are not completely mutually exclusive, and the index system constructed is only relatively rich, but it is difficult to cover all the factors affecting the allocation of carbon emission rights in buildings, which needs to be further improved subsequently. In addition, as the relevant data at the municipal level are not complete enough, it is necessary to extrapolate individual indicators according to the data patterns of previous years. At the same time, the carbon emission data of CEADs are missing, which to a certain extent will lead to a slight deviation between the amount of carbon emission rights allocated and the actual, and the accuracy of carbon emission rights accounting will be further improved with the improvement of the database in the future. • Strengthen the top-level design of carbon emission rights allocation. The total control of carbon emissions is a key factor in promoting the realization of “dual carbon” and the stable development of the carbon market. Therefore, China needs to shift from energy consumption control to carbon emission control and establish a scientific and reasonable carbon emission total control system and guarantee system. industrial structure levels, environmental governance pressures, and economic development levels among industries in different regions. The government needs to comprehensively consider regional differences, formulate, and implement tailored emission reduction policies to promote regional emission reduction processes. pressure regions may not be able to bear the heavy burden of emission reduction and cannot achieve both emission reduction and economic development on their own. Therefore, the government should increase support for such areas, promote local economic development, and optimize industrial and energy structures. A set of city carbon emission right allocation index systems was made for the construction industry based on the ideas of fairness, efficiency, and sustainability. These systems used a two-stage carbon emission right allocation scheme, which included initial allocation, optimization, and adjustment. An example of verification was then done based on this scheme. The following conclusions and outlook are drawn: This paper reflects the fairness and reasonableness of the allocation of building carbon emission rights with the principle of fairness, the efficiency of emission reduction with the principle of efficiency, and at the same time, combines with the principle of sustainability to reflect the differences in environmental capacity and regional development, and constructs an allocation system that includes ten detailed indicators including the construction employees, construction stock, the added value of the construction industry, the historical carbon emissions, the buildingcarbonemissionsintensity, theratioofcoalconsumption, investmentinconstructionscienceandtechnology, the urbanization rate, the area covered by solar energy equipment and the forest stock. The allocation system includes ten detailed indicators. The K-means method was applied to realize city clustering, and the centralized DEA model was applied to optimize and adjust the initial carbon quota allocation. As well as making up for the entropy method’s sensitivity and uncertainty, this scheme also stops the traditional DEA application from optimizing just one region, which would make the overall efficiency go down. This makes the allocation results more realistic. In 2023, the building carbon emission in Henan Province is 153.96 Mt. The amount of carbon emission right quota shows a spatial difference of “high in the west and low in the east” among the 18 municipalities, with the total amount of building carbon emission right quota of the west Henan region represented by Zhengzhou and Luoyang reaching 111.85 Mt, while the total amount of building carbon emission right quota of the east Henan region represented by Kaifeng and Zhumadian is 111.85 Mt. Among them, Zhengzhou City has the highest quota of 16.53 Mt, 3.59 times different from Zhoukou City, which has the lowest quota. After the optimization and adjustment of the grouping, ten cities do not need to adjust the number of quotas and include four cities with surplus quotas and four cities with deficit quotas, especially in Jiaozuo, Nanyang. As a representative of the pressure to reduce emissions, the government should increase the emission reduction of such areas of support and technical support so that the local realization of emission reduction and development in parallel will keep up with energy saving and emission reduction.",
    "Thefollow-up studycancombine the actualdevelopment situation ofdifferentprovinces toimprovethe allocation index system and quantitative analysis of the indicators. Meanwhile, considering the lag of city carbon emission data, the allocation model and optimization algorithm can be discussed in depth."
]