[
    "Dynamics of Post-Pandemic: Understanding the Influence of Company Size and Financial Performance on Corporate Social Responsibility Through Regulatory Environment and Employee Engagement Corporate social responsibility (CSR) implementation is necessary for the management of any firm. Due to Covid-19, the functioning of the companies has changed due to internal and external issues. The research measures the relationship between company size, financial performance, regulatory environment, employee engagement, and CSR. This research also tests the mediating role of the regulatory environment and employees’ engagement between company size, financial perfor- mance, and CSR. The study employed a quantitative approach using partial least square structural equation modeling to test the proposed relationships between the constructs. Survey data were obtained from 346 employees from Zhengzhou City in Henan Province, China engaged in agricultural companies. To test the proposed relationships, the study database was ana- lyzed by PLS algorithm, bootstrapping, and blindfolding tests that provided a combined knowledge in Smart PLS 4. The results indicated that company size and financial performance significantly predict the regulatory environment and employee engage- ment. Meanwhile, the regulatory environment and employee engagement are necessary factors influencing CSR implementa- tion in China’s agricultural sector. The research provided new theoretical aspects for advancing CSR in agriculture sector firms. There are recommendations for improving CSR by agriculture sector firms in China. Covid-19 distributed the business operations all over the world. From the manufacturing to the service sector, all business is affected by this pandemic and economic issues (Feng et al., 2022). The logistic issue also affected busi- ness growth in a sustainable way for market growth. This disturbance leads the private sector firms into great dan- ger from the perspective of financial gain and employee turnover. The businesses in China stopped their opera- tions due to this issue. The financial health of the compa- nies is disturbed, and it isn’t easy to get loans from the banks (Kuo et al., 2021). The stability of business perfor- mance is a way forward, but the engagement of business activities and employee activeness can be improved when the environment is comfortable. The aftershocks of COVID-19 resulting in a financial crisis and employee turnover (Sadiq et al., 2022) led the companies into nega- tive growth. Hence, it becomes challenging for the firms to fulfill sustainability goals. Saima Kiran, School of Management, Zhengzhou University, 100 Kexue Blvd, Zhong Yuan Qu, Zhengzhou, He Nan Sheng 450001, China. Email: saim1234779@gmail.com Corporate Social Responsibility (CSR), an extension of 21st-century business administration and development to tackle societal and environmental concerns and support corporate performance. CSR can conjugate organiza- tional goals with societal expectations and, in turn, pro- mote sustainable growth; hence, it is essential, significant and necessary. Trust and long-term relationships with customers, employees and the community through trust- worthiness are considered primary factors for CSR. As D. R. Jamali et al. (2024) claim, CSR efforts enable busi- nesses to develop cleaner and more responsible produc- tion ways of production, albeit to alleviate environmental concerns and future regulatory pressures. Moreover, Vo et al. (2024) highlight that CSR initiatives significantly address climate policy uncertainty by enabling firms to be sustainable and contribute to envi- ronmental objectives. CSR is important, as proven by its influence on corporate reputation and financial perfor- mance. For example, according to Wu et al. (2024), firms that integrate CSR well are in a more vital place to man- age risks like stock price crashes. It also reports that Sindhu et al. (2024) explain how CSR enhances financial and non-financial performance in the banking sector and helps to build a resilient and adaptive business environ- ment. Schwoy et al. (2023) point out that, apart from determining corporate performance, CSR is vital in demonstrating a commitment to do more than comply, determining CEO reputation management and firm size dynamics. CSR is needed because it can help solve societal prob- lems, particularly during the crisis, for instance, the COVID-19 pandemic The agricultural sector in China encountered difficulties in implementing CSR effectively during and after the pandemic, resulting in reputational damage and diminished brand value. Organizations can recover from such challenges by setting up CSR objec- tives; there is a framework for future resilience and growth (Akben-Selcuk, 2019; Nirino et al., 2020). Additionally, CSR contributes to a transition to a sus- tainable state by using tools like machine learning to uncover contributions to environmental, social, and gov- ernance (ESG) performance, as indicated by Subramaniam et al. (2024). CSR is central to current business strategy and helps achieve ethical governance, environmental stewardship and social well-being. Its implementation enhances an organization’s performance and ensures its alignment with the broader objectives of sustainable development. Organizations prioritizing CSR can survive and prosper in an increasingly complex In the extant literature, CSR has been examined exten- sively as a strategic tool to align organizational perfor- mance with sustainability goals (Shabbir & Wisdom, 2020). These initiatives are recognized as fundamental in reaching economic growth and environmental and social benefits (Katenova & Qudrat-Ullah, 2024), who analyzed the relationship between CSR and organizational perfor- mance in emerging markets. According to Simo et al. (2023), social ratings in microfinance institutions also show that CSR could enhance financial inclusion and social equity. Indeed, Herna´ ndez et al. (2020) argued that CSR outcomes are greatly determined by the extent to which management directives are aligned with employee actions. In addition, Schwoy et al. (2023) indicated that CEO leadership and reputation are moderating factors affecting the effectiveness of CSR initiatives. Meanwhile, Sindhu et al. (2024) explored the moderated and instan- tiated effects of CSR, the banking sector’s financial and non–financial outcomes, extending the significance of comprehensive management and employee commitment.",
    "According to Okafor et al. (2021), CSR is vital in forming powerful brand equity and attaining long-term sustainability objectives. This matches the findings of D. R. Jamali et al. (2024), who also performed a cross- national comparison of CSR practices and found that CSR improves corporate credibility and builds stake- holder trust. However, these contributions are associated with some literature gaps, especially regarding the inter- action among the regulatory environment, employee engagement, and CSR performance. For example, although Vo et al. (2024) talked about the role of CSR in managing uncertainties in climate policy, the significance of CSR under the broader regulatory regime has received less attention. However, prior studies have validated that firm performance and management engagement help achieve CSR, while the association of corporate size, financial performance, regulatory frameworks, and employee involvement is limited. This is notable, given that Wei et al. (2024) noted that management tone and rural revitalization initiatives informed CSR outcomes in Chinese companies. Additionally, in Wu et al. (2024), the management self–interest dimensions were recognized as being related to CSR performance, pointing out the future demands for additional would–be mediating and The current study seeks to fill these research gaps by focusing on the relationship between company size, financial performance, regulatory environment, employee engagement, and CSR. The study explicitly tests the mediating roles of the regulatory environment and employee engagement in the effect of company size and economic performance on CSR outcomes. This approach is grounded in existing work (e.g., Subramaniam et al., 2024), which exploited more advanced methods, such as machine learning, to assess the evolution of CSR and ESG, opening the door for more integrated and more data-driven CSR research. The study specifically focuses on these unexplored rela- tionships to fill some critical gaps in the body of knowl- edge, especially in implementing CSR in sectors such as agriculture. This is particularly important given the chal- lenges of this sector, including during and after the COVID-19 pandemic (Nirino et al., 2020; Uyar et al., 2021; Younis & Sundarakani, 2020), when exemplary CSR practices could be the catalyst toward recovery and resilience. This study uses quantitative data collection methods consistent with previous studies on the agricultural sec- tor (Devie et al., 2020). Data for the research are drawn from managerial-level agricultural sector personnel in Zhengzhou City, Henan Province, China. The study sup- poses a stronger interrelationship among variables, which means that the company size and the firm perfor- mance contribute to the practice of Corporate Social Responsibility (CSR). Gaps in the prior literature in this research have been empirically validated concepts for connections that already occupy the body of knowledge. The study is structured into critical sections: In addition to a comprehensive literature review, detailed research methodology, thorough data analysis, in-depth discus- sion and conclusion, theoretical and practical implica- tions and proposed future research directions are also presented. The theoretical grounding of the research model is in sta- keholder theory that advocates the need for future cor- porate management to nurture relationships with various stakeholders to balance their interests and construct organizational legitimacy. Drawing partly on Freeman’s (1984) stakeholder theory, this highlights the relative importance of organizational characteristics, stakeholder salience, and external pressures in determining corporate strategy. From this perspective, this thesis offers a solid base for interpreting the relations between company size, financial performance, regulatory settings, employee engagement, and corporate social responsibility (CSR). Larger firms operate under greater scrutiny by stake- holders and, therefore, must be proactive in fulfilling their societal expectations and regulatory requirements. The alignment of stakeholder demands means more structured CSR initiatives, along with the firm’s need to maintain legitimacy. Stakeholder engagement, in turn, is a precondition for achieving most global CSR aims, of which financial performance is a key enabler, as it pro- vides the resources to support external and internal CSR initiatives. The virtuous cycle of trust and value creation is enabled by financially robust organizations, which allows them to invest in developing employee engagement, even at a small scale, and meet stakeholder expectations. Recent studies also support the importance of financial resources in stakeholder-oriented outcomes (Kim et al., 2023; Kuzey et al., 2023). Moreover, the regulatory environment is an external stakeholder that exercises coercive pressure on the orga- nization to behave in a way that conforms to social norms. CSR is a strategic response by firms to regulatory scrutiny, so they align with regulatory expectations to ensure legitimacy and keep their operations continuous (Zhang et al., 2023). Employee engagement is thus reflected as how the organization engages with a key sta- keholder group to attend to their needs and thus partici- pate in CSR activities and produce positive outcomes. CSR is implemented via the catalyzed efforts of engaged employees, which confirms the alignment of internal sta- keholder needs to broader corporate objectives (Hussain et al., 2023). The outcome of these interrelated dynamics is CSR, which refers to an organization’s intent to pur- sue a balance between the interests of a diversity of sta- keholder groups and respond to social needs and concerns. This study offers a broad-based theory to understand how the characteristics of the organization in a regulatory environment, in conjunction with the pres- sures exerted by its stakeholders, determine the establish- ment of sustainable practices and reinforce legitimacy. Through these constructs integrations, the model expli- cates how stakeholder theory works and adds to our understanding of the strategic foundation of CSR (D.",
    "The firm size is based on its nature of work and available resources. The financial health of the firms increases when they have a big market, and it helps them generate appropriate revenue (Bartolacci et al., 2020). Environmental policies are obligatory for every firm because they are a way to establish a firm with strong environmental concerns. In accordance, the employees of any firm are required to improve their regulatory behavior appropriately (Gangi et al., 2020). When the company is large, they have appropriate financial resources to engage the employees in organizational per- formance. However, the size of small firms is not suitable for business performance and sustainability in the envi- ronment (Lin et al., 2019). The environmental regula- tions of the firms are also successfully developed when the size of the firms is according to the required stan- dards. The level of firm performance determines its stra- tegic approach to engaging the employees and provides a way forward for the development of firms’ advancement (Uyar et al., 2020). Therefore, large firms have reliable resources to apply to the market’s regulatory environment to attain goals strategically. The regulatory bodies of the governments also monitor the performance of firms for environmental concerns based on their size and level of employee engagement (Pearcy & Giunipero, 2008). This discussion leads to the development of the following hypotheses. Firms’ financial resources matter a lot in the way of their environmental regulations (Adomako & Danso, 2014). Firms with strong financial performance could easily meet the regulatory requirements, set aside resources for compliance, and enjoy the legitimacy (Li et al., 2017; Nosike et al., 2021; Pille & Paradi, 2002). At the same time, financial stability enables organizations to invest in employee engagement initiatives including optimizing design of organization, provision of resources for employee engagement and motivation (Capelle; 2013; Iddagoda, 2017). The advancement of modern firms and the strategic approach to developing these firms can advance their financial performance of firms. The aspects of firms working for environmental regulations are a way to improve their approach to working in the market (Albdour & Altarawneh, 2014). Firms with sus- tainable principles in businesses can improve their regu- latory working approaches. Financial health predicts the level of resources a firm must strategically develop busi- ness (Saha et al., 2020). Meanwhile, the engagement level of employees is necessary to regulate the working mechanism of companies. The concern of top-level com- panies is to achieve environmental sustainability, which helps develop businesses for their strategic performance (Tien et al., 2020). Furthermore, the companies’ assets spent on the regulation of the environment pay back the companies in their reputation in the market. Similarly, the appropriate level of salaries is necessary to advance the performance of firms for the development of business in a sustainable way (Pekovic & Vogt, 2021). For firms that are weak financially, the resources are limited to these firms to spend on the regulation of the environment for CSR (Abdi et al., 2022). Therefore, the financial aspects of firms have a critical role in their further development for the environment and other strategies. This discussion implementation for economic and sustainable develop- ment is a way forward for firm performance. The engage- ment of employees and working practices to advance strong performance can reliably regulate businesses (Galdeano et al., 2019). Undoubtedly, the employees’ engagement is a satisfactory practice for the management to provide the full potential for sustainable goal achieve- ment. Every firm is responsible for regulating the envi- ronment, which is necessary to achieve sustainability (Beji et al., 2021). Modern firms are also responsible for maintaining corporations working appropriately for sus- tainability goals. In accordance, the working of CSR is also necessary for the firms to improve their branding in the market (Aqabna et al., 2023). However, a strategic approach with solid teamwork is required for CSR. In this way, firms with sustainable practices for a better environment successfully advance their CSR role (Tandelilin & Usman, 2023). Contrary to this, firms with little engagement in environmental regulation aren’t suc- cessful in business development. Meanwhile, the engage- ment of employees for corporate working is a reliable way to achieve the goals of sustainability for fulfilling CSR. Therefore, the working of employees as a team is required to achieve the goals of sustainability. CSR is dri- ven at large by the regulatory environment and employee engagement. Corporate behavior is guided by clear and robust regulatory frameworks, with companies using CSR to fill governance gaps in areas where it is weak (Chourou et al., 2023, p. 404; Ho¨ nke et al., 2008, p. 363; Maliganya et al., 2023, p. 598; Mndebele, 2016). Yet, reg- ulatory uncertainty can stimulate proactive CSR while it inhibits the same. Employee engagement improves CSR internally by helping to embed responsibility into organi- zational culture and make it happen. Employees who are engaged in the company act as advocates of CSR, trans- lating the policies into actions and also bringing the com- pany one step closer to making relationships with stakeholders. Together, these factors form the founda- tion for the following hypotheses: The environmental regulation has become critical for the firms. The strategic approach to improve the code of environment is helpful for the company size advancement (Zheng & Ren, 2019). The reliability of financial perfor- mance in any company helps achieve CSR goals, but the focus should be on the regulatory environment. The pro- cess of CSR approach development and its success is crit- ical, and businesses must monitor their advancement strategically (Murad et al., 2022). An important factor for a sustainable development of companies is linked to the size of the firms and to their respective regulatory missions. The technical nature of the market capturing is also a foundation for any business financial planning because of the size (Hamed et al., 2022). Strategic advances in business development to realize sustainability goals are also the concern of the stakeholders of modern times. Firms regulation as well as the way of developing business is one way of attaining sustainability related goals (Dakhli, 2022). Environmental rule becomes important to policy of the business and augments the per- formance of the business. On the other hand, the proce- dures for regulating the environment are useful to the business to grow strategically in the market (Kolsi et al., 2022). The concern of stakeholders is the firms should have policies and a practical approach to CSR with regu- lation of the environment and engagement of employees. Hence, this discussion leads to the following hypotheses.",
    "sustainability goals (Broadstock et al., 2020). It is a reli- able method to lead the firms in the positive direction of their work, which helps to achieve sustainability goals. However, the role of employees is necessary to provide services to the firms to advance sustainability-related goals (Long et al., 2020). The success rate of firm perfor- mance and strategic approach to business development are critical for environmental advancement. Hence, the working process of employees in a sustainable way is keenly required to improve business practices (Khan et al., 2020). This approach is necessary in the way of the business development process. Meanwhile, CSR is also achieved when all employees are united to work on the same firm mission. This discussion leads to the following hypotheses. The involvement of employees in organizational goals for sustainability is necessary. This process helps improve the administrative work for advancement in CSR (D’Amato & Falivena, 2020). Firms with reliable finan- cial resources are motivated to regulate the environment with a strategic approach to business development. When the firms are working appropriately in a business establishment, the regulations of business are achieved for environmental concerns (Faisal et al., 2020). CSR has become critical for firms, but strategic working is consid- ered a valuable way to achieve sustainability. Sustainable development in the market starts with working toward Methodology. This research is based on positivist ideol- ogy, where the subjective study approach is not used. This research checks the relationship between company size, financial performance, regulatory environment, employee engagement, and CSR. The data was collected from the agriculture sector of Zhengzhou City, Henan Province, China. The firms in the agriculture sector were targeted because Covid-19 affects this sector in great depth. The data was collected on a self-administered questionnaire. The scale items for each variable were adapted from the existing studies. The research instru- ments for company size are adapted from the study of Pearcy and Giunipero (2008) to determine the role of company size on the employees’ engagement and regula- tory environment. A total of six items were used to mea- sure company size in this research context, and the adapted scale had validity and reliability based on the statistical findings of the source study. Furthermore, the scale items for financial performance are adapted from Bigliardi (2013) to measure its impact on the regulatory environment and employee engagement. Five items are adapted for this variable after confirming the source study’s validity. Meanwhile, six items were adapted from the study by Adomako and Danso (2014) for the regulatory environ- ment. These items were taken to measure its relationship with CSR. The validity of research items was considered before the adoption of scale. Hence, the scale for this research is considered appropriate to collect data. However, a set of questions was adapted from the study conducted by Albdour and Altarawneh (2014) to mea- sure employee engagement. The scale was used to deter- mine the impact of employees’ attention on CSR. Hence, the validity of the scale items was also checked before data collection. Finally, six items were considered for CSR to determine its relationship as a dependent vari- able. These items were also valid based on the findings of the source study by Murad et al. (2022). In this way, these items are finalized to collect data and test the rela- tionships. The developed questionnaire was shared with a panel of five independent reviewers to confirm the face validity of the questionnaire. These reviewers confirm the face validity of the questionnaire without any modifi- cation. The seven-point Likert scale questionnaire was finalized to collect the data. The respondents of this research were professionals at managerial levels employed in different firms in the agri- cultural sector. From the agriculture sector in Zhengzhou City, Henan province, China, a sample of 500 small and large size companies were chosen. As it was not possible to obtain an authentic list of all the agricultural compa- nies in the region, and due to time and physical accessi- bility limitations, the convenience sampling technique was used since numerous firms were included so as to ensure variability, and they agreed to participate in the study. This was considered fit for the study scenario because it allows the realizing of timely and relevant data with individuals at the managerial level who participate keenly in decision-making and are best placed to help achieve the study goals. An exploratory survey technique was adopted to develop a cross-sectional study that made it easier for the study to offer comprehensive insights into managerial opinions in the chosen firms. The managerial level employees were 2,227 in these selected firms. Therefore, the estimation recommended by Krejcie and Morgan (1970) is used to collect the data from the suit- able sample. The analysis showed that when the population is between 2,200 and 2,400, the appropriate model would be between 327 and 331. Five hundred questionnaires were printed to collect data to avoid the response error and biased responses. The printed ques- tionnaires were surveyed, and the quarries of the respon- dents were addressed. A physical mode of data collection was adopted to determine the full coverage of responses. Out of the total, 346 respondents filled the questionnaire correctly. The data was collected from April 15th 2024 to May 11th 2024. The preliminary analysis was conducted to ensure that the collected data was helpful for research. The structural equation model approach analyzed the final sample of 346 responses. For this purpose, Smart PLS 4 is used to measure the results with calculations of PLS Algorithm, PLS Bootstrapping, and PLS Blindfolding. However, the findings of measurement model assessment and structural model assessment are considered initially to determine the relationship between under-observation variables.",
    "We followed two strategies to control for potential CMB in the single-source survey data (Podsakoff et al., 2003). First, to check our data for common method variance, we used Harman’s single-factor test, as suggested by Podsakoff and Organ (1986). The result of the analysis demonstrated that the percentage of total variance accounted for by one factor was 28.321%, much below the acceptable level of 50%, suggesting a very low CMB. Second, we employed the full collinearity assessment in which a VIF \\3.3 eliminates CMB, as realized by Kock (2015). The VIF values of the data were below 3.3, ruling out CMB as a problem for this study. In the data analysis, we employed Smart PLS and the PLS-SEM alongside analysis tools in the SPSS software. This investigation used PLS-SEM for the following rea- sons: First, this strategy is most appropriate when the study’s objectives are more analytical and evaluative to the dependent variables to appreciate a finer degree of variation. Second, according to Rolda´ n and Sa´ nchez- Franco (2012), PLS-SEM is the most suitable prediction strategy as it simultaneously deals with the measurement and structural models. Third, it is superior to regression in generating estimates that may be used to assess media- tion (Preacher & Hayes, 2008); measurement error is considered and precise estimation of the mediating effects (Shehzad et al., 2023). Fourth, Smart-PLS is appropriate for simple and complex theoretical models, and the data do not require normalization (Hair et al., 2016). Last, the advantage of getting the PLS-SEM is that it can be applied even with a limited sample size to conduct the analysis. It is among sustainability litera- ture’s most acceptable and frequently used methods (Shehzad et al., 2023). Therefore, PLS-SEM is the best method for this study. The data analysis of this research started with a normal- ity test. The dataset underwent an examination to iden- tify any missing values, and the investigation revealed that no missing values were present. In addition, skew- ness and kurtosis are assessed to assess the data’s confor- mity to a normal distribution. Similarly, kurtosis and skewness within the range of 22 to +2 (Royston, 1992) signify a distribution that adheres to the characteristics of a normal distribution. A pattern of responses is deemed to follow a normal distribution when skewness and kurtosis approach zero. The results confirmed that the data has achieved normalcy. Hence, the data can be considered as credible for subsequent statistical analysis. trustworthiness of components. Factor loadings greater than 0.60 (Shevlin & Miles, 1998) are deemed significant in assessing the reliability of items within any given con- struct. The present study has reported that the compo- nent exhibits a statistically significant value above the required level. Hence, the objects employed in this study exhibit reliability at the individual level. In addition, researchers examine the composite reliability and Cronbach’s alpha to assess the degree of internal consis- tency among the items comprising a given construct. Internal consistency is accomplished when Cronbach’s alpha and composite dependability exceed a threshold of 0.70 (Tavakol & Dennick, 2011). The data analysis revealed that the internal consistency of the data has been attained. Determining the average variance extracted is finally conducted to assess the variation among the items loaded on a single construct. The find- ings indicate a conflict of over 50% among the things loaded onto a single construct, which is deemed accepta- ble (Alarco´ n et al., 2015). The findings are presented in both Table 1 and Figure 2. Convergent validity holds considerable importance in the context of conducting further data analysis. The measurement model’s findings are assessed to ascertain the validity of individual items, as well as to evaluate the convergent and discriminant validity. Factor loadings are utilized to determine the discriminant validity assessment is conducted using the Heteritrait-Monotrait (HTMT) approach. This approach is extensively employed in the field of social science research. Discriminant validity is established when the values observed in the HTMT matrix are below the threshold of 0.85 (Henseler et al., 2009). The results of this study are presented in Table 2. Figure 3 provides empirical evidence supporting the substantial discrimi- nant validity of the research data. Hence, it may be con- cluded that the data does not exhibit any instances of multiple collinearities, thus rendering it suitable for sub- sequent investigation.",
    "The evaluation of the structural model is regarded to examine the path. To assess the association between vari- ables proposed in the framework, it is commonly recom- mended to use a threshold value of t.1.96 and p\\.05 (Hair et al., 2021). The findings of empirical data con- firmed that company size has a significant and direct impact on the regulatory environment, and hypothesis 1 is accepted. Furthermore, the results highlighted that company size substantially and positively affects employee engagement, and the second hypothesis is accepted. Thirdly, the findings reported that financial performance is correlated and has an acceptable impact on the regulatory environment. The results also estab- lished that economic performance positively and signifi- cantly affects employee engagement. Hence, hypotheses 3 and 4 are accepted by the data. Meanwhile, the results showed that the regulatory environment impacts CSR, and the fifth hypothesis of the study is obtained. The study found that employee engagement is related to CSR, and the relationship is significant and positive. The findings sixth hypothesis highlighted that employee engagement directly impacts CSR. The statistics of direct relationships are reported in Table 3. outcomes confirmed that only one mediating relationship is accepted out of four. The results demonstrated that the mediating role of the regulatory environment between company size and CSR is rejected. The findings confirmed that the mediating part of the regulatory environment is rejected between financial performance and CSR. Furthermore, the study demonstrated that the mediating role of employees is accepted between company size and CSR. Finally, the mediating part of employees’ engage- ment between financial performance and CSR is also rejected. The findings of indirect relationships are reported in Table 4. The second question pertains to the concept of predic- tive relevance, which assesses the extent to which a model has predictive relevance. A value greater than zero indi- cates a favorable outcome in this regard. Moreover, Q2 serves to ascertain the predictive significance of the endo- genous constructs. Values over zero in Q2 indicate that the reconstructed values are of good quality and that the model possesses predictive relevance (Koban et al., 2012). The research model exhibits robust predictive validity, as evidenced by the Q2 findings in Table 5 and Figure 4. The relationships between company size, financial per- formance, employee engagement, factors, and corporate social responsibility (CSR) are explored in this study. Seven of the ten proposed hypotheses were supported, offering insights into how these factors interact with sus- tainability outcomes. While several of these were con- firmed consistent with existing literature, others were not supported by existing theory. Results suggest that company size and financial per- formance positively affect the regulatory environment. Their capacity and financial and operational nature allow them to comply with regulatory requirements more quickly than smaller firms. Shabbir and Wisdom (2020) point out that the firm’s size is the most critical determi- nant of resource control; larger firms can allocate sub- stantive resources for regulatory compliance. For instance, Ba˘ tae et al. (2021) argue the importance of robust environmental policies that drive firms toward sustainability, which tends to force larger firms to agree to predetermined regulatory frameworks. According to Bartolacci et al. (2020), more giant corporations that play a substantial role in the market have the resources to manage regulatory landscapes strategically to be com- pliant and to improve environmental performance simul- taneously. This is in line with D’Amato and Falivena (2020), whose findings suggest that employee engage- ment and regulatory adherence depend on firms’ finan- cial stability, which in most cases is firm size. Additionally, the study finds that CSR is also deter- mined positively by the regulatory environment and employee engagement. A well-structured regulatory framework ensures that CSR initiatives are taken seri- ously by the firms and that the involvement of employees improves their implementation. Both diligent manage- ment practices and active employee involvement are needed to achieve CSR objectives, according to Uyar et al. (2020). Saha et al. (2020) conclude that environ- mental and social considerations should be integrated into a corporate strategy for CSR outcomes to achieve regulatory adherence and employee commitment. The implementation of CSR strategies depends mainly on the collaborative efforts of the employees across depart- ments (Pan et al., 2021), which facilitates the effective execution of CSR strategy. However, they suggest that CSR is not merely a management issue but a ‘doing’ or a moral imperative requiring the ‘working’ of our organi- zational members at the other level.",
    "Besides regulatory impact, employee engagement is primarily determined by company size and financial per- formance. Wealthier organizations can motivate and col- laborate with employees on sustainability practices contributing to daily operations. According to Pekovic and Vogt (2021), sufficient employee compensation and resource allocation increase employee satisfaction, which is a part of achieving sustainability objectives. Gangi et al. (2020) state that having environmental regulations embedded in a company is a way to involve employees in cooperative efforts to achieve organizational goals. The significance of this relationship is to engage employees in CSR-relevant practices because they contribute to attain- ing CSR objectives. According to Okafor et al. (2021), employees’ motivation is essential for environmental sus- tainability because engaged employees are more willing to behave in environmentally responsible manners and Moreover, the role of the regulatory environment as an intermediary for the impact of company size, financial performance, and CSR was not proven. Indeed, past research, such as those by Nirino et al. (2020) and Tandelilin and Usman (2023), suggests a regulatory envi- ronment for CSR adoption, but our results show that other factors may also determine these relationships. Variations in industry characteristics, firm characteris- tics, or regulatory enforcement levels could explain the lack of support for these mediating effects. According to Akben-Selcuk (2019), the regulation frameworks must be strategically aligned with the organizational goals, which may differ in different contexts to fulfill CSR objectives. an employee engagement environment is essential to achieving sustainability program outcomes. According to Herna´ ndez et al. (2020), aligning organizational efforts with sustainability objectives depends on employee engagement. They motivate employees to implement CSR initiatives by encouraging them to use environmen- tally friendly practices and working on sustainability projects together. Furthermore, their work did not sup- port a mediating role of employee engagement between financial performance and CSR, implying that economic resources are ineffective in causing CSR outcomes absent strategic integration of employee initiative. This finding corroborates with Feng et al. (2022) that employee con- tributions are a prerequisite to translating organizational resources into relevant sustainability contributions. The findings of this Research introduced new relation- ships between variables that were not reported by the prior studies. The analysis confirmed that the company size of the firm is a significant factor that influences the regulatory environment of agricultural firms in China. The findings of this research further highlighted that financial performance is also a considerable factor influ- encing agricultural firms’ regulatory environment. From the employee engagement perspective, the study high- lighted that company size and financial performance are significant predictors. The previous studies did not test these relationships in the context of the agriculture sec- tor. The research confirmed that the regulatory environ- ment is also an important variable that influences CSR in the agriculture sector firms in China. Furthermore, this research also confirmed that employee engagement is a significant variable that influ- ences CSR in the agriculture sector firms in China. These direct relationships reported by this study closed a loop in the body of knowledge. Similarly, this study confirmed mediating relationships as it is said that the regulatory environment is not a significant mediator in the relation- ship between company size, firm performance, and CSR. However, the study reported that employee engagement is an essential mediator between company size and CSR. Meanwhile, the mediating role of employees’ engagement between the financial performance of agricultural firms in China and CSR is not accepted. Hence, the findings of this research closed a significant loop in the body of knowledge. These theoretical lenses are reliably reported in the literature, and gaps are addressed. The developed relationships between different vari- ables predicted some practical implications. Firstly, it emerges that company size and financial performance significantly influence the regulatory environment. The agricultural sector firms are required to have appropriate company size and financial performance that will be helpful for them to work in a regulatory environment. The study highlighted that firm size and financial perfor- mance are also required to engage the employees prop- erly in the agriculture sector firms. The fit size and financial performance are significant factors that influ- ence the employees to work properly and advance their approach significantly. Meanwhile, the study highlighted that the firms require both regulatory environment and employee engagement to increase their working approach for achievement of CSR establishment in work. Hence, the study pointed out that the agriculture sector firms in China can achieve CSR. Still, the role of company man- agement is to engage the employees and perform prac- tices to advance the regulation of the environment. The work on these recommendations will be helpful for the companies to succeed in establishing CSR and achieving sustainability goals in a significant way.",
    "The findings of this research are significant in the litera- ture as it introduced newly developed relationships in the agriculture sector of China. Yet, the results of this study have some limitations that the findings of future studies must address. Firstly, this study highlighted that firm size and financial performance significantly influence the regulatory solid environment and employee engagement. Still, the study has not discussed the factors that could affect the improvement of these predictors. Therefore, future studies are required to determine the variables that could significantly influence the advancement of firm size and the organization’s financial performance. The study has collected data from the agriculture sector of Zhengzhou city, Henan province in China. This is a limitation in the data of this research as it is compiled from a specific geography in China. The scholars are motivated to collect data from another population set from multiple provinces in China to confirm the general- izability of the findings. Finally, the data of this study is managed with a cross-sectional approach and structured questionnaire, and future studies are required to collect data with a longitudinal system to test the mediating impact of the regulatory environment and employees’ engagement between the observed variables. These direc- tions will serve as a way forward for the studies to collect This study adheres to the guidelines of the ethical review pro- cess of the associated university and approved by the ethics committees of the School of Management, Zhengzhou University, Henan, China. Data associated with this study is included in the article. However, further inquiries can be directed to the corresponding author upon a reasonable request."
]