[
    "Abstract The construction of rural sports culture is an important content to promote the development of rural sports, and the construction of rural sports culture should seize the strategic opportunity of rural revitalization to promote the high-quality development of rural sports culture construction. This paper combs through the relationship between rural sports culture and rural revitalization, analyzes the theoretical logic of revitalizing the countryside with the local sports culture in Nanyang, Henan Province, and further explores the optimization path of sports culture construction on the development of local talents in rural revitalization. The results of the study show that there is a symbiotic relationship between rural revitalization and sports culture construction, and that local sports talents can help improve the level of rural public sports services, help the development of rural sports industry, and help the revitalization of rural sports culture. Specific optimization paths include digging deep into the cultural value, giving full play to the synergistic advantages of rural elements, strengthening the publicity of sports and cultural knowledge in rural areas, and enhancing the sports awareness of rural natives. Vigorously carry out rural fitness activities, improve basic public facilities, strengthen the development of digital technology empowerment, and build a tournament publicity platform. ADDRESS: Pengfei Lu, Lecturer, Nanyang Normal University, NanYang473061, HeNan, China, email: perfer@nynu.edu.cn. Suhao Wang, Ph.D. Candidate (corresponding author), National GunSan University School of Physical Education GunSan 54000, North Jeolla Province, South Korea, email: suhaowang0213@kunsan.ac.kr. Shanbin Shui, Assistant Lecture, Nanyang Normal University, NanYang473061, HeNan, China, email: 841054088@qq.com. In Nanyang, Henan Province, the development of rural sports is closely related to the long history of local farming culture and traditional folk sports activities, such as the widely circulated dragon and lion dances, taijiquan, martial arts and other forms of sports. Along with the rapid advancement of urbanization, the interaction between cities and villages has become increasingly close, forming a new type of urban-rural interaction and reciprocal development pattern led by cities and giving back to villages [1-2]. In terms of the specific situation of rural development in Nanyang, Henan Province, China, in recent years, the construction of rural infrastructure has been accelerated, the rural economy has continued to improve, and the conditions for the development of sports activities have been improved, which has pushed the modern Nanyang countryside in the direction of more modernization. In the context of rural revitalization, vigorously developing rural sports in Nanyang helps to revitalize the sports culture of its region and brings multiple opportunities for the development of rural sports [3]. The top-level design for the development of rural sports is becoming more and more perfect, providing clear guidelines for the benign development of rural sports, and the sports culture atmosphere in rural areas is becoming stronger and stronger. The attention of all sectors of society to the development of rural sports continues to increase, and many problems existing in the development of rural sports are gradually being solved [4-5]. Along with the promotion of rural revitalization, the talent team in rural areas is also growing, and the return of talents has injected new vitality into the development of rural sports industry [6-7]. In order to avoid the sports talent in the traditional countryside is difficult to realize self-worth, explore the There is a long way to go to cultivate rural construction sports talents who can play sports, know the countryside, love agriculture and farmers through the villages themselves. Most of the Nanyang rural sports talents should belong to the professional category of social sports instructors, but the training system and incentives for Nanyang rural social sports instructors are still not perfect, and it is necessary for the society and the government to realize the supplementation of talents through the introduction of the countryside. The construction of the sports talent system should be based on the premise that sports talent in the countryside to complete a certain amount of work in sports-related positions, and have a certain amount of talent in the countryside to practice and develop a standardized training system can be realized. For the rural areas of Nanyang, Henan Province, how to grasp the opportunities, meet the challenges and achieve breakthroughs is an important issue in the implementation of rural sports and even the entire rural revitalization strategy. In-depth study of this topic is expected to help rural areas seize the historic opportunity of rural revitalization and explore an effective path suitable for the development of rural sports.",
    "culture and the revitalization of rural talent development. Guo, L. and Chen, J found that the high-quality development of the leisure sports industry is inseparable from the support of the three-layer linkage mechanism of \"core industrial system-industrial supporting elements-external environment system\" in the context of rural revitalization. Based on this, a series of targeted suggestions such as innovative curriculum design, promoting the integration of industry and education, and strengthening practical teaching are put forward in order to cultivate composite recreational sports talents with both theoretical knowledge and practical ability, so as to provide a strong talent guarantee for the revitalization of the rural sports industry [10]. Tao, G. found that the current development of rural sports exists such outstanding problems as weak infrastructure, low awareness of farmers' participation and lack of professional talents. In order to solve these problems, a three-in-one development path of “policy guidance, industrial integration and cultural empowerment” is proposed. Specifically, it is necessary to strengthen the leading role of the government in the development of rural sports, promote the in-depth integration of sports with tourism, agriculture and other industries, and at the same time, deeply explore the local traditional sports and cultural resources. Research results show that the development of rural sports can not only optimize the rural industrial structure, promote farmers' income, but also enhance the civilization of rural society and inject new vitality into rural revitalization [11]. Chen, L. et al. found that although the traditional sports culture of the Yi ethnic group in Liupanshui has unique charms, in the process of integrating with the community tourism industry, it faces a contradiction between the protection of cultural authenticity and the development of tourism commercialization. Then, researchers proposed a sustainable development model called “cultural excavation - branding - rural participation”, that is, based on the protection of the traditional sports culture of the Yi ethnic group, to create a tourism brand with local characteristics, and to realize the win-win situation of cultural heritage and economic development [12]. Liu, L through literature research method, pointed out that the development of rural sports exists problems such as regional imbalance, low capital investment, shortage of facilities, weak sports awareness of residents, small sports population, lack of professional instructors and insufficient government attention. In order to solve these problems, it is proposed to carry out special sports activities, develop traditional and modern sports, carry out programs according to the seasons, increase investment and publicity, cultivate sports instructors, and learn from foreign experience and other countermeasures [13]. Zhao, T et al. studied the role of the integration model of should be strengthened to enhance the scientific sports publicity, optimize the management system, strengthen the construction of facilities and the development of characteristics of sports and other countermeasures, in order to promote the development of sports in new rural areas [15]. He, D. believes that rural sports events have a positive impact on rural economy, society, culture and ecology, but the development is faced with organizational management, branding and other problems, which need to innovate the organizational management model, build brands, integrate resources and strengthen risk management in order to achieve the comprehensive revitalization of the countryside [16]. Biao, Y. took the \"village BA\" in Guizhou Province as the research object, and used a qualitative case study design to analyze its success factors, impact on rural sports public services, and challenges. The study found that \"village BA\" has attracted a lot of attention through its unique operation model and cultural integration, but there are problems such as low adaptability between sports and rural areas and weak infrastructure, and it is recommended to develop characteristic brands, improve infrastructure, and build a \"sports\" model to improve rural sports public services [17]. Wei, Z explores the role and practice path of sports in rural revitalization by analyzing the cases of sports practice in typical villages. The study concludes that sports play an important role in enhancing rural vitality, promoting residents' health and promoting economic diversification, which can be realized through rational planning of facilities, enriching the form of activities and fostering the sports industry, etc. At the same time, it puts forward the suggestions of strengthening the policy support and promoting the integration of sports and tourism, etc. [18]. Combined with related research, it is found that the development of rural sports in Nanyang, Henan Province at present is constrained by the lack of various types of talents, and many sports talents choose to give up their careers related to rural sports because the rural sports career is difficult to meet their career expectations such as working environment, salary and remuneration.",
    "Symbiosis originated in the field of biology, which is used to describe the phenomenon that organisms of different species form interdependent and co- evolutionary relationships due to resources or survival needs [19].After the middle of the 20th century, the inquiry of symbiosis theory has gradually transcended the scope of biology and has been widely transplanted and borrowed by the field of social sciences.In the 1980s, scholars focused on the theory of symbiosis, and conducted in-depth studies in the fields of economics, sociology and management. In-depth research. Symbiosis refers to the relationship formed between symbiotic units in a certain symbiotic environment according to a certain symbiotic pattern [20]. Symbiosis has the universality, and its essence is synergy and cooperation. Synergy is one of the basic driving forces for the development of nature and human society, and reciprocal symbiosis is the inevitable trend of symbiosis between nature and human society. The study of symbiosis is not only expanded in the field of application, but also regarded as a research method and tool. Symbiosis theory is a complete analytical framework, which consists of three elements of symbiosis describing the symbiotic system, symbiotic unit, symbiotic mode and symbiotic environment, the basic principles of symbiosis, the basic methods of symbiosis, and the symbiotic dynamics model, etc. [21]. Among them, the symbiotic unit is the basic material condition for the formation of symbiosis, the symbiotic model is the symbiotic relationship between the symbiotic units, and the symbiotic environment is the foundation and prerequisite for the formation of the symbiotic relationship. Symbiosis, as a social phenomenon, a plastic form and a social science method, provides a new perspective for understanding the objectivity of the existence of various relationships in human society, and the theory of symbiosis provides a new explanatory framework for rural sports to empower the comprehensive revitalization of the countryside. First, the aspect of symbiotic unit. Symbiotic unit refers to the basic unit of energy production and exchange that constitutes a symbiosis or symbiotic relationship, and it is the basic material condition for the formation of a symbiosis, and the comprehensive revitalization of the countryside is mainly the revitalization of the five aspects of industry, talent, culture, ecology and organization [22-24]. Therefore, the symbiosis unit under the perspective of symbiosis theory of rural sports empowering the comprehensive revitalization of the countryside also includes five important elements such as industry, talent, culture, ecology and organization. Second, the symbiosis mode. Symbiosis mode refers to the way in which symbiotic units interact or combine with each other, reflecting the mode of action and intensity of action between symbiotic units. Under the guidance of the logical framework and analytical method of symbiosis theory, rural sports is a new engine to promote the comprehensive revitalization of the countryside, forming a mutually beneficial and symbiotic rural revitalization sports model of industry, talent, culture, ecology, and organization, which is similar to symbiotic relationship in biology, forming an interconnected and interdependent social system. Finally, the symbiotic environment aspect [25-26]. Symbiotic environment originally refers to the conditions underlying the emergence and development of organisms in symbiotic relationships in biology. Applied to the field of social sciences, symbiotic environment refers to mutual. Associated social things have common formation conditions and development environment, symbiotic environment including policy environment, cultural environment, social environment and economic environment and other aspects. Symbiosis theory, as an important logical idea of rural sports empowering comprehensive rural revitalization, the symbiotic relationship between sports culture and rural revitalization is shown in Figure 1, which provides new ideas, new perspectives and new methods for the deepening of comprehensive rural revitalization. This study explains the mechanism, difficulties and path of rural sports empowering comprehensive rural revitalization under the perspective of symbiosis theory. It also reveals the internal mechanism of rural sports empowering comprehensive rural revitalization from the perspectives of symbiotic unit, symbiotic mode and symbiotic environment, and provides theoretical reference and path for promoting the high-quality development of rural sports. At present, the weak link in the construction of the basic public service system lies in the countryside, and the construction of a higher-level rural public service system is an important prerequisite for realizing the strategy of rural revitalization. A similar practice in developed countries is to support less economically developed regions, promote the coordinated development of public sports services across regions, and fundamentally ensure the provision of public sports services in urban and rural areas. In recent years, the layout of public service infrastructure for rural national fitness has been optimized, and a number of rural national fitness venues and facilities have been built and improved. But the ensuing problem is that the supply level of the rural public sports service package implementation standards, action plans, operation and maintenance of fitness facilities and equipment, scientific sports and fitness guidance, and the organization and management of tournaments and activities is in urgent need of improvement.",
    "With the multiple functions of education, health promotion and recreational performance, local training units can make the process of training local sports talents a practical activity that enables the recipients to form a higher level of understanding and improve their comprehensive abilities. Therefore, local sports talents training units and sports professionals can enhance the internal driving force for improving the quality of rural public sports service provision. National fitness is an important part of sports, and rural residents' fitness is an important part of national fitness. Native sports talents are not only the recipients of scientific fitness, but also participants in the fitness activities of rural residents, and native sports talents are closely related to the fitness of rural residents. For example, a large portion of the young people receiving native training come from the countryside. If the local sports talents among them carry out voluntary service activities in the countryside where they live, it will not only help to improve the level of public sports services in the countryside, but also contribute to the transformation of the old and new kinetic energy of rural sports development. At the same time, local sports talents can also meet the new requirements of improving the level of rural public sports services in terms of professionalism and practicability. In terms of professionalism and practicability, the details are as (1) Local sports talents can go deep into the countryside to provide rural residents with sports fitness guidance, sports event organization and management, physical health monitoring, sports rehabilitation guidance, etc., inclusive and diversified public sports services, which can help promote the establishment of a new standard of rural public sports and fitness and increase the population base of rural sports and fitness. At the same time, local sports talents can also integrate sports with modern information technology, guide rural residents to master fitness and health promotion knowledge and methods through the Internet, and promote rural residents to develop scientific fitness habits. (2) The sports teaching activities carried out by local sports talents training units in combination with rural residents can also better meet the multi-level and personalized sports and fitness needs of rural residents. At the same time, local sports talents go into the countryside to carry out colorful cultural and sports activities with rural residents, which can not only stimulate the endogenous motivation of rural residents to take the initiative to work out, but also increase the supply of sports activities in the countryside. Rural revitalization cannot be separated from the revitalization of rural industry, and the development of rural sports industry needs a large number of high-quality local sports talents, and to stimulate and empower the high-quality development of rural sports industry. The local sports talents training unit can promote the economic and social development of the countryside through sports education and practical activities, and then promote the development of rural sports industry. In the current context of the new era, the local sports personnel training mode is a training mechanism that highlights the characteristics of “school-enterprise cooperation” and “local” according to the needs of economic and social development, and is conducive to the integration of educational elements that empower the development of new forms of rural sports industry, and is conducive to the formation of a new type of rural sports industry from the practical level. It is conducive to the formation of a new rural sports industry cluster at the practical level. The formation of a new rural sports industry cluster relies on the innovation of rural sports industry, which requires local sports talents to give full play to their talents, promote the integration of traditional rural sports industry with tourism, recreation and other related industries, so as to form a new industry, promoting the steady implementation of the strategy of rural rejuvenation and assisting the diversified development of the rural sports industry. thus Local sports personnel training units have the potential to integrate urban and rural sports resources for integrated allocation, and can use artificial intelligence, big data analysis technology and other high-tech to build an educational and teaching resources platform, and integrate the local sports personnel training process into the new industry of rural characteristics. For example, “original ecological tourism + rural outdoor sports industry” can help promote rural tourism consumption upgrading, which can enrich rural sports culture or change the “single core” tourism development mode mainly based on sightseeing, and the local sports talent training unit can integrate education and practice activities with it to help rural sports Tourism development. This not only promotes the combination of sports theory and practice, but also enriches the additional products of rural sports tourism, adjusts the structure of the rural sports industry, creates diversified forms of the rural sports industry, and provides talent support for the development of the rural sports industry, which in turn contributes to the high-quality development of the rural sports industry.",
    "Deepening the development of local sports, better promoting the Chinese sports spirit and cultivating the Chinese sports culture, and helping the construction of rural spiritual civilization is not only one of the ways to deepen the educational and teaching reform of the local sports talent training units, but also a way for the local sports talent training units to integrate into the overall economic and social development of urban and rural areas. Sport is an important part of culture, and a country's traditional sports culture and modern sports culture are mutually inclusive and promote each other's development, implying an evolutionary process of cultural self-awareness and cultural self-confidence [27]. Traditional sports culture comes from and develops in the traditional culture of the countryside, which requires local sports personnel training units to guide students to deeply understand the sports culture of the countryside, integrate multiple cultures, take the strengths and make up for the weaknesses, promote the innovative development of traditional sports culture, and then realize cultural self-consciousness. Cultural self-awareness is the premise of cultural self-confidence, and cultural self-confidence is based on cultural self- awareness. Native sports talent training units can cultivate students' modern sports cultural literacy through the integration of rural fitness activities, rural special sports events, sports intangible cultural heritage heritage, ethnic folk sports activities and other practices. To cultivate local sports talents, it is necessary to make them keep abreast of the times, constantly update the concept of sports culture, and connect the elements of rural sports industry, rural sports and cultural tourism, and rural spiritual civilization construction through organizing and carrying out sports teaching practice activities, rural social practice activities, On the one hand, through the cultivation of local sports talents, we constantly innovate the ways and methods of sports teaching, increase the reform of practical teaching of sports majors, and go deep into the countryside, stay close to the countryside and rely on the masses. In helping to revitalize the sports culture in the countryside, it cultivates the values of rural residents to enhance their physical fitness and promote their health through sports, and contributes to the construction of spiritual civilization in the countryside. On the other hand, through the excellent talents cultivated by the local training units, the exemplary demonstration effect will drive the rural residents to participate in the construction of sports culture and inherit the excellent traditional Chinese sports culture, strengthen the confidence of the majority of rural residents in the Chinese sports culture, promote the inheritance of the excellent traditional culture in the countryside, and then promote the overall revitalization of rural culture. Nanyang rural ethnic traditional sports contains rich historical connotation and modern implication of cultural value, its special appeal and internal drive, is the core element of rural cultural revitalization, emphasizing the “form” of inheritance and “God” reshaping. As a place where the cultures of Chu and Han meet, Nanyang's folk sports activities, such as taijiquan, wushu, dragon and lion dances, and rowing of dry boats, not only have strong local characteristics, but also contain the traditional values of “unity of mankind and the sky” and “harmonious coexistence”. Its rich historical connotation and humanistic value is an important factor in stimulating the people to participate in the revitalization of rural culture by constructing the symbol of physical culture that integrates leisure and entertainment, etiquette and indoctrination, fitness and health, and internal and external cultivation. By systematically sorting out and integrating the cultural elements, constructing a close and organized system of interaction and value interpretation of the elements. Explain in depth the connotation and elemental value of Nanyang rural culture. Systematically sort out the humanistic qualities, value connotations and moral spirit of traditional national sports, and refine their excellent cultural values and elements, as well as their educational, social and cultural functions. Taking the human resources, customs and rituals and cultural forms in the daily life of traditional ethnic sports as the carrier, seek the connection point with the value of rural cultural revitalization, and give full play to its important roles in physical activities, order shaping and spiritual cohesion. Explain the contemporary connotation and elemental value of its diversified physical activities and rituals, form new cultural experiences and ways of perception, and make it an important resource for rural cultural revitalization. For example, in Nanyang Chenjiagou, as the birthplace of taijiquan, taijiquan not only has the efficacy of strengthening the body and health, but also has the value of moral cultivation and etiquette edification. The local government can closely integrate these cultural elements with modern life through traditional sports events and folklore festivals, making it an important carrier for uniting the sense of identity and cultural belonging in the countryside.",
    "The cultural connotations of the humanistic values and thinking concepts of diversified ethnic traditional sports are used to stimulate the subjectivity of their cultural subjects and elements through the form of diversified physical activities, making them an important driving force and source of energy for the revitalization of village culture. For example, Liulingu village as Nanyang City Health and Physical Fitness Committee designated to help the village, Nanyang City Health and Physical Fitness Committee combined with the village of Liulingu and the characteristics of the resources of the town of Siwan, give full play to the role of the sports events platform, planning and organizing sports tournaments. With the theme of “Developing Sports for All, Helping to Revitalize the Countryside”, the tournament promotes the flow of urban and rural elements through sports competitions and provides a platform for villages to display their own characteristics. Integrating the multidimensional contents of athleticism, recreation and ritual into the system of rural cultural revitalization, using the elements of traditional national sports culture as a carrier, and explaining the multifaceted values of its “language”, knowledge, information and creativity, so as to realize its empowering effects at the cultural, organizational, resource and ecological levels. Through specific cultural practices, the shared value of the cultural concepts applicable to the modern life of the people is formed. For example, the widely circulated dragon dance in Nanyang, which traditionally has the symbolism of praying for good luck and good fortune, can now be integrated into competitive performances and team competitions in rural tourism and festivals to enhance spectacle and interactivity, so as to allow more villagers and tourists to participate in it, and to realize the creative transformation and innovative development of traditional sports. In the face of the current situation of weak sports awareness of the residents of the rural areas of Nanyang, Henan Province, should further strengthen the publicity of sports culture, so as to create a good atmosphere of sports culture in the rural areas. The main reason why residents in rural areas of Nanyang lack due enthusiasm for sports and fitness activities is that they do not have time, but once they have leisure, they still take watching movies, watching TV, visiting doors, chatting, and playing cards as their main entertainment activities. Therefore, in order to popularize the sports knowledge of rural residents and enhance the awareness of physical fitness, according to the characteristics of rural areas, the \"TV fitness equipment\" that rural residents like to see can be used to promote and popularize domestic fashionable sports and fitness to the villagers. \"TV fitness equipment\" fits the hobby of rural residents who like to watch TV, and connects TV and fitness equipment, so that farmers can learn various sports knowledge in the process of watching TV, which can be described as killing two birds with one stone. In addition to \"TV fitness equipment\", the government should also work with science and technology institutions to develop more similar sports and fitness equipment and sports and fitness software to meet the needs of farmers to obtain sports and health knowledge and learn sports and fitness skills from multiple People's health is an important symbol of national prosperity and is the most important visible indicator of modernization. Realizing the pursuit of a better life for farmers is one of the goals of rural revitalization, while the health of individual villagers is a necessary condition for a happy life, and the health of villagers' groups is an important foundation for rural revitalization. Based on the development experience of “Village BA” in Nanyang, Henan Province, the following development paths are proposed: (1) Government departments should strengthen the top-level design of village sports events, enhance policy support and guidance, improve the management system and mechanism of village sports events and related supporting policies, clarify the objectives, forms and contents of village sports events, and refine the requirements for the organization and management of village sports events and resource support. The overall planning of sports events has been formulated in line with the realities of each village, and a sound institutional guarantee system has been constructed for the high-quality development of rural sports events. (2) Actively promoting the construction of “sports+” specialty villages, relying on Nanyang's local cultural resources, such as taijiquan, wushu, dragon and lion dances, and other folk sports, and building some villages or towns into specialty sports bases integrating folk sports, countryside tourism, health and leisure. For example, “Taiji Culture Rural Experience Zone” can be set up in Nanyang Chenjiagou and other places to attract tourists to experience traditional sports programs and drive the development of sports and leisure industry in the surrounding area, thus forming the rural economic growth model of “sports + culture + tourism”. This not only enhances the sense of identity of local residents towards sports, but also attracts quality sports resources into the countryside and helps the promotion and development of rural sports culture.",
    "(3) Building and improving rural fitness facilities for all in the light of the situation. According to the actual situation of each place, combined with the requirements of ecological civilization construction, improve the construction of rural sports public infrastructure, to solve the short board of rural fitness facilities, we should give full consideration to the personalized needs of the villagers, the construction and improvement of facilities in line with the fitness habits of local countryside residents, to meet the needs of the peasant masses for sports and fitness activities. At the same time, we should abandon the government's single supply model, broaden the funding channels, social funds to make up for the shortcomings of the market funds to help integration, to ensure a balanced allocation of rural sports resources. With the development of the digital era, the information infrastructure in rural Nanyang, Henan Province, continues to improve, and digital empowerment for rural development continues to achieve new results. Digital technology also plays a key role in Nanyang's rural sports events, and digital empowerment can improve the organizational efficiency of events, expand their influence, promote the integration of sports and other industries, and ultimately promote rural revitalization and comprehensive modernization. Strengthening the application of new media technology for sports events and fostering new media technology talents. Grass-roots governments, sports organizations and professional institutions have carried out lectures, training and other activities to help rural sports organizations conduct digital competitions and create a digital platform for rural sports. Using big data and cloud computing technology, intelligent management of race registration, race scheduling, and record of results has been realized to improve the efficiency of race organization. At the same time, the government should do a good job of rural digital talent training programs, strengthen the construction of professional talent in the field of new media technology, lower the threshold for the use of digital technology, help villagers to simplify the operating difficulties and processes, explore new ways to open up rural development, so that digital technology becomes a “new farming tool” for modernized rural areas. Based on digital media technology, with the development and dissemination of rural sports events as the goal, it builds an independent publicity platform with the help of the government, and publicizes rural sports events in a more proactive and targeted manner. Plan programs on the digital platform with rural sports events as the main content, present webcasts, short videos, public number tweets and other content, and carry out all-round and multi-angle publicity and reporting on the events. At the same time, the social attributes of the platform should be increased. Villagers apply for personal accounts through the platform, express their personal insights and opinions, and share their personal experience of rural sports events, which generates far-reaching influence on rural sports culture. Tournament organizers can use multiple channels of parallel promotion to publicize rural sporting events. Put videos, create topics and activities on hot social media platforms such as Jitterbug and Weibo to stimulate people's interactivity. Broadcast the event on TV, provide users with personalized information related to the event on PC, and promote the event through text, pictures and videos on transportation media, effectively using people's fragmented time for promotion in the context of an information-based society. Utilizing new media technology, the dissemination of rural sports events in multiple scenarios through a variety of ways, flexibly and intuitively show the charm of rural sports events. Internet technology can also be used to jointly publicize sports events with special cultural and creative products, agricultural products, etc., to tell a good story of the countryside, drive the growth of the rural economy, and give full play to the comprehensive poverty alleviation function of “poverty alleviation, intellectual support, and support for the body” of rural sports events, providing new ideas for the high-quality development of rural sports events. As an important driving force for rural development, sport is bound to play a key role in rural construction in Nanyang, Henan Province. Nanyang has a profound history and culture, and is rich in folklore and sports. In the context of rural revitalization in the new era, the social value of sports should be given full play to, so that sports can become an important hand in promoting the development of rural industry, enhancing rural health and promoting cultural prosperity. The development of rural sports needs to be in accordance with the high-quality requirements of the new development stage and implement the new development concept. This paper takes Nanyang, Henan Province as an example, takes reform and innovation as the driving force, and continuously promotes the integration and development of sports in rural industries, talents, culture, ecology and organizations. By understanding the relationship between the construction of rural sports culture and rural revitalization and optimizing the path, local people can better understand the importance of the construction of rural sports culture, further improve the theoretical system of the construction of rural sports culture, deeply excavate the intrinsic value of Nanyang's rural sports culture, highlighting the characteristics of the countryside, improving the overall health of rural areas, and driving the development of rural economy. Through the popularization and development of sports activities, rural residents can gain a sense of well-being in sports, thus contributing unique solutions, wisdom and strength in the field of sports to the road of rural revitalization."
]