[
    "From Crisis to Opportunity: The Barriers to Chinese National Sign Language Acceptance Among Hearing and Speech-Impaired Persons in China Amid the Pandemic The outbreak of COVID-19 emphasized the worldwide challenges in emergency communication, especially for Hearing and speech-impaired persons (HSIPs) with communication difficulties. In China, the epicenter of the initial outbreak, HSIPs faced sig- nificant communication barriers early on. Promoting the Chinese National Sign Language (CNSL) emerges as a potential solu- tion to this predicament. Despite its potential, CNSL’s adoption rate in China is lower than expected, underlining the need to understand the barriers to its acceptance. Through collaboration with the Disabled Persons’ Federation in Yancheng District, Luohe City, Henan Province, we distributed an online survey via official disability WeChat groups to gather data from HSIPs. The survey design, incorporating single-choice questions for demographic information and a Likert five-point scale to gage the willingness to use CNSL, was intended not only to understand their basic situation but also to identify the determinants influen- cing HSIPs’ behavioral intention toward CNSL adoption. By using linear regression analysis with SPSS, we found that Perceived Usefulness (PU), Ease of Use (EOU), Social Influence (SI), Facilitating Conditions (FC), and Self-efficacy (SE) all have a significant positive impact on Behavioral Intention to Use (BIU) CNSL. Additionally, one-way ANOVA and post hoc tests revealed signifi- cant group differences between annual income and behavioral intention to use CNSL. This research provides profound insights for the global community regarding the acceptance of CNSL among HSIPs in China, offering insights to enhance daily and emer- gency communication efficiency for HSIPs, and contributing to building a more inclusive and safe society. The COVID-19 pandemic highlighted communication challenges across the world, especially for deaf and mute individuals who find it hard to communicate using traditional means. In China, where the pandemic first surged, these individuals faced even greater hurdles in getting their message across. To solve this problem, experts suggested more people should learn and use Chinese National Sign Language (CNSL). However, not as many people are learning CNSL as expected. To understand why, a study was carried out in Yancheng District, Luohe City, Henan Province, in collaboration with the Disabled Persons’ Federation. An online survey was shared through WeChat groups dedicated to 1University of Chinese Academy of Sciences, Beijing, P.R. China 2Institutes of Science and Development, Chinese Academy of Sciences, Beijing, P.R. China 3School of Economics, Beijing Technology and Business University, P.R. China 4Sino-Danish College, University of Chinese Academy of Sciences, Beijing, P.R. China 5School of Management, Jiangsu University, P.R. China An Chen, Institutes of Science and Development, Chinese Academy of Sciences, No. 15 ZhongGuanCun BeiYiTiao, Beijing 100190, P.R. China. Email: change1970@163.com Creative Commons CC BY: This article is distributed under the terms of the Creative Commons Attribution 4.0 License (https://creativecommons.org/licenses/by/4.0/) which permits any use, reproduction and distribution of the work without further permission provided the original work is attributed as specified on the SAGE and Open Access pages (https://us.sagepub.com/en-us/nam/open-access-at-sage). disabled individuals to collect their views. The survey asked about their backgrounds, and their thoughts on learning CNSL, using a mix of simple questions and a rating system to measure their interest. Analysis of the survey responses showed that how useful people think CNSL is, how easy they think it is to learn, how much support they feel they have from others, and their confidence in their ability to learn all play a big role in their willingness to use CNSL. Moreover, people’s income levels also influenced their interest in learning CNSL. This study sheds light on why CNSL isn’t as widely used as it could be among deaf and mute people in China. It offers valuable insights on how to improve communication for these individuals, not just in everyday life but also in emergencies, aiming to create a more inclusive and understanding society. In the last two decades, coronaviruses have triggered three significant outbreaks, (Ahmad et al., 2020), with COVID-19 emerging as the latest and most severe global health challenge. The critical role of information dissemi- nation during such a crisis cannot be overstated (Wieland et al., 2021). Effective communication not only mitigates panic, dispels misconceptions, and ensures public safety but also promotes international collaboration, boosts the efficiency of epidemic prevention, and reinforces social trust (Malik et al., 2021). The United Nations has acknowledged the profound risks posed by misinforma- tion and has launched a global initiative, ‘‘Verified’’ to actively counter the spread of false information. This highlights the increasing global consensus on the indis- pensable need for timely, accurate, and transparent com- munication in addressing public health crises (United Nations, 2020a, 2020b).",
    "Hearing and Speech-Impaired Persons (HSIPs) have demonstrated considerable vulnerability in the face of COVUD-19. Maintaining daily communication already imposes significant pressure on them (Mansutti et al., 2023), and for those with additional physical disabilities, such as dysphagia, cerebral palsy, visual impairments, and developmental disabilities (Hassinen & Lappalainen, 2018), these challenges are further intensified. Although the international community has consistently worked to promote information accessibility for HSIPs and has implemented various initiatives—such as UNESCO’s leadership in developing a series of accessibility stan- dards and the explicit inclusion of disability rights to information and education in Sustainable Development Goals (SDGs) 4, 8, and 10 (United Nations, 2015)—the reality is that HSIPs are often marginalized in emergency situations, facing disproportionately higher mortality risks (Arai & Sang, 2013; Han et al., 2017). Sudden isola- tion and treatment protocols can disrupt HSIPs’ established channels of information access, leaving them isolated and vulnerable during emergencies, and in some cases, plunging them into an information vacuum. This not only leads to psychological deterioration but also makes it difficult for them to align with public health measures, further exacerbating their risk of infection and health complications (Dai & Hu, 2022). Effectively addressing the communication barriers faced by HSIPs in emergency situations and ensuring their right to access information has emerged as a critical global challenge. This is not only a matter of pandemic response efficiency, but also a fundamental human rights issue (United Nations, 2022). HSIPs utilize unique modes of communication, specif- ically oral communication and sign languages. The out- break of COVID-19, and the widespread use of face masks have severely disrupted their capacity for oral communication. As a result, sign language emerged as a viable alternative in emergency contexts, allowing for the maintenance of safe social distancing while reducing infection risks (Halim & Abbas, 2015). Although sign language is the most practical option for HSIPs during emergencies, it faces significant challenges related to standardization, particularly due to variations in local Homesigns. These discrepancies can hinder the effective- ness of sign language in official and cross-regional emer- gency communications (Coppola, 2020; Sandler & Lillo- Martin, 2006). The lack of standard sign language (SSL) has impeded HSIPs’ access to accurate and timely infor- mation (Napoli et al., 2015), particularly for essential communications such as press briefings, health guide- lines, and other vital announcements, leading to signifi- cant information loss, omission, or misinterpretation (Areeb et al., 2022). Notably, during the pandemic, the term ‘‘coronavirus’’ was represented by over 15 different sign language expressions worldwide (Castro et al., 2020), exemplifying the inconsistencies that hinder effec- access (Barnett et al., 2011). The non-standardization of sign language (Coppola, 2020; Sandler & Lillo-Martin, 2006) has garnered global attention, especially during the pandemic, prompting urgent calls s to SSL to ensure the safety of HSIP com- munities and equitable access to essential services like medical care, housing, and transportation services (Bricout & Baker, 2010). However, the process of stan- dardizing sign language faces numerous complex chal- lenges. Firstly, the inherent complexity (Kemp, 1998) of SSL, along with the substantial costs of acquisition (Olsen, 1988), poses significant barriers to its widespread adoption. Families with greater financial resources are more likely to expose their HSIP children to SSL at an early age and sustain their learning over time. Secondly, parents and communities may hold conservative or resis- tant attitudes toward SSL. For instance, hearing parents often struggle to transmit their own language and culture to their HSIP children (Napoli et al., 2015), feeling powerless or indifferent toward their child’s acquisition of SSL. Personal biases can lead some to fear that adopt- ing SSL might hinder their children’s oral development (Chamberlain & Mayberry, 1999), contributing to HSIP children’s isolation from SSL communities and exacer- bating their linguistic deprivation (Hall, 2017; Rosen, 2020). Additionally, prejudices within Deaf communities that use distinct Homesigns view SSL as divisive (Baker & Cokely, 1980) and may display hostility toward its users (Grant, 2008; Miller, 2008). Psychological chal- lenges such as loneliness and depression (Ellis et al., 2010), compounded by physical impairments, can dimin- ish HSIP’s confidence in learning SSL. Furthermore, the insufficient provision of sign language services in health- care and social settings (Li, 2023) exacerbates stress and discouragement, further deterring it’s adoption.",
    "The COVID-19 pandemic has underscored the urgent need for sign language standardization gaining substan- tial significant attention from the global community. During the 2020 International Day of Sign Languages, United Nations Secretary-Anto´ nio Guterres (United Nations, 2020a, 2020b) noted that several countries had delivered public health announcements and information related to COVID-19 through national sign language interpretation. Developed countries, such as the United States (Howley, 2020), the United Kingdom (UK Health Security Agency, 2021), and Norway (World Health Organization [WHO], 2020), integrated SSL interpreters into press briefings and provided online resources featur- ing sign language explanations. In 2022, the United Kingdom further emphasized the importance of accessi- ble communication by officially recognizing British Sign Language (Bentley, 2020) as a legal language. In challenges in sign language standardization during the pandemic, including shortages of trained interpreters, diversity of local sign languages, social stigma, and digi- tal divide (Tufar & Traˆ nca, 2021). China is a signatory to the Convention on the Rights of Persons with Disabilities (United Nations, 2008), bears the responsi- bility to promote sign language education and reinforce linguistic identity among HSIP communities. As a devel- oping country and the initial epicenter of the COVID-19 outbreak, China encountered challenges in sign language standardization for HSIP populations earlier than many other nations. China’s efforts in this area could provide valuable insights to other developing countries. Prior to the pandemic, China has actively engaged in the research and promotion of SSL, although problems remain. A survey in 2011 revealed that over half of the adult deaf population and workers found the Chinese Sign Language vocabulary inadequate, with nearly 70% iden- tifying inconsistencies in gestures (Ministry of Education of the People’s Republic of China, 2018). The release of the National Universal Sign Language Dictionary in 2018 became a key milestone in the standardization pro- cess, marking the official promotion of Chinese National Sign Language (CNSL) in China. Policies such as the Notice on the National Promotion of SSL and Standard Braille, and the National Action Plan for Sign Language and Braille Standardization further supported the wide- spread adoption of CNSL. CNSL stands as the optimal solution for addressing the communication challenges of HSIPs in emergency scenarios within China. Nonetheless, challenges persist. According to the China Disability Statistics Yearbook 2022, the total number of certified HSIPs in the country reached 3,818,508. Of these, 3,462 individuals, making up 0.09% of the total, use hearing aids and cochlear implants to assist with oral language learning. The remaining 99.1% of HSIPs probably rely on sign lan- guage for communication. In response to the CNSL edu- cational needs of HSIPs, China has set up 225 educational institutions specializing in sign language, encompassing regular high schools for the deaf, voca- tional schools for the disabled, and tertiary special edu- cation colleges. Furthermore, 328 deaf associations scattered across the nation assist and support HSIPs in acquiring universal sign language. Nevertheless, the CNSL educational resources from schools, colleges, and deaf associations fall short of meeting the immense learn- ing needs of this large population. Given that the imple- mentation of CNSL has been in place for less than 5years, it’s crucial to understand the challenges and bar- riers faced by HSIPs when encountering and learning CNSL. The experience of COVID-19, along with practi- importance of promoting CNSL in China. Despite the broad attention given to the promotion and application of CNSL, research on the HSIPs’ acceptance remains scant. To gain a deeper insight into the authentic thoughts and demands of HSIPs, it’s paramount to gather their direct feedback. Moreover, even though China’s mega-cities and large urban areas have made sig- nificant progress in developing accessible environments and have garnered much attention, cities with moderate economic development still face many challenges in this regard. To address the challenges mentioned above, this paper seeks to investigate the reasons behind the reluc- tance of HSIPs in cities with moderate economic levels to accept CNSL as their primary mode of communica- tion during the COVID-19 pandemic. Specifically, this article employs a questionnaire-based approach, inter- twined with related literature and actual circumstances. It delves into a detailed investigation of HSIPs in the Yancheng District of Luohe City, aiming to explore vari- ous obstacles and factors influencing their use of CNSL.",
    "This study provides empirical insights into the deter- minants influencing the adoption of CNSL among HSIPs in China. It elucidates how Perceived Usefulness, Ease of Use, Social Influence, Facilitating Conditions, and Self-efficacy significantly shape the behavioral inten- tion to use CNSL, thereby enriching our comprehension of sign language within this distinct context. Highlighting the acute communication barriers HSIPs face, especially during emergencies such as the COVID-19 pandemic, this research emphasizes the need for effective communi- cation solutions tailored to HSIPs. Situated within the context of China, the initial epicenter of the outbreak, our findings advocate for the broader adoption and stan- dardization of CNSL as essential steps toward improving both daily and emergency communication for HSIPs, enhancing their overall safety and well-being. Ultimately, by focusing on the unique needs of HSIPs and promoting the widespread use of CNSL, this study aims to contrib- ute to the creation of a more inclusive and secure society. It underscores the critical importance of inclusivity in emergency communication planning to ensure no vulner- able population is overlooked. This study sought to perform an online survey among the HSIPs in the area with the assistance of the Disabled Persons’ Federation of Yancheng District, Luohe City, Henan Province, China. The study area was chosen for the following considerations: Firstly, Yancheng District has both the necessity and representativeness for the research. Although HSIPs in major cities have access to rich infrastructure, education resources, and advocacy avenues, Henan, being a densely populated province, contributes to 7.3% of the total HSIPs nationwide, high- lighting its significant demographic foundation. However, there are only nine schools and colleges in the province that offer official CNSL teaching, revealing its lack of educational resources, which also underscores the importance of paying attention to HSIPs in Henan. Secondly, the accessibility and authenticity of data were also key considerations. Given the communication bar- riers between hearing individuals and HSIPs, obtaining firsthand data directly from HSIPs is relatively challen- ging. Fortunately, we have established a cooperative relationship with the Disabled Persons’ Federation in the Yancheng District of Luohe City, allowing us to collect data through WeChat groups for disabled people man- aged by them. SPSS 26.0 was utilized to process the sur- vey data. It provided tests for validity, reliability, correlation, linear regression, and one-way analysis of variance. GraphPad Prism was used for post hoc tests. The Disabled Persons’ Federation of Yancheng District, Luohe City, Henan Province, China, played a crucial role in the dissemination and data collection for this study. This federation serves as the primary grassroots organi- zation for disability-related activities and services in the region. It operates under the governance of the local Disabled Persons’ Federation in Luohe City, Henan Province. As of November 2022, there were a total of 11,793 certified disabled individuals in this district, including 1,288 individuals with hearing and speech- impairments, all of whom were eligible to participate in the online questionnaire survey. This study strictly adhered to the principles of ethical review. At the outset of the research, we meticulously designed the question- naire to ensure that the entire study design complied with ethical standards. With the assistance of the Disabled Persons’ Federation of Yancheng District, Luohe City, Henan Province, all participants were fully informed about the purpose, procedures, potential risks, and bene- fits of the study before their participation and had expli- citly provided their consent. To protect the privacy and data security of the participants, we implemented strin- gent measures for data anonymization and confidential- ity. Furthermore, participants have the right to withdraw their participation at any stage without suffering any adverse consequences. Prior to formal data collection, we conducted expert interviews with staff from the local Disabled Persons’ Federation to ensure the validity and scientific rigor of the questionnaire’s dimensions and item design. Given their in-depth understanding of the specific needs of the HSIP population and the promotion of sign language, this process effectively refined the questionnaire, aligning it more closely with the practical requirements of the tar- get population. The questionnaire design of this study is divided into two main parts. The first part collects basic sociological information from respondents, including Gender, Age, Marital status, Education level, Occupation, Annual income, Disability category, Disability level, and familiarity with and usage of CNSL. A multiple-choice format was employed, allowing parti- cipants to select the most applicable option from a set of predetermined choices. This facilitates a comprehensive understanding of the basic conditions of individuals with HSIPs and supports the conduct of ANOVA and post- hoc tests.",
    "The second part is built upon a carefully selected theo- retical framework, which ensures that the questionnaire is a reliable and effective tool for data collection (see Figure 1 and Table 1). In this section, a Likert 5-point scale is utilized to report results, with options ranging from Strongly disagree to Strongly agree, allowing for a nuanced capture of participants’ attitudes toward specific statements. The use of these scales helps to ensure the appropriateness of the statistical analyses and facilitates the processing and interpretation of the data results. The choice of theories was based on the research design, par- ticipant characteristics, and prior studies. Perceived Usefulness and Ease of Use. Perceived Usefulness (PU) and Ease of Use (EOU) are considered to be impor- tant determinants of the intention to use technology (Davis, 1989). PU mainly examines users’ perceptions of the ability of an object to improve work efficiency and effectiveness, which relates to the performance level of new things (Pfeffer, 1982; Schein, 1980). EOU empha- sizes the user’s experience, assessing whether the effort invested in adopting new systems or methods outweighs the performance benefits they provide (Radner & Rothschild, 1975). Rothschild, 1975). Perceived Usefulness has received extensive attention in sign language research. Early exposure to SSL pro- motes bidirectional parent-child interactions and pro- vides a foundation for motor coordination and visual acclimatization, both critical for acquiring written or spoken language (Supalla et al., 2020). It is also essential for HSIPs’ linguistic development, as limited access to standardized sign or spoken language during childhood can delay language acquisition and hinder the develop- ment of neural structures related to language (Hall, 2017). High-quality SSL education not only supports theory of mind development but also enhances creativity and memory (Napoli et al., 2015). In deaf schools, SSL serves as the primary medium of instruction, and delays in its acquisition can negatively affect academic perfor- mance (Hermans et al., 2010). Furthermore, the use of SSL not only addresses HSIPs’ personal and social com- munication needs but also facilitates their integration into communities, enabling them to interact with family, friends, and community members, thus alleviating loneli- ness and isolation (Hassinen & Lappalainen, 2018). In China, perceived usefulness emphasizes the practical ben- efits and efficiency of CNSL in real-world applications. It reflects how HSIPs view CNSL as an effective tool for daily communication, language acquisition, cognitive capabilities, and educational engagement. However, existing research often focus primarily on the use of SSL in everyday situations or conflates these with emergen- cies, failing to adequately distinguish between the two. This narrow focus overlooks the complexities of SSL use, especially in emergency contexts. In light of the COVID-19 pandemic, our study examines HSIPs’ per- ceived usefulness of CNSL in emergencies in China, aim- ing to address gaps in the literature and contribute to the advancement of sign language research. Ease of Use refers to the perceived effort required by Ease of Use refers to the perceived effort required by HSIPs to learn and employ SSL, which is influenced by factors such as the complexity of sign language structure, physical and cognitive conditions, cultural identity, and resource availability. SSL involves intricate grammar, syntax, and emotional expression, requiring the coordi- nation of facial expressions, body movements, and hand gestures. Additionally, many HSIPs face additional physical challenges such as swallowing difficulties, cere- bral palsy, vision impairments, and developmental disor- ders (Hassinen & Lappalainen, 2018), which further complicate learning. In communities where SSL lacks cultural acceptance, its usage is severely constrained. Adequate time and resources are essential to sustaining HSIPs’ acquisition of SSL, with some up to 9years to achieve proficiency (Miller, 2008). This process requires specialized textbooks, video tutorials, sign language dic- tionaries, and modern technological tools to support effective learning. The Ease of Use of SSL is a critical global issue, particularly as protracted crises amplify the challenges of learning and utilizing it. Difficulties in accessing information during such crises can directly endanger the lives and well-being of HSIPs. In economi- cally underdeveloped countries, reducing the barriers to learning and using SSL is essential to encouraging HSIPs to engage with sign language education. Our study aims to explore the additional challenges HSIPs encounter when using CNSL during emergency situations in China, offering insights that may inform strategies in other developing countries.",
    "Social Influence. According to Kelman, the process of Social Influence involves compliance, internalization, and identification, exploring how an individual’s thoughts, emotions, and actions are affected by the actual, imagined, or implied presence of others. Venkatesh et al. (2003) stresses that Social Influence is HSIPs’ acceptance of SSL is markedly affected by family environment and the modes of communication adopted by family members. Families that regularly use gestures may foster greater receptiveness to SSL (Miller, 2008). HSIP children of deaf parents typically acquire SSL at an early age, while those with hearing parents may experience delays in acquiring sign language skills (Hermans et al., 2010). Hearing parents may sometimes discourage their children from learning SSL due to cul- tural and linguistic barriers, which directly diminishes the child’s motivation to learn it (Hall, 2017). Support from friends who use SSL also has a positive impact on HSIPs’ learning. Friends not only help allevi- ate the stress and anxiety associated with learning but also provide practical opportunities to enhance SSL skills. In the workplace, the inclusivity and understand- ing of colleagues, especially among hearing colleagues, can encourage HSIPs to be more engaged. HSIPs aspire to achieve better career development through the use of SSL, performing according to anticipated workplace norms (Hoffmeister, 2020). Social media has diversified the promotion of SSL, making it more engaging and appealing, which has sparked HSIPs’ interest in learning (Maulida et al., 2019). However, potential drawbacks exist (Saunders, 2016). Misinformation, stereotypes, and over-commercialization in the media can trigger conflict- ing attitudes in HSIPs, leading to mental resistance toward the adoption of SSL. Drawing from extensive research and the sociocultural realities within China, we have gained valuable insights into the significant role of SI in the lives of HSIPs. The most impactful sources of SI stem from friends, family, colleagues, and social media. However, there is a notice- able gap in the literature, as previous studies have not sufficiently explored the distinct and profound impact these different sources of SI may have on HSIPs’ accep- tance and use of CNSL. In China’s collectivist society, which emphasizes social harmony and interpersonal rela- tionships, SI on the acceptance of CNSL by HSIPs war- rants deeper investigation. Endorsement from close social networks, such as friends and family, likely carries more weight compared to some individualistic cultures. Likewise, colleagues and social media play pivotal roles in disseminating information and shaping percep- tions of CNSL in China, where group consensus and social endorsement are highly influential. Understanding these culturally rooted dynamics is essential for develop- ing targeted strategies to promote CNSL adoption. Therefore, our study aims to bridge this gap by examin- ing the specific SI factors influencing HSIPs in China, providing a nuanced understanding of the societal forces shaping CNSL adoption. Facilitating Condition. Facilitating Condition (FC) refers to the objective factors an individual perceives as helpful in using a specific entity. Its core focus lies in determining whether the user has the necessary resources and support to use technology and identifying external factors that can assist the user. When favorable conditions are pres- ent, users are more inclined to accept and use new things (Venkatesh et al., 2003). It emphasizes that, apart from individual subjective cognition, external support and resources play a crucial role in the adoption of new languages. The acceptance of SSL by HSIPs can be influenced by various external factors. Limited availability of sign lan- guage services significantly hinders many HSIPs access to SSL (Hassinen & Lappalainen, 2018). Numerous individ- uals with hearing impairments have limited exposure to SSL during their childhood (Kacorri et al., 2015), partic- ularly deaf infants in hearing families, who may experi- ence language deprivation due to the lack of access to SSL (Rosen, 2020). While HSIP students may express a willingness to learn SSL in the classroom, the absence of a supportive environment outside may discourage contin- ued adoption. Community attitude also play a key role in fostering SSL learning. In inclusive communities, SSL seamlessly blends into daily routines, promoting active engagement (Hoffmeister, 2020). The presence of skilled interpreters and qualified teachers is essential for provid- ing high-quality SSL education, which enhances learning outcomes and increases adoption rates (Brueggemann, 2020). However, when institutions such as hospitals or psychological consultation entities (James et al., 2022) decline SSL requests, HSIPs may feel additional stress, reducing their motivation to use SSL. Financial support is also key, as high costs can impede sustained interest in learning SSL.",
    "While existing literature provides valuable insights into the external factors affecting the acceptance of SSL by HSIPs, it often overlook the interconnectedness of these factors and their collective impact on adoption behaviors. This gap is particularly evident in the absence of a holistic examination of the support ecosystem that shapes HSIPs’ engagement with CNSL. To address this, our study applies the concept of Facilitating Conditions (FC) to delve into the multifaceted support system required for CNSL adoption. We focuses on three criti- cal areas: the availability of real-life scenarios for CNSL application, the adequacy of supportive products and technologies, and the accessibility of assistance for users encountering difficulties with CNSL. By examining these aspects, our study not only identi- fies gaps in the current literature but also considers the unique socio-cultural context of China, offering a frame- work to address CNSL acceptance issues among HSIPs through the lens of Facilitating Conditions. Self-Efficacy Theory. Self-efficacy (SE) holds universal rele- vance in predicting and explaining behavior change, referring to an individual’s belief in their ability to effec- tively perform specific actions in particular situations (Bandura, 1977). Self-efficacy influences an individual’s behavioral choices, level of effort, and persistence, thereby affecting the outcomes of their actions. This con- cept is widely applied across various domains, including education, healthcare, and career development, to eluci- date individual behavioral changes, learning motivation, and emotional regulation. Self-efficacy plays a key role in motivating the adop- tion of SSL (Michael, 2019; Miller, 2008). Many HSIPs struggle with low confidence due to loneliness, depres- sion, anxiety symptoms, and personality disorders (Hassinen & Lappalainen, 2018). When HSIPs believe in their ability to learn SSL, they are more likely to invest time and effort. However, for those using cochlear implants, learning both auditory and oral skills alongside SSL can be overwhelming, as it requires developing two skills simultaneously without a pre-existing language foundation, which may induce self-doubt and hamper motivation (Hall, 2017). Engaging with proficient sign language users, especially adults (Napoli et al., 2015), can aid help overcome the challenges of acquisition, enhancing HSIP children’s Self-efficacy and boosting their confidence in using SSL (Michael, 2019). Self-effi- cacy not only drives learning motivation but is also closely linked to emotional and psychological well-being. Although existing literature provides some insights, a significant research gap persists in effectively enhan- cing the Self-efficacy of HSIPs throughout the process of accepting CNSL. Current studies often fail to account for the influence of diverse cultural and social contexts on the self-efficacy of HSIPs using SSL. Distinct cultural environments present unique chal- lenges and opportunities that significantly shape HSIPs’ experiences. Moreover, there is a relative lack of research on how to build supportive social networks to enhance the Self-efficacy and motivation of HSIPs in learning SSL. By introducing Self-efficacy theory into the study of HSIP adopting CNSL, a deeper understanding of HSIPs’ self-awareness, emotional states, and behavioral patterns could be gained, offer- ing more tailored support for their growth and adop- tion process. Our research aims to address these gaps, offering more targeted and effective strategies to encourage HSIPs to embrace CNSL more actively. This study developed an electronic questionnaire based on the theory of Perceived Usefulness, Ease of Use, Social Influence, Facilitating Conditions, and Self-effi- cacy. In late October 2022, the electronic questionnaires were distributed via Wenjuanxing, utilizing the WeChat group managed by the Disabled Persons’ Federation of Yancheng District, Luohe City, Henan Province, China. To ensure that HSIP participants fully comprehended the questionnaire and completed it independently, they were provided with access to staff through a designated WeChat group for assistance and clarification whenever needed. For participants who were genuinely unable to complete the questionnaire independently (e.g., those with low literacy, or limited comprehension abilities), we ensured they did not participate, or that a trusted family member or friend assisted in the completion process to uphold data accuracy and integrity. Following data col- lection, we excluded questionnaires that exhibited insuffi- cient completion time or inconsistencies in responses to reverse-coded validation items, further ensuring the qual- ity and reliability of the dataset. A total of 191 question- naires were collected by November 5, with 147 were Upon analyzing the data, several noteworthy patterns emerge that highlight the characteristics of our surveyed cohort. The gender spread in the dataset is fairly even, fostering a balanced representation. A significant 98% of the participants are adults, suggesting a mature cognitive framework and evaluative capacities. In terms of marital status, around 76.2% of participants are married, indi- cating a potentially stable familial and social environ- ment. From the disability standpoint, it’s interesting to note that only 25 respondents are categorized under dis- ability level 1, a relatively smaller proportion compared to other levels. The analysis of education, occupation, and financial metrics provides insightful findings. With the 2021 benchmark for per capita disposable income in Luohe City set at 28,000 yuan, it is concerning to dis- cover that 81% of participants earn below this threshold. Moreover, approximately 68% of respondents have attained a high school education or below, indicating limited educational opportunities. The ambiguous occu- pational tag of ‘‘other’’ chosen by 98 participants further raises questions about potential employment challenges or discrepancies they might face. The combination of restricted educational access and limited income avenues could potentially result in lower life quality, underscoring the urgency for adaptive strategies and robust support mechanisms. Additionally, it is worth noting that 25.9% of respondents had not heard of CNSL, and 37.4% had never used it (Table 2).",
    "The questionnaire consists of seven variables, namely Perceived Usefulness (PU), Ease of Use (EOU), Social Influence (SI), Facilitating Conditions (FC), Self-efficacy (SE), and Behaviors Intention to Use (BIU). The reliabil- ity of the questionnaire was analyzed using SPSS 26.0 (Table 3). The results show that Cronbach’s alpha coeffi- cients are all above .8, indicating that the data have good internal consistency and can be used for correlation and regression analyses. The KMO value in Table 4 is 0.876, all exceeding 0.6, suggesting that the questionnaire data is suitable for factor analysis. Bartlett’s test p-value is less than .001, rejecting the null hypothesis and indicating that the data does not conform to a multivariate normal distribution, thereby validating the use of factor analysis. Note. According to the regulations of the China Disabled Persons’ Federation, the level of disability decreases progressively from Level 1 to Level 4. In factor analysis, the relationship between variables and factors is assessed through factor loadings. Principal component analysis was employed for factor extraction, and the Kaiser normalizing maximum variance method was used for factor rotation. Table 5 presents the vari- ables and their respective correlation coefficients with each of the six components. Most variables exhibit rela- tively high correlations with at least one factor, indicat- ing good validity of the data. Based on the magnitude of correlation coefficients and the significance level, the independent variables that exhi- bit strong and significant correlations with the dependent variable were selected to be included as explanatory vari- ables in the regression model. Table 6 presents the corre- lation matrix of questionnaire data, displaying the correlation coefficients among the seven variables. The correlation values between each variable fall within the range of 21 to 1, and the significance levels meet the required criteria. This suggests that the data is suitable for constructing a linear regression model. Table 7 lists the statistical indicators for the linear regres- sion model. The independent variables in this model are PU, EOU, SI, FC, and SE. The adjusted R-squared is a coefficient of determination adjusted for the number of independent variables. The adjusted R-squared value is .511, indicating that the independent variables can account for 51.1% of the variability in the dependent variable. This suggests that the independent variables possess a certain predictive capability for BIU and can explain a portion of the variability in BIU. Table 8 presents the findings of the analysis of var- iance (ANOVA) for the regression model. According to the results, the sum of squares for regression is 54.888, with 6 degrees of freedom, a mean square of 10.978, an F-value of 31.466, and a significance level of .000. This indicates that the regression model is suitable for predict- ing BIU, and the six independent variables have a posi- tively significant impact on it. This study employed a linear regression model to explore the relationship between BIU and six variables, as presented in Table 9. The coefficients for PU, EOU, SI, FC, and SE are significant. This indicates a signifi- cant positive correlation between these variables and BIU. Finally, VIF (Variance Inflation Factor) measure- ments were used to evaluate collinearity issues. All VIF values were found to be lower than 1.7, which is much lower than the standard limits of 5 or 10. Therefore, in this regression model, collinearity problems are not expected to affect the accuracy and reliability of the model. The one-way ANOVA results (Table 10) indicate that factors such as gender, educational level, annual income, and the level of disability significantly influence the usage of CNSL. Among them, gender stands out as the most influential factor in using CNSL. The F-value is 5.025 with a p-value of .026, which is less than the commonly accepted significance level of .05. This suggests signifi- cant differences in the willingness to use CNSL among different genders. Similarly, educational level shows a significant difference with an F-value of 2.408 and a p- value of .039. This means that the educational level can also influence the willingness to use CNSL. The annual income factor is also found to be significant, with an F- value of 2.739 and a p-value of .031. Thus, the willing- ness to use CNSL might vary among individuals with dif- ferent annual incomes. The disability level has an F-value of 2.669 and a p-value exactly at the threshold of .050. This suggests a borderline significance, indicating that the willingness to use CNSL might also differ based on the disability level.",
    "Moreover, through a deeper post-hoc analysis (Bonferroni) (Figure 2), significant differences in BIU between the annual income group of 5.00 and all other groups have been observed. Especially, the differences between the three groups with annual incomes below 50,000 yuan and those with annual incomes exceeding 100,000yuan, p-values were .019, .025, and .022, respec- tively. These findings present compelling evidence for further exploration into the influence of economic status on the acceptance of CNSL among Chinese HSIPs. This study embarked on an investigation within Yancheng District, Luohe City, Henan Province, China, targeting HSIPs to decode their Behavioral Intention toward CNSL adoption. Centering on five pivotal variables—Perceived Usefulness, Ease of Use, Social Influence, Facilitating Conditions, and Self-efficacy—our analysis unveils a unan- imous significant influence of these factors on HSIPs’ acceptance of CNSL. This introduction lays the ground- work for a comprehensive examination of each variable’s role and their collective impact on adopting CNSL, align- ing our empirical findings with the theoretical framework posited at the onset of this research. Our research elucidates the profound influence of both Perceived Usefulness and Ease of Use on the Behavioral Intention toward CNSL adoption among HSIPs in China. Perceived Usefulness focuses on the tangible bene- fits of CNSL, while Ease of Use emphasizes whether extra effort is needed when using CNSL. This suggests that enhancing the practicality and accessibility of CNSL dur- ing public health emergencies should be a key priority. Research has shown that the perceived usefulness of CNSL significantly influences HSIPs’ willingness to adopt it, underscoring the practical advantages within the Chinese context. CNSL offers tangible convenience and serve as a key motivator for HSIPs, functioning much like Mandarin for the hearing population by facili- tating communication across disciplines and formal set- tings (Miller, 2008). During public health emergencies, the standardization of CNSL enables government agen- cies, healthcare institutions, and public health bodies to consistently deliver policies, medical advice, and emer- gency measures to HSIPs across the country (Hoffmeister, 2020). This consistency helps prevent mis- communication and information loss, supporting the effective implementation of public health initiatives. In formal and professional settings, CNSL proficiency also aids HSIPs in fulfilling social responsibilities, integrating into society, and reducing feelings of isolation (Hassinen & Lappalainen, 2018). However, in smaller, localized communities, the appeal of CNSL diminishes as Homesign suffices for daily interactions, reducing the motivation to learn CNSL. This lack of engagement weakens CNSL’s communication benefits during crises like the COVID-19 pandemic, where minimizing misin- formation and delays is critical for effective emergency responses (Adithya & Rajesh, 2020). Limited CNSL pro- ficiency among HSIPs further hampers the dissemination of news, public health education, community support, and volunteer efforts, both online and offline, com- pounding challenges like psychological stress, social iso- lation, and barriers to healthcare access due to inadequate information. Local communities serve as a critical foundation for promoting and expanding CNSL use. By creating a bilin- gual sign language environment, HSIPs can use Homesign for daily communication while employing CNSL in formal or emergency settings, gradually reduc- ing resistance to CNSL as a Homesign alternative. Organizations like the Chinese Deaf Association and the Disabled Persons’ Federation could support CNSL adoption by subsidizing training programs and provid- ing free online resources, such as sign language learning games, online courses, and public health policy videos. These initiatives ensure continuous CNSL learning and foster an understanding of public health guidelines. China could also follow Australia’s model during COVID-19 (Levin, 2021), which promoted Auslan courses and integrated sign language support into mental health services. This could be adapted to offer profes- sional counseling for HSIPs in China. Local govern- ments, in collaboration with the Disabled Persons’ Federation, could host regular workshops on digital tools and social media to enhance HSIPs’ knowledge and social engagement. Encouraging HSIPs to manage social media accounts using CNSL would amplify their influence, enabling them to counter misinformation and disseminate accurate emergency information during crises. The Ease of Use of SSL remains a formidable obsta- cle to HSIPs’ utilization. Learning CNSL demands sub- stantial time, financial resources, and individual effort, presenting a significant challenge (Miller, 2008). Compounded by the physical and psychological disabil- ities (Hassinen & Lappalainen, 2018) that many HSIPs contend with, these factors exacerbate the difficulty of adopting CNSL, leading to a preference for informal Homesign. Such preferences hinder HSIPs from lever- aging the communicative advantages of CNSL, espe- cially in formal contexts during the COVID-19 pandemic. Furthermore, the diminished perception of CNSL’s utility in emergency communication, alongside a dependency on governmental interventions, prompts HSIPs to seek external solutions to their challenges rather than address their reliance on non-SSL. This dependency reflects a broader issue of autonomy in problem-solving, influencing their receptiveness toward CNSL.",
    "To address challenges related to ease of use, educa- tional support, resource scarcity, and cultural recogni- tion, and to fully leverage the communicative potential of CNSL in daily and emergency situations, strict imple- mentation of the Chinese National Sign Language Standards and related accessibility laws is essential. This would solidify the legal status of CNSL for HSIPs. Unlike the United States, where no sign language is fed- erally recognized—though some states acknowledge ASL as a foreign or instructional language (WorldAtlas, 2018)—China has officially recognized CNSL as its national sign language. This provides a significant advan- tage, enabling efficient nationwide dissemination of pub- lic health policies, vaccination details, and emergency measures issued by the central government. To further promote CNSL, local disability federations, NGOs, and educational institutions should offer customized learning support, such as video tutorials, AI-powered tools, and peer learning groups, tailored to the unique needs of HSIPs to ensure successful CNSL acquisition. China could also take inspiration from the Japanese ASL Signers Society (JASS), which provides not only sign lan- guage courses and workshops but also scholarships for HSIPs pursuing higher education, supporting both aca- demic and professional growth. Local governments, in collaboration with disability federations, should foster greater acceptance of CNSL within hearing communities. A professional network of sign language interpreters and volunteers should be established to mobilize quickly in public health emergencies. With the rise of digital com- munication, enhancing interpreters’ remote interpreting skills is critical. Governments and disability federations must also address the unique challenges interpreters face, such as the lack of real-time feedback, the increased demands for self-monitoring and teamwork, as well as the physical strains of repetitive stress injuries, eye fati- Influence through the effects of family, friends, col- leagues, and media on HSIPs’ acceptance of CNSL. The results indicate that SI significantly impacts HSIP’s will- ingness to accept CNSL, with family, mainly parents, playing a crucial role in influencing SSL acquisition among HSIP children. A family environment incorporat- ing sign language provides children with early opportuni- ties to learn SSL (McKee & Smiler, 2016). However, hearing parents often hold differing views. Some finan- cially secure parents without biases encourage early sys- tematic learning, while others, due to financial constraints, a lack of emphasis on SSL, or over-reliance on cochlear implants and hearing aids, might delay their children’s exposure to SSL. This not only deprives HSIP children of their linguistic rights but also impedes their neural development. Furthermore, limited access to information can cause psychological issues in HSIP chil- dren. Friends also play a key role, as HSIPs rely on them for communication in both every day and emergency situations. Parent training programs can be an effective solution, such as ASL workshops provided by the American Society for Deaf Children or ASL teaching support through early intervention systems offered by the National Association of the Deaf. Platforms like AccessForce and Sound for Light further aid parents in developing skills to better support their children’s lan- guage development. Proficient parents can quickly relay vital information during public health emergencies, reducing delays and misunderstandings, which enhances the security, reduces stress, and improves HSIP chil- dren’s ability to respond in emergencies, promoting over- all well-being and safety. Having friends who use SSL can effectively reduce the psychological stress experienced by HSIPs and stimulate their enthusiasm for learning (Napoli et al., 2015). However, there are also limitations to this reliance. Some researchers advocate for the development of community- based communication framework based on SSL (Cripps et al., 2016), aiming to reduce HSIPs’ overdependence on friends and family. In emergencies, relying solely on friend’s interpretation may not always be feasible, and it may fail to fully meet HSIPs’ sign language communica- tion needs (Tannenbaum-Baruchi et al., 2014). Encouraging local communities to establish social sup- port networks based on SSL can provide HSIPs with more opportunities for peer communication using CNSL. Additionally, developing platforms akin to Interpretek and Convo, which provide SSL interpreta- tion services in the U.S., would ensure that HSIPs can access timely emergency information via phone, video, or dedicated apps, regardless of their location. Such infrastructure is essential to prevent HSIPs from being excluded from critical communication channels, espe- cially in emergency situations. The employment landscape for HSIPs in China is notably complex. According to the China Disability Statistics Yearbook 2022, while the total employment in China stands at 8,816,435, the certified disabled popula- tion amounts to 38,049,193, indicating that only 23.18% of individuals with disabilities are employed. It reveals the enormous challenges disabled individuals face in accessing the job market. HSIPs in professional environ- ment may confront stresses from colleagues, supervisors, or subordinates, often due to misconceptions skills, com- munication obstacles, and entrenched biases regarding their work capabilities. Drawing from the successful model of New Zealand Sign Language Week (NZSL Week), which promotes public awareness through spe- cialized sign language courses, could serve as an effective strategy for increasing CNSL awareness. NZSL Week not only enhances communication between the Deaf and hearing communities but also utilizes advertising, social media, and cultural exhibitions to challenge societal stereotypes. Promoting CNSL among hearing individu- als could reduce biases against HSIPs, fostering a more inclusive work environment. Furthermore, such initia- tives would be invaluable during emergencies, ensuring that HSIPs’ needs are recognized and their access to crit- The rapid development of media has led HSIPs to increasingly rely on it. Positive media promotion of CNSL can support HSIPs in accepting and practicing SSL, as well as strengthening cultural identity (Maulida et al., 2019). However, social media platforms can also foster aggressive behaviors (Saunders, 2016). Coupled with the challenge of discerning credible information and the prevalence of online scams in China, some media might misguide HSIPs, causing emotional distress, finan- cial losses, and ultimately failing to achieve the purpose of promoting CNSL. A more effective approach would be to utilize widely recognized anti-fraud platforms and applications to develop sign language versions, helping HSIPs identify scams and misinformation, especially during emergencies. Social media could also host CNSL- based anti-fraud awareness campaigns aimed at HSIPs. Additionally, training trustworthy HSIP representatives or sign language health ambassadors to disseminate accurate health information via social media and public events would ensure timely, reliable updates, enhancing HSIPs’ ability to respond to public health crises tively affect HSIP’s acceptance of CNSL, indicating that external support and resources play a key role in foster- ing adoption. Consistent with Hoffmeister (2020), our research indicates that HSIPs are more inclined to adopt CNSL in familiar settings such as schools and commu- nities. In China, online communities offer HSIPs more opportunities to practice CNSL through video sharing, online discussions, and simulated communication, help- ing them enhance their skills and find a sense of belong- ing. The expansive reach of online communities also incentivizes HSIPs to learn CNSL for broader online engagement. The COVID-19 pandemic exposed chal- lenges in hospital settings where the widespread use of masks reduced the effectiveness of SSL reliant on lip- reading and facial expressions. Even with transparent masks, there is a scarcity of medical personnel proficient in CNSL, limiting the availability of SSL interpretation services for HSIPs in China, reflecting a lack of inclusiv- ity and equity. Furthermore, during the pandemic, many HSIPs encountered psychological issues, but certified CNSL-fluent psychologists remain rare (James et al., 2022), often leaving HSIPs dependent on community workers or self-help for psychological support. The U.S. and the UK are leaders in sign language services within healthcare. In the U.S., the National Institutes of Health (NIH) provides sign language interpretation under the ADA and Section 504 of the Rehabilitation Act. Similarly, the UK’s NHS offers sign language services for medical appointments and emergencies, funded by the government to ensure effective communication. China could develop a professional sign language inter- pretation team using standardized management to improve access to sign language services in healthcare, including online services during public health emergen- cies. Addressing the technological challenges associated with SSL assistive tools is essential. While products like the US’s Sign-to-911 (Guo et al., 2023), the JSL CG sys- tem from Japan (Uchida et al., 2016), and Indian’s video dataset technologies (Adithya & Rajesh, 2020) have demonstrated their usefulness, they still face significant constraints. For instance, commercial AR glasses sup- porting Sign-to-911 are priced at around $350, JSL CG’s performance is limited by hardware and browser capabil- ities, and India’s system relies heavily on stable network Our survey results indicate that 81% of respondents earn less than the average disposable income in Louhe City (28,000yuan), emphasizing that, despite the avail- ability of CNSL tools, the associated costs (e.g., internet, telecommunication, and transportation) remain a signifi- cant burden. Moreover, elderly respondents face cogni- tive and learning limitations, further complicating the use of assistive products with CNSL. Therefore, the develop- ment of SSL assistive tools, especially in developing countries like China, should prioritize both usability and affordability. Collaboration between tech companies, academic institutions, and sign language experts is crucial to simplify device interfaces, making them more user- friendly. Governments should provide financial support, tax incentives, and policies to encourage the production and distribution of these tools. Moreover, charitable foundations and corporate social responsibility initiatives can offer additional support to develop these products and provide financial assistance to underprivileged HSIPs.",
    "The availability of human resources is a critical factor in facilitating the adoption of CNSL. In China, this encompasses professional CNSL interpreters, teachers, and counselors, and trained volunteers or community workers. As highlighted by of James et al. (2022) and Brueggemann (2020), there is an urgent shortage of qual- ified SSL interpreters and teachers, compounded by a lack of societal recognition of the importance of sign lan- guage translation and education. This has led to inade- quate investment in the field, where careers career in CNSL interpreters and teachers offer limited social acknowledgment and financial incentives. Additionally, the regional diversity of sign languages complicates the training of skilled professionals. The COVID-19 pan- demic further exposed these challenges. Public resources were stretched, leading to the reassignment of CNSL- trained volunteers and community workers to pandemic prevention efforts, reducing their availability for support- ing HSIPs.This underscored how vulnerable groups, like HSIPs, can be marginalized during public emergencies when resources are scarce. To address these challenges, China must focus on developing robust policies that not only cultivate skilled professionals but also enhance inclusivity for vulnerable groups. It is essential to ensure that sign language interpretation services remain consis- tently available, particularly during public health emer- gencies, to safeguard the communication needs of HSIPs. The results of this study demonstrate a significant posi- tive relationship between Self-efficacy (SE) and beha- vioral intention to use (BIU): HSIPs with a stronger sense of SE are more inclined to accept CNSL. This demonstrates the importance of not only emphasizing the practical benefits of CNSL but also fostering and enhancing learners’ Self-efficacy when enhancing HSIPs’ acceptance of CNSL. Self-efficacy reflects the psychological state of HSIPs when confronted with the challenge of learning CNSL, highlighting the perceived difficulties associated with mastering a new language. A strong belief in their ability to acquire CNSL motivates active engagement in the learning process. However, preliminary discussions with staff from the Disabled Persons’ Federation revealed that local HSIPs, especially the elderly, approach CNSL with caution, fearing that this new undertaking might threaten their established routines. Feelings of self-doubt and inadequacy are common, with some HSIPs believing that mastering such a complex language is beyond their cap- abilities, resulting in low Self-efficacy. This aligns with Hassinen and Lappalainen’s (2018) findings, which high- lighted the negative impact of these emotional barriers on HSIPs’ confidence. Conversely, some HSIPs exhibit initial openness toward CNSL but often hesitate when faced with its systematic nature and learning demands. They view it as time-consuming and costly, with concerns about becoming isolated from their existing Homesign social circles, straying from familiar cultural norms. Additionally, the long-term benefits of CNSL—such as improved emergency communication and expanded social interactions—are not always immediately appar- ent, further reducing their motivation to pursue it. Apart from HSIPs with low Self-efficacy, a subgroup demonstrating higher Self-efficacy emerged in our study. These individuals firmly believe in the effectiveness and universality of CNSL, considering it accessible to anyone (Cripps et al., 2016). However, the reasons behind this confidence vary. Some possess inherently high self- esteem, while others place trust the involvement of Disabled Persons’ Federation, convinced of CNSL’s ben- efits. Notably, none of the participants viewed themselves as minority group using sign language, which contrasts with Engelman et al. (2013) findings. Furthermore, con- trasting with Hall’s (2017) findings, where parents had high expectations for HSIPs to master both spoken lan- guage (with hearing aids or cochlear implants) and SSL, our study found that parents and relatives of HSIPs held more pragmatic expectations. Their focus was on inde- pendent living and achieving financial independence, without imposing excessive pressure on Self-efficacy. To address the challenges faced by Chinese HSIPs, education and targeted interventions are critical strate- gies. Strengthening foundational CNSL education is essential to provide HSIPs with a clear understanding of the language and help them objectively assess their profi- ciency. A tailored learning system should be developed, particularly for elderly individuals, illiterate populations, and children, offering simplified introductory courses. Rather than imposing strict proficiency or grading stan- dards, these courses should prioritize effective communi- cation in emergency situations. The curriculum can include focused training in emergency communication and everyday expressions. Moreover, integrating psy- chology into CNSL training can boost learners’ confidence in both language acquisition and emergency preparedness. Given that many HSIPs adopt a passive role during crises, making it difficult for them to proac- tively seek critical information, regular sign language emergency drills should be conducted to enhance their confidence and preparedness for real emergencies.",
    "Our research in Sections 4.1, 4.2, and 4.4 examines the economic impact on HSIPs’ acceptance of CNSL. This encompasses the financial burden of learning CNSL, the supportive role of wealthier families, and the use of eco- nomic resources to boost HSIPs’ Self-efficacy. Additionally, our exploratory analysis identified rela- tionships between participants’ annual income and their intention to use CNSL. Beyond theoretical factors, we conducted a one-way analysis on variance such as age, marital status, educa- tional level, occupation, annual income, type of disabil- ity, and disability levels. Results showed that the p-values for gender, education level, annual income, and disability grade were all below 0.05. Post hoc multiple tests showed significant difference in BIU to CNSL between at least two annual income groups. Specifically, the Bonferroni post-hoc test indicated significant differences between income Group 1 and Group 5, Group 2 and Group 5, and Group 3 and Group 5, indicating that participants in lower-income groups exhibited a higher BIU compared to those in the highest income group (Group 5). This suggest that financial status is not always posi- tively correlated with the use of CNSL. HSIPs with higher annual incomes might adopt a more conservative approach toward CNSL for reasons beyond economics, such as cultural, educational, or social influences. While annual income reflects the economic capability of HSIPs, which directly impacts access to high-quality SSL educa- tion, learning materials, and participation in training, wealthier individuals may perceive communication chal- lenges differently. They may not feel the same urgency to address communication issues through CNSL, as they often have alternative methods such as cochlear implants, hearing aids, and other assistive technologies, supported by greater financial resources for spoken language educa- tion. Additionally, their access to information and resources may reduce their dependence on CNSL. In contrast, lower-income HSIPs, representing around 95.3% of respondents (81% in Group 1 and 2, and 14.3% in Group 3), may have a stronger motivation to use CNSL due to their limited access to continuous learn- ing opportunities. They might cherish every opportunity to access CNSL. economic factors on the acceptance of HSIPs. As a developing country, China’s relatively low GDP per capita limits many measures to protect the rights and interests of HSIPs, while also hindering opportunities for their development. HSIPs with better economic condi- tions have more communication resources and channels for rights protection, and their attitudes toward CNSL are different as a result. The cognitive differences brought about by economic conditions require us to adopt differentiated promotion policies to compensate. For higher-income HSIPs, their reluctance to adopt CNSL often stems from a lack of understanding or mis- conceptions about its benefits. To address this, a diversi- fied promotional strategy should be employed, utilizing various communication platforms such as television, the internet, social media, and public lectures to effectively convey CNSL’s value and importance to this group. During public health emergencies, CNSL is essential for rapid access to information and informed decision- making regarding personal safety. Furthermore, high- income HSIPs can leverage their influence to serve as opinion leaders, helping other HSIPs understand and act on critical information during crises. This dual role not only promotes greater societal equity and inclusivity but also provides high-income HSIPs with a sense of accom- plishment and social contribution. For lower-income HSIPs, policy interventions should focus on improving the accessibility and affordability of CNSL education and resources. This could include funding sign language courses, providing free learning materials, and investing in technology that facilitates CNSL learning. Additionally, targeted financial support programs—such as scholarships, grants, and subsidies for assistive technologies—can help reduce economic barriers and The global debate surrounding whether individuals with Hearing and speech-impaired persons (HSIPs) should learn standard sign language has persisted. However, the outbreak of COVID-19 has underscored a critical mes- sage worldwide: in an increasingly risky world, effective communication among HSIPs cannot be underestimated. SSL may offer a solution. China’s experience serves as a compelling example: while CNSL has received legal rec- ognition, its acceptance within the HSIP community remains limited due to its recent emergence. During the pandemic, HSIPs faced communication challenges as lip reading became ineffective, and the lack of CNSL profi- ciency hindered their access to crucial emergency infor- mation. This not only caused psychological distress but also potentially compromised healthcare responses. In a country like China, which frequently encounters emergencies and has gradually improved its emergency management system, promoting CNSL becomes an essential measure for effective communication during crises.",
    "As a developing nation, China shares common chal- lenges with other countries, such as limited employment opportunities and inadequate educational resources for HSIPs. However, China’s vast population also presents an opportunity for CNSL promotion, benefiting a larger number of individuals. Through linear regression analy- sis of the data from the questionnaires distributed online, this study demonstrated that the Perceived Usefulness (PU), Ease of Use (EOU), Social Influence (SI), Facilitating Conditions (FC), and Self-efficacy (SE) all significantly positively impact the Behavioral Intention to Use (BIU) CNSL. Interestingly, variance analysis and post-hoc tests revealed that HSIPs with higher annual incomes are less willing to use CNSL compared to those in the three lower-income groups. These insights not only reflect the actual situation of the acceptance of CNSL among HSIPs in China but also provide the global com- munity with a valuable reference for understanding the unique circumstances of Chinese HSIPs. enhance the usefulness and Ease of Use of CNSL, estab- lish more Facilitating Conditions, and leverage Social Influence by promoting CNSL through social networks and media. Policies should also be tailored to address the diverse needs of HSIPs across different income levels. CNSL must become a routine part of daily life to increase its prevalence, allowing it to serve as a crucial communica- tion tool during emergencies, ultimately saving lives and protecting property. Despite the significant findings this study brings forth, there are some limitations. Firstly, the sample size was restricted, mainly due to the limited response capability of the participants. Although the elec- tronic questionnaire was extensively distributed across multiple WeChat groups, many HSIPs faced challenges in independently completing the questionnaire due to factors such as illiteracy, unfamiliarity with electronic question- naires, and limited comprehension abilities. They need to rely on assistance from friends, family, staff from the Disabled Persons’ Federation, and community workers. Out of the 1,288 HSIPs locally, only 191 managed to fin- ish the survey. Secondly, the representativeness of the sample may be questioned. While studying HSIPs’ beha- vior toward accepting CNSL is a valuable direction, the practical constraints of this study limited the sample to HSIPs from a single region. The economic, educational, and cultural backdrop of this city might significantly differ from larger cities, suggesting that the research findings might not fully represent the varied contexts across China. Future research on the utilization of CNSL among face-to-face surveys and interviews, to gain deeper insights into the specific challenges they face. Moreover, conducting cross-city and cross-country comparative studies in China and other countries might yield intri- guing results. Researching the influence of factors such as economic conditions, culture, and educational levels on their behavior could provide new insights. This multi- dimensional understanding of HSIPs can contribute to the development of CNSL or other SSLs in the future, as it helps explain the diversity in their behavior. The author(s) disclosed receipt of the following financial sup- port for the research, authorship, and/or publication of this article: This research is supported by the 13th Five-Year Plan research plan of the State Language Commission in China. The project name is Emergency Language Services for Special Populations, and the project number is ZDI135-119."
]