[
    "Martin de Tour School of Management and Economics, Assumption University of Thailand, Bang Sao Thong, Samut Prakan, Thailand. *Corresponding Author’s Email: chenjing.95@outlook.com, chenjing5095@126.com This study examines the factors influencing knowledge-sharing behaviour among higher education faculty in Henan Province, China, within the context of increasing digitalisation in education. It explores the roles of personal attributes (attitude and motivation), perceived technological factors (usefulness and ease of use), and mediating variables (user engagement and perceived technology) in shaping knowledge-sharing practices. The focuses on the behavioural aspects of faculty knowledge sharing in digitalised environments. A quantitative cross-sectional survey design was employed. Data were collected from 410 faculty members across different academic levels using a structured questionnaire. Stratified random sampling ensured representative coverage of senior, middle, and junior-level teachers. The data were analysed using IBM SPSS 25, including descriptive statistics, correlation, regression, and mediation analysis using Hayes’ PROCESS macro. The results show that attitude, motivation, perceived usefulness, and ease of use significantly predict knowledge-sharing behaviour. Perceived technology mediated the relationship between personal factors and knowledge sharing, while user engagement did not significantly mediate. Ease of use emerged as the strongest predictor of sharing behaviour. This research integrates personal and technological perspectives better to understand digital knowledge sharing in Chinese higher education. The findings offer practical guidance for institutions aiming to enhance faculty collaboration through effective digital strategies. learning, digital technology has been a key driver in transforming how knowledge is developed, exchanged, and utilised. Universities across the globe are fundamentally changing, incorporating digital platforms and instruments into teaching, learning, and research to develop collaboration, enhance information access, and boost institutional performance (1). Universities in China, including Henan province, are progressively adopting digitalisation to develop their academic practices towards modernity and encourage innovation in academia (2). As government support for modernising education continues to grow and there is an increase in digital infrastructure development in second- and third- tier cities, Henan's universities have a special opportunity to exploit the potential of digital technology in building academic networks and knowledge-sharing behaviour (3). Nonetheless, with enormous capital infusion in digital resources running the gamut from Learning Management Systems (LMS) and online libraries to AI-based resources empower real knowledge sharing among teachers is poorly understood (4). To support China's educational reforms, digital knowledge-sharing culture among higher education instructors is imperative for upholding professional development, research output, and co-innovation (5). Past research has probed knowledge sharing within educational institutions and emerged with personal and technological determinants that can affect this behaviour. Personal determinants, such as motivation, attitude, and confidence in individuals, are reported to be major determinants in many instances (6). For instance, scholar observed that teachers who find knowledge sharing useful to their professional goals and identity will likely engage actively in these behaviours (7). Emphasising the significance of a positive attitude in facilitating voluntary sharing in educational contexts (8). In China, studies indicated that educators with high intrinsic motivation were more inclined to share teaching resources and This is an Open Access article distributed under the terms of the Creative Commons Attribution CC BY license (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium, provided the original work is properly cited. 10). Besides personal factors, the perception of technology is also an important factor. The Technology Acceptance Model identifies perceived ease of use and usefulness as key determinants of technology use behaviour (11). Research established that when teachers perceive digital tools as useful and convenient, they are more likely to utilise them in scholarly exchange and collaboration (12, 13). User engagement is a second variable of fundamental importance (14). Despite all the known predictors of knowledge sharing on an individual and technology level, there are evident gaps, especially in how these variables are integrated in the Chinese context. To begin with, a lot of research has handled individual and technological variables as standalone variables without exploring how these interact (15). While current models emphasise the role of motivation and attitude in predicting sharing behaviour, few examine how these characteristics affect technology perception or user involvement (16). This failure to conduct interactional analysis limits the establishment of a more vibrant and holistic view of knowledge sharing behaviour in digital environments (17). Second, user involvement is often treated as a behavioural outcome instead of a mediating construct. Research usually takes the assumption that faculty members will automatically participate in sharing activities when they embrace technology (18 - 20). Engagement stands between intention and action, especially in academic institutions where digital tools involve effort and adjustment (21). Third, the literature mainly concerns elite or urban institutions in metropolises such as Beijing or Shanghai, but less so for second-tier provinces such as Henan. With Henan's fast digitalisation and heterogeneous academic ecosystem, it is imperative to identify how regional, institutional, and individual variations affect knowledge sharing in such environments (14, 22, 23). In this research, whether sophisticated or not shape knowledge- sharing behavior among higher education institutions. Therefore, this study aims to achieve the following research objectives: The research has great theoretical and practical significance for developing Chinese digital education. It provides a more comprehensive framework for understanding how personal, technological, and engagement-related issues interact and result in knowledge sharing among teachers in higher education. In the context of Henan, where universities are digitising quickly, the results can inform university leaders, policy officials, and IT developers in creating strategies that target improving faculty collaboration and digital literacy. The research also adds to the international debate about adopting educational technology by offering insight from a lesser- researched but significant region within China. While various technologies such as LMSs, online repositories, and AI-based tools form part of the academic digital environment, the present study does not concentrate on evaluating any single platform or institutional integration method. Instead, it focuses on the behavioural dimensions of knowledge sharing among faculty members, particularly how personal factors (attitude and motivation) and perceived technology (usefulness and ease of use) interact to shape knowledge- sharing behaviour in higher education.",
    "Attitude is a person's internal state of mind or appraisal towards undertaking a specific behaviour, e.g., sharing knowledge (22). For higher education, particularly with the growing incorporation of digital technologies, teachers' attitudes towards digital platforms directly impact whether or not they will share knowledge (24). A positive attitude is when an individual finds knowledge sharing as good, something worthwhile, or of value (16). With education in the digital age, teachers are presented with numerous tools like learning management systems, forums, and virtual repositories that make knowledge sharing easier and more effective (14). If they have a good attitude towards the convenience and usability of these tools, they act proactively in their knowledge-sharing behaviour (8). Empirical research provides uniform support for the role of attitude in promoting knowledge sharing. Studies showed that positive attitudes towards knowledge sharing tended to share more, even when they were not directly offered an incentive (3, 25 - 27). Among students of higher learning, a positive attitude towards information and communication technology enhanced engagement in online academic cooperation is found (25). Study also observed how optimistic attitudes towards e- learning tools enhanced faculty involvement in knowledge sharing in virtual learning environments (5). Such observations support the idea that teachers are more inclined to share their skills when they perceive digital knowledge sharing is accessible and beneficial. H1: There is a positive relationship between attitude and knowledge-sharing behaviour among higher education teachers in the context of educational digitalisation. pushes people to engage in specific behaviours, such as knowledge sharing (6). In educational contexts, intrinsic drivers like personal satisfaction or satisfaction of assisting others, and extrinsic drivers like praise, advancement, or institutional rewards, impact teachers' motivation to teach (10). In the context of digitalisation in education, having cooperative digital tools available can fuel or dampen motivation depending on the design and incorporation of these tools into educational activities (26). Such teachers tend to share their knowledge and be actively involved in ongoing scholarly interactions more readily when motivated, particularly when digital resources are rewarding or meaningful to them (27). Empirical research confirms the close association between motivation and knowledge sharing. (10, 22, 28, 29) cited motivation as an important factor in academic and organisational knowledge-sharing behaviours. Concerning online platforms, study discovered that educators with greater motivation levels were more engaged in utilising e-learning systems to add educational content and interact with colleagues (30). Digital technology can enhance motivation through instant feedback, acknowledgement, and professional networking opportunities (31). From the social exchange theory perspective, motivated people will tend to share to the extent they anticipate social or professional returns. H2: There is a positive relationship between H2: There is a positive relationship between Motivation and knowledge-sharing behaviour among higher education teachers in the context of educational digitalisation. Perceived usefulness is the extent to which a person feels that applying a specific system or technology will improve their performance at work (3). In the context of higher education digitalisation, perceived usefulness represents the extent to which teachers in higher education perceive digital tools and platforms as useful for supporting the sharing of knowledge and enhancing teaching or teamwork activities (32). learning management systems, academic forums, or content-sharing platforms can assist their teaching objectives effectively and optimise the exchange of academic information (33). In that case, they will likely adopt and utilise these tools in their day-to-day practices (34). This is a strong determinant of technology acceptance and works as a motivational force promoting interaction with digital systems of academic communication (6). Much empirical research has supported the role of perceived usefulness in shaping knowledge sharing behaviour. A study in the Technology Acceptance Model (TAM) set the stage for perceived usefulness as a central driver of technology user acceptance and utilisation (11). Within education, research discovered that the more beneficial teachers see digital tools as being, the more likely they are to share information using them (1, 27, 28). Likewise, teachers who see value in digital collaboration tools will use them more for online discussions and content additions. These findings suggest that the functional value of digital technologies plays a significant role in shaping teachers’ intentions to share knowledge. Ease of use is the extent to which a person feels it will be effortless to use a given system. In the context of educational institutions that are transforming to be digital, ease of use addresses how easy and accessible higher education instructors feel digital platforms are to use when participating in knowledge sharing processes (35). When digital tools are easy to use, convenient, and don't need much technical knowledge, teachers will be more inclined to utilise them for disseminating teaching material, discussions, or intercollege collaboration (12). An easy-to-use system diminishes the psychological barrier, raises the stakes on recurring usage, and thus encourages knowledge-sharing behaviour among faculty members (14). Empirical literature supports the significance of ease of use in encouraging knowledge sharing. Study brought attention to ease of use, a basic element of technology adoption has shown that perceived ease of use directly impacts the behavioural intention towards using digital tools for learning purposes (36 - 38). When teachers find digital platforms easy to use, they become more inclined to participate in online knowledge-sharing activities. These studies confirm that the simplicity of technology is central to facilitating increased participation in online collaboration.",
    "H4: There is a positive relationship between ease of use and knowledge-sharing behaviour among higher education teachers in the context of educational digitalisation. Knowledge Sharing Behaviour User engagement is the extent to which a person indicates cognitive, emotional, and behavioural engagement while using an online platform (12). In higher education digitalisation, user engagement describes the extent to which higher education teachers are actively and regularly involved in digital platforms for studying purposes, such as knowledge sharing (35). Personal attributes, such as attitude, motivation, and efficacy, considerably affect how much a teacher engages with educational technology (39). Teachers become more likely to engage in digital systems when intrinsically motivated, having a positive disposition toward technology, or possessing self- efficacy in utilising online tools (18). This behavioural participation acts as a mediator, transforming individual characteristics into identifiable sharing behaviours (19). Empirical research confirms the mediating role of user participation between personal traits and technology outcomes. For instance, research articles point out how the motivation and attitude of individuals control levels of user participation in web-based learning environments (6, 16, 22). Similarly, it is found that user engagement also adequately mediates the relationship between personal dispositions and knowledge-sharing behaviour in virtual workspaces (35). This finding means that while personal factors initiate intention, user engagement level is the cause of how far individuals actively seek to achieve that intention in digital spaces. H5: User Engagement mediates the relationship Perceived technology entails perceived usefulness and ease of use, which are users' understanding of a digital platform's effectiveness and simplicity (4). These perceptions are crucial in shaping how educators interact with and adopt digital tools for instructional purposes. However, the influence of perceived technology on knowledge sharing might not always be linear (2). User participation will likely mediate, spanning positive technological attitudes and active and long-term knowledge- sharing practice (19). Once teachers feel electronic systems are useful and convenient, they tend to interact heavily with such systems, boosting their contribution to online forums, resource-sharing, and collaborative interactions (40). Studies identified that participation is central to connecting perceptions of technology to the outcomes of users in educational technology settings (1, 41 - 43). Moreover, studies indicate that user perception of technological features reinforces user interaction, which, in turn, stimulates knowledge-sharing activity in online scholarly communities (2, 44, 45). These studies suggest that only positive perceptions are insufficient unless they translate into greater engagement. H6: User Engagement mediates the relationship H6: User Engagement mediates the relationship between perceived technology and the knowledge sharing behaviour among higher education teachers from the context of educational digitalisation Perceived technology, including perceived usefulness and ease of use, represents users' perceptions regarding the efficacy and ease of use of digital tools in educational contexts (15). Individual factors like attitude, motivation, and self-efficacy significantly influence how people perceive and assess technology (1). Teachers with high internal motivation or positive attitudes are more likely to perceive digital technologies as beneficial to their pedagogical practices (16). Such a positive attitude, in turn, can influence their intentions to participate in knowledge-sharing activities (22). The mediating effect of perceived technology implies that individual traits influence knowledge sharing indirectly through the lens of how digital technologies are perceived and adopted in regular academic practice (33). Empirical evidence has overwhelming evidence for this mediation process. For instance, personal factors heavily affect technology perceptions, ultimately affecting behavioural intentions and use (46, 47). At academic institutions, study found that learning technologies' utility and usability perceptions mediate between internal psychological variables and collaborative behaviours like knowledge sharing (13). H7: Perceived technology mediates the relationship between personal factors and knowledge-sharing behaviour among higher education teachers in the context of educational digitalisation. User involvement is the intensity of contribution and participation one shows in using digital systems for professional or academic purposes (39). Personal attributes such as personal confidence, intrinsic motivation, and positive dispositions significantly affect how individuals use new technologies (6). Their technology perception mostly affects their usage intensity in employing such a tool. When one's instructor believes that a computer platform is beneficial and easy to operate, such a perception boosts one's motivation to utilise it (48). Perceived technology, thus, serves as a mediator through which individual traits influence user engagement (45). Empirical support is revealed to validate this mediating link between individual traits, perceived technology, and utilisation. Studies found that teachers' readiness and attitudes determine their perception of technology, further strongly impacting how actively they use it (16, 27, 28). Another study also demonstrated that users with a positive perception of technology will likely provide higher cognitive and behavioural engagement levels (42). These findings show that an internal disposition can be positive, but it is not enough to lead to engagement unless accompanied This study uses a combination of existing theoretical models to explain the relationships between individual variables, perceived technology, user engagement, and knowledge- sharing behaviour about educational digitalisation. The Uses and Gratifications Theory (UGT) provides a point of departure with the argument that individuals actively use media and technology based on specific demands and expected gratifications, such as career development or status. In this research, instructors in higher education meet cognitive and social needs through digital technology, which consequently initiates knowledge sharing. The TAM supports this mechanism by emphasising the significance of perceived ease of use and perceived usefulness as primary determinants of technology adoption and usage (11). Not only do these beliefs influence behavioural intention, but they also mediate the influence of individual factors on knowledge sharing. In addition to TAM, the Theory of Planned Behaviour (TPB) posits that attitudes, subjective norms, and perceived behavioural control determine individuals' intentions and behaviour (49), thereby conceptualising the influence of attitudes and motivation on teachers' willingness to transfer knowledge online. Schein's Model of Organisational Culture outlines how values and assumptions held within learning institutions can impact motivation and collaboration, and that a desirable academic culture enhances the digital knowledge sharing environment. In addition, the Diffusion of Innovation (DOI) Theory helps explain how digital technology is adopted and disseminated in higher-learning institutions, based on personal innovativeness and perceived innovation attributes of technology. Lastly, Self- (Socialisation, Externalisation, Combination, and Internalisation) is notable in pointing to the dynamic process of interaction between tacit and explicit knowledge that provides a basis for examining how faculty members convert individual knowledge into common digital resources. Likewise, Social Capital Theory highlights the importance of trust, networks, and reciprocal relationships in facilitating knowledge exchange, which, in cases of academic settings where much depends on collegial networks, is most applicable. In addition, the Unified Theory of Acceptance and Use of Technology (UTAUT) presents an extension of TAM with the addition of constructs like performance expectancy, effort expectancy, social influence, and facilitating conditions, all of which are relevant to the explanation of faculty members' use of digital tools for knowledge sharing. Through the integration of our model with SECI, Social Capital Theory, and UTAUT, this research places personal and technological determinants within the purview of a larger knowledge-sharing and technology adoption literature, thus solidifying its conceptual basis. Combining the theories, this study proposes a model that links individual factors and perceived technology to knowledge sharing through the mediating influence of user engagement. This theoretical foundation informs the conceptual framework illustrated in Figure 1: Conceptual Framework, which visually represents the The research used a quantitative cross-sectional survey design to investigate factors affecting knowledge sharing behaviour among Henan Province higher education faculty members in China. The design was used because it can capture information from many points to help determine patterns and relationships between variables. It allowed for systematic data collection using standardised questionnaires and facilitated statistical analysis with SPSS. The methodology was appropriate for obtaining objective, quantifiable, and generalizable results.",
    "The study population included higher education teachers from Henan Province, China, who use digital tools and participate in knowledge-sharing activities. This population spans regular universities, higher vocational colleges, and other post-secondary institutions. Participants were grouped into three levels: senior and sub-senior faculty with extensive experience and long- standing involvement in digital education, middle- level teachers who combine traditional and digital methods, and junior or unranked instructors who are relatively new to the profession but show strong interest in digital innovation. The data were gathered using a standardised self- completion questionnaire containing items drawn from validated instruments and reworded for context-specific applicability to the environment of Chinese higher education. The questionnaire was prepared in hard copy and electronic versions and sent out through university email lists, academic networks, and institutional channels (e.g., faculty WeChat groups and LMS portals). All items were assessed on a five-point Likert scale from \"strongly disagree\" to \"strongly agree.\" The respondents were notified of the survey's purpose, anonymity, and voluntary participation. Data collection was conducted over four weeks within the Spring 2025 semester. Using Anderson’s (1996) sample size table, the minimum required sample size for a population of 124,547 was determined to be 381 respondents for a 95% confidence level and 5% margin of error. To improve reliability and account for incomplete responses, more questionnaires were distributed. A total of 410 valid responses were collected, exceeding the minimum threshold and enhancing the representativeness and statistical strength of the results. A stratified random sampling technique was used to ensure proportional representation from each academic level, reflecting the population structure and increasing the representativeness of the findings. Data collected were coded and entered into IBM SPSS Statistics Version 25 for analysis. Initial data screening was done to test for missing values, outlier values, and normality through skewness and kurtosis statistics. Descriptive statistics (mean, standard deviation, minimum, and maximum) were also computed to present the defining features of the constructs. Reliability analysis was also done using Cronbach's Alpha to determine the internal consistency of measurement items. Correlation analysis was done to test the strength and direction of the the between the constructs. Multiple regression analysis was used to test the hypothesised relations, and for the mediation effects, the PROCESS macro for SPSS (Model 4) was applied. This method would allow the evaluation of direct and indirect effects that further strengthen the mediating aspects of user engagement and perceived technology. Significance levels were expressed in p-values and t-statistics, and their results were interpreted against theoretical predictions and past empirical work. Table 1 shows the demographic breakdown of study participants. In the respondents, 55.1% were male and 44.9% were female, reflecting a slightly higher involvement of male faculty members. As for the distribution by age, most participants were between 30 and 50 years old. Specifically, 37.1% were between 30 and 40 years old, 38.8% were between 41 and 50, 13.2% were between 18 and 29, and 11.0% were 51 or older. Regarding educational qualifications, 45.9% held a bachelor’s degree, 35.4% had a master’s degree and 18.8% possessed a doctoral degree. Looking at the monthly income, the largest number of participants reported earning ¥3001 to ¥6000 (61.2%), followed by 23.7% earning ¥6001 to ¥9000, 9.5% ¥9001 to ¥12000, 3.9% more than ¥12000, and only 1.7% reported income at or below ¥3000. The teaching positions were also fairly distributed, with the largest segment being middle-level teachers at 33.2%, sub-senior at 26.8%, senior at 23.4%, junior at 10.0%, and no- ranking at 6.6%. In terms of teaching experience, more than half (55.6%) of the respondents had 6 to 10 years of experience, 35.1% had over 11 years, and 9.3% had 1 to 5 years of experience. These demographics present a representative sample of faculty concerning age, experience, academic rank, and income, thereby providing a strong foundation for analysing knowledge sharing behaviour. Table 2 presents descriptive statistics for the key constructs to be measured in the study, namely attitude (AT), motivation (MO), perceived usefulness (PU), perceived ease of use (PE), and knowledge sharing behaviour (KS). All five constructs were measured across 410 respondents. The range of responses is indicated by the minimum and maximum values, with all the constructs being measured using a Likert scale of 1 to 5. Attitude recorded a mean of 3.72 on a standard deviation of 0.57, indicating respondents tended to have a moderately positive attitude toward knowledge sharing. The near-normal distribution is reflected by the skewness of -0.11 and kurtosis of -0.45. Motivation recorded a lower mean of 2.56 and a higher standard deviation of 1.01 with greater variability and slight positive skewness (0.36), with a moderate negative kurtosis of -0.78. Perceived usefulness had a mean of 3.02, and a standard deviation of 0.60, with positive skewness (0.84) suggesting some bunching towards higher values, and a kurtosis near normal (0.23). Perceived ease of use averaged 3.39 with a standard deviation of 0.71. Its negative skewness (-0.30) and kurtosis of 1.19 imply a slight left skew and a fairly peaked distribution. Knowledge sharing behaviour scored a mean of 3.23 on a standard deviation of 0.60. The -0.38 skewness and comparably high kurtosis of 2.71 mean that responses clustered around the central tendency but with some peakedness. These statistics generally reflect moderate levels of attitude, motivation, technology perception, and knowledge sharing among respondents since distributional properties are appropriate for further statistical analysis.",
    "Table 3 presents outer loadings for all items and Cronbach's alpha values for every construct to establish reliability and convergent validity. Five items were assessed for the attitude (AT) construct, with outer loadings from 0.658 to 0.901 and a Cronbach's alpha value of 0.702, showing acceptable internal consistency. Motivation (MO) was highly reliable, with five items loading from 0.602 to 0.911 and having an alpha of 0.933. Perceived usefulness (PU) consisted of satisfaction with five items with loadings ranging from 0.631 to 0.901 and an alpha of 0.785, showing sufficient consistency. Items for evaluation of perceived ease of use (PE) had loadings ranging from 0.603 to 0.848, and their alpha was 0.880, showing very good consistency. The user engagement (UE) construct consisted of five items with loadings ranging from 0.541 to 0.738 and an alpha of 0.866. Lastly, knowledge sharing behaviour (KS) was assessed with five items loading between 0.839 and 0.871 and an alpha of 0.862. All the constructs surpassed the minimum of 0.7 for Cronbach's alpha, attesting to reliable measurement scales. Some items had outer loadings just below the optimum threshold of 0.7, but the acceptable construct alphas warrant their retention. Table 4 displays Pearson correlation coefficients between attitude (AT), motivation (MO), perceived usefulness (PU), perceived ease of use (PE), and knowledge sharing behaviour (KS). Attitude significantly and positively correlates with knowledge sharing (r = 0.424, p < 0.01), indicating that higher attitudes are linked to higher knowledge sharing. Motivation is significantly positively correlated with perceived usefulness (r = 0.557, p < 0.01) but only weakly, as well as moderately with knowledge sharing (r = 0.191, p < 0.01), suggesting that more motivated individuals perceive digital tools as useful and share knowledge. Perceived usefulness is positively correlated with knowledge sharing (r = 0.237, p < 0.01), which supports its potential as a predictor of sharing behaviour. Perceived ease of use has a significant positive correlation with knowledge sharing (r = 0.688, p < 0.01), which indicates that teachers share more knowledge when it is easier to use digital tools. Ease of use is also significantly correlated with attitude (r = 0.307, p < 0.01) but not with motivation. All correlations reported are significant at 0.01, emphasising interconnectedness of these constructs in shaping knowledge sharing behaviour among higher education instructors. the Table 5 shows the direct path analysis results of measuring the effects of attitude (AT), motivation (MO), perceived usefulness (PU), and perceived ease of use (PE) on knowledge sharing behaviour (KS) for higher education faculty. The attitude to knowledge sharing path is positive and statistically significant (β = 0.344, t = 9.190, p < 0.001) and indicates that staff members with more positive attitudes toward digital technology are likely to participate in knowledge sharing behaviours. Motivation also strongly impacts knowledge sharing (β = 0.081, t = 3.446, p = 0.001). However, the effect is comparatively smaller, indicating that motivation does impact sharing behaviour but may be acting in conjunction with other salient factors. Perceived usefulness has a strong positive correlation with knowledge sharing (β = 0.179, t = 4.690, p < 0.001), suggesting that those teachers who feel digital tools are useful tend to share knowledge via them. Perceived ease of use is the best predictor among the constructs and has a highly significant and considerable influence on knowledge sharing (β = 0.477, t = 16.633, p < 0.001). This finding supports that usability is a key determinant in influencing faculty members to use digital platforms for sharing purposes. Generally, all four paths are statistically significant, pointing Table 6 presents results of mediation analysis testing whether user engagement (UE) and perceived technology (PT) mediate between personal factors (PF) and knowledge sharing behaviour (KS) and between PF and UE. The initial mediation path, PF → UE → KS, presented a total effect of 0.511 with no indirect effect (β = 0.000, t = -0.100, p = 0.920), which means that user engagement does not have a significant mediating effect on the relationship between personal factors and knowledge sharing. Likewise, the second chain, PT → UE → KS, also presents a non- significant indirect effect (β = 0.000, t = 0.048, p = 0.962), implying that user participation does not mediate the role of technology perception in knowledge sharing behaviour. A significant mediation effect, however, is presented by the third chain, PF → PT → KS. Here, the overall effect is 0.511, the direct effect is 0.189, and the indirect effect is 0.322, which are statistically significant (t = 5.885, p < 0.001). This proves that perceived technology partially mediates the relationship between personal factors and knowledge sharing behaviour. Conversely, the last chain, PF → PT → UE, is not statistically significant (β = 0.005, t = 0.136, p = 0.892), which suggests that perceived technology does not act as a mediator between In a time when digital transformation rewrites how knowledge is being created, shared, and utilised, knowing the psychological and technological factors behind knowledge sharing has become important for pushing forward higher education practices. This study aimed to examine how individual dispositions and technology perceptions influence knowledge sharing activities among teachers in the changing digital environment of universities in Henan, China. With the help of an integrated theoretical framework and empirical examination, this study untangles the intricate interplay among attitudes, motivations, perceived technology characteristics, and engagement dynamics to eventually inform a more fine-grained understanding of faculty behaviour in academic digital ecosystems.",
    "Based on the findings of this study, the first four hypotheses receive strong empirical support, revealing important insights into the behavioural dynamics of knowledge sharing among higher education faculty within the context of educational digitalisation in Henan, China. The results demonstrate that attitude (H1) plays a significant and positive role in predicting knowledge sharing behaviour. This aligns with previous theoretical stipulations under the Theory of Planned Behaviour, whereby scholars posit that those with a positive attitude towards behaviour are likelier to undertake the behaviour (10). In this instance, those members of the faculty who perceive digital sharing of knowledge as useful, applicable, or rewarding will be more likely to engage in the behaviour. The strength of this alliance also highlights the increasing openness of teachers in Henan to digital transformation within educational settings. It implies that if digital sharing is seen as being aligned with personal or professional objectives, instructors are more likely to spend time and energy on such endeavours. Also, the strong but comparatively smaller role of motivation (H2) suggests that although intrinsic or extrinsic motivational drivers (e.g., recognition, peer cooperation, or organisational rewards) contribute to knowledge sharing behaviour, their impact potentially may be secondary to factors such as ease of use or perceived value (29). This result partially replicates prior work and underscores that motivation might be insufficient to activate long-term digital sharing behaviour without favourable interactions with technology and institutional support mechanisms. underscores that motivation might be insufficient to activate long-term digital sharing behaviour without favourable interactions with technology and institutional support mechanisms. Also, the analysis identifies that perceived usefulness (H3) significantly impacts knowledge sharing behaviour, placing functional value of digital tools at the centre of shaping behavioural intent. Instructors are more inclined to participate in sharing behaviours if they think that employing technology will make them more effective teachers, improve collaborative research, or enhance professional communication. This upholds the core assumption of the Technology Acceptance Model and affirms previous empirical research by indicating that digital resources, which are seen as germane and effective, can enhance greater academic collaboration (32). Perhaps most significantly, perceived ease of use (H4) was the strongest predictor across all the constructs studied, further supporting the contention that ease and simplicity of digital platforms strongly facilitate user take-up and participation. It has dramatic policy and practice implications, suggesting that technical education, platform design, and user support systems must prioritise reducing the cognitive and operating hurdles to digital engagement (35). In the Henan University context, where some faculty may still adapt to new technologies, ease of use becomes a convenience and a critical enabler of academic digital transformation. These results confirm the research model and explain how faculty members react to digitalisation plans. This implies that developing positive attitudes and simplifying digital tools can significantly enhance the knowledge-sharing culture in Chinese higher education. Hypotheses 5 and 6, stating user engagement as a perceived technology and knowledge sharing behaviour (H6), were rejected. The mediation analysis revealed that the indirect effects through user engagement were statistically no significant. These findings imply that user engagement does not substantially mediate the interaction between personal factors, perceived technology, or knowledge sharing outcomes (12). Although user engagement has been found important in most educational settings for making intention operational, these findings propose that engagement is perhaps not an effective intermediary in this digital knowledge-sharing model. This may result from the fairly passive types of participation many instructors have in online platforms or the likelihood that online tools employed are not interactive enough or rewarding enough on a personal level to move motivation and perception into active participation (39). It is also possible that participation in these institutions is more influenced by external frameworks, like institutional policy or peer pressure, than by individual will, thus constraining its function as a mediating variable. The analysis found a large indirect effect of perceived technology between personal variables and knowledge sharing behaviour, supporting H7. This implies that where strong personal motivation or positive attitude exists among faculty members, such traits generate more positive views of technological tools, thus supporting knowledge sharing. Self- motivated people view electronic tools as helpful and easy to apply, and the higher positive perceptions trigger them towards knowledge- sharing behaviours (8). This result highlights the significance of perceived technology as a mental enabler that mediates internal dispositions with behavioural effects, consistent with theoretical views from the Technology Acceptance Model and Self-Determination Theory. Yet, support was not found for H8 since perceived technology failed to mediate significantly between personal factors and results suggest that perceived technology is a key mediating construct in promoting knowledge sharing behaviour. Still, that user engagement is a difficult-to-measure construct that will need continued exploration with more sensitive or context-specific measures in future work. Even though this research affirms the salient influence of perceived ease of use and perceived usefulness in determining knowledge-sharing behaviour, there is a need to appreciate the fact that digital technology effectiveness is not one-size-fits-all. Institutional heterogeneity e.g., between public and private institutions, or resource-endowed and resource-scarce universities can critically affect faculty adoption and usage. For example, institutions endowed with resources can offer sophisticated digital infrastructure and capacity building, promoting active sharing of knowledge, while resource-poor contexts might encounter constraints hindering the conversion of positive attitudes into behaviour. Similarly, cultural forces come into play as collectivist culture, hierarchical organizations, or intellectual property perceptions might influence faculty knowledge sharing digitally and why they do this. These contextual conditions indicate that technology in isolation is not enough; resource allocation and institutional culture play crucial mediating roles in their influence.",
    "Overall, the results of this research provide significant theoretical and practical contributions to knowledge sharing literature in digital higher education contexts. The proved hypotheses (H1 to H4 and H7) endorse that the internal psychological factors and external technological perceptions, independently and together, control knowledge- sharing behaviour. The noticeable impact of perceived ease of use and the mediating impact of perceived technology emphasise that institutions must nurture positive attitudes and invest in easy and intuitive digital systems. The discarded hypotheses (H5, H6, and H8) about user engagement contradict current assumptions and propose that engagement is not necessarily an active bridge between behaviour and intent, especially in contexts where engagement is digitally enabled and structurally incentivised. These results compel educational leaders and policy-makers to consider faculty knowledge emotional preparedness and technological ease. In conclusion, the study reaffirms the significance of harmonising personal, technological, and institutional dimensions to facilitate a sustainable academic culture of collaboration during the digital era. Though digitalisation brings obvious prospects for the enrichment of knowledge sharing, it also raises serious challenges that must not be underestimated. Persistent challenges including the resource gap between resource- scarce and resource-abundant institutions, antipathy towards introducing new technologies among faculty members, and insufficient digital training might limit the beneficial effect of technology tools. Besides, issues regarding cyber security and intellectual property rights might deter faculty members from making materials freely available. These obstacles underscore that the advantages of digital technology development cannot be universalized without considering institutional preparedness, user confidence, and In conclusion, this study presents a detailed examination of how digital technology development helps to promote knowledge sharing behaviour among Henan, China's higher education teachers. Through filling the gap between psychological constructs like motivation and attitude and technological beliefs like perceived usefulness and ease of use, the research confirms that both psychological and technological aspects significantly determine faculty members' inclination to share teaching knowledge. The findings emphasise that perceived ease of use is an extremely potent predictor, validating the necessity for accessible digital systems in educational settings. Additionally, while user interaction was hypothesised to mediate various relationships, its inability to contribute significantly demonstrates that basic technology use does not inherently equate with sharing behaviour, exposing a gap between system use and productive scholarly collaboration. On the other hand, perceived technology played a primary enabler, most significantly in converting individual readiness into successful knowledge sharing. Such findings highlight the importance of aligning internal motivation with outside technological enablement to create an effective and digitally empowered scholarly culture. Overall, the study not only helps theoretical understanding by combining ideas from different behavioural and technology acceptance theories but also gives practical insights to higher education managers looking to enhance collaborative digital work and knowledge flows within universities during the digital age of education. insightful practical implications to higher education institutions, especially in countries like Henan, China, where academic digitalisation is speeding up. University decision-makers and administrators must acknowledge that teachers' knowledge sharing behaviour is largely determined by psychological factors such as attitude and motivation, and technology perceptions such as perceived usefulness and ease of use. Thus, to develop a strong knowledge- sharing culture, organisations must craft holistic capacity-building programs that strengthen digital confidence among teachers and ensure positive technology attitudes. This might involve specially designed workshops, peer learning platforms, and reward systems that align individual drive with organisational objectives. As the perceived ease of use has a powerful impact, academic collaboration platforms should focus on user-focused design, simple navigation, and fast technical assistance to reduce resistance and promote adoption. Furthermore, with perceived technology having a mediating effect, it may not be sufficient to motivate employees; institutions need to ensure that digital systems are present and seem useful and effective for teaching, research, and communication. Because user engagement didn't strongly mediate most of the pathways, institutions should re-evaluate how engagement is developed, perhaps moving away from passive content provision to more interactive, gamified, or community-oriented models that increase investment and commitment to knowledge sharing. Institutions must also be careful to avoid pitfalls in digital knowledge sharing, such as unequal access to facilities, insufficient training of faculty members, risks of cyber security, and issues regarding intellectual property. These issues need to be addressed to achieve effective translation of digital technology progress into real contributions in that it extends and combines well- established behavioural and technology acceptance theories within academic digitalisation. Based on the Technology Acceptance Model (TAM), Theory of Planned Behaviour (TPB), and Self-Determination Theory (SDT), the research emphasises the multi- dimensionality of knowledge sharing behaviour, arguing that it is not only influenced by personal attitudes and motivations but also by cognition- based assessments of technology. The validation of perceived technology as an important mediator adds to current theoretical models by placing technology perception as a key vehicle by which internal dispositions are translated into behavioural effects. The discovery that user engagement did not work as a mediator contradicts earlier assumptions in the literature and calls for further theoretical articulation of engagement measures, especially in faculty- oriented digital environments. Furthermore, the research adds to regional literature by framing these dynamics within Chinese higher education, a context that frequently has limited representation in international debates around digital conduct. By combining cross-disciplinary theories and empirically testing an extended model, this study provides a more integrated theoretical perspective to analyse how knowledge professionals interface and adjust to digital settings in their knowledge- sharing activities.",
    "Although this study provides useful information on the determinants of knowledge sharing behaviour among Henan's higher education faculty, it is not free from limitations, which are rich sources for further research. Firstly, the study is based on cross-sectional data, which limits inferences that can be drawn concerning causal associations between personal factors, perceived technology, participation, and knowledge sharing behaviour. Longitudinal study designs would be useful to explore how these associations change over time as faculty members grow more familiar with digital tools. Second, the study was regionally focused on universities in Henan province, which could limit the ability to generalise to other parts of China or other countries where digital infrastructure, institutional culture, and readiness among faculty members might differ extensively. Comparative studies across provinces or nations would enable verification and improvement of the proposed model. Third, although the research involved important constructs such as attitude, motivation, perceived usefulness, and ease of use, other powerful variables such as organisational support, cultural values, digital literacy, and peer influence were not considered but can provide a deeper understanding of knowledge sharing dynamics. Fourth, the minimal contribution of user engagement indicates that there is a requirement to investigate more subtle forms or metrics of engagement, like emotional, cognitive, or behavioural aspects, which may be able to capture faculty interactions with online platforms more holistically. In addition, the current study did not make distinctions between institution types (public vs. private, or high-resource vs. low- resource institutions), nor did it formally investigate the cultural rules underpinning knowledge-sharing practices. Comparative analyses between different institutional environments and cultural contexts should be undertaken in future research to ascertain whether the strength of technological determinants differs based on organisational resources, governance modes, and scholarly traditions. Finally, subsequent studies should embrace a mixed-methods approach to supplement quantitative data with qualitative findings, enabling a more complete picture of the motivations, obstacles, and experiences surrounding faculty members' digital knowledge sharing behaviour. The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. Ethical review and approval were waived for this study as the nature of this study is irrelevant to the requirements to secure an ethical approval."
]