[
    "Abstract: Promoting the development of agricultural modernization is an important component of Chinese-style modernization and the general law of the development of \"agriculture, rural areas and farmers\". This paper selects the panel data of Henan Province from 2001 to 2021, draws on the measurement of agricultural modernization indicators by existing scholars, and constructs multiple linear regression. The research results show that the level of rural financial development in Henan Province has a significant impact on the development of agricultural modernization, and the empirical results are tested robustly by the method of dependent variable substitution. According to the empirical results, from the three perspectives of the government, the providers of funds and the demanders of funds, we propose how to open up the blood of rural finance to promote the development of agricultural modernization. In January 2018, the Central Committee of the Communist Party of China and the State Council publicly issued the \"Opinions on the Implementation of the Rural Revitalization Strategy\", which made a comprehensive plan for the implementation of the rural revitalization strategy, clarifying that by 2035, the basic realization of agricultural modernization will accelerate the transformation from an agricultural country to an agricultural country. . The No. 1 Central Document in 2019 once again emphasized the need to develop and expand rural industries and increase farmers' income. In the past two years, the new crown pneumonia epidemic has come out suddenly. We need to see that the new crown epidemic has more impact on non-agriculture than agriculture, and more impact on the livestock and poultry industry than on the planting industry. The impact on products is mainly basket products. At the same time, we must also see a strong agricultural development. , A solid agricultural reserve is how important it is for a country to face major emergencies. In July 2021, Henan was hit by the unprecedented floods in a century. Henan is also a major agricultural province with huge food losses. From this point of view, no matter from the policy support or the recent reality, we need to pay attention to and persist in promoting agricultural modernization and rural economic development for a long time. Finance is the bloodline of economic development. Limited by farmers’ income, it is difficult to cope with losses in the face of major emergencies and promote agricultural modernization by relying solely on farmers’ own savings. Rural areas have economic development and financial investment in rural areas is limited. Compared with cities, Rural areas are in urgent need of financial support. As the supply side of rural finance, they did not consider the goal of inclusive finance more, but pursued greater profit margins and most of them hated risks. This caused most financial institutions’ funds to go through the field in rural areas and failed to achieve long-term development. Step-by-step sustainable support for the development of rural revitalization. As the demand side of rural finance, its own strength is weak, the business industry is not large-scale, the profit level is not high, and it cannot solve effective mortgage loans or guaranteed loans, which makes the supply side less willing to provide funds to the demand side. Under the current background that the central government attaches great importance to rural development and is committed to solving the \"three rural\" problems and the financial problems faced by the current rural agricultural development, this paper is based on the financial development theory and the imperfect competitive market theory to promote the rural industry with fiscal finance Turn development into a research object. Based on the linear regression model, rural finance and finance can indeed promote the development of agricultural modernization. It also provides some suggestions on the implementation of finance and finance to support rural revitalization, so as to promote healthier, more efficient, and more sustainable development in rural areas. the building of a well-off society in an all-round way, how to promote high-quality solutions to the problems of agriculture, rural areas and farmers has become a research hotspot in financial services and rural economic development. We need to go deeper and more. Clearly understand and draw on the research results of the predecessors, and in the collision with the thoughts of the predecessors, so as to bring us more angles of thinking about problems, and improve the depth of thinking and the scientific nature of research. There are different conclusions on the relationship between the development of rural finance and the development of agricultural modernization at home and abroad. Some scholars draw on Goldsmith’s FIR theory and measure the development of rural finance from the three perspectives of financial scale, financial efficiency and financial structure. After empirical analysis, It is concluded that rural finance has a positive influence on the development of agricultural modernization. For example, Li Changfei (2017) believes that the scale of rural financial development has a significant impact on agricultural modernization, while structure and efficiency have a weaker impact on the development of agricultural modernization. [1] Yang Yunbo (2018) used the var model to empirically analyze the effect of rural finance supporting the development of agricultural economy in Henan Province. The study showed that the improvement of the scale and efficiency structure of rural finance would promote the development of agricultural economy, but the scale of rural finance played a role in the agricultural economy. The role is limited. [2] Huang Xiake (2016) believes that there is a one-way positive relationship between the scale of rural finance and the level of agricultural science and technology. However, there is no obvious influence relationship between the efficiency and structure of rural finance and the progress of agricultural science and technology. [3] After analyzing the Pagano model, some scholars have obtained three influence routes of finance on economic growth. They are to increase the marginal productivity of capital, increase the conversion rate of savings and investment, increase the social savings rate, and then transfer the role of finance on economic growth to agriculture. Financial support comes from the development of modernization. For example, Ravendra&Bakul (1992), through empirical analysis, believes that increasing the level of rural savings will promote the development of rural finance, and increasing funding for agriculture will also promote the level of agricultural modernization. [4] Yang Hui & Ni Pengfei (2015) believe that there is a positive relationship between the marginal capital productivity and the level of financial services and the development of agricultural modernization. [5] Wang Lu (2016) obtained through empirical analysis that there is a causal relationship between the conversion rate of savings and investment in rural areas, the efficiency of credit support for agriculture, and the level of agricultural modernization. [6] In some foreign studies, it is believed that the development of agricultural modernization and rural finance are mutually causal. For example, Jung (1986) found that rural economic growth and rural finance are mutually causal through empirical tests. [7] Greenwood & Jovanovic (1990) also believe that rural Regarding the development level of agricultural modernization, domestic and foreign research focuses on the measurement of agricultural modernization level indicators. There are different views on the relationship between rural finance and agricultural modernization development. There are two causes and effects, and there is a one-way positive Impact or negative impact, but it is undeniable that there is a relationship between rural finance and the development of agricultural modernization. Predecessors’ studies have something to learn from, but they also have shortcomings. This article is based on the perspective of rural revitalization in the context of high-quality economic development. It is novel to a certain extent, and the current empirical research on fiscal and financial service capabilities and the development of agricultural modernization is relatively good. The article is more comprehensive in the selection of indicators for agricultural modernization and fiscal and financial services, and considers more diversified.",
    "Considering the availability and comparability of data, based on the meaning of the \"Strategic Planning for Rural Revitalization\" and agricultural modernization, and referring to previous research results, the selection of agriculturalization indicators is divided into three categories, namely agricultural input level and agricultural output The level of social development in rural areas. Among the three categorized indicator layers, there are seven specific indicator layers, including total power of agricultural machinery, output per unit area of grain, and disposable income of rural residents. Financial services include coverage, utilization, and availability. These three classification indicators are composed of availability. There are corresponding specific indicators under each classification indicator layer. The total power of agricultural machinery, effective irrigated area, and the amount of fertilizer applied are important indicators for measuring agricultural modernization.The total output of grain per unit area and the total output value of agriculture, forestry, animal husbandry and fishery represent the level of agricultural development. The more output, the higher the level of agriculturalization.The disposable income of rural residents is related to the level of agricultural modernization. Rural, agriculture, and farmers are closely related. The high-quality development of agriculture is ultimately to generate income for farmers. Therefore, the per capita GDP and the disposable income of rural residents can be used as a measure of agriculture. An indicator of the level of modernization. Financial institution service personnel. The number of financial institutions reflects the financing environment. The increase in the number of financial institution service personnel and institutions can provide greater investment space and convenience for the development of agriculture, and can express financial service capabilities, so it is used as a financial service Important indicators.Loans are the main financing means for farmers in the process of promoting agricultural development. Loans can meet the needs of farmers to upgrade agricultural equipment and purchase agricultural materials. Therefore, the amount of loans is used as an indicator to measure rural financial development.Farmers’ investment in fixed assets is a key link in the development of agricultural modernization. If farmers receive financial support, they will also be used to upgrade agricultural infrastructure. Therefore, it can be used as an indicator of the availability of rural financial development. Financial support for agricultural development is also an indicator to measure the growth level of rural finance. As shown in Table 1, the evaluation index system of financial support for agricultural modernization in Henan Province. Province on the official website of the National Bureau of Statistics of The time dimension is long and some data is missing, so it is calculated by means of interpolation, as shown in Table 2 to obtain the descriptive statistics of each statistical variable. In order to eliminate the influence of the dimension, the variables are logarithmic, and the regression is obtained through the stata software The analysis results are shown in Table 3. This article focuses on the impact of Henan Province's finance and finance on the development of agricultural modernization. As shown in the regression results given in Table 3, according to the goodness of fit, finance and finance have an overall impact on Henan Province's agricultural modernization. The results are consistent with the development status of Henan Province, where the fiscal and financial and the total output value of agriculture, forestry, animal husbandry and fishery have the highest degree of fitting, and the lowest degree of fitting with the grain yield per unit area. The possible reason is that the grain yield per unit area is closely related to the level of agricultural According to the regression results in Table 3, the following multiple linear regression models of fiscal and financial effects on agricultural modernization are given: Based on the specific coefficients and the significance level, the local financial expenditure on agriculture, forestry and water affairs is significantly positive for the effective irrigated area and the disposable income of rural residents, which shows that the local financial support for agriculture does promote the development of agriculture. The possible reasons are the increase in financial expenditure on agriculture, forestry and water, the increase in expenditure on agricultural water and power construction, and the increase in agricultural subsidies for farmers. At the same time, the increase in effective irrigation area will also increase the value of agricultural output. This will promote an increase in the effective irrigated area and the disposable income of rural residents.",
    "The amount of investment in fixed assets of rural households is significantly positive for the total power of agricultural machinery and the disposable income of rural residents. It is not difficult to understand that most of the fixed assets of rural households are invested in agricultural machinery and equipment, which improves the level of agricultural mechanization and liberates labor. On the one hand, agricultural input costs Reduction, on the other hand, the liberated labor force can be invested in other production activities, which will increase the disposable income of rural residents. The coefficient of employment and effective irrigated area in urban units of the financial industry and the total output value of agriculture, forestry, animal husbandry and fishery are significantly positive. The number of legal person units in the financial industry and the conversion of agricultural chemical fertilizers, the total power of agricultural machinery and the disposable income of rural residents were significantly positive. The reason is that the increase in the number of financial personnel and the number of institutions will improve the financing environment and provide greater investment space for the development of agriculture, so it will increase the investment of farmers in agricultural materials. Agriculture, forestry, animal husbandry and fishery loans and agricultural chemical fertilizer application scalar amount, total power of agricultural machinery and total output value of agriculture, forestry, animal husbandry and fishery showed significant positive effects. The input level of agriculture will in turn increase the total output value of agriculture, forestry, animal husbandry and fishery. The coefficient of farmer loans and effective irrigated area is significantly positive, which may be due to the fact that farmers used the loaned funds to update irrigation equipment and improve irrigation levels such as precision irrigation, thus increasing the effective irrigated area. When we analyze, we often choose the method we are most familiar with or prefer to measure a variable. However, the measurement method we choose based on previous literature research or the availability of our own data often cannot guarantee the reliability of the conclusion. Therefore, considering the multi-dimensional nature of agricultural modernization, this article uses two other agricultural modernization indicators to conduct a robust test. Note: Standard errors are in parentheses, ***, **, and * indicate the significance level of 1%, 5%, and 10%, respectively First of all, in the model, local fiscal expenditures on agriculture, forestry and water affairs, farmer households' fixed asset investment, number of financial industry legal entities, and farmer household loans have no significant impact on agricultural land productivity, while financial industry urban employees and agricultural, forestry, animal husbandry and fishery loans are significantly positive. The reason may be that the former considers the sown area of crops. For example, an increase in fiscal loans will encourage more towns and rural people to engage in agricultural production activities to increase the area of agricultural planting, but the output has not increased, so it does not constitute a significant impact. The increase in financial service personnel and loans for agriculture, forestry, animal husbandry and fishery will increase the input of farmers, which in turn will increase output, which is more significant. In Model II, the coefficient of local expenditure on agriculture, forestry and water affairs is significantly negative, which may be due to the fact that local financial expenditure on agriculture, forestry and water affairs is mainly used for agricultural technology and agricultural subsidies. The coefficients of the investment in fixed assets of rural households and the number of legal person units in the financial industry are significantly positive, and the impact of the financial financing environment and availability on agricultural development is still considered. This is consistent with the conclusions of the previous basic model and verifies the robustness of the regression results in this article Based on the background of high-quality economic development and rural revitalization, this paper explores the impact of rural finance on the development of agricultural modernization. It selects the panel data of Henan Province from 2001 to 2020 to conduct regression analysis and robustness test, and obtain the following conclusions: First, rural finance can support the development of agricultural modernization. According to the regression results, fiscal finance has a greater impact on the output value of agriculture, forestry, animal husbandry and fishery. As local fiscal expenditures on agriculture, forestry and water affairs, and the availability of financial coverage continue to increase, the output value of all aspects of agriculture will increase, which will also increase. Peasants have disposable income, and rural finance has a small impact on grain output per unit area. This is easy to understand. The output per unit area of grain is greatly affected by the level of agricultural technology. The impact of financial service capabilities and financing environment on the development of agricultural modernization is obviously. A sound financial system, complete financial services, and prudent financial mechanisms are important forces that determine the development of agricultural modernization. Modern agriculture shows significant heterogeneity, diversification and interweaving in terms of the degree of financial service demand, the period of demand, or the level of demand, and the quality of demand, which runs through all the links, stages and stages of the development of agricultural modernization. main body. Based on the new development stage, implementing the new development concept, and constructing a new development pattern, financial service innovation to promote agricultural modernization is the key strategic choice for realizing rural revitalization.",
    "Second, the prospects for the development of agricultural modernization are considerable. According to the statistics of agricultural development in Henan Province in the past 20 years, the level of agricultural development is increasing year by year. The development of agricultural modernization is a comprehensive and complex systematic project, but the driving force for the development of agricultural modernization needs to be improved. The development of modernization requires a large amount of factor input, especially a large amount of capital, which is inseparable from financial service support. It is necessary to strengthen rural financial investment, improve the level of agricultural technology, strengthen the accumulation of human capital, and promote the possibility of agricultural modernization in terms of capital, talents and technology. Continue to develop and realize rural revitalization under the background of high-quality economic development."
]