[
    "China is undergoing a transition from being a major technology importer to becoming a leading technology innovator, with rapid digital transformation across its economy and society. The accessibility of financial services is emerging as a crucial platform that supports comprehensive economic and social development, significantly contributing to economic growth. However, during this process, Henan Province, known for its agricultural modernization initiatives and large agricultural population, has experienced a steady increase in farmers' incomes and significant shifts in income structure. Nonetheless, considerable income disparities remain among different regions, and the development levels of inclusive finance vary significantly, highlighting substantial imbalances. In this context, this article examines 17 prefecture-level cities in Henan Province, calculating the inclusive finance index for each city from 2010 to 2021, and investigates the relationship between inclusive finance and the urban-rural income gap. Panel data analysis indicates that enhancing the level of inclusive finance can reduce the urban-rural income gap. Based on the findings, the article proposes policy recommendations from the perspective of inclusive finance to further narrow the urban-rural income gap in Henan Province. Rural finance is deemed the cornerstone of the modern rural economy. This study elucidates the vital role of inclusive finance in rural economic development and urban- rural income equilibrium and how fostering the development of inclusive finance can drive rural economic growth and balanced income growth between urban and rural residents. Inclusive Finance (IF) aims to make financial services more accessible and affordable, enabling a broader segment of the population to benefit from these services. IF has the potential to extend financial services' reach and stimulate economic growth in impoverished and remote areas (Du & Xiang, 2020). IF, serving as an intermediary, can promote rural economic growth nationwide. His research indicates that a 1% increase in IF can reduce the urban-rural income gap by 0.27%(Li,2021). Conversely, Studies reveal that financial development might exacerbate income inequality, primarily benefiting the wealthy (Qin & Li,2021). Analysis of microenterprise loan data from India and Bangladesh shows a negative correlation between microenterprise credit and the urban- rural income gap (Imai et al.,2003). Research also supports an inverted U-shaped relationship between financial development and income distribution, aligning with Kuznets' inverted U-curve theory (Chen & Bai,2021). The debate persists on whether financial deepening can effectively reduce the urban-rural income gap. The 19th National Congress of the Communist Party of China outlined goals to improve living standards, reduce disparities, and achieve common prosperity by 2035 and 2050. Henan Province, a major agricultural region, faces pronounced urban-rural development imbalances and income disparities. This study utilizes time series data from Henan Province (2010-2021) and empirical methods to explore the relationship between IF and the urban-rural Copyright: © 2024 the Author(s). This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC-BY) 4.0 license (https://creativecommons.org/licenses/by/4.0/). Published by Al-Kindi Centre for Research and Development, London, United Kingdom. income gap. The findings indicate that enhancing IF significantly contributes to narrowing the urban-rural income gap in Henan, promoting balanced economic development, and fostering common prosperity. IF development benefits low-income groups and institutions, mitigating poverty and extending financial services to them. Achieving IF requires concerted efforts from government agencies, financial institutions, and social organizations. Furthermore, the exploration and practice of IF are ongoing, and no globally replicable, sustainable development model for IF has been established. Continuous practical exploration and experience sharing are essential to support IF development effectively. First, inclusive finance significantly narrows the urban-rural income gap. Rural inclusive finance in Henan Province promotes economic development and increases farmers' incomes despite facing challenges such as inadequate infrastructure and limited product variety(Chen,2021; Gao,2022). The research emphasized that reducing the urban-rural income gap is crucial for regional economic coordination(Liu, 2019; Tu,2020; Wang, 2017). Enhancing infrastructure, diversifying financial products, and strengthening regulatory frameworks can foster sustainable development in inclusive finance(Hu & Diao2021). Inclusive finance helps reduce the urban-rural income gap in Sichuan Province, though its effectiveness is limited by regional economic development levels(Zhang & Zhang,2020). Compared traditional and digital inclusive finance, highlighting the advantages of digital inclusive finance in improving service accessibility and availability(Sun & Zhao,2019). Second, inclusive finance plays a pivotal role in promoting regional economic growth. Inclusive finance positively impacts county- level economic growth in Hunan Province, though the effect varies significantly across regions(Long & Chen,2022). Scholars observed in Jiangsu Province that while expanding the financial scale can widen the urban-rural income gap, enhancing financial efficiency helps narrow it(Zhu,2013). Studies of West African countries have found that banking service penetration significantly influences inclusive growth, whereas microfinance services have a limited impact(Sawadogo & Fal,2021). Scholars used panel cointegration methods to confirm the long-term impact of financial development on economic growth(Pedroni, P,2004).",
    "Overall, inclusive finance is vital for regional economic growth and inclusive development, but its effectiveness depends on the reach and efficiency of financial services. In summary, inclusive finance is crucial for narrowing the urban-rural income gap and promoting regional economic growth, though its impact varies with financial infrastructure, product diversity, and regulatory systems. Based on existing research, this paper empirically examines the specific impact of inclusive finance on narrowing the urban-rural income gap in Henan Province(Westerlund, J.2007). Inclusive Finance (IF) initially aimed to provide microcredit and other financial services to the poor. Over time, it has become a key area of global financial development. IF promotes economic growth in impoverished areas and enhances the accessibility and efficiency of financial services, fostering social equity and inclusion. Since the 21st century, IF has gained significant attention, highlighted by initiatives such as the “International Year of Microcredit” and the publication of the “Blue Book of Inclusive Finance.” IF not only increases the availability of financial services but also plays a crucial role in financial innovation, industrial development, and poverty alleviation. Therefore, IF is a prominent topic in global finance and a priority for policymakers and financial institutions worldwide. The core concept of IF is “inclusiveness,” also known as “universality” or “inclusion.” Its main objective is to provide financial services that ensure equal opportunities for everyone, especially farmers and other impoverished residents. The goal is to enable these groups to access appropriate financial services, including credit, savings, payments, and insurance, to help them escape poverty and improve their lives. The commercial sustainability of IF is also essential to ensure its long-term provision of financial services. This means that inclusive financial institutions must apply business principles, such as rigorous risk management and profitability, to ensure their development and service capacity. Inclusive financial institutions typically use various innovative financial products and services, such as mobile payments, microcredit, and rural finance, to meet diverse customer needs. In summary, IF is a concept and practice that provides suitable and efficient financial services to economically disadvantaged and low-income populations to promote economic development and reduce poverty. Its principles of equal opportunity and commercial sustainability enable inclusive financial institutions to grow and maintain their service capacity while providing financial The Chinese government places a high priority on the development of Inclusive Finance (IF). The Third Plenary Session of the 18th CPC Central Committee adopted the “Plan for Promoting the Development of Inclusive Finance,” establishing the promotion of IF as a crucial strategic decision. To further advance IF, the State Council issued the “Plan for Promoting the Development of Inclusive Finance (2016-2020)” in 2015, setting forth major goals for the robust development of IF. At the 19th National Congress, the government introduced the “Rural Revitalization Strategy,” making IF development a key task in promoting rural revitalization. This strategy aims to support rural economic development, enhance farmers' financial inclusiveness, and promote sustainable growth Page | 10 in rural areas through IF. In summary, the Chinese government has integrated IF development into its strategic decisions and emphasized its significance in rural revitalization. To narrow the urban-rural income gap, China has implemented adjustments and support measures in areas such as rural poverty alleviation, rural land policies, education and skills training, urban-rural infrastructure development, and agricultural product price support. Policy documents such as the “Rural Revitalization Strategy Plan (2018-2022),” the “Law-Based Rural Revitalization Action Plan,” the “2022 Key Tasks for New Urbanization and Urban-Rural Integration Development,” the “Notice on Promoting Rural Revitalization in the Banking and Insurance Industries in 2023,” the “Implementation Plan for Vocational Skills Improvement in Key Rural Revitalization Areas,” and the “Work Plan for Expanding Investment in Agricultural and Rural Infrastructure Construction” provide policy frameworks and specific guidance to ensure the effective implementation of these adjustments and support measures. In recent years, one method to assess the urban-rural income gap has been comparing the per capita disposable income of urban and rural residents. According to the “Henan Statistical Yearbook,” as depicted in Figure 1, an analysis of the income status of urban and rural residents in Henan Province over the past few decades reveals a continuous widening of the urban-rural income gap, exceeding the warning range of 1.6 to 2. Although both urban and rural incomes have been increasing, the growth in rural residents' income has been more pronounced. This indicates that the widening income gap is mainly due to the faster income growth of urban residents compared to rural residents. This trend is evident in most prefecture-level cities in Henan Province, where the urban-rural income ratio remains above 2, signifying a substantial and persistent income gap. Despite this, some progress has been made in income distribution, as reflected in the declining Gini coefficient over the past decade, indicating significant achievements. However, further efforts are required to achieve greater income distribution equity. In this context, the development of financial services in rural areas has had a positive impact on farmers' incomes. The growth of IF has provided more financial services to rural areas, creating opportunities for rural economic development and income growth among farmers. Therefore, the continued promotion and development of IF, particularly in expanding financial channels in rural areas, will positively affect the narrowing of the urban-rural income gap and promote economic development. In conclusion, the widening urban-rural income gap in Henan Province necessitates attention from relevant authorities and effective measures to elevate rural residents' income levels. Despite the decline in the Gini coefficient, continued efforts are essential to achieve higher income distribution equity. The development of IF has positively influenced rural economic growth and farmers' income, and it is crucial to continue promoting IF. This includes expanding the coverage of financial institutions in rural areas, offering more loans and financial products to meet farmers' financial needs, and supporting agricultural production and rural industrial development.",
    "In recent years, the development of rural Inclusive Finance (IF) in Henan Province has shown increasingly positive momentum. The scale of loans for micro and small enterprises and agriculture-related loans has significantly expanded, injecting substantial momentum into the rural economy. This trend has attracted significant attention from the central government, as reflected in the allocation of 719 million yuan in special funds to Henan Province in 2019. This financial support has further propelled the development of IF in the province. Notably, over the past five years, the cumulative growth of loans for micro and small enterprises and agriculture-related loans in Henan Province has reached several trillion yuan. Specifically, loans for micro and small enterprises increased from 1,034.686 billion yuan in 2016 to 1,786.694 billion yuan by the second quarter of 2021, a cumulative increase of 752.008 billion yuan. Similarly, agriculture-related loans grew from 1,499.029 billion yuan in 2016 to 2,377.244 billion yuan by the second quarter of 2021, a cumulative increase of 878.215 billion yuan (Jiang,2022). The development of IF has positively impacted rural economic and industrial development, improved capital allocation efficiency, reduced capital costs, promoted entrepreneurship and employment opportunities, accelerated rural economic and industrial growth, increased farmers' income and consumption levels, enhanced their well-being, and reduced poverty incidence. The number of financial institution outlets and employees are key indicators of the development level of inclusive finance, reflecting the penetration rate of financial services. The number of financial institution outlets in Henan Province increased from 11,629 in 2010 to 13,327 in 2021. Despite slight reductions in certain years, the overall trend remains upward. Meanwhile, the number of employees in financial institutions increased from 162,995 in 2010 to 198,077 in 2021. Significant fluctuations in the number of financial institution employees, particularly between 2017 and 2018, were mainly influenced by the economic situation and macroeconomic regulation at the time. Given that the concept of Inclusive Finance (IF) involves multiple dimensions, a comprehensive indicator system is essential to evaluate its development level and effectiveness. Currently, there is no unified standard for traditional IF measurement indicators in China, resulting in diverse approaches to assessing IF development. The design and evaluation of these indicators are crucial for monitoring IF development and providing valuable references for policy-making and financial institutions' business decisions. By integrating IF assessment indicators from international organizations with China's specific IF indicators, this study selects appropriate measures. This study aims to assess the development level of IF. From the supply side, the chosen indicators include service penetration by population dimension (population density, i.e., the number of bank branches per total population) and service penetration by geographical dimension (geographic density, i.e., the number of bank branches per geographical area). From the demand side, the selected indicators encompass service usage utility (including loan and deposit conditions). A comprehensive approach, utilizing methods such as the Sarma and Euclidean distance methods, is employed to measure the level of IF development. The measurement indicators used in this study are detailed in Table 1. The IF development index is a relative measure; therefore, it should not be used as the sole indicator of the development status of inclusive finance in a specific area. It needs to be integrated with other specific indicators for a comprehensive evaluation to assess the development of IF in that region more accurately. This study examines the 17 prefecture-level cities in Henan Province from 2010 to 2021. The data used in this study are sourced from the “Henan Statistical Yearbook,” the official website of the China Banking Regulatory Commission, local branches of the Henan Banking Regulatory Commission, and the Wind Financial Database. Where Xi is the actual value of the i-th indicator, Xmin is the minimum value of the i-th indicator, and Xmax is the maximum value of the i-th indicator. The value range is [0, 1], with larger values indicating better performance of the dimension indicator. 2) In evaluating IF development, different indicators contribute differently to the field's development. Therefore, to scientifically and reasonably assess the importance of each indicator, an appropriate calculation method is needed to determine their weights in the evaluation. This paper uses the coefficient of variation method to calculate and determine the contribution weights of each indicator, followed by calculating the weight of each indicator. The formulas are shown in equations (2) and (3), respectively.",
    "Where CVi is the coefficient of variation of the i-th indicator, σi is the standard deviation of the i-th indicator, and μi is the mean of the i-th indicator. Based on the processing and calculation of raw data from 17 prefecture-level cities in Henan Province from 2010 to 2021, the IFI for each city was determined. The specific calculation results are listed in Table 2. Henan Province, as an economically developed region, has prioritized the development of Inclusive Finance (IF) as one of its policy directions. By organizing and calculating data from 17 prefecture-level cities, the development trajectory of IF in Henan Province becomes evident. From the data in 2010, the average value of the Inclusive Finance Index (IFI) in Henan Province was 0.277, which increased to 0.409 by 2021, indicating a significant enhancement in the level of IF development in the province. Based on the previous research and analysis and considering the role of IF in the formation of the urban-rural income gap, appropriate explanatory variables, dependent variables, and control variables are selected and briefly described. This study aims to investigate the impact of IF on the urban-rural income gap. Typically, the urban-rural income gap can be measured using indicators such as the income ratio, Theil index, and Engel coefficient(Li & Cui,2022). This study employs the ratio of per capita disposable income of urban residents to that of rural residents as the indicator to measure the urban-rural income gap and as the dependent variable for analysis. Considering data availability, this paper uses the Inclusive Finance Index (IFI) to measure the degree of IF development in 17 prefecture-level cities in Henan Province, which can comprehensively reflect the changes in the development level of IF in these cities. This paper introduces four control variables to help examine the impact of IF on the urban-rural income gap. By introducing these control variables and using statistical methods, the impact of IF on the urban-rural income gap can be more accurately assessed, thereby providing suggestions for relevant policies, as shown in Table 3. Industrial Structure (IS): In economic development, the evolution and upgrading of the industrial structure involve adjustments in the supply and demand of various production factors, which in turn affect the income of production factor owners. This indicator is measured by the proportion of the secondary and tertiary industries in GDP, with higher values indicating a more optimized industrial structure. Government Fiscal Expenditure (GE): Government fiscal expenditure positively affects local economic development levels and residents' income levels. Fiscal expenditures directed towards rural areas can reduce the urban-rural income gap. Urbanization Level (CI): With the rapid development of “urbanization,” many rural migrant workers choose to work in cities. Some become urban residents, while others aim for urban employment, achieving higher agricultural output through higher wage income. Empirically, higher levels of urbanization correlate with smaller income gaps. Based on this, this paper includes urbanization as a moderating variable, expecting urbanization to reduce the income disparity between urban and rural residents. Due to the inclusiveness and non-discriminatory nature of IF, farmers and other vulnerable groups can access financial services that meet their needs, which increases financial resource investment and expands the coverage of financial services, significantly reducing poverty rates. Based on the above analysis, this study hypothesizes that “the development of inclusive finance helps reduce the urban-rural income gap.” Where i represents the regions, t represents the years, β𝑖 denotes the regression coefficients and ε𝑖,𝑡 denotes the random disturbance terms. From the data presented in Table 4, the average level of GAP is 2.272, which exceeds the internationally recognized threshold of a “high urban-rural income gap ratio of 2,” indicating that the income gap in Henan Province is a significant issue. The average IF Index (IFI) is 0.357, with a standard deviation of 0.149, indicating a relatively high level of inclusiveness. This suggests that the overall level of IF in Henan Province is at a middle to lower level. The economic development level (ECD) in Henan Province has a large standard deviation, indicating significant disparities in economic development levels across different regions, which is consistent with the actual situation in the province. The standard deviations of IS, GE, and CI are relatively small, indicating minor differences between regions.",
    "Table 7 presents the regression results of the model. As shown in the table, GAP is negatively and significantly correlated with the core explanatory variable IFI, indicating that the development of IFI in the province has reduced the income gap, which is consistent with the hypothesis. Urbanization level (CI) and fiscal expenditure (GE) are negatively and positively correlated with the urban-rural income gap (GAP), respectively, and both are significantly correlated. This suggests that increasing urbanization levels reduces the urban-rural income gap while increasing fiscal expenditure tends to widen it. Both ECD and IS are positively correlated with GAP, but neither is significant, indicating that their impact on the explained variable is minimal. Based on the analysis, it can be concluded that the development of IF can reduce the urban-rural income gap, and CI has a more significant impact on the urban-rural income gap. First, regarding the urban-rural income gap, the overall trend shows a gradual narrowing, although there are variations in the extent of reduction among different cities. For Henan Province as a whole, the urban-rural income gap has progressively decreased from 2010 to 2021. However, significant differences in the urban-rural income gap between different cities were observed when analyzing the prefecture-level cities of Henan Province. There is a close relationship between a city's economic foundation and the urban-rural income gap. Economically developed cities, such as Zhengzhou and Luoyang, have relatively smaller urban-rural income gaps due to their robust economic foundation and abundant employment opportunities. These cities have made significant progress in economic development, providing more income opportunities and benefits to residents. Conversely, economically underdeveloped cities may exhibit larger urban-rural income gaps due to delays in industrial structure adjustments and economic development levels. Despite these differences, there has been noticeable improvement overall. Second, the overall trend of the IF index shows an increasing trajectory with significant regional disparities. According to the classification standards proposed by Sarma, the IFI values of the 17 prefecture-level cities in Henan Province have increased year by year from 2010 to 2021, indicating considerable progress, albeit with significant regional differences. Zhengzhou, Luoyang, and Jiaozuo have high levels of inclusiveness, with Zhengzhou ranking first in the province for 12 consecutive years. The IFI index of 16 cities, including Kaifeng, is above 0.2, indicating a medium level of IF development. Conversely, Zhoukou’s IFI index is below 0.2, indicating a low level of IF development. Overall, the development of IF in Henan Province is mid-level, but significant regional disparities remain, indicating room for improvement towards an overall high level. To ensure balanced IF development across all regions of Henan Province, resources must be appropriately allocated. While maintaining the high level of inclusiveness in Zhengzhou, appropriate support should be extended to other regions to foster inclusive finance. Other regions should learn from Zhengzhou's experience to reduce regional disparities and promote comprehensive IF development throughout Henan Province. Combining the above analysis, it can be concluded that the development of IF has reduced the income disparity between urban and rural residents in Henan Province, and CI has a more significant impact on the urban-rural income disparity. Possible reasons include: 1. The widespread presence of IF institutions facilitates easier access to financial services for rural residents. 2. IF institutions can provide loans and other financial services to rural enterprises and farmers, helping them engage in production and business activities, thereby improving economic efficiency and social contributions. 3. IF institutions can enhance the level and quality of financial services in rural areas by training and supporting the development of financial talent, allowing rural residents to receive more professional and efficient financial services. Areas in Henan Rural financial development have always been a key focus of China's financial reform, with the government and financial institutions adopting a series of measures. Firstly, the government and relevant institutions should expand business scales to improve farmers' access to financial services (Qu, H,2020). Secondly, the development of “Internet + Finance” should be promoted to enhance the accessibility and convenience of financial services for farmers through mobile banking, online banking, and other methods. To promote the construction of farmers' credit systems, the government and financial institutions can collect customer credit information for grading. Simultaneously, they should strengthen credit education for farmers. These measures aim to achieve sustainable rural financial development.",
    "6.1.2 Optimize the Rural Financial Ecosystem and Establish a Comprehensive Inclusive Finance Regulatory System Inclusive Finance (IF) refers to financial services provided to ordinary citizens, small and micro-enterprises, and rural areas, ensuring social equity and economic sustainability. Establishing a comprehensive regulatory mechanism is necessary for the healthy development of IF. Firstly, all inclusive financial institutions and products should be under regulatory oversight to protect farmers' interests. This requires establishing a complete regulatory system, including differentiated financial regulation mechanisms, standards, statistical scopes, and regulatory guidelines. Furthermore, it is essential to relax the risk assessment tolerance for “agriculture, rural areas, and farmers” loans and establish a sound accountability mechanism. Simultaneously, monitoring, evaluation, and assessment mechanisms for IF should be developed to increase the enthusiasm for participation by financial institutions. Effective monitoring and evaluation mechanisms should be established based on the actual situation of IF, assessing institutions' business development, risk prevention, capital adequacy, etc., and implementing a reward and punishment system to incentivize better IF business operations. Finally, an incentive mechanism can enhance enthusiasm and provide low-cost funds and support, encouraging proactive engagement in IF services. An incentive tax system can offer tax reductions for institutions engaged in IF services, lowering operating costs and promoting IF development. Supporting agriculture refinancing provides financial institutions with low-cost funding sources, encouraging more financial services to rural areas and small and micro-enterprises. The government can adjust the refinancing scale to specifically support banking institutions in handling agricultural enterprise commercial rediscounting (Wang,2019). These measures can ensure the healthy development of IF, improve the coverage and convenience of financial services, and achieve the goals of social equity and economic sustainability. With China's rapid economic development and the imbalance between urban and rural economic development, some small and micro-enterprises, farmers, and other impoverished groups lack the necessary financial support, requiring financial innovation. Promoting microcredit is a key financial innovation characterized by low thresholds, low costs, and flexibility, helping these groups access necessary funds for business or living needs. Besides microcredit, promoting internet finance is another major financial innovation, leveraging the convenience of online lending platforms to provide more flexible and convenient financial services. Through automated online application, review, and disbursement processes, financial service costs can be reduced, making them more accessible and usable. Encouraging grassroots private capital participation can also improve financial efficiency and promote local economic development. Compared with traditional financial institutions, private capital financial services are more flexible and customized, better meeting the needs of small and micro-enterprises, farmers, and other impoverished groups. In summary, promoting microcredit, popularizing internet finance, and encouraging grassroots private capital participation can expand and deepen financial services, helping small and micro-enterprises, farmers, and other impoverished groups obtain necessary funds for business or living needs while promoting local economic development. These measures provide effective means to achieve the goals of financial poverty alleviation and inclusive finance. Banking financial institutions play a crucial role in promoting rural financial development. To achieve this goal, banking institutions need to develop new products and services based on customer needs while actively adapting to the development trend of internet finance. In developing financial products, rural characteristics and needs should be considered, and innovation efforts should be increased. Through these means, banking institutions can meet farmers' needs while promoting rural financial development. Henan Province is an agriculture-dominated region with most of the population residing in rural counties, having relatively low education levels and lacking financial knowledge. However, with socio-economic development and financial market reforms, the demand for rural financial services is gradually increasing, making the development of IF particularly important. Currently, it is necessary to strengthen the dissemination of relevant knowledge, as many people are still unaware of the concept and practice of Page | 17 IF. Therefore, the importance of IF education and publicity is becoming increasingly urgent. Firstly, strengthening IF education helps improve public awareness and understanding of IF, allowing more people to benefit from IF services. This requires cooperation between the government, schools, communities, and financial institutions to conduct various forms of IF education and publicity activities. For example, organizing IF forums, lectures, training classes, and workshops to impart the concepts, policies, and practical experiences of IF to the public. Additionally, disseminating IF information and case studies through various media channels such as television, radio, and the internet can enhance public awareness and understanding of IF. Secondly, strengthening IF publicity helps attract more financial institutions and investors to participate in IF services. Currently, the development of IF still faces challenges such as financing difficulties, technical challenges, and talent shortages, requiring more financial support and resources. Therefore, the government, financial institutions, and social organizations should actively promote IF to attract more financial institutions and investors to participate in IF services, fostering its healthy development. Additionally, customers should actively adapt, strengthen connections, and increase trust. The government can take measures to encourage and support IF products and services, raise farmers' income levels, increase the proportion of the educated population, and implement policies to encourage educated individuals to return to their hometowns for entrepreneurship and employment, promoting local economic and social development.",
    "Conclusion Based on the research on the impact of IF on the urban-rural income gap in Henan Province, it is concluded that IF positively contributes to reducing the urban-rural income gap. Specifically, the promotion of IF can improve financial services for rural residents, promote their agricultural production and non-agricultural economic development, and increase income sources. At the same time, IF can provide financing support for small and micro-enterprises, promoting the development of urban and rural enterprises and increasing employment opportunities and income levels. However, due to differences in regional and financial service promotion conditions, the impact may vary, requiring region-specific policy measures for optimal results. The study also identified some issues, such as the potential time, regional, and demographic differences in the impact of IF on the urban-rural income gap, which require further research and analysis. Therefore, it is recommended that the monitoring and evaluation of IF policy implementation be strengthened, the financial service system further improved, and the coverage and quality of financial services enhanced to strengthen the role of IF in reducing the urban-rural income gap. In conclusion, while the development of IF positively impacts reducing the urban-rural income gap in Henan Province, further research is needed to explore its mechanisms to better guide practical work. Publisher’s Note: All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers."
]