[
    "This article is published under the Creative Commons Attribution (CC BY 4.0) license. Anyone may reproduce, distribute, translate and create derivative works of this article (for both commercial and non-commercial purposes), subject to full attribution to the original publication and authors. The full terms of this license may be seen at: http://creativecommons.org/licences/by/4.0/legalcode a Department of Modern Languages, Faculty of Languages and communication, Universiti Pendidikan Sultan Idris, 35900 Tanjong Malim, Perak Darul Ridzuan, Malaysia, b Faculty of Major language studies, Universiti Sains Islam Malaysia, Bandar Baru Nilai, 71800 Nilai, Negeri Sembilan Email: fatimahsuo@fbk.upsi.edu.my Utilizing suitable Teaching methods to teach languages, especial to teach Arabic language for non- native speakers is not only can make students more concentrate on their study, but also helps teachers to move the class more smoothly. Even though there are a lot of researches already discussed about this issue, but no research concerned about teaching methods for Arabic language teaching at Mosques, especially at female’s mosque. There is big gap to fill up. Therefore, this research aims to explore the students’ perception toward teaching methods which applied by teachers during their teaching Arabic language at female ‘s mosque in Henan province of china. The study used the Mix method to explore students’ view toward teaching method, the participants of this research are 100 students from 5 female’s mosque in Henan province of china, analytical methods to analysis the Data collection which designed by questionnaires which distributed to participants from five female’s Mosque in Henan Province China. The method of data analysis is percentage and frequency method using SPSS system. The research found that: the students considered that the teachers don’t have any clear ideal about teaching method for teaching Arabic language, and majorly of their teachers only use translation and Grammar Method to teach Arabic. Keyword: Perception, Teaching methods, Arabic teaching, Female’s Mosque. Henan was a centre of politics, economy, culture and finance in China, and Kaifeng, Luoyang and Zhengzhou used to be the former capitals of different Chinese dynasties. The Muslims of the Hui community in Henan Province were living in a unique cultural and social background, and the Chinese culture in this region is very strong. They maintained their own beliefs and Islamic culture, without being absorbed by strong Chinese culture. Therefore, they established Islamic mosque education, and not only men learn Arabic and Islamic knowledge at Mosque, but Muslims have established women's schools to teach Arabic and Islamic knowledge also. According to the text of the stone slab established by the Women's School of Four Years in Guangxu (1878 AD), the Kaifeng Muslim school is the first Muslim women's school in Henan Province (Shui, 1996: 51). Teaching Arabic at mosques for female Muslims in Henan Province from the Ming and Qing dynastic to the twentieth century. the female Muslims were trying to learn and master this language to achieve their noble goal and purpose: to read the Qur’an, memorize some vision of Quran and daily supplications, and to understand the meaning of Qur’an and Islam well. Since Arabic and Islamic education has established at early time at Islamic history of china, many scholars and researchers studied about Islamic education at male and female mosques in china, as Maria, Jaschok & Jun (2000) studied about history of women’s mosque in china, they discussed about Islamic education at female’s mosque in general, but didn’t touch anything relevant to teaching Arabic and it’s methods . at mosque in china, Arabic language t were included to teach, some of researchers discussed teaching arabic language in general but not at mosque. As Jia (1999) studied about teaching Arabic, Persian languages and Islamic culture in Islamic history in china without discussed about teaching methods of Arabic language at mosques. and large number of female students in the mosques already studied Arabic for few years, but they were unable to speak Arabic. the researchers believe that this problem relates to the teaching methods that are used by Arab language teachers at female’s mosques. According to observation of researches, the main problem of Arabic teaching at female mosque as a following: Even though, there were a lot of researches discussed about teaching methods for Arabic language teaching and it’s importance for teaching Arabic as second or foreign language in general, unfortunately, there were no research concerned about teaching methods at Mosques, especially at female’s Mosque. like wali (1998) talked about some problems which faced by schools teachers , those problems relevant to teaching methods. And Al- Nai’mi (2004) mentioned that teaching arabic for non-native speakers must use proper teaching methods.",
    "Therefore, the gap of this research motived the researchers to investigate the perception of students toward teaching methods which are used by female teachers at female’s mosques in Henan province of china for helping teachers to enhance their quality of teaching Arabic at Mosques , as well as, to motive more researchers to concern about this Issue . The research focused on perception of students toward teaching methods of teaching Arabic language by the female teachers at 5 female’s mosques in Henan Province of China. the participants of this research included 100 female students from 5 female’s mosques in Henan province of china, namely the Nanyang Station female’s Mosque, Wu zhi female’s Mosque, Xinxiang East Female’s Mosque, Ge Dang Dian Female’s Mosque, and Sang po Zhang Female’s Mosque. however, the researchers conducted by distributing the questionnaires. The data will be collected from them and will be analysed and evaluated. This research presents both the quantitative and qualitative analyses of data collected. For the quantitative part, data were analysed using SPSS version 13.0; this includes descriptive analyses of female students’ data. For the qualitative part, triangulation method was used to analyse the qualitative data for the participants. And the questionnaires distributed to 100 female students from 5 females ‘mosques in Henan Province of China, namely the Nanyang Station Female’s Mosque, Wu zhi Female’s Mosque, Xinxiang East Female’s Mosque, Ge Dang Dian Female’s Mosque, and Sang po Zhang Female’s Mosque. The data will be collected from them. the descriptive analysis will apply to analysis Frequency, percentage and means of items of questionnaires. The questionnaires designed to indicate the extent to which they agree or disagree or were neutral on the 5 Likert Scale. Table 1 shows the Summary of the Distribution of Participants’ Background Characteristics for female students at female Mosques at Henan province of china. It indicated that 7 (7%) of the female students aged between (20-25) years. and 14 (14%) of them are Between (26-30) years, as for the percentage between (31-35) are 3%., and 11(11%) of the respondents of them aged (36-40) years. and 18 (18%) of them are between 41-45 years old. Moreover, the result showed that 12 (12%) of the respondents were between the ages of 46-50 years, and 13 (13%) of the sample size were between the ages of 51-55 years, Hence, the result showed that 8 (8%) were included in the sample who were aged between (56-60) years, and 14 (14%) of the appointed female learners were aged 61and above. According to the results of the analysis, the academic level of Arabic language for female students at female’s mosques showed that 57% (n=57) of the participants hold under high schools’ certificate and t30% (n=30) of them hold the secondary certificate. While the percentage holds by the bachelor’s degree is 13% (n=13). About the Arabic background of female students at mosques indicated that 35%(n=35) of female students who learned Arabic only two-year at female’s mosques, And 20% (n=20)of them had learned Arabic 3-4 years, The number of female students who studied less than one year is14% (n=14). However, the number of female students who studied Arabic more than 5 years is 17% (n=17). The researchers concluded that majority of female students learned Arabic language at female’s mosques are less than 5 years. for the current level of learning Arabic language for female students at female’s mosques showed that 78% (n=78) of the student’s sample is at the elementary level, and 22% of them are at the advanced level. For the purpose of studying Arabic for those female students indicated that 76% (n=76) of students are studying Arabic for reading the Holy Qur’an and understanding Islamic knowledge, they wish to learn Arabic for reading the Holy Quran, understand the meaning of the Qur’an and the pillars and provisions of Islam, and there are 21%(n=21) of students who want to become Arabic and Islamic Teachers, and 3% (n=3) represented that the purpose of their studying Arabic is to be Imamah at the There was a total of 10 items of questionnaires for the Perception of students toward Teaching methods applied by female teachers to teach Arabic at female’ mosques of Henan province, china. The questionnaires distributed to indicate the extent to which they agree or disagree or were neutral, on the 5 Likert Scale. Descriptive analysis is used to carry on this research. When these students were asked about their teachers’ Teaching methods which applied to teach Arabic at female’s mosques, the results showed that there are 24% (n=24) of them agreed that their teachers were familiar with various of teaching methods to teach Arabic for them, but , 38%(n=38) disagree that their teachers used different types of teaching methods to teach Arabic for them, however , there are 38%(n=38) of them were not sure about this item . The mean of this item is 2.92. from this result, researchers concluded that their teachers at the mosques are not expertise in teaching methods.",
    "In addition, 88% (n = 88) of the participant mentioned that their teachers were delivered classed by some teaching methods against 4% (n = 4) while another 8% (n = 8) were undecided. The mean is 4.30. Based on these results, the researchers noted that majority of teachers knew only few methods to teach the Arabic language. On the other hand, 46%( n=46) of the responders responded that their teachers prefer only the translation method rather than another methods , and 36%(n=36) of them disagreed about this Item, while 18%(n=18) of them were not sure . The mean of the item is 3.23. The teachers translated vocabularies and sentences into the students ’mother tongue so that they can understand the meaning of Arabic words and sentences clearly. Contrarily, almost majority of the participants 79% (n = 79) agreed that their teachers were very care about Arabic grammar explanation during the Arabic class, and 9% (n=9) of them disagreed that their teachers were very care about Arabic grammar explanation during the Arabic class, very wonder that 12% (n=12) of them were neutral, same like themselves don’t know what kind of teaching methods their teachers applied to teach them, while the mean of this Item is 3.97. Based on this result, researchers considered that majority of their teachers like to use the grammar and translation method during their Arabic teaching. It is known that this method at mosques is considered one of the most famous methods which followed by male and female teachers at mosques to teach Arabic language from the past centuries to the present day. And because of using traditional method, majority of the students Speeded few years to study Arabic at Mosques, but they only can read Arabic, and unable to communicate with Arab. Nonetheless, more than half of responders 54% (n = 54) agreed that the teachers speak alone during the class and the students adhere to completely keep silence, and 34% (n = 34) disagreed that, while 1% (n = 1) were unsure. The mean of this item is 3.14. according to this result, the higher percentage of female teachers to speak alone without care about how much students can accept. They only focused on teachers centre approach, as students didn’t involved in the class interactivities , no motivation from teachers, for teacher-centred learning, teachers usually use particular textbooks, which are mostly grammar oriented and to compare the language structures of native and target languages. In this situation students tend to be more competitive and individualistic because they have less opportunity to think aloud or interact (Acat & Dönmez 2009). On the other hand, 39% (n = 39) of the responders mentioned that they read silently a topic from the textbook to develop their ability of understanding correctly , and another 39% (n = 39) disagreed about this item . while 22% (n=22) of them were uncertain about this statement, the mean of this item is 3.13. Based on this result, some of teachers interested in using the silent reading method to develop the students' reading skill. This type of reading has become very necessary for students’ life, due to many situations that require it, such as: reading newspapers and magazines, reading private messages, reading for quick review before exams, reading in public libraries, as well as meeting students in the classroom to remember and review often. Samak (1975, 249) stated that the special reading skill can be developed by the method of silent reading more than it can be by the method of outright reading and deals with these four basic aspects: 1 - the perception of the word. 2 - the perception of the meaning. 4- The aspect of the correlation of what the reader realizes new experiences with his old experiences, and it has been shown that the silent type of reading develops these aspects more and faster than what happens in the stereotype. As well as silent reading can attract the attention for understanding. Amazingly, majority the participants, 91% (n = 91) of them selected the statement which is the teachers use reading method which helps students to enhance their ability of reading skill and understanding meaning of vocabularies. Moreover, only 3%(n=3) of them disagreed about this statement, and 6% (n=6) of them were uncertain. The mean of this item is 4.12. this result indicated that almost majority of students considered that female teachers used the standard reading method when they teach Arabic. The teachers preferred reading loudly for the beginners of Arabic language learners with sufficient interest and abundant of them, and making them a good basis for training female students, by this method , teachers can reveal female students ’speech difficulties and their faults. Every day, the student practice to read textbook in Arabic loudly, so their ability of reading skill, quality of pronunciation, and understanding of meaning can increase.",
    "unlike last statement , more than half of of responders 79%(n=79) agreed that their teachers don’t use the direct method to teach Arabic, and only 2% (n = 2) disagreed about this statement, while 19% (n = 19) were unsure. The mean of the item is 3.93. this result of high percentage shows that the teachers do not choose the direct method to teach female students. The direct method is intended to use the target language (the Arabic language) to teach the Arabic language and a violation of the grammar and translation method. As Zakaria ( 2016) mentioned that the direct method aims to teach the concepts of the new language in real situations so that the direct link between the linguistic symbol and its significance is related to the same thing or the image and the movement, without using the student’s language or another language that he knows. however, majority 85%(n=85) of the participants considered that their teachers used very few times for oral audio method to teach Arabic language by recording, direct speech and dialogue in Arabic language, and 3% (n=3) of them did not considered about this statement. While 12% (n=12) of them unsure about this statement, the mean of this item is 3.89. this result shows that majority of When it comes to use the communicative method to teach Arabic to the participants , majority of them 79%(n=79) mentioned that their teachers don’t use the communication method to teach Arabic for them , against only 1% (n=1) of them , and 10% (n=10) of them are unsure about this statement , the mean of the item is 3.94. from the result above, the researchers believed that Arabic communication teaching requires qualified in language skills as Rushdi (1989) emphasized that speaking in the second language is one of the basic skills that are among the goals of linguistic studies, even the students communicate with others. The results of the mentioned items are detailed in the following table: The research found that majority of females students considered that their teachers at female’s mosques of He Nan province, china don’t have any clear ideas about teaching method for teaching Arabic language, and majorly of them considered that their teachers only use translation and Grammar Method to teach Arabic. From their view of point, they mentioned that their teachers did not train properly as an educators or expert in teaching methods. According to results of perception of students toward their teachers’ teaching method to teach Arabic at female’s mosque, researchers believes that the methods of teaching Arabic language used at female’s Mosques need to enhance their teaching methods to help the students to continue their studies from the primary till higher levels. besides that, there are many aspects need to be improved as suggested by researchers following 1, To encourage researchers to do more researches on teaching method for Arabic language teaching in china, especial, at mosques. 3. To review back the Syllables and Curriculum of Arabic language and make sure that is suitable for the students."
]