[
    "The No.1 document of the Central Government of China has been on the theme of \"agriculture, rural areas and farmers\" for nearly ten years, placing the solution of \"agriculture, rural areas and farmers\" at the forefront of the Chinese government's work. Located in the Central Plains, Henan Province in China is one of the major agricultural provinces in China and plays an extremely important role in the field of agricultural production in China. This paper uses an empirical approach and the DEA-Malquist model to study the efficiency of rural public financial inputs to rural revitalisation in Henan Province. The results show that due to different levels of regional economic development, the efficiency of rural public finance investment in Henan Province in promoting rural revitalisation varies, and there is a phenomenon of unreasonable allocation of funds. At the same time, the region's agricultural base also has a greater impact on the efficiency of financial investment. Therefore, Henan Province should adjust measures according to the different regional economic levels and agricultural bases to improve the efficiency of the use of fiscal funds. For the past 18 consecutive years, the Central Government's No. 1 document has prioritized addressing the challenges faced by the \"three rural areas,\" including rural areas, agriculture, and farmers, underscoring the significance of rural economic development. Following the successful completion of the poverty alleviation campaign in 2020, the Central Government has embarked on a new path toward advancing the construction of a modern socialist nation. The revival of the countryside is a prerequisite for national rejuvenation (Li et al., 2019; Lu & Qian, 2023). Since the turn of the century, the \"three rural issues\" have been addressed through the promotion of rural economic growth. In the 14th Five-Year Plan, the grand strategy of rural revitalisation was introduced. Against this backdrop, the effective measures that local governments and financial institutions can undertake to bolster farmers’ incomes and enhance rural economic development while consolidating the foundational position of agriculture have become a pressing concern for governments and relevant agencies at all levels (Khan et al., 2022; Xu et al., 2023; Y. Zeng et al., 2023). The formulation of objectives such as the supply-side structural reform of agriculture and the rural revitalization strategy has caused a paradigm shift in the rural development agenda (Shao, 2022; J. Wang et al., 2023; Yin et al., 2022). The focus of agriculture development has evolved from a simple emphasis on increasing agricultural GDP to prioritizing the promotion of high-quality and structured growth (Du & Wang, 2023; W. Wang et al., 2022; Yin et al., 2022). Since the initiation of the rural revitalization strategy, the state has implemented numerous policies to support agriculture and rural areas across various regions (Kazemi & Hosseinpour, 2022; Liu et al., 2023; H. Zhang et al., 2022). Moreover, there has been a significant surge in the financial investments made by governments at all levels toward the \"three rural areas (Hung, 2023; Szafraniec-Siluta et al., 2022; Tang & Sun, 2022).\" For instance, in Henan Province, the fiscal expenditure on rural economic development amounted to RMB 105.97 billion in 2019, representing a year-on-year growth of 5.8%, with an increment of RMB 5.862 billion. Increased public finance spending on rural economic development plays a crucial role in promoting farmers' income, optimizing the economic structure of the agricultural industry, improving agricultural production, and enhancing rural infrastructure (Frakes et al., 2022; Gao, 2019; Zhong et al., 2019). In 2019, Henan Province's annual grain production was 66,489,100 tonnes, pork production was 4,790,400 tonnes, and the total agricultural machinery power reached 102,040,400 kilowatts. Local government expenditures on rural public finance serve as a vital means of promoting economic development and agricultural progress in rural areas, and are also a necessary funding source for revitalizing the Chinese countryside (Lara-Rubio et al., 2022; Lodi et al., 2023; Nan, 2022). In practice, policy tools and infrastructure are significant factors that impact regional economic changes, especially in the development of ecological civilization and green technology (Ding et al., 2022; J. Hu et al., 2023; P. Hu, 2022). Green development is more influenced by policy tools than other forms of development (P. Huang & Westman, 2021). Located in the Central Plains, Henan Province is a large population and agricultural province in China with a rural population of about 50 million. The province accounts for 10.2% of China's total grain output, with high production and quality of major crops such as grain, cotton, and tobacco. Henan Province's agricultural economy features a rapidly emerging specialisation in the three major industries of flowers, vegetables, and Chinese herbs, resulting in the development of a unique agricultural economy in a specific area. Notably, the province has achieved significant results in improving rural infrastructure throughout the region.",
    "However, the evaluation criteria for the rural revitalization strategy reveal significant disparities in rural economic development across different regions in Henan Province. Although certain counties and cities have developed better under the leadership of special agriculture, there remain noticeable constraints (J. Yang et al., 2021; X. Zeng et al., 2021). Therefore, studying the efficiency promotion effect of rural public finance expenditure in Henan Province can provide a comprehensive analysis of the promotion effect of finance as a policy tool for rural revitalization. This analysis is instrumental in promoting the rational use of rural public finance and improving the efficiency of fund utilization (Z. M. Huang & Liang, 2020; Shen & Chou, 2022). Additionally, it can help to thoroughly examine the promotion efficiency of financial investment in Henan Province for rural revitalization, thereby providing more objective and professional opinions to inform the fiscal expenditure policy of Henan Province. Ultimately, this research can serve as a reference for the use of financial support for agriculture in the province and even the entire country. This study employs performance evaluation theory to analyze the current state of public finance spending on the \"three rural areas\" in Henan Province and makes significant contributions in the following areas. Firstly, this research analyzes the scale and efficiency of public finance spending in Henan Province by examining the financial spending of the cities in the region from 2013 to 2019. Secondly, this study employs the DEA-Malmquist model to empirically study the financial support provided to agriculture. Finally, the analysis assesses the impact of rural public finance on the implementation of the rural revitalization strategy, and corresponding policy recommendations are made based on the research results and domestic and international experiences. The remaining parts of this study are: Part II is a literature review; Part III presents the model and data used in this study; Part IV presents the empirical results; and Part V gives the conclusions and policy advice of this study. Many domestic and international scholars are actively researching regional growth. Larder recognized the scarcity and limited character of natural resources. As a consequence of their qualitative research on rural Australia, the two explained why rural areas in Australia accepted and rejected financial support investment, as well as the state of local rural development, and revealed the sources of anxiety (Alsagr, 2023; Czubak et al., 2021; Kozera et al., 2022). In actuality, policy tools are frequently the primary drivers of regional development, and infrastructure building and improvement will also hasten regional development (Dosso et al., 2023; Masduki et al., 2022). At the present, the majority of international scholars’ research on regional development is focused on the development of ecological civilization and green technology innovation, with some scholars concentrating on regional industrial structure (Dong et al., 2021; W. Wang et al., 2023; Q. Yang et al., 2021; L. Zhang et al., 2022). But on the whole, there are still few studies on agricultural development. Financial investments made by some scholars have had an effect on the rural population, as they fully explain how the agricultural system has changed and how this has affected rural areas’ ability to develop economically (Osei & Kim, 2023; Zou et al., 2022). Shikur (2020) evaluated the macro impacts of agricultural policies on agricultural growth, farmer happiness, and rural development in Oromia, Ethiopia, using the Computable General Equilibrium Model (CGE). He also investigated the impacts of policy changes on farmer welfare. He believed that expanding intensive agriculture and raising the intensity of agricultural production factors were mutually beneficial. It also believes that the fiscal input policy and the regional price support policy should be implemented concurrently (Jiang et al., 2022; Y. Wang et al., 2023). concentrated on the \"three rural issues,\" with the central topic of whether farmers’ income has increased serving as the foundation of the \"three rural issues.\" They examined the relationship between rural public financial input and farmer revenue by collecting relevant data from 1998 to 2018. There is evidence that the government's financial investment in rural health care is negatively correlated with farmers’ income, despite the fact that the government's financial investment in rural education is considered to have a positive impact on farmers' income growth (Zou et al., 2023).",
    "investment is a prerequisite (Q. Zhang et al., 2022). Listed the portion of agricultural spending that received financial aid and connected it to the human capital that was available to the workforce in rural areas (Qian et al., 2022). Binswanger et al. (1993) believed that financial investments in the infrastructure for agricultural output would mainly help farmers with high levels of human capital. As a consequence of financial support for agriculture funds connected to rural public services, farmers’ income has structural change points (Xiao et al., 2022). investigated the relationship between China's fiscal agricultural spending and the growth of farmers’ income through financial investments in rural infrastructure, rural disaster relief funds, and other expenditures (Dinlersoz & Fu, 2022; L. Zhang et al., 2023). It is believed that the local government should improve oversight of agricultural financial expenditures, prevent ambiguity in fund use, improve the operation mechanism to increase use efficiency, and implement targeted measures as soon as possible to optimize and adjust the structure of agricultural expenditures of China's public finance, particularly in terms of integration and utilization of funds (Zhou et al., 2022). Many scholars are currently investigating the natural fusion of financial investment and rural revitalization (Z. M. Huang & Liang, 2020; Lu & Qian, 2023; Shao, 2022; X. Zeng et al., 2021, 2021). The authors selected the three perspectives of instrumental, policy, and functional when discussing the role of finance in rural revitalization because they believed that without financial help, rural revitalization would lack the fundamentals (Czubak et al., 2021; Lodi et al., 2023). Tang & Sun (2022) argue that finance has a strong policy orientation and instrumentality that can influence taxes, subsidies, public services, and other aspects, effectively igniting the driving force of rural social development in the modern era. believe that the fiscal influence on agriculture varies greatly over time, both in terms of overall spending and regional effects. However, there are numerous issues with providing financial help for rural revitalization. Nan (2022) believes that there is a general tendency in agricultural fiscal spending that prioritizes spending over management and government over the market. Because of the limited budget, Kozera et al. (2022) believe financial security is under a lot of strain right now. Furthermore, there are issues with fund utilization, numerous agricultural support projects that have not produced benefits, partial support policies that are disconnected from real needs, and financial withdrawal difficulties. It was stressed that there is presently insufficient financial support for the development of new agricultural development models, technological research and development, and service system building. Zhong et al., (2019) believe that the budget performance monitoring mechanism is flawed, that the policy coordination mechanism is lacking, and that the financial decision-making mechanism for agricultural support is inadequate. In addition, researchers have suggested some countermeasures and recommendations to improve how finance supports rural development and revitalization. Zou et al., (2022) believe that agricultural financial resources should be \"kept under pressure,\" with an emphasis on providing fundamental financial support for public welfare, large-scale agricultural projects, and other initiatives. consider that sound financial management, scientific fiscal policy oversight, and successful execution are critical components in the formulation of fiscal policy. Data envelopment analysis (DEA) is to evaluate the efficiency of resource allocation for decision-making units with multiple inputs and outputs. Generally, the decision-making unit is the city, where: p Indicates the effective value of the decision-making unit; a_J is the weight coefficient of the decision-making unit; X_J and Y_J represents input and output variables respectively; S_- And S_+ They are relaxation variables of input and output, as shown in Formula 1: The results of this model include three cases, namely when p= 1 hour, S~ Not equal to 0 andS* When it is not equal to 0, the DMU is weak efficient; When p= 1,S~ Equal to 0 and $+ When equal to 0, the DMU is valid when u> 1 indicates that the DMU is invalid. Comprehensive efficiency (TE)=pure technical efficiency (PTE) * scale efficiency (SE). In order to solve the problem that the number of input and output indicators is relatively large and the number of decision units is relatively small, which causes the decision units cannot be effectively distinguished and ranked, and the weight assigned to each input and output indicator does not match the actual one, two virtual decision units are constructed in the DEA model, the former is the optimal decision unit and the latter is the worst decision unit, the difference is that the values of input and output indicators of the former take the minimum and maximum values of the corresponding indicators of the decision units, while the values of input and output indicators of the latter take the maximum and minimum values of the corresponding indicators of the decision units.",
    "Based on the data related to the input and output of each decision-making unit, the DEAP software is used to evaluate the efficiency of the financial resources of each decision-making unit, so that the efficiency value of resource allocation and its ranking can be obtained, and thus the efficiency of the financial resources of each unit can be evaluated. Sten Malmquist put forward the productivity index Malmquist in 1952, which was first used to analyze the changes in consumption, and then used by Fare, Grosskopf, Lindgren&Roos to analyze the dynamic production efficiency across periods. The Malmquist index is decomposed into comprehensive efficiency and technological progress efficiency. The technological progress index corresponds to the technological change of regional efficiency, that is, Malmquist index (TFC)=technological efficiency index (TE) * technological progress index (TC); Malmquist index is further decomposed into pure technical efficiency, scale efficiency and technical progress index: Malmquist index (TFC)=pure technical efficiency (PTE) * scale efficiency (SE) * technical progress index (TC). The Malmquist productivity index formula is as follows: Where: x‘ and x‘ttrepresent the input amount from the t period to the (t+1) period respectively; y' and yt! represent the output from the t period to the (t+1) period respectively; D'(xty‘) and D't1(xt+1 yt+1)represent the input distance function of the DMU compared with the previous edge in the period t 1 yt1)and D'1(x\" y‘)represent the input distance function of the DMU compared to (t+1), respectively; D'(x with the frontier in the mixing period. TFC, PTE, SE and TC are greater than 1, which means efficiency is improved, and vice versa. The input indicators of the DEA model in this study are selected from agriculture, forestry and water, as well as expenditure on poverty alleviation and total fiscal expenditure. This paper focuses on the efficient impact of rural public finance inputs on rural revitalisation. The source of output indicators is the consumption capacity and income level, which are closely related to the economic life of farmers. The specific inputs and outputs and the final situation of each indicator are shown in Table 1. The data for this study was obtained from the Henan Provincial Statistical Yearbook, with data on rural financial inputs obtained from the Henan Provincial Bureau of Statistics. As can be seen from Figure 1, from 2013 to 2019, the scale of fiscal expenditure on rural, agricultural and urban-rural projects in Henan Province generally showed an increase, with the financial investment in public financial support for agriculture growing from RMB 62.985 billion in 2013 to RMB 105.97 billion in 2019, expanding 1.68 times in scale and accounting for approximately 10.4% of total fiscal expenditure. Which exceeded the 100 billion yuan mark for the first time in 2018. However, overall, the growth rate was slow, with the level of financial support for agriculture growing relatively slowly compared to the level of growth in total fiscal expenditure, and declining midway through the year. However, there was a significant increase in fiscal spending on agriculture in 2019. Using the DEA model, it is possible to calculate the combined efficiency of rural public expenditure on rural revitalisation in each municipality in Henan Province from 2013 to 2019. The detailed results are shown in Table 2.(Figure 2 shows the comprehensive efficiency map of Henan Province drawn using GIS software, with the start and end years of observation data taken) As shown in Table 2, the financial investment in Henan Province has contributed significantly to the revitalization of local villages, and the overall efficiency of public financial investment is high: Kaifeng, Xinyang and Zhoukou, in particular, stand out in terms of the overall efficiency of financial resources in Henan Province: but the efficiency of financial resources in Zhengzhou, Jiyuan and Luoyang in contributing to the revitalization of villages is not high. This should be related to the differences in the development of local rural areas. Areas with poor rural infrastructures and high urbanization levels have limited financial investment to promote rural revitalization, while on the contrary, areas with good rural infrastructures and focus on agricultural and rural development have a higher overall efficiency of financial investment, and less financial investment is sufficient to support the economic development of rural areas. The combined efficiency in the DEA model can be decomposed into technical efficiency and scale efficiency, and the decomposition efficiency and total efficiency affect each other. Therefore, the decomposition of efficiency can be used to determine the degree of contribution of technical and scale efficiency to total efficiency. In this paper, the decomposition will be carried out for the efficiency of public financial support to agriculture in Henan Province in 2019. The detailed results are shown in Table 3. (Figure 3 shows the total factor productivity of Henan Province in 2019) The results show that the scale efficiency of public financial support to agriculture in Henan Province in 2019 is much more than the contribution of the overall efficiency, where the technical efficiency of financial support to agriculture is 0.824, while the scale efficiency is 0.903. Therefore, the impact on rural revitalisation in Henan Province by expanding the scale of capital investment is much more significant.",
    "Based on the data related to the efficiency of rural fiscal expenditure in Henan Province from 2013-2019, the changes in the efficiency of rural fiscal inputs in the 18 municipalities under the jurisdiction of Henan Province were calculated using the Malmquist productivity index model, and as the Malmquist productivity index model used in this study is a growth index, only the change data from 2014-2019 were used. The detailed results are shown in Table 4. From the data shown by the efficiency of rural public financial inputs, it can be seen that: the scale efficiency change index and the technological progress index are all greater than 1, which indicates the increase in the scale level of financial investment in support of agriculture in Henan Province and the increase in the level of efficiency of financial expenditure brought about by technological innovation in rural areas: there are levels of pure technical efficiency greater than 1 and less than 1. Due to the change in productivity and the dual factors of technical efficiency change and technical progress included at the same time, the study for the recent data found that the progress of science and technology is the dominant factor in the improvement of the efficiency of fiscal funds, and therefore the finance should take the increase of the investment in agricultural science and technology as the main way to improve the efficiency of fiscal expenditure. Notes: Total factor productivity=technological progress x Comprehensive efficiency change, comprehensive efficiency change=scale efficiency change x Change in pure technical efficiency. This research draws the following conclusions after evaluating the efficiency of fiscal spending on rural revitalisation in Henan Province by selecting a panel of prefecture-level cities in the region from 2013 to 2019. (1) Fiscal expenditures in Henan Province have a relatively obvious role in promoting local rural revitalization, and the overall comprehensive efficiency is high, especially in Kaifeng, Xinyang and Zhoukou. (2) The efficiency of rural revitalisation is influenced by the basic conditions of the countryside and the level of urbanization in the area. Areas with higher basic conditions and a higher level of urbanization need to transform their industries, while areas with lower levels of urbanization should focus on infrastructure construction and basic livelihoods. (3) From the decomposition of the efficiency of financial capital allocation, the scale efficiency contributes more than the overall efficiency. Therefore, local governments can increase the amount of financial investment in rural areas to promote the efficiency of local rural revitalization. Moreover, through financial support, they can complete industrial upgrading, optimize the regional industrial development structure, explore the regional growth potential through targeted specific financial policies, and find new sources of power. At the same time, in comparing the data analysis of recent years, it is found that the development of agricultural technology is the leading factor of regional progress, so the finance needs to increase the investment in agricultural technology and in this way to improve the efficiency of financial expenditure. Henan Province should accurately optimize the structure of rural public financial investment by region, and adjust the direction of financial support according to local conditions. On the premise of maintaining the scale and development degree of existing funds in agriculture and rural areas, increase the development of new agricultural projects. Areas with high urbanization levels should promote the development of leisure and sightseeing agriculture, so as to enhance the efficiency of capital utilization by increasing the added value: balance the investment of rural economic development funds and urban and rural construction funds, and expand the financial support for agricultural supply-side reform and rural reform, So as to realize the overall development and structural optimization of the regional agricultural industry. The more developed regions should realize industrial upgrading through innovation and other ways, find the growth point of regional economic development, seek the integrated development of primary, secondary and tertiary industries, and improve the supply level. The financial focus of underdeveloped areas should focus on infrastructure construction and the improvement of farmers' basic living standards. Provide the basis for industrial development by improving the level of infrastructure construction: provide the impetus for the development of the regional industrial economy by improving the basic living standard of farmers. In addition, due to the limited support of public finance, the public finance of the government and the sources of funds can also be increased through financial, social fund-raising, labor cooperatives and other ways to provide the funds and development programs needed for regional development in a diversified way. Especially with the progress of financial technology, how to improve the farmers' effective application ability in regional finance and the ability of financing and credit enhancement have become a new problem. Therefore, the financial integration formed on the basis of industrial development is conducive to the smooth financing of farmers and the realization of poverty alleviation in rural areas."
]