[
    "Hospitals in many countries face the need for balancing different categories of expenditures to achieve multiple goals within a limited budget. This study established a two-stage fuzzy linear programming (FLP) estimation model to explore the optimal allocation decision-making of expenditure budget under the multi-objective constraints. Taking all urban public hospitals in Henan province of China as a sample, the optimal allocation decision-making of total expenditure budget was tested with the human resources expenditures (HE) as the dependent variable. And the outcome was compared with the actual expenditure data of these hospitals between 2010 and 2016. The study found that when the HE achieves the maximum and minimum feasible scale, the expenditure scales of the budget allocation categories including pharmaceutical expenditures, medical supplies expenditures, and other expenditures were all within a reasonable range. Among them, the observed promoting space for HE was 3.78 billion yuan. The results show that the FLP method can help urban public hospitals to make better total expenditure budget allocation decisions, which can maintain their reasonable expenditure structure under the hospitals’ development goals and the government’s regulatory requirements. agricultural to an industrial province. The public hospitals, health care services, and business income represent about 10% of the total national budget. Public hospitals are the core and foundation of the health care system, as well as the major significant of the health intervention in many countries. The expenditure scale and structure of public hospitals are determined through budget, which is complicated and should fit the multi-objective requirements of hospital maintenance, administrative man- agement, and socioeconomic reform under limited capital (Ramanjaneyulu et al., 2014). The World Health Organization (WHO) supplied a planned-project regarding the information of hospital expenses for member states, aimed to provide data and information on efficient allocation of medical costs for the policy makers (Than et al., 2017). Currently, public hospitals are the major provider of health care in China. The government supplies a large amount of health care expenses annually, of which over 80% is spent by the public hospitals (National Health and Family Planning Commission People’s Republic of China, 2017). With a population of almost 100 million, Henan is one of the most representative prov- inces in China and is undergoing a transformation from an Total expenditure of hospitals refers to various expenses incurred in carrying out medical service activities, usually accounting for over 95% of hospital expenditures and occu- pying a significant proportion (45%–60%) of total national health budgets (The World Bank, 2011). Therefore, it is important and necessary to understand the way that hospitals determine their total expenditure allocation and provide use- ful tools to help the decision makers allocate total expenditure rationally and an effectively. A good strategy of Creative Commons CC BY: This article is distributed under the terms of the Creative Commons Attribution 4.0 License (https://creativecommons.org/licenses/by/4.0/) which permits any use, reproduction and distribution of the work without further permission provided the original work is attributed as specified on the SAGE and Open Access pages (https://us.sagepub.com/en-us/nam/open-access-at-sage). total expenditure allocation means effective coordinated organization, management and assistance in reducing the financial load for the hospital while providing for the overall goal of hospital development. For most hospitals, total expenditure is utilized to pay for human resources, medicine, medical supplies and medical equipment, and many others (Jakobsen & Pallesen, 2017; Jeong & Shin, 2012). In the US, total expenditure includes intermediate costs (medical supplies, service purchasing, depreciation and amortization, and all other operating expenses), labor costs, capital expenditures (infrastructure and equipment), and other expenses. In 2012, labor cost accounted for 48.8% and the intermediate cost accounted for more than 37.6% in the US (Glied et al., 2016). In China, total expenditure includes human resources payment, phar- maceutical purchases, medical supplies, and other expenses for medical equipment, infrastructure, and more. The top three proportions in terms of total expenditure in Chinese public hospitals are pharmaceutical expenditures, human resources payments and medical supplies, accounting for approximately 35%, 30%, and 17% respectively, and have remained relatively stable (Liu et al., 2015). Along with the expansion of health insurance coverage, the expansion of medical costs makes the optimization of scale and structure in total expenditure urgent. However, many studies regarding decision-making techniques have been conducted. Greene proposed the use of cost-benefit analysis (Etemadi et al., 2018). A study done by Kwak proposed the use of linear programming to deal with the common problem of capital rationing in the hospital setting (Charnes & Cooper, 1962). However, due to the existence of multiple contradic- tory goals in hospitals, their precise objectives and priority ranking requirements are often ambiguous and the effective- ness of these techniques is weakened (Cleveland, 1975; Kaur & Kumar, 2017). Currently, there is little evidence to guide hospital leaders in optimizing expenditure allocation in “accountable care organizations” (Reiter & Song, 2013).",
    "In the process of budget planning, policy makers usually face the challenge of whether to compress or expand certain types of expenditure due to the constraints of economic development, health resource allocation, political desires of government, and patient’s expectations of public hospitals (Gilmour & Lewis, 2006; Wright, 2016). This is often char- acterized as fuzzy and inaccurate in actual practice (Barasa et al., 2017; Zhang & Guo, 2018). For example, in the US existing evidence shows that the leaders of hospital and health care systems want capital budget allocations weighted toward more strategic investments, but in actual sense it tends to favor routine operational projects (Smith et al., 2006). In China, total expenditure decision-making usually needs to consider not only the hospital’s own development goals and the actual costs, but also the regulatory require- ments of government and health insurance. The final In 2017, the Department of Health and Family Planning of China issued “The 13th Five-Year Plan of human resource development in health and family planning of China,” which urged local governments to set a reasonable salary level for the human resources in public hospitals and gradually increase the proportion of personnel cost in total expenditure through a dynamic regulatory system based on the local economy (National Health and Family Planning Commission People’s Republic of China, 2017). Furthermore, one of the important evaluating parameters for a public hospital consid- ered by the government is the expectation that no more than 30% to 40% of total expenses are for medicine in public hos- pitals. The challenge faced by the decision makers in the public hospitals includes: the need to establish reasonable expenditure allocation for personnel, medicine and others in the limited budget so as to satisfy the regulatory goal of the government, meet necessary hospital expenditures and also work toward the hospital development goal. From this perspective, the authors defined the main goal of the study. The article investigates how to maximize the budget of a hospital expenditure category while meeting all require- ments at the same time. Firstly, with the goal of the human resources expenditures (HE), the relationship between expen- diture categories and their respective expenditure ranges were determined based on the hospital’s existing total expenditure budget allocation data, government and health insurance regu- latory requirements and hospital development goals. Secondly, a fuzzy linear programming (FLP) model was constructed and applied to explore the feasible budget allocation decision for total expenditure. Finally, the potential available space in the total expenditure allocation was discovered by comparing the calculation results of the model with the actual total expendi- ture allocation, so as to provide a reference for formulating the optimal strategy for hospital expenditure and development. The methodology of this study is to collect the financial allo- cation data of 100 hospitals based on statistical data, and use the FLP method to carry out data analysis. The study also con- ducted a face-to-face interview of five public hospital manag- ers and five government officials in 2019. The article has three main parts. The first part introduces the main theoretical basis of public hospital expenditure bud- get classification and allocation constrained condition. In the second part, the authors introduce the methodology and the results of the optimal allocation decision-making of expendi- ture budget under the multi-objective constraints. The final part contains the discussions, conclusions, and limitations of the presented research. This study selected all the urban public hospitals in Henan province as a combined sample; the data on public hospital business expenditures were derived from the Henan Province Health Statistics Yearbook from 2010 to 2016. The relevant expenditure adjustment targets were derived from face-to-face interviews with five public hospital man- agers and five government officials conducted from August to October 2019. The interview contains of two multiple- choice questions: (1) What do you think are the reasonable adjustment range for HE, pharmaceutical expenditures (PE), medical supplies expenditures (ME), and other expen- diture (OE) respectively, under the actual conditions of existing expenditures?; (2) How much do you think the maximum allowable adjustment range can be expanded on the basis of the reasonable adjustment range? The 10 options for each question are set from 1% to 10%. After deleting a maximum and a minimum of the interview results, the average of the remaining eight results (rounded) was used as the final interview result.",
    "The actual total expenditure of public hospitals includes: human resources salaries and allowances, medicines and medical supplies, consumables, the recurring cost of equip- ment, and other daily expenses (Tasi et al., 2019; WHO, 2000; Younis et al., 2010). Under the rules of compatible caliber and relative size, and also considering the practical management of hospital operation, total expenditure in pub- lic hospitals were classified into four categories: HE, PE, ME, and OE (Ji et al., 2017; Peng et al., 2015). These rela- tionships are as follows: The model was based on the following assumptions: the trend of total expenditure allocation is relatively stable in scale and proportion in recent years; the proportion of HE, PE as well as other expenditures are relatively stable, and specific targets or relatively clear direction was evident in hospital development based on government regulation or the hospital’s self-development goals. The establishment of the relationship between variables includes three steps: (1) determining the decision variables according to goals; (2) determining the constraints of the decision variables; (3) finding the functional relationship between the decision variables (Das et al., 2017). These are used to solve the extreme value problem of linear functions under constraint conditions. and OE were x1, x2, and x3, respectively. The fitting equations of the relationship between the indicators were constructed by using a linear regression method to analyze actual expenditure data. Both linear programming (LP) and FLP are essential tools in the field of optimization. These are widely used in opera- tional management, economic analysis, military operations, and many others by providing a scientific basis for rational use of limited human, material, and financial resources to make optimal decisions. The establishment of the LP model usually includes two parts: determining the objective func- tion and setting the feasible domain (Charnes & Cooper, 1962; Ebrahimnejad & Tavana, 2014). Set A as the scale of total expenditure of public hospitals, Z as the scale of HE, and xj (j = 1, 2, 3) as the scale of PE (x1), ME (x2), and OE (x3). The established objective function was: aij (i = 1, 2, 3; j = 1, 2, 3) were the equation coefficients; bi (i = 1, 2, 3) were the constant; di (i = 1, 2, 3) were the scaling index. An optimal solution of the model needs to consider both the target maximum value and constraint accuracy. Here λ indicates the degree of constraint acceptance, with λ = 0 meaning that fuzzy constraint is not accepted at all, and λ = 1 means that fuzzy constraint is completely accepted. Z0 is the optimal value solved by the LP model (equation (1)), and Z′ is the optimal value of the best solution of the scale (equation (2)), d0 = Z′−Z0. The optimal decision-making for solving objective function is transformed into solving the accuracy threshold function: The feasible domain refers to the set of all solutions that satisfy the constraints of the optimization targets. Determination of feasible domains helps to ascertain feasible scale interval of HE. The feasible domain of HE can be understood as a collec- tion of all budget decisions that can satisfy the constraints tar- get. By formulating a range of xj, the constraints were: aij (i = 1, 2, 3; j = 1, 2, 3) were the equation coefficients; bi (i = 1, 2, 3) were the constant; di (i = 1, 2, 3) were the scaling index. Among them, the aij (i = 1, 2, 3; j = 1, 2, 3) were the equa- tion coefficients; bi (i = 1, 2, 3) were the constant. x x x T )\" ′′ ′′ ′′ , ( Best decision was: M Z= , . Among them: , 3 2 1 \" ( j =1 2 3 equal to the corresponding model calculation x , ) , j \" in equation (3) was result Z″ when the optimum value of xi taken. Practically, the budget range of HE, PE, ME, and OE were empir- ically set by hospital administrators or governmental departments, with very subjective with features of vagueness and imprecision (Xu & Qin, 2010). The ambiguity of constraints or regulations would inevitably lead to conflicts between different targets, while FLP can obtain more optimal extreme under more relaxed condi- tions (Burkard & Zmmermann, 1987; Xu et al., 2013).",
    "The model calculation results included the reasonable structure of total expenditure and the optimal scale of expen- diture category by adjusting the degree of constraint accep- tance. It had good feasibility and practical value. The initial data was collected and processed using Excel 2016. Regression analysis was performed through SPSS 20.0. The LP and FLP calculations were performed using Mathematica 9.0. From 2010 to 2016, the number of urban public hospitals in Henan Province decreased from 199 to 159, but the number of employees increased from 1,01,855 to 1,52,725. The num- ber of open beds and patients treated increased from 84,739 and 4,00,25,524 to 1,31,732, and 7,00,28,020, respectively. The total expenditure increased from 23.39 billion to 64.53 billion yuan. The proportion of PE declined to 34.66% from 37.58%, while that of HE increased from 20.71% to 27.66%. The proportion of ME increased from 14.58% to 19.73% and OE declined from 27.13% to 17.96% (Table 2). The part in the dotted lines of Figure 1 represents feasible budget decisions that target HE in the case of meeting all con- straints, which was the HE feasible area. Each point in the fea- sible domain represents a type of budget decision. Objective function reflects the intrinsic association of HE with PE, ME, OE. And it can be considered as a straight line. Where it inter- sects with the shaded part numerous intersecting points can be seen, and the intersections xmax and xmin represent the maximum and minimum feasible scale of HE, respectively. The fitting equations of the relationship between the indica- tors were constructed by using linear regression method to analyze the actual expenditure data of urban public hospitals in Henan Province from 2010 to 2015. The equations were as follows: Based on the method part, the target equation was: max Z = 64.53−x1−x2−x3. By substituting the data from Table 1 into the equations (1) and (5): The adjusted R2 were 0.992 and 0.907, respectively. Therefore, the equation was well-fitted. According to the actual change trends in the proportion of expenditure cate- gories in total expenditure and national policy requirements of reduce the proportion of PE, the inequality: x3 ≥ 0.361x1 + 3.591 was applied to obtain the maximum and minimum feasible scale of HE. According to the proposed scale of each expenditure cate- gory in 2016, the budget inequality group for each total expenditure category was constructed as follows: To increase the budget scale range of HE, PE, and ME by 1% of A, we set the scaling variable di = A × 0.01 = 0.645 and added it to the constraint scope. Substituting into formula (2): Note. xmax = HE is the minimum at this point; xmin = HE is the maximum at this point; x1 = pharmaceutical expenditures (PE); x2 = medical supplies expenditures (ME); x3 = other expenditure (OE); HE = human resources expenditures. The solvable results of step 2 were: max Z′ = 22.30, x1′ = 20.01, x2′ = 11.41, x3′ = 10.81. Combining the above cal- culations, results Z0, Z′, and d0 = Z′−Z0 = 1.34 were obtained. Substituting Z0, d0 into equation (3): 1 388 . 1 388 . x x ′′ − 2 ′′ − 2 3 520 0 645 . + . 3 520 0 6 . + . 445 λ λ ≤ ≥ 22 59 0 645 . + . 16 13 0 645 . + . ≤ ′′+ + 20 65 0 645 . x . 1 ≤ ′′ + x 645 .. + . 10 97 0 2 ′′+ ′′ ≥ x 0 361 . . x 3 591 3 1 0 645 . 0 645 . λ λ ≤ ≤ 23 23 0 645 . + . 13 55 0 645 . + . 9 68 . ≤ ′′ x 3 ≤≤ 12 26 . − ′′− ′′ − ′′− 64.53 x x x 1 2 3 0 ≤ ≤ λ 1 1 34 . λ ≥ 20 96 . The solvable results of step 3 were: max Z″ = 21.63, x1″ = 20.33, x2″ = 11.64, x3″ = 10.93, λ = 0.50. It’s estimated that the maximum size of a feasible HE budget for urban public hospitals of Henan province in 2016 would be 21.63 billion yuan under the preset target conditions of expenditures for PE, ME, and OE, while the corresponding expenditure decision-set would be: max (Z″, x1″, x2″, x3″) = (21.63, 20.33, 11.64, 10.93).",
    "Similarly, taking the smallest scale of HE budget as the goal, it’s estimated that the minimum scale of a feasible PE budget for urban public hospitals of Henan province in 2016 would be RMB 15.49 billion yuan under the preset target conditions of budgeted for PE, ME, and OE. The correspond- ing expenditure decision combination would be: min (Z″, x1″, x2″, x3″) = (15.49, 22.96, 14.20, 11.88). See Table 3 and Figure 2 for details. The model-calculated results show that the feasible larg- est scale of HE was 21.63 billion yuan, which was 3.78 bil- lion yuan higher than the actual expenditure of urban public hospitals in Henan Province in 2016 (accounting for the actual expenditure ratio of 21.18%), while allowing for it to also meet the requirement of preset targets at the scale of other expenditure categories. This model could help the deci- sion maker determine the potential adjustment space in the budget plan in different categories of total expenditure in public hospitals. Figure 3 shows the feasible spending range of HE and its maximum and minimum value in 2011 to 2016. Found that between 2010 and 2016 the maximum and minimum values of the HE calculated by the model increased from 8.34, 4.71 billion yuan to 21.63, 15.49 billion yuan, respectively. The growth rate of HE′ minimum value was almost the same as the growth rate of HE′ actual expenditure, and growth rate of HE′ maximum value was faster than the HE′ actual expen- diture rate. See Figure 3 for details. Figure 4 shows the Max and Min values of PE, OE, and ME, respectively, when the HE obtains the Min and Max val- ues. It was found that between 2010 and 2016, the maximum values of PE, OE, and ME calculated by the model increased from 11.18, 7.94, 5.59 billion yuan to 22.97, 11.88, 14.20 bil- lion yuan, and the minimum values from 9.56, 7.36, 4.18 bil- lion yuan to 20.33, 10.93, 11.64 billion yuan, respectively. Only the growth rate of ME′ maximum value was faster than the actual expenditure rate. It can be seen that the actual PE, ME, and OE were all within the expenditure interval formed by Min and Max (excluding the PE in 2012 and OE in 2011), indicat- ing that the model results have good practical applicability. The traditional budget decision-making process of public hospitals is mainly based on the summarization of expendi- ture needs of various departments while considering the Figure 2. Comparison of budget estimation and actual decision making in 2016. Note. HE = human resources expenditures; PE = pharmaceutical expenditures; ME = medical supplies expenditures; OE = other expenditure. regulatory requirements of health administration, health insurance agency, and other governmental sectors (Kaur & Kumar, 2017). Less consideration is given to the scale and structural control of various types of total expenditure, which in turn, results in unreasonable and unbalanced expenditures between different categories (Reiter & Song, 2013). With the budget-setting model described in this study, the hospital budget decisions can be made based on hospital realities, reflecting developmental goals, policy requirements, and also taking into account a reasonable expenditure structure. Using human resources, one of the most important strate- gic resources, as an example, the proportion of HE to the total expenditure in public hospitals in China have long been neglected. This proportion is usually less than 30%, and even less than 28% in urban public hospitals. Meanwhile, in the US, Palestine, and South Africa the proportion is 48%, 57%, and 78% respectively, all of which are much higher than in China (Olukoga, 2017; Zhang & Oyama, 2016). Failure to embody the labor value of human resources also affects the long-term development of hospitals. In addition, due to the lack of support and practical assistance in decision making, Figure 4. Results of potential adjustment space in (a) PE, (b) OE, and (c) ME when HE at Max, actual, and Min. Note. HE = human resources expenditures; PE = pharmaceutical expenditures; ME = medical supplies expenditures; OE = other expenditure. many hospitals’ budget decision making processes are not sufficiently transparent and subject to subjective factors of decision makers, which may increase the risks to the realiza- tion of hospital development goals (Smith et al., 2006).",
    "According to the model calculation results, in 2016 the maximum allowable scale of urban public hospitals in Henan province was 21.63 billion yuan, while the actual expendi- ture scale was 17.85 billion yuan. This model has opened up 3.78 billion yuan in HE spaces for public hospitals. With an improvement in the scale of HE, hospitals could make changes in the scale of other total expenditure categories and still meet the preset objectives. This means that urban public hospitals can allocate more resources to personnel recruit- ment, training, and improvement of welfare benefits under the premise of ensuring the normal operation of the hospital. This result is in line to deepen the deepening health care reform, which is proposed by the Chinese government’s health system reforms to increase the proportion of HE in public hospitals (National Health and Family Planning Commission People’s Republic of China, 2017). the proportion of PE and ME accounted for 31.51% and 17.77%, respectively. Compared with the actual expendi- ture level, the calculation result of the model has been greatly reduced, but it is still higher than the overall level of less than 38% in the United States (Glied et al., 2016). The reduction of MH and PH will help reduce the cost of medi- cal and health care as well as the economic burden of social health expenditure, but excessive reduction will inhibit the development of related industries and the enthusiasm of hospital service provision (Tang et al., 2019; Yousefi et al., 2020 ). The Chinese government has implemented systems such as zero price difference for medicines and centralized procurement to reduce ME. At the same time, the govern- ment is also trying to exploring the application of these policies to PE. On the one hand, the decline of MH and PH will help the realization of optimal budgetary expenditure allocation decision obtained in this study. On the other hand, the results of this study can provide a reference for the implementation of the policy, so as to avoid excessively reduced MH and PH to guarantee the actual operation of the hospital. The practical application of this method includes three steps: firstly, classify the total expenditure items of the hos- pital to form a relatively uniform expenditure category, and use it as the relevant variables applied in the model analysis. Secondly, determine the expenditure category that needs to be the focus of attention as the dependent variable, and the others as independent variables; form the expenditure con- straint range of each variable through comprehensive analy- sis, and obtain a feasible budget decision set. The third step is to apply the FLP model to measure and obtain the corre- sponding budget allocation decision when the dependent variable achieves the maximum and minimum values. The application of the method requires to be satisfied linear correlation between various expenditure categories. It should be noted that the instability of policies will also reduce the accuracy of model fitting and the practicability of the results. This study attempts to establish a model framework for the problem of fuzzy uncertainty ratios to deal with the allo- cation of financial budgets in public hospitals. However, the study still has room to be improved. Firstly, unified classifi- cation criteria need to be addressed for total expenditure in different countries and regions across different types of hos- pitals. Secondly, the time span of data collection needs a fur- ther extension to improve the accuracy of the relationship equation between various category of total expenditure. At the same time, private hospitals have higher flexibility and efficiency pursuit for expenditure budget allocation. The extended application of FLP in private hospitals is worthy of further study. The method of constructing an FLP model with double-sided fuzzy features is proposed to help decision makers to opti- mize the scale, structure, and decision-making process of hospital budgets. The minimum and maximum requirements of the objective function in the model are incorporated into the optimization framework of a linear fuzzy constraint plan. The function could be applied in decision making regarding the hospital’s actual expenses, including the developmental goals and meeting policy requirements, and also considering a reasonable expenditure structure. The model has a clear design principle, simple calculation, and easy access to data sources. It’s helpful in a discovery of potential adjustment space in different business expenses in public hospitals and could provide the decision-making basis for the executive department in planning development. The model also has theoretical applicability to private hospitals.",
    "The authors would like to thank the National Key Research and Development Plan “Digital diagnosis and treatment equipment research and development pilot project” (2018YFC 0114501), and Henan Provincial Health and Family Planning Commission for their support for making this study possible. JW designed the study, built the FLP model and led the data analy- sis and writing of the manuscript. WR contributed to the model evaluation, data collection, and statistical analysis. YZ and HZ con- tributed to the data collection and analysis. XF contributed to the data analysis and interpretation. All authors read and approved the final manuscript. The author(s) disclosed receipt of the following financial support for the research, authorship, and/or publication of this article: This research was supported by: 1. 2021 Postgraduate Education Reform and Quality Improvement Project of Henan Province (YJS2021KC07); 2. Performance Evaluation of New Basic Public Health Service Projects in Henan Province (2020130B); 3. Mid- term Performance Evaluation of Capacity Improvement Project of Provincial Hospitals in Henan Province (2020131B); 4. National Key R&D Program of China (2018YFC0114501)."
]