[
    "Background In response to declining fertility rates, China implemented universal two- and three-child policies, lead- ing to an increase of multi-child families. However, little is known whether and how these policy changes influenced the uptake of non-National Immunization Program (non-NIP) vaccines. We evaluated associations of sex and birth order with non-NIP vaccine coverage in 1-6-year-old children in China. Methods Our study was a cross-sectional survey of caregivers of 1-6-year-old children in Zhejiang and Henan Provinces in 2022. We obtained information on sex, birth order, vaccination history, and family socio-demographics and determined uptake of five commonly-used non-NIP vaccines for infants [Haemophilus influenza b (Hib), varicella, rotavirus, enterovirus 71 (EV71), and 13-valent pneumococcal (PCV13) vaccines]. Children were considered vacci- nated if they received the first dose of at least three of these vaccines. Log-binomial regression models were used to estimate prevalence ratios (PRs) and 95% confidence intervals (Cls) for independent and joint associations of sex and birth order with non-NIP vaccine coverage, and multiplicative and additive interactions of sex and birth order. Results A total of 1611 children with accompanying parents/guardians were included in the survey; 48.0% (n=773) were girls; the median age was 3.3 years (interquartile range 2.0-4.8); and 824 (51.1%) were first-born children, 578 (35.9%) were second-born children, and 209 (13.0%) were third-or-later born children. Coverage of non-NIP vaccines varied by sex and birth order, ranging from 58.2% for first-born boys to 28.4% for third-or-later born girls. Cover- age among girls was less than among boys (PR: 0.91, 95% Cl: 0.82-1.00), but the sex differences were not signifi- cant after adjusting for sociodemographic factors (PR: 0.94, 95% Cl: 0.86-1.03). Compared with first-born children, coverage PRs were 0.85 (0.76-0.93) for second-born children and 0.82 (0.65-1.00) for third-or-later born children (p for trend < 0.001). Sex and birth order had joint effects on coverage, with the lowest coverage PRs in the third-or-later born girls (0.71, 95% Cl: 0.49-0.97), compared to first-born boys. Multiplicative interactions of sex and birth order were significant (PR: 0.86, 95% Cl: 0.75-0.98 in second-born girls). Conclusions Birth order of children was independently associated with non-NIP vaccines coverage, whereas sex showed no significant. However, sex and birth order were jointly associated with receipt of non-NIP vac- cines, with later born children and girls having significantly lower coverage than first-born boys. In the context ©The Author(s) 2025. Open Access This article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To. view a copy of this licence, visit http//creativecommons.org/licenses/by-nc-nd/4.0/. reference for boys and gender inequalities in health care prevailed globally [1]. Parents tend to allocate more ealth resources to sons than to daughters [2, 3]. There ave been reports of sex-based discrimination in a variety of pediatric care areas, including emergency, inpatient, outpatient, and preventive care—mainly from South Asia, with sporadic reports in Africa and South Amer- ica [4]. Birth order and family size are important factors associated with allocation of resources among children in a family [5-7]. For example, first-born children were more likely to be immunized than third-born or later- born children, with an inverse relationship between birth order and vaccination coverage, in sub-Saharan Africa and other low- and middle-income countries [8, 9]. Vaccines are widely recognized as one of the most powerful and cost-effective public health interventions {10]. In China, vaccines are categorized into two types: the National Immunization Program (NIP) vaccines and non-NIP vaccines. NIP vaccines are comprehensively funded, freely provided, and strictly monitored by the government, which coverage has remained above 95% among age-eligible children [11]. Non-NIP vaccines refer to those have not yet been included in China’s NIP, which require voluntary self-payment by citizens. However, regulatory constraints on basic insurance and limited commercial insurance coverage render out-of-pocket payment dominant [12]. Additionally, these two vaccine categories are different in recommended schedules: NIP vaccines have fixed timelines based on age, whereas non- NIP vaccines often require multi-dose regimens and can be given at more flexible times (see Tables S1-S2) [13, 14]. Given the specific features of non-NIP vaccines in China, equitable access is influenced by household income, car- egivers’ health literacy, and geographic disparities.",
    "In response to low birth rates and an aging population, China enacted a universal two-child policy in 2016 that was further liberalized to a three-child policy in 2021 [15]. Subsequently, the second-child fertility rate rose significantly from 0.6 before 2011 to over 1.0 in 2017 [16]. According to the seventh national population cen- sus, second and third children accounted for 43.08% and 9.02% of all births, as many Chinese families transition from one-child families to multi-child families [17]. Over the past few decades, strict family planning policies have alleviated gender inequality by controlling family size, but recent changes in fertility policies have created new challenges for multi-child families, notably in vaccination coverage [18, 19]. A study in Zhejiang Province demon- strated that inequalities in full primary immunization (FPI) coverage were attributable to birth order but not sex [20]. In contrast, non-NIP vaccines are voluntarily received at family expense, uneven allocation of house- hold resources in multi-child families and sex preferences could be important, emerging barriers to promoting non- NIP vaccine equity in China [21-23]. However, little is known about the combined effects of sex and birth order on non-national immunization program (non-NIP) vac- cines globally, and particularly in China under the rela- tively recent three-child policy [24-26]. Our study examined the independent and joint asso- ciations of sex and birth order with non-NIP vaccina- tion coverage among children aged 1-6 years in China and explored whether associations varied by family socio-demographics. The design was a cross-sectional survey of children with accompanying parents/guardians that was conducted in Zhejiang and Henan provinces between July 2022 and October 2022. We used a multi-stage sampling method to recruit children and their caregivers. Five towns/commu- nities were selected in Song County of Henan Province and Xiaoshan District of Zhejiang Province by simple random sample. Community health services centers and township health centers were study sites. In the centers, we approached and invited parents/guardians bringing children 1-6 years of age for vaccination at the health center to participate in the survey. The lower age limit of the children was one year because all five of the non- NIP vaccines that we used to assess vaccination status should have their first dose administered during the first year of life. Children and their caregivers were included if (1) they have been local residents for >6 months; (2) caregivers had no severe physical or mental health condi- tions; and (3) the accompanying child had no contrain- dications to vaccination. Trained interviewers conducted face-to-face questionnaire-based surveys of caregivers who consented to the study. The target sample size for the survey was based on his- torical coverage levels and desired precision. Using the historical childhood vaccination coverage of non-NIP vaccines of 75.8% and a desired precision of +2% with 95% confidence intervals, and assuming a non-response rate of up to 10.0%, the required number of caregiver with child participants was 1937. The caregiver questionnaire was based on factors known to influence caregiver attitudes towards vaccination. The initial draft of the questionnaire was reviewed by public health experts and immunization providers and modified according to experts feedback and comments. The survey instrument was then pilot tested and further refined. The final questionnaire had five sections: (1) characteristics of the children, including age, sex, place of residence, birth order, and primary caregiver; (2) characteristics of car- egivers, including age, sex, education, and annual house- hold income; and (3) vaccination status of five non-NIP vaccines—Haemophilus influenza b (Hib) vaccine, vari- cella vaccine, rotavirus vaccine, enterovirus 71 vaccine (EV71), and 13-valent pneumococcal vaccine (PCV 13). The primary outcome of our study was coverage of the non-NIP vaccines. Vaccination status was assessed in the questionnaire by asking caregivers to show their chil- dren’s vaccination card. Based on the coverage of differ- ent numbers of vaccines (Table $3), nearly half (49.0%) of children received at least one dose of three or more of the five non-NIP vaccines; for easy interpretation and com- parison, this group were considered vaccinated in the logistic regression; children who received zero, one, or two of the vaccines were considered unvaccinated. Inde- pendent variables were sex and birth order of children. Birth order was coded as first-born, second-born and third-born or later, with first-born children as the refer- ence group. Boys were the reference group for the inde- pendent variable, sex.",
    "We used number and percentage to describe categorical variables and median and interquartile range (IQR) to describe continuous variables. The Kruskal—Wallis test and chi-square test were performed to summarize the sociodemographic characteristics of children and car- egivers according to children’s sex and birth order. The following variables were used as covariates: child age, rural vs urban residence, primary caregivers (parents vs others), sex of caregivers, annual household income (less than average vs more than average), educational attainment of caregivers (junior high school or lower vs senior high school or higher). Annual household income was the sum of wages, salaries, self-employment earn- ings, Social Security benefits, retirement income, invest- ment income, welfare payments, and other income Log-binomial regression models were used to estimate prevalence ratios (PRs) and 95% confidence intervals (CIs) for independent and joint associations between sex and birth order with non-NIP vaccine coverage. To deal with nonconvergence, we used a weighted log-binomial model implemented by the COPY algorithm to enrich the original data set (c = 1000) [27, 28]. For joint analyses, sex and birth order were combined into six categories, using first-born boys as the reference category. Three models were built: (1) a crude model, (2) multivariable model 1 adjusted for age, (3) multivariable model 2 adjusted for place of residence, annual household income, caregivers’ educational attainment, and sex of caregivers. Multiplicative interactions between sex and birth order were evaluated by incorporating a cross-product term to the log-binomial regression models. Additive interac- tions of birth order and sex on non-NIP vaccine coverage were evaluated by calculating the relative excess risk of the interaction (RERI) and the attribution ratio (AP) and interaction index (SI) of the interaction. Estimates of 95% CI were based on the delta method [29, 30]. RERI £0, AP #0 and S# 1 indicated a statistically significant additive interaction effect. The effect of sex on vaccination cover- age was further explored by birth order subgroups, and the effect of birth order by sex subgroupings. Subgroup analysis was conducted to examine the vari- ation of the targeted associations according to children’s place of residence, annual household income, and car- egivers’ education attainment. This analysis was adjusted for child age, place of residence, annual household income, caregivers’ educational attainment, and the sex of caregivers. Statistical significance was set at p< 0.05. Analyses were performed with R (Version 4.3.2, R studio, Boston, Massachusetts) and SAS (Version 9.4, SAS Insti- tute Inc., Cary, NC). The study was conducted according to the guidelines of the Declaration of Helsinki and approved by the Medical Ethics Committee of the School of Public Health, Zheji- ang University (ZGL202206-6). Caregivers electronically signed consent forms for participation. During study recruitment in the vaccination centers, 2366 caregivers bringing their young child to the center for vaccination were approached and recruited into the survey; 2018 consented to participate and completed the survey (an 85.3% response rate). The subjects of the survey were the caregiver and the child being brought for vaccination. Among participants, 370 were excluded because the accompanying child was less than 12 months old; 37 were excluded due to missing information on non-NIP vaccines received or sociodemographic char- acteristics. After exclusions, 1611 caregivers and their accompanying children, aged 1-6 years, were enrolled in the study and comprised the analytic data set (Figure S1). Of the 1611 children included in the analysis, 773 (48.0%) were girls; the median age of the children 3.3 years (interquartile range 2.0—4.8); by birth order, 824 (51.1%) were first-born, 578 (35.9%) were second-born, and 209 (13.0%) were third-born or later. There were no significant sociodemographic differences by sex. Com- pared with first-borns, children who were later born were more likely to live in rural areas and their caregivers were more likely to be parents (rather than grandparents), older, and have lower household income and educational attainment (Table 1). The independent and joint associations of children’s sex and birth order are shown in Fig. 1. Girls had a lower rate of receiving at least three non-NIP vaccines (46.6%) than the boys (51.2%). After adjusting for sociodemographic factors, the PRs (95% CIs) for non-NIP vaccination of girls was 0.94 (0.86-1.03), for second-born children was 0.85 (0.76—0.93) and for the third-born or later children was 0.82 (0.65-1.00). When evaluating coverage by sex and birth order together, the highest non-NIP vaccine coverage was among first-born boys (58.2%), followed by first-born girls (53.6%), second-born boys (47.2%), second-born girls (42.6%), and third-born or later boys (36.0%). The lowest coverage was in third-born or later girls (28.4%). The PRs for non-NIP vaccinations of chil- dren decreased monotonically as birth order increased for boys and girls. For example, compared to first-born boys in multivariable model 2, PRs (95% CIs) were 0.84 (0.74—0.96) for second-born boys, 0.81 (0.69-0.93) for second-born girls, and 0.71 (0.49—0.97) for third-born or later girls.",
    "Table 2 shows interactions among sex and birth order on non-NIP vaccination. Multivariable model 1 found a significant multiplicative interaction between sex and birth order for non-NIP vaccination (p-value for inter- action =0.007 and <0.001) independently of child age, while multivariable model 2 found a multiplicative inter- action between second-born and girls (p-value for inter- action =0.034). No significant additive interactions were found between the second-born or >third-born and girls for non-NIP vaccination, suggesting that the com- bined effect of the two factors was approximately the sum of the estimated values for each factor alone. Further- more, there were no significant differences in vaccination prevalence between boys and girls within the birth order subgroups (Table $4). Lower vaccination prevalence was observed in both boys and girls born third or later within Shown in Fig. 2A, the association between sex and non-NIP vaccination was significant for children living in rural areas (PR: 0.91, 95% CI: 0.83—1.00) and with car- egivers having lower educational attainment (PR: 0.89, 95% CI: 0.81—0.96). For birth order, a significantly lower prevalence of non-NIP vaccination was found in children living in both rural areas (PR in third-born or later: 0.81, 95% CI: 0.67—0.96) and urban areas (PR in second-born: 0.86, 95% CI: 0.79—-0.96, Fig. 2B). Our survey examined associations of sex and birth order with receipt of at least three of five non-NIP vaccines among 1-6-year-olds in China. Girls, compared with boys, and children with later birth order have lower levels of initiation with non-NIP vaccines, particularly in rural areas and with caregivers with lower educational attain- ment. Sex and birth order were jointly associated with non-NIP vaccination, in that girls with later birth order had the lowest prevalence of receiving non-NIP vaccines, compared to first born boys. Multiplicative interaction effects of sex and birth order on non-NIP vaccination were also observed. Our findings are consistent with international litera- ture. A cross-sectional study of 375,548 children found that zero-dose prevalence increased monotonically with increasing birth order [9]. However, joint effects for non- NIP vaccines in China remain poorly understood. Con- sidering the relatively recent change in family planning policy in China, domestic research is especially needed to determine whether sex and birth order jointly influ- ence non-NIP vaccine coverage. Our study addressed this knowledge gap, showing that sex and birth order had a joint effect that aligns with findings in South Asian coun- tries such as Bangladesh and India [24, 25, 31]. Our findings on associations between birth order, sex, and vaccination coverage may be in part explained by human capital theory, which suggests that parents in developing countries often prioritize sons over daugh- ters because sons are perceived to offer greater returns [32-34]. Additionally, patriarchy, which is deeply embed- ded in traditional Chinese culture, could also play a sig- nificant role in shaping such preferences [35]. According to quantity-quality trade-off theory, as the number of siblings increases, the average quality (e.g., health sta- tus) per child tends to decline within a fixed household budget [18]. Consequently, parents must make decisions on allocation of resources and time, which can influence the interaction of sex and birth order. Our results sug- gested that to improve the uptake of non-NIP vaccines and promote vaccine equity, it is important to prioritize Fig. 1 Coverage, prevalence ratios (PRs) and 95% confidence intervals (Cls) for the independent and joint associations of sex and birth order of children with non-NIP vaccination. Multivariable model 1 adjusted children’s age, and multivariable model 2 adjusted children’s age, place of residence, annual household income, caregivers’ educational attainment, and interviewee's sex. In independent association analysis, children’s sex and birth order were adjusted for each other. Children who received more than three of the five vaccines were defined as vaccinated Multivariable model 1 adjusted children’s age, and multivariable model 2 adjusted children’s age, place of residence, annual household income, caregivers’ educational attainment, and interviewee’s sex Subgroup analyses showed that associations of sex and birth order with non-NIP vaccination were more pro- nounced in children living in rural areas, and with car- egivers having less educational attainment, consistent with other studies. For example, a study at the Interna- tional Centre for Diarrhoeal Disease Research (icddr,b) in Bangladesh found that sex differences in vaccination rates were more pronounced among children whose mothers did not complete high school [24]. A multi-country study found a rural-urban gap in childhood immunization, with urban children being more likely to complete vaccina- tion schedules [8]. These findings highlight the need for targeted interventions to address socioeconomic dispari- ties in healthcare access, thereby promoting vaccination equity. In recent years, the World Health Organization's Immunization Agenda 2030 and Gavi Strategy 5.0 have core focuses on reaching zero-dose children and increas- ing equitable use of vaccines, proposing a goal of “leaving no one behind” [36, 37]. Children with socioeconomic disadvantage should therefore be prioritized in the pro- motion of non-NIP vaccination in China. Initiatives such as community-based outreach programs, mobile vaccina- tion clinics, and education campaigns targeting caregiv- ers can help narrow the vaccination gap and ensure all children receive life-saving vaccines [38, 39]. In the long term, given the link between education and vaccination status and beyond a strategic focus on enhancing vaccine access, it is critical that we also focus on empowering girls and women and support their overall literacy and health literacy.",
    "A strength of our study is that is provides valuable insights into two important determinants of non-NIP vaccination coverage among children in China that can help target improvements in vaccination equity. There are several limitations to our study. First, the cross-sectional design limits our ability to establish causal relationships between sex, birth order, non-NIP vaccination, and the potential effects of demographic characteristics. How- ever, there is no reasonable experimental design that could establish such causality. Second, the study sample may not be fully representative of target population out- side of the study provinces, and the recruitment tech- nique has some potential for selection bias. Third, our study focused on only five non-NIP vaccines (Hib, vari- cella, rotavirus, EV71, and PCV13), and information on several other common non-NIP vaccines, such as influ- enza vaccine, would need to be gained in future studies. Fourth, our analysis lacks insurance data because the studied non-NIP vaccines in Zhejiang/Henan were pre- dominantly self-paid, with minimal insurance. Findings may not generalize to vaccines with insurance-covered in some regions. Fifth, while the sample size was calculated based on the main analysis, hence the subgroup analyses may lack sufficient statistical power to detect differences, these results should be interpreted with caution. Fur- ther studies with large sample size are warranted. Pro- spective and experimental studies are needed to explore underlying mechanisms driving vaccination disparities and assess the effectiveness of interventions for reducing inequalities. In conclusion, birth order of young children was inde- pendently associated with non-NIP vaccines coverage, whereas sex showed no significant. Additionally, sex and birth order are jointly associated with it, with later born children and girls having significantly lower coverage. Socioeconomic factors such as children’s place of resi- dence and caregivers’ educational attainment modified the associations. These findings underscore the need for targeted interventions to address disparities in coverage with non-NIP vaccines to promote vaccine equity among vulnerable populations in the context of significantly changed fertility policies in China. We thank all the participants, and the team members who contributed to the success of the study. The work reported in this publication is part of the research program entitled “Innovation Lab of Vaccine Delivery Research’, hosted at Duke Kunshan University and supported by the Bill & Melinda Gates Foundation (INV-034554). The work is also supported in part by a research grant from the Investigators Studies Research Program of MSD. The opinions expressed in this paper are those of the investigators and do not necessarily represent those of MSD. XX supervised the study, and contributed to the study design and concep- tualization of the manuscript. XX and YZ conducted and implemented the questionnaires. XX, YZ, and HC have full access to all of the data in the study and take responsibility for the integrity of the data. HC contributed to data analysis, figure production and drafted the manuscript. YZ, AHD, YW, QL, HS, ST and XX revised the manuscript. All authors read and approved the final manuscript before submission Zhejiang University School of Public Health Medicine Ethics Committees approved the study protocol (ZGL202206-6). All participants were informed about the aims and procedures of the study, and provided informed consent. This study was conducted according to the guidelines of the Declaration of Helsinki School of Public Health, The Second Affiliated Hospital, Zhejiang University School of Medicine, Yuhangtang Road 866, Hangzhou 310058, Zhejiang, China. *The Key Laboratory of Intelligent Preventive Medicine of Zhejiang Province, Hangzhou, Zhejiang, China. *China Country Office, Bill & Melinda Gates Foundation, Beijing, China. “Global Health Research Center, Division of Social Sciences, Duke Kunshan University, Kunshan, Jiangsu, China. °Global Health Research Center, Duke Kunshan University, Kunshan, Jiangsu, China. ®School of Population Health, Faculty of Medicine and Health, University of New South Wales, Sydney, Australia. ’Duke Global Health Institute, Duke University, Durham, NC, USA. 8singHealth Duke-NUS Global Health Institute, Duke-NUS, Singapore, Singapore. School of Public Health, Faculty of Medi- cine, The University of Queensland, Brisbane, Australia."
]