[
    "Background Integrated care services have been initiated in China for several years, yet there remains a dearth of substantial evidence and research elucidating the service's efficacy, particularly in underdeveloped areas. This study aims to address this gap by evaluating the effectiveness of integrated care from the patients’ perspective, thereby offering practical strategies to improve service effectiveness and promote health equity within county medical alliances. Methods The Patient Perceptions of Integrated Care (PPIC) and European Quality of Life-5 Dimensions-5 Levels (EQ- 5D-5 L) scales were employed to gather information on patients’ perceptions of integrated care and their self-rated health status. A total of 1093 respondents from two pilot areas were selected for data collection. T-tests and one- way analysis of variance (ANOVA) were recruited, additionally, the study utilized multiple linear regression models to examine the specific impact of various factors on the effectiveness of integrated care services. Results The average score for the effectiveness of integrated healthcare services from the patients’ perspective was 67.72 (SD= 14.443, n= 1093). Statistical analysis revealed that as the respondents’ age increased and their self- rated health declined, the PPIC scores showed an upward trend. Regression analysis found that factors such as age, education level, income, health status, and level of healthcare intervention significantly influenced PPIC scores. Overall, there is a trend where respondents with higher health needs tend to have higher perceptions of the service, while those with relatively higher socioeconomic status are more likely to provide lower ratings. Additionally, increasing the frequency and duration of healthcare interventions can improve respondents’ evaluations of the services. Conclusions This study analyzes the effectiveness of integrated services in China's county-level medical alliance from the patients’ perspective. It finds progress in resource integration and efficiency but identifies limitations in implementation, particularly in balancing equity. Socio-economic factors continue to affect the fairness of service utilization and patient satisfaction. Constraints in finance, human capital, and technology hinder the provision of more targeted services for vulnerable groups. To promote health equity, future services need to focus more on key populations and provide more targeted services, accelerate the integration of information technology, and expand service coverage to address the diverse needs of marginalized communities. © The Author(s) 2025. Open Access This article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Cornmons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit http//creati vecommonsorg/licenses/by-nc-nd/4.0/. The aging population and the rising prevalence of chronic non-communicable diseases in China are rap- idly expanding. Such surge has escalated the demand for healthcare services, placing considerable strain on the system [1-3]. However, high-quality medical resources remain concentrated in urban areas, leaving rural regions with inadequate primary healthcare services. This dispar- ity exacerbates the phenomenon of “the large get larger and the small get smaller” [4]. As a result, patients are increasingly turning to large public hospitals, leading to unnecessary medical expenditures, which not only add to their financial burden but also contribute to the overall escalation of healthcare costs [5]. In response, the government has been focusing on refining medical insurance payment mechanisms to miti- gate healthcare expenditures, including the adoption of Diagnosis-Related Groups (DRGs) healthcare, which commenced comprehensive pilot testing in China as early as 2016. Moreover, there is a concerted effort towards the adoption of integrated medical services as a key strategy to strengthen the healthcare infrastructure and enhance medical service capacity. This shift signifies a transition from a treatment-centric model to a more health-centric approach, marking a fundamental change in healthcare delivery in China [6].",
    "Integrated care (IC), a concept that has gained global attention since the 1990s [7], aims to improve patient experiences, population health, promote health equity, and reduce per capita healthcare costs through clinical, organizational, and policy adjustments [8, 9]. However, the definition and implementation of integrated care vary across different countries due to divergent healthcare systems [10]. For example, in Germany, government- led disease management plans drive integration, while in the United States, a market-driven approach, includ- ing mergers and partnerships, dominates the integration strategy [11]. The discourse on integrated care has led to the iden- tification of key elements, resulting in robust theoreti- cal frameworks and operational standards. At its core, integrated care emphasizes a patient-centered philoso- phy, ensuring that services are continuous, coordinated, and tailored to the specific health needs of individuals (12, 13]. Furthermore, integrated care involves organi- zational, functional, personnel, clinical, and system-level integration [14, 15]. It stresses the importance of ser- vice coordination and continuity, ensuring that care is appropriate and effective at each stage of the patient’s life [16]. The World Health Organization (WHO) defined integrated care as follows: “an approach to strengthen patient-centered health systems through the promotion of the comprehensive delivery of quality services across the life-course, designed according to the multidimen- sional needs of the population and the individual and delivered by a coordinated multidisciplinary team of pro- viders working across settings and levels of care” [17]. In recent years, China has expanded pilot programs for integrated care services to improve its healthcare sys- tem and enhance service efficiency [18]. These integrated care models can be broadly categorized into two types based on the degree of institutional integration: tightly integrated models, such as urban medical groups and County-level Medical Alliances, and loosely integrated models, including cross-regional specialist alliances and telemedicine networks [19]. Despite the growing adop- tion of integrated care in China, most research on its effectiveness has focused on urban areas, such as Luohu Medical Group in Shenzhen [20, 21], and Zhejiang’s com- munity Healthcare centers [22], offering valuable insights into the accessibility, safety, and cost-effectiveness. of integrated care. Yet, there is a notable gap in research on underdeveloped regions [23], where integrated care models are particularly crucial for improving healthcare delivery. Therefore, the study concentrates on Henan province, one of the largest and most populous provinces in China. For the pilot programs in this province are highly rep- resentative of underdeveloped areas and offer valuable insights that can be applied to other regions across China [26]. The province has undertaken significant measures to promote healthcare resource integration, with a particu- lar focus on establishing County-level Medical Alliances. These reforms are guided by clear policies emphasizing group-based management, integrated operations, and continuous service delivery. Unified management spans key areas such as administration, staffing, medical ser- vices, pharmaceuticals, finance, performance evaluation, and information systems. By integrating hospitals, com- munity healthcare centers, and township health clinics, these alliances establish a cohesive system that promotes resource sharing, optimizes utilization, and fosters col- laboration across healthcare providers. Within this sys- tem, interdisciplinary care teams have been formed, consisting of professionals from general medicine, nurs- ing, traditional Chinese medicine, public health, and pharmacy. These teams play a crucial role in ensuring the holistic health and well-being of patients [24, 25]. Besides, most evaluations have centered on the views of project implementers and service providers, with limited attention given to the beneficiaries of these ser- vices- the patients themselves [5, 26, 27]. This study aims to address this gap by examining how demographic dif- ferences and population health levels influence patients’ perceptions of integrated care, with a particular focus on the effectiveness of tightly-knit county medical alli- ance. By prioritizing patient-centered evaluations, this research will provide deeper insights into how integrated care can either alleviate or exacerbate health inequalities, especially in underdeveloped areas with limited access to quality care. A questionnaire survey was conducted in two represen- tative regions of Henan Province. These regions imple- mented integrated care policies between 2018 and 2019 and share comparable levels of social development. Addi- tionally, both regions have established multi-faceted, capitation-based healthcare payment systems. The ques- tionnaire consisted of three main sections: patient demo- graphics, which gathered basic information about the respondents; the Patient Perceptions of Integrated Care scale, designed to assess patients’ views on the integrated care services; and the European Quality of Life-5 Dimen- sions-5 Levels (EQ-5D-5 L) scale, which evaluated their self-reported health status.",
    "To evaluate the effectiveness of integrated care services for chronic diseases from patients’ perspective, this study introduced the Patient Perceptions of Integrated Care (PPIC) developed and validated by Professor Singer’s research team in the United States [28]. The PPIC scale, specifically designed to investigate the integrated care experiences of chronic patients, has undergone rigor- ous validation to ensure the accuracy and reliability of its content, as well as its structural validity and internal consistency. Following cross-cultural validation across various contexts, including the Netherland, and Spain, among other regions, the scale has demonstrated robust cultural applicability [29]. The scale’s adaptation and refinement were rigorously conducted per the guide- lines for cross-cultural adaptation of international scales. A version tailored to the Chinese cultural context was developed, which includes 37 items. A total of 520 questionnaires were collected to con- duct reliability and validity tests. In addition, exploratory factor analysis (EFA) was employed to assess the struc- tural validity of the scale. The analysis revealed a Kaiser- Meyer-Olkin (KMO) measure of sampling adequacy value of 0.895 and a significant Bartlett’s sphericity test statistic of 6723.760 (df=351, P < 0.001), confirming that the scale met the prerequisites for factor analysis. Fol- lowing rotation using the maximum variance method, Cronbach's a coefficient for the scale was determined to be 0.901. A total of 6 common factors were extracted, aligning with the dimensions proposed by the scale’s developers, demonstrating the solid structural validity of the translated version. The six dimensions and their cor- responding meanings are based on the structural dimen- sions defined in the original scale [28, 30] and adapted to China's existing healthcare system. These dimensions are presented in Table 1. Additionally, the examination results revealed that the six dimensions explained a cumulative percentage of the total variance of 69.283%. Cronbach’s a coefficients for each dimension ranged between 0.754 and 0.930, exhib- iting strong internal consistency. Furthermore, the study employed AMOS 26.0 to conduct confirmatory factor analysis. The average variance extracted (AVE) values for factor loadings in each dimension were all above 0.5, and the composite reliability (CR) values were all above 0.8, indicating that the construct validity of the scale passed basic tests for convergent validity. The results of the discriminant validity test for the baseline model revealed favorable fit indices( x’/df = 2.003, CFI=0.961, RMSEA = 0.044, TLI=0.952, IFI=0.962), meeting the adaptation requirements and demonstrating good dis- criminant validity among the variables [31]. To determine the respondents’ health status, the Euro- pean Quality of Life-5 Dimensions-5 Levels (EQ-5D-5 L) were incorporated into the questionnaire. Widely used for health status evaluation, this tool includes a con- cise descriptive system and a EuroQol-visual analog scale (EQ-VAS) [32]. It was Originally introduced by the EuroQol Group in 2009, and covers five dimensions: mobility, self-care, usual activities, pain/discomfort and anxiety/depression. Each dimension comprises five response options: no problems, slight problems, moder- ate problems, severe problems and extreme problems. Compared to the 3D-3 L version, it offers enhanced sen- sitivity and lower ceiling effects by increasing the number of severity levels [33, 34]. The EQ-VAS provides an easy self-assessment, with a scale from 0 (the worst health imaginable) to 100 (the best health imaginable). Known ‘or its simplicity, versatility, and ability to generate quan- tifiable health data, the EQ-5D-5 L is an effective tool for assessing and comparing health-related quality of life [35, 36]. This study utilizes EQ-5D index data for comparing ealth disparities and EQ-VAS scores as self-reported ealth outcomes to explore how health levels impact atients’ perceptions of integrated care. The study randomly selected one tightly-knit county- level medical alliance from each of the two pilot cities as research sites, and the fieldwork was carried out in December, 2023. Within each selected county medical alliance, 6 primary health service institutions were ran- domly chosen for the survey, including two community healthcare centers and four township hospitals. Then, three family doctor teams were randomly selected from each institution, and 100 questionnaires were distributed based on a quota system, with distribution proportional to the number of signed patients in each team. All participants provided informed consent prior to their involvement in the study. Several respondents’ selection criteria were established for our respondents: (1) Respondents had to be beneficiaries of integrated care services in the last 6months (2) Respondents needed to be at least 18 years old. (3) Respondents should have a comprehensive understanding of the survey ques- tions. (4) Respondents should be able to express their viewpoints accurately and clearly. In addition, consider- ing most of our study participants were older individu- als with chronic conditions, we utilized paper-based or electronic questionnaires and personalized one-on-one data input assistance. It guaranteed that the gathered information was based on the respondents’ intentions, thus elevating the data quality. In the study’s first phase in 2023, the research team distributed a total of 1,200 questionnaires and successfully collected 1125 responses, achieving a response rate of 93.75%. Additionally, 32 samples were excluded with missing, ambiguous, or logically inconsistent, including invalid questionnaires where more than 80% of the selected options were identi- cal or where there were evident contradictions between responses across questions. Finally, 1093 (97.16%) quali- fied in this Following the guidelines set forth by the Consumer Assessment of Healthcare Providers and Systems (CAHPS), the PPIC scoring criteria can be divided into three primary types [37]. Items measuring integrated care used 4-point (never, sometimes, often, always), 3-point (Never, sometimes, always), or binary (yes/no) response frames. When respondents choose to skip questions within the scale, all sub-items under the main item are assigned a score of 0 points. Additionally, to ensure authentic feedback from respon- dents, questions 20 and 21 are designed for reverse scor- ing. The total score for the scale amounts to 130 points, A higher score indicates better quality of services from the perspective of patients.",
    "This study employed a comprehensive approach to data analysis, combining descriptive statistical analysis with inferential statistical analysis methods. Demographic information was utilized to categorize patients logically according to their health status. Comparative analyses across different patient groups were conducted using t-tests and one-way analysis of variance (ANOVA) to discern significant differences in the effectiveness of inte- grated care services. Furthermore, the study employed multiple linear regression models to assess the impact of various factors on the effectiveness of integrated care services. Specifically, the analysis focused on two sets of independent variables: demographic characteristics, including age, marital status, and income, and health- related factors, encompassing patients’ self-reported health status and the interventions provided by the inte- grated care team. This approach enabled a more detailed examination of how different factors influenced the outcomes related to integrated care services. Statistical analyses were conducted using SPSS version 20 software. Statistical significance was defined as 0.05. Respondents in this study were all recruited from com- munities and rural areas in pilot cities, which are rela- tively disadvantaged region of China. As illustrated in Table 2. Notably, most respondents were aged 31 and above, making up approximately 94.64% of the sample. Among this respondent group, females constitute 64.73%, while 77.09% of respondents have an educational back- ground of junior high school or lower, with a minority holding a college degree or higher. Furthermore, approxi- mately 81% of the respondents are permanent rural resi- dents, and 67.18% were primarily engaged in farming. This occupational distribution closely corresponds to Notes: Some numbers of Percentage do not sum to the total number of observations or the total number of the weighted population due to rounding errors Additionally, the collected data provides insights into respondents’ overall health status and critical informa- tion about integrated care services. For example, 41.54% of respondents reported having chronic diseases. Within the respondent group, 954 individuals had received inte- grated services for more than three years, constituting 87.28% of the sample. Approximately 63.40% of respon- dents proactively sought guidance from medical groups across healthcare areas, encompassing preventive mea- sures, disease diagnosis, treatment, and rehabilitation. In summary, the fundamental data collected portrays the overall conditions of respondents in the pilot area, offering an objective depiction of their living and health standards. The analysis of 1,093 samples revealed a range of PPIC scores from 27 to 117(with a maximum score of 130). The average score was 67.72 (SD = 14.44, n= 1093), which is below the median score of 69. To provide a clearer picture of the score distribution, the study applied a standard scoring method, dividing the scores into four distinct tiers based on their distribution: poor (< 40), fair (41-70), good (71-100), and excellent (100-130). The “fair” level constitutes the most significant proportion, with a cumulative count of 576 individuals (52.70%), a majority representation within the sample. Moreover, 477 individuals (43.64%) achieved scores of ‘Good’ or higher (>70), showcasing a notable portion of participants who perceived integrated care positively. Conversely, individ- uals scoring below 40, totaling 40 individuals (3.66%), are indicative of experiencing poor service quality, highlight- ing the need for remedial actions in care delivery. Across various scoring dimensions, Dimension 4 (Familiarity with the patient over time) and Dimension 6 (Patient centeredness) achieved total scores of 12 and 16, respectively. However, their mean scores were 8.55 (SD = 2.295) and 13.75 (SD = 2.518), indicating a relatively high overall evaluation level for these two dimensions. In addition, Dimension 2 (Coordination within care team) and Dimension 5 (Guidance on self-management of health for patients.) demonstrated acceptable evaluation results, with total scores of 10 and 30, and mean scores of 6.31 (SD=2.105) and 20.20 (SD=6.956), respectively. However, Dimension 1 (proactive and responsive action between visits) and Dimension 3 (Coordination across care teams) exhibited significantly lower scores. Despite their total scores of 40 and 20, respectively, their mean scores were only 12.93 (SD = 5.333) and 5.96 (SD = 2.972), placing them at the first quartile level. The study investigated the physical health status of the respondents using the EQ-5D-5 L scale. The results indi- cated that the average self-rated health score of the 1,093 participants was 87.79 (SD = 12.479, n=1093), reflecting generally favorable health perceptions. A decline in self- rated health was observed with advancing age, whereas the PPIC score showed a gradual increase with age, as illustrated in Fig. 1. To further examine the relationship between health status and perceived PPIC levels, Pearson correlation analysis was conducted. The analysis revealed a statistically significant negative correlation between the two variables (r = -0.092, P=0.002).",
    "Table 3 Presents the results of EQ-5D index, where respondents mostly rated their health status as either “no problems” or “slight problems” Notably, except for the “pain/discomfort” dimension, over 86.27% of respon- dents reported no issues across all health dimensions. This observation reflects a prevailing optimistic outlook among respondents regarding their health. Additionally, none of the respondents reported experiencing “extreme problems” in the “anxiety/depression” dimension. The presence of “slight problems” was mainly noted in the “mobility” and “pain/discomfort” dimensions, with the vast majority of respondents (P= 95.15%, n= 1040) indi- cating no issues in the “self-care” dimension. In summary, this analysis sheds light on respondents’ overall positive perception of health status, with minor issues predomi- nantly observed in the mobility and pain/discomfort dimensions Furthermore, the study revealed a significant impact of chronic diseases on patients’ self-rated health. Of the 1093 individuals surveyed, 454 had been diag- nosed with chronic diseases. Data analysis revealed that individuals with a single chronic disease achieved an average PPIC score of 70.99 (n=294, SD=13.267). In contrast, those with two chronic diseases scored 73.12 (n= 113, SD = 15.243), and individuals with three chronic diseases(those with diseases above three were excluded due to limited quantity)with an averaged a score of 78.80 (n=35, SD = 13.299). This study conducted a comparative analysis of patients’ perceived effectiveness using both the ft test and ANOVA. Significant disparities emerged among respon- dents across various demographic categories, such as age, education level, income, and health status, underscoring the multifaceted nature of their perceptions. However, no significant differences were observed in pilot city, resi- dential location, or gender. There were substantial differ- ences in the perception of integrated services between respondents with chronic diseases and those without chronic diseases (¢= 8.838, P< 0.001). To further understand the factors influencing patients’ PPIC perception levels, the study categorized the research subjects into groups based on demographic information and health status across various dimen- sions (such as activity level and illness condition). Subsequently, as illustrated in the Table 4. Intergroup differences in occupation (F=4.147, P<0.001), income level (F=6.327, P=0.002), and education level (F=9.942, Furthermore, the intergroup variances of health-related factors, such as health status (F= 4.036, P=0.004), dura- tion of chronic diseases (F= 23.725, P< 0.001), frequency of patients’ health inquiries (F=45.581, P<0.001), fre- quency of drinking (F=23.725, P=0.002) and smoking (F=6.503, P=0.002), were validated through statistical analysis, which revealed significant intergroup differ- ences. Despite a marginal upward trend in PPIC scores observed with increasing chronic diseases, the differen- tial analysis conducted by grouping chronic diseases did not yield statistically significant results. A multiple linear regression model was employed to examine the key factors influencing patients’ percep- tions of integrated care services. The residuals indicated approximate independence, with an adjusted R-squared value of 0.305 for the model. Subsequently, the research identified nine covariates as statistically significant and were integrated into the model (F= 16.489, P< 0.001). As shown in the Table 5. Several demographic and health-related factors signifi- cantly influenced the evaluation of integrated services. Age was positively associated with service evaluation (B=0.093, P=0.008), indicating that older individuals tended to rate the services more favorably. Marital status also played a role, with married individuals providing more positive ratings (B=1.602, P=0.003) than those . . . who were single, widowed, or divorced. Government or public sector employees evaluated services less favorably than those in farming occupations (B = -8.160, P< 0.001), while retired individuals reported higher satisfaction (B=2.264, P=0.091). Moreover, individuals earning more than 5000 RMB per month gave lower ratings (B = -5.970, P=0.013) compared to those earning less than 1000 RMB. Health-related factors also played a significant role in shaping service evaluations. Individuals who rated their health status higher were more likely to give lower ser- vice ratings (B = -0.072, P=0.026). Among those with chronic conditions, longer disease duration was associ- ated with more favorable evaluations, with individuals suffering for more than three years providing higher rat- ings (B=4.759, P<0.001). The duration of integrated care services also had a positive impact on service evaluations, with patients receiving care for more than three years offering significantly higher ratings (B= 14.017, P< 0.001). Similarly, respondents who had frequent interactions with healthcare providers gave significantly higher rat- ings (B= 19.063, P<0.001).",
    "The integrated care services reform aims to optimize resource allocation, improve the accessibility and effi- ciency of healthcare services, and promote health equity. However, based on the results of this study, while in the pilot regions have improved the health levels and service utilization opportunities for some patients to a certain extent, there remain significant disparities in the effects of these services across different groups. This under- scores the need for greater attention to the risks of health inequities that may arise during the implementation of the integrated care model. Due to the unified provincial policy deployment and the similar socio-economic development foundations of the two pilot regions, this study found no significant differ- ences in patient perceptions of services between the two areas. On the whole, the average score for the effective- ness of integrated care services from the patients’ per- spective was 67.72 points (SD = 14.443, n= 1093), which is below the median score of 69 and still far from the maximum possible score of 130. This suggests that there is substantial room for improvement in service effective- ness. The challenges to integration are driven by factors such as system complexity, the diversity of patient needs, weak interconnections among professionals and organi- zations, insufficient funding incentives for collaboration, and bureaucratic management styles. These factors are consistent with earlier studies in Canada that highlighted similar barriers to integration [38]. It is evident that structural integration alone may not be sufficient to deliver care perceived as truly integrated by patients [39, 40]. Different integration strategies can yield varying perceptions across populations, as shown by pilot programs in England, where diverse approaches were employed to address the needs of specific tar- get groups. While some patients reported improved experiences, others saw no change or even worse out- comes [10]. In this study, respondents’ evaluations of “proactive and responsive actions between visits” and “coordination across care teams” within integrated ser- vice teams were notably subdued, likely due to staffing shortages within the medical service teams. Significant deficiencies in personnel allocation, particularly in teams operating below the township level, were observed. Team members often juggle multiple roles, compromising the delivery of primary healthcare services [41]. With a large number of patients to care for, integrated care teams struggle to meet each individual’s needs and provide timely and effective services. Additionally, the distance between townships and county-level hospitals further limits access to higher-level healthcare support. This highlights that the integrated care services in the current pilot regions are still at a relatively basic level. The insufficient service capacity due to a lack of spe- cialized professionals in fields such as public health and traditional Chinese medicine represents a significant challenge faced by the ongoing reforms. These findings align with concerns raised by Li regarding the potential future shortage of village doctors. The aging and high turnover rates of village doctors pose a serious threat to the stability of the primary healthcare workforce [42]. Therefore, it is recommended that health service teams at different levels collaborate through various means, such as skill training and business guidance, to support each other in providing services to contracted residents [43]. This collaboration should consistently prioritize patient- centered care and be closely aligned with government initiatives that promote integration and incentivize coop- eration within medical communities [44]. Such efforts are poised to not only enhance patients’ perceptions of integrated services but also contribute significantly to improving their overall health outcomes [45]. Research has unveiled nuanced relationships between patient demographics and perceptions of integrated care, highlighting a complex interplay between social factors, personal health status, healthcare utilization, and service evaluations, while also revealing potential risks of health inequity. The findings indicate that a patient’s socioeco- nomic status significantly influences both their health outcomes and access to healthcare services. Patients from lower socioeconomic backgrounds often face numerous barriers during the integration of services, such as lim- ited financial resources, difficulty accessing information, and lower health literacy. Further analysis of how differ- ent patient groups perceive the effectiveness of services reveals that those with lower levels of education tend to rate integrated care services more positively. This may be because education level affects individuals’ basic health literacy, their understanding of medical services, and their expectations regarding service outcomes [46, 47].",
    "Moreover, factors such as occupation and income level play a critical role in shaping service perceptions. For instance, individuals employed in government, institu- tional, or enterprise sectors—who generally enjoy higher income and better benefits—tend to evaluate integrated care services more negatively than those working in agriculture. Similarly, individuals with monthly incomes above 5,000 RMB provide significantly lower ratings for the services compared to those earning below 1,000 RMB. This finding aligns with the research of Darin- Mattsson et al. [47], which indicates a close association between income and health outcomes in later life. In general, individuals with higher socioeconomic sta- tus tend to adopt more critical perspectives regarding healthcare services. It is suggested that the divergence in perceptions stems from a mismatch between individu- als’ expectations and the primary healthcare interven- tions typically offered by integrated care teams, resulting in lower satisfaction levels [48]. A cross-racial study also found that Black and Hispanic beneficiaries reported higher satisfaction with integrated care compared to White beneficiaries, underscoring the significant role of socioeconomic status and healthcare accessibility across different demographic groups [49]. Furthermore, the study reveals that while the current model of integrated care focuses on resource integra- tion, efficiency improvement, and standardization, it falls short in terms of achieving service equity, particu- larly for vulnerable populations with special healthcare needs. The current integrated services tend to be some- what generic, often lacking a thorough assessment of the specific health needs of these vulnerable groups. As a result, the health needs of these populations often remain unmet, leading to a combination of resource wastage and insufficient service delivery, which inadvertently exacer- bates health inequity risks. In line with this, the results show that individuals with poorer health, older age, and fewer social supports tend to rate the effectiveness of integrated services more posi- tively. In other words, older participants, whose health- care needs escalate due to aging, are more likely to perceive integrated services favorably. This finding is fur- ther supported by a subtle negative correlation between respondents’ positive self-assessments of health and their evaluations of integrated care’s effectiveness. Those with poorer health perceptions seem to appreciate inte- grated care more, suggesting that integrated care services may better align with the needs of individuals in poorer health, as seen in previous research [50—52].Moreover, widowed residents, especially older individuals, tended to provide less favorable feedback on integrated care services. Previous studies have shown that widowhood, considered one of the most distressing transitions for older adults, often leaves individuals without the life care, social support, and emotional solace typically provided by a spouse [53]. Due to the complex emotional chal- lenges faced by widowed individuals, marital status will significantly influences healthcare experiences [54—56]. Consequently, this group may have an elevated need for both health and psychological care, highlighting the need for integrated care services to better address their spe- cific requirements. Efforts to advance integrated care should prioritize high- health-needs populations while balancing service integra- tion with health equity. The study revealed that patients with chronic conditions tended to provide more favor- able evaluations of integrated care services. Moreover, satisfaction with these services increased as the number of chronic comorbidities rose. This may be attributed to the fact that individuals with chronic diseases face con- siderable daily challenges, with integrated care more effectively meeting their complex healthcare need [57]. Similarly, the study also found that Patients with lon- ger illness durations and higher interaction frequencies tended to provide more positive assessments of the ser- vice effectiveness. These findings align with the viewpoint of the PPIC scale developers: “Theoretically, they were the most likely to benefit from improved integration. Patients with higher needs perceived more, rather than less, inte- grated care’ ‘ [58]. While patients with inadequate health support and services that do not align with their specific needs, frustration tends to arise [59]. Given the significant role these factors play, what influ- ences the frequency of patients’ service interactions? How does the interaction frequencies of integrated care service relate to the equity of the integrated care system? Several key issues identified in this study. On one hand, residents in remote rural areas or those with limited access to healthcare resources may struggle to receive timely and effective services, leading to reduced utiliza- tion and, consequently, lower levels of satisfaction. On the other hand, since integrated services are primarily led by county-level hospitals, patients in rural townships may experience reduced access to high-quality health- care services in their local areas. This could exacerbate the upward referral of patients from primary medical institutions, creating a siphoning effect. This would, in turn, increase the medical costs and financial burden on low-income patients living in remote rural areas, fur- ther contributing to health inequity. These issues must be addressed to improve the fairness and effectiveness of integrated services in the future.",
    "Therefore, healthcare providers must take into account both key populations and marginalized groups, focusing on their unique health statuses and needs. By prioritiz- ing patient-centered care and offering tailored interven- tions, healthcare systems can better address the complex needs of patients, optimizing service delivery, ensuring health equity, and enhancing both service effectiveness and patient satisfaction [60, 61]. Additionally, attention should be given to newly diagnosed individuals, gradu- ally increasing their ability to manage their health inter- ventions and alleviating the anxiety and stress associated with their diagnosis. For generally healthy individuals who do not require extensive health interventions, ser- vices like medication guidance and follow-ups should focus on health testing and disease prevention. This can save valuable resources while reducing healthcare inequalities [62]. To enhance integrated healthcare services and pro- mote health equity, several key areas must be optimized moving forward. First, services should be stratified and tailored to meet the diverse needs of low-income popu- lations and those with specific health conditions. This approach should be closely aligned with government pol- icies and healthcare reforms to address gaps in healthcare access for vulnerable groups. Second, expanding incen- tive measures to attract skilled professionals and clarify- ing individual responsibilities will strengthen teamwork. Accelerating the adoption of information technology to improve organizational management can foster better collaboration among teams, thereby extending health- care coverage and addressing the scarcity of resources in remote areas [41, 63]. Personalized health services should be prioritized for key groups, such as elderly individuals living alone and patients with chronic diseases. Lastly, strengthening health education through integrated ser- vice networks will enhance health literacy, promote effec- tive communication between providers and patients, and build long-lasting trust [64]. While this study has illuminated several issues within the field, it is essential to acknowledge its limitations. First, the issues identified in this study may only partially reflect the situation in the pilot areas. Future research could address this limitation by extending the study’s duration and increasing the number of pilot sites, thereby gaining deeper insights into the effectiveness of inte- grated services. Second, our study primarily focused on assessing the effectiveness of integrated services from the patient’s perspective. However, existing research suggests that the structural characteristics of medical teams may have a limited impact on patients’ perceptions of inte- grated care [65, 66]. Given the unique context of health- care reform and medical insurance payments in China, further investigation is warranted to explore whether the characteristics and overall service capabilities have This study focuses on China’s distinctive model of inte- grated primary healthcare—the tightly-knit county medi- cal alliance. It offers an in-depth analysis of the system’s characteristics, structure, and implementation outcomes. The findings of this study reveal that although the cur- rent model of integrated care has made some progress in resource integration and efficiency enhancement, its overall performance remains limited. Disparities in service utilization and patient satisfaction are still sig- nificantly influenced by socio-economic factors. Addi- tionally, existing integrated care services continue to face constraints in areas such as financial resources, human capital, and information technology, fails to adequately meet the needs of vulnerable populations, including the elderly, individuals with chronic diseases, and those liv- ing alone. These unmet needs point to systemic inequi- ties that warrant ongoing attention. To achieve broader health equity, policymakers should prioritize service inte- gration for disadvantaged groups, focusing on the diverse needs of marginalized communities. PPIC Patient Perception of Integrated Care EQ-5D-5L_ European Quality of Life-5 Dimensions-5 Levels EQ-VAS European Quality of Life-Visual Analog Scale CAHPS Consumer Assessment of Healthcare Providers and System H.K,, Y.G. and H.B. contributed to the design of this study. H.K. led the writing for the manuscript and drew all the figures and tables. H.K,, ¥.G. and X.Y. completed questionnaire translation and data collection. X.Y. performed the validation of questionnaire. H.B. supervised the project. All authors reviewed and revised the manuscript and agreed to the submission of the final manuscript. The study was conducted in accordance with the principles established in the Declaration of Helsinki. It primarily focused on patients’ perceptions of integrated care services, with participation being entirely voluntary and anonymous during data collection. Hence, formal approval from the ethical review authority was deemed unnecessary. We ensured that informed consent was obtained from all participants, and strict measures were taken to maintain the confidentiality of participant data throughout the research process. All surveys received approval from School of Medicine and Health Management, Tongji Medical College, Huazhong University of Science and Technology.",
    "'School of Medicine and Health Management, Tongji Medical College, Huazhong University of Science and Technology, Wuhan, China ?Research Center for Hospital High Quality Development, Tongji Medical College, Huazhong University of Science and Technology, Wuhan, China"
]