[
    "The relationship between traditional village landscape genes and the geographical environment is closely intertwined, exhibiting notable spatial differences and cultural characteristics during scale transformations. To effectively elucidate the formation mechanisms of these landscape genes, it is essential to construct a multi-scale analytical framework that integrates multiple dimensions. This paper address these challenges by expanding the sample selection range and combining both qualitative and quantitative analyses of landscape genes across various scales. Subjective judgments reveal that macro conditions influence microscopic responses, which, in turn impact outcomes at the micro level. Similarly, quantitative analyses underscore the significant role of geographic factors in shaping architectural patterns, illustrating the interplay of geographic, cultural, and economic factors across different dimensions. Convergence analysis challenges the simplistic correspondence between subjective judgment and quantitative findings, indicating that macro-level geographic environmental features may not exert as substantial an influence on micro-level architectural clusters as previously assumed. Instead, there are instances where the internal spatial structure of clusters may transcends geographic constraints. The research paradigm centered on landscape genes offers a valuable approach to identifying the factors contributing to spatial disparities in traditional villages and advancing our understanding of the processes and mechanisms governing landscape gene inheritance, expression, and variation. Traditional villages, as representatives of world cultural heritage, contain rich historical and cultural information!~>. However, urbanization and industrialization have caused population decline and land loss in traditional villages, threatening their existence*. Modern industries and commercial activities have also altered their industrial structures and lifestyles>°. Protecting and preserving traditional villages and promoting their sustainable development are essential for the harmony of history and modernity'®. Systematically documenting and clarifying the evolution of traditional villages is a crucial first step. The formation of traditional villages is influenced by multiple factors. Despite some changes in detail , core elements such as geographical location, architectural patterns, and road networks remain stable'!~!“, From the perspective of new materialism theory, the interaction between material elements such as geographical location and human activities collectively shapes the landscape foundations of traditional villages, facilitating their inheritance and development throughout history!®. Recognized as landscape genes that ensure the inheritance of characteristics, the study of these elements has become a focal point!*!*. The mainstream paradigm of landscape genetic research was first introduced through the discussions on the layouts of urban and rural settlements!*”°. Recently, global studies have explored the landscape genes of traditional villages and how historical, cultural, and environmental factors shape these villages. In Europe, village layouts are influenced by centuries-old farming techniques and ecological conditions’. Similarly, African studies illustrate the interaction that shape village landscapes”. Moreover, native American villages in North America are closely tied to natural resources and culture traditions”. Pre-Columbian South America features 1School of Geographic Sciences, Xinyang Normal University, Xinyang 464000, China. *School of Tourism, Xinyang Normal University, Xinyang 464000, China. 3College of Liberal Arts, Xinyang Normal University, Xinyang 464000, China. “email: gaojb@xynu.edu.cn sophisticated agricultural terraces’. Furthermore, in Polynesia of Oceania, villages utilized agroforestry an land management systems for resource sustainability’. These studies emphasize the role of landscape genes in shaping the identity and ensuring the sustainability of traditional villages amid modernization and change. Recently, China’s traditional villages have drawn extensive scholarly attention due to their abundance, policy support, and vast rural landscapes”°. Furthermore, research has seen continuous expansion in both breadth an depth”’. In particular, ethnic minority villages in remote areas have become a focal point of study***°. Indigenous communities exhibit unique adaptation mechanisms*!. Geographical isolation helps preserve original elements and demonstrates harmonious coexistence**“*. Languages, customs, and beliefs highlight cultural diversity in festivals*. Research primarily employs quantitative analysis to delineate landscape genes*>~“°. There is a trend towards increasingly complex and microcosmic analyses to reveal connections at the macro level and specific features at the micro level*!~“*. However, integrating these two research approaches in practice remains challenging. Current research requires further exploration in aspects such as sample selection, scale transformation, an method integration. Key issues include a narrow focusing on specific villages without horizontal comparisons, an exclusive emphasis on the micro level while neglecting longitudinal correlations, and the discrepancy between subjective judgments and quantitative analyses. This article addresses these challenges by expanding the sample selection range and establishing cross-scale correlations through quantitative analyses of the quality of landscape genes at various scales. This approach facilitates comparisons of the evolutionary processes of landscape genes in traditional villages and uncovers their formation mechanisms.",
    "This paper proposes a cross-scale analysis framework that integrates subjective and objective evaluations (Fig. 1). This framework elucidates the multiple levels and connotations inherent in cross-scale research and establishing a clear correspondence between subjective judgments and quantitative analysis results. At the macro level, the focus lies on the geographical background extending beyond village boundaries, emphasizing the placement of traditional villages within a broader context. The terrain and water systems shape the early development of traditional villages, with geomorphic conditions playing a crucial role*°. Corresponding quantitative indicators include average elevation and average distance to major rivers. At the meso level, the focus shifts to the overall pattern and framework of the village, highlighting the spatial organization and layout. This level emphasizes settlement distribution and road network systems. In traditional villages, roads serve as the skeletal structure for building organization*’. Quantitative indexes describe settlement shape and road network attributes. At the micro level, the analysis delves into the internal structure of traditional villages, focusing on the combination and relationships of various buildings within the village. Architectural styles and layout patterns are analyzed, providing insights into landscape inheritance and regional culture“. Quantitative indicators, such as architectural mixing degree (the percentage of the area occupied by traditional houses) and consistency measures characterize the layout patterns. The analysis can be conducted in two dimensions—horizontal and vertical—encompassing subjective judgment, quantitative analysis, and the integration of qualitative and quantitative aspects. Subjective judgment identifies the dominant traits and interconnected gene chains of landscape genes across different scales. Quantitative analysis examines the distribution patterns and spatial evolution trends of each indicator across various scales. The integration of the two approaches investigates the inheritance, expression, and transformation of characteristics across different scales and spaces aiming to understand evolutionary mechanisms through cross-scale comparative analysis. The following sections of this article will elaborate on these analytical dimensions. Henan Province, located in the central-eastern China, along the middle and lower reaches of the Yellow River, spans four major basins (Fig. 2). Henan Province not only serves as a significant agricultural hub but also holds prominent status as a densely populated region and a key transportation center. Moreover, it stands as a pivotal birthplace of Chinese civilization and the Chinese nation. Consequently, Henan Province, characterized by its agricultural significance, high population density, and rich cultural heritage, is a typical case study area for exploring traditional villages. The evolution of policies concerning traditional villages in China has undergone several distinct stages throughout rural development. Initially, before the term “traditional villages” was standardized, efforts were made to identify renowned historical and cultural villages, establish intangible cultural heritage inventories, and include these villages in key cultural relics protection programs. These initiatives laid the groundwork for future advancements. The subsequent stage involved investigations and frameworks establishment. A significant milestone occurred in August 2012 when four Chinese departments collaboratively issued the \"Evaluation and Accreditation Index System for Traditional Villages (Trial)\". This system standardized evaluation benchmarks, comprising 20 indicators and 21 scoring points across three major categories: architecture, spatial configuration, and culture, utilizing both quantitative and qualitative assessment methodologies. In response, regions such as Henan Province actively participated in local-level evaluations, recognition, and the compilation of information on traditional villages. Central Document No. 1 in 2013 further emphasized the importance of safeguarding traditional villages, advocating for specialized plans and dedicated projects to protect villages and residences with historical, cultural, ethnic, and regional significance. Consequently, the protection and development of traditional villages became a keycomponent of China's rural development strategy. From 2014 to 2019, the focus shifted to in-depth exploration and diversification. Efforts included establishing expert committees and initiating case collection campaigns to integrate traditional villages with modern development needs. Since 2020, the phase of reinforcement and comprehensive planning has begun. Governments at all levels have introduced numerous measures, and the central government has issued directives for comprehensive planning. This has gradually led to the formation of a comprehensive and systematic policy framework, ensuring the preservation and innovation of traditional village heritage within the rural development context, thus highlighting its profound significance and value. As of the end of 2023, a total of 8,155 traditional villages in China have been announced in six batches. However, this research only includes traditional villages from the first five batches due to the complexity of data processing and quantitative analysis required. Therefore, the focus of this study is on the traditional villages in Henan Province, totaling 205.",
    "The distribution of these traditional villages shows two noteworthy spatial characteristics. Firstly, the majority of traditional villages are located near hills and rivers, which can be attributed to the limited productivity of early settlements. Secondly, the plains in the central and eastern regions have few traditional villages, highlighting the significant impact that changes in agricultural production methods have had on the preservation and development of traditional villages. Fig. 2. The spatial distribution of traditional villages within the administrative division, terrain, and river system in Henna Province. Maps were created using ArcGIS Pro 3.0.1 (Environmental Systems Research Institute, USA. https://www.esri.com/). In this paper, the spatial locations of the 205 traditional villages in Henan Province were mapped using the ArcGIS platform. Additionally, online resources such as ESRI satellite images and Baidu maps were used to aid in the vectorization of the main buildings, roads, and water bodies of each village, which formed the geographic information database of traditional villages in Henan Province (Table 1). The following subjective judgments and quantitative analyses all examine vectorized data from traditional villages. It is important to note that not all village groups exhibited typical traditional village landscapes, and the spatial extent of the villages varied significantly. Therefore, only the most representative areas of each village were selected for analysis. In China, some of the traditional villages included in the list are categorized into village groups, which are considered a lower level of social organization compared to administrative villages. An example of such detailed categorization can be found in the Songchong Group, located within Pushudian Village, Shawo Town, Xin County, Xinyang City. The process of selecting the most representative areas is crucial for enabling meaningful horizontal comparisons in subsequent analyses. Subjective judgment involves a qualitative analysis of the characteristics, interrelationships, and developmental mechanisms of geographic features, such as traditional villages. This analysis is based on the researcher’s observations, cognition, and understanding of various elements within the geographic environment, as well as their experience, knowledge, and grasp of the regional cultural and historical context. Unlike precise quantitative data, subjective judgment emphasizes a comprehensive consideration of both natural and human factors across various scales—macro, meso, and micro. The old Chinese saying, \"The soil and water of one region nourish its people,\" aptly captures the influence of geography on human settlement. In the development and planning of settlements, residents typically construct roads and houses in accordance with favorable terrains to enhance the convenience of production and daily life. As an observer with expertise in the characteristics of rural areas, one can intuitively envision the potential road network and building layout when determining the macroscopic location of a village. This intuitive mapping serves as the primary basis for the subsequent classifications conducted by the observer. In practice, labels are assigned to each traditional village based on a set of judgment criteria (Table 2). Importantly, this process is conducted by multiple individuals over several rounds to ensure a consensus on the impression of each village. Quantitative analysis employs GIS tools and mathematical methods to precisely describe the characteristics, spatial distribution patterns, and evolutionary trends of traditional village landscape genes across various scales. By calculating a series of quantitative indicators, this method analyzes fundamental elements such as roads and buildings within the villages. Quantitative analysis, unlike subjective judgment, serves as an exploratory analytical method in which the data itself provides insights. Rather than relying on preconceived empirical understandings, this approach allows for the identification and summarization of potential landscape genes based on the outcomes of the analysis. In this way, quantitative analysis facilitates an objective examination of data, enabling researchers to uncover patterns and relationships that may not be immediately apparent through subjective evaluation. By incorporating spatial analysis tools available in ArcGIS (version 10.8), this paper aims to provide a clear demonstration of the research method’s implementation path (Fig. 3). The quantitative indicator for terrain is the average elevation, calculated using DEM data and the zoning statistics tool in ArcGIS. The quantitative indicator for the river system is the distance to the river. This can be calculated using watershed vector data and the distance tool in ArcGIS to measure the distance from the traditional village site to the nearest river. Boundaries are the external elements that constitute the spatial structure of traditional villages. To deconstruct the traditional village spatial form, it is necessary to first establish the buffer distance. Since this paper is a big data analysis of all traditional villages in Henan Province, rather than a single village, a relatively moderate value should be chosen, considering the significant differences in the boundary patterns of different villages. As such, 30 m is set as the buffer distance, which allows for the observation of the external characteristics of villages and meets the extents of village buildings**.",
    "This paper constructs the shape index S, which are used in landscape ecology studies on land use to provide insight into trends in land patch morphology”. The circularity of a figure indicates the degree of deviation from circle of equal area, known as “shape deviation”. For a more precise measurement of the borders of traditional villages, we use an ellipse with equal area and aspect ratio as a reference. It is widely acknowledged that villages exhibit a clumped or banded distribution when S<2, and a finger or fishbone distribution when S> 2. The shape index is calculated based on existing studies and are represented as follows: L, W, and J refer to the length, width, and aspect ratio of the minimum circumscribed rectangle of the traditional village, and P and A represent the perimeter and area of the virtual range of the traditional village. Fractal theory and the fractal dimension help quantify and describe the growth mechanisms, enabling a better understanding and explanation of complex phenomena in both natural and man-made systems. Since this paper focuses on the study of traditional village morphology without dynamic changes, the area-perimeter relationship method is chosen for its calculation convenience*. The theoretical value of F is 1.0 to 2.0. A value of 1.0 represents the simplest square-shaped patch, while the shape represented by 2.0 is the most complex patch in terms of area and perimeter. (4) Road Network. The transportation network composed of roads is an key internal element that constitutes the spatial form of traditional villages. To analyze the internal spatial structure of traditional villages, this paper employs the sDNA (Spatial Design Network Analysis) plug-in for the ArcGIS platform”. Line Connectivity refers to the number of other line ends to which this line is connected. It is also known as degree centrality. Betweenness counts the number of geodesic paths that pass through a vertex, i.e., the number of times the vertex lies on the shortest path between other pairs of vertices. Let N represent the set of polylines in the global spatial system. For a single line f, R, is the set of polylines in the network radius from link ¢, P(t) is the proportion of any polyline ¢ within the radius, W(t) is the weight of a polyline ¢. The calculation formula of Betweenness for polyline x, y and z is as follows. Farness is measured as the mean angular, Euclidean, custom, or hybrid distance according to the chosen distance metric. Let d,,(x, y) denote the distance according to metric M, along a geodesic defined by M, between the origin polyline x and the destination polyline y. The calculation formula for Farness is as follows. Note that on average, the distance traversed between two arbitrary points within the same link is one-third of the distance traversied across the entire link. Therefore, the contribution of the origin link to its own farness is included in this manner. The quantitative indicator for residential style is the mixing degree. During data processing, each building in the traditional villages was labeled to distinguish between new and old styles. The mixing degree is then determined by calculating the percentage of old-style buildings. The spatial form of traditional villages is defined by not only roads but also buildings. To address this, this paper adopts the coefficient of variation method and calculates coefficients of variation for floor area, distance, and direction. Cn Caistance and C,,..,,., represent the area consistency, distance consistency, and direction consistency of ‘area’ ~ distance’ direction . . ‘ oan traditional village buildings, respectively. In this formula, a, denotes the area of a single building, d,, denotes the nearest distance between a building and its surrounding buildings, and r,, denotes the angle between a building and its nearest building in relation to the four cardinal directions (east-west, north-south), a, d, F refers to the corresponding average level. To accurately reflect directional consistency, the value of r needs to be adjusted after comparing it with the four cardinal directions. Clustering is a technique used to find the intrinsic structure within data. Cluster analysis involves different algorithms, depending on the characteristics of the dataset. Among these, k-means clustering is suitable for quantitative data, k-modes clustering is suitable for qualitative data, and k-prototypes clustering can be applied to mixed datasets. Since this paper’s analysis of traditional village landscape genes includes both subjective judgment (qualitative data) and quantitative analysis (quantitative data), it plans to use the three cluster analysis methods mentioned above separately.",
    "Under typical circumstances, the likelihood that the results from the three clustering methods will be completely identical is relatively low. However, it is more likely that certain samples will exhibit the same classifications across different methods. For samples with consistent classifications, it is essential to conduct an inductive and summarizing process, which can be considered as decoding the expression of landscape genes. Conversely, for samples with inconsistent classifications, a comparative analysis of the differences is necessary, serving as an exploration of the variation in landscape genes. This approach not only harmonizes subjective judgment with quantitative analysis but also provides a foundation for uncovering the mechanisms behind the formation of landscape genes in traditional villages. This paper utilizes the R language (version 4.2.3) and three cluster analysis methods: the kmeans function of the stats package (version 4.2.3), the kmodes function of the klaR package (version 1.7-2), and the kproto function of the clustMixType package (version 0.3-9). As cluster analysis is a commonly used multivariate statistical method, unlike the previous indicator calculations, it is well-established and does not require GIS analysis tools. Therefore, the detailed calculation formula will not be listed in this paper. To further analyze the interrelationships between different attributes in cross-scale processes, we use an alluvial plot (Fig. 4) to illustrate their interactive dynamics. By examining the changes in the distribution of traditional villages from the macro to the micro level, beginning with the topography, we can decode the interplay of subjective judgment indicators. It becomes evident that, as we delve deeper into the micro level, the subjective judgment results show more pronounced divergent features. Approximately 70% of the traditional villages in Henan Province are located in mountainous and hilly regions with the rugged terrain serving as a natural defense. Moreover, more than 70% of traditional villages are located within the Huaihe River System (40.5%) and the Haihe River System (33.2%), with fewer villages in the Yellow River System (18%) and the Yangtze River System (8.2%). Despite the historical significance of the Yellow River as one of the earliest developed regions in China, flooding from the river had a greater impact on residential settlement compared to the Huaihe River System. The concentrated architectural layout in traditional villages in Henan Province, comprising over 80%, proves advantageous for fostering resident interactions and resource sharing, and gives rise to corresponding fishbone and grid road networks. However, as most traditional villages are located in mountainous areas, the fishbone road network, radiating from a central axis to residential areas on both sides, is particularly well-suited for uneven terrain, effectively meeting the commuting needs of residents within the village. In exploring the mechanism of the landscape genes of traditional villages, the preservation of existing traditional buildings and their surrounding environments plays a significant role. Should these buildings be well-preserved in their original appearance with good architectural quality, concentrated distribution, and a coordinated and unified style, while still being utilized by original residents and sustaining the vitality of the traditional area, they provide valuable insights into the formation of traditional villages’ landscape genes. In Henan Province, around 65% of traditional villages have well-preserved traditional buildings, and the concentration of these buildings is high, with a clump layout exceeding 60%. This compact layout not only fosters a close-knit rural social network but also supports infrastructure upgrading and renovation. The critical connections across macro, meso, and micro levels are highlighted through the dynamic analysis of traditional villages in Henan Province. At the macro level, geographical features and historical significance set the stage and guide the development trajectory of traditional villages. For example, the stability of the upper reaches of the Huaihe River System not only anchors regional agriculture but also shapes meso-level dynamics. At the meso level, we observe the tangible outcomes of macro influences in the form of concentrated architectural layouts and purposeful road networks. These meso-level elements are crafted in response to challenges such as uneven terrain and transportation obstacles, and they become tangible expressions of how macro conditions shape the built environment of traditional villages. Importantly, these meso-level dynamics directly impact on the micro level, where the architectural preservation and cultural heritage of traditional villages depend on the success of meso-level adaptations. The concentration of well-preserved buildings, exceeding 60%, is a testament to how meso-level planning, influenced by macro conditions, directly impacts the micro-level assessment and recognition of these villages.",
    "Quantitative analysis provides accurate numerical data for specific attributes of traditional villages, and we visualize these values in a three-dimensional coordinate system (Fig. 5). To analyze the trend of each quantitative indicator of traditional villages in both the east-west and north-south directions, it is useful to map the data scatter to the elevation, represented by the two coordinate axes of the bottom surface (longitude in the northwest- southeast direction and latitude in the northeast-southwest direction) along with the vertical axis. Subsequently, using the fitted surface resulting from this mapping process enables a more in-depth analysis of the overall trend exhibited by a specific indicator. The traditional villages in Henan Province exhibit a varied elevation profile, with a relatively high mean elevation and noticeable variability (Table 3). Although most villages are situated at lower elevations, a few outliers in locations such as the Taihang Mountains, Wangwu Mountains, and Funiu Mountains significantly raise the mean elevation (Fig. 5). Regarding proximity to rivers, most villages are located at relatively longer distances, with some outliers raising the mean and showing a broader distribution of distances instead of clustering together (Table 3). Additionally, most traditional villages are not situated in areas with dense river networks, a trend that is especially pronounced in the western part of Anyang City in northern Henan (Fig. 5). The trends in the Shape Index and Fractal Dimension show relatively high consistency, generally decreasing from northeast to southwest (Fig. 5). The positive skewness and higher kurtosis in the Shape Index indicate the presence of various irregular shapes, whereas the relatively consistent and lower values in the Fractal Dimension suggest less variability in geometric complexity. Furthermore, approximately 19.5% of the areas exhibit Shape Index values greater than 4, with nearly half concentrated in Xinyang City, indicating that the terrain in southern Henan has a more pronounced impact on the spatial patterns of traditional villages. The three indicators of the road network display similar patterns (Fig. 5), with Farness decreases from north to south, connection decreases from northeast to southwest, and Betweenness decreases from northwest to southeast. The standard deviation, skewness, and kurtosis of connection are low, indicating that most villages form well-connected clusters. In contrast, the skewness and kurtosis of Farness and between are high, with a few villages occupying significant positions as transportation hubs or interaction centers. These findings collectively provide a detailed description of the dynamic transportation network. The average Mixing Degree is 41.7%, falling below the 50% benchmark (Table 3). Only 14.6% of the villages have a Mixing Degree surpassing 70%, underscoring the pressure to intensify the protection of the original architectural forms This degree across the province decreases significantly from southeast to northwest, closely mirroring the spatial distribution of economic development (Fig. 5), reflecting the influence of farmers’ “traditional thinking” on the construction of new houses (modern style) and the protection of traditional village buildings. When comparing the consistency area, direction, and distance for architectural patterns, the area consistency is better, followed by angle and distance consistency (Table 3). Spatially, area consistency is lower in the center and higher around, whereas the angle and distance consistency are the opposite, being higher in the center and lower around (Fig. 5). According to the actual form, the central region of Henan exhibits relatively flat terrain, with larger and denser rural settlements, resulting in a pattern of \"small individual, large overall, and irregular arrangement\". Conversely, in the northern, western, and southern regions of Henan, characterized by rugged terrain, smaller village sizes, and lower population density, a pattern of \"large individual, small overall, and regular arrangement\" appears to form. The cross-scale study of macro, meso, and micro levels provides a comprehensive understanding of the evolution of traditional villages. From a macro perspective, village development is shaped by topography and river distances, which provide natural defense but limit expansion. At the meso level, the intricate traffic network reflects spatial hierarchies and diverse connections that influence village-wide movement. At the micro level, architectural preservation becomes crucial due to the influence of economic development and traditional mindsets. The cross-analysis process intricately weaves together geographical, cultural, and economic dimensions, offering a comprehensive depiction of the subtle forces at play in the evolution of traditional villages and providing a coherent narrative of the village's development.",
    "total of four types were identified based on their proportional structure (Fig. 6) and spatial patterns (Fig. 7). In addition to the results of k-modes clustering, the other two clustering results were re-encoded to enable a thorough examination of their consistency with spatial patterns. The analysis of clustering results reveals significant differences among the four types across different methods (Fig. 6). The distribution patterns of k-modes and k-means exhibit comparable and relatively uniform characteristics, while k-prototypes show notable variations, with one type accounting for less than 10% of the total. Upon a comprehensive evaluation of type consistency across the three methods, it is evident that the proportion of traditional villages classified into the same type by different methods is generally low, not exceeding 30% (Fig. 6a). Particularly for Type 3, a lack of consensus is notable. A study of the consistency between k-modes and the other methods indicates an overall improvement, particularly evident for Types 1 and 3 (Fig. 6b). Due to the challenges posed by low consistency, a multitude of indicators, and the intricate cross- scale association chains, it is difficult to substitute a specific type of traditional village with a unified term. Thus, Types 1-4 are used to represent the four types in subsequent analyses. Although a definite name cannot currently be assigned, it is possible to verify whether there is a correspondence between subjective judgment and quantitative analysis within the analytical framework based on the clustering results (Table 4). First, the southern Henan region features more tributaries of the Huaihe River, resulting in a relatively short distance from the village to the river. Additionally, villages with concentrated layouts and grid roads tend to exhibit regular shapes with smaller shape indices and fractal dimensions, as well as improved connectivity, proximity, and intermediacy. Moreover, the flat terrain of the plain region includes vast and densely populated village areas with buildings exhibiting consistent angles and distances, as well as relatively similar rural dwelling sizes across regions. A noteworthyaspect is the variability in building style mix, which is significantly influenced by villagers’ subjective behavior. As a result, the alignment between subjective judgment and quantitative analysis is largely confirmed within the constructed analytical framework. Nonetheless, for a comprehensive understanding of the genetic distinctions in traditional village landscapes, further investigation of spatial patterns is essential. For subjective judgment indicators, the table shows the data with the highest percentage; for quantitative analysis indicators, the table shows the average values. After applying spatial mapping to the clustering results, distinct patterns emerged in the distribution of the different types of traditional villages. The k-modes method revealed clear contours, as shown in Fig. 7. In comparison, the differentiation of types in k-prototypes was not as distinct as in k-modes. Nevertheless, a higher degree of co-occurrence was evident in the pairing patterns between Type 1 and Type 4, as well as between Type and Type 3. Conversely, the spatial classification results of k-means lacked clarity in terms of boundaries, with mixed types being more prevalent in regions except for the merger of Type 2 and Type 3 in southern Henan. The specific spatial patterns exhibited by traditional village clusters, despite the low consistency among different clustering methods, indicate a strong association between the formation of traditional village landscape genes and the geographical environment. The differences observed among these clusters may be attributed to the complex processes and mechanisms involved in the cross-level interactions of factors across varying scales. The significant differences in clustering results between k-modes and k-means in northern and southern Henan support the idea that the relationship between subjective judgment and quantitative analysis is more complex than previously assumed. A systematic comparison was conducted to investigate the classification differences between the two methods for Type 2 and Type 3 in the two cities—Anyang (north) and Xinyang (south) (Table 5). For the k-modes method, the majority of traditional villages in Anyang fall under type 2 and type 3, with a proportion exceeding 90%, whereas in Xinyang, only 42.9% fall into these types. The landscape genes exhibit two predominant characteristic chains: \"Plain/Hill-Yellow River/Huai River System-Clustered-Fishbone Road Network-Complete Retention-Clump\" and \"Mountain-Yellow River/Huai River System-Clustered—Fishbone Road Network-Complete Retention—Line\". Conversely, the k-means method showed a reversal, with all traditional villages in Xinyang falling into Type 2 or Type 3, compared to only 52% in Anyang. The difference in macro indicators between the two regions exceeds the standard deviation, suggesting a weakening effect of geographical environment constraints during the downward exploration and conduction of the scale. Despite being located at opposite ends of Henan Province, they exhibit universal similarities in building layout, primarily influenced by cultural customs and non-geographical factors, leading to the amalgamation of some villages from both regions into a single group. Therefore, employing a hybrid approach for cluster analysis results in increased complexity in classification due to expanded data dimensions. The continuous results of quantitative analysis lead to blurred distinctions, and the impact of higher-level geographical environmental characteristics on micro- architectural groups becomes less apparent. It is observed that the internal spatial structure of settlements can transcend geographical constraints.",
    "In the field of traditional village research, scholars have conducted extensive explorations in various aspects. However, previous studies have been limited in methodology. Some studies offered unique perspectives but lacked a comprehensive cross-scale analysis framework and did not involve large samples”. On the other hand, some studies utilized large samples but failed to establish a systematic cross-scale analysis framework, with limited integration of subjective judgment and quantitative analysis’. Additionally, some analyses were conducted on single or small sample objects!***. While some studies developed an organic renewal framework with a certain level of cross-scale analysis, they were constrained by small sample size*’. In contrast, this study has made a significant methodological breakthrough by constructing a cross-scale analysis framework that encompasses macro, meso, and micro levels, integrates subjective judgment and quantitative analysis, and includes a large sample of 205 traditional villages in Henan Province. This approach enables a more comprehensive and systematic exploration of the characteristics and patterns of traditional villages. Cross-scale analysis should become the central focus of traditional village research, particularly when genes are taken as the starting point. By comprehensively understanding the mechanism of landscape genes through genetic analogy, the logical chain of landscape gene formation can only be fully reflected in the context of cross- scale. The spatial and architectural evolution of traditional villages is rooted in enduring features such as terrain and water systems, which function like a genetic blueprint. This blueprint dynamically manifests at the meso level through building layouts and road networks to address undulating terrain and traffic obstacles, resembling gene expression. Furthermore, at the micro level, subtle changes in architectural patterns and residential styles adapt to social changes and economic development, similar to gene variation. This framework highlights the importance of cross-scale analysis in the traditional village landscape gene research. Advancements in surveying and mapping technology, along with the widespread adoption of drones and similar equipment, are poised to effectively address the challenge of balancing scale (sample size) and precision (landscape complexity)!°. As a result, multi-scale analysis may eventually achieve a continuous zoom. This progression will not only facilitate the inclusion of more parameters in quantitative analysis but also empower subjective judgment to reveal distinctive details. Consequently, the explanatory framework of the logical chain, currently formed by relatively coarse landscape genes, will inevitably be enriched. The current discussions on landscape gene variation in research mostly stem from observation results at the micro level, such as the integration of tourism development and ethnic minority culture’, the simplification of architectural decorative symbols!*, and the adjustment of the internal structure of buildings due to modern living needs’. Culture is a key factor leading to the genetic variation of landscape genes, as the inheritance of landscape genes in traditional villages gradually weakens with continuous exploration at smaller scales, making the differences more pronounced. The cross-scale analysis framework developed in this paper provides new evidence to explaining the correlation between gene variation and culture. First, the spatial differentiation of landscape genes becomes more evident at the micro level. Second, traditional villages located in the north and south, despite significant differences in geographical environments, may also be classified into the same category. Third, indicators such as architectural mixing degree help indicate the extent of landscape gene variation. These new pieces of evidence allow us to quickly gain a basic understanding of the pattern, extent, and type of landscape gene variation in traditional villages within a region. This understanding enables us to focus on analyzing the rocess and mechanism of variation and guide the evolution of landscape gene variation in a direction that romotes the sustainable development of traditional villages in a broader context. The variation and impact of landscape genes often do not manifest over short periods. In a country like China, where the development of most traditional villages spans several centuries, many changes are difficult to verify due to its long history'*. This paper uses cross-analysis of large samples at fixed time points to capture the extent and characteristics of these variations, providing a relatively convenient approach. With the growing awareness of traditional village preservation and the rapid development of rural tourism across regions, it is likely that more archives will be established in the future. Drawing inspiration from the research approach of biological genes, this article is grounded in the geographical elements influencing the formation and development of traditional villages. It delineates the characteristics of landscape genes in 205 traditional villages in Henan Province through the construction of a cross-scale comparative analysis framework. Furthermore, the article systematically analyzes the evolution mechanism of traditional village landscape genes, leading to the following key conclusions.",
    "This article focuses on expanding the research on traditional village landscape genes through cross-scale comparison. However, the study has limitations in terms of theory, methods, samples, and other aspects. Based on the analysis results, two future expansions are suggested. First, considering the existence of landscape genes in various types of rural settlements, it is proposed to include non-traditional villages as a “control group” in the study. This could facilitate the identification of key factors influencing the genetic, expressive, and variational aspects of landscape genes. Second, it is proposed to further scale down to objects such as courtyards, walls, and bridges, which carry diverse cultural traits. This could involve leveraging big data from street view and deep learning to uncover similar features of landscape genes in detail, providing breakthroughs in understanding the complex local societies interwoven with ethnicity, economy, and culture. The data used in this study are derived from publicly available sources. (1) The traditional village evaluation and recognition indicator system (for trial implementation) in 2012 used during the current study available from the corresponding author on reasonable request. (2) The list of traditional villages and their addresses used during the current study are availabel in the “State Council Policy Document Library’, [https://www.gov.cn/zhengce/zh engcewenjianku/]. For example, the fifth batch of villages included in the list of traditional Chinese villages can be found in the web link [https://www.gov.cn/zhengce/zhengceku/2019-09/29/content_5434777.htm]. (3) The topographic and water system maps generated during the current study are availabel in the “National Catalogue Service For Geographic Information’, [https://www.webmap.cn/commres.do?method=dataDownload]. (4) The roads, buildings, and other components of traditional villages maps generated during the current study are availabel in the ESRI imagery, [https://livingatlas.arcgis.com/wayback/#active=47963&mapCenter=114.09788 %2C32.13166%2C12]."
]