[
    "The integration of improve teaching and learning outcomes, but various factors determine the degree to which ICT is integrated into educational practices. This study used quantitative methodology to examine four key factors that impact in-service teachers’ ICT integration and how they interact with each other. Data was collected through snowball sampling from 685 in-service teachers in Henan Province, China. Using partial least squares structural equation modeling (PLS-SEM), the study analyzed four factors from the Technology Acceptance Model 3 (TAM 3) and the Will-Skill-Tool model (WST model): attitudes (AT), self-efﬁcacy (SE), digital competence (DC), and digital tools utilization (DTU). The ﬁndings revealed that all four elements exerted a noteworthy inﬂuence on the integration of ICT by in-service instructors. Meanwhile, attitudes, digital competence, and digital tools utilization have a mediating effect in this research. Additionally, the study examined how gender, age, and teaching experience inﬂuence these factors and ICT integration. The ﬁndings revealed that females exhibit higher levels of positive attitudes and digital competence than males, while teachers aged 31–35 years have stronger digital abilities, digital tool use, and ICT integration compared to younger or older teachers. Furthermore, teachers with less than three years of teaching experience exhibit signiﬁcantly stronger attitudes, self-efﬁcacy, digital competence, and ICT integration than those with more than ten years of experience. The implication of the study provides valuable insights for designing effective ICT-based instruction and developing teacher edu- cation and educational technology programs aimed at promoting ICT integration in the nology (ICT) in the education sector has sparked concerns. It is deemed necessary to utilize ICT in education to transform the outdated educational system (LeTendre, 2022). Despite instructors’ proﬁciency and comfort with ICT, their active utilization of it remains limited and supplementary (Pham and Sampson, 2022). Scholars have shown considerable interest in studying the impact of ICT on educational systems, especially in developing nations such as China (Li et al., 2022; Pokhrel and Chhetri, 2021; Tsegay et al., 2022). Some researchers have investigated speciﬁc obstacles that impede teachers from imple- menting ICT in the classroom, while others have employed technology-adoption models to address potential reasons behind teachers’ hesitance to incorporate ICT in their teaching practices (Dolighan and Owen, 2021; Ogalo et al., 2022). Recognizing the belief that enhancing ICT in schools will have extensive peda- gogical and educational beneﬁts for educators and students alike, efforts have been made to upgrade the necessary technological infrastructure and ICT-based tools for instruction and learning (Wang and Zhao, 2022). Nonetheless, there exists a risk of dis- illusionment with the promised advantages of integrating ICT in the classroom (Kumar et al., 2022). Consequently, it is crucial to ascertain why and under what circumstances ICT integration proves to be an effective instructional tool. When implemented appropriately in educational settings, the integration of ICT can serve as a valuable tool to support and enhance the learning process. The active involvement of teachers is fundamental to ensure the effective integration of ICT in the classroom (Seufert et al., 2021). The use of ICT by teachers plays a signiﬁcant role in students’ learning outcomes, as it not only enhances their motivation but also enables them to utilize ICT more proﬁciently (Aidoo et al., 2022). Scholars have thus con- ducted investigations to identify the factors that either facilitate or hinder teachers’ incorporation of ICT into their teaching prac- tices. Several factors associated with ICT use have been recog- nized, encompassing attitudes, self-efﬁcacy, prior experience with ICT, and competencies in ICT (Busse et al., 2022). Despite con- siderable efforts to support teachers in integrating ICT into their classroom practices by identifying these facilitating and inhibiting factors, the existing literature indicates that teachers seldom uti- lize ICT (Cabero-Almenara et al., 2021). The implementation of information technology in education is fraught with numerous challenges. Many teachers simply transfer their classroom teaching materials to online courses without considering personalized guidance, student engagement, and ultimately fail to achieve effective teaching outcomes. These concerns revolve around ﬁnding ways to enhance the synergy between technology and education, including facilitating inde- pendent student learning, improving teacher training, and suc- cessfully integrating online teaching models (Zhou et al., 2020). Despite the adoption of certain policies, only a limited number of teachers in China, with varying levels of professional experience, have received sufﬁcient training on effectively incorporating technology in their classrooms. Insufﬁcient utilization of tech- nology by teachers can impede students’ development and hinder their progress (Ma et al., 2019).",
    "Existing research on perceived barriers to the integration of technology in teaching has shown limited emphasis on the underlying inﬂuencing factors (Lai et al., 2022; Liao et al., 2022). Moreover, there is a dearth of studies that speciﬁcally investigate the utilization of ICT-based education by instructors (Lukas and Yunus, 2021). Additionally, the majority of previous research has predominantly relied on a singular model of technology accept- ability, with only a few studies successfully integrating both models (Lu and Xie, 2022). Consequently, there is a pressing need teachers’ adoption of ICT. This understanding is essential for enhancing their capabilities and fostering effective teacher- student interaction with technology. The primary objective of this study is to investigate two research questions. (1) What are the associations among attitudes, self-efﬁcacy, digital competence, digital tools utilization, and ICT integration among in-service teachers? (2) What association exists between the demographic characteristics of in-service teachers, such as age, gender, and teaching experience, and their impact on ICT integration? Theoretical framework. The underlying theoretical foundations are derived from the Technology Acceptance Model 3 (TAM 3) and the Will-Skill-Tool model (WST model) in this investiga- tion. TAM 3 is a theoretical framework that delves into the factors and processes related to the acceptance and practical utilization of new technology among individuals from diverse backgrounds (Venkatesh and Bala, 2008). On the other hand, the WST model encompasses three essential components—will, skill, and tool—that are indispensable for the successful inte- gration of digital technology into classroom practices (Chris- tensen and Knezek, 2008). Both TAM 3 and the WST model explore the factors inﬂuencing the actual usage of technology in real-world settings, although they adopt distinct approaches. While TAM 3 focuses on the cognitive aspects associated with the widespread adoption of new technologies, the WST model concentrates on more intricate elements that impact the inte- gration of ICT. The process of adoption presents formidable challenges, necessitating substantial exertion in the examination and evaluation of its impact on educators. Consequently, it is imperative to employ these theories as a conceptual framework to foster a comprehensive and comprehensive comprehension of ICT integration among teachers. This can be accomplished by monitoring pertinent characteristics, efﬁcacy, digital competence, and digital including attitudes, self- tools utilization, in conjunction with the TAM3 model and the WST model. The subsequent phase involves academic inquiry into how these characteristics exert inﬂuence on the adoption of ICT among instructors currently in service. Attitudes. Numerous research studies have presented evidence of a favorable inﬂuence of attitudes on the integration of ICT, emphasizing the signiﬁcance of teachers maintaining a positive stance when utilizing ICT efﬁciently and creatively (Bariu & Chun, 2022; Ursavaş et al., 2019; Verma et al., 2018). Multiple investigations have explored the associations between teachers’ attitudes, their digital competency, and their digital tools utili- zation (Al-dheleai et al., 2019; Pozas and Letzel, 2021; Štemberger and Konrad, 2021). Findings have revealed that teachers’ per- spectives exert a substantial impact on their level of digital competence and the extent to which they utilize digital resources. Notably, instructors possessing ICT skills demonstrated enthu- siasm for integrating ICT into their teaching practices. Moreover, teachers’ attitudes regarding the adoption of digital technology in education emerged as a pivotal predictor of their proﬁciency level. Teachers’ viewpoints concerning the integration of ICT into their instructional practices are shaped by various factors, encompassing but not limited to age, gender, and teaching experience. Mannila et al. (2018) postulated a connection between a teacher’s age group and their attitude toward ICT integration in the classroom, a trend observed across both male and female educators. Furthermore, Kalra (2018) discovered that novice teachers displayed a more optimistic perspective on the utilization of ICT in teaching when compared to their more seasoned counterparts. However, several studies have found no discernible disparity in the use of ICT or attitudes among instructors based on gender, age, or experience level (Semerci and Aydin, 2018; Ikwuka et al., 2020). Consequently, it is discernible that teachers’ attitudes wield a substantial inﬂuence on their digital proﬁciency, enabling them to adeptly employ digital tools and incorporate ICT. Moreover, the variables of gender, age, and teaching experience within the educator cohort possess the potential to exert discernible effects on the various facets associated with ICT integration.",
    "Self-efﬁcacy. The preceding studies presented in this discourse provide substantiation for the positive association between tea- chers’ self-efﬁcacy and their attitudes toward ICT integration (Yada et al., 2022). However, it is worth noting that certain stu- dies have also established the absence of a relationship between teachers’ self-efﬁcacy and their attitudes (Arhin et al., 2022; Coban and Atasoy, 2019). Data gleaned from multiple studies imply that teachers’ self-efﬁcacy plays a role in shaping their digital competence when it comes to ICT integration (Hatlevik and Hatlevik, 2018; Peciuliauskiene et al., 2022). Nevertheless, it should be acknowledged that Backﬁsch et al. (2021) discovered that digital competence does not exert an inﬂuence on self- efﬁcacy. Limited research attention has been dedicated to exam- ining the nexus between self-efﬁcacy and digital tools utilization during ICT integration. Alhassan (2017) afﬁrmed the signiﬁcant impact of teachers’ self-efﬁcacy on digital tools utilization. Numerous research investigations have provided empirical evidence supporting the direct inﬂuence of digital tools on the integration of ICT among teachers (Al-Maroof and Salloum, 2020; Antonietti et al., 2022; Fearnley and Amora, 2020). The incorporation of ICT has become an essential prerequisite for the advancement of educational initiatives and policies. By equipping teachers with comprehensive training, ICT resources enable them to reﬁne their digital competencies and enhance the teaching- learning process through dynamic and innovative approaches (Amhag et al., 2019). Consequently, the utilization of ICT tools enhances the effectiveness of teaching and learning endeavors. Moreover, the exploration of how a teacher’s age, gender, or teaching experience inﬂuences their digital tools utilization remains a relatively understudied area. To summarize, Fig. 1 illustrates the conceptual framework underpinning this study. Research design. In this research, a statistical technique called partial least squares structural equation modeling (PLS-SEM) is utilized to establish a framework that combines the third version of TAM3 and the WST model. The aim is to forecast and clarify the various elements that impact the integration of ICT among teachers currently employed in the education sector. The pro- posed framework investigates the correlation between ICT inte- gration and four key variables under examination: attitudes (AT), self-efﬁcacy (SE), digital competence (DC), and digital tools uti- lization (DTU). Furthermore, some studies have suggested that there is no discernible disparity concerning the inﬂuence of age, gender, teaching experience, and self-efﬁcacy on ICT integration (Baroudi and Shaya, 2022; Dolighan and Owen, 2021). Nevertheless, it is important to highlight that speciﬁc researchers have conﬁrmed divergent results (Şen and Yildiz, 2022; Šabić et al., 2021). Digital competence. There is emerging evidence suggesting a signiﬁcant association between digital competence and the inte- gration of ICT. It is suggested that educators require further development of their digital teaching skills (Dwiono et al., 2018; Fominykh et al., 2021; Méndez et al., 2022). Additionally, several studies have corroborated the impact of self-efﬁcacy and attitudes on digital competence. Teachers who perceive themselves as lacking self-efﬁcacy or holding unfavorable attitudes often demonstrate reduced self-conﬁdence, subsequently affecting their digital competence and their ability to provide optimal learning opportunities for their students (Mannila et al., 2018; Ogodo et al., 2021). Sampling and data collection. For this research, a group of teachers in Henan Province, China, was selected as the sample, as the study focused on examining the integration of ICT among educators in developing countries. Henan Province, being a resource-rich Chinese province with a signiﬁcant teacher popu- lation, was deemed representative of typical developing nations. The sampling technique employed was snowball sampling, a probability-based approach. The researchers contacted 20 in- service teachers from various public schools in Henan Province, who were then responsible for collecting data from a minimum of 40 other in-service instructors. The survey was conducted over four weeks, starting from December 2022, and concluding in January 2023. An online platform was utilized to distribute 800 questionnaires, resulting in the collection of 720 valid responses. This sample size was considered sufﬁcient to represent the overall population, ensuring the study’s reliability (Hair et al., 2019). Participants who voluntarily provided informed consent also shared demographic details, such as gender, age, and teaching experience. Strict measures were taken to uphold the con- ﬁdentiality of the information provided, adhering to ethical standards set by the study. Limited research has been conducted on the correlation between digital competence and gender and age. Lucas et al. (2021) discovered that females exhibit lower levels of digital competence compared to males, while younger teachers demon- strate higher competence in utilizing digital technologies than their older counterparts. Conversely, Zhou et al. (2021) argued that gender and age have a minimal impact on digital competence.",
    "The sample encompasses all the valid submissions received through the online platform. After eliminating outliers and missing data, the dataset was narrowed down to 685 usable responses. In terms of gender distribution, males accounted for 30.7% of the participants, while females constituted 69.3%. The majority of instructors were below the age of 45, with only 14.2% being older. Among the participants, 62.5% had less than three years of teaching experience, whereas a mere 2% had accumulated over 30 years of expertise (refer to Table 1). Digital tools utilization. ICT devices encompass a range of technological tools including computers, laptops, printers, scanners, software programs, data projectors, and interactive teaching devices (Nuhu and Onojah, 2021). These tools form a repertoire of modern technologies that enhance the efﬁcient transmission of information, transforming people’s information Research instrument. To collect the necessary data, a questionnaire was employed to predict the factors that inﬂuence the integration of ICT among in-service teachers. The questionnaire consisted of multiple components, namely attitudes (AT), self-efﬁcacy (SE), limited prior knowledge about the relationships within the structural model or the measurement of its components. The primary aim of employing the PLS method is to predict indi- cators by expanding the sets of components. If the objective is to forecast essential target constructs or identify key constructs, PLS-SEM should be the preferred choice. Additionally, PLS- SEM is the optimal approach for research endeavors char- acterized by exploration or an extension of an existing struc- tural theory (Hair et al., 2019). Measurement model. When assessing a measurement model, the key criteria to consider are reliability and validity. Table 3 pre- sents the results of the reliability test, which was conducted to assess the consistency of the items within the constructs. To examine the convergent validity and discriminant validity of the construct, the validity test was carried out, and the ﬁndings are displayed in Tables 4 and 5. Table 3 provides Cronbach’s alpha value for each latent component, which serves as an indicator of its internal consistency. digital competence (DC), digital tools utilization (DTU), and ICT integration (ICTI), all of which were integral to the proposed model. A 5-point Likert scale was utilized to gauge the responses, ranging from “strongly disagree” to “strongly agree,” allowing for effective factor measurement. The questionnaire items were adapted and modiﬁed from previous studies, ensuring their relevance and appropriateness. Furthermore, all constructs within the ques- tionnaire demonstrated a commendable level of reliability, as evi- denced by the satisfactory Cronbach’s alpha value of 0.95 (refer to Table 2 for further details). In this study, a resampling technique involving 5000 sub- samples is utilized in conjunction with the smart PLS 3.3.3 algorithm. PLS-SEM proves to be a suitable alternative to covariance-based structural equation modeling when there is The results indicated that all latent constructs were deemed reliable as their Cronbach’s alpha values surpassed the threshold of 0.6. Notably, values ranging between 0.7 and 0.8 are considered satisfactory, while those falling within the 0.7 to 0.9 range are deemed acceptable (Hair et al., 2019). Additionally, all constructs exhibited loading values exceeding 0.7, which signiﬁes that the number of items remained consistent from the beginning to the end for each construct. latent According to the ﬁndings presented in Table 3, the AVE (Average Variance Extracted) values exceeded 0.5, as indicated by previous research, and the composite reliability surpassed 0.7 for all constructs (Hair et al., 2019). Consequently, it was determined that the constructs exhibited convergent validity. To assess the discriminant validity of the measures, the Fornell and Larcker approach, as well as the Heterotrait-Monotrait Ratio (HTMT) method, were employed (Hair et al., 2019). In this approach, the square root of the AVE of each latent construct was compared to the correlations between different latent constructs. Notably, all diagonal values in Tables 4 and 5 were greater than the other correlation values, thus satisfying the requirement for discrimi- nant validity. Structural model. The evaluation of the structural model com- prises a series of ﬁve steps. The initial step involves testing for multicollinearity and assessing the variance inﬂation factor (VIF) among all endogenous constructs. In the second step, the t-value and p-value are evaluated. The third stage entails examining the Coefﬁcient of Determination (R2), while the fourth step focuses the model’s prediction ability is on effect size (f2). Finally, assessed through the ﬁfth step, which involves determining the Q2 value. To begin with, there are no issues of multicollinearity, as all VIF values of predictors in the model are below 5, which is considered satisfactory for evaluating the model (Hair et al., 2019). The researchers employed inner VIF scores since all factors within the model are reﬂective rather than formative. The ﬁndings of the inner VIF scores for the model’s predictors can be seen in Table 6. Furthermore, in this study, the researchers uti- lized a bootstrapping sampling technique with 5000 iterations of a subsample to test the structural model. The R square, effect sizes (f2), and Q square are presented in Table 7. In terms of the model’s predictive potential, the blindfolding technique was employed, revealing that the model exhibits predictive power, as indicated by the Q2 values of all endogenous constructs exceeding 0, as displayed in Table 7.",
    "Fig. 2. The results reveal signiﬁcant relationships between various factors among in-service teachers. First, attitudes of in-service teachers signiﬁcantly inﬂuence their digital competence (AT->DC: β = 0.503, p < 0.01), digital tools utilization (AT->DTU: β = 0.326, p < 0.01), and ICT integration (AT->ICTI: β = 0.296, p < 0.01). Furthermore, attitudes indirectly impact ICT integration through digital competence and digital tools utilization, with signiﬁcant and (AT->DC->ICTI, AT->DTU->ICTI: p < 0.01). positive effects the self-efﬁcacy of signiﬁcantly in-service teachers Second, inﬂuences their attitudes (SE->AT: β = 0.535, p < 0.01), digital competence (SE->DC: β = 0.200, p < 0.01), digital tools utilization (SE->DTU: β = 0.181, p < 0.01), and ICT integration (SE->ICTI: β = 0.174, p < 0.01). Additionally, self-efﬁcacy indirectly inﬂuences ICT integration through attitudes, digital competence, and digital tools utilization, with signiﬁcant and positive effects (SE->AT- >ICTI, SE->DC->ICTI, SE->DTU->ICTI: p < 0.01). Moreover, in- service teachers’ digital competence has a signiﬁcant impact on their utilization of digital tools (DC->DTU: β = 0.266, p < 0.01) and ICT integration (DC->ICTI: β = 0.223, p < 0.01). Furthermore, digital competence indirectly inﬂuences ICT integration through digital tools utilization, with a signiﬁcant and positive effect (DC- >DTU->ICTI: p < 0.01). Lastly, in-service teachers’ digital tools Fig. 2 The model of factors inﬂuencing in-service teachers’ ICT integration. The integration of ICT by in-service instructors was signiﬁcantly inﬂuenced by all four elements (attitudes, self-efﬁcacy, digital competence, and digital tools utilization). At the same time, attitudes, digital competence, and digital tools utilization played a mediating role in the process. researchers conducted a test on the coefﬁcient of determination (R2). In this evaluation, the R2 values for the endogenous constructs were examined, and they are categorized as weak, the moderate, or substantial when the R2 value reaches 0.25, 0.50, or 0.75, respectively (Hair et al., 2019). The results, as depicted in Table 7, indicate that attitudes exhibit limited power in the model, while other variables demonstrate moderate power. Effect sizes (f2) were also considered, with values greater than 0.02, 0.15, and 0.35 indicating modest, medium, and large effects, respectively. In Table 7, it can be observed that attitudes (f2 = 0.302) have a strong effect size on digital competence, while self-efﬁcacy (f2 = 0.401) has a notable effect size on attitudes. However, when creating f2 for ICT integration, all four predictors (attitudes, self- efﬁcacy, digital competence, digital tools utilization) yielded small effect sizes. In terms of the model’s predictive potential, the blindfolding technique indicated that the proposed model possesses predictive power, as the Q2 values for all endogenous constructs surpass 0, as displayed in Table 7. 2, which focuses on the impact of gender, age, and teaching experience on the ICT integration of in-service teachers, are presented in Tables 9–11 and Figs. 3–5. To investigate whe- ther there are statistically signiﬁcant differences in instruc- tors’ perspectives on ICT usage based on their age and teaching experience, we employed a one-way ANOVA fol- lowed by the LSD (least signiﬁcant difference) post-hoc test. For gender, as it is a binary category, no post-hoc analysis was required. Before conducting the ANOVA, Levene’s test was utilized to assess the homogeneity of variance among the cases. The results of Levene’s test revealed that the distribu- tion is parametric, indicating that the assumption of nor- mality holds. Regarding gender, the results indicate that there are no signiﬁcant differences between teachers’ self-efﬁcacy, digital tools utilization, and ICT integration based on their gender (p > 0.05). However, there is a signiﬁcant difference in attitudes and digital competence between male and female in-service teachers (p > 0.05). Females tend to have more positive attitudes and higher digital competence compared to males. In terms of age, the ﬁndings reveal that there are no signiﬁcant differences in attitudes and self-efﬁcacy among teachers of different age groups (p > 0.05). However, signiﬁcant differences exist in digital competence, digital tools utilization, and ICT integration based on age (p < 0.05). In-service teachers aged 31–35 years exhibit signiﬁcantly stronger digital abilities, utilize digital tools more effectively, and integrate ICT better than those aged 20–30 years or older than 35 years. Regarding teaching experience, no signiﬁcant difference was found in the utilization of digital tools signiﬁcant (p > 0.05). However, teachers among in-service differences exist in attitudes, self-efﬁcacy, digital competence, and ICT integration based on teaching experience. Teachers with less than three years of experience demonstrate signiﬁcantly stronger attitudes, self-efﬁcacy, digital competence, and ICT integration compared to teachers with more than 10 years of experience.",
    "Numerous scholars have conducted extensive research to address educational development challenges, speciﬁcally related to the integration of ICT in the education sector. This particular study employed structural equation modeling (SEM) to analyze the fac- tors inﬂuencing the integration of ICT among in-service teachers The objective of this research was to evaluate the attitudes, self- efﬁcacy, digital competence, and digital tools utilization among teachers currently in service. These factors are considered essential in improving productivity and efﬁciency in the inte- gration of ICT, addressing the ﬁrst research question. The extent to which ICT is fully utilized or underutilized in developing countries cannot be deﬁnitively determined. Consistent with the ﬁndings of Bariu and Chun (2022) Ursavaş et al. (2019), and Verma et al. (2018), this study reveals that teachers’ attitudes signiﬁcantly and positively impact their digital competence, usage of digital tools and ICT integration. The study suggests that teachers’ positive attitudes play a signiﬁcant role in encouraging students to engage with ICT in the classroom, thereby supporting effective teaching. To promote global development, educational institutions in developing nations should encourage teachers to use computers, fostering positive attitudes toward ICT. Further- more, attitudes demonstrate a critical inﬂuence on ICT integra- tion, as evidenced by their higher coefﬁcient value compared to the other three components. The study’s ﬁndings also indicate that self-efﬁcacy signiﬁcantly inﬂuences the attitudes, digital competence, digital tools utiliza- tion, and ICT integration of teachers currently in service. This suggests that teachers with low self-efﬁcacy may perceive ICT as difﬁcult to use or less useful in their context. These results align with similar studies conducted by Peciuliauskiene et al. (2022) and Yada et al. (2022), which highlight that higher self-efﬁcacy among teachers leads to better attitudes, digital competence, digital tools utilization, and ICT integration. Additionally, the study reveals that teachers’ digital competence positively impacts their usage of digital tools and ICT integration. This ﬁnding is consistent with the research conducted by Dwiono et al. (2018), Fominykh et al. (2021), and Méndez et al. (2022), which emphasize the need for teachers to enhance their digital skills in teaching. Teachers who possess greater digital competence are more adept at utilizing digital tools and integrating information technology. Therefore, schools and policymakers need to develop reasonable policies that encourage teachers to enhance their digital capabilities, actively engage in digital technology training, improve their attitudes and self-efﬁcacy in using digital technol- ogy, and foster the acquisition of digital skills to effectively apply ICT in the classroom teaching and enhance teaching quality. Furthermore, the results conﬁrm that teachers’ digital tools uti- lization has a positive and signiﬁcant impact on ICT integration. Lavrenova et al. (2020) propose that the introduction of modern digital tools and the application of various network programs and platforms have greatly improved the efﬁciency of ICT integration. Convenient digital tools serve as the fundamental guarantee for successful ICT teaching, and the robust development of digital tools will further facilitate effective ICT teaching methods. This research model aims to investigate the variations in factors inﬂuencing the integration of ICT among in-service teachers concerning gender, age, and teaching experience, as addressed in research question 2. The ﬁndings indicate that gender does not have a signiﬁcant impact on teachers’ self- efﬁcacy, digital tools utilization, and ICT integration, which aligns with the studies conducted by Baroudi and Shaya (2022) and Dolighan and Owen (2021). However, there is a notable difference between in-service teachers’ attitudes and digital competence based on gender. In contrast to the ﬁndings of Ikwuka et al. (2020) and Semerci and Aydin (2018), females tend to display higher levels of positive attitudes and digital competence compared to males. As the teaching profession is predominantly occupied by women and with China’s commit- ment to gender equality in education, it is plausible that women exhibit stronger attitudes and digital skills. Consequently, there is no signiﬁcant disparity between men and women in terms of between teachers’ attitudes and self-efﬁcacy based on their age. However, a signiﬁcant difference exists in terms of in-service teachers’ digital competence, digital tools utilization, and ICT integration, aligning with the conclusions drawn by Şen and Yildiz (2022) and Šabić et al. (2021). Speciﬁcally, teachers aged 31–35 years exhibit notably stronger digital skills, greater digital tools utilization, and higher proﬁciency in integrating ICT com- pared to individuals aged 20–30 years or above 35 years. Con- sequently, teachers in the approximate age range of 30 years can be considered the key drivers of digital teaching. When providing training to enhance digital technology skills, it is crucial to prioritize the capacity building of both younger and older teachers.",
    "distinction in the utilization of digital tools among in-service teachers, a signiﬁcant difference exists in terms of their attitudes, self-efﬁcacy, digital competence, and ICT integration based on their teaching experience, corroborating the ﬁndings of Baroudi and Shaya (2022) and Kalra (2018). Speciﬁcally, teachers with less than three years of teaching experience demonstrate signiﬁcantly stronger attitudes, self-efﬁcacy, digital competence, and ICT integration compared to those with more than 10 years of experience. It appears that teachers with greater experience may exhibit a decline in their utilization of ICT, potentially due to complacency or a reduced drive to adopt new technologies. Conversely, teachers with less experience, who may be in the early stages of their careers, exhibit a stronger inclination to work and learn, resulting in more efﬁcient cultivation of their digital skills and applications. This research introduces an innovative framework that merges the TAM3 and WST models, incorporating elements of ICT integration that impact in-service teachers. Additionally, our model supports a portion of existing research that explores the factors affecting TAM3 and WST models. The objective was to develop a robust framework within a contemporary context, emphasizing the factors that inﬂuence the adoption of ICT by in- service teachers in educational institutions, which are recognized as vital contributors to the educational system. The ﬁndings of this study illustrate the interconnected rela- tionship between teachers’ attitudes, self-efﬁcacy, digital compe- tencies, and digital tools utilization, all of which have an impact on their integration of ICT. Based on our results, in-service tea- chers can enhance their effectiveness by optimizing ICT content, collaboration strategies, and communication methods. Teachers fostering positive attitudes and self-efﬁcacy, recognize that developing strong digital skills, and actively employing digital tools are essential for successful ICT integration. Therefore, educational institutions should implement diverse approaches such as seminars, training programs, and other methods to enhance these inﬂuential factors and promote the effective use of ICT in teaching. While this study provides innovative insights into the theore- tical and practical aspects impacting the ICT integration of in- service teachers, it is essential to acknowledge its limitations. Primarily, the generalizability of the ﬁndings is limited due to the exclusive focus on data from China. Therefore, it is recommended that future research includes data from teachers in diverse countries to ensure broader applicability. Additionally, this study only examined four inﬂuencing factors, and the quantitative analysis of these factors had certain limitations. Subsequent studies could address this gap by conducting a comparative analysis of the factors inﬂuencing ICT integration among in- service teachers in different countries. The datasets generated during and/or analyzed during the current study are available from the corresponding author upon reason- able request."
]