[
    "Comparing with cities, rural communities especially those declining rural communities have become vulnerable to natural disasters owing to their backward socioeconomic conditions. Taking Xun County of China’s Henan Province as the study area, the paper aims to evaluate rural community resilience to flood by unveiling the connection between individuals’ cognition, follow-up actions and the community resilience. Research results show that: (1) The logic chain exists as individual’s cognition to disaster leads to their constructive actions to cope with disaster, which contribute to community resilience. (2) At the cognition dimension, individual’s knowledge reserve of disaster prevention and their recognition to local authority are playing an important role in their decision making and follow-up behaviors when disaster occurs. (3) At the action dimension, individual's familiarity with the disaster preparedness, efficient information transmission when disaster occurs and villagers’ following order and their unity of action all contribute to community resilience to disaster. The paper proposes ways to improve rural community resilience to disasters based on the research findings. As the world has transformed from agriculture-based rural society to capital, industry and knowledge-based urban society, rural decline owing to depopulation and other related factors like industrial recession has become a global tendency which has swept both developed and developing countries'. This has further aggravated rural vulnerability to cope with those increased risks and unexpected challenges such as natural disasters associ- ated with anthropogenic climate change. Within this background, sustainable communities have drawn public attention for the sake of ensuring people's livelihood, welfare and socioeconomic stability etc. According to Hsine’ and Haight’, sustainable communities are characterized as ecologically friendly, socially harmonious, and economically efficient places where people have strong sense of belonging, community participation, and shared ecological and cultural awareness. Further, sustainable communities are also believed to meet the needs of current and future generations, and to provide opportunities and choices to enable local residents to achieve sustainable development*». Generally, rural community is a complex and dynamic system which consists of both material elements like space, natural endowments and immaterial elements like norms, institutions. It is the interactions between rural internal system and the external environment that promote rural evolution which may turn into different development patterns like growth, stagnation or decline®. Thus, there exists no single model to revitalize and sustain rural communities especially in a context of increasing incidences of natural disasters across the world. As a result, there is widespread interest from both academic and governmental spheres in understanding the patterns of resilience exhibited by rural communities to mitigate the impact of natural disasters and create adap- tive measures for future risks. The concept of resilience which is widely used in the fields of ecology, material science and biology etc. has become an essential aspect of sustainability to describe the ability of a complex system characterized by the nonlinear interactions of economic, social, environmental and institutional subsystems to withstand, adapt and continue to develop when facing unexpected shocks and risks’\"'°. Community resilience reflects the capacity of rural communities to proactively resist, recover and adapt to adversity and disturbances and it tightly relates to the decision making and behaviors of local stakeholders who operate within the community’s economic, social and environmental subsystems'!!°. Arbon.'° described community resilience to disasters as “... where members 1Key Laboratory of Regional Sustainable Development Modeling, Institute of Geographic Sciences and Natural Resources Research, CAS, Beijing 100101, China. *University of Chinese Academy of Sciences, Beijing 100049, China. ?College of Humanities and Development Studies, China Agricultural University, Beijing, China. “School of Public Administration and Law, Northeast Agricultural University, Harbin, China. email: livuheng@igsnrr.ac.cn of its population are connected to one another and work together, so that they are able to function and sustain critical systems, even under stress; adapt to changes in the physical, social or economic environment...”. Case studies also proved the importance of local stakeholders’ self-organized actions with shared values and attitude in carrying out rural revitalization initiatives!’. Besides, literatures also mentioned other necessary components to contribute to community resilience, including economic and social capacity, organizational capacity and community competence as well as information flows and communication capacity'*!*-?5\"4, Rural China has been facing depopulation and other emerging socioeconomic problems as the state promotes its rapid urbanization and industrialization development during the past decades. In this process, those agricul- ture, forestry or other natural resources-based communities which are situated outside the positive influence of the metropolitan regions are inclined to decline”. As a result, rural decline which is manifested as rural hollowing and other related recessions has become the focal point of China’s rural revitalization strategy which was launched in 2017. Being a country of huge population and large territory of complicated and diverse socioeconomic as well as climatic conditions, China has been suffering various climatic disasters. The past 30 years have witnessed around 358 million people who were swept by various natural disasters in China*’. Generally, comparing with cities, rural communities especially those declining communities have become vulnerable to natural disasters owing to their backward socioeconomic and infrastructure conditions. It thus becomes necessary to evaluate and enhance rural community resilience so as to better cope with natural disasters in the future.",
    "In this study, we consider rural community resilience as a capacity which not only recognizes and anticipates the scope of damages, but also integrates multiple actors (public, private, nonprofit organizations) and coordi- nates their actions when facing natural disasters and other shocks. What’s more, besides those external support from the public organizations and governments, a key hypothesis underpinning the research of the paper is that local stakeholders’ cognition and their actions before, during and after disasters play an essential role in build- ing community resilience. In this sense, the paper aims to examine rural community resilience to disaster from the perspective of individuals’ cognition to disaster and their follow-up actions. The study area of this paper is Xun County which is located in Central China’s Henan Province. In July 2021, Xun County suffered extremely heavy rainstorm and flood disaster while 94% of its population were affected. This flood was unusual and can be used as a suitable research case to examine rural communities’ disaster response, post-disaster recovery as well as local residents’ cognition to disaster. The structure of the paper is as follows. After the introduction, the paper reviews related literatures and creates a theoretical framework by integrating people’s cognition, follow-up action and community resilience. The third section illustrates the study area, research methodology and data source. The fourth section displays and analyzes the research results. In the end, the paper closes by discussing research findings and conclusions. To date, scholars have used various methods to measure community resilience given the fact that there are no universally accepted measurement tools. Data limitation and diverging indicators of resilience are also challeng- ing the measurement of community resilience. Kapucu et al.?* conducted mail and online survey of emergency management professionals in eight Central Florida counties of the US to investigate the characteristics of disaster management in rural communities and ways to strengthen emergency management systems to develop and improve community disaster resilience. Boon’ carried out individual and group interviews of four disaster- impacted rural communities in Australia and examined significant generic factors to community resilience based on people’s views and attitudes. Hong et al.” used people’s mobility data (800,000 mobile devices) before, during and after the hurricane Harvey in the US in 2017 and measured inequality of community resilience which was considered as a function of the magnitude of impact and time to recovery. Suet al.*° depicted the evolution of rural community resilience in China’s Qinghai-Tibetan Plateau and found changing stages of resilience given to the differences of governmental interventions and community self-organiza- tion abilities. What's more, there are also studies focusing on local stakeholders’ perceived community resilience which is measured by assessing individual’s perceptions of their community’s reactions to natural disasters””*!-**. Given the above descriptions about community resilience, we believe that it is the local villagers’ views, aware- ness and attitudes as well as their behaviors that form and support community disaster resilience. As Imperiale and Vanclay**° indicated, community resilience has both cognitive and interactional dimensions. Resilient communities are normally considered to be the places where residents tend to have better cognition and aware- ness of local vulnerabilities and stronger intention and bottom-up initiatives to change the situation'’. This is manifested by their decision making and actions when dealing with challenges and shocks. And this further explains why some rural communities are more resilient than others when disasters occur. Generally, individuals’ cognition towards disaster consists of four dimensions. The first dimension is their awareness and knowledge of potential disasters to local communities. This tightly relates to disaster preven- tion, preparedness and mitigation programs before disaster occurs. Sim et al.*° highlighted that comparing with material aid, the awareness of disaster prevention and public participation are the key variables which are significantly and positively correlated with community disaster resilience. The second cognition dimension is individual’s authority recognition under which the local villagers will follow orders and arrangements issued by the community committee during the disaster resistance and recovery periods. This helps to guarantee the unity of local residents’ action to mitigate disaster instead of staying in chaos. The importance and effective- ness of authority recognition were proved in Yang et al’s** study of measuring community disaster resilience in China’s Loess Plateau. Research findings showed that resilient communities are those where village committees and residents can work cooperatively and coherently. The third dimension of cognition is individuals’ aware- ness of self-participation and active involvement in resisting and mitigating disasters. This tightly connects to individuals’ sense of place and their local identity which are considered as the fourth dimension of cognition.",
    "‘The stronger of residents’ sense of place and local identify, the more active they will be to participate in disaster mitigation and recovery. All the above-mentioned aspects of individuals’ cognition are expected to lead to local residents’ proactive actions and response to cope with disasters. Thus, we draw Fig. 1 to capture the relationship between individuals’ cognition, their behavior and community resilience in response to disasters. Xun County is located in the northern part of Central China’s Henan Province. This county covers a total area of 966 square kilometers while 82% of its territory is plain and 18% is hilly areas (Fig. 2). With 748,000 population, Xun County administrates 7 townships and 4 urban districts as well as 438 villages. In 2021, the county's gross domestic product (GDP) reached 29.38 billion RMB while the per capita GDP was 23,922 RMB. Xun County is located in the middle and lower reaches of China's Yellow River while the Wei River runs through its entire territory. The county is susceptible to floods due to its low terrain. In July 2021, the upper reaches of the Wei River experienced extensive and lasting heavy rainfall which resulted in soaring water level of the Wei River and the Communist Canal. As a result, big flood occurred and swept Xun County. 94% of its total population were affected with the direct economic loss reaching over 9.76 billion RMB. Beside the downtown area, the major part of Xun County is rural where local economy and people’ liveli- hood are based on agriculture. In the meantime, Xun County faces risks of flood because of the Wei River. Thus, many villages are vulnerable to flood. By selecting Xun County as the study area, we aim to contribute to the literature on rural development strategies and resilience building in disaster vulnerable regions. The devastating flood which occurred in July 2021 highlighted the vulnerability of the county and the urgent need for effective disaster management strategies. The study aims to analyze the impact of this event on the local rural communities and explore ways to build rural disaster resilience. Lessons drawn from Xun County are expected to generate enlightenments for rural places which are facing climatic disasters across the world. Based on the theoretical framework, the paper hypothesizes that individuals’ cognition leads to their proactive actions when disaster occurs. These will finally contribute to rural community resilience to disasters and dem- onstrate the coping ability of communities to withstand disasters. To measure rural community resilience, the first step is to select and determine indicators which are depicting people's cognition and follow-up behaviors. Then, the research team made questionnaires and carry out rural survey in Xun County. The final step is to sort data and measure community resilience with entropy methodology. ‘The survey design aims to measure the resilience of rural communities by selecting indicators that reflect people's cognitive processes and behavior in disaster scenarios. An index system has been constructed for evaluat- ing resilience based on the four dimensions of cognition. Each dimension was chosen based on their theoretical importance for understanding how individuals and communities prepare for, respond to, and recover from disasters. First, disaster prevention awareness and knowledge reserve refer to villagers’ awareness and knowledge of potential disasters to local communities. In this study, it is manifested as relevant knowledge in the pre-disaster phase, such as household emergency plans and mitigation programs making before disaster occurs, and their awareness of disaster knowledge reserve. Second, authority recognition refers to the degree of individual's following orders and arrangements issued by community committee when facing disasters. In this study, this dimension is assessed by a series of villagers’ behaviors and opinions, such as whether they can obey commands in an orderly manner, whether they trust the village cadres, and whether they can actively cooperate with reconstruction after the disaster. Third, self-participation awareness refers to the enthusiasm of local residents’ active involvement in resisting and mitigating disasters. This dimension is evaluated by local residents’ behavior during post-disaster recon- struction period. The survey questions focus on whether villagers can help each other, whether they can actively participate in discussions and management of public affairs. Finally, people’s sense of place leads to their participation in disaster mitigation. In this study, this dimen- sion is examined from the perspectives of folk customs and residents’ attention to the community development.",
    "After establishing the evaluation index system, it is necessary to further quantify the weights of indica- tors. Entropy method is used to determine the weights of evaluation indicators to eliminate subjective factors. Entropy is a concept derived from physics, originally referring to a measure of the disordered state of a system. In information theory, entropy is a measure of uncertainty, which can be calculated based on the characteristics of entropy to determine the degree of dispersion of a certain indicator and then determine its weight. In general, the greater the dispersion of indicators, the greater their impact on comprehensive evaluation. By referring to Sovacool et al’s *” methodological review, the design of the research and the above-mentioned methodology tend to increase the robustness and novelty of this study. There are n villages with h evaluation indicators, and the original indicator matrix is established as X= {xij}n x et <i<nl<j< h), which xj is the value of the j indicator in the i village. Non dimensional processing, The indicators involved in this study are all positive indicators. The values of each evaluation indicator after standardization are within the range of [0, 1]. To ensure a comprehensive evaluation of rural resilience level, this article determines the weights of the four dimensions of resilience indicators as 1/4, and then uses the entropy method to assign weights to the 10 indicators to evaluate the rural community resilience level. On the basis of normalizing the indicators according to formula (2), calculate the entropy values of each indicator Ej, as shown in formulas (3) and (4). Calculate the standardized values and weights of each dimension according to formula (7) to obtain the resilience level of each indicator Rx. The standardized processing results of the 10 sub indicators in the rural resilience evaluation index system are overlaid with their weights to obtain the comprehensive resilience level of rural areas R. Xun County is of high population density (774 people per square kilometer) and each township consists of over 60 villages. Overlap of the research results at village level will occur if each village community is used as the research unit. For the sake of map quality, the paper takes township as the unit to explicitly present the research findings. The authors conducted household survey which covering 504 administrative villages in Xun County. The survey was carried out by scholars from the Institute of Geographic Sciences and Natural Resources Research, Chinese Academy of Sciences in March and April, 2022. This survey consists of detailed investigation before, dur- ing and after the flood. The dataset with questions covering individuals’ multiple cognitive opinions and behav- iors, cooperating attitudes, and social capital, serves as a robust foundation for achieving the study’s research objectives. The survey included self-reported household information on demographics, livelihood capital, multiple shocks, and coping strategies. Questions are consistent with the evaluation index system in Table 1. The village committee director who are familiar with their village were invited to answer the questionnaire. In this process, the committee directors were asked to complete the survey independently and objectively. To improve our empirical estimations, we cleaned the data rigorously in three steps. First, samples with miss- ing or abnormal values on social capital were excluded. Second, we deleted samples that reported missing values for variables representing cooperating attitude. Third, we excluded samples that reported missing or abnormal answers on the personal identity information. We finally obtained 418 valid questionnaires. The survey questions are based on the index system in Table 1, which integrates the main viewpoints of previous literatures on community disaster resilience. Through statistical analysis, the survey results have well presented the process and logic from individual’s cognition to action when disaster occurs. It is in consistency with existing theories of community resilience. Table 1. Evaluation index of rural community disaster resilience. All indicators are calculated using the entropy met! od, with scores expressed as any value between 0 and 1. The resilience of each dimension and the total resilience are obtained by adding the weights of each indicator, with the same value range. According to the damage of the villages, the paper divides the surveyed villages into three categories: mostly affected, partially affected and little affected. Statistics show that there are 162 mostly affected villages which account for 38.76% of the total surveyed villages. 144 villages are partially affected, accounting for 34.45% while 112 villages were little affected, accounting for 26.79% of the surveyed villages. According to Fig. 3, the north and south parts of Xun County suffered higher level of damage than other parts. We can see that those mostly affected villages are mainly located along the Wei River and Communist Canal. These include Xiaohe Township, Xinzhen Township and Wangzhuang Township. However, Pishan District, Shantang Township an are further away from Wei River and the Communist Canal were relatively less affected. Liyang District which According to the degree of socioeconomic recovery after the flood, the paper divides the research villages into three categories: fully recovered, partially recovered and unrecovered villages. According to Fig. 4 the peripheral townships of Xun County are comparatively better than the central places in terms of ost-disaster recovery. However, the overall level of post-disaster recovery of Xun County is still low during the survey time especially in Xunzhou District, Pishan District and Tunzi Township.",
    "As shown in Fig. 5, the rural community disaster resilience of Xun County is at high level as a whole and the average resilience value is between 79 and 95%. There are obvious s atial differences in the community disaster resilience at the township level. The community resilience in the central part of Xun County is higher than that of the surrounding areas. For example, the community resilience of the Xun zhou District, Baisi Township and Pishan District are higher than other areas, with their resilience va ues at 0.95, 0.94 and 0.93, respectively. The paper further maps the spatial distribution of the four asp’ average value of disaster prevention awareness and knowledge rese ects of individuals’ cognition in Fig. 6. The rve of all townships is 0.90, which is at high level. And the western and northern parts of Xun County have higher values of disaster prevention awareness and knowledge reserve than other places (Fig. 6a). Among all the towns are of the highest scores at 0.93 and 0.94, respectively. ips, Baisi Township and Weixian Township As shown in Fig. 6b, the central areas of Xun County have higher values of authority identification than other places. In addition, the index value of Xiaohe Township, Xinzhen Township and Liyang District are obviously lower than other areas. The average value of self-participation awareness of all townshi s is 0.8.8 As Fig. 6c shows, the central and west parts of Xun County have higher level of residents’ self-participation awareness than other places. However, Xiaohe Township has lower level of self-participation awareness (0.81). As for the sense of place, beside Xiaohe Township, Liyang District, Tunzi Township and Weixi District, all the other townships have higher values of residents’ sense of place (Fig. 6d). This suggests that these four aspects of cognition have directly built up and contributed to local residents’ reaction to the flood disaster, and thus play a positive role in improving community disaster resilience. Peasants’ knowledge of disaster prevention measures before the disaster are the key factors to reduce risk. This survey selected three indicators: whether the peasants’ families in the village have emergency plans and pre- disaster measures for flood, whether villagers are familiar with the disaster prevention and mitigation plans and measures, and whether the villagers clearly know what preparations need to be made when flood occurs. As shown in Table 2, only 18.77% of the rural households of Xun County have formulated emergency plans and measures for flood while 49.52% of the villagers are very familiar with the disaster prevention and mitigation plans and measures. According to Table 2, the variance at township level is not significant. It is worth noting that knowledge reserves are limited to the collective level. Compared to their own families, villagers have a more sufficient knowledge reserve about collective action. However, ignoring individual level contingency plans tends to cause greater loss of life and property. At the time of floods, whether people have mastered the response measures has a decisive impact on whether they can effectively mitigate disaster impact. The survey results show that only 21.64% of the villagers of Xun County clearly know what preparation work and countermeasures need to be done. For taking correct actions to deal with disaster losses, more emphasis is needed on the spread of knowledge. When flood occurs, whether the villagers can follow the command of the village committee and act in an orderly manner reflects the villagers’ recognition of local authority. Cooperation and trust among the community resi- dents are crucial when floods occur. Better command effect leads to better disaster countermeasure. The trust in leadership and the willingness to cooperate in post-disaster reconstruction have shown poor performance (10%). Differences of residents’ authority recognition among townships mainly focused on the accessibility of information. According to Table 3, at the time of the flood, 77.34%, 69.98% and 68.75% of the villagers in Xunzhou Dis- trict, Baisi Township and Pishan District were able to follow the command of the village committee and act in an orderly manner. The villagers in Xiaohe Township, the worst-hit township, have the worst performance in this regard. Only 45.65% of the villagers can follow the command of the village committee in an orderly manner. Most townships can reduce disaster losses by taking collective actions.",
    "‘The results further show that in the process of flood relief, only 8.5% of the villagers of Xun County have great trust in village cadres. Among the 11 townships, the lowest value of the research results is still Xiaohe Township, only 7.6%. In the process of post-disaster reconstruction, 11.67% of the villagers of Xun County were able to cooperate actively. Among them, the villagers in Pishan District, Baisi Township, Xunzhou District and Shantang Township performed relatively well, which were 13%, 12.29%, 12.07% and 11.94%, respectively, which were higher than the average value of 11.67% in the county. In short, among the 11 townships of Xun County, the villagers in Xunzhou District, Baisi Township and Pishan District have relatively high recognition of the authority identification, while Xiaohe Township has the lowest recognition. The empirical results show that the higher the villagers’ recognition of the authority identification, the more conducive it is to the smooth development of disaster prevention and post-disaster reconstruction. The cadres of villages and townships of Xun County should be further strengthened in obtaining villagers’ trust. When the flood occurs, the villagers are the main body to bear the disaster risk. Villagers’ high sense of inde- pendent participation is the key factor to deal with the disaster, which is conducive to the formation of strong collective social capital and the improvement of the government's work efficiency. The questionnaire survey focuses on whether the villagers can help and care for each other in the process of flood relief and post-disaster resettlement, whether the villagers are keen to participate in the management of public affairs in the village and express their views, and evaluates the villagers’ awareness of independent participation. As shown in Table 4, in the process of flood relief and post-disaster resettlement, the situation that the villag- ers can help each other and care about each other is generally poor. Only 34.89% of the villagers of Xun County can help and care for each other in the process of flood relief and post-disaster resettlement. In the process of post-disaster reconstruction, 53.43% of the villagers of Xun County are keen to participate in the management of public affairs in the village and express their views. Although the proportion is generally higher than that of the villagers who can help and care for each other, the overall level is at a general level. This shows that when disasters occur, villagers rely more on state and social assistance, and their subjective initiative is low. Post-disaster reconstruction relies on people. On the one hand, we should focus on the recovery of ‘hardware’ in the disaster area, and on the other hand, we should pay attention to the mental health of the victims. Every farmer’s own active disaster relief is more effective than government assistance and social support to reduce psychological pressure, and to a certain extent, it can prevent social problems such as order imbalance or instability caused by post-disaster. The enthusiasm level of local people's participation in public affairs reaches 50%. While level of mutual assis- tance among residents is only around 30%. This is strongly related to the political system of grassroots commu- nities in China, where residents place greater emphasis on collective knowledge and action. This characteristic was also reflected in the authority identification section. The sense of place belonging represents the villagers’ recognition and attachment to local infrastructure, envi- ronmental sanitation, living conditions, and the masses. After the disaster, a good sense of place belonging is conducive to stimulating the villagers’ strong sense of home, which plays an important role in promoting post- disaster reconstruction. The questionnaire survey contains two indicators: whether the village style and folk customs are good, and whether the villagers are very concerned about the development of the village, reflecting the status quo of the villagers’ sense of local belonging. According to the survey data shown in Table 5, 49% of the villagers of Xun County think that the village style and folk customs are good, and 47.46% of the peasants are very concerned about the development of the village, which is at a lower-middle level. In the context of urban and rural development and diversified interests, the sense of place belonging of villagers in some areas has weakened, which is detrimental to the effective response to major disasters and risks. A strong sense of place belonging helps villagers work together in the face of com- mon disasters and risks.",
    "Sense of place shows the best overall performance among four dimensions. Half of the residents are able to view social networks from a positive perspective, and willing to pay attention to community development. This indicates that the community has a high level of social capital reserves and a structural foundation for collective action and mutual assistance. Based on the above spatial distribution of disaster situation, except for a few townships, there is not much absolute difference in resilience in terms of self participation awareness and sense of place among the townships in Xun County. Therefore, what truly widens the overall resilience gap is the weak factors of each township, especially the authority identification. Compared to further leveraging advantageous factors, reinforcing weaknesses plays a more important role in improving the disaster resilience of rural communities. Comparing with the disaster situation and overall resilience, townships with lower knowledge reserves may also exhibit higher resilience (such as Xunzhou District), and townships with severe disaster situations may also have higher knowledge levels (such as Weixi District). However, there is almost a significant positive correlation between authority identification and overall resilience. We can conclude that there are differences between theo- retical knowledge and practical knowledge in the process of responding to natural disasters in rural communities. Theoretical knowledge determines the upper limit of practical knowledge, but it is practical knowledge that truly determines the performance of community resilience. If theoretical knowledge is difficult to effectively transform into practical knowledge, prevention work cannot be effectively applied when disasters occur. According to the definition in this article, the higher the resilience of rural communities to disasters, the bet- ter their performance in combating disasters should be. This performance is divided into resistance to actively responding to disasters and recovery to quickly restart after disasters. These two factors together create a rural community’s performance in facing disasters, and resistance, as the actual first response to disasters, should have a greater impact on the overall performance of rural communities than the impact of post disaster recovery. Com- bining the two, the better the overall performance of rural communities, the smaller the losses caused by disasters. Next, based on this inference, we constructed an evaluation index system for resistance and recovery from other questions in the previous questionnaire survey (see Tables 6 and 7), and used the entropy method to cal- culate the performance scores of each township (out of 1). From the above-mentioned figures, we can see that the total disaster resilience is consistent with the represent- ative indicators of community resistance to natural disasters. Rural communities with relatively high resilience will inevitably take the lead in the aspect of resistance, while the correlation of recovery is not that significant. This also demonstrates in the comparison between data and reality that resistance, as the first response, plays a more important role in the resilience level of rural communities when disasters occur. Climate change and its induced disaster events have arisen public concerns to sustainable development of human being and calls for trials to enhance human resilience in every aspect. As rural decline has become a global tendency, it becomes necessary to improve rural community resilience against natural disasters and other unex- pected shocks. The study of this paper proves the important roles of individual’s cognition towards disaster and their follow-up actions in constructing rural community resilience. The research findings have several implica- tions for policy making. First and foremost, it is necessary to provide local residents with more training and publicity about disaster prevention and preparedness. Villagers’ knowledge about disaster directly leads to their actions in terms of house- holds’ disaster prevention and resistance when disaster occurs. This will contribute to individual’s emergency response and disaster relief. In the meanwhile, each community should make its own disaster prevention and mitigation program which includes emergency materials reserve, disaster relief training and publicity as well as infrastructure construction like public shelters and water supply and drainage facilities. Reshaping and establishing authority of local governments or village committee is needed to consolidate residents’ trust on the governing agencies. This helps to transmit disaster information and relief orders or arrange- ments down to each household. With the trust and authority recognition, local residents thus tend to follow the orders issued by the local governments or village committee, and respond with unity of actions when disaster occurs. In this process, trust and proximity in social networks are of great importance in developing sustainable communities. Local actions and interactions are expected to contribute to solving climatic disasters**.",
    "Finally, there need to improve local residents’ sense of place. For one thing, residents are encouraged to participate in community governance to cultivate their self-participation awareness of community issues. For another thing, rural social capital—mutual trust, social norms and attitudes should be cultivated among vil- lagers and village committee so as to enhance neighborhood interaction and deepen their sense of community identify and belonging. All these measures are expected to contribute to people’s participation in community recovery construction and care about others like those vulnerable group of people when coping with disasters. The evaluation index system used in the paper considers rural community resilience to natural disaster as a comprehensive capability which is shown before, during and after the disaster. It integrates multiple actors (public, private, non-profit organizations) and coordinates their actions to cope with disasters. In addition, this model can better elucidate the spatial differences of community disaster resilience based on the four cognition dimensions and derive key influencing factors of different communities. Therefore, these four evaluation dimen- sions of cognition can be applied to community disaster resilience studies in other background. And the specific evaluation indicators could be adjusted according to research needs. With community-based surveys in China’s Xun County, the paper evaluates rural community resilience to natural disaster based on the hypothesis that local stakeholders’ cognition and follow-up actions play an important role in resisting disasters. The research findings have proved the hypothesis. To conclude the study of the paper, we believe that rural community resilience to disaster relies on villagers’ cognition to disaster and their follow-up actions before, during and after the disaster. For one thing, individual's knowledge of disaster prevention and their authority recognition decide how they behave when disaster occurs. For another thing, individual’s familiarity with the disaster preparedness and mitigation programs, disaster information transmission and villagers’ unity of actions all contribute to community resilience to disaster. The datasets generated and analyzed during the current study are not publicly available due to the consideration of high accuracy of administrative village survey data involves privacy and trust issues for interviewees, but are available from the corresponding author on reasonable request."
]