[
    "State Revenue Extraction and Local Collection Expediency in Qing China: “Equal Sharing” of Tax Quota on “Renamed lands” in Henan Province This article investigates tax disputes between Luyi County, Henan Province, and its two neighboring counties during the Qing. It shows that the Qing central government and the provincial authorities allowed local governments to use an expedient scheme called “equal sharing” to fulfill tax quotas on a particular type of farming land—the former princely estates of the Ming that became known as “renamed lands.” In Luyi local elites’ fight against the perceived unfair tax practice, local gazetteers played an important role as evidence in the disputes and as reminders of the unresolved issue for Luyi people. In the final analysis, this casestudypointstotheQingstate’sflexibilityinfulfillingthelandtaxquotas,whileattempting to keep transaction costs low and revenue sources sustainable, both of which were ironically conditioned by its limited tax basis and therefore its limited administrative capacity. In the autumn of 1750 the Qianlong emperor was touring Henan Province south of Beijing. When he arrived on October 17 in Tangyin 湯陰 County, Kong Xingze 孔興澤, an elderly man from Luyi 鹿邑 County (about 174 miles away in eastern Henan), along with two other men, confronted the imperial convoy on the road to submit a petition on behalf of Luyi people about certain land tax disputes with local governments.1 Qing law permitted ordinary people to appeal to the emperor at a proper venue for intervention in wrongful treatment or criminal conducts by any officials after they had exhausted legal processes at lower-level jurisdictions—a practice called kouhun 叩閽.2 Yet, an act of 2Jonathan Ocko, “I’ll Take It All the Way to Beijing: Capital Appeals in the Qing,” Journal of Asian Studies 47, 2 (1988), 291–315. ©TheAuthor(s),2025.PublishedbyCambridgeUniversityPress.ThisisanOpenAccessarticle,distributedundertheterms of the Creative Commons Attribution licence (http://creativecommons.org/licenses/by/4.0), which permits unrestricted re-use, distribution and reproduction, provided the original article is properly cited. bypassing lower level jurisdictions to sue or appeal at a higher level yuesu 越訴, or confronting the imperial convoy on the road (chongtu yizhang 衝突儀仗), was itself a criminal offense under the law.3 Furthermore, the men were said to have committed the offense merely for “minor matters of land” (tiantu xishi 田土細事), unlike criminal cases of homicide or robbery. For the offense, these men were arrested, tried, and sentenced “in accordance with the sub-statutes,” as ordered by the emperor. The Henan provincial governor and the Board of Punishment proposed the penalties as follows: Kong Xingze was sentenced to 100 blows by heavy bamboo and exile to the frontiers, but his penalties were to be redeemed with monetary payment because he was over 70 years old; Hu Xuezhu, 36 years old, was given 100 blows and three years of penal servitude; Liu Jiuwei wasgiventhesamepenaltiesasHu’s,butexemptedfromthemforbeingover80yearsold. Kong Xingshen, the original author of the petition and brother of Kong Xingze, having passed away before the event, was not punished. The emperor approved these sentences on August 19, 1752.4 What was the matter that drove these men to take such travails and risk in asking for the emperor’s personal attention? And what was the central government’s response to their concerns that prompted their action? The case stemmed from a fiscal project of the Qing state to delineate, register, and tax the former princely estates (zhuangtian 荘田 or fanwang citian 藩王赐田) of the Ming dynasty—what would be called “renamed lands” (gengming tian 更名田) after 1669.5 The project was launched in 1645 under the Shunzhi emperor (r. 1644–1662) and completed during the Kangxi reign (1662–1722). Yet, the complex conditions of the princely estates and the difficulty in delineating and taxing such lands under the Qing led to disputes over who should pay how much tax on what land, which plagued county governments andtaxpayersinvariouslocalesincluding Luyi.6PeasantsinLuyi,especially larger landowners as local elites, believed they were unfairly taxed by local governments. Their direct petition to the Qianlong emperor in 1750 was a last resort to get their grievances redressed, after repeated complaints and petitions (diekong 叠控, zhengsong 3For the law on “confronting imperial convoy,” see Tian Tao 田涛 and Zheng Qin 郑秦, eds. Daqing Lüli 大清律例 (Beijing: Falü chubanshe, 1999), 304. 4Diyi Lishi Dang’an Guan 第一历史档案馆, Qingdai Tudi Zhanyou Guanxi Yu Diannong Kangzu Douzheng 清代土地占有关系与佃农抗租斗争, 2 vols. (Beijing: Zhonghua shuju, 1988), 1:17–20. The report originating from the Luyi county magistrate said that these men departed for Tangyin on November 5,1750(7thdayoftenthmonthofQianlong15),whichiseitheracopyingerrorbyacountyclerkoramemory lapse of the accused, given the date of the emperor’s arrival in Tangyin—October 17, 1750 (18th day of ninth month of Qianlong 15) (see Qianlong chao shilu 乾隆朝實錄 (hereafter QCS), 373.丁已. This source is accessed online and it has no page numbers. So date is used instead of page number after juan number.",
    "5In the English-language literature on the Ming dynasty, the issue of princely estates has not been given much attention. In The Cambridge History of China, for example, the chapter on the Ming state mentions princely estates in one sentence, and the chapter on the Ming rural administration discusses private land and government-owned land, but expressly skips princely estates and military colonies (see Cambridge History of China, vol.8. (New York: Cambridge University Press, 1998), 26; 475–76); nor has the issue of renamed lands been addressed in English-language scholarship on the Qing. There is a body of Chinese-language scholar- ship on both the Ming princely estates and their transition to renamed lands in the early Qing, some ofwhich will be cited in this article. 6Gugong bowuyuan mingqing dang’anbu 故宫博物院明清檔案部, Qingdai dang’an shiliao congbian 清 代檔案史料叢编 (Beijing: Zhonghua shuju, 1979), 4:149–255. This collection is the basic primary source on how the Qing state transformed the Ming princely estates into renamed lands to extract revenue from them, and Chinese-language studies on the issue are all based on it first and foremost, among other sources. 爭訟) at county, prefectural, and provincial levels came to naught in the previous eight decades. Delving into the history of the Luyi case, this article adds critical nuances to our understanding of the Qing state approaches to revenue extraction, and it also examines the responses from taxpayers who tried to defend their interests with all available means including the use of local gazetteers. The existing scholarship shows that the Qing state sought innovative ways to extract revenue from limited taxable sources, while showing benevolence by keeping taxes on the peopleaslowaspossible.Forinstance,MadeleineZelin’sbookonhuohaoguigong火耗歸 公 under the Yongzheng emperor argued that although the reform would ultimately fail in its goal toward the end of the Qianglong reign, it “marked an important step in the development of a modern state in which the concept of the government responsibility goes beyond the collection of taxes and the maintenance of public order,” as the reform was designed to improve government administration and expand public projects includ- ing transportation, public welfare, water conservancy facilities.7 Discussing the Qing state’s maintenance and operation of ever-normal granaries in the face of difficulties during the Qianlong reign, R. Bin Wong also concluded that such efforts “demonstrate bureaucratic capacities and commitments in an eighteenth-century setting.”8 Similarly, Wenkai He examined how the Qing state financed local water-control projects through an innovative practice—it would advance loans for such projects without interest, and communities benefittingfromthose projectswouldpaybacktheloan tothe statethrough paying extra land taxes for a certain period of time; and some of such debts owed by communities were eventually cancelled.9 Yet these episodes of fiscal innovation appeared ironic and poignant in the larger historical context: the Qing state’s commitment to fiscal conservatism in regards to agricultural taxes from the Yongzheng reign (1722–1735) all thewaytotheearlytwentiethcentury.InthewakeofthetraumaticMing–Qingtransition, normativeConfucianethicsofbenevolentgovernancewasreinforcedbutlargelyreplaced by an empirical, realist, and Malthusian ideology that informed policy-making in the Qing court. The aim was to not risk rebellion by taxing the people beyond what the finite farming lands in the country could produce to sustain a growing population. And this in turn limited the Qing state’s administrative (including taxation) capacity and led to its fiscal crisis after the mid-nineteenth century.10 Consistent with the scholarship outlined above, this article focuses on a particular practice in local tax collection during the Qing. The scheme was that the prefectural and countygovernmentswoulddistributesharesoftaxquotaonrenamedlandsinagivenlocale onto a larger number of taxpayers across counties. The practice was phrased as “equal sharing”(juntan均摊)bylocalofficials,butwasperceivedbyadverselyimpactedtaxpayers asanunfairpractice,whichtheycalled “spreadingout”(feisa飞撒or飞灑),ascheme used by some county magistrates to collect informal and illegal revenues in tax-collecting process. Due to repeated complaints from Luyi elites, along with communications within 8R. Bin Wong, “The Grand Structure, 1736–1780,” in Nourishing the People: The State Civilian Granary System in China, 1650–1850, ed. Pierre-Étienne Will, R. Bin Wong, and James Lee, 43–73 (Ann Arbor: University of Michigan Press,1991), 43. 10This is thoroughly examined in Taisu Zhang, The Ideological Foundations of Qing Taxation: Belief Systems, Politics, and Institutions (Cambridge: Cambridge University Press, 2023). the administrative hierarchy, the higher authorities were fully aware of the juntan scheme but consistently allowed it. Explaining the Qing state’s rationale for such a practice, this article shows that while constrained by the principal–agent relationship within the state system on the one hand and by the Confucian ideology of low taxes as benevolent governanceontheotherhand,theearlyandhighQing(1645–1795)statepracticedrevenue extraction through adopting multiple and variable schemes targeting specific taxable properties, rather than relying on one unified taxation model, to fulfill the tax quota in the books, at the lowest possible transaction cost.11 The irony, however, is that the innovation or flexibility occurred within the larger context of the Qing state trying to avoid tax riots (or worse) by refusing toexpand agricultural taxesbeyondthe tax quotas fromthe Ming dynasty, while land and labor-service taxes remained the mainstay of state revenue during the Qing, and by refusing to conduct national and provincial cadastral surveys, necessary for effective land registration, tax assessment, and tax collection. Thus, the fact that the Qing state collected taxes at the lowest possible transaction cost also means that it did so with limited taxation capacity.12 This article also highlights a particular element in the ways local elites would try to defendcommunalandpersonalinterests,i.e.,theuseoflocalgazetteers.Sourcesshowthat in late imperial China adjudicating officials—from the Board of Punishment and the BoardofRevenue,provincialgovernors,prefects,tocountymagistrates—wouldoftenuse local gazetteers as evidence, besides such documents as land sales contracts, tax receipts, and government records, in sorting out protracted disputes over landownership and tax liabilities. Using local gazetteers as evidence was not typically relevant in adjudicating private land disputes between individual owners, but it was relevant and critical to communal disputes exemplified in the Luyi case.13 Disputes over land tax quota were about gain or loss of collective interests, not only for landowners as taxpayers, but also county magistrates as tax collectors, for whom a higher tax quota would mean more efforts and resources to be devoted to the task of fulfilling that quota. In such situations, local elites and magistrates were in the same boat. Because local gazetteers were used as evidence or reference to help determine who owned what land and who should pay what tax onsuch properties, local elites and county magistrates who authored and revised local gazetteersinthedisputingcountieswouldmanipulatefactsaboutthedisputestoservethe interest of their own communities.14 As we shall see, factual materials in local gazetteers 11“Principal–agent relationship” is a concept developed by social scientists, and it has been used by historians as well, in analyzing the functioning of the state or other large organizations. It posits that a principal, such as a ruler, a state, or a corporation, must try to monitor, at certain cost (part of the transaction cost), his or its agentsor subordinates, such as officials, functionaries, managers, and employees, who possess moreinformation than theprincipal ontheoperation ofthesystem anditslocalscenarios and tendtobehave in self-interested ways that harm the principal’s interests, of which corruption committed by agents is a typical variety. “Transaction costs” refer to the costs of the state or the ruler negotiating an agreement on policy and of implementing policy, such as monitoring agents, learning administrative and technical practices, measuring and enforcing tax compliance, punishing non-compliance, and so on so forth. See, e.g., Margaret Levi, Of Rule and Revenue (Berkeley: University of California Press, 1988).",
    "12Yeh-chien Wang, Land Taxation in Imperial China, 1750–1911 (Cambridge, MA: Harvard University Press, 1973), 20–31; Zhang, The Ideological Foundations, 205–10, 223–31. 13For civil adjudications in the Qing, see Philip Huang, Civil Justice in China: Representation and Practice inthe Qing(Stanford:StanfordUniversity Press, 1996),78–87;LiangLinxia. DeliveringJusticeinQing China: Civil Trials in the Magistrate’s Court (New York: Oxford University Press, 2007), 150–57. were not passive, objective records but artifacts of discursive practices and subjective agency.Thus,thisarticleaddstoJosephDennis’sfindingsabouttheuseoflocalgazetteers by local elites in disputes over water resources between communities—such were com- mon practices in imperial China, even if local scenarios varied.15 IntheMingdynastytheemperorwouldgifteachofhissonsanddaughters,otherthanthe heir apparent, certain acreage ofland known as princely estates (fantian 藩田or citian 赐 田), taken from taxed farming land known as “people’s land” (mintian 民田). Normally, peasantsworkingonprincelyestateswouldnolongerpaytaxestothestatebutpayrentto estate owners. Such estates were also rewarded as imperial favors to high officials, generals, and eunuchs for their services to the emperor. One province often hosted multiple princes—three in Shandong and Shanxi respectively, two in Jiangxi, five in Henan, and seven in Huguang.16 Throughout the Ming, princely estates expanded continuously, as holders of such estates would acquire additional lands through legal and illegal means. By the mid-sixteenth century the total acreage of princely estates reached at least 750,000 qing 顷 (approximately 12.45 million acres, as 1 qing equals 100 mu 亩, and 1 mu is 0.166 acre), or over ten percent of all farming lands in the country.17 As an example, one princely estate was directly relevant to Luyi. Prince Fu, Zhu Changxun (1586–1641), was a favorite son of the Wanli emperor (r. 1573–1619); but he was not the first-born sonand therefore could not belegitimately made the heir apparent, to Wanli’s deep chagrin. For twenty years, the emperor struggled over who he would name as the heir apparent, under intense pressures from lobbying forces on behalf of two rivaling sons,before hehad toannounce thathisfirst sonwould betheheir apparent after all.18 To compensate Prince Fu for the “loss,” the emperor showered him with treasures, such as 300,000 taels of silver for his wedding, 280,000 taels for remodeling his princely palace in Luoyang, Henan province. Prince Fu was initially gifted 40,000 qing of land as hisprincelyestates,andtheamountwascutinhalfafterhighofficialsvigorouslyprotested against the unusually large size of the estate. Yet, 20,000 qing of land was still a huge size for a princely estate, and to make this number, tracts of land in different provinces, as far as Shandong and Hunan, were designated as the Prince Fu estates.19 Hence there were school instructors, local people, and yamen staff did most of the work. Local degree holders residing in their native places were the most important category of editorial personnel.” See Joseph Dennis Writing, Publishing, and Reading Local Gazetteers in Imperial China, 1100–1700 (Cambridge, MA: Harvard Univer- sity Asia Center, 2015), 132. 17Hou Jiaju 侯家驹, Zhongguo jingji shi 中国经济史, 2 vols. (Beijing: Xinxing chubanshe, 2008), 646–47. 18The issue of establishing the heir apparent was an important political drama during the reign of the Wanli emperor, which led to the dismissals and resignations of over three hundred high officials. See Ray Huang, 1587, A Year of No Significance: The Ming Dynasty in Decline (New Haven: Yale University Press, 1981), 75–95. As the expansion of princely estates reduced tax-yielding mintian, ever heavier tax burdens were shifted onto remaining mintian, that is, onto landowning and taxpaying peasants. This situation in turn drove a large number of landowning peasants to either becometenantfarmersby“donating”(touyi投役ortouxian投献)theirlandstoprincely estatessothattheywouldonlypayrent—oneofthewaysprincelyestatesweregrowingin size over time—or just abandon their lands to escape heavy taxes. In some cases, tenant farmers working onprincely estates were paying both rents toprinces and tax tothe state, which made their lives even more difficult and would also lead to resistance of all sorts. QingscholarswhoauthoredtheHistoryoftheMingstatedthat“nothingharmsthepeople morethan thegifted estates oftheimperial household,princes, andhigh officials.”21Even ifitwasofferedasajustificationfortheQingstateagendatotakeoverprincelyestatesand impose taxes on them, the indictment that the Ming practice harmed the people (and the state) was factually true.22 After the Manchu takeover in 1644, the Qing policy toward princely estates went through an evolution over time. Initially, the Manchu entered Beijing in the name of defeating the peasant rebels to avenge the death of the last Ming emperor.23 One of the first orders issued by the Manchu ruler was to protect the properties of the Ming imperial family and princes if they had submitted to the Manchu. The order was merely rhetorical, however. For one thing, another Manchu policy in late 1644 was for the Manchu imperial clan, nobilities, and bannermen to enclose large tracts of land as their estates, resulting in more than one million shang 垧 of land being enclosed before the enclosure ceased in 1648.24 Many of the lands thus taken were the Ming imperial and princely estates.",
    "In mid-1645 the Shunzhi emperor ordered that any members of the Ming imperial clan who became officials through civil service examinations be dismissed from offices, that is, even if they had submitted to the Qing. Moreover, land owned by any Ming imperial clan members who had died were confiscated as state-owned properties, and thosemembers oftheMingimperialclanwhowerestilllivingwouldbegivenappropriate acreages of land for self-support that were taxed as mintian.25 This change of policy on princelyestatewasmotivatedbytheQingstate’sacuteneedformorerevenueinthemidst of completing the military conquest of the entire country.26 In 1647–48 the Shunzhi emperor issued further edicts to the effect that all former princely estates, except those enclosed for the Manchu imperial family, nobles, and bannermen, be sold to people as taxable private properties (bianjia 变价) or be rented out as government-owned properties to tenant farmers and rent be collected by the 22On the political and ideological impact of the Ming collapse on the early Qing elites, including how History of the Ming was written by Qing scholar-officials, see Zhang, Ideological Foundations, 229–30. 23Frederic Wakeman, Jr., The Great Enterprise: The Manchu Reconstruction of Imperial Order in Seventeenth-Century China (Berkeley: University of California Press, 1986). 24Qing shigao 清史稿, “Shihuo 食貨 1” (Shanghai: Lianhe shudian, 1942), 470. Theearly Qing used aland unit called shang, each containing six mu. Thus, one shang was about one acre, as one acre equals 6.07 mu. government(zhaodian招佃).27Toinvestigate,delineate,register,andextractrevenuefrom those properties proved to be a painstaking and slow-going enterprise. Out of the total amount of former princelyestates, 750,000 qing in the mid sixteenth century, the Qing was able to extract revenue from 210,000 qing (or 28 percet) in the early Kangxi reign.28 In 1669 the Kangxi emperor ordered a systemization in the regulation and taxation of former princely estates, in order to make revenue extraction more effective. All farming lands in those estates were now designated as “renamed lands.” Instead of rentals, such landswereassessedlandtaxes,tobecollectedbycountygovernments,alongwithtaxeson local mintian. Abolished was the previous practice in which either prefecture or county offices or both and different agencies from the central government were collecting either rent or tax in multiple and often conflicting fashions.29 Overall this change resulted in more effective revenue extraction from renamed lands, but it did not solve all the problems in the process. The inconsistency of practices in extracting revenue from renamed lands may be glimpsed in one example: In Yidu 益都 County, Shandong Province, peasants tilling renamed lands were paying taxes called “imperial rent” (qinzu 钦租) at the same rate as the former princely estate rent of the Ming, which were two to four times of local taxes on mintian, until the Qianlong emperor ordered the payments to be lowered to the level of regular mintian taxes in 1736.30 Inasense,theQingstateapproachtorevenueextractionwasanart(ofrulership),nota science (of economics or statistics). Since the Qing state never conducted national cadastral surveys and banned provincial surveys after 1740, as Taisu Zhang documented, it never had a complete and clear accounting of the taxable farming lands in terms of actualacreage,soilquality,cropyield,andownershiporheadcount(forlaborservicetax), all of which would and did change over time. The Qing state primarily relied on the Ming state’s Books of Land and Labor Service Taxes (fuyi quanshu 赋役全書) to collect agricultural taxes at the lowest possible transaction cost. Consequently, tax burdens on taxpayers were commonly and perennially not proportional to land ownership, soil quality, and crop yield in various locales. For the emperor, an anecdotal awareness of the inequitable tax burdens on the people could motivate efforts at alleviating such burdens in a piecemeal fashion and promoting an image and self-image of benevolent ruleratthesametime.Inanotherofmanysuchinstances,theQianlongemperorissuedan edict in 1737 to exempt land tax of over 4,400 taels on 3,051 qing of lands in two counties in Jiangsu province, and all the unpaid taxes they owed, because the lands bordered on water and were frequently flooded, but local officials had previously kept counting the lands as taxable. The edict ended with a familiar self-congratulating sentence, “hereby those households will forever not suffer from the burden, and my utmost commitment to loving and nourishing the people is fully manifested.”31 Such imperial graces, however, gazetteers provide accurate information on all farming lands in a local community? We know that during the Qing, most local officials relied on the existing land records, even if outdatedones,tocollecttax;and“mostlocalgovernmentsmanagedtomakeendsmeetby collecting surcharges and customary fees.”32 If the government did not have complete landrecords,localgazetteerswouldnothavethemeither, buttheycouldnotethe factthat land registration was incomplete. At prefecture and county levels, even before renamed lands entered the picture of the Qing taxation, confusions in landowning records and troubles in tax assessment/collection had plagued the late Ming and continued into the Qing. Guide prefecture, of which Luyi was a part, provides a snapshot of a local scene. As the 1660 edition of the Guide Prefecture gazetteer reported, the land and population records compiled during the Yongle reign of the Ming (1403–1424) had become out of datebytheJiaqingreignoftheMing(1522–1566).In1564PrefectLuoreportedtoBeijing that the changing and changed landowning reality, especially a growing phenomenon of absentee landownership (jizhuang 寄荘, waisheng jizhu 外省寄住), resulted in five serious problems: 1) tax quota failing to cover all cultivated land, 2) land tax easily evaded, 3) inequitable tax burdens on the people, 4) lawsuits over landownership and tax liabilities, and 5) officials unable to discharge their tax collection duties. The situation continued into the Qing, as the 1754 edition of the Guide prefecture gazetteer continued to show these five problems identified by Prefect Luo two centuries earlier, while noting thatthelandandpopulationrecordsfromtheWanlireignoftheMing(1573–1620)came to be used as “original tax quotas” (yuan’e 原額) under the Qing.33 “Original tax quotas” meant what was recorded in the fuyi quanshu, which became the accounting basis of the A further example is that Luyi County had 779 qing of military garrison lands (weijun tundi 衛軍屯地, weidi 衛地) dating from the Ming era, and tax on the land was collected by theSouthern PatrolBureau (nanbuting南捕廰), seatedin theneighboringBozhou 亳 州 County, Jiangnan Province (to become Jiangsu and Anhui provinces after 1670). Not until 1658 did the tax collection on the land come under the jurisdiction of Luyi. In addition, there existed 1,488.73 qing of military colonies (weijun kendi 衛軍墾地) set up in the early Ming. After repeated flooding from 1389 on rendered the land unproductive, troops tilling the land fled (and no tax could be collected). In the following centuries the land was reclaimed by various kinds of people, but it remained untaxed until 1659 (康熙 16) when the Qing officials surveyed the land and reinstated tax on the land.35 In other words, these military colony lands were untaxed for over two centuries, but presumably stayedintheMingfuyiquanshuinheritedbytheQingsothatthetaxwasrestoredin1659.",
    "Thus, these local gazetteers reveal that besides regular mintian, there were other types of farming lands, such as military colonies, garrison lands, and absentee lands, with different and sometimes overlapping ownerships and jurisdictions that would often change over time. These conditions made land registration, tax assessment, and tax collection difficult, even under the Ming, which did conduct national cadastral surveys. That former Ming princely estates become renamed lands for taxation under the Qing only complicated the situation further. In the Ming and Qing eras, if not earlier, to account for different soil quality of various pieces of farming land, the acreage of lands was measured in different accounting units. In Luyi, mintian was measured according to a rule of 600 steps 步 (also called bows 弓, suggesting a bow-shaped measuring instrument) as one mu, while renamed lands were measured 240 steps as one mu.36 So even if the tax rate was the same for renamed lands and mintian of equal crop yield, the rate was actually higher on renamed lands. The number of steps/bows that counted as one mu for mintian varied from place to place, whereas renamed lands were measured 240 steps/bows as one mu everywhere, as were garrisonlands.37Forexample,inQueshan确山County,Ru’ning汝寧Prefecture,Henan Province, mintian was measured 960 bows as one mu and renamed lands were measured 240 bows as one mu; and in Zhenyang 真阳 County, Ru’ning Prefecture, mintian was measured 480 bows as one mu, and renamed lands were still measured 240 bows as one mu.38 All these land units known as mu may be called “actual mu.” Furthermore, there was a long-standing practice of converting actual mu of land into what historians Ping-ti Ho and Yeh-chien Wang called “fiscal mu,” for regional differ- ences in climate, topography, soil quality, and crop yield of particular lands or other factors.39 In this regard, renamed lands in Liyuan Field in Luyi and Western Field in Zhecheng (to be discussed below) were measured one and half or two actual mu as one fiscal mu (called xingliang di 行糧地 or cedi 冊地 in the local gazetteers), which cut taxpayers a slack after using a higher measuring unit (240 steps as one actual mu) than mintian (600 steps as one actual mu).40 Generally speaking, local gazetteers recorded the total acreages of farming lands in a community as actual mu (whether or not noting how much steps/bows as one mu); but the total amount of land tax on various lands was derived from taxes of different rates based on fiscal mu of such lands. Therefore, to know thetaxamountonaparticularpieceofland,oneneedtoknowthefiscalmuandtaxrateof a particular piece of land, and such information may not be available in the gazetteers. Secondly, when local gazetteers recorded various amounts of taels as taxes in a county or a prefecture, did these numbers reflect tax quotas or actually-collected taxes? It is known that tax arrears, or unfulfilled tax quotas, due to natural disasters and other reasons were common. For instance, in 1759 Anhui Province collected 1.61 million taels of land and labor service taxes, which was 60,000 taels short of the quota, and tax arrears during 1735–1758 amounted to more than 450,000 taels. In Jiangsu Province accumu- lated unpaid land and labor service taxes for 1746–1756 were canceled by the emperor, but not other minor taxes totaled 1.28 million taels. In 1757 and 1758, tax arrears again reached 640,000 taels.41 Obviously, provinces had tax arrears only because tax quotas were not fulfilled at prefectural level and ultimately at county level. Yet, the local gazetteers consulted for this study did not record tax arrears, for understandableeditorialreasons.The1896editionoftheLuyiCountygazetteerindicated one reason: The numbers of various taxes in the gazetteer were based on the fuyi quanshu of 1892, the drafts of completion reports (zouxiao cegao 奏銷册稿) of 1894, and earlier editions of the county gazetteer. “There are discrepancies [among these sources], and it is not easy to reconcile them due to non-existence of older documents; old county clerks, 40In Zhecheng it was one and a half mu, and in Luyi two mu, for one fiscal mu. See Zhecheng xianzhi 柘城 縣志 (hereafter ZX), 1896, 2.17; GLX, 1896, 6.4. when asked, did not know the answers either.”42 This might well have been the way in which all local gazetteers were compiled, even if it was not always so clearly stated by compilers.43 Similarly, these gazetteers did not record remits or defers of taxes authorized by the emperor for natural disasters that occurred from time to time, while they all noted the Kangxi emperor permanently freezing the laborservice tax amount in 1712. Thus, the local gazetteers do not inform us how much of the tax quota in the books was actually collected, or whether the amount of cunliu for various expenses at local levels were sufficient, or whether and how much extra surcharges on taxes were locally collected off the books. The Luyi County gazetteers did note, as a general phenomenon without numbers, corruption (qinyu zhibi 侵漁之弊) by county clerks in the process of collecting silver taels to buy and ship imperial tribute grain (chaomi 漕米), a tax separate from land and labor service taxes for certain provinces including Henan (1,984 taels a year for Luyi in the 1750s).44 Hence the numbers in the categories of ‘to be collected’ (shizheng 实徵), ‘toberetained’(cunliu存留),and‘tobeshipped’(qiyun起運)”inasectionontaxesinthe 1754 edition of the Guide Prefecture gazetteer, for instance, may not be taken as actual, not even those in the category of 实徵, which is why the term is translated here as “to be collected,” not “actually collected.”45 In short, local gazetteers would list lands and taxes in a county or a prefecture, but the formulaiclistingdidnotfullyoraccuratelyreflectthelandowningandtaxpayingrealityin a community. Only when certain important events were recorded would they reveal certain information about that reality, but still not necessarily the full story. With that general understanding in mind, we now turn to the mini-saga in Luyi.",
    "Luyi County sits in the eastern part of Henan Province, neighboring Bozhou County of Jiangnan Province (Anhui Province after 1670 when Jiangnan was divided into Anhui and Jiangsu) (see Figure 1). During the reign of the Ming Chenghua emperor (1465– 1487), 751.77 qing of mintian in Luyi were designated as princely estate for Prince Hui. During the reign of the Wanli emperor, the same estate was designated for Prince Fu. At the time the revenue from the land was collected by the Southern Patrol Bureau of Guide prefecture on behalf of Prince Fu. Yet, the jurisdiction of the Southern Patrol Bureau covered several counties in neighboring Jiangnan and Shandong provinces, including Bozhou, twenty li to the east of Luyi. The practice continued after princely estates became taxedlandsafter1645(phrasedas“renamedlands”hereforconvenience,eventhoughthe termwas not useduntil 1669).Some yearslater (probablyaround 1650)the patrolbureau was abolished, and the Bozhou county government “sneaked in and used connections to take over the collection of the tax” (chengxi yinyuan daizhen qianliang 乘隙夤缘代徵钱 粮) on the renamed lands in Luyi, but continued to forward the revenue to Guide prefecture and further onto the Henan provincial finance department.46 43For how compilers of local gazetteers collected sources in imperial China, see Dennis, Writing, Publishing, and Reading Local Gazetteers, 145–52. In 1652, however, the Bozhou County government claimed that the renamed lands in Luyi had been donated to the Prince Fu estate in Luyi by two Bozhou men, Qin Zong and Zhang Yong, during the Chenghua reign, and was now returned to Bozhou. In other words,thecountycollectedrevenuefromthatpieceofrenamedlandsinLuyiaspartofthe land tax quota for Bozhou to reduce the tax burden on Bozhou people. The finance department (buzheng shisi 布政使司) of the Jiangnan provincial government accepted Bozhou’s claim, since it would help meet tax quota in the province.47 This presumably caused protests from Luyi. On February 18, 1653, a memorial from Shangguan Li, the Jiangnan Regional Censor (jiangnan xun’an yushi 江南巡按御史), reached the Shunzhi emperor, reporting the dispute over the tax on renamed lands between Luyi and Bozhou. On March 8, 1653, the emperor ordered the Board of Revenue to investigate. Che Ke, Minister of Revenue, reported back on April 13, 1653: Farming lands in provinces all had territorial records (banji 版籍); during the Ming Chenghua era, “bare-stick gang members” (guntu 棍徒) Qin Zong and Zhang Yong of Bozhou donated the land in question, in the amount of 573 qing, to the princely estates in Henan. Since the founding of the Qing, taxes on the land had been collected by and for Henan; per Shangguan Li’s report, based on the old local gazetteer (jiuzhi 舊志), the land belonged to Bozhou; the Henan governor and finance commissioner should be ordered to return the land to Jiangnan province as Bozhou’s; the tax on the land be collected by the Jiangnan provincial finance department; and the practice be followed forever thereafter. The discrepancy between 751.77 qing and 573 qing was not addressed. The emperor approved the report.48 Here we see the importance of “old local gazetteers” of the Ming vintage being used as evidence in settling land disputes between the two counties across a provincial border. estate in Luyi, traveled to Beijing to appeal directly to the emperor (kouhun, presumably Ma went to the designated office, the Censorate, as prescribed by law). Ma refuted the claim that two Bozhou men donated 573 qing of land to princely estates in Bozhou: The Luyi county magistrate and people appealed to the Henan provincial finance department by citing old gazetteers and stone tablets about landownership; and Censor Shangguan Li’s report in early 1653 was only based on the false claim by the Jiangnan provincial finance commissioner. Now that the emperor had approved the return of the 573 qing to Jiangnan, said Ma, the imperial order must be followed. His complaint now was that the Bozhou county government further claimed the right to collect labor service taxes on an additional 1,706 qing of former princely estates in Luyi. Thus peasants working on these lands were forced to pay labor service taxes to two jurisdictions from one land that was listed in two territorial records (yidi liangli banji 一地两隸版籍, yimin ji liangying chaiyao 一民即两應差徭), i.e., to Luyi County, Henan Province, and to Bozhou County, Jiangnan Province. In response, the Shunzhi emperor again ordered investigation and report.49 While his wording was confusing, what Ma referred to as 1,706 qing of renamed lands appears to have meant the 751 qing in dispute, plus another 1,016 qing of renamed lands discussed in the 1774 edition of Bozhou gazetteer.50 Chinese scholar Sheng Cheng’s article on renamed lands in Luyi discussed this dispute as well. Using the Ming Veritable Records (明實录), Sheng concluded that of the 751 qing land in question, 573 qing was originally cultivated by Bozhou people and 116 qing by Luyi people in the Ming era, that Ma’s action and the imperial response in 1653 were preserved in the archives of the Board of Revenue, but nomore information onthe matter was available from thatsource. Per the 1753 edition of the Luyi gazetteer, however, at some point after 1653, the land in disputeandthetaxonitwerereturnedfromBozhoutoLuyiintheamountof635.64qing. The gazetteer mentioned neither Shangguan Li nor Ma Mingjie, nor how the land was returned, nor why additional 62.64 qing on top of 573 qing.52 Sheng’s study cited above found noprimary sources that explain how and why the land was returned to Luyi. Given the outcome of the dispute between Luyi and Zhecheng discussed later, the return of the land to Luyi may have been a decision of the higher authorities in terms of which way the land and labor service taxes could be more easily collected.",
    "The 1774 and 1894 editions of the Bozhou gazetteer did not mention the donation of land to Luyi and the controversy over it. In contrast, the 1774 edition detailed the written communications between successive county magistrates and the higher authorities over a 51Sheng Cheng 盛承, “Gengmingtian yanjiu xintan—yi Henan Luyi xian fanwangtian de zhuanhua guochengweizhongxin”更名田研究新探—以河南鹿邑县藩王赐田的转化过程为中心,Zhonggongjing- jishi yanjiu 中国经济史研究, 2014, No.4 (online version without page numbers). Sheng explores how to understand more accurately the actual acreages of rename lands in Luyi. proper tax rate on renamed lands of more than 1,016 qing in Bozhou. The magistrates argued for a lower rate than the rate on mintian because the renamed lands in question were of poorer soil quality and lower crop yield. The Board of Revenue and the Qianlong emperor insisted on the principle of taxing renamed lands at the same rate as on mintian, but finally relented and accepted a compromise after fourteen years (1759–1773) of back- and-forth arguments.53 Both editions of the gazetteer noted that military colonies (tuntian 屯田) in excess of 2,747 qing under Bozhou’s jurisdiction had been located in four counties in Henan Province—Suizhou, Zhecheng, Luyi (under Guide prefecture), and Taikang (under Chenzhou prefecture); and in 1676 these lands were turned over to Henan province for tax collection.54 These episodes involving Bozhou serve to further contextualize the confusions over tax liability and the opportunities for tax fraud due to the existence of various types of land, ownerships, and jurisdictions, and their changing statuses over time. In the meantime, a far more complicated dispute regarding tax on renamed lands arose between Luyi and Zhecheng counties. Its key developments may be outlined here as an overview. In 1669 (or 1665) a scheme of “Luyi sharing Zhecheng’s land tax” (Lubo Zheliang 鹿拨柘粮) was started; in 1698, despite repeated lawsuits and petitions from Luyi landowners for three decades, the scheme was once again reaffirmed but rephrased as “surrogate collection” (daizheng 代徵) by the authorities; in 1736, upon a provincial auditing of land and land taxes, Luyi taxpayers and a Luyi magistrate again petitioned the higher authorities for a change, but to no avail; and finally in 1750 three Luyi landowners resorted to directly petitioning the emperor and failed in their efforts, while the dispute continued as “litigations in ink and brush” (bimo guansi 筆墨官司) in the gazetteers of both counties into the 1890s. Why and how did all that happen? In 1466, the Ming Chenghua emperor gifted over 771 qing of mintian as princely estatestoPrinceChong,including400qingoflowergradelandinLuyi,and371.30qingof upper grade land in Zhecheng 柘城, forty-five li to the north of Luyi (see Figure 1). After 1648 the estate in Luyi came to be called Liyuan Field (Liyuan chang 李原厰), and the estate in Zhecheng, Western Field (Xi chang 西厰).55 The taxes collected from both Liyuan and Western fields were forwarded to Ru’ning Prefecture.56 With thechanges under theKangxi emperor in 1669—former princelyestates became renamed lands and county governments would collect taxes on such lands—the respon- sibilitypassed from Ru’ningprefecturetoLuyicounty forcollecting thetaxon925qingof renamed lands including 400 qing of Liyuan Field. At this juncture, Sun Shizhe, a clerk in the Zhecheng county office, conspired with Niu Zuoyin, a clerk in the Ru’ning Prefecture office, to “spread out” (feisa) the tax on 131 qing (out of 371.30 qing) of Western Field in 55Those lands were called “chang” 厰 because, as princely estates, they were fields for raising geese and ducks that were supplied to Prince Hui’s palace (LX, 1753, 4.2). Two Chinese characters for “chang” 塲, 厰 were interchangeable at the time. During 1648–1669 the Ru’ning prefecture collected tax on renamed lands in various counties under Ru’ning and in Luyi and Zhecheng under Guide prefecture, following the practice set in the Ming when these lands had been princely estates. Zhecheng onto landowners in Liyuan Field in Luyi. Thus, landowners in Liyuan Field would collectively pay an additional tax of 736 taels on the 131 qing land in Zhecheng.57 The extra tax paid by the Luyi county was forwarded to the Guide prefecture office seated in Shangqiu (商丘) and counted toward the tax on Western Field in Zhecheng. The practice was officially called Lubo Zheliang.58 The scheme emerged partly from the complexity of varied tax rates on different types of farming lands. Either mintian or renamed lands were assessed for tax purposes at different grades for crop yield. Western Field in Zhecheng was taxed as upper grade land (shangdi 上地) at 0.054 tael per mu, while Liyuan Field in Luyi was taxed as lower grade land (xiadi 下地) at 0.038 tael per mu.59 Thus, Zhecheng officials would justify shifting a part of the tax on land in Zhecheng onto Luyi as a legitimate practice of “equally sharing” (juntan) the heavier tax burden on Zhecheng, while Luyi people called the practice “spreading-out” (feisa).",
    "Luyi to delegitimize the practice, in reality the term usually referred to something rather different.60 “At the beginning of the tax-collection period, when the magistrate compiled thetax-collectionregisterslistingthequotaduefromeachtaxpayer,hewouldsecretlyadd a hundredth or a thousandth of a tael to the liabilities of each taxpayer. This practice was known as fei-sa.”61 As such, “spread-out” was a bad practice known to the higher authorities.In1735,forinstance,thenewlyascendedQianlongemperorissuedanedictto prohibit it forever, at the request of imperial censor Jiang Bing.62 Materially, “Lubo Zheliang” as a scheme of “equally sharing” a tax quota devised by Sun and Niu in 1669, was not the same as feisa, either in purpose or in method, since the extra tax paid by Luyi for Zhecheng was known to Luyi taxpayers and it went directly toward fulfilling a tax quota. The similarity of juntan to feisa was only that the extra tax burden was shared by a larger number of taxpayers, each of whom paid a small portion. The petitioners from Luyi either mistakenly or conveniently conflated the two practices so as topushtheircase.Theauthoritiesapparentlyunderstoodthedifferencebetweenfeisaand juntan and hence allowed the latter practice. According totheZhecheng County gazetteer, however, the practice simplyhad a quite different origin. The renamed lands of 400 qing in Luyi and 371 qing in Zhecheng were of one continuous pieceofland sitting across theborder between thetwocounties, aspart of the estates for Prince Chong in the Ming, fiscally administered by Ru’ning prefecture. Because the labor service tax in Zhecheng were heavier than those in Luyi due to higher tax rate on upper grade soil, some Zhecheng landowners falsely reported their properties as being inside Luyi to avoid heavier taxes. When the Ru’ning prefecture conducted a survey of renamed lands in 1665, the land in Liyuan Field was measured at 814 qing instead of 400 qing, while the land in Western Field was only 356 qing instead of 371 qing. For fear of being investigated and punished for fraud, Gu Yonghan of Luyi, the land supervisorofbothLiyuanFieldandWesternField,alongwithLiSandeandLiuJunyi,two “big families” (dahu 大户) in Luyi, proposed that Luyi pay taxes on 131 qing of land in Western Field, soas to“use thesurplus (youyu 有餘) inLuyi tofillthe deficit(buzu不足) 60The characters “feisa” in the petition were 飞撒 instead of 飞灑, and both writings meant “spread-out.” 61Zelin, Magistrate’s Tael, 49. in Zhecheng.”63 Thus, the county gazetteers authored respectively by local elites and magistrates in Luyi and Zhecheng told very different stories on the date and the cause of Lubo Zheliang. Here we are comparing the Guangxu editions of the Zhecheng and Luyi gazetteers, both published in 1896. The Qianlong edition of the Zhecheng gazetteer (1773) did not mention the dispute, stating that 131.30 qing of “civilian garrison land” (min weidi 民衞 地) was transferred to Luyi, without giving a date, which was otherwise the norm in recording cases of land transfer in the gazetteer.64 This was not a truthful statement, since in reality only the tax on 131.30 qing was transferred to Luyi and no actual land changed hands; and the land was renamed land, not civilian garrison land. Yet, the 1896 edition of the Zhecheng gazetteer retained this statement without date, while adding the history of the dispute with Luyi in a different section, as described above.65 In contrast, both the 1753 and the 1896 editions of the Luyi County gazetteer told the same story; the 1753 edition accused people of Western Field of conspiring with clerks in the Ru’ning prefecture office without naming names, and the 1896 edition named Sun Shizhe and Niu Zuoyin as the culprits (at this point they were long gone). It would appear that the authorsofthe1896editionoftheZhechenggazetteerrespondedtothe1753editionofthe Luyigazetteerbytellingtheirsideofthestory,aftertheirforefathershadnotin1773.Thus the tax dispute between the two communities extended to “litigations in brush and ink,” with legal, economic, and moral meanings for both. While the gazetteers of the two counties recorded somewhat different history of their appeals to the higher authorities over the dispute, both sides confirmed the fact that the tax scheme in question was repeatedly allowed by government officials from the prefec- ture to the provincial government to the Board of Revenue in Beijing, much to the frustrationofLuyitaxpayers.BoththetenaciousnessofLuyipeopleinbringingthematter repeatedly to the higher authorities and the steadfastness of the latter in refusing to side with Luyi are striking. According to the Zhecheng account, in 1665 when “Lubo Zheliang” began, Zhao Guoyuan of Luyi sued at the provincial government, as did Zu Yimai of Zhecheng, over the land survey and the ensuing tax arrangement. In response, the provincial finance department ordered Ru’ning and Guide prefectures to jointly conduct another survey of all lands including abandoned temples and uncultivated river banks; yet the new survey confirmed that Liyuan Field had more land, and Western Field had less land, than they were supposed to (the gazetteer did not give numbers).66 The department decided that it was a reasonable solution to combine Liyuan Field and Western Field for tax assessment and assign the tax quota equally to them (hechang juntan 合厰均摊). The decision was 66TaisuZhangemphasizedthatbytheQianlongreigntheQingstatebecamecommittedtonotconducting nationalandprovinciallandsurveyssoastoavoidcausingpopularfearsfortaxhikes,butnotedthatlocalized surveys in response to local disputes over landownership would and did occur (Zhang, The Ideological Foundations, 227–28). The repeated land surveys in Liyuan Field and Western Field serve as an example of the latter.",
    "Thereafter Luyi peasants repeatedly filed lawsuits and sent petitions to the higher authorities but failed to make any headway. Liu Yidong did it in 1678; Yao Jingxin and Sun Jingyi in 1695; Kong Xingze in 1737; and Kong Xingshen, Li Dongze, and Hu Qia in 1739. In rejecting the petitions from Luyi taxpayers, the provincial finance department kept reaffirming the practice of hechang juntan and “equal payments of taxes per mu” (anmu junshu 按亩均输).68 The Zhecheng gazetteer claimed that the text of the provin- cial government decision on the issue was finally inscribed on a stone tablet in Western Field in 1742.69 The Luyi County gazetteer similarly recorded repeated efforts by taxpayers in Liyuan Field at removing the extra tax. In 1669 Yang Liuhang, a tribute student (gongsheng 貢 生), filed lawsuits (jukong 具控) against “spreading out unpaid land tax” (feipai xuan- liang 飛派懸粮) at the higher authorities, without results after three years. In 1673 Li Zhibo of Luyi, a gentry man (shimin 士民), went to the Henan provincial governor to report that Luyi people paid taxes twice on one piece of land (yidi liangshui 一地两税), requesting a thorough investigation by the authority in the public interest (conggong quecha 従公确查). The governor ordered Guide Prefecture to investigate seriously, but the latter made a reply to the former without investigations since it was a known issue. In 1678 Liu Yidong again presented the case to the provincial governor. This time the provincial finance department deducted 20 taels from 736 taels that Luyi would pay for Zhecheng, as a symbolic gesture of sympathy, but made no change to the existing tax scheme.70 In 1693 (or 1695 in the Zhecheng account) Yao Jingxin of Liyuan Field again brought the case totheprovincial governor, accusingthe localgovernments of“deceiving the state anddespisingthelaw”(qiguomiaofa欺國藐法).Yetagainnothingcameoutoftheeffort. In 1698 Liu Yangshun of Luyi brought the case to a new governor. Governor Dong wrote that the dispute between Luyi and Zhecheng was repeatedly closed and re-litigated; the provincial finance department should thoroughly investigate and settle the matter conclusively, so that the people could pursue their livelihood peacefully. The finance department forwarded the previous reports from the two county governments. Zhecheng had made a new claim that Luyi people reclaimed over 130 qing of land that belonged to Zhecheng and therefore should pay taxes on the land for Zhecheng. Liu Yangshun was detained, and then released after he signed a pledge not to revive the case. Liu’s action led to one change: the tax paid by Luyi for Zhecheng would be directly forwarded to the finance department (instead of Guide Prefecture), and the term “Lubo Zheliang” was replaced by “daizheng” (surrogate collection).71 Thus the practice only became more entrenched. In 1736 the Luyi County government received a provincial order to audit actual condi- tions of lands and land taxes (fengwen qingcha diliang 奉文清查地粮虚实).72 The order 68These terms were rhetorical or conceptual rather than descriptive, since only the tax on 131 mu, not all 371mu,ofWesternFieldwere“combinedwith”thetaxonLiyuanFieldandthetaxratesweredifferentforthe two places. originated in a malfeasance committed in 1732–1735 by Henan provincial governor Wang Shijun who pushed a reclamation drive started by his predecessor and exaggerated the results, causing undue tax burdens on the people of Henan. In early 1736 Fu De, who replacedWang,senttwocontradictorymemorialstotheQianlongemperoronwhattodo aboutthemessleftbyWang.TheemperorhadtotellFuDethatthefirstthingtodowasto verify reclaimed lands and remove falsely reported ones from records.73 Upon hearing abouttheorder,KongXingzeofLiyuanFieldbroughtforththeLuyicaseonceagainatthe county, the prefecture, and the provincial governments. In response, Li Lin, the Luyi county magistrate, in his report to the provincial governor, recounted the stories since 1669 cited above and further argued the following: LeavingasidethesituationabouttheprincelyestatesintheMingthatwastooremote to verify, the taxes on these lands from 1644 to 1669 should have been straightfor- ward and clear; otherwise the people in Zhecheng would not have been silent for twenty-fiveyearsuntilprincelyestatesbecamerenamedlandsin1669.Evenifthetax on Western Field was heavier, which was determined by its [better] soil quality, it had nothing to do with Luyi. If mintian in Zhecheng was not enough to support tax quota, investigation should have been made into the hidden land in Zhecheng, instead of burdening a neighboring county. … Now that showered by the imperial grace to audit lands and land taxes and rectify discrepancies, we have a once-in-a- thousand-years opportunity for the wrong suffered by the people of Luyi to be righted, for what are theirs be returned, for double tax be removed, and for the imperial grace be spread far and wide [yiguang huang’en 以廣皇恩].74 Fromhisperspective,themagistrate’sargumentwaslogicalandreasonable.Yet,theissue, a tired one and quite unrelated to the purpose of the provincial auditing, remained unresolved, which led to the direct petition to the Qianlong emperor by Kong Xingze and two other men in 1750.",
    "The three men’s petition narrated the dispute from 1669 to 1736 as recorded in the Luyi gazetteers. Additional information followed: When Kong Xingze filed the lawsuit at the county, the prefecture, and the province in 1736, the provincial finance department ordered another investigation, but the Zhecheng county magistrate did not respond. The department reported the issue to the Board of Revenue. The Board responded as follows (apparently the department shared the response with the Luyi county magistrate): 73QCS, 13. 癸巳. Wang Shijun tried to gain imperial favor through falsely reporting the results of reclamation because the Yongzheng emperor promoted the initiative for potentially more revenue sources. The Qianlong emperor stopped the initiative completely upon his ascent to the throne in 1735. For blaming hismalfeasanceontheYongzhengemperor, WangwaspunishedbytheQianlongemperor andbarely spared of the death penalty (QCS, 4. 乙亥; 5. 辛巳; 23. 辛酉; Qing Shigao, “Liezhuan 列傳 81”). Meanwhile, the auditingbyFuDefoundthatover2,030qingofreclaimedlandsinforty-twocountiesinHenan(notincluding Luyi and Zhecheng) were unsuitable for cultivation, and a total of 9,879 taels of tax and 302.9 shi (石) of tribute grain assessed on them should be cancelled. The emperor ordered the cancellation to be permanent (QCS, 26. 癸卯). The episode fits the larger pattern of the Yongzheng–Qianlong transition in the Qing fiscal policy (see Zelin, The Magistrate’s Tael, 264–78; Zhang, The Ideological Foundations, 211–48). Luyi’s mintian measured six hundred steps as one mu, and only the land of Liyuan Field was not measured with the same steps [it was measured 240 steps as one mu]. So the tax rate was already inequitable. People there also took up what Western Field in Zhecheng fell short in tax payment, so they felt even more strongly about beingunfairlytreated.Yet,ifthistaxwasre-imposedonZhechengthatalreadyhada higher tax rate and less land, it would be really burdensome for the people of Zhecheng.75 This was revealing: after weighing the tax burdens on the people of both counties, the BoarddecidedthatevenifthetaxschemewasunfairtoLuyi,Zhechengshouldnotbeheld to pay more because landowners there would be more likely unable to pay, so the status quo would stay.TheBoard asked thetwocounties tofurther lookinto whetherthere were any farming lands untaxed (so they could be taxed to help fulfill tax quota) and endeavor to resolve the issue to make the people of Luyi at peace. Thereafter the prefecture made a report to the provincial finance department, and the latter forwarded it to the Board. Kong’s petition concluded that the case ended with Zhecheng’s argument prevailing.76 Kong’spetitionstatedotherhardshipsforLuyipeople.Besidestheextrataxof716taels a year, six years out of eleven between 1739 and 1750, Luyi suffered flooding.77 The unpaid tax for those years due to crop failures and the current taxes due amounted to combined taxes for eight years, and county clerks relentlessly pressed landowners for payments.78 Under these circumstances, “one land twice taxes (yidi liangshui)” became even more unbearable. The petition requested that the emperor remove the extra tax paid for Zhecheng and remit the unpaid taxes for the previous bad years.79 Such were the purposes of the three men’s action. The case file sent to the Qianlong emperor by the Board of Punishment included testimonies from the three accused at the county trial. Liu Jiuwei testified that he owned 344 mu of land in Liyuan Field and his tax was 13.58 taels (around 0.039 tael per mu). It was Kong Xingze who persuaded him tojoin the appeal tothe emperor because he owned more land and had more stakes in the matter. He claimed that he only reluctantly agreed to join the trip. Hu Xuezhu owned 73.8 mu of land in Liyuan Field and the tax on land was 2.9 taels (around 0.039 tael per mu). Kong Xingze was elder brother of Hu’s tutor Kong Xingshen. 77The flooding disasters noted in Kong’s petition and related deferments of tax payments were on the record. In 1742 the Qianlong emperor approved a request from the Henan provincial governor that labor service tax (17,402 taels) from Luyi and two other counties be remitted for flooding in 1741, with land tax to be collected in three years. In 1743 tax defers for thirteen counties including Luyi were granted for flooding in 1742; then the emperor extended another three years (1744–46) to collect the back taxes (over 140,000 taels)for1739–42inLuyiandtwoothercountieshardesthitbyflooding.Anationwidetaxremissionfor1746 ordered by the Qianlong emperor did not cancel back tax in earlier years in any provinces. The remission wouldbecarriedoutinthreeyears(1746–1748),eachyearwithaboutonethirdoflandandlaborservicetaxes in the country remitted in certain provinces—a standard practice for tax remissions proposed by ministerial officials (QCS, 243. 乙丑).",
    "peasants, see Wang, Land Taxation in Imperial China, 46–48; for county runners’ corruptive or irregular practices, see Bradley W. Reed, Talons and Teeth: County Clerks and Runners in the Qing Dynasty (Stanford: Stanford University Press, 2000). Kong Xingze asked Hu to polish and recopy a petition originally written by Kong Xingshen (who sued in 1739). Thinking that he was doing a good thing, Hu did it and went along on the trip to appeal to the emperor. After Kong Xingze was arrested on the spot, Hu fled back to home (to be arrested later). Kong Xingze owned73 muof landin Liyuan Field. Thetax was 0.038tael per mu,with anadditional0.018taelpermupaidforZhecheng(thetotalwouldbe2.774+1.314=5.088 taels). Feeling it was unfair for Luyi people to pay taxes for Zhecheng people, he asked Hu Xuezhu to refresh the petition written by his deceased brother Kong Xingshen. Thinking Liu and Hu in the same situation as he was, he asked them to join in the effort to appeal to the emperor.80 The testimonies show thatthe petitioners were among local elites. They were educated (Kong Xingshen was a shengyuan 生員, per the Zhecheng gazetteers), and owned large (73mu)orverylarge(344mu)piecesofland,inthecontextoffragmentedlandownership in imperial China including the Qing.81 They probably used tenant farmers to work on their lands. Since the sources contain no information about their incomes from lands, it is unknown what a percentage of their incomes went to paying the land tax or how hard financially for Kong Xingze, for instance, to pay his land tax of 5.088 taels (of which 1.314 tael was for Zhecheng). In any case, “equal-sharing” was meant to impact individual taxpayers slightly, but Luyi taxpayers were fighting the entire scheme as unfair “spreading-out.” For the state, land tax from Luyi County totaled 43,550 taels a year in the 1750s, while Zhecheng’s land tax totaled 26,738 taels in the 1770s and 27,349 taels in the 1890s. Of the land tax from Luyi, 1,330 taels were from the tax on 400 qing renamed lands in Liyuan Field.Incomparison,371qingrenamedlandsinWesternField,taxedattherateforupper grade mintian, yielded over 2,020 taels, which presumably included 716 taels from Luyi, though it is unclear from the sources.82 The716 taels Luyi landowners paid for Zhecheng, if counted in the Luyi tax, constituted 1.64 percent of the total land tax from Luyi (43,550 taels), or 0.22 percent of the total land and labor service taxes from Guide prefecture including Luyi and Zhecheng (324,426 taels) in the early 1750s.83 Yet, the state would not let the seemingly insignificant amount uncollected: Precisely because the state would not raise tax quota and would remit or defer taxes for natural disasters in different provinces every year, it must collect in principle the tax quota in the books as much as possible, where no remits and defers were authorized, to have a relatively healthier balance sheet. As noted earlier, the three men were punished for their action in 1750, but their efforts proved to be futile. The Luyi County gazetteer published in 1896, after narrating the history of the dispute based on the 1753 edition, which was silent on the 1750 petition to the emperor, added the following comment: The actual amount of this land was recorded in the county gazetteer and in the fuyi quanshu and can be verified. Liyuan Field has only 400 qing of land and never has increased by an inch. In fact there are no uncultivated lands around it to expand. 83GF, 1754, 18.3. The figure from this source may be corroborated by figures at other points of time— 317,842 taels in 1717; 265, 781 taels in 1743; 320,860 taels in 1784; and 354,524 taels in 1820. See Yongqin Guo, Land and Labor Tax in Imperial Qing China (1644–1912) (Leiden: Brill, 2022), 118. Zhecheng people claimed that Luyi people reclaimed uncultivated lands that belonged to Zhecheng, but where would one find such lands! If they insist that the land was hidden, then the land of more than 130 qing would require a few hundred households, each working on a few dozen mu to profit. Yet, the extra tax of over 700 taels was imposed on entire Liyuan Field that had a few thousand households. How would those thousands have allowed a few hundreds to hide their landtogainprofitandthusharmthemall,withoutspeakingup?Evenifsomepeople were willing to do so, it cannot go to such an extent. Alas, repeated lawsuits with Zhecheng have led to no fair outcome at the government offices. People on this land have had no way to get a relief from the hardship.84 A pattern has emerged: the earlier edition of the Luyi gazetteer told its version of the dispute and then the later edition would cite the earlier one as evidence. At the same time, the 1896 gazetteer revealed that the tax paid for Zhecheng was collected in the second tax period (the tenth month of lunar calendar); miscellaneous levies (zapai 雜派) on the tax were exempted during the Jiaqing reign (1796–1820);85 and the actual amount collected was less than 716 taels, around 50–60 percent of the amount or under 400 taels. “It is not that the government was buying a good name from the people [by giving some slack], but that the tax imposed on no land [wudi zhizheng 無地之徵] cannot be collected with a crackingofwhips!”86Thus,Luyipeasantshadresignedtotheirfatetopaytheextrataxfor Zhecheng, while the government collection efforts stopped at a point, beyond which further pressure would bring little return. This then was also an example of why and how the tax actually collected did not fully match the nominal tax quota in local gazetteers, or in the fuyi quanshu for that matter.",
    "Notably, the 1754 edition of the Guide Prefecture gazetteer stated that Luyi County “received”(shouru收入)131.30qingofrenamedlandsfromZhechengCountyin1669.87 The information about subordinate counties in the prefecture gazetteer was supposedly based on the gazetteers of those counties and was cited as such in the text. As discussed above, however, the Luyi gazetteer including the 1753 edition consistently denied ever receiving any land from Zhecheng.88 In other words, the prefect and his fellow compilers of the 1754 Guide gazetteer chose to side with Zhecheng and gloss over the dispute. They would perhaps have acted otherwise, if three Luyi men’s petition to the emperor had succeeded in 1750. Clearly, the Board of Revenue and the provincial finance department, as well as the prefectural and county governments, knew that Luyi people were paying extra taxes for Zhecheng but, endorsed by the emperor, they allowed the practice to continue, since the extra tax was a slight increase for each taxpayer in Liyuan Field, but in aggregate it helped fulfill tax quota in the province. In other words, the logic of “equal sharing” was the same as “spreading-out,” but the purpose was the opposite—the taels thus collected did not go to the discretional account or personal pocket of the magistrate or the prefect but helped fulfill the tax quota in the books. 85Meltage fee (huohao) was not counted as zapai. In Magistrate Li’s 1736 report, he noted that the rate of meltage fee for regular tax on mintian was 0.150 tael per each tael of tax, whereas the rate for the tax paid by Luyi for Zhecheng was lighter, only 0.025 tael per each tael (GLX, 1896, 6.5). In a wider historical perspective, the government response to the Luyi case was not an isolated instance, even if particular scenarios varied from place to place in the country. The situation in Huangpi County, Hubei Province, will contextualize the Luyi case.89 The princely estate of 768.68 qing designated for Prince Jing in Huangpi in 1561 was returnedtotheMingstatein1565whentheprincediedwithoutanheir.In1581–1582the Ming state conducted a cadastral survey across the country, and the 768.68 qing land in Huangpi re-entered the fuyi quanshu as mintian that it was at the time. In 1588 the land was granted to Prince Lu, but it remained mintian in the books. Peasants tilling the land would pay taxes to the state as well as pay rent to the prince, constituting extremely heavy financial burden on those peasants. In response, Magistrate Hong proposed a plan for “equal sharing.” He made what he called “alternative assignments” (gaipai 改派) of the taxes to counties that did not have princely estates, thus slightly increasing tax quota on those counties. The plan was approved by the provincial finance department and the Board of Revenue, and this Ming practice continued into the Qing. In the meantime, another two pieces of the princely estate in Huangpi, 14.22 qing and 27.5 qing respectively, belongedtoPrinceChu.Therentfromtheformerwaspaidinsilvertaels,andthatfromthe latter in grain. After the Shunzhi emperor’s initiative in 1645, the rent from these lands became taxes and the rent in grain was converted to silver at one shi for 0.2 tael. Due to fluctuation of grain prices in good and bad years, by 1652 the tax on all former princely estates in Huangpi had been fixed at one shi for 0.466 tael. In 1699 when princely estates became renamed lands, Governor General Guo Xiu submitted a memorial to the Board of Revenue and the Kangxi emperor. He proposed that the tax rate based on grain–silver conversion be abolished, and the renamed lands be taxed at the same rate as upper grade mintian, which would yield over 4,000 taels from renamed lands, and the remaining over 6,000 taels (of the previous tax quota) be evenly shared by peasants tilling mintian in all thirteen counties of the prefecture. Initially, the Board of Revenue and the emperor did not approvesuchachangetotheexistingtaxstructure,butafterthreememorialsfromGuoand ensuing fact-finding investigations and reports by officials from Beijing, the practice was approved. Thus, as far as the Board of Revenue was concerned, “equal sharing” as a collection scheme tomeet tax quota was nothing new when it emerged in Henanregarding tax on renamed lands in Luyi and Zhecheng, even if the specifics were somewhat different. Theschemeofequallysharingtaxquotaamongtaxpayingcommunitiesandhouseholds maybefurtherappreciatedinanationalcontext.Thatwasthe well-knownQingpractice of categorizing provinces into three grades in terms of revenue extraction capacities owing to theirtopographical,ecological,andeconomicconditions—surplus(youyu有餘)provinces, 89Sheng Cheng 盛承,“Cong WangfuZhuantian DaoGengmingtian: MingqingZhouxian Fushui Yanbian Xintan—Jiyu Huangpi Xian De Fenxi” 从王府荘田到更名田 : 明清州县赋税演变新探—基于黄陂县的 分析, Zhongguo Shehui Jingji Shi Yanjiu 中国社会经济史研究, 2016, No.3 (online version without page numbers).",
    "under the Yongzheng emperor as regular surtax on land and labor service tax that would stay in provinces to cover their local administrative expenses, it also came to be controlled bytheBoardofRevenueundertheQianlongemperortohelpprovincesinfiscalstress.92As noted earlier, the 1896 Zhecheng gazetteer claimed that in 1665 the big families in Luyi proposed to use the “surplus” (youyu) from Luyi to help cover the “deficit” (buzu) of Zhecheng in tax payments. These vocabularies seem to have been appropriated for local purposesfromthenationalschemeofgradingprovinces.ThisimportantfeatureoftheQing state finance allowed Beijing to coordinate revenues and expenses among all provinces to meetfiscalneedsofthewholecountry.Oneexampleoftheadvantagefromthepracticewas that the Board of Revenue was able use the scheme to manage the national and provincial finances during 1746–1748, after the Qianlong emperor unilaterally issued his first uni- versal tax remission in 1745.93 Viewedin these additionalcontexts, whattranspired in Luyi wouldappearmorelogicalandcomprehensible,whileitdidappearillogicalandunfairfrom the perspective of Luyi taxpayers. This case study is mainly based on limited archival sources and a number of relevant prefecture and county gazetteers in different editions during the Qing, among other sources. The paucity of available primary sources limits the interpretative power of the study. However, the mini-saga in Luyi may still suggest some important features of the Qing state revenue extraction during the early and high Qing, besides revealing the role played by local gazetteers in tax disputes between local communities. The Qing state was primarily concerned about the essential goal of realizing tax revenue to cover expenditures. It laid out general laws and rules on taxation and enforced them, and therefore taxes that were in the fuyi quanshu must be collected unless remitted for a locale or nationwide by the emperor for natural disasters or other reasons. Precisely because the Qing state was committed to not raising agricultural taxes, it was important for the state to collect the tax quotas in the books as fully as possible. Successful revenue extractionrequiredbotheffective(evenifnotefficient)collectionandsustainablerevenue sources. In terms of fostering sustainability, taxation must allow the people to have a margin to survive (and prosper), instead of “draining a pond to catch fish” or “killing a hen to get eggs;” at the same time fairness of tax burden on the people in a given jurisdiction was an important concern to the state. Corruption and violations of the laws andrulesbyofficialsintaxationprocesswouldbepunished.Suchapracticeasfeisawould beofficiallybannedaswell.Yet,thecentralgovernmentasaprincipalwouldnotbeableto monitor all agents directly and address all complaints of unfairness in taxation from individuals or communities in complicated and varied local scenarios. The Board of Revenue normally relied on the lower levels of state agents to come up with solutions for the Board to approve or reject. This article shows that the disputes between Luyi and its neighboring counties were communicated to and fully understood by the Board, and the case was not about the principal being misinformed or manipulated by the agents, while 93Helen Dunstan, “The Function of Imperial Munificence: How Simple Quantitative Work Can Help Us Rethink High Qing History,” T’oung Pao 100 (2014), Fasc. 1/3: 164–236. The provincial, prefectural, and county governments would adopt, and the central government would approve, the scheme of assigning a given amount of tax (of a given type)tomorecommunitiesoralargernumberoftaxpayersinthenameof“equalsharing” sothatthe taxwouldbe morefeasibly collected than otherwise.Luyi taxpayers were made to pay a portion of the tax on renamed lands located in Zhecheng because the latter had a higher tax rate on upper grade soil and no prospect for reclamation to expand land acreage.ThesimilarlogicwasseeninthecaseofHuangpiCounty,HubeiProvince,andin the scheme of categorizing all provinces in three grades on a national scale. All these schemes were designed to raise effectiveness in revenue extraction and in resource allocation within the given revenue sources. Local communities and individuals who faced extra taxes due to the equal sharing schemes would try to fight what they perceived to be unfair practices imposed by their local governments. Among the tools used for such fights were local gazetteers. The Luyi County gazetteers did play a role in keeping the unresolved issue alive so that more resourcefultaxpayersaslocaleliteswouldtrytoseekredressonegenerationafteranother, appealing their cases to officials at all levels and up to the emperor. The outcomes of their efforts depended on whether their cases aligned with the state goal of fulfilling land tax quota. If a complaint from a taxpayer exposed a form of corruption committed by local officials, the culprit would be punished and the malpractice be ordered to stop. If a complainantwasonlyseekingtolessenhisandothers’taxburdens,thestatewouldbeless sympathetic or not at all. That is why the tax on a piece of renamed lands claimed by Bozhou was returned to Luyi’s jurisdiction after Luyi people appealed to Beijing, but the taxpaid byLuyi people for Zhechengwas never removed fromtheir taxquota, despite the repeated efforts by taxpayers and magistrates in Luyi. In both cases, the total amount of tax quotas on the renamed lands in Luyi, Bozhou, and Zhecheng was not to be reduced, and the state was only to decide which county should assume what share of the total tax quota, weighing who had more ability to pay. For the state, it was a matter to arrive at a balancing point where the expected tax quota was fulfilled, and none of taxpayers or communities would be driven by an unbearable tax burden to resort to tax resistance or riots. Indeed, Luyi local elites only tried to appeal to the higher authorities to sympathize with them. In this instance and to the degree the Qing state was managing that balancing act, its revenue extraction goal—tax quota in the books—was largely realized, at the lowestpossibletransactioncostortothelimitofadministrative capacityoftheQingstate.",
    "Acknowledgments. I would like to thank two anonymous reviewers for the Journal of Chinese History for their constructive suggestions on earlier versions of this article. Cite this article: Xiaoqun Xu, “State Revenue Extraction and Local Collection Expediency in Qing China: “Equal Sharing” of Tax Quota on “Renamed lands” in Henan Province,” Journal of Chinese History (2025), 1–23 https://doi.org/10.1017/jch.2025.10"
]