[
    "Citation: Hao, Y.; Wang, C.; Sun, C.; Liu, D. Evaluation and Spatial– Temporal Pattern Evolution of Synergy Degree of Emergency Management for Urban Flood Disasters from the Perspective of Sustainable Development—The Case of Henan, China. Sustainability 2024, 16, 4730. https://doi.org/10.3390/ su16114730 Abstract: The management of urban flood disasters is a systematic engineering project that requires a great amount of manpower, material resources, and financial resources, and the interaction and coordination degrees of various elements in the system deeply affect the efficiency of the final governance. According to the theories of synergy, composite systems, and sustainable development, this research first established an evaluation index system to determine the synergy degree of urban flood disaster emergency management from the four dimensions of prevention and preparation, monitoring and early warning, response and rescue, and recovery and reconstruction. Then, the synergy degree was explored by using the developed composite system synergy degree model on the basis of the panel data of 18 prefecture-level cities in Henan Province from 2013 to 2021, and synergy level change characteristics were analyzed from the perspectives of time and space. Finally, the obstacle degree model was applied to explore the obstacle factors affecting synergy degree development. The results showed that the overall level of the urban flood disaster emergency management coordination degree in Henan Province was relatively low, and there were significant differences in synergy among cities. Among them, 12 cities presented mild synergy, and 6 cities showed mild nonsynergy. The spatial correlation of the synergy degree was not stable, which revealed a lack of mature coordination mechanisms for flood disaster emergency management among cities. The analysis of obstacle factors showed that recovery and reconstruction subsystems were the main obstacle systems that affected the synergy degree. Copyright: © 2024 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). Due to the combined effect of global change and urbanization, extreme hydrometeoro- logical events frequently strike around the world [1], seriously affecting the sustainable development of regional societies [2], and cities have become the forefront of disaster risk and the main battlefield to address the challenge of climate change [3]. Flood disasters are among the natural disasters that frequently occur around the world, with serious losses and great consequences [4]. Based on the statistics of the World Meteorological Organization, from 1970 to 2019, weather, climate, and water disasters accounted for 50% of all disasters and 74% of all economic losses, of which 44% were related to floods, which has presented an increasing trend [5,6]. Under the effect of a monsoon climate and complex terrain, heavy rains and floods have become concentrated and exert more serious effects in China [7]. The report of the Ministry of Water Resources of China revealed that flood disasters had caused a total of about USD 763.78 billion in financial losses and more than 61 thousand deaths from 1990 to 2020 [8]. Recently, “looking at the sea in the city” has become a com- mon problem in the development of Chinese cities [9], attracting great attention from the scientific community and society. It has become a prominent weak spot in urban disaster prevention and reduction systems and a major constraint on the sustainable development of cities [10–12]. Traditional emergency management models, which rely on government departments as a single disaster relief force, have difficulty in effectively dealing with the new challenges brought by urban flood risk. Currently, the number of policy subjects involved in flood disaster management is increasing every day. Only under unified command can the advantages of various departments be brought into full play, synergistic effects of multi- governance subjects be formed, and comprehensive management ability of flood disasters be improved [13]. Hence, in urban flood disaster management processes in the future, it is essential in the field of public management to develop a collaborative governance relationship among various policy subjects to help them perform their respective duties and work together to improve flood disaster management effectiveness under the premise of cohesion. It is urgent and realistic to study the coordination degree of urban flood disaster emergency management. Collaborative governance emphasizes effective collaboration among different gover- nance entities to maximize overall governance efficiency [14]. Collaborative governance is a novel governance approach that has become an essential means to respond to disasters and is a hot topic in research on disaster theory [15–17]. Researchers have recognized the posi- tive function of collaborative governance, generally assuming government departments as the main bodies of natural disaster emergency response and rescue work, and emphasized that it is necessary to fully understand and leverage the advantages and strengths of other social entities under the guidance of government departments, constantly strengthen the collaborations of multiple entities, and establish new collaborative governance models for natural disasters [18–20]. For example, Kyoo-Man Ha et al. found that it was difficult to effectively integrate and coordinate different resources by relying only on the works of dif- ferent government departments [21]. Strader studied emergency management in tornado disasters and found that in terms of disaster emergency management, the US government and social institutions needed to cooperate effectively [22]. Waugh et al. considered synergy as a necessary foundation for responding to natural disasters, emphasizing the importance of cooperation and advocating for increasing collaboration numbers during rescue and managing them [23]. Carreras-Coch showed that in an information-based environment, communication technology was the key to emergency management [24]. Hence, it is neces- sary to provide necessary basic services as soon as possible and develop an efficient and rigorous emergency management information system to meet social needs.",
    "Since the 1990s, Chinese researchers have performed extensive research on natural disaster synergy governance [25–29]. They unanimously believe that other governance enti- ties, along with the government, play increasingly important roles in responding to natural disasters and have performed in-depth research on the coordination and cooperation of multiple entities participating in disaster governance [30–32]. Yang et al. showed that there were still some issues, such as weak awareness of disaster prevention and reduction, imper- fect laws and regulations, and ineffective coordination and cooperation among government departments, which required improvement in the joint participation of multiple entities in natural disaster emergency management [33]. Wang et al. suggested that a joint urban flood prevention and control system had to be established in terms of forecast and early warning, joint dispatching of engineering systems, pre-rehearsal planning, decision making consultation, material allocation, and risk-avoidance measures [34]. Li et al. investigated regional flood characteristics, disaster characteristics, and the current flood control situation in the Chengdu Chongqing urban agglomeration and developed a collaborative response model for major urban flood disasters on the basis of the zoning of weak flood control points [35]. Based on the dilemma of urban flood disaster emergency management, Peng et al. investigated coordinated emergency measures among multiple agents in terms of both subject and process, combined with the four stages of crisis reduction, preparation, response, and recovery [36]. In relevant research works performed around the world, it can be seen that the participation of multiple stakeholders in the emergency management of flood disasters has been extensively studied. Researchers from around the world reached a consensus on the necessity of collaborative participation among multiple stakeholders in flood disaster management. Research on natural disaster management began earlier internationally, and the obtained results hold an important position in natural disaster synergy emergency management today, which is worth learning and referencing. Recently, Chinese researchers have paid increasing attention to natural disaster management, and experts in different fields have proposed a large number of feasible countermeasures for the collaborative management of natural disasters based on different role positions. However, most of the current studies still focus on qualitative analyses from the perspective of government management and tend to make horizontal comparisons of multiple cases, lacking quantitative evaluation; therefore, the research depth needs to be further improved [36–40]. Few researchers have quantitatively investigated the syner- gistic effect of the flood disaster management process from the perspective of composite system synergy, and theoretical and experimental research on the synergistic evaluation of flood disaster management is relatively lacking. Therefore, this research used panel data from 18 prefecture-level cities in Henan Province from 2013 to 2021 to explore the flood disaster emergency management synergy degree according to the composite system synergy degree model and analyzed the changing characteristics of the coordination level in terms of time and space. Finally, the obstacle model was applied to investigate the factors constraining emergency management synergy development for flood disasters in Henan Province in order to provide a theoretical basis for the prevention, reduction, and sustainable development measures of urban disasters. Strengthening emergency synergy is a common requirement and an important trend in the current emergency management work of various countries. A high-quality emer- gency management process should be connected to a professional, information-based, and intelligent disposal network for the mutual coordination of various emergency entities. In addition to considering the connection between vertical departments of the government, the connection between the government and other organizations, such as the public and the media, as well as the horizontal connection between regions, is also crucial [41]. As a result, combined with the characteristics of flood disasters and the objectives of the emer- gency management system, this study evaluated the synergy of urban flood emergency management from the four levels of prevention and preparedness, monitoring and early warning, response and rescue, and recovery and reconstruction [42–46]. By analyzing the literature and consulting experts, the evaluation index system of urban flood emergency management containing 28 indices was obtained after removing redundant indices by correlation analysis (Table 1). This study used the entropy method to calculate the index weights [47,48], which is a widely used method of objective assignment when dealing with panel data, and averaged the index weights from 2013 to 2021 to obtain the index weights of this evaluation system (Table 1).",
    "Synergy was proposed by renowned physicist Haken in 1971 [49]. The theory of synergy holds that a system contains many subsystems, and the subsystems contain different elements. The coordination within and among each subsystem promotes the development of the whole system from disorder to order. The synergy degree represents the degree of interrelation and interaction between the elements of subsystems and between subsystems. There is a strong positive correlation between synergy degree and synergy effect. The higher the synergy degree of the system, the stronger the overall function of the system and the better synergy effect. The synergy theory is widely applied in fields such as science and technology innovation, transportation logistics, social governance, urban development, etc. It shows that constructing the synergy degree model of composite system using synergetic principle can be used to study the collaborative development law of each subsystem within the composite system. The composite system for collaborative management of urban flood disasters is defined as S, S = {S1,S2,. . .,Sn}, where n is the number of subsystems, n ≥ 1, Si is a subsystem, and i ∈ [1,n]. xij is the value of the jth index of subsystem. If m indices are selected for j ∈ [1,m]. In composite systems, αij and βij represent, respectively, the maximum and minimum values of all data in the order parameter; then, βij ≤ xij ≤ αij. Suppose that xi1, xi2,. . ., xiρ(1 ≤ ρ ≤ m) are positive indices: the higher the index value is, the higher the order degree of the order parameter is. Suppose that xiρ+1, xiρ+2,. . ., xim are negative indices, and the larger the index value, the lower the order degree of the order parameter [50]. The order degree of the order parameter of the subsystem is µi xij to the order degree of the subsystem. The ordered contribution of order parameters to subsystems is represented by µi(xi), Its size is also related to the weight of the order parameter index and their combination form. This study adopted linear weighting method for integration: wij is the weight of the order parameter, µi(xi) ∈ [0,1]; the larger the value, the more ordered the subsystem is. The synergy degree of composite systems is a remeasurement of the order degree of subsystems from a dynamic perspective [51]. When there is no flood disaster, the emergency management system of urban flood disaster presents a disordered state, and each subsystem operates independently. When floods occur, the system changes, and all subsystems begin to coordinate and collaborate, leading to an orderly evolution of the entire system state [51]. Set a certain initial time t0; the order degree of each subsystem is µ0 then at another time t1, the order degree of each subsystem after the development and evolution of the whole system is µ1 i (xi). At this time, the synergy degree of the emergency management system for urban flood disasters is i (xi), This equation reveals the degree of collaboration and its changing trend in urban flood disaster emergency management system over a certain period of time. In the formula, µ1 i (xi) − µ0 i (xi) is the change amplitude of the order degree of the sequence parameters of the subsystem in the period of t0 ∼ t1. D ∈ [−1,1], whose positive and negative values are determined by θ. D ∈ [−1,0); the composite system is in a disordered and chaotic development state, and the closer the value is to 0, the lower the degree of disordered chaos. At this time, countermeasures should be taken to correct the problem of the composite system in order to strengthen the orderly development state. D ∈ [0,1]; the composite system is in a state of ordered coordinated development, and the larger the value, the higher the degree of system collaboration. The level classification of synergy degree of composite system [52] is shown in Table 2. In order to determine whether the synergy degree of emergency management for flood disasters in cities is spatially related and to deeply understand the geospatial correlation characteristics of the synergy degree of cities, this study adopted Queen’s Case method to construct the adjacent spatial weight matrix, calculated the Moran’s I, and conductd significance testing using the p-value of standardized Z-values. The calculation formula for the Moran’s I is as follows [53–55]: In the formula, n represents the number of regions; xi and xj are the synergy degree values of region i and region j,respectively, x is the sample mean; and hij is the regional spatial weight. The range of values for I is [–1, 1]. I ∈ (0,1] means that there is a positive spatial correlation between the synergy degree of urban flood disaster emergency manage- ment in this region, and the spatial feature is agglomeration. I = 0 indicates that there is a spatial uncorrelation and spatial characteristics of randomness. I ∈ [−1,0) indicates that there is a negative spatial correlation between the synergy degree of urban flood disaster emergency management in this region, and the spatial feature is scattered. The closer I is to −1, the more significant the anisotropy [56].",
    "Analyzing and diagnosing the main obstacle factors affecting the synergy degree of emergency management for urban flood disasters are conducive to the development of targeted strategies for improving the coordination degree of urban flood resistance [57]. The specific methods are as follows: In the above formula, ´xij is the index value after extreme value standardization; Uij is the deviation degree of the index; and Wij is the factor contribution degree, namely, the index weight. Mj is the obstacle degree of the index, and the larger its value, the higher the degree of restriction on the coordination degree of urban flood disaster emergency management, which also means the greater the degree of impact. Henan Province is located in the middle and lower reaches of the Yellow River in the middle east of China and the south of the North China Plain. With a total area of 167,000 square kilometers and a permanent population of 98.15 million, it is the only province in China that crosses the Huaihe River, Haihe River, the Yellow River, and the Yangtze River [58]. In retrospect, Henan has experienced many large-scale flood disasters with heavy losses, such as the great breach of the Huayuankou dike in 1938 [59], the Zhumadian extremely heavy rainstorm in 1975 [60], and the “July 20” extremely heavy rainstorm in Zhengzhou in 2021 [61]. Henan Province is located in two transitional zones from the north to the south climate and from the mountains to the plain, and the terrain decreases in steps from west to east. The western mountains form a natural barrier to the warm and humid airflow and water vapor brought by the southeast monsoon. Under the effect of topographic uplift, abundant terrain rain is formed, making Henan one of the three regions with the highest precipitation variability in China [62]. Secondly, Henan Province lacks effective flood discharge conditions. Most areas in Henan Province are plains with direct flood discharge, and there is a lack of large lakes and rivers that can divert and retain heavy rainfall. When the accumulated water is difficult to drain, it can cause flooding. The Yellow River is the most difficult-to-manage surface river in the world. When the Yellow River enters the North China Plain, the sediment silts up, raising the riverbed. So, the Yellow River in Henan Province not only fails to play the role of flood discharge but may also break its banks due to heavy rainfall. Therefore, although the average annual rainfall in Henan Province is not large, the frequency and severity of flood disasters are much greater than those in southern provinces. To sum up, the selection of Henan Province as a sample in this article is of great research significance. The research area diagram is shown in Figure 1. The data selected in this article mainly come from the Henan Statistical Yearbook, Henan Water Conservancy Yearbook, the Henan Survey Yearbook, as well as the national economic and social development statistical bulletins of 18 cities. According to the subsystem order degree model, the order degree of the subsystems of prevention preparation, monitoring and early warning, response and rescue, and recovery and reconstruction in each city from 2013 to 2021 was calculated. This study reflects the data characteristics of the subsystem order degree by calculating the mean and standard deviation, as shown in Figures 2–5. The horizontal symbol in the figure is the abbreviation of the first letter of the city name, namely, Zhengzhou (ZZ), Kaifeng (KF), Luoyang (LY), Pingdingshan (PDS), Anyang (AY), Hebi (HB), Xinxiang (XX), Jiaozuo (JZ), Puyang (PY), Xuchang (XC), Luohe (LH), Sanmenxia (SMX), Nanyang (NY), Shangqiu (SQ), Xinyang (XY), Zhoukou (ZK), Zhumadian (ZMD), Jiyuan (JY). In the prevention preparation subsystem, the highest annual mean value is in Jiyuan, the lowest is in Zhoukou, and the highest standard deviation is in Anyang, followed by Jiyuan, indicating that the order degree of these two cities’ subsystems fluctuates greatly over time. In the monitoring and early warning subsystem, the highest annual average is in Zhengzhou, almost twice that of other cities, and the lowest is in Xinyang. The largest standard deviation is in Xinyang; it can be obviously seen that the subsystem order degree of Xinyang has been greatly improved. The cities with a relatively small standard deviation and stable development are Kaifeng, Anyang, Hebi, Xuchang, and Luohe.",
    "In the response and rescue subsystem, Zhengzhou has the highest annual average value, and Shangqiu has the lowest, but Shangqiu has the highest standard deviation, indicating that the order degree of Shangqiu’s subsystems is low and unstable. There was a sudden drop in 2021, which requires special attention and investigation of the cause. In the recovery and reconstruction subsystem, the highest annual average is in Nanyang, and the lowest is in Kaifeng. The largest standard deviation is in Anyang, Puyang, Nanyang, and Zhumadian, all of which are close to 0.08, and the smallest standard deviation is in Shangqiu. Given the fluctuation degree of the mean line, it can be seen that the difference degree of the subsystem order degree among cities is most obvious in the monitoring and early warning subsystem, but it is not obvious in the restoration and reconstruction subsystem. Given the fluctuation degree of the standard deviation line, it can be seen that the difference degree of the subsystem order degree between cities over time is most obvious in the monitoring and early warning subsystem, which has two peaks in Puyang and Xinyang, while it is not obvious in the response and rescue subsystem, indicating that, basically, the subsystem order degree of each city changes little over time. Taking 2013 as the base period, the results of subsystem order degree calculation were substituted into Formulas (3) and (4) to calculate the synergy degree of each city from 2014 to 2021. The calculation results are shown in Table 3. The collaborative degree of composite systems in various cities fluctuates greatly from mild nonsynergy to mild synergy. From 2014 to 2021, the average range of each city was 0.074, and the average standard deviation was 0.026. The average annual range and standard deviation of the synergy degree of the composite system were 0.087 and 0.029, respectively. By analyzing the mean value of the synergy degree of each city from 2014 to 2021 (Figure 6), it was found that 12 cities are in mild synergy, and 6 cities are in mild nonsynergy. Given the fluctuations of the line and the height changes of the column, it can be clearly seen that there are great differences in the synergy degree of composite systems among cities. When an object is evaluated by indicators, the evaluation score and weight coefficient of each indicator will affect the size of the evaluation result. In this study, the weight coefficient of the index is changed only in a certain range, and the evaluation effect of the composite system synergy degree model is measured by the change scope of synergy degree results. The smaller the change scope is, the higher the stability of the model and the better the evaluation effect of the model. This study took the synergy degree value of 18 cities in Henan Province in 2021 as an example. Two indicators were selected from any subsystem. The weight coefficients of one indicator were changed by 1%, 5%, and 10%, respectively, and the other indicator changed with it. Finally, the change scope of the synergy degree was calculated, as shown in Table 4. Table 4. The change rate of synergy degree when the weight coefficient of an index changes by %1, 5%, and 10%, respectively (%). It can be clearly seen in the data in the table that when the weight coefficient changes by 10%, although the change degree of the synergy degree value in Hebi and Nanyang is larger than that of other cities, the overall value of the synergy degree changes within 5%. In summary, the composite system synergy degree model is stable and effective in evaluating the coordination level of urban flood disaster emergency management. Overall, the synergy degree along the Yellow River region is slightly higher than that of other regions, and both have no obvious trend of change with the growth of time (Figure 7). Specifically, the synergy degree along the Yellow River region for five years is greater than that of other cities. This reflects that this region has more efficient emergency management in response to flood disasters compared to other regions, which is also consistent with the above conclusion that cities with higher levels of a subsystem order degree are mostly located near the Yellow River. The cities along the Yellow River are in areas prone to flood disasters, and these cities have achieved great results in emergency coordinated management. However, the high destructiveness of flood disasters can also easily cause heavy damage to the area and prevent rapid recovery. In contrast, the synergy degree of areas with fewer flood disasters appears to be more stable.",
    "As shown in Figure 8, from 2013 to 2021, the order degree of the prevention preparation subsystem showed a general trend of first increasing and then decreasing. The monitoring and early warning subsystem had hardly changed before 2017 but showed a clear upward trend from 2017 to 2020, growing steadily from about 0.4 to about 0.5 and maintaining a medium orderly level. The order degree of the response rescue subsystem and the recovery and reconstruction subsystem had no obvious trend, fluctuating around 0.350 and 0.386, respectively. Moreover, the order degree of the response rescue subsystem almost remained unchanged, while the order degree of the recovery and reconstruction subsystem fluctuated greatly. On the whole, the order degree of the annual response and rescue subsystem was obviously lower than that of the other three subsystems, which reflects that the response and rescue subsystem is a relatively weak link in the emergency management of urban flood disasters. The synergy degree of the composite system was at a very low level and remained at around 0.002 in a sawtooth shape from 2013 to 2021. This shows that the cities in Henan Province have not paid much attention to the coordination of emergency management. With the reform of the emergency management system under the framework of great security and great emergency, there is still a long way to go for Henan Province to enter the stage of highly coordinated development in flood disaster emergency management. In order to comprehensively analyze the spatial characteristics of the synergy degree of urban flood disaster emergency management in Henan Province, ArcGIS software (ArcGIS10.8.1) was used to draw the spatial pattern distribution map of the collaborative degree of the composite system in each city (Figure 9). It was found that the synergy degree of various cities shows the following characteristics in spatial distribution: 1⃝ As time went by, more than half of the cities in 2014, 2017, and 2019 were in a state of mild nonsynergy, and half or more of the cities in 2015, 2016, 2018, 2020, and 2021 were in a state of mild synergy. However, the number of cities with mild synergy tended to be equal to that of cities with mild nonsynergy on the whole. In addition, the cities with mild synergy gradually increased from the north of Henan Province to the southwest, then moved to the southeast, and finally shifted to the north again. 2⃝ From the perspective of local cities, if cities that have been in a mild synergy state for 5 years or more are considered cities with relatively stable levels of emergency governance collaboration, then the relatively stable cities in Northern, Western, Central, and Eastern Henan are Jiyuan, Luoyang and Sanmenxia, Xuchang and Luohe, Zhoukou, and Shangqiu, respectively. The overall collaborative development in Southern Henan is not stable. Moreover, both Puyang and Xinyang have only been in a mild synergy state for two years, which shows they urgently need to strengthen their coordination and linkage with neighboring cities. 3⃝ From the perspective of different river basins, most of the cities in the state of synergy are located in the Yellow River basin and the Huai River basin. Based on the spatial autocorrelation model, the global Moran’s I of the synergy degree from 2014 to 2021 was calculated using ArcGIS software, as shown in Table 5. The following conclusions can be drawn from Table 5: 1⃝ The global Moran’s I of the synergy degree in 2017 and 2019 was positive, but the synergy degree in 2017 did not pass the significance test, which reflects that the central city in this region has a weak radiative driving effect on flood disaster emergency management in surrounding cities, and the spatial agglomeration effect needs to be further improved. The synergy degree in 2019 passed the significance test, showing a significant spatial positive correlation. This indicates that cities gradually became cooperative in the emergency management of flood disasters from 2014 to 2019. 2⃝ The global Moran’s I of the synergy degree was negative in 2014, 2015, 2016, 2018, 2020, and 2021, which showed a certain spatial negative correlation. However, this relationship is not significant, indicating that the cooperation among cities in the emergency management of flood disasters is not strong, and there is a phenomenon of “individual governance”. 3⃝ On the whole, the spatial correlation of the synergy degree of urban flood disaster emergency management is not stable, and the dispersion trend of the synergy degree is relatively obvious, which reflects that a mature synergy mechanism of flood disaster emergency management has not been formed among cities.",
    "Given the above analysis, it can be seen that the synergy degree of emergency man- agement for urban flood disasters presents spatial differentiation in local areas. However, the global Moran’s I cannot indicate the areas where the synergy degree exhibits high (or low) value clustering. Therefore, the LISA diagram was drawn to reveal the characteristics of local spatial agglomeration of the synergy degree, as shown in Figure 10. The LISA diagram can more intuitively reflect the spatial connections between regional units and their neighbors, which belong to the categories of high synergy–high synergy (HH), high synergy–low synergy (HL), low synergy–high synergy (LH), and low synergy–low synergy (LL) [63]. HH indicates a high value, and the surrounding areas are of high value. HL represents itself as a high value but surrounded by a low value; LH means that it is low but surrounded by high values; LL indicates that the value itself is low and the surrounding area is low. HH and LL represent positive spatial autocorrelation, indicating the clustering of similar values. HL and LH represent a negative spatial autocorrelation, indicating that there is spatial heterogeneity and a large spatial difference among study objects. This study has found the following conclusions through analysis: 1⃝ In the past eight years, the local spatial autocorrelation of the synergy degree of urban flood disaster emergency management in Henan Province was unstable, and the spatial pattern of the synergy degree among different cities changed significantly, but the development law was not obvious. The synergy degree in 2019 did not generate agglomeration. In other years, Pingdingshan and Zhumadian only showed low–low clustering in 2014; Anyang only showed low–high clustering in 2015; Kaifeng only showed high–low clustering in 2016; Zhumadian only showed high–low clustering in 2020; Jiyuan showed low–high clustering in 2017 and high–low clustering in 2021; Xinyang showed low–low clustering in 2017 and high–high clustering in 2019; and Zhengzhou showed high–high clustering in 2015 and 2020 and low–low clustering in 2019, while there was no clustering in other years. 2⃝ In contrast, Zhengzhou is the city with the most agglomeration times and shows a positive spatial correlation, which indicates that this region makes Zhengzhou the radiation center to drive the coordinated development of other cities. Moreover, among cities with agglomeration in the past eight years, there are three high–high clusters, five low–low clusters, and five low–high (high–low) clusters, which reflects the collaborative capacity for emergency management of flood disasters between adjacent cities. The overall level of the synergy degree of composite systems is very low, so further exploration of obstacle factors is of great help to improve the synergy degree in a targeted manner [57]. According to the calculation results of the obstacle degree model, only the top five obstacle factors are listed here from high to low, as shown in Table 6. The main indicators that have a great impact on the synergy degree of emergency management for urban flood disasters in Henan Province are the number of beds for com- munity service institutions and facilities per 10,000 people (x48), the number of unemployed insurance participants (x42), the proportion of fixed investment in public management, social security and social organizations (x45), the total number of posts and telecommunica- tions services (x26), and the number of flood control projects (x36). From the perspective of years, the two indicators of the number of unemployed insurance participants (x42) and the proportion of fixed investment in public administration, social security, and social organizations (x45) from 2013 to 2021 have consistently ranked in the top three, which has a greater impact on the synergy degree. Furthermore, regarding the number of flood control projects (x36) from the top five to not in the top five to re-entering the top five, the influence on the synergy degree has a trend of first decreasing and then increasing [64]. Civil car ownership per 10,000 people (x16) has gradually increased from third to outside of the top five, and its influence is continuously declining. The obstacle factors ranked fourth and fifth have undergone greatly changes, but in terms of the frequency of occurrence, the impact of the total amount of postal and telecommunications business (x26) is greater. In most years, the three indices of the recovery and reconstruction subsystem ranked in the top five at least, indicating that the recovery and reconstruction subsystem is one of the main obstacle systems affecting the synergy degree of emergency management of urban flood disasters in Henan Province because it is the foundation for the sustainable development of the other three subsystems [65].",
    "According to the panel data of 18 cities in Henan Province, this research conducted an empirical study on the urban flood disaster emergency management synergy degree and finally drew the following conclusions: As a whole, the order degrees of the four subsystems in Henan Province were between 0.3 and 0.5, and those of the response and rescue subsystem were the lowest, which was found to be a weak subsystem that needed special attention and improvement. Secondly, the order degree and fluctuation degree over time of the intercity monitoring and early warning subsystem were the most obvious, indicating an imbalance of emergency information collaboration among different regions. The synergy degree of cities repeatedly fluctuated from mild nonsynergy to mild synergy over time. The synergy degree of Henan Province remained at around 0.002, with a significant sawtooth shape from 2013 to 2021, and the highest level was in a mild synergy state, with a significant gap compared to high synergy. The heterogeneity of the synergy degree among cities in Henan Province was obvious. Most cities in a synergy state were located in the Yellow River and Huai River basins. The coordination abilities of flood disaster emergency management among neighboring cities were mostly low or not quite equal (low–low, high–low). On the whole, the two limiting factors with the greatest restricting effects on the syn- ergy degree of flood disaster emergency management in Henan Province were, respectively, the “number of community service institutions and facility beds per 10,000 people” and the “number of participants in unemployment insurance”. The restoration and reconstruction subsystem was the main obstacle system that affected the synergy degree. quent flooding, which has become a difficult and painful challenge for current urban security with serious effects on urban public safety and sustainable development. The sud- denness of rainstorms, uncertainty of floods, and severity of loss highlight the complexity of the urban flood problem. When flood disasters occur, the entire urban system is affected to varying degrees, and the impact is often cross-regional, cross-industrial, and cross-level. Hence, developing a cross-domain emergency management coordination mechanism is urgent. Starting from the current situation of urban flood disasters in China, this research constructed an evaluation index system of the urban flood disaster emergency management synergy degree according to the 4R theory proposed by American crisis management expert Robert Heath. Based on the panel data of 18 cities in Henan Province from 2013 to 2021, the composite system synergy degree model was applied for empirical evaluations, and syn- ergy degree change characteristics were explored from in terms of time and space. Finally, the obstacle degree model was applied to diagnose the main obstacle factors restricting the coordinated development of urban flood disaster emergency management. This research helped explore the regularity of urban flood disaster collaborative management. Further- more, this research used a composite system cooperation degree model to investigate the effect of flood disaster coordination management; expanded the application field of the model; and provided a new research perspective for current disaster emergency treatment and rescue to optimize comprehensive urban flood management systems, improve the scientific nature as well as the effectiveness of urban flood disaster management, and provide support for urban disaster prevention and reduction and sustainable development. Of course, some limitations still exist. Firstly, the data in this research might not cover the factors affecting the coordination level of urban flood disaster emergency management, and more relevant data regarding emergencies should be added to more accurately re- flect the actual situation. Secondly, this research focused on the static calculation of the emergency management synergy degree for urban flood disasters in different time series, ignoring the speed change characteristics of the dynamic evolution of system coordination, such as the measures of velocity states and trends [66,67]. In the future, we will continue to conduct in-depth studies on this issue, and we look forward to the joint participation of relevant researchers. Author Contributions: Conceptualization, Y.H.; methodology, Y.H.; validation, C.W.; writing— original draft, C.W.; data curation, D.L.; supervision, D.L. and C.S.; editing, D.L.; resources, C.S. All authors have read and agreed to the published version of the manuscript. Funding: This research is funded by the National Natural Science Foundation of China (NSFC)(52374196); Humanities and Social Sciences Foundation of Henan Polytechnic University (SKYJ2021-01); Philoso- phy and Social Science Innovation Team of Henan Province (2023-CXTD-06); Research Foundation of Humanities & Social of Henan Polytechnic University (SKJQ2020-01)."
]