[
    "Xiangyuan Zhang 1,2, Yong Wu 1,2,* , Ling Li 1,2, Chi Sun 3, Shuhan Yang 1, Jie Lu 1 and Wenzhen Wang 1 Citation: Zhang, X.; Wu, Y.; Li, L.; Sun, C.; Yang, S.; Lu, J.; Wang, W. Analyzing Determinants of Farmers’ Participation in Agricultural Non-Point Source Pollution Control: An Application of the Theory of Planned Behavior. Sustainability 2025, 17, 5746. https://doi.org/10.3390/ su17135746 Agricultural producers play a crucial role in combating agricultural non-point source pollu- tion, so improving their production behaviors and practices will be key to alleviating such pollution. This study employs the Theory of Planned Behavior and focuses on Huaxian County, a major grain-producing county in Anyang City, Henan Province. The study fo- cuses on randomly selected sample farming households in townships within Hua County’s agricultural intensification zone. Through structural equation modeling, it has analyzed the impact of farmers’ individual characteristics, behavioral attitudes, subjective norms, and perceived behavioral control on their willingness to engage in pollution management, as well as the influence of such willingness on actual management behaviors. Research indicates that behavioral attitudes, subjective norms, and perceived behavioral control significantly and positively influence governance intention, and governance intention sig- nificantly and positively influences governance behavior. Behavioral attitude is the key latent variable (behavioral attitude > perceived behavioral control > subjective norm). That is, the economic benefits derived from agricultural non-point source pollution governance constitute the most critical factor influencing farmers’ willingness to participate in pol- lution governance. Furthermore, farmers’ willingness to participate in pollution control bridges the gap between their attitudinal inclination and actual behavioral implementation. Accordingly, this study can provide a theoretical basis and reference for the governance of non-point source pollution in county-level regions of Henan Province and similar ma- jor grain-producing areas and offer theoretical support for the sustainable development of agriculture. Copyright: © 2025 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https://creativecommons.org/ licenses/by/4.0/). Irrational production behaviors of farmers, who are the basic unit in agricultural production, can directly lead to agricultural non-point source pollution [1,2]. Agricultural non-point source pollution (AGNPS) is widely recognized as a key issue affecting the global water environment [3]. To effectively control such pollution, it will be vital to get them involved. In the Implementation Plan for the Treatment, Supervision, and Guidance of Agricultural Non-point Source Pollution (Trial) jointly issued by the Ministry of Ecology and Environment and the Ministry of Agriculture and Rural Affairs, it is emphasized that the treatment of non-point source pollution requires the extensive mobilization of the main players in the agricultural industry chain and all sectors of society, and the promotion of collaboration from multiple subjects such as the government, agricultural social service agencies, and farmers [4,5]. Therefore, exploring the participation mechanism of farmers in agricultural non-point source pollution and discussing key factors influencing their participation can provide a theoretical basis and policy guidance for preventing and controlling such pollution. In recent years, scholars have gradually become aware of the impact of farmers’ behaviors during their research on the prevention and control of agricultural non-point source pollution at the source. They have constructed frameworks from the perspective of farmers’ governance behaviors in agricultural non-point source pollution control to discuss related issues [6]. Some of them have introduced the Theory of Planned Behavior (TPB) into the research, attempting to explain the behavioral awareness of individuals in the process of environmental governance. Through analyzing individuals’ behavioral attitudes, subjective norms, and perceived behavioral control, they have discussed the key factors influencing individual behaviors [7–9]. Empirical studies demonstrate that analyzing correlations between behavioral variables significantly enhances the predictive and explanatory power of individual decision-making [10,11]. Research employing a driving mechanism model of farmers’ fertilizer usage intention, grounded in the TPB, has substantiated the pivotal role of subjective norms and perceived behavioral control in agricultural environmental governance systems [12]. Furthermore, behavioral attitudes exhibit measurable impacts across diverse agricultural practices, including participation in voluntary carbon markets and cultivated land abandonment behaviors [13,14]. Based on the above discussion, this paper takes Huaxian County, a major grain-producing county in Henan Province with relatively serious non-point source pollution risks, as an example. The new dimension of exploring farmers’ principal behaviors discusses the factors influencing farmers’ participation in non-point source pollution control through TPB. This study will further expand the application scope of TPB in agricultural environmental protection and provide a basis for policymaking for effective treatment of non-point source pollution and As the top grain-producing county in Henan Province, Huaxian County, China is located in the first-level high-risk area of agricultural non-point source pollution [15]. Therefore, it can represent the typical planting patterns and habits in Henan Province. Meanwhile, it is also a pilot demonstration county in the prevention and control of agricul- tural non-point source pollution, and as such, it has explored and formed a series of effective governance models. Therefore, its governance experience will be of reference value.",
    "Data in this paper come from a random sampling questionnaire survey carried out by the research group in Huaxian County in July 2023. The study selected five townships with larger-scale agriculture in Hua County, randomly choosing two to three villages per township. Then, 10–20 farmers were randomly selected from each village as the objects. Interviews were carried out to ensure the authenticity and effectiveness of the survey. A total of 300 questionnaires were collected, with 245 valid ones, or 81.6%, after eliminating incomplete or non-standard ones. This study is grounded in the Theory of Planned Behavior (TPB) [7,16]. It aims to identify key factors influencing farmers’ agricultural non-point source pollution governance behaviors by understanding and predicting their behavioral patterns and intentions. We have constructed a “cognition-behavior” theoretical framework, where behavioral attitudes (BA), subjective norms (SN), and perceived behavioral control (PBC) serve as independent variables, governance intention (GI) functions as the mediating variable, and governance behaviors (GB) constitutes the dependent variable. Behavioral Attitudes (BA): Refers to an individual’s evaluative tendency toward spe- cific behavioral outcomes, representing positive/negative assessments based on subjective estimations of behavioral consequences [17]. Research indicates favorable agricultural water environments contribute to agricultural development, grain production, and eco- logical conservation [18,19]. So, positive perceptions of agricultural non-point source pollution management enhance farmers’ willingness to participate and level of behavioral engagement [20,21]. Subjective Norms (SN): Denotes the perceived social pressure from significant others, reflecting the alignment between individual actions and collective expectations [22]. Rel- evant studies have pointed out farmers’ perceived social pressure predominantly stems from family members, neighbors, and village committees. Such external pressures can substantially influence decision-making processes, where external groups’ perceptions of and responses to agricultural non-point source pollution governance emerge as critical factors shaping farmers’ behavioral intentions [20]. Perceived Behavioral Control (PBC): Captures one’s awareness of facilitating/ con- straining factors affecting behavioral performance [23,24]. Regarding farmer participation in non-point source (NPS) pollution governance, their perceptions of external influencing factors—such as policy interventions, technical support, and financial mechanisms—reflect critical determinants. These differential impacts on behavioral strategies ultimately shape behavioral intentions [25,26]. Governance Intention (GI): Represents the psychological predisposition toward per- forming future specific behaviors, serving both as direct behavioral determinant and optimal predictor [27]. Concurrently, a lot of research on farmer behavior demonstrates that behavioral intentions effectively mediate the relationship between latent constructs and observed behaviors [21,28,29]. Theoretical propositions indicate that enhanced behavioral attitudes, strengthened subjective norms, and improved perceived behavioral control collectively intensify the governance intention, thereby increasing behavioral likelihood. Governance intentions mediate the effects of the three independent variables on actual behaviors [7,31]. Addition- ally, demographic variables and other individual characteristics may indirectly influence behavioral attitudes, subjective norms, and perceived behavioral control or directly affect behavioral intentions and actions [32,33]. Hypothesis 1 (H1). There are significant differences in basic demographic indicators across the dimensions of planned behavior (including the dimensions of behavioral attitudes, subjective norms, and perceived behavioral controls), governance intentions, and governance behaviors. Hypothesis 2 (H2). Behavioral attitudes have a significant positive impact on farmers’ willingness to engage in the governance of agricultural non-point source pollution. Hypothesis 3 (H3). Subjective norms have a significant positive impact on farmers’ willingness to engage in the governance of agricultural non-point source pollution. Hypothesis 4 (H4). Perceived behavioral control has a significant positive impact on farmers’ willingness to engage in the governance of agricultural non-point source pollution. Hypothesis 5 (H5). Governance intentions have a significant positive impact on farmers’ behavior in getting involved in the governance of agricultural non-point source pollution. Hypothesis 6 (H6). Governance intentions play a mediating role in the process of how behavioral attitudes affect farmers’ behaviors in controlling agricultural non-point source pollution. Hypothesis 7 (H7). Governance intentions play a mediating role in the process of how subjective norms affect farmers’ behaviors in curbing agricultural non-point source pollution. Hypothesis 8 (H8). Governance intentions play a mediating role in the process of how perceived behavioral control affects farmers’ behaviors in combating agricultural non-point source pollution. An individual’s behavioral attitude is manifested as the degree of importance (A1) that a farmer attaches to the governance behavior. Meanwhile, agricultural benefits (agri- cultural development A2, agricultural production A3) related to the individual’s survival and the living environment (A4) are the main factors reflecting the farmer’s subjective evaluation. The main sources of social pressure experienced by farmers are relatives (B1), neighbors (B2), the village committee (B3), and government organizations (B4), whose influence serves as the observed variables reflecting the farmers’ subjective norm. The perceived behavioral control of farmers reflects how an individual’s perception of external influencing factors affects the difficulty level of his/her behaviors. Policies (transparency C1, understanding C2), technology (C3), subsidies (C4), and the farmers’ own capabilities (C5) are all key factors influencing the difficulty level and serve as the observed variables reflecting the perceived behavioral control. Whether farmers are willing to reduce the use of pesticides (F1) and chemical fertilizers (F2) but increase the input of organic fertilizers (F3) demonstrates their willingness to support the governance of agricultural non-point source pollution. Regarding farmers’ governance behaviors, the observed variables are specifically reflected in three aspects: initiative (D1), willingness to publicize (D2), and willingness to participate in training and learning (D3) (see Table 1).",
    "Based on the above-mentioned analytical framework and hypotheses, this paper has constructed a model for analyzing farmers’ behaviors in participating in agricultural non- point source pollution control based on the Theory of Planned Behavior (Figure 1). The model has explored the influence of individual characteristics on five latent variables, examined the effects of behavioral attitudes, subjective norms, and perceived behavioral control on behavioral intentions, and analyzed the impact of behavioral intentions on pollution control behaviors. Structural equation modeling is a multivariate statistical analysis method that de- scribes the relationships among latent variables and their corresponding observed variables. It integrates factor analysis, path analysis, and multiple regression analysis to provide a more comprehensive analytical framework for influencing factors [34]. where x and y represent exogenous observed variables and endogenous observed variables respectively. ξ and η denote exogenous latent variables and endogenous latent variables. ΛX and Λy mean the relationships between observed variables and latent variables. δ signifies the residual of the exogenous observed variable x, and ε indicates the residual of the endogenous observed variable y. B is the relationship coefficient among endogenous variables, and Γ is the coefficient between endogenous and exogenous variables. ξ and η are endogenous variables, and ζ is the error term [35]. Based on the Theory of Planned Behavior, this research has constructed a basic model and put forward hypotheses. Combined with the specific situation of farmers’ participation in non-point source pollution control obtained from the social survey, a structural equation model has been further created to verify the hypotheses and conduct in-depth discussions. To ensure the reliability and validity of the data, this study conducted the Kaiser-Meyer- Olkin (KMO) test, Bartlett’s test of sphericity, and Cronbach’s α coefficient assessment on five latent variables and their corresponding fifteen observed variables. The results showed that the KMO values of the five latent variables were all greater than 0.5. The significance levels in Bartlett’s test of sphericity were all less than 0.001, and the standardized factor loadings of each indicator on the principal components were above 0.80, showing good data validity. In terms of reliability, Cronbach’s α coefficients were all greater than 0.7, suggesting good reliability of the data in this study (For specific measurement values, please refer to Table 2). The academic community believes that demographic variables usually act as control variables and impact behavioral intentions. Individual characteristics may indirectly affect behavioral attitudes, subjective norms, and perceived behavioral control or directly influence individual behavioral intentions and behaviors. By examining five individual characteristic indicators such as gender in the questionnaires, it is shown that individual characteristics have a significant impact on the behavior of farmers in Huaxian County participating in the control of non-point source pollution, so Hypothesis H1 is verified. As can be seen from the independent-samples t-test results in Table 3, the significance levels (Sig values) of gender and political affiliation for the five latent variables are all less than 0.05, revealing that gender and political affiliation have a significant impact on the latent variables of various dimensions such as behavioral attitudes and subjective norms. Usually, men are the backbone of agricultural production and have a deeper understanding of the agricultural production situation. Therefore, they show a stronger willingness to participate in non-point source control. At the same time, the CPC member group generally has a high ideological awareness and social responsibility, and all party members answered that they were willing to participate in agricultural non-point source pollution control. The results of the difference test for individual characteristics (age, education level, income) are shown in the table (Table 3). Individual characteristics have passed the test with a significance level of 0.05 in five aspects such as behavioral attitudes and subjective norms. Generally speaking, farmers aged 40–49, 50–59, and over 60 show a higher willingness to participate in the control of non-point source pollution, while those under 30, who are less involved in agricultural labor, have relatively insufficient awareness. On the other hand, those having a higher education level are more likely to engage in the control of non-point source pollution. In the survey, most of the respondents with a junior high school education or above said they were willing to participate in pollution control. In terms of income, farmers whose agricultural income accounts for 41–60% and 61–80% of the total household income have a higher willingness towards and behavior of pollution control. This may be because they have a relatively single income source, so the impact of non-point source pollution on their income is more prominent. In other words, the environmental benefits brought by their participation in the control will contribute to agricultural development and income increase. Therefore, the proportion of agricultural income in household income has a significant impact on non-point source pollution.",
    "The willingness of the agricultural production subjects to participate in the control of agricultural non-point source pollution is most significantly influenced by their behavioral attitudes, with a path coefficient of 0.42. The factor loadings of the four corresponding observed variables are 0.712, 0.755, 0.765, and 0.743, respectively, indicating that they (A1, A2, A3, A4) are key for explaining the latent variable of “behavioral attitude” [36]. Among them, the statement that farmers believe non-point source pollution control behaviors will be beneficial to food production (A3) has the strongest explanatory power, followed by the belief that it is beneficial to agricultural development (A2). This shows that be- ing beneficial to crop productivity and agricultural development are the main observed variables influencing farmers’ behavioral intentions and behavioral responses. Generally speaking, compared with other factors, farmers pay more attention to the expected crop yield—that is, the expected income. Therefore, the relationship between pollution con- trol and income largely determines whether farmers will participate. The third-ranked position of agricultural non-point source pollution’s environmental impact (A4) suggests a weaker demand for improved living conditions among local farmers in this regional context. The factor loading of “the importance of agricultural non-point source pollution (A1)” is the lowest. This is mainly due to the relatively backward agricultural development model, which makes it difficult to form an objective and comprehensive understanding of agricultural non-point source pollution. This indicates that the governance of non-point source pollution in Henan Province needs to be improved in these two aspects. This implies that the work of non-point source pollution control in Henan Province still needs to be improved in the two aspects. When promoting agricultural non-point source pollution control, the non-point source pollution control behavior, if based on ensuring or increasing farmers’ income, may attract farmers to participate actively and enable them to understand more comprehensively the ecological and economic benefits of such action. In the control of non-point source pollution, the subjective norm of farmers is a major factor influencing their behavioral willingness, with a path coefficient of 0.18. The factor loadings of the observed variables of relatives (B1), neighbors (B2), village committees (B3), and the government (B4) are 0.777, 0.872, 0.809, and 0.701, respectively. This reflects farmers’ judgment of the degree of influence of external factors on their behaviors and their perception of external pressure. Farmers are relatively more influenced by neighbors (B2) and village committees (B3). This shows that frequent interactions between neighbors and the continuous assistance from village committees to farmers will directly affect their production decisions and play an important role in their participation in non-point source pollution control. In the process of non-point source pollution control, the government should also pay attention to farmers’ feelings, broaden the channels of policy publicity, and allocate resources reasonably to promote the fundamental popularization of agricultural non-point source pollution control. The influence of perceived behavioral control on farmers’ willingness to pollution control is slightly stronger than that on their behavioral willingness, with a path coefficient of 0.2, thus making a major factor influencing their behavioral willingness. Its loading coefficients with the corresponding five observed variables are 0.795, 0.765, 0.798, 0.796, and 0.778, respectively, proving that the five observed variables are key explanatory factors for the latent variable. The factor loadings of “policy understanding degree (C1)”, “difficulty in obtaining technology (C3)”, and “ability (C4)” are relatively large, all demonstrating relatively prominent explanatory power. For agricultural production subjects, agricultural incentive policies [37], the release of new agricultural machinery [38], and guidance from agricultural experts [39], etc., will make them consider the value of pollution and yield in production activities compared with previous behaviors, thus affecting their willingness to carry out pollution control. Based on the fact that the influence of the perceived control behavior is slightly greater than that of the subjective norm, the decision-making of farmers in the Henan region regarding pollution control is no longer “following blindly “ as in the old farming era. Instead, it is more based on the judgment of the expected target behavior based on internal factors (ability, technology) and external factors (policy, funds). It is a rational trade-off according to various conditions to establish a scientific understanding of control behaviors and accordingly guide their agricultural production behaviors.",
    "Farmers’ willingness to control agricultural non-point source pollution can signifi- cantly influence their control behavior, with a path coefficient of 0.51, indicating that their behavioral willingness plays a significant mediating role in control behaviors. Its standard- ized factor path coefficients are between 0.854 and 0.937, having met the requirements. However, farmers are selective in fertilization. Compared with applying organic fertilizers, they are more willing to reduce the use of chemical fertilizers and pesticides as a means of pollution control, possibly for the consideration of economic value (Figure 2, Table 4). The revised model was subjected to fitting calculations using Amos 27.0 software. The results indicate that there are significant positive relationships between behavioral attitudes, subjective norms, perceived behavioral control, and governance willingness, as well as between governance willingness and governance behavior variables. The p-values of all model paths are less than 0.05, supporting hypotheses H2, H3, H4, and H5 (Table 5). Mediation effect analysis confirmed statistically significant mediation across all three pathways, with coefficients falling between the lower and upper bounds of the confidence intervals. Crucially, both interval bounds exceeded zero, demonstrating significant me- diation effects for all paths. Consequently, hypotheses H6, H7, and H8 were empirically supported. Governance willingness plays a mediating role in the influence of behavioral attitudes, subjective norms, and perceived behavioral control on behaviors, suggesting that enhancing governance willingness has a positive impact on governance behaviors (Table 6). According to the criteria proposed [36], it can be seen from Table 7 that all evaluation indicators can meet the recommended values for model goodness-of-fit. Therefore, the model constructed in this paper shows good goodness-of-fit and hence is suitable for analyzing the influencing factors of farmers’ behaviors in agricultural non-point source pollution control. From the perspective of agricultural producers, this paper has discussed the producers’ willingness to participate in non-point source pollution control. Different from previous studies that analyzed the current situation and control of agricultural non-point source pollution based on geographical information and theoretical data, this paper has conducted an analysis of influencing factors based on the Theory of Planned Behavior (TPB) and focused on analyzing the influencing willingness. Its behavioral response path is more consistent with the case in the real world. Based on TPB, it is found that all three latent variables have a significant positive impact on farmers’ willingness to participate in agricultural non-point source pollution control. This aligns with previous academic studies [40,41]. In this study, the three la- tent variables influencing non-point source pollution governance intentions followed this hierarchy: BA > PBC > SN. This contrasts starkly with Zhejiang Province’s pattern (PBC > BA > SN), where perceived behavioral control emerged as the most influential pre- dictor of behavioral intention. This paper argues that such differences may be attributed to more-developed economy. The data indicate that Zhejiang Province generates half of Henan’s agricultural output value using merely a quarter of its cultivated land area. Consequently, Zhejiang demonstrates relatively more advanced agricultural modernization levels and higher farmer cognitive capacities compared to Henan (data source: Commu- niqué on National Economic and Social Development of China). However, the influence of behavioral attitudes on farmers’ participation in Zhejiang Province is relatively weaker. Therefore, the focus of influencing governance behaviors has shifted to perceived behavioral control—that is, from only considering agricultural income expectations to the cognition of environmental pollution and policies, as well as the trade-off between costs and benefits. The agricultural total nitrogen (TN) and total phosphorus (TP) in Henan Province grew faster than those in Zhejiang Province from 2016 to 2022 (from China’s Annual Report on Ecological and Environmental Statistics). This paper believes that a stronger influence of perceived behavioral control represents a sounder agricultural non-point source pollution control system in the region. And Henan Province’s successive introduction of diverse policy instruments and subsidies targeting agricultural non-point source pollution has progressively strengthened the impact of perceived behavioral control (PBC) among local farmers [26]. In addition, a comparison between the mountainous and hilly areas (Three Gorges Ecological Barrier Zone) and the central plain areas where Henan Province is located reveals differences in the latent variables of willingness to control agricultural non-point source pollution. In the mountainous and hilly areas, the latent variables are ordered as “SN > PBC > BA”. The Three Gorges Ecological Barrier Area has scattered and widespread agricultural non-point sources, with complex sources and pathways, and encompasses rural, mountainous, and immigrant areas, making it difficult for pollution prevention and control [42], so it is believed that a greater influence of subjective norms indicates a less On the other hand, this paper has certain limitations. First, due to the small sample size and the fact that the research objects are agricultural-intensive areas, the influence of other external variables on latent variables may have limitations. Secondly, with the development of agricultural modernization and the promotion of green agriculture, the connotation and extension of the latent variables here will also evolve and update accordingly. For example, the emergence and introduction of new production models have an impact on perceived behavioral control. Therefore, follow-up research can expand the study area to further explore the internal meanings and external impacts of these variables, optimize scale indicators and data openness, improve the research system, and conduct further discussions on farmers’ governance behaviors based on the Theory of Planned Behavior.",
    "Based on the Theory of Planned Behavior and taking typical counties in Henan Province as examples, this paper focuses on analyzing the characteristics of farmers’ willing- ness to participate in non-point source pollution control in Henan Province. The AMOS 27.0 software is used to construct and validate the model, concluding that all eight hypotheses proposed are supported. The following conclusions have been drawn: To promote farmers’ participation in agricultural non-point source pollution con- trol, improve the ecological environment, and facilitate the sustainable development of agriculture, the following suggestions are put forward: Author Contributions: Methodology, X.Z. and Y.W.; Writing—Original Draft Preparation, X.Z.; Writing—Review and Editing, Y.W. and L.L.; Supervision, Y.W. and L.L.; Resources and Funding acquisition, C.S. and L.L.; Software, S.Y. and W.W.; Investigation, J.L. and X.Z.; Data Processing, X.Z. and S.Y. All authors have read and agreed to the published version of the manuscript. Funding: This research was funded by Henan Province Science and Technology Research and Devel- opment Program Joint Fund, Grant Number 225200810045, National Key Research and Development Program Henan Province—Ministry Joint Project, Grant Number 2021YFD1700900, Henan Province Science and Technology Research Project, Grant Number 242102320138, Scientific and Technological Innovation Fund Project of Henan Agricultural University, Grant Number KJCX2020C05, Scien- tific Research Startup Fund Project for High-level Talents of Zhengzhou University of Technology, Grant Number zzgk202111, The Henan Province Soft Science Research Program, Grant Number 252400411285, Natural Science Foundation of Henan Province, Grant Number 252300420285. Data Availability Statement: The original data source has been indicated in the article, and further research results can be obtained by consulting with the corresponding author."
]