[
    "The resilience of the tourism economy plays a pivotal role in sustaining regional economic stability across the nine provinces along the Yellow River. This study examines the spatio- temporal evolution and configurational pathways of tourism economic resilience across the nine provinces along the Yellow River during 2012–2022 by applying the Standard Deviation Ellipse and Fuzzy Set Qualitative Comparative Analysis. The results showed that: (1) From 2012 to 2019, the tourism economic resilience exhibited a steady upward tendency overall, with a slight fluctuation in the short term in 2020. (2) High and relatively high-level regions experienced a belt-like high-value zone, eventually extending to Sichuan Province, Henan Province, and Shandong Province. (3) The standard deviation ellipse exhibited a distribution pattern along the northeast-southwest axis, with its center of gravity situated in the middle reaches of the Yellow River, having shifted a total of 146.81 km. (4) Four driving pathways were identified: resistance-dominated, recovery-dominated with restructuring synergy, renewal-driven, and multi-resilience synergy-driven. Three barriers also appeared: renewal-constrained, restructuring-lagged, and overall resilience-deficient. Keywords: tourism economic resilience; spatiotemporal pattern; standard deviation ellipse; fuzzy set qualitative comparative analysis; nine provinces along the Yellow River Citation: Li, T.; Zhao, Q. Spatio-Temporal Patterns and Configuration Pathways of Tourism Economic Resilience in Nine Provinces Along the Yellow River. Sustainability 2025, 17, 9111. https://doi.org/ 10.3390/su17209111 Copyright: © 2025 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https://creativecommons.org/ licenses/by/4.0/). Ecological protection and high-quality development in the Yellow River Basin (YRB) constitute a major strategic initiative for China’s coordinated regional development, hold- ing profound significance for balancing environmental protection with socio-economic progress. This study focuses on nine provinces in the YRB, which are not only core areas for the basin’s ecological protection and economic development, but also regions with the richest tourism resources and the most urgent need for resilience construction, making them typical for research. The Outline of the Plan for Ecological Protection and High-Quality Development of the YRB, issued by the State Council in 2021, serves as a crucial guideline for its implementation, reflecting the central government’s high priority on governance. Against this backdrop, the tourism industry emerges as a pivotal link integrating the basin’s ecological value, cultural resources, and economic vitality. Its high-quality development is not merely a supporting element, but a core driver of the YRB’s overarching strategic goals [1,2]. The YRB’s unique tourism endowments further anchor this significance. Qing- hai and Sichuan are noted for alpine lakes, Gansu and Ningxia for Silk Road relics set in desert landscapes, Inner Mongolia and Shanxi for steppe environments and medieval Buddhist art, Shaanxi and Henan for dense clusters of world-class historical monuments, and Shandong for coastal landforms. Together, these resources form an integrated tourism corridor that holds immense potential to fuel the YRB’s sustainable development. However, the tourism industry faces dual tasks in advancing high-quality develop- ment. The tourism industry must not only adapt to and meet the increasingly diverse travel demands of the public in the new era, but also address structural challenges such as inade- quate resource integration, product homogenization, superficial industrial convergence, and underdeveloped public services [3,4]. For the YRB in particular, multiple risks— including climatic disasters, public health crises, and market volatility—pose significant threats to tourism. Consequently, the sector’s capacity for rapid recovery, reconstruction, and even upgrading following such shocks has become a focal point for both theoretical research and policy practice. This study aims to: (a) elucidate the spatio-temporal evolution of tourism economic resilience (TER) across the nine provinces in the YRB from 2012 to 2022—specifically, to examine the direction of the shifting center of gravity in resilience and how resilience levels vary across provinces over time; and (b) identify the configurational pathways that lead to high or non-high resilience, clarifying which of the four sub-dimensions (resistance, recovery, restructuring, and renewal) serve as essential conditions, how they interact configurationally, and whether multiple pathways can equivalently lead to high or non- high resilience. To achieve these objectives, a systematic indicator framework for TER was first constructed, and the entropy method was applied to compute indicators using multi-source data. Second, a strip heatmap is used to analyze the characteristics of the comprehensive value and the four sub-dimensions of TER during the sample period. By setting a cutoff value, the evolution process of TER is visually presented, and the trend of its center of gravity is analyzed using SDE. Finally, we use fsQCA to investigate how resistance, recovery, restructuring, and renewal configure to shape TER. We anticipate that our findings will provide ex-ante guidance for risk prevention in the study area and help mitigate welfare losses that exogenous shocks inflict on the tourism sector.",
    "Resilience denotes the speed with which a system returns to its original state after disturbances; Holling first introduced the concept into ecology, distinguishing between ecological and engineering resilience [5]. Subsequent research on social-ecological systems has further introduced adaptability and transformability into the theoretical domain of resilience [6,7]. Previous studies indicate that differences in resilience levels lead to diver- gent regional responses to identical external risks, and effective resilience management can mitigate the impacts of such risks [8]. The tourism economy is inherently fragile, comprising numerous and complex economic elements that require the synergy of multiple industries [9]. Against this backdrop, Cochrane contends that because tourism is a complex adaptive system, it lends itself to the integrated, interdisciplinary and non-linear lens of resilience; this, in turn, reveals the underlying forces that shape Butler’s Tourism Area Life Cycle [10,11]. TER refers to the ability of the tourism economic system to flexibly adjust its strategies when confronted with sudden shocks, restore its pre-shock state, and achieve restructuring and upgrading [12,13]. Previous research on TER has proceeded along two primary lines. Qualitative studies have traced the origins of resilience issues—for example, by focusing on the resilience of hotel family enterprises during the COVID-19 pandemic [14], whereas quantitative studies have examined the direct or net effects of single factors such as tourism specialization, industrial agglomeration, and the digital economy on resilience [15,16]. Collectively, these contributions have concentrated on measurement methods, spatio-temporal trajectories, and determinant identification, thereby furnishing a solid analytical foundation for the present and future research. Nevertheless, three critical gaps still await resolution. First, although extant studies have employed natural breaks and spatial Markov chains to delineate agglomeration characteristics, regional disparities, and spatial dependence, they have offered only limited insight into the dynamic evolution of spatial distribution and the inter-regional transition regularities of TER. To bridge this gap, this study introduces the standard deviational ellipse (SDE) to systematically examine the centroid migration and spatial displacement of resilience. Second, in the investigation of revealing the factors influencing the resilience of the tourism economy, previous research has mainly relied on traditional methods such as geographic detector models [17]. Although these studies can effectively identify the key drivers of the resilience of the tourism economy, they ignore the complex interactions that may exist between the antecedent variables and the resilience of the tourism econ- omy [18,19]. Fuzzy-set Qualitative Comparative Analysis (fsQCA) is employed to unpack how multiple conditions jointly shape TER. Grounded in Ragin’s foundational principles of causal complexity and set-theoretic logic, the method constructs truth tables and conducts Boolean operations to identify configurational effects [20]. These effects are inherently nonlinear and cannot be reduced to a simple sum of individual factors, because they arise from the interplay among conditions rather than from any single causal force. By moving beyond linear assumptions, fsQCA offers deeper insight into the complex mechanisms through which independent variables influence the dependent variable [21]. Third, existing scholarship has primarily focused on inbound tourism or the Yangtze River Economic Belt as the unit of analysis [22,23]. In contrast, this study concentrates on the nine provinces along the Yellow River, which constitute a pivotal axis of national economic development and epitomize the tension between rapid growth and heightened vulnerability to natural disasters and public-health shocks. Moreover, current research mostly centers on the impacts of single factors, such as the digital economy and economic crises, on the TER in the YRB, while paying insufficient attention to the configurational logic of the interactions among multiple factors [24,25]. The YRB stretches about 5464 km through nine provinces—Qinghai, Sichuan, Gansu, Ningxia, Inner Mongolia, Shanxi, Shaanxi, Henan, and Shandong. The watershed spans four major landform units and three major terrain terraces, and this unique geographical feature has profoundly shaped the fragility of its ecological environment and the uneven distribution of its tourism resources. These unique geographical features have profoundly shaped the region’s fragile ecological environment and the uneven distribution of its tourism resources [26,27]. As of June 2024, the majority of A-level tourist attractions along the YRB are concentrated in the lower reaches of the river, specifically in Shandong Province and Henan Province. These attractions are rated by China’s Ministry of Culture and Tourism based on standards such as resource quality and service facilities, with levels ranging from 1 A to 5 A. These regions account for 1228 and 724 A-level attractions, respectively, totaling 38.1% of the total number of A-level attractions, making them the core tourism hub of the lower reaches of the river. Next is the upper reaches of the YRB, which include Sichuan Province, Ningxia, Qinghai Province, and Gansu Province, accounting for 34.2% of the total A-level attractions in the nine provinces. Finally, the middle reaches of the YRB, which includes Shaanxi Province, Shanxi Province, and Inner Mongolia, account for 27.6% of the total A-level attractions in the nine provinces. Sichuan Province, Henan Province, and Shandong Province host 51.1% of the nine provinces’ total 5 A-level tourist attractions.",
    "As China’s ecological security barrier and an important cradle of Chinese civiliza- tion, the YRB is rich in historical and cultural heritage, such as the Banpo Culture and Laoguantai Culture, as well as natural landscape resources like the Hukou Waterfall and Qiankun Bay. However, the tourism economy of the YRB is highly sensitive and vulnerable to sudden adverse events such as natural disasters and public health incidents [28]. These external shocks not only directly disrupt tourism operations but also indirectly exacer- bate inefficiencies in tourism resource integration and weaken the recovery capacity of the industry chain [29,30]. Studying the spatio-temporal patterns and configuration path- ways of TER along the Yellow River in nine provinces can help enhance overall resilience and risk-bearing capacity. This research provides theoretical support for implementing cross-regional tourism resource integration strategies and establishing tourism disaster emergency response mechanisms [31]. The entropy-weighted method is a well-established objective weighting approach for evaluating composite levels [32]. The core advantage lies in its ability to reflect the utility value of information entropy and reduce the interference of subjective bias factors. This study applies the entropy method in Stata 17 to calculate the four dimensions of TER (resistance, recovery, restructuring and renewal) and the overall score. The calculation steps were as follows: constructing the original matrix, standardizing each indicator, calculating the entropy weights of each indicator, and finally linearly aggregating them to obtain the comprehensive evaluation index. The SDE model is a spatial–statistical technique that captures the core characteristics of spatial distribution and centroid migration trajectories via metrics such as centroid coordinates, azimuth, and ellipse area [33]. Using ArcGIS (https://www.arcgis.com/), the study employs the centroid coordinates (X, Y) to denote the arithmetic mean center of TER. The direction of centroid movement reflects the dynamic trend and spatial process of data distribution. The azimuth θ specifies the orientation of the ellipse’s major axis, thereby indicating the developmental direction of resilience distribution. The major semi- axis represents the principal direction of centroid dispersion, whereas the minor semi-axis denotes the minimal extension perpendicular to the major axis. Variations in the semi-axes are used to measure the dispersion and agglomeration of resilience distribution [34]. The computational formulas are provided below: where n is the number of provincial units; (X, Y) denotes the weighted mean centroid coor- dinates; wi represents the weight of province i; δx and δy refer to the standard deviations along the X- and Y-axes, in turn; and θ denotes the azimuth of the SDE. fsQCA is a Boolean algebra-based approach designed to identify configurational combinations of conditions sufficient for a given outcome [35]. fsQCA is a Boolean algebra- based approach designed to identify configurational combinations of conditions sufficient for a given outcome [36]. Two key concepts govern fsQCA: consistency and coverage, both ranging from 0 to 1. Consistency indicates the extent to which resistance, recovery, restruc- turing, and renewal lead to high TER [37]. A consistency threshold exceeding 0.9 signifies that the antecedent condition is a necessary condition for the outcome, calculated as: This study analyzes how resistance, recovery, restructuring, and renewal generate TER through specific configuration pathways, constituting a causal relationship exploration study specific to this region [38]. Additionally, since all variables are continuous data, they cannot be directly simplified into binary variables. Therefore, using fsQCA as the research method can more accurately capture and analyze the complex relationships between these antecedent conditions and their impact on TER. to capture its full profile. This study therefore adopts a composite-indicator approach to gauge the overall level of resilience. Indicators that have been frequently employed in the extant literature on TER were selected, and their appropriateness was subsequently validated through consultation with two domain experts. Guided by the principles of comprehensiveness, accuracy, and data availability, an indicator system is constructed across four dimensions: resistance, recovery, restructuring, and renewal [8,16–18,37,39]. Resistance refers to the defensive and adaptive capacity of the tourism sector to maintain its structure and functions when confronted with shocks such as natural disasters or pan- demics. Serving as the first line of defense of TER, it embodies the sector’s self-protection and buffering mechanisms and hinges upon factors such as tourism resources and the local economic base [40]. Recovery draws its theoretical foundations from ecological restoration theory and emphasizes the capacity to swiftly revert to the pre-shock condition—or to a higher level—after disruption [22]. As a critical safeguard of TER, recovery reflects the sec- tor’s rapid rebound and adaptability, contingent upon pollution-control capacity, ecological quality, and tourism infrastructure. Restructuring introduces a system-reconfiguration and transformation–upgrading perspective, denoting the extent to which the tourism industry can reallocate resources and adjust operational models to adapt to a new environment after major shocks [37,41]. Restructuring encapsulates the strategic reorientation capacity of the tourism economy after disruption and is conditioned by factors such as the size of the tourism workforce and investment in fixed tourism assets [42]. Renewal signifies the preservation of vitality and competitiveness through innovation and technological advancement, integrating insights from innovation theory, technological-progress theory, and competition theory into tourism development [5,43]. Renewal is influenced by the availability of tourism talent and the level of technological sophistication [18]. Tourism colleges constitute an intellectual infrastructure sustaining sectoral innovation, whereas patent grants determine the efficiency of knowledge commercialization; together they accelerate the industry’s alignment with evolving market demands and emergent risks, thereby enhancing adaptive capacity.",
    "All indicators are positive indicators. This study calculates the ratio of total tourism revenue to GDP based on the sum of fixed—asset investment across provinces to reflect tourism fixed—asset investment [13,14]. Other indicators can be obtained from the China Statistical Yearbook, the China Tourism Statistical Yearbook, the China Investment Statis- tical Yearbook, and the China Tertiary Industry Statistical Yearbook. Missing data were supplemented using linear interpolation. All indicators are positively oriented; the detailed indicator system is presented in Table 1. This study uses Origin 2024 software’s strip heat map to profile the overall trend of TER along the Yellow River in nine provinces from 2012 to 2022, as shown in Figure 1. The comprehensive resilience index values for the tourism economy of the nine provinces along the Yellow River all fall within the range of 0 to 0.6. In terms of trend development, although the COVID-19 pandemic in 2020 caused minor fluctuations in the short term, the overall trend has been one of steady growth, with the index exceeding 0.24 since 2016. Dimensionally, renewal and restructuring remain comparatively weak, with values consistently below 0.24, underscoring substantial latent potential for enhancing resilience. Conversely, recovery demonstrates a monotonic increase, maintaining values above 0.48 after 2019. Resistance follows a sustained upward trajectory from 2012 onward; however, its growth plateaus after 2019, constrained by market saturation and resource limitations. Overall, this study found that the overall magnitude distribution characteristics and dy- namic evolutionary tendencies of TER in the provinces covered by the YRB are highly similar to the development patterns of China’s tourism economy when compared with existing research [5]. This study uses the breakpoint classification method to divide the resilience levels calculated by the entropy method, setting the breakpoints at 0.122, 0.244, 0.366, 0.488, and 0.656, and conducts a visual exploration and analysis of spatial evolution patterns based on this. Figure 2a–d illustrate the spatial distribution of TER at four time nodes: 2011, 2014, 2018, and 2021. The loci of high and higher-level resilience shifted from a single-core configuration centred on Shandong in 2012 to a multi-core pattern encompassing Sichuan, Henan, and Shandong by 2018. These provinces constitute a contiguous high-value corridor that gradually assumes a planar linkage. Sichuan upgraded its resilience by optimising the tourism industrial structure, prioritising eco-tourism, and launching the “Famous Counties for Tianfu Tourism” initiative to deepen the exploitation of local characteristics. Henan, leveraging its abundant historical and cultural resources, implemented a “Culture + Tourism” strategy and actively participated in regional co-operation within the Central Plains Economic Zone, thereby fostering tourism synergy. Through these targeted measures, both provinces consolidated their positions as high-resilience clusters. Qinghai’s resilience, initially constrained in 2012 by deficient infrastructure and limited economic development, improved by 2021 in response to surging domestic tourism demand. Ningxia experienced a monotonic ascent from low resilience in 2012 to moderately low in 2018, followed by a reversion to low levels by 2021. Overall, this evolutionary trajectory is attributable to the compounded effects of provincial economic development, endowment of tourism resources, and post-shock recovery capacity. Subsequently, the evolution of the centroid of TER among the nine provinces along the Yellow River was examined by means of the SDE model. The detailed estimates are reported in Tables 2 and 3. Figure 3 reveals that throughout the observation period, the centroid remained situated in the middle reaches of the YRB, underscoring the pivotal role of this sub-region within the broader basin-scale tourism economy. Specifically, the centroid migrated from Linfen City, Shanxi Province (36◦3′28′′ N, 111◦1′10′′ E) in 2012 to Yan’an City (36◦5′46′′ N, 109◦43′22′′ E) in 2021, tracing a path that first shifted 40.97 km northwest, then 24.83 km southwest, and finally 81.01 km northwest, yielding a cumulative displacement of 146.81 km. The migration pattern is characterized by an initial acceleration, a subsequent deceleration, and a renewed acceleration after 2018, indicating pronounced intra-regional variability in TER. The persistent westward drift of the centroid can be attributed to two interrelated dynamics. First, national policies—most notably the Western Development Strategy and the concomitant expansion of infrastructure investment—have created enabling conditions for high-quality tourism development in the central and west- ern provinces. Second, targeted provincial initiatives have amplified these macro-level stimuli; for instance, Gansu Province has optimized its spatial tourism layout, fostered the Silk Road tourism belt, and implemented subsidy programmes such as “Attracting Tourists to Gansu,” thereby substantially enhancing its competitive positioning. The fact that the SDE centroid remained anchored within Shanxi and Shaanxi throughout the sample period highlights the intensifying agglomeration effects of these two provinces. This spatial inertia signifies their emergence as critical growth engines within the tourism economy of the nine-province Yellow River corridor.",
    "Furthermore, the eigenvalues of the SDE model reveal a non-monotonic trajectory of the minor semi-axis, expanding from 633.27 km in 2012 to 662.39 km in 2018 before contract- ing to 655.34 km in 2021. By contrast, the major semi-axis exhibits a continuous elongation, rising from 1049.01 km in 2012 to 1108.70 km in 2021. This elongation is particularly pro- nounced in the upper reaches of YRB, signifying a conspicuous east–west extension. The phenomenon indicates that, despite complex topography and initially fragmented tourism resources, the upper basin has experienced a progressive enhancement of TER, driven by sustained improvements in tourism infrastructure and intensified resource exploitation. Qinghai Province, for instance, capitalises on its abundant natural landscapes and profound ethnic-cultural heritage to establish multiple eco-tourism corridors, effectively integrat- ing and connecting regional resources, while simultaneously upgrading transportation networks and optimising accommodation facilities. Moreover, the SDE area exhibits contin- uous expansion, peaking at 2.2824 × 106 km2 in 2021. Overall, the spatial configuration of TER along the nine-province Yellow River corridor demonstrates pronounced directional characteristics, with a pronounced agglomeration effect along the northeast–southwest axis. Relative to the northeastern sector, the southwestern sector increasingly functions as a pivotal source of growth. This study adopts TER as the outcome variable and its four dimensions—resistance, recovery, restructuring, and renewal—as antecedent conditions. The fsQCA method is employed to assess both necessity and sufficiency of TER in 2012, 2015, 2018, and 2021. Data calibration precedes the analysis. The 95th, 50th, and 5th percentiles of each variable are set as the thresholds for full membership, crossover, and full non-membership, respec- tively [44]. On this basis, the necessity of individual antecedents for high and not-high TER is examined (Table 4). Results indicate that in 2012 and 2015, none of the antecedents achieved the 0.9 consistency threshold, implying that no single factor constitutes a necessary condition for either high or not-high resilience. In 2018, resistance attained a consistency score of 0.95 (>0.9), establishing it as a necessary condition for high TER. This underscores the pivotal role of resistance in fostering innovation in tourism products and elevating service quality. By 2021, the absence of renewal (i.e., not-renewal) registers a consistency of 0.92 (>0.9), revealing it to be a necessary condition for not-high TER. This finding high- lights that the lack of renewal constrains the sector’s capacity to adapt swiftly to market dynamics. To test sufficiency, truth-tables was constructed with a frequency threshold of 1 and an initial consistency threshold of 0.7. The truth tables for the 2012 tourism economy under high-resilience and non-high-resilience condition combinations are presented in Tables A1 and A2 of the Appendix A. Truth tables for other years may be obtained from the authors to support research reproducibility. The intermediate solution was taken as the standard, and any condition present in both the parsimonious and intermediate solutions was designated as a core condition, while others were treated as auxiliary. To ensure robustness, the original calibration anchors were reset to the 90th, 50th, and 10th percentiles, and the consistency threshold was raised to 0.75 [32]. Re-estimation produced no substantive change in the core conditions, confirming the reliability of the results. Nine configurational pathways that generate high TER are reported in Table 5. Both individual and overall solution consistencies exceed 0.8, attesting to the reliability of the findings. These pathways are hereafter termed “driving paths,” which can be synthesised into four archetypes. The “Resistance-dominated” path refers to addressing external shocks and internal pressures faced by the tourism economy by enhancing resilience. This model includes Pathways Config. 1, Config. 2, and Config. 6, all of which rely on strong resilience as a core condition. A typical example of Config. 1 is Henan Province in 2012. The provincial government launched and implemented a series of measures, including the “Cultural Henan” tourism brand enhancement project and the optimization of tourism infrastructure, significantly increasing tourists’ interest and participation in tourism, fully demonstrating the positive role of the resistance-dominated path. Config. 6 is exemplified by Shaanxi Province in 2018, which proposed and implemented policies such as upgrading the cultural and tourism welfare electronic card and expanding cultural and tourism consumption credit services. These measures enhanced tourists’ willingness and ability to consume, thereby mitigating the negative impacts of market fluctuations to some extent, demonstrating the effectiveness of resistance-dominated pathways in maintaining the stability of the tourism economy.",
    "The “Recovery-dominated with Restructuring Synergy” path refers to the tourism economy facing risks and challenges, with resilience as the core driving force and recon- struction playing a synergistic role, jointly promoting the rapid recovery and resilience enhancement of the tourism economy. This model includes Config. 5 and Config. 9, both of which take resilience as the core condition and reconstruction as the auxiliary condi- tion. A typical example of Config. 5 is Henan Province in 2015. Despite suffering from natural disasters in 2015, the province’s tourism industry quickly regained vitality thanks to efficient disaster response and recovery strategies. Affected areas swiftly advanced scenic area repairs to ensure safe and comfortable tourist experiences. Additionally, Henan Province increased investment in tourism infrastructure to further improve tourism service quality, thereby strengthening the reconstruction capacity of its tourism economy. A typical example of Config. 9 is Ningxia Province in 2021. Facing pandemic risks, the province swiftly adjusted its tourism strategies, implementing measures such as “limited capacity, reservations, and peak-spreading” to effectively stabilize the tourism market order, ensure the continuous operation of the tourism industry chain, and achieve the comprehensive recovery and enhanced resilience of its tourism economy. The “Renewal-Driven” path refers to a strategy that relies on strong renewal capacity, which enhances adaptability and resilience through continuous innovation, transformation, and upgrading. The paths included in this category are Config. 3 and Config. 7, both of which regard renewal capacity as a core condition. Config. 3 indicates that even in the absence of resistance and restructuring capabilities, high renewal capacity alone can achieve high resilience in the tourism economy. This path is commonly found in regions that prioritize tourism product innovation but have relatively stable industrial structures. A typical example is Shandong Province in 2012, which leveraged the “Hospitality Shandong” brand to deeply explore and promote local characteristics, effectively enhancing the tourism economy’s renewal capacity. In 2021, Henan Province, leveraging its rich cultural heritage, continuously innovated tourism products and services, launching the “night tourism economy” project to enhance the tourism economy’s adaptability and vitality. Config. 7 emphasizes the synergistic effect of high renewal capacity as the core, coupled with high restructuring capacity. A typical example of Config. 7 is Inner Mongolia Autonomous Region in 2018 which actively implemented diversified innovations in tourism products, such as in-depth grassland cultural tours and self-driving tours, to enrich the tourism market supply. Simultaneously, it leveraged the upgrading of tourism infrastructure and the establishment of smart tourism platforms to stabilize the tourism industry chain, thereby ensuring high-quality and efficient tourism services. The “Multi-Resilience Synergy-Driven” path denotes the promotion of steady growth in the tourism economy through the synergistic effect of resistance, rapid recovery, flexible restructuring, and continuous renewal capabilities. The core pathways of this model include Config. 4 and Config. 8. Config. 4 takes resistance, restructuring, and renewal as auxiliary conditions. A typical example is Sichuan Province in 2015, which swiftly activated emergency response measures in the face of natural disasters, such as conducting safety assessments and repairs after the Jiuzhaigou earthquake. Simultaneously, it optimized traditional tourism projects, initiated the development of rural tourism, and advanced smart tourism (e.g., the launch of the “Sichuan Tourism” app), demonstrating the application of renewal capabilities and facilitating the high-resilience development of Sichuan’s tourism economy. Config. 8 regards recovery as the key driving force, with resistance, restructuring, and renewal serving as the supporting system. A typical case of this pathway is Shanxi Province in 2021, which deeply explored the cultural connotations of “Yellow River Culture” and “Taihang Spirit.” Through policies such as issuing government consumption vouchers and extending the reimbursement period for provincial subsidy funds, strong guarantees have been provided for the recovery and resilient growth of the tourism economy. This achieved a virtuous cycle from recovery to restructuring, and then to continuous renewal, comprehensively enhancing the overall resilience. As reported in Table 6, nine limiting configurations—hereafter “constraint pathways”— are identified for the nine-province Yellow River corridor. Both individual- and overall- solution consistencies exceed 0.80, attesting to the robustness of the results. These pathways can be synthesised into three archetypes. First, the “Renewal-Constrained” path (Config. 10, Config. 11, Config. 17, Config. 18) refers to tourism economies that face bottlenecks in resilience development due to a lack of renewal capacity. This makes it difficult to introduce new technologies, products, and service models, results in slow recovery from shocks, and constrains long-term resilience development. A typical case of Config. 17 is Inner Mongolia Autonomous Region in 2021, where fluctuations in income levels and an incomplete social security system exacerbated the outflow of tourism talent, leading to a shortage of professional personnel. Additionally, the lag in technological development significantly hindered the construction of a smart tourism system, resulting in insufficient intelligence and convenience in tourism services, a decline in visitor experience quality, and ultimately an adverse effect on the overall resilience. These issues highlight the shortcomings of Inner Mongolia’s tourism indus- try in human resource allocation and technological innovation application, necessitating improvements through policy guidance and resource investment.",
    "Secondly, the “Restructuring-Lagged” path (Config. 12, Config. 13, Config. 15) refers to the tourism economy’s lack of flexible strategies in response to environmental changes. When faced with market fluctuations, shifts in consumer preferences, and the impact of new technologies, the system reacts slowly, leading to reduced competitiveness and an inability to adapt to future trends, thereby limiting the enhancement of TER. A typical case of Config. 12 is Shanxi Province in 2012, where the restructuring capacity for TER was constrained by a shortage of tourism practitioners—resulting in declining service quality—and limited investment, which hindered the effective development of tourism resources. Finally, the “Overall Resilience-Deficient” path (Config. 14, Config. 16) refers to a comprehensive lack of all four key capabilities (resistance, recovery, restructuring, and renewal), resulting in a fragile system. Such systems require strengthening in multiple areas, including infrastructure, innovation capacity, and industrial structure, to comprehensively enhance TER. A typical case of Config. 14 can be referenced from Gansu Province in 2015, where the relative lag in infrastructure and the singularity of the industry structure constituted the primary constraints on the diversified development of Gansu. In the face of fluctuations in the market environment and adjustments in policy orientation, these This study focuses on two core objectives: firstly, examining the spatio-temporal evolu- tion characteristics of TER across nine provinces along the Yellow River from 2012 to 2022; secondly, identifying the configurational pathways that drive or constrain TER. Through systematic analysis employing SDE and fsQCA, both objectives have been fully achieved. The main findings, organized around the core research objectives, are summarized as follows. First, from 2012 to 2019, the TER showed an overall trend of steady growth, with a slight short-term fluctuation in 2020 due to the pandemic. Regions with high and relatively high levels of TER underwent an evolution: from being mainly concentrated in Shandong Province in 2012, they expanded to Sichuan, Henan, and Shandong by 2018, forming a chain-like high-value agglomeration area. These regions demonstrated significant planar synergistic enhancement effects. The values for both the renewal and restructuring dimen- sions were generally below 0.24, indicating that these two aspects still hold substantial development potential and room for improvement in boosting the enhancement of TER. Second, regarding the spatial distribution patterns of TER, the following findings have been identified. During the sample period, the SDE of TER exhibited a distribution pattern along the northeast-southwest axis. The TER center has long been located in Shanxi and Shaanxi provinces in the middle reaches of the Yellow River, demonstrating their key supporting role in boosting regional tourism-economic resilience. The SDE followed a path starting from Linfen City and ultimately returning to and stabilizing in Yan’an City, covering a total distance of 146.81 km. This migration pattern exhibited an initial acceleration followed by a slowdown, with a subsequent acceleration in 2018, reflecting the phased characteristics of internal variability within TER. Relying on the continuous advancement of tourism infrastructure and resource development in recent years, the upper reaches of the Yellow River have seen a relatively rapid lengthening of the resilience major axis, showing significant east–west expansion. Finally, in terms of the configurational pathways influencing TER: resistance served as a necessary condition for high TER in 2018. In 2021, non-renewal emerged as a necessary condition for non-high TER. The configuration paths influencing the high and non-high TER exhibit “causal asymmetry” and the “equifinality effect.” Four driving pathways were identified: resistance-dominated, recovery-dominated with restructuring synergy, renewal-driven, and multi-resilience synergy-driven. Three constraint pathways were also delineated: renewal-constrained, restructuring-lagged, and overall resilience-deficient. The nine provinces should implement a combination of strategies to enhance the resilience of their tourism economies based on their specific conditions. First, consolidating and extending the advantages of the contiguous high-value cor- ridor. Provinces within the corridor should formulate and implement targeted policies and institutional arrangements to sustain their current lead in TER. Sichuan Province is advised to upgrade disaster-mitigation facilities in areas prone to earthquakes and land- slides, while leveraging Giant-Panda culture and the Ancient Shu civilization to strengthen its tourism branding. Henan Province can capitalise on its historical and cultural assets to deepen the integration of culture and tourism, thereby enhancing endogenous drivers. Shandong Province should capitalise on its coastal resources to develop marine tourism Second, pooling resources to cultivate an ecosystem that enhances tourism re- silience. Resistance-dominated pathways demonstrate that robust tourism assets and local economies bolster tourism’s capacity to withstand external shocks. Henan and Shaanxi should continue enriching tourism resources while further developing the tertiary sec- tor. Recovery-dominated, restructuring-synergistic pathways indicate that provinces with sound tourism infrastructure exhibit higher levels of tourism resilience. Consequently, Ningxia must prioritize improving per capita park green space and green coverage rates. Renewal-driven pathways indicate that tourism innovation and industrial upgrading can enhance resilience through sustained innovation. Shandong should actively increase tourism employment and fixed-asset investment in tourism. Multi-resilience, synergy- driven provinces such as Sichuan require comprehensive measures to achieve coordinated tourism development.",
    "Finally, consolidate the foundations of tourism resilience. The renewal-constrained pathway indicates that insufficient renewal capacity constrains TER enhancement. Inner Mongolia should increase the number of tourism schools and promote technological trans- formation within the tourism industry. The restructuring-lagged pathway demonstrates that reconstruction capacity is a key constraint affecting TER development. Shanxi Province should prioritize addressing how the scale of tourism employment and the level of tourism fixed-asset investment constrain TER. The overall resilience-deficient pathway underscores the core value of consolidating resilience foundations. Gansu Province must prioritize the coordinated development of the provincial tourism system. Against the backdrop of the YRB being designated a national strategic zone for ecolog- ical conservation and high-quality development, and as the tourism sector transitions from quantitative expansion to qualitative upgrading, this study dissects the spatio-temporal evolution and configurational pathways of its TER. The findings yield three principal contributions. First, a four-dimensional indicator system—encompassing resistance, recovery, re- structuring, and renewal—was developed to evaluate the level of TER. By analysing its spatio-temporal patterns across the nine provinces, the study offers a novel analytical lens for research on regional tourism disparities. Compared with extant studies that fo- cus solely on the spatial configurations of provincial TER under the shocks of 2003 and 2020, the present research adopts a longer temporal window and a narrower spatial focus. This design captures the dynamic evolution of resilience more comprehensively, eluci- dates long-term trends and phased characteristics, and avoids the partiality induced by short-term fluctuations. Moreover, the previous literature on the YRB has predominantly addressed tourism high-quality development and green transitions, leaving TER largely unexamined [1,27,28,45,46]. Second, the SDE model is employed to delineate the centroid trajectory of TER, thereby revealing pronounced spatial heterogeneity and dynamic change. fsQCA further identifies four driving pathways and three constraining pathways, addressing the critique that extant research overemphasises single-factor influences such as the digital economy or innovation capacity [8]. Existing studies on TER typically resort to traditional spatial diagnostic methods such as Moran’s I, which merely generate static clustering snapshots at discrete time points and only delineate the spatial differentiation between high-value and low-value clusters [47]. By integrating the SDE with fsQCA, this study can accurately capture the continuous evolutionary characteristics of both the directional distribution and spatial morphology of TER, and further clarify the underlying mechanisms driving the emergence of such patterns. The nine provinces should therefore identify context-specific trajectories for enhancing resilience, selecting appropriate pathways grounded in their current levels of resistance, recovery, restructuring, and renewal. Finally, the study provides a scientific basis for governmental agencies and tourism managers within the nine-province corridor to formulate forward-looking plans, upgrade the tourism sector, and enhance the economy’s capacity to withstand shocks. It also offers a transferable framework for improving TER in other regions. First, owing to the limited availability of city- and county-level data, this study is confined to the nine-province along the Yellow River; disaggregation to finer spatial units is therefore required to uncover micro-level characteristics and evolutionary nuances of TER. Concurrently, given the limitations of robustness tests on small samples, future work should expand sample sizes while enhancing data frequency and consistency. This will provide more targeted policy guidance and theoretical underpinnings for coordinated regional development. Second, future indicator systems should incorporate variables more proximate to resilience—such as the frequency of natural disasters, tourism safety incidents, transport accessibility, and tourist expenditure—and integrate indicators that better capture the geographical particularities of the YRB. Third, beyond resistance, re- covery, restructuring, and renewal, additional factors such as industrial agglomeration and tourism development level have been identified as potentially influential [23]; a more multidimensional perspective is thus warranted to examine their effects on TER within the nine-province corridor. Fourthly, this study employs only descriptive results of the standard deviation ellipse’s azimuth to demonstrate directional variation, without testing its statistical significance. Subsequent work may introduce Monte Carlo testing to examine the p-value of angular trends, thereby further confirming whether this directional change stems from random fluctuations. Author Contributions: Conceptualization, T.L. and Q.Z.; methodology, T.L.; software, T.L.; validation, Q.Z.; formal analysis, T.L.; investigation, T.L.; resources, T.L.; data curation, T.L.; writing—original draft preparation, T.L.; writing—review and editing, T.L.; visualization, Q.Z.; supervision, Q.Z.; project administration, Q.Z.; funding acquisition, Q.Z. All authors have read and agreed to the published version of the manuscript.",
    "Funding: This research was supported by (1) The Major Project of the Shanxi Provincial Philosophy and Social Science Planning (Grant No. 2024ZD023); (2) The General Project of the Shanxi Provincial Philosophy and Social Science Planning (Grant No. 2024YB096); (3) The Major Special Project for “Forging the Sense of Community for the Chinese Nation,” funded by the Shanxi Academy of Social Sciences (Grant No. ZLKTZD25008). Data Availability Statement: The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author."
]