[
    "Citation: Liang, X.; Zhang, P. Relationship Between Land Use Transformation and Ecosystem Service Value in the Process of Urban–Rural Integration: An Empirical Study of 17 Prefecture- Level Cities in Henan Province, China. Sustainability 2024, 16, 9029. https:// doi.org/10.3390/su16209029 Abstract: Urban–rural integration, which aims to balance economic growth with sustainable land use, is becoming an increasingly critical strategy for regional development. This study provides crucial insights into the relationship between land use changes and ecosystem service values (ESVs) in rapidly urbanizing areas by analyzing the urban–rural integration process in Henan Province, a typical agricultural province in China. This research investigated the relationship between land use transformation and ESVs in Henan Province, China, from 1990 to 2020. Utilizing land use data and employing the equivalent factor method and elasticity model, we analyzed shifts in land use and their impacts on ecosystem services across 17 prefecture-level cities. Results indicated a gradual improvement in the urban–rural integration development index of Henan Province, particularly after 2000, but with notable disparities among cities. Zhengzhou, the provincial capital, consis- tently demonstrated high urban–rural integration development index (URII) values, influencing the integration efforts of neighboring cities. Conversely, peripheral cities exhibited lower integration indices. Notable shifts in land use patterns characterized by diverse transfer dynamics distinctively influenced ESVs across regions. Urban sprawl initially exerted substantial impacts on ecosystem services and stabilized over time. Suburbanization impacts peaked in the early and middle stages, while agricultural intensification initially affected ecosystem services, but their effects diminished with increased efficiency. Ecological restoration efforts consistently enhanced ESVs. The findings contribute to a more comprehensive understanding of the dynamic interactions between land use transitions and ecosystem services in the context of urban–rural integration. Copyright: © 2024 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). The concept of urban–rural integration has gained importance in regional development policies, with the aim of fostering coordinated development between urban and rural areas to achieve a balance between economic growth and efficient land utilization [1,2]. In China, significant disparities persist between urban and rural development, particularly evident in infrastructure and economic opportunities. Addressing these disparities through urban–rural integration is vital to promoting sustainable development. Given China’s rapid urbanization and ongoing rural revitalization efforts, understand- ing the impacts of urban–rural integration on land use and ecosystem services is essential for effective policy formulation. This integration aims to optimize land use patterns, en- hance ecosystem service values (ESVs), and foster equitable development across both urban and rural regions [3]. By studying these impacts, valuable insights can be gained into designing integration strategies that maximize benefits while minimizing negative consequences. This study aims to answer the following research questions: (1) How has urban–rural integration influenced land use patterns in Henan Province from 1990 to 2020? (2) What are the impacts of these land use changes on ecosystem service values? (3) How does the sensitivity of ESVs to land use changes vary over time and space within the province? Urban–rural integration is grounded in systems theory and spatial economics, viewing urban and rural areas as interconnected components of a larger socio-economic and ecolog- ical system. Prior studies have traced the evolution of urban–rural integration, from early stages emphasizing interactive development—where urban and rural areas were viewed as distinct yet interconnected—to subsequent efforts focused on coordinated development aimed at harmonizing growth and reducing disparities. Recent research has furthered this understanding by examining the impacts of specific policies and interventions on land use and ecosystem services. Foundational work by Yang et al. established the theoretical framework for urban–rural integration [4], while more recent research has provided em- pirical evidence from various regions in China, although this research has often lacked specificity or localized insights [5,6]. Most existing studies have either focused on urban or rural aspects separately or have presented generalized findings without regional specificity. This study addresses these limitations through a detailed empirical analysis of Henan Province, a major agricultural region (with cultivated land covering 47.5% of its area) that is experiencing rapid urbanization. This research spans the period from 1990 to 2020, offering unique insights into urban–rural integration dynamics over three decades. By examining 17 prefecture-level cities, this study reveals land use and ecosystem service patterns often missed in single-scale studies. A novel classification of land use transition modes specific to the context of Henan is introduced, enhancing the understanding of urbanization impacts on land use transition. Analysis of the temporal elasticity of ESVs demonstrates how their sensitivity to changes in land use evolves over time. To comprehensively examine the complex relationships among urban–rural integration, land use transformation, and ESVs, this study employs a combination of methodological approaches. This study’s method- ological innovation lies in its integration of land use transfer matrices, ESV assessment, and elasticity analysis, providing a comprehensive framework for examining the complex relationships among urban–rural integration, land use transformation, and ecosystem ser- vices. Land use transfer matrices are used to track changes in land use patterns over time; ESV assessment is used to quantify the impacts of these changes; and elasticity analysis is employed to measure the sensitivity of ecosystem services to land use transformations. This multi-method approach allows for a nuanced understanding of the dynamics of ESVs, providing a robust framework for addressing the research questions and offering insights that can inform policy decisions.",
    "The structure of this paper is as follows: Section 2 presents a comprehensive literature review and mechanism analysis on how urban–rural integration influences land use trans- formation and ESV, laying the groundwork by defining key concepts, summarizing prior research, and elucidating the underlying mechanisms. Section 3 outlines the methodology employed and details the data preparation process for analyzing the impact of urban–rural integration on land use transformation and ESV. Section 4 presents the empirical results and discusses the findings concerning these impacts. Finally, Section 5 offers conclusions and discusses this study’s implications, providing recommendations for policymakers and suggesting avenues for future research. Urban–rural integration is the process of interaction and merging between urban and rural areas across economic, social, cultural, and other dimensions. China’s urban–rural development has progressed through three stages: interactive development, coordinated development, and integration of urban and rural areas. Urban–rural integration aims for coordinated and harmonized development of urban and rural areas, guided by the Liu emphasized that integrated urban–rural development is crucial for achieving regional coordination, reducing disparities between urban and rural areas, and optimizing resource allocation across these regions [11]. Yang highlighted significant spatial disparities in the degree of urban–rural integration, with higher values observed in eastern China compared to lower values in the western and central regions [4]. Land use change is a significant characteristic of urban–rural integration. With the integration of urban and rural development, rural land transforms into urban built-up land, reducing agricultural land and increasing built-up land [12,13]. Wang found that the integration of urban and rural areas has significantly accelerated the transformation from rural to urban land, especially in rapidly urbanized areas. This process not only changes the structure and function of land use but also has an impact on the regional ecological environment and the sustainable use of land resources [14]. In their study of Bangalore, India, Kavitha et al. found that urban expansion led to a considerable reduction in agricultural land, which had a significant adverse impact on regional ecosystem services and environmental sustainability [15]. The impact of urban–rural integration on the value of ecosystem services is multifaceted. As rural areas transform into urban landscapes, the ecosystem services provided by these lands undergo significant changes. Camara et al. found that the conversion of agricultural land to urban use decreased the capacity for carbon sequestration, water purification, and habitat provision, which are critical ecosystem services [16]. Similarly, Wang highlighted that rapid urban expansion leads to habitat fragmentation, biodiversity loss, and altered hydrological cycles, diminishing the overall value of ecosystem services [14]. This emphasizes the need for sustainable land use planning to balance urban growth with the conservation of essential ecological functions. Recent studies have highlighted the importance of integrating green infrastructure and sustainable urban planning in mitigating the negative impacts of urban–rural inte- gration. For example, Kleemann et al. emphasized that incorporating green spaces into urban planning can help preserve critical ecological functions, such as air and water pu- rification, temperature regulation, and recreational opportunities. This approach not only enhances the quality of life for urban residents but also supports biodiversity and ecosys- tem health [17]. These findings highlight the necessity of adopting a holistic approach to urban–rural integration that considers both development needs and environmental sus- tainability [18]. Effective integration strategies can ensure that urban–rural development positively contributes to both human well-being and ecological resilience. While existing research has provided valuable insights into urban–rural integration and ecosystem services, certain aspects of their relationship have not been adequately explored. Current literature often focuses on individual components of land use change or specific ecosystem services without comprehensively capturing the dynamic nature of urban–rural integration processes. There is a lack of studies that examine the long-term, interconnected effects of these processes on multiple ecosystem services simultaneously, particularly in agricultural regions undergoing rapid urbanization. Additionally, the vary- ing impacts of different land use transition modes on ESVs across different regions represent an area where further research is needed. Exploring these research directions could en- hance our understanding of the complex interactions between urban–rural integration and ecosystem services, potentially informing more effective strategies for sustainable regional development. Urban–rural integration does not necessarily have negative effects; it can have many positive impacts while also presenting some challenges. This study hypothesizes that different land use transition modes will have varying degrees of impact on ESV, with some being potentially positive and others being potentially negative.",
    "Urban–rural integration processes catalyze substantial land use changes, influenced by factors such as economic growth, population dynamics, and infrastructure advancements. These drivers contribute to the conversion of agricultural areas to built-up land, urban sprawl, and intensified land utilization, thereby altering the structure and function of land use [19–21]. This transformation profoundly affects ecosystem services, manifesting in a spectrum of impacts that include both advantageous and detrimental effects. Firstly, reduced agricultural land decreases food production capacity, carbon seques- tration potential, and soil fertility [22]. However, advanced agricultural technology and intensive management can improve agricultural production efficiency, partially compensat- ing for land reduction. Additionally, modern agricultural techniques help reduce pesticide and fertilizer use, thereby improving soil quality and environmental health. Secondly, urban expansion leads to habitat fragmentation and biodiversity loss but also provides better living conditions and economic opportunities, improving the living standards and well-being of residents. Scientific planning and ecological protection mea- sures during the process of urbanization can mitigate habitat destruction. For example, the construction of urban green spaces, parks, and protected areas can maintain and restore biodiversity and provide important ecosystem services [23]. Land use changes affect regulatory services like water purification, climate regulation, and air quality. Urban expansion may increase surface runoff and water pollution, but stormwater management systems and green infrastructure (such as rain gardens, permeable pavements, and urban wetlands) can manage runoff and improve water quality. The urban heat island effect can be mitigated by increasing urban greenery, using reflective materials, and improving building designs. Urban–rural integration promotes socio-economic development, increasing income and living standards, and enhancing awareness and investment in environmental protec- tion. Collaboration between governments and communities drives the implementation of environmental policies and sustainable development practices, thereby enhancing the value of ecosystem services [24]. Existing studies simply view land use transformation as the result of urban expansion or agricultural intensification, overlooking the more complex dynamics in the process of coordinated urban–rural development. This study proposes that in the context of urban– rural integration, land use transformation actually involves the redistribution of urban and rural resources, population, and economic activities. This perspective provides a new theoretical framework for understanding the relationship between land use change and ESV. Figure 1 illustrates these mechanisms, aiding in the understanding of the various paths through which the urban–rural integration process affects ecosystem services, in- cluding both positive and negative effects. Through scientific planning and management, the positive impacts of urban–rural integration can be maximized while minimizing its negative effects. Henan Province, a major agricultural region in central China, is a populous region that has experienced rapid urbanization in recent years. The middle reaches of the Yellow River pass through Henan, and its varied topography encompasses plains, hills, and mountains (Figure 2), supporting diverse types of land use, including agricultural land, forests, grasslands, wetlands, and urban areas [25]. This varied landscape, coupled with the province’s extensive arable land and pivotal role in national grain production, makes Henan a crucial case study for exploring the interplay among urban–rural integration, land use multifunctionality, and ESVs. Prefecture-level cities in Henan display diverse development patterns, ranging from major metropolitan areas like Zhengzhou to smaller cities such as Luoyang, Nanyang, and Shangqiu. Recent infrastructure advancements, driven by urbanization and rural revitalization strategies, have fostered integration and resource mobility between urban and rural areas in the province. This study excludes Jiyuan, a directly administered county-level city in Henan Province established in 2005, due to a lack of statistical data. Thus, the scope encompasses 17 prefecture- level cities in Henan Province, with these cities serving as the study units. Urban–rural integration is a process that aims to blur the boundaries between ur- ban and rural areas by promoting balanced and coordinated development across the urban–rural continuum. It involves the flow and exchange of people, goods, capital, and information between cities and the countryside, leading to the formation of a more spatially and economically integrated region. In the context of this study, urban–rural integration is assessed through the lens of population, land, society, and industrial connections between urban and rural areas [26–28]. Given the importance of land use analysis in this study, indicators were chosen to assess urban–rural integration development across city regions, focusing on popula- tion, economy, and society dimensions, with each dimension being equally weighted (Table 1). Min–max normalization was performed to standardize the indicators for com- parability. The urban–rural integration index (URII) was then calculated based on these standardized indicators.",
    "This study calculates ESVs per prefecture-level city in Henan using the unit area value equivalent factor method, based on the equivalent table of ESV per unit area in China revised by Xie et al. [29]. The formula is as follows: where ESVkj is the ESV of land use type j in study unit k (CNY); Akj is the area of land use type j (km2); and VCj is the unit area ESV of land use type j (CNY/km2). To ensure that the equivalent value of ecosystem services in the study area aligns with the local context, the value equivalent was adjusted using the following formulas: where Ea is the unit value equivalent (CNY/km2); Q is the average grain yield per unit area in Henan from 1990 to 2020, which was 5002.86 kg/km2; F is the national grain purchase price in 2020, which was 2.20 CNY/kg; and V denotes the equivalent values for different land use types. Based on Equation (3), the adjusted unit ESVs for different land use types are 6293 CNY/km2 (cropland), 30,970 CNY/km2 (forestland), 18,967 CNY/km2 (grassland), 139,646 CNY/km2 (water bodies), and 1022 CNY/km2 (unused land). The elasticity coefficient of the ecosystem service system reflects the relationship between ESV change and land use transformation in urban–rural integration [29]. The calculation formulas are where EEL is the elasticity index (%); ESVstart and ESVend are the ESVs at the beginning and end of the study period, respectively; LCP is the comprehensive land use change intensity (%); ∆LUCti is the conversion area of land use type i; LUti is the initial area; and t is the study period. Urban–rural integration index data came from the China Urban Statistical Yearbook and Henan Statistical Yearbook (1990–2020). Land use data for 1990, 2000, 2010, and 2020 were obtained from the Resource and Environment Data Cloud Platform of the Chinese Academy of Sciences (http://www.resdc.cn/, accessed on 20 January 2024) with a 30 m × 30 m resolution. Based on the national classification standard of land use, the land use in this region was classified into six types: cultivated land, forest land, grassland, water bodies, built-up land, and unused land. Grain production and price data were from the Henan Statistical Yearbook, China Statistical Yearbook, and China Statistical Information Network (http://www.ticn.org/, accessed on 20 January 2024) (Table 2). From 1990 to 2020, the urban–rural integration index of prefecture-level cities in Henan Province exhibited an overall increase, with acceleration observed from 2000 to 2020. In the early stage, specifically in 1990, the URII for cities in Henan Province was relatively low, mainly ranging between 0.25 and 0.35 (Table 3 and Figure 3). Cities such as Zhengzhou, Kaifeng, and Luoyang displayed relatively lower URIIs, indicating significant disparity between urban and rural areas within these areas. This period highlighted foundational challenges in harmonizing urban and rural development in Henan. By 2000, there was a notable improvement in the URII values for Henan’s cities, with values clustering around 0.35 to 0.45. This period was characterized by a noticeable enhancement in the level of urban–rural integration, albeit with persistent spatial differences. Cities like Kaifeng and Luoyang still maintained lower URIIs, suggesting that while progress was made, these cities were not as proficient as other cities (e.g., Jiaozuo and Xinxiang) in reducing the urban– rural divide. In 2010, the URII for cities in Henan Province continued rising, with most values falling between 0.35 and 0.45, indicating ongoing improvement in urban–rural inte- gration, albeit with persistent disparities across different cities. By 2020, overall disparities noticeably reduced, and most cities achieved URII values exceeding 0.5. Cities that started with lower indices, such as Jiaozuo and Xinxiang, showed particularly rapid improvements in their URII later on. Zhengzhou, the provincial capital, maintained consistently high URII, reaching 0.6268 in 2020, demonstrating its pivotal role in facilitating urban–rural integration and enhancing the quality of life for both urban and rural residents. Moreover, with Zhengzhou as the center, the process of urban–rural integration in the surrounding cities (Jiaozuo, Kaifeng, Xuchang, Luoyang) also demonstrated a rapid advancement. Analyzing land use transition matrices from 1990, 2000, 2010, and 2020 reveals distinct land use transfer modes of cities in Henan Province. The main transfer modes include the conversion of agricultural land to built-up land and forest land to cultivated land. This reflects the dual pressures of urbanization, which requires built-up land for residential, commercial, and industrial purposes, and agricultural development, which requires arable land for food production and farmers’ livelihoods [30,31].",
    "Within the context of urban–rural integration, land use transfer modes of cities in Henan Province can be categorized as follows: tion of built-up land transferred in was between 5% and 15% and the proportion of grassland or forest land transferred in exceeded 5%. During 1990–2000, suburban development, agricultural intensification, and ecological restoration were the dominant land use transfer modes in Henan’s prefecture-level cities during the process of urban–rural integration (Table 4). These modes reflected three development directions: urban expansion, agricultural modernization, and ecological environment protection. Suburbanization was prevalent in cities with higher urban–rural integration indices, such as Anyang, Hebi, Jiaozuo, Xinxiang, Zhumadian, and Zhengzhou. Agricultural intensification was dominant in cities such as Kaifeng, Pingdingshan, Puyang, Shangqiu, Xinyang, Luohe, Xuchang, Zhoukou, and Nanyang. Ecological restoration, focused on protecting and improving the ecological environment through the restoration of forest lands and grasslands, was prominent in Luoyang and Sanmenxia. From 2000 to 2010, the prefecture-level cities in Henan Province showed different land-use transfer modes, including urban expansion, suburban development, agricultural intensification, and ecological restoration (Table 5). Urban expansion was a significant trend in cities like Zhengzhou, Shangqiu, and Zhoukou. For example, the proportion of built-up land transfer was the highest in Zhengzhou (22.54%), indicating strong demand for urban expansion. Suburbanization was dominant in cities like Anyang, Hebi, and Xinxiang. The proportion of built-up land transfer in the suburban development mode was low (6.55–14.66%). The proportion of cultivated land transfer was high (56.59–70.06%) but lower than that in the urban expansion mode. The transfer ratio of grassland and forest land was relatively high, reflecting the diversity of land use in the suburbs. Ecological restoration was dominant in Luoyang and Sanmenxia. Compared with 2000–2010, the land use transfer modes of various prefecture-level cities in Henan Province showed some changes and trends from 2010 to 2020 (Table 6). The proportion of built-up land transfer and cultivated land transfer in the two stages of urban expansion mode did not change considerably, indicating the continuity and stability of urban expansion. The trend in 2000–2010 continued from 2010 to 2020, and cultivated land continued to be the main transferred land. The land use pattern of suburban development did not change much in the two stages, but in 2010–2020, the proportion of built-up land transfer increased slightly, indicating that suburban development was still continuing to strengthen. The proportion of cultivated land transfer was relatively stable, reflecting the continuous dependence on farmland resources. The agricultural intensification model continued to focus on the efficient use of cultivated land, and the transfer proportion of built-up land did not change notably. The proportion of built-up land transfer in the ecological restoration model increased slightly from 2010 to 2020, indicating that ecological restoration was constantly advancing. The proportion of cultivated land transfer and the proportion of forest land transfer changed; in particular, the proportion of cultivated land transfer in Sanmenxia was low, while the proportion of forest land transfer was high. The differing land use distribution during the four stages of Henan Province (Figure 4) revealed that although cultivated land occupied most of the area of Henan Province, land use transfer modes began to diversify in the process of urban–rural integration. Agricultural intensification was the dominant mode of land use transformation in the eastern part of Henan, whereas urban expansion was the dominant mode of land use transformation in Kaifeng, Shangqiu, and Zhoukou since 2000. A large amount of rural land was transformed into urban construction land, and the rapid development of industrial parks, commercial centers, and residential areas promoted the rapid growth of the regional economy. In general, the land use transformation mode of Henan Province had unique characteristics in different regions and different stages, which not only reflects the differences in regional development but also the province’s continuous exploration and innovation efforts in the process of promoting urban–rural integration. Figure 4. Distribution of different types of land in prefecture-level cities of Henan Province from 1990 to 2020 (impervious refers to built-up land). Social and economic factors also play a crucial role in the process of urban–rural integration and land use change. For example, in Zhengzhou, the capital of Henan Province, the pace of urban expansion has significantly accelerated due to substantial economic growth and population influx, and consequently, a large amount of farmland has been converted into urban construction land. Zhengzhou’s GDP growth and population growth rate are among the highest in Henan Province, which has driven rapid urbanization in the urban periphery. This has had a significant negative impact on the ESV of the region.",
    "In contrast, cities such as Nanyang and Xinyang, although relatively stable in economic development, have made remarkable progress in promoting agricultural modernization and ecological restoration owing to local government policy guidance and prioritization of ecological protection. In Nanyang, for example, the policy of agricultural intensification and ecological restoration not only improved local productivity but also significantly increased local ESV by reducing overdevelopment of land and strengthening ecological restoration. These cases show that socio-economic factors such as economic growth, policy direction, and population migration show significant heterogeneity in the process of rural–urban integration in different regions and cities, thus affecting the transformation pattern of land use and the change in ecosystem services. Temporally, from 1990 to 2020, most prefecture-level cities in Henan Province expe- rienced a decline in ESV (Figure 5 and Table 7). Cities like Zhengzhou, Kaifeng, Anyang, Hebi, Puyang, and Luoyang exhibited a decline in their ESVs, primarily attributed to the effects of rapid urbanization, industrial expansion, and intensified human activities on the ecological environment. In contrast, cities such as Nanyang and Xinyang exhib- ited relatively stable or even increasing ESVs, suggesting that these regions might have implemented effective environmental protection and resource conservation measures. Spatially, significant disparities in ESVs were evident across Henan Province. Cities like Nanyang, Xinyang, and Luoyang consistently ranked high, with Nanyang having the highest historical ESV, reaching 474.641 in 2020, indicating that these cities had abundant ecological resources. Notably, Luoyang’s ESV, while experiencing a slight decline from 300.288 in 1990 to 298.063 in 2000, rebounded to 303.836 in 2020, suggesting successful efforts to respond to ecological pressures and restore its ESV. Conversely, cities like Hebi and Luohe consistently exhibited the lowest ESVs, with the ESV of Hebi reaching 20.2375 in 2020. This indicated potential ecological degradation or lower prioritization of ecological protection in these areas. Calculations based on Equations (6) and (7) revealed variations in the elasticity index of ESV to land use change across ecological function areas in Henan Province (Table 8 and Figure 6). Kaifeng exhibited the highest ecosystem elasticity index (2.42%) during 1990–2020, implying that a 1% change in land use significantly altered ESV by approxi- mately 2.42%. Conversely, Luoyang showed the lowest ecosystem elasticity index (0.53%). Notably, the ESV elasticity index in Pingdingshan, Anyang, Hebi, Luohe, Sanmenxia, Nanyang, and Zhumadian initially increased and then decreased, while other ecological function areas exhibited a gradual decrease. This suggests a diminishing response of ESV to land use change over time in each ecological function area. Between 1990 and 2000, many cities, particularly Kaifeng (5.09), Jiaozuo (4.38), and Puyang (4.49), exhibited high elasticity coefficients of ESVs in response to land use/cover changes (LUCCs), reflecting notable fluctuations in ESVs due to rapid land use transforma- tions. Between 2000 and 2010, some cities like Nanyang (2.34) and Hebi (1.95) continued to demonstrate high elasticity coefficients, albeit with an overall decline compared to the previous decade, suggesting stabilization in the impact of LUCCs on ESVs amid urban– rural integration processes. Between 2010 and 2020, elasticity coefficients further decreased, indicating a more stable relationship between LUCCs and ESVs, reflecting improved adapt- ability of ecosystem services to land use changes. Over the entire period (1990–2020), cities like Kaifeng (2.42), Jiaozuo (1.76), Puyang (1.74), and Nanyang (1.51) maintained relatively high elasticity coefficients, underscoring the enduring impacts of land use changes on ESVs in these areas. This analysis further explores the relationship between ESV changes and land use transitions based on the summarized patterns during three stages of urban–rural integration (Tables 3–5). In cities like Zhengzhou, Shangqiu, and Zhoukou, following the urban expansion mode, the initial impact on ESVs due to increased built-up land was notable, and it was reflected in high elasticity coefficients. However, as urban expansion continued, these coefficients gradually decreased, indicating a stabilizing effect of ongoing land use changes on ESVs. In the suburbanization mode, typical cities like Anyang, Hebi, and Xinxiang showed initial and mid-term high ESV elasticity coefficients. This indicated a significant impact of agricultural land conversion to suburban built-up land on ESVs. As suburbanization progressed, ESV elasticity coefficients gradually decreased, reflecting a stabilization of the effects of land use changes on ESVs. Under the agricultural intensification mode, typical cities like Kaifeng, Pingdingshan, and Puyang improved land use structure by enhancing agricultural land efficiency. Initially, this had a significant impact on ESVs, reflected in high elasticity coefficients. As intensifica- tion continued, ESV elasticity coefficients gradually decreased, indicating a diminishing negative impact on ESVs while enhancing agricultural productivity.",
    "In the ecological restoration mode, typical cities like Luoyang, Sanmenxia, and Xinyang restored ecosystem service functions by increasing forest and grassland areas. Due to We attempted several regression analyses and correlation tests, and we found that there was no significant correlation between rural–urban integration index and ESV and the elasticity of land use change. However, we found that different land use transfer modes in the process of urban–rural integration lead to significant differences in the response of eco- logical services. These results emphasize the importance of selecting appropriate land use transition modes during the urban–rural integration process to protect and enhance ESVs. This study illuminates the complex relationships among urban–rural integration, land use changes, and ecosystem service values (ESVs) in Henan Province. The findings contribute to a deeper understanding of these relationships in several key respects. First, the results confirm that different land use transition modes—urban expansion, suburbanization, agricultural intensification, and ecological restoration—exert distinct and evolving impacts on ESVs. These findings extend existing theoretical frameworks linking land use change to ecosystem services [32,33]. Rapid urban expansion in cities like Zhengzhou led to significant declines in ESVs, while cities prioritizing ecological restoration, such as Luoyang and Sanmenxia, saw improvements, highlighting the critical role of sustainable land use practices. Second, this study identified a decreasing elasticity of ESVs over time, suggesting a degree of ecosystem resilience to land use changes. This aligns with ecological resilience theory, which posits that ecosystems can adapt to certain levels of human-induced distur- bances. However, the observed resilience underscores the necessity of continued careful management to prevent long-term degradation, particularly in areas undergoing rapid urbanization or agricultural intensification. Third, the significant disparities in the urban–rural integration index (URII) across cities reflect spatial heterogeneity in the integration process. This supports the theory of uneven development, highlighting the need for region-specific strategies that account for local socio-economic conditions and environmental capacities. These findings have important implications for urban planning and policy develop- ment. Cities undergoing rapid expansion, such as Zhengzhou, would benefit from policies enforcing urban growth boundaries and promoting compact urban forms to mitigate nega- tive impacts on ESVs. Conversely, cities like Nanyang and Xinyang, which have maintained or increased their ESVs, could serve as models for sustainable urban–rural integration. In regions dominated by agricultural intensification, such as Kaifeng and Zhumadian, policies should aim to balance agricultural productivity with ecological sustainability. Meanwhile, cities with positive outcomes from ecological restoration, such as Luoyang and Sanmenxia, should prioritize the continuation and expansion of these initiatives. Incorporating green infrastructure into urban planning will be essential to preserving biodiversity, maintaining ecosystem functions, and improving urban residents’ quality of life. Limitations of this study include the incomplete accounting for natural and socio- economic variations among cities, which could influence land use changes and ESVs. Additionally, data from only four time points over 30 years were used; the temporal resolution could be improved to provide more detailed insights into the dynamics of land use changes and ESV responses. Future research should focus on examining the direct impacts of urban–rural integration on ESVs, incorporating socio-economic factors into the analysis, conducting comparative studies across different regions, and employing advanced spatial analysis techniques [34]. This empirical investigation has revealed significant shifts in land utilization patterns and their effects on ecosystem services in the process of integration across different cities and time periods. The salient findings are as follows: The URII of Henan Province showed an overall increasing trend, particularly after 2000. However, significant disparities persisted among different cities, reflecting uneven development across the region. This study identified four primary land use transition modes: urban expansion, subur- banization, agricultural intensification, and ecological restoration. Each mode exhibited distinct temporal patterns and spatial distributions across the province, with varying im- pacts on ESVs: Urban expansion and suburbanization initially had significant negative impacts on ESVs, which diminished over time. Cities like Zhengzhou experienced substan- tial ESV declines due to rapid urbanization. Agricultural intensification showed a similar pattern to urban expansion, with initial negative impacts on ESVs. This was particularly evident in areas like Kaifeng and Zhumadian. Ecological restoration consistently enhanced ESVs, as seen in cities like Luoyang and Sanmenxia. Most cities experienced declining ESVs due to urbanization and industrialization. However, cities that implemented effective ecological conservation measures experienced stable or increasing ESVs, emphasizing the importance of sustainable development strategies.",
    "Based on these findings, differentiated development strategies are recommended for different types of cities in Henan Province: For rapidly expanding cities: implement strict urban growth boundaries and promote compact, green development to mitigate negative impacts on ESVs; For agriculturally intensive areas: balance productivity enhancement with ecological preservation through sustainable farming practices and agro-ecological corridors; For cities showing positive results from ecological restoration: prioritize and expand these efforts, potentially serving as models for sustainable development. The findings provide a foundation for developing sustainable and ecologically sensi- tive urban–rural integration strategies and can inform policy decisions in regions undergo- ing rapid urbanization, helping balance development needs with ecological preservation. Author Contributions: Conceptualization, methodology, software, writing—original draft prepara- tion, and visualization: X.L. and P.Z.; validation, formal analysis, and data curation: X.L.; writing— review and editing: X.L. and P.Z.; supervision, project administration, and funding acquisition: P.Z. All authors have read and agreed to the published version of the manuscript. Data Availability Statement: The data that support the findings of this study are available on request from the corresponding author. The data are not publicly available due to privacy or ethical restrictions."
]