[
    "Abstract: In the context of economic structural transformation and upgrading in the Yellow River Basin, this study explored the interaction between sports tourism and ecological civilization in the region. By constructing an indicator system for sports tourism and ecological civilization and applying the entropy weight method, coupling coordination model, and using the obstacle degree model, sports tourism development and ecological civilization construction in each province of the Yellow River Basin were quantitatively analyzed. The results revealed upward trends in both sports tourism and ecological civilization construction in the Yellow River Basin. According to the coupling coordination model, the most significant growth in coupling coordination degree has been observed in Sichuan, Gansu, Shaanxi, and Henan provinces, whereas Qinghai and Inner Mongolia have seen the least change in their coordination level. Government spending on sporting events and per capita water resources was identified as the main factors influencing the development of sports tourism and ecological civilization in the Yellow River Basin. Based on these findings, policy recommendations are proposed to promote the coordinated development of sports tourism and ecological civilization in the Yellow River Basin. Citation: Zhao, F.; Han, J. Interactive Relationship and Coordinated Development of Sports Tourism and Ecological Civilization in the Yellow River Basin. Sustainability 2025, 17, 82. https://doi.org/10.3390/ su17010082 The Yellow River Basin (YRB) is a vital geographical region in China, spanning nine provinces and linking the northwestern plateau with the eastern Bohai Sea [1]. Its extensive geographical range provides habitats for diverse ecosystems, playing a critical role in biodiversity conservation [2]. The water resources of the YRB are essential for maintaining regional ecological balance, supporting agricultural irrigation, and ensuring domestic water supply. Additionally, the YRB serves as a significant economic zone and energy base in China [3]. In 2020, the region’s GDP totaled 2474.08 billion RMB, accounting for 25% of China’s total GDP [4]. Despite possessing only 2% of China’s water resources, the basin supports 9% of the country’s population, sustains 15% of its arable land, and secures China’s food security and agricultural development. Thus, the YRB is crucial for the socioeconomic development and ecological sustainability of northern China [5]. Copyright: © 2024 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https://creativecommons.org/ licenses/by/4.0/). However, the YRB faces unprecedented environmental challenges that not only threaten the sustainable development of local societies but also pose significant risks to China’s ecological security. Continuous population growth and rapid economic develop- ment have exacerbated the contradiction between water supply and demand. Moreover, nine provinces along the YRB have long relied on mineral resource extraction and process- ing as their leading industries [6]. This energy-driven economic model has fueled regional economic prosperity; however, it has also led to various environmental issues, including water pollution [7], biodiversity loss [8], and soil erosion [9], further deteriorating the already fragile ecosystem. In this context, the Chinese government introduced the “Outline of the Plan for Ecological Protection and High-Quality Development of the YRB”. This plan aims to improve quality of life and promote regionally coordinated and sustainable development through enhanced ecological protection and governance, preservation and promotion of Yellow River culture, and improved infrastructure. Ecological civilization represents a transformative approach to development that seeks to harmonize the relationship between humanity and nature by integrating envi- ronmental sustainability into the fabric of societal progress [10]. This concept has gained prominence, particularly in China [11] where it is considered a guiding ideology for sustainable development. Theoretical research on ecological civilization primarily focuses on exploring and evaluating the concept of ecological civilization [12,13], as well as analyzing its characteris- tics and necessity from a political perspective [14–16]. Another significant research area involves empirical studies assessing ecological civilization [17–20], with particular attention given to the relationship between urbanization and ecological civilization [21,22]. These studies comprehensively analyze the interactions between human activities and ecosys- tems, thereby informing more effective policy-making. Research combining ecological civilization with sports tourism predominantly adopts an ecological sports tourism perspec- tive, investigating strategies for developing ecological sports tourism resources in specific regions [23–25]. However, studies on the mutually reinforcing relationship and coordinated development between sports tourism and ecological civilization remain limited.",
    "Sports tourism is an emerging industry, and it plays an indispensable role in en- vironmental protection, economic growth, and cultural preservation, making it highly compatible with the current developmental plan for the YRB. Moreover, the YRB is an important geographical region in China, and the development of sports tourism, alongside ecological civilization initiatives, is critical for optimizing resource allocation, enhancing regional competitiveness, and promoting environmental sustainability. Given the context of economic structural transformation and upgrading in the YRB, this study aims to do the following. (1) Explore the interactive relationship between sports tourism development and ecological civilization construction in the YRB to better under- stand and recognize their mutual benefits. (2) Employ an indicator system, the entropy weight method, the coupling coordination model, and the obstacle degree model to quanti- tatively analyze the development of sports tourism and ecological civilization construction across provinces in the YRB. (3) Identify the primary obstacles and propose policy recom- mendations to promote the coordinated development of sports tourism and ecological civilization in the Yangtze River Basin. Based on the study’s aim and the practical requirements for the high-quality develop- ment of the YRB, the following research questions are proposed. (1) What are the temporal variation characteristics of sports tourism and ecological civilization in the YRB? (2) What is the state of coupling and coordination between sports tourism and ecological civilization in the YRB? (3) What factors influence the high-quality development of sports tourism and ecological civilization in the YRB? The term ‘ecological civilization’ encompasses a broad spectrum of ideas, empha- sizing the need for a coordinated approach that aligns economic growth with ecological preservation. As articulated by Hansen et al. [26], ecological civilization is not merely an environmental strategy but is also a comprehensive framework that reflects the evo- The construction of an ecological civilization in China has been framed as a response to the pressing environmental challenges faced by the country, particularly in the context of rapid urbanization and industrialization. Dong et al. [27] evaluated ecological civilization levels across various provinces, illustrating disparities in ecological development and the need for targeted policies to enhance sustainability. This evaluation is crucial as it provides a benchmark for assessing progress and identifying areas requiring intervention. Previous research underscores the importance of local conditions in shaping ecological policies and suggests that a one-size-fits-all approach may not be effective in addressing the unique challenges faced by different regions [28]. Moreover, integrating ecological civilization into national policy frameworks has profound implications for governance and societal values. The Chinese Communist Party has positioned ecological civilization as the cornerstone of its development strategy, reflecting a shift toward prioritizing environmental health alongside economic growth [29]. This ideological shift is evident in various policy documents, including the National Human Development Report, which emphasizes the need for sustainable practices that respect ecological boundaries [11]. Thus, the concept of ecological civilization serves as a guiding principle for policy-making and influences decisions related to urban planning, resource management, and environmental protection. Focusing on the study of ecological civilization is of critical importance as it addresses global environmental challenges such as climate change [30], biodiversity loss [31], and pollution [32], offering solutions to fostering harmony between humans and nature. It supports sustainable development by providing the theoretical and practical foundations for balancing economic, social, and environmental progress, as seen in the United Nations’ Sustainable Development Goals (UN SDGs). Sports tourism, as an emerging industrial form, is becoming an increasingly significant force driving economic development [33] and industrial upgrading [34]. It not only enriches the tourism product system and expands the space for tourism consumption, but also fosters a deep integration between the sports event economy and the tourism economy, injecting new vitality into local economic development. A significant trend in sports tourism research is an increasing focus on sustainability. Scholars have emphasized the importance of integrating sustainable practices into sports tourism development, recognizing that the economic, social, and environmental impacts of tourism must be managed effectively. For example, Yang et al. [35] proposed a sustainable sports tourism evaluation framework that incorporates multi-criteria decision-making to assess potential attractions in Taiwan, emphasizing the need for a balanced approach to tourism management. Similarly, Tsekouropoulos et al. [36] discussed the way in which sports events can drive innovative sustainable tourism development, highlighting the economic and social benefits of well-managed sporting activities. This aligns with the findings of Jiménez-García et al. [37], who conducted a bibliometric analysis that revealed growing interest in the intersection between sports tourism and sustainability.",
    "Another critical research area is the socioeconomic impact of sports tourism on local communities. Studies have shown that sports tourism can contribute significantly to regional economic development and community identity. For example, Herbold et al. [38] emphasize the need to understand the role and identity of the community in sports tourism, suggesting that local engagement can enhance the benefits of tourism activities. González- García et al. [39] explored resident perceptions of the impact of sports tourism on sustainable social development and revealed a complex relationship between tourism activities and community well-being. Previous research on the relationship between sports tourism and ecological civiliza- tion in the YRB has been relatively limited, due to the following four key reasons. First, existing studies often focus exclusively on either sports tourism or ecological civilization, lacking an interdisciplinary framework to comprehensively examine their synergies. For example, research on the integration of ethnic sports culture and ecological tourism in the YRB primarily explores development strategies for both fields without delving into their mutual interactions [40]. Second, significant disparities in economic and infrastructural de- velopment among provinces within the basin have resulted in uneven progress [41]. While some regions boast well-developed sports tourism infrastructure, others face resource con- straints, making it challenging to adopt a unified research approach. Third, inconsistencies in policy and a lack of coordination among provinces have led to fragmented strategies for sports tourism and ecological conservation, hindering integrated development. Lastly, the scarcity of empirical data and quantitative research on the interaction between sports tourism and ecological civilization further constrains the ability to generate evidence-based insights and actionable recommendations. The development of sports tourism not only promotes the construction of an eco- logical civilization but also constitutes an integral part of it. Sports tourism emphasizes harmonious coexistence with the natural environment [23], and its activities are often conducted in natural landscapes [42]. This nature-oriented tourism approach helps en- hance environmental awareness and increases enthusiasm for participating in ecological protection [43]. For example, adventure sports in the French mountains [44] and surfing tourism in Cape Town [45] have attracted many outdoor sports enthusiasts. When people enjoy the pleasures of sports tourism, they are more likely to recognize the importance of preserving these natural landscapes, thereby becoming more actively involved in eco- logical protection efforts. Furthermore, the development and protection of sports tourism resources are important components of ecological civilization construction. Sports tourism activities depend on high-quality natural resources such as clear rivers, dense forests, and majestic mountains. The protection and sustainable use of these resources not only provide the necessary material foundation for sports tourism but also are the key to ensuring the continuous advancement of ecological civilization. To promote the development of sports tourism, it is essential to strike a balance between economic benefits and ecological protection [46]. Sports tourism can generate eco- nomic benefits for local areas, stimulate economic growth, and promote related industries, such as accommodation, catering, and transportation; however, this development must not come at the expense of the ecological environment. Therefore, to achieve sustainable growth, the development of sports tourism must be based on ecological protection [37]. In the YRB, sports tourism and ecological civilization have a strong mutually rein- forcing relationship. Economically, as an emerging service industry, the development of sports tourism contributes to the optimization and upgrading of the industrial structure of the YRB, creating new economic growth points for the region. By attracting tourists and boosting local consumption, it drives the growth of related industries such as accommo- dation, dining, and transportation. Socially, sports tourism allows participants to directly experience the natural environment of the YRB, thereby raising their awareness and increas- ing their engagement in ecological protection. Through sports tourism, visitors can gain a more intuitive understanding of the importance of ecological civilization construction. The development and operation of sports tourism projects require a substantial labor force, directly or indirectly creating numerous employment opportunities and improving the living standards and social welfare of local residents. Culturally, sports tourism enables both tourists and residents of the YRB to gain a deeper understanding of and experience the Yellow River culture, fostering a greater sense of cultural identity. Regarding policy, measures such as vegetation restoration and irrigation rehabilitation should be implemented to improve the ecological environment. The layout of disaster monitoring stations and meteorological observation stations should be optimized to ensure ecological security in the YRB. Increased investment in tourism infrastructure is necessary to enhance visitor experiences. Additionally, polluting enterprises should be shut down or restructured to drive a comprehensive green transformation of economic development models. This would help achieve a win-win situation between economic and ecological benefits. Simultaneously, the construction of an ecological civilization in the YRB through protection and restoration of the natural environment and improvement in environmental infrastructure provides abundant natural resources and a sustainable foundation for the development of sports tourism. The interactive relationship between sports tourism and ecological civilization is shown in Figure 1.",
    "To the best of our knowledge, there are currently no detailed statistical data specifically targeting the sports tourism industry; thus, relevant indicators reflecting the state of the sports tourism industry can only be selected from related statistical data. This study selected 11 indicators across three dimensions—overall scale, development foundations, and government support—to measure sports tourism. The specific indicators are listed in Table 1. Quantitative evaluation of ecological civilization is a complex process that requires consideration of not only the quality and sustainability of the ecological environment but also multiple dimensions such as economic, social, and cultural factors. Construction of the YRB ecological civilization indicator system should be based on the key environmental issues and developmental constraints currently faced by the YRB and also on the under- standing of the interactive relationship between sports tourism and ecological civilization. Based on previous research on ecological civilization [7,51–55], indicators that aligned with the characteristics of the ecological environment of the YRB from four aspects—ecological society, ecological economy, ecological environment, and ecological governance—were selected in the present study. The specific indicators are listed in Table 2. The entropy weight method is one of the most commonly used objective approaches for determining indicator or structural weights [56]. It relies on information entropy to assign weights within multi-indicator evaluation systems. The core principle of this method is to quantify the amount of information contained in each indicator by measuring its information entropy, thereby reflecting its significance [57,58]. Since it does not require subjective judgment, the entropy weight method minimizes the influence of human factors on weight assignment, enhancing the objectivity and scientific rigor of the study. Accurate weight allocation is crucial for ensuring the reliability of evaluation results, and in this study, the entropy weight method is employed to systematically and effectively determine the weights of various indicators for sports tourism and ecological civilization in the YRB, laying a solid foundation for subsequent research. The entropy weight calculation process is shown in the following equations. Here, i represents the year and j represents the indicator. Because all indicators are positive, they are standardized using Equation (1). Standardization enables the comparison and analysis of data with different meanings and units. Pij represents the proportion of the value of the ith object under the jth indicator; Ej is the entropy value of the jth indicator; Wj is the weight of the jth indicator, and Fj is the comprehensive score of the jth indicator. The coupling coordination model is a methodological framework used to analyze and evaluate the interactions and degree of coordinated development between two or more systems [59]. It has been widely applied in fields such as regional development [60], envi- ronmental management [52], and sustainability assessment [61]. The model first calculates the coupling degree to measure the intensity and closeness of interactions between systems. Based on this, the coordination degree is further computed to assess whether the systems can achieve harmonious development. In this study, the coupling coordination model is employed to quantitatively evaluate the interaction strength and mutual influence between the two systems of sports tourism and ecological civilization in the YRB. By calculating the coupling degree, the model reveals the interdependence and dynamic relationships between sports tourism and ecological civilization. Furthermore, the coordination degree is evaluated to determine whether these two systems can achieve coordinated development. This assessment is particularly signifi- cant in the YRB, an ecologically sensitive region with urgent economic development needs, where fostering sports tourism must be balanced with the protection and advancement of ecological civilization. The coupling coordination model is established as follows. Here, C represents the coupling degree; T is the comprehensive coordination index; D is the coupling coordination degree; n is the number of subsystems, and Ui is the comprehensive score of subsystem i, ranging from [0, 1], which represents the standardized result. The C value also ranges, [0, 1]; the larger the C value, the smaller the degree of subsystem dispersion and the higher the coupling degree. Conversely, the lower the coupling degree, the greater the dispersion between the subsystems. αi represents the weight of the ith subsystem, typically assigned equal weights. Since this study focused on the two systems of ecological civilization and sports tourism, αi was set to 0.5.",
    "The evaluation standard for the coupling coordination degree used in this study is based on Wang et al. [62], as listed in Table 3. The obstacle degree model is an analytical method used to evaluate and diagnose the key obstacles that hinder achievement of system goals [7]. By quantifying the extent to which each evaluation indicator obstructs goal attainment, the model helps decision-makers identify and prioritize the issues that have the greatest impact on achieving objectives. The obstacle degree model has been widely applied across various fields, such as water resource balance [63], ecological assessment [64], low-carbon development [65], and land use [66]. This study employs the obstacle degree model to systematically analyze and identify the key barriers to the coordinated development of sports tourism and ecological civiliza- tion. The model provides in-depth insights into the primary factors hindering the effective integration and development of sports tourism and ecological civilization in the YRB. By quantitatively assessing the influence of each obstacle factor, the obstacle degree model offers scientific decision-making support for policymakers and stakeholders. This enables the formulation of targeted strategies and measures aimed at mitigating or eliminating these barriers, thereby promoting the harmonious development of sports tourism and ecological civilization. Based on Equations (1) and (4), the standardized matrix X of the raw data and indicator weights F were obtained using the entropy weight method. The indicator deviation I, which represents the gap between the actual value of an indicator and its optimal value, was then calculated. Finally, the obstacle degree O was computed. The data used in this study are derived entirely from officially published statistical yearbooks by the Chinese government. Among these, the ‘China Sports Yearbook’ is available only in printed format and has not been publicly released online. Other statistical yearbooks, however, can be accessed through relevant government websites. Data on sports lottery sales, revenue of sports departments, newly added facility areas, expenditure on sports venues, expenditure on sports competitions, and total annual investment in the sports system were sourced from the ‘China Sports Yearbook’. Data for other sports tourism indicators were obtained from the ‘China Statistical Yearbook’ https://www.stats.gov.cn/sj/ndsj/ (accessed on 22 October 2024) and statistical yearbooks of various provinces. Missing data were filled in using linear interpolation. Detailed data are provided in the Supplementary Materials. Data for the urbanization rate, gross domestic product, investment in industrial pollution control, and forest pest control rate were sourced from the ‘China Statistical Yearbook’ and statistical yearbooks of various provinces, while other ecological civilization indicator data were sourced from the ‘China Environmental Statistical Yearbook’. https: //www.mee.gov.cn/hjzl/sthjzk/sthjtjnb/ (accessed on 20 October 2024). Detailed data are provided in the Supplementary Materials. Microsoft Excel was used to apply the entropy weight method to facilitate analysis of the temporal evolution characteristics of sports tourism and ecological civilization in various provinces over different years. Comprehensive scores of sports tourism and ecological civilization systems for each province in the YRB were computed and visualized using graphs. The advantage of the entropy weight method lies in its strong objectivity, as it does not require subjective determination of weights. The calculation process is detailed in Equations (1)–(5). As shown in Figure 2, the scores for sports tourism in Qinghai Province reached a peak in 2017 but have since shown a fluctuating downward trend, with a significant decline observed in 2020. In contrast, the scores for ecological civilization have exhibited a stable upward trajectory, particularly after 2016, with steady growth. In Sichuan Province, the scores for sports tourism hit their lowest point in 2016 but demonstrated an overall upward trend, with notable increases in 2019 and 2020. The ecological civilization scores have steadily risen since 2015, showing no significant declines and indicating a continuous growth trend. In Gansu Province, sports tourism scores reached a low in 2016 but have generally increased, with substantial growth observed in 2017 and 2020, although a slight decline occurred in 2021. Similarly, ecological civilization scores have steadily risen since 2015, without any marked decreases, showing sustained growth. In Ningxia Province, sports tourism scores peaked in 2017 but subsequently exhibited a fluctuating trend. Ecological civilization scores have shown steady growth since 2015, despite minor declines in 2017 and 2019, maintaining an overall upward trajectory.",
    "In Inner Mongolia, sports tourism scores peaked in 2018 but then displayed a fluc- tuating downward trend, with a marked decline in 2020. Ecological civilization scores steadily increased from 2015 to 2017 and experienced a slight decline in 2018 but resumed growth from 2019 onward. In Shaanxi Province, sports tourism scores reached a peak in 2019, followed by a significant decline in 2020, and a partial recovery in 2021. Ecological civilization scores hit their lowest point in 2016 but have shown an overall upward trend, with significant growth recorded in 2021. In Shanxi Province, sports tourism scores peaked in 2019, experienced a substantial decline in 2020, and showed a slight recovery in 2021. Ecological civilization scores have steadily risen since 2015, with minor declines in 2018 and 2020, but the overall trend remains upward. Similarly, in Henan Province, sports tourism scores reached a peak in 2019, declined significantly in 2020, and slightly recovered in 2021. Ecological civilization scores hit a low point in 2016 but have since shown an upward trend. In Shandong Province, sports tourism scores peaked in 2016 and displayed a fluc- tuating trend, with some improvement observed in 2021. Ecological civilization scores have steadily increased since 2015, despite a slight decline in 2019, maintaining an overall upward trajectory. A comparison of data from 2020 and 2021 revealed that the onset of COVID-19 in 2020 had a negligible impact on ecological civilization construction; whereas, the pandemic profoundly affected the sports tourism system, particularly in Qinghai, Inner Mongolia, Shanxi, and Henan provinces. The COVID-19 outbreak severely curtailed people’s desire to travel, resulting in substantial impacts on both the sports and tourism industries. Extensive travel restrictions and quarantine policies directly led to a sharp decline in market demand for sports tourism, with a substantial reduction in tourist numbers [67]. Additionally, numerous international and domestic sporting events were canceled or postponed, fur- ther exacerbating the challenges faced by the sports tourism sector [68]. Moreover, the severe revenue losses have placed many sports tourism enterprises, particularly small-scale businesses, at risk of bankruptcy. The coupling coordination degree was calculated using Microsoft Excel by applying the coupling coordination model and comprehensive scores of the two systems in each province of the YRB. This was performed to assess the coupling coordination level between sports tourism and ecological civilization systems for different years. A visual representa- tion was created using the coupling coordination degrees from various years. In Figure 3, darker colors represent higher degrees of coupling coordination. The calculation process is detailed in Equations (6)–(8). The coupling coordination degree reflects the mutual feedback and connections be- tween subsystems. The dynamic evolution was visualized in Figure 3 by calculating the de- gree of coupling coordination from 2015 to 2021. The coupling coordination between sports tourism and ecological civilization across the nine provinces showed a gradual progression from an imbalanced to a well-coordinated state. Sichuan, Gansu, Shaanxi, and Henan provinces experienced the most significant increases in coupling coordination; whereas, coupling coordination in Qinghai Province and Inner Mongolia showed the least change, although the other provinces demonstrated a clear trend toward gradual improvement. Although the coupling coordination levels among the nine provinces of the YRB remained uneven, there had been considerable improvement compared to that in 2015. All provinces except Qinghai Province and Inner Mongolia had achieved substantial development. Notably, Sichuan and Shaanxi provinces reached a well-coordinated state in 2021, Gansu Province achieved effective coordination in 2020, and Henan Province reached this state in 2019; however, its coordination level subsequently declined, likely due to the impact of COVID-19. To better understand recent obstacles limiting the development of sports tourism and ecological civilization in the YRB, an obstacle degree analysis was conducted using 2021 data, with calculations performed in Microsoft Excel using the obstacle degree model. The calculation process is detailed in Equations (9) and (10). As shown in Figure 4, obstacles affecting the development of sports tourism in each YRB province in 2021 varied; however, certain patterns were evident. Except for Shaanxi Province, sports competition expenditure (X10) was the greatest obstacle for the remaining eight provinces. Additionally, sports department revenue (X2), the number of employees in the tourism industry (X6), and total annual investment in the sports system (X11) were key obstacle factors across all provinces.",
    "At the provincial level, Qinghai Province showed relatively balanced indicators, with- out any significantly high obstacle factors. In Sichuan Province, the combined influence of sports competition expenditure (X10) and the total annual investment in the sports system (X11) accounted for over 70%. Shandong Province was unique in that passenger transporta- tion volume (X4) constituted 17% of its obstacles, making it the third-highest obstacle factor in the province. Gross domestic tourism revenue (X3), the number of employees in the sports and recreation industry (X5), newly added facility area (X7), and expenditure on sports venues (X9) had the least impact on sports tourism development in the YRB. Overall, the sports department revenue (X2), number of employees in the tourism industry (X6), sports competition expenditure (X10), and total annual investment in the sports system (X11) were the primary obstacles to sports tourism development in the YRB. As shown in Figure 5, ecological civilization construction in the YRB in 2021 was generally stable; however, per capita water resources (Y9) were the most significant obstacle. Research showed that factors ranking high in terms of the obstacle degree across the majority of YRB provinces were the number of public transportation operating vehicles (Y2), investment in industrial pollution control (Y7), and soil and water conservation areas (Y12). At the provincial level, Shandong Province had seven indicators with an obstacle degree of zero, indicating no significant impact from these factors. Consequently, the proportion of per capita water resources (Y9) and the area of soil and water conservation (Y12) were unusually high in Shandong Province. Conversely, the urbanization rate (Y1), total afforestation area (Y10), and forest pest control rate (Y11) had the least impact on ecological civilization construction in the YRB. The ongoing advancement of ecological civilization construction in the YRB can be primarily attributed to its emphasis at the national strategic level. The Chinese govern- ment has integrated ecological protection and high-quality development of the YRB into its national strategy [69], reflecting the significant attention devoted to this issue. The implementation of ecological protection projects has also been crucial [70]. For instance, large-scale conservation and restoration initiatives have been undertaken in key ecological regions, such as the Sanjiangyuan and Qilian Mountains, effectively improving the local ecological environment. Moreover, strengthening institutional development is equally important. The YRB has improved the systematization and modernization of ecological governance through the establishment of mechanisms such as the natural resource asset audit system for outgoing officials and the ecological environment damage compensation system [71]. In addition, inter-provincial cooperation on ecological protection within the YRB has been strengthened, with collaborative efforts in key ecological functional areas The Sichuan, Gansu, and Shaanxi provinces experienced the largest increases in com- prehensive scores for sports tourism. As a major province in the southwest, Sichuan Province introduced 10 policies to support the construction and development of sports ser- vice complexes, encouraging the integration of sports elements into commercial complexes, utilizing rooftops and indoor public areas for sports facilities, and providing subsidies for projects that cover a wide range of participants and have significant social benefits. In its ecological civilization development plan, Sichuan Province also emphasized the potential of sports tourism, encouraging the growth of the sports tourism industry as a key driver of regional economic development and environmental protection. As an important province along the Silk Road, Gansu Province implemented the “Four- in-One” enhancement project for the Gansu Silk Road Sports Fitness Corridor, supporting cities (prefectures) in the construction of public sports stadiums, sports halls, swimming pools, and fitness centers, as well as strengthening the construction of sports parks, fitness trails, and smart fitness centers. Furthermore, Gansu Province developed four major industrial belts and implemented the “Sports+” strategy to promote sports consumption and foster new drivers of economic growth. As a key province in the western region, Shaanxi Province has vigorously imple- mented an initiative to address shortcomings in sports facility infrastructure, continuously promoting the opening of sports facilities at government offices, enterprises, institutions, and schools to the public. Shaanxi Province also launched a campaign to brand mass sports events, building a system of public sports competitions led by the National Fitness Games, supported by provincial-level events, and based on community sports events. Inner Mongolia, Qinghai Shanxi, and Henan provinces should work swiftly to mit- igate the impact of COVID-19 by leveraging their natural resources to develop sports tourism products with regional characteristics [73]. Additionally, these provinces should utilize internet and mobile platforms for online marketing to create “internet-famous” sports tourism and sports event destinations, thereby attracting tourists and promoting the development of the local sports economy.",
    "The coupled coordination degree between sports tourism and ecological civilization in the YRB, as a critical ecological barrier and economic development region in China [74], showed an overall upward trend. By 2021, Sichuan and Shaanxi provinces achieved a well-coordinated state, while Gansu and Henan provinces reached this state in 2020 and 2019, respectively. This improvement was closely linked to the implementation of local environmental protection measures and the development of the sports industry. Sichuan Province boasts abundant sports tourism resources [75]. During the 2023 China Sports Tourism Top 10 Boutique Projects Award Ceremony, Sichuan Province received 9 boutique sports project awards, including 3 of the top 10 projects, the highest among the YRB provinces. Shaanxi Province, with its rich historical landscape and cultural heritage, attracts numerous tourists. In recent years, Shaanxi Province has leveraged national policies to launch a series of well-known sporting events, which has driven the upgrade of its sports industry structure [76]. These boutique sports tourism projects, premium routes, and sports events held in natural landscapes have contributed to the increasing coupling coordination between sports tourism and ecological civilization. In contrast, Qinghai Province and Inner Mongolia had lower coupling coordination degrees and the slowest growth. These two provinces should capitalize on national policies, implement environmental protection principles [77], and actively host sporting events [78] to improve their coupling coordination levels. The Chinese government has proposed the “Ecological Protection and High-Quality Development of the Yellow River Basin” strategy, with a core focus on ecological priority and green development, providing clear policy support and direction for the coupling of sports tourism and ecological civilization. The implementation of this strategy signifies that ecological protection will be the primary consideration in development plans in the YRB while offering new perspectives and opportunities for the development of sports tourism. Building on this, the government issued policies such as the “14th Five-Year Plan for Tourism Development”. These policies not only encourage the integration of sports tourism and ecological civilization but also provide financial support and tax incentives, ensuring strong support for the construction of related projects and infrastructure [79]. The implementation of these policy measures helps combine sports tourism projects with ecological civilization initiatives, promoting green transformation and upgrading the sports tourism industry, while also providing additional resources and opportunities for its development. The demand for sports tourism is increasing with improvements in living standards and growing health awareness. To meet this market demand, enterprises are actively developing eco-friendly sports tourism products [80]. Through technological and model innovation (e.g., smart and green tourism), companies are improving the quality and efficiency of sports tourism while reducing its negative environmental impact. These innovations include not only the development of new technologies but also the innovative application of existing technologies, which are integral components of business model innovation of enterprises. In conclusion, coupling and coordinating the development of sports tourism and ecological civilization in the YRB is a complex process that requires joint efforts from the government, enterprises, and the public. Through proper planning and management, sports tourism can contribute to local economic development while significantly contributing to the construction of an ecological civilization. Government spending on sports competitions is a major factor influencing the de- velopment of sports tourism in the YRB. Government expenditures in this area play a crucial role in promoting sports tourism development in several ways [81]. First, spending is directly linked to the construction and improvement in sports infrastructure. Quality sports infrastructure is an essential foundation for attracting sports enthusiasts and tourists to participate in sports activities, thereby driving sports tourism. By investing in sports venues, fitness trails, and sports parks, the government not only provides the public with spaces to engage in sports but also creates the necessary conditions for the development of sports tourism. Second, government expenditure on sports competitions also stimulates local eco- nomic development. Hosting various sporting events not only enhances the visibility and appeal of cities but also attracts sponsors and tourists, which in turn promotes the development of related industries such as tourism, catering, and accommodation [82]. The economic benefits generated from these events help local governments generate rev- enue, enabling further investments in sports and other social programs, thereby creating a positive cycle. Moreover, beyond economic gains, government spending on sports competitions also considers social benefits. By organizing sports events, the government promotes nationwide fitness and improves public health. Sports competitions also serve as important In addition, the development of sports tourism in the YRB requires collaborative efforts among provinces along the Yellow River [83]. Government expenditures on sports competitions can serve as a key tool for coordinating regional interests and fostering co- operation. By jointly hosting sports events, provinces and regions can share resources, coordinate development strategies, and achieve coordinated regional development, ul- timately enhancing the overall competitiveness and attractiveness of sports tourism in the YRB.",
    "Per capita, water resources were a key factor influencing the construction of an eco- logical civilization in the YRB. This is consistent with the findings of Omer et al. [84]. The development of an ecological civilization in the YRB is a comprehensive and complex task, with rational use and protection of water resources at its core. Due to the scarcity of water resources, sustainable development of this region largely depends on strict management and the protection of these resources [85]. Water resources are a fundamental element of natural ecosystems and crucial to the construction of an ecological civilization in the YRB. Water resources not only support various uses such as agriculture [86], industry, and domestic consumption but are also es- sential for maintaining the health of natural ecosystems such as rivers, lakes, and wetlands. The scarcity of water resources in the YRB necessitates strict management and protective measures, including total water resource control and quota management to ensure equi- table allocation and rational use. Simultaneously, efforts must be made to protect water resources, prevent water pollution, and mitigate damage to aquatic ecosystems to maintain ecological balance and health [87]. Given the shortage of water resources, promoting conservation and efficient use of water has become the primary governance goal of the YRB [88]. This involves driving water-saving initiatives across society at the policy level, improving water-use efficiency, promoting water-saving technologies and equipment, and optimizing industrial structures. These measures can reduce overreliance on water resources and shift from extensive to efficient and intensive water-use practices. Additionally, the scarcity of water resources constrains the implementation of ecological restoration projects such as soil and water conservation, wetland protection, and aquatic ecosystem restoration. These projects are vital for ecosystem restoration and preservation in the YRB; however, their successful execution requires adequate water resources [89]. Therefore, it is essential to scientifically plan and implement ecological restoration projects based on rational use and protection of water resources to ensure the long-term health and sustainable development of regional ecosystems [90]. The findings of this study contribute to the theoretical understanding of the interplay between sports tourism and ecological civilization within the context of the YRB. By quan- tifying the development levels and coupling coordination between these two domains, this research enriches the existing body of knowledge on sustainable development practices. The identification of key obstacle factors provides a basis for further theoretical develop- ment in the field of environmental management and sustainable tourism. Additionally, the study’s application of the entropy weight method and coupling coordination model offers a robust analytical framework that can be adopted in other geographical contexts, thereby enhancing the methodological tools available to researchers in the field. From a practical perspective, the study offers valuable insights for policymakers and stakeholders in the YRB. The positive upward trend in both sports tourism and ecological civilization indicates that current efforts are yielding positive results. However, the signifi- cant impact of the COVID-19 pandemic on sports tourism highlights the need for resilience strategies within the industry. Policy recommendations include strengthening environ- mental protection regulations, investing in sports tourism infrastructure, and enhancing top-level plans to ensure a balance between economic growth and ecological preservation. The research findings have direct implications for policy formulation in the YRB. The government’s role in spending on sports competitions emerges as a critical factor, highlighting the importance of public investment in sports tourism. Moreover, the study points to the scarcity of per capita water resources as a primary obstacle to ecological civilization construction, emphasizing the need for integrated water resource management. Policymakers are advised to take these findings into consideration when crafting regional development plans that aim to harmonize economic, social, and environmental goals. This study involved an in-depth exploration of the interactive relationship and co- ordinated development between sports tourism and ecological civilization in the YRB. By constructing indicator systems for both sports tourism and ecological civilization and applying the entropy weight method and coupling coordination model, a quantitative analysis was conducted on the development of sports tourism and ecological civilization in each province of the YRB. The findings revealed that both sports tourism and ecologi- cal civilization construction in the YRB were on an upward trajectory, with outstanding performances in Sichuan, Gansu, and Shaanxi provinces. However, the COVID-19 pan- demic significantly impacted the sports tourism system [91], whereas ecological civilization construction remained relatively stable. The coupling coordination model indicated that the most noticeable improvements took place in Sichuan, Gansu, Shaanxi, and Henan provinces; whereas Qinghai Province and Inner Mongolia showed the least change. Gov- ernment spending on sports competitions was identified as the key factor influencing the development of sports tourism in the YRB, and per capita, water resources were the primary factor impacting ecological civilization construction.",
    "To promote the coordinated development of sports tourism and ecological civilization in the YRB, the government must adopt a series of comprehensive measures. First, environ- mental protection regulations should be strengthened [92]. The government must develop and enforce stricter environmental protection laws to ensure that sports tourism activities do not harm the ecological environment of the YRB. Second, the government should invest in the construction of sports tourism facilities and provide the necessary infrastructure for the development of the sports tourism industry [93]. Third, a win-win situation for both economic and ecological benefits can be achieved by enhancing top-level design and optimizing resource allocation [94]. Additionally, the government should strengthen the supervision of sports tourism service quality [95] and promote the standardization, branding, digitalization, and intelligent development of sports tourism services. Furthermore, it is essential to continue introducing sports tourism boutique projects and events that reflect local characteristics [96]. The YRB provinces should be encouraged to collaborate in jointly hosting sporting events, sharing resources, and coordinating de- velopment strategies to achieve coordinated regional development to enhance the overall competitiveness and attractiveness of sports tourism in the YRB. Active water-saving initiatives should be implemented for efficient water resource management, including promoting water conservation, improving water-use efficiency, advancing water-saving technologies and equipment, and optimizing industrial structures [90]. Lastly, scientific planning of ecological restoration [97] projects is crucial for maintaining ecosystem health and sustainable development, which must be based on the rational use and protection of water resources [84]. The implementation of these measures will promote the harmo- nious coexistence of sports tourism and ecological civilization in the YRB, facilitating the sustainable development of sports tourism. Although this study provides meaningful perspectives and empirical data, it had certain limitations. This study offers insights into the coordinated development of sports tourism and ecological civilization in the YRB; however, it did not fully address the differ- entiated development of individual provinces. Future research should focus on (1) further optimizing the indicator system through interdisciplinary research; (2) conducting com- parative studies with other regions to identify differences and lessons that can be learned, and (3) exploring potential conflicts or trade-offs between sports tourism development and ecological preservation. How can these be managed or mitigated? (4) Conducting inter- views or surveys with local stakeholders can validate the development of sports tourism and ecological civilization from multiple perspectives, thereby supplementing the findings of the quantitative analysis. Author Contributions: Conceptualization, J.H.; methodology, F.Z.; software, F.Z.; validation, J.H.; formal analysis, J.H.; investigation, F.Z.; resources, F.Z.; data curation, F.Z.; writing—original draft preparation, F.Z.; writing—review and editing, J.H.; visualization, F.Z.; supervision, J.H.; project administration, J.H. All authors have read and agreed to the published version of the manuscript. Data Availability Statement: The original contributions presented in this study are included in the article/Supplementary Materials. Further inquiries can be directed to the corresponding author."
]