[
    "Abstract: This study examines the key factors influencing e-bike adoption and explores how ad- vancing e-bike usage in Henan Province, China, can foster sustainable urban transportation and contribute to urban environmental preservation. Utilizing data from an online survey, binary logistic regression analyzes the impact of socio-demographic characteristics, perceived advantages, neighbor- hood environmental attributes, and vehicle ownership on e-bike usage. The findings indicate that socio-demographic factors, such as family size and occupation, significantly influence adoption, with workmen more likely than office workers to choose e-bikes. Cost savings emerged as the primary motivator for e-bike use, overshadowing environmental concerns, which unexpectedly negatively affected usage patterns. However, the presence of supportive infrastructure—particularly charging stations and dedicated lanes—proves crucial for promoting e-bike usage, highlighting the importance of accessible, environmentally supportive urban design. Vehicle ownership characteristics further illuminate how access to e-bikes correlates with regular usage. These findings suggest that, beyond cost efficiency, targeted awareness campaigns and strategic infrastructure improvements are essential for embedding e-bikes into sustainable urban transport systems. By fostering adoption and support- ing e-bike infrastructure, cities can significantly reduce urban pollution, improve air quality, and advance toward sustainable mobility goals in Henan Province and beyond. Citation: Zhang, X.; Lim, E.S.; Chen, M. Promoting Sustainable Urban Mobility: Factors Influencing E-Bike Adoption in Henan Province, China. Sustainability 2024, 16, 10136. https://doi.org/10.3390/ su162210136 Copyright: © 2024 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). Sustainability has long been recognized as a critical concept, and the international community continues to place significant emphasis on its importance in addressing global challenges. Sustainability-focused institutions, such as the United Nations, are committed to advancing global economic and environmental sustainability goals [1]. The Environmen- tal Performance Index (EPI), developed by Yale University and Columbia University, serves as a valuable tool for assessing a country or region’s ability to maintain favorable environ- mental conditions for future generations [2]. In the 2024 EPI, which evaluates 180 countries using 58 indicators across 11 issue categories—covering climate change mitigation, air pollution, waste management, fisheries and agricultural sustainability, deforestation, and biodiversity protection—China ranks 154th [3]. This relatively low ranking highlights sig- nificant challenges in key environmental performance areas. Specifically, China ranks 168th out of 180 countries in the air quality category, which assesses the environmental impacts of air pollution [4]. This critical ranking underscores the severe challenges China faces in managing air quality. Additionally, the May 2024 national air quality report revealed that 10 out of the 20 lowest-ranked cities for air quality, among 168 key cities, were located in Henan Province, accounting for 50% of the bottom rankings [5]. This high concentration The escalating emissions from China’s public transportation sector have intensified environmental concerns, prompting the need for sustainable alternatives. Among these, electric bikes (e-bikes) have emerged as an effective solution, helping to alleviate traffic congestion, enhance environmental quality, and promote public health [6–8]. When com- pared to motorcycles and automobiles, e-bikes generate substantially fewer pollutants per kilometer, with emissions reduced by several magnitudes [9]. Moreover, e-bikes demon- strate superior energy efficiency compared to most other modes of transportation, with the exception of traditional bicycles [10], contributing to a significantly lower environmental health impact [11]. Beyond their environmental benefits, e-bikes provide notable health ad- vantages, emitting considerably less carbon dioxide than cars over equivalent distances [12]. This makes e-bikes a promising approach for mitigating greenhouse gas emissions within regional passenger transport systems [13]. Renowned for their low carbon emissions and health-enhancing features, e-bikes play a pivotal role in improving urban air quality and offer a sustainable, active mode of transportation [14–17]. The growing adoption of e-bikes is playing a pivotal role in transforming transporta- tion patterns across China [18]. In several cities, the suspension of new motorcycle license issuance, alongside bans on motorcycles and scooters in key areas, has fueled the expansion of the e-bike market [19]. Users of e-bikes undertake significantly more trips compared to traditional bicycle users [20]. In recent years, e-bikes have increasingly replaced buses, cars/taxis, and bicycles as the preferred mode of transportation [21,22]. China leads glob- ally in both e-bike production capacity and market demand [23], with over one-third of consumers (34%) participating in the e-bike market [24]. In 2022, Henan Province had 45 million e-bikes, ranking second nationwide, closely behind Shandong Province. Additionally, Henan ranked second in e-bike ownership per 100 households, following Jiangsu Province [25]. The widespread adoption of e-bikes in Henan underscores their vital role in promoting environmental sustainability, positioning e-bikes as key contributors to sustainable urban transport and significant improvements in air quality.",
    "This study is conducted within the geographical context of Henan Province, which holds one of the highest e-bike ownership rates and ranks among the top pollution levels in China. The findings, however, extend beyond the boundaries of Henan and offer valuable insights applicable to other cities in China and beyond. With many urban areas across China facing similar environmental challenges, such as air pollution and traffic congestion, the strategies and policy recommendations outlined in this research can serve as a reference for promoting e-bike adoption on a national scale. Furthermore, the implications of this study are not limited to China; cities worldwide grappling with the dual challenges of environmental sustainability and urban mobility can also draw on these findings to accelerate the development of e-bikes as a cleaner and more efficient transportation option. Unlike many previous studies that primarily focus on socio-demographic factors, our research adopts a comprehensive multi-dimensional framework. This framework considers a broader range of influences, including perceived benefits, neighborhood infrastructure, and vehicle ownership characteristics. Notably, cost savings—a factor often overlooked in prior studies—are highlighted as a crucial driver of e-bike adoption. Furthermore, we emphasize the critical role of supportive infrastructure and its importance for cities in China seeking to build sustainable transportation systems. By exploring these key factors, this study aims to expand the existing knowledge base and provide actionable insights for policy recommendations. We hope this further clarifies the contributions of our research in filling these important gaps. Specifically, it seeks to address the following two research questions: To understand the circumstances under which e-bike users choose to ride, a survey was conducted with respondents aged 16 and older residing in Henan Province, China. The primary objective is to identify the factors influencing individuals’ decisions to use e-bikes in Henan. A bivariate analysis will be applied to address the first research question, while an econometric analysis will be employed to resolve the second. The rest of the structure of this paper is as follows: Section 2 reviews the relevant literature. Section 3 outlines the proposed models and data used in the analysis. The statistical results are presented in Section 4. Lastly, Section 5 offers a summary of the key findings and conclusions. Previous studies have examined a wide range of factors influencing e-bike usage, with Table 1 providing a summary of representative studies focused on e-bike or bicycle adoption. This table outlines key information regarding the study sample, location, method of analysis, and the aims of each study. Figure 1 delves deeper into specific influencing factors, including socio-demographic characteristics, the perceived advantages of e-bikes, neighborhood environment attributes, and vehicle ownership characteristics. Various survey methodologies have been employed to collect data on the popularity and usage patterns of e-bikes. However, there remain notable gaps in the specific motivations and research methods of distinct user groups across different geographic contexts. In Nanjing, two distinct studies have examined factors influencing e-bike usage. One study, based on 1053 surveys from both e-bike users and non-users, evaluated the relationship between transport mode choice and the motives behind e-bike adoption [23]. Another study assessed the role of environmental awareness in the commuting mode choices of 1729 e-bike users in Nanjing [26]. In smaller cities, research in Ganyu County, China, analyzed 1800 questionnaires from educational institutions to assess how the built environment influences commuting mode choices [27]. Meanwhile, a study conducted in Shaoguan used logistic regression to analyze 441 face-to-face questionnaires, offering deeper insights into factors affecting the adoption of shared e-bike services [28]. These four studies highlight specific factors impacting e-bike users in China. Additionally, a nationwide study in 2022 utilized snowball sampling techniques to collect data from 507 e-bike riders, identifying key determinants influencing the adoption of e-bikes across China [1]. Multiple international studies have also investigated the factors influencing e-bike use across various regions. Notably, some studies employed logit models to explore key determinants [29,30], while others utilized descriptive analysis to profile user characteristics and mobility patterns [22]. Additionally, some research relied on historical data or meta- analytical approaches to assess e-bike ridership and mode substitution effects [6,31]. Numerous studies have investigated the socio-demographic characteristics influencing e-bike usage, focusing on gender, age, occupation, education, income, and family size. In terms of gender, findings have been somewhat inconsistent. Most research indicates that e-bike users are relatively evenly distributed between genders, with studies reporting a nearly 50% split between male and female riders [20–23]. However, some studies suggest a higher likelihood of e-bike usage among males compared to females [26,28,32], while fewer studies have reported that females are more inclined to use e-bikes [27]. With respect to age, e-bike users are typically younger adults, with most studies indicating that the majority of riders are under 40 years old [21,23,26,28]. However, some research has highlighted the popularity of e-bikes among middle-aged individuals, particularly those aged 41 to 60 [22,33]. In comparison to traditional cyclists, e-bike users tend to be older, with an average age difference of several years [32,34].",
    "Regarding occupation, many studies have found that as economies develop, e-bikes have become steadily adopted among the working class. E-bike users are predominantly young commuters, especially office workers [21,23,28]. Non-income earners, such as students, are also noted to be frequent e-bike riders [29]. When it comes to education, many e-bike users possess a college degree or higher [21,23,26,28,32] and have higher educational attainment compared to traditional bicycle users [20]. However, one study found that those without a college degree are more likely to ride e-bikes [27]. In terms of income, some studies indicate a prevalence among low-income individuals [21,27], while others report a higher concentration of middle-class and upper-middle-class users [22,23,26,28]. Notably, e-bike users generally exhibit higher household income levels compared to non-users [32]. Lastly, in terms of family size, e-bike usage is associated with smaller family sizes, particularly among families with one to two members [32]. The average family size of e-bike users is often reported as around 3.7 people, including both working adults and children [21]. of use, convenience, safety, time savings, cost savings, and environmental friendliness. Ease of use is a key factor driving e-bike adoption; e-bikes significantly reduce physical effort, making them a preferred option over traditional bicycles [23]. The electric assistance allows users to travel longer distances with less exertion, which is particularly appealing for commuting and daily transportation needs [28,33]. Some studies, however, suggest that the reduction in physical activity might negatively impact health due to the diminished physical exertion required [34]. Convenience also plays a critical role in the widespread use of e-bikes. Time savings and high accessibility are key factors driving the transition from other modes of transportation to e-bikes [23,34]. Faster speeds, compared to walking or traditional cycling, are cited as positive factors contributing to the popularity of e-bikes [35]. Due to these advantages, e-bikes are primarily used for commuting [6,27], and their perceived utility helps reduce traffic congestion and improve travel efficiency [28]. Safety is another significant factor for e-bike users. E-bike riders reported a heightened perception of safety associated with e-bikes, regarding them as a superior and more secure alternative to conventional modes of transportation [34]. This perception is likely influenced by the ability of e-bikes to offer greater control, reduced physical exertion, and consistent speed management, all of which contribute to a sense of stability and confidence while navigating complex urban traffic environments. However, concerns persist regarding accidents at intersections, poor lighting, and adverse weather conditions [22,30]. Recent technological advancements, such as real-time camera systems, have the potential to enhance safety and further encourage e-bike usage [1]. Cost savings is an essential factor influencing the willingness to adopt e-bikes. The low operational and purchasing costs of e-bikes make them an attractive and affordable transportation option. Cost savings have been consistently cited as one of the most critical factors influencing the decision to adopt e- bikes [1]. The ability to reduce commuting expenses [23], particularly in comparison to private vehicles, positions e-bikes as a cost-effective alternative. Lastly, environmental concerns have increasingly become a focus for e-bike users. E-bike users widely recognize their role in reducing environmental impacts, as they help mitigate climate change, making e-bikes a more eco-friendly and convenient option [23,28]. E-bike adoption also leads to significant fuel savings and emission reductions, promoting sustainable transportation choices [33,34]. Additionally, as the awareness of environmental issues rises, especially among higher-income groups, e-bikes are increasingly seen as a practical way to protect the environment [26]. Multiple studies have examined how neighborhood environment characteristics in- fluence electric bicycle usage, with particular attention to infrastructure and accessibility to subway stations. The availability of adequate cycling infrastructure significantly in- fluences e-bike adoption. Factors such as route coverage, proximity to bike lanes, and station capacity all play crucial roles in encouraging e-bike usage [29,30,33]. A lack of charging points near workplaces and residential areas is noted as a major infrastructure gap, further hindering e-bike adoption [22]. In contrast, rural areas with poor urban cycling infrastructure have seen higher e-bike use due to the absence of dedicated bike lanes [27]. Road density and access to public services are positively correlated with e-bike travel [14]. Accessibility to subway stations also impacts e-bike usage. E-bikes are often used as a first- and last-mile solution for accessing subway stations, with proximity to transport hubs positively influencing the frequency of e-bike trips [20,33]. More connected transport systems, however, are associated with lower household e-bike ownership, indicating that seamless public transport may reduce the need for personal e-bikes [35].",
    "Vehicle ownership characteristics, especially car ownership, play a complex role in shaping e-bike usage. While one might assume that car owners are less likely to adopt e-bikes due to the convenience of motorized transport, studies show that this relationship is more nuanced. Those who own cars are more likely to use e-bikes for specific types of trips, and car owners may still opt to ride e-bikes [32], especially for shorter trips where the e-bike’s flexibility and ease of use offer advantages over driving. However, for longer- distance travel or trips to more remote destinations, the likelihood of choosing a car remains higher. Some studies highlight that car ownership continues to influence the choice of travel mode for trips involving longer distances or multiple destinations, where cars are still seen as the more practical option [6]. This study scrutinizes an array of explanatory variables that may influence e-bike utilization, categorized into four principal groups: socio-demographic characteristics, the perceived advantages of e-bikes, neighborhood environmental attributes, and vehicle ownership characteristics. Participants are delineated into two distinct classifications based on their frequency of e-bike usage: e-bike users, defined as individuals who engage with an e-bike four or more times per week, and non-users, characterized as those who utilize e-bikes less frequently. The analysis encompasses various explanatory variables recognized to impact e-bike adoption. Key socio-demographic factors include gender, age, education, occupation, in- come, and family size, all of which significantly affect individual transportation preferences. Moreover, the study integrates perceptual variables related to e-bike usage, such as ease of use, convenience, safety, cost efficiency, and environmental sustainability, which reflect respondents’ attitudes toward the merits of e-bikes. Furthermore, the investigation delves into infrastructure-related factors, emphasizing the availability of dedicated e-bike lanes and charging stations, as well as the proximity of these amenities to users. The analysis also contemplates car ownership and accessibility to public transportation, particularly subway stations, to account for alternative mobility options that may curtail e-bike adoption. The anticipated signs of the coefficients are guided by theoretical postulations, with most factors posited to exert a positive influence on e-bike usage, except for car ownership and subway accessibility, which are expected to yield a negative impact on the propensity to adopt e-bikes. The analysis in this study is based on primary data collected through an online survey conducted in April 2023. The use of online surveys allowed for efficient data collection and processing. Additionally, a convenience sampling method was employed due to its affordability, speed, and ease of application in online environments [36]. The survey consisted of three main sections. The first section, ‘Respondent’s Profile’, focused on analyzing the socio-demographic characteristics of e-bike users and the influence of vehicle ownership characteristics, including the effects of fuel and electric car ownership on e-bike usage. The second section, ‘Usage of e-bike and the neighborhood/workplace environment’, examined the influence of neighborhood environment attributes on e-bike usage. Specific infrastructure factors such as parking availability, charging stations, dedicated lanes, and road conditions near the respondents’ homes or workplaces were analyzed in detail. The third section, ‘The Perceived Advantages of E-bikes’, required respondents to rate their agreement with various statements using a Likert scale ranging from 1 (strongly disagree) to 5 (strongly agree). The statements covered topics such as ease of use, convenience, safety, cost savings, and environmental impact. The questionnaire was developed using Questionnaire Star 2.0.75 and distributed via social media platforms including WeChat, Weibo, and Little Red Book, targeting relevant groups in Henan Province. A total of 449 responses were collected. To ensure the validity of the data, two screening questions regarding residency and age were included, restricting the sample to individuals aged 16 and above residing in Henan Province. After excluding 46 responses that did not meet these criteria, 403 responses were retained for analysis. The data were analyzed with Stata version 17, employing the software to conduct descriptive statistics and implement the econometric model. The logit model is often used to model an individual’s decision to use an e-bike [23,30,31]. Therefore, this study also adopted a logit model to identify factors that affect an individual’s decision to use an e-bike. In the empirical model, the dependent variable is a binary variable that would take the value of one if the respondent reported using an e-bike within the last three months, and zero otherwise. The general specification of the logit model is expressed as follows: where Pi = the probability of using an e-bike, (1 − Pi) = the probability of not using an e-bike, Xi = the explanatory variables that affect the likelihood of using an e-bike, and βi = the coefficients for the explanatory variables; ln ( Pi ) represents the log of odds of the probability 1−Pi of using an e-bike to the probability of not using an e-bike.",
    "The Likelihood-Ratio (LR) test is employed to evaluate the comparative goodness-of-fit betweentwocompetingmodels: thenullmodelandthealternativemodel[37]. Specifically, the test assesses whether the inclusion of additional predictors significantly improves the model’s fit. The null hypothesis (H0) posits that all coefficients are equal to zero (β1 = β2 = ... = βi = 0), suggesting that none of the explanatory variables have a significant effect on the outcome. Conversely, the alternative hypothesis (H1) asserts that at least one of the coefficients is not equal to zero (β1 ̸= β2 ̸= ... ̸= βi ̸= 0), indicating that the inclusion of one or more variables provides a statistically significant improvement in the model’s fit. This test is particularly relevant for examining the factors influencing e-bike usage, as it allows for the evaluation of whether key socio-demographic characteristics, the perceived advantages of e- bikes, neighborhood environment attributes, and vehicle ownership characteristics contribute meaningfully to the likelihood of adopting e-bikes. By comparing the log-likelihoods of the null and alternative models, the LR test helps determine whether the model incorporating these variables offers a better explanation of e-bike usage behavior. The estimated model is evaluated for accuracy in correctly classifying its observa- tions [38]. The correct classification was obtained when the predicted probability is less than or equal to the cut-off and the observed outcome is ‘non-e-bike users’ (coded as 0), or when the predicted probability is higher than the cut-off and the observed outcome is ‘frequent e-bike users’ (coded as 1). The Hosmer–Lemeshow test represents a vital statistical method for evaluating the goodness of fit of logistic regression models [39], with significant applicability in the study of e-bike usage [40,41]. This test examines the alignment between observed event rates and expected event rates across various subgroups within the model population. The null hypothesis (H0) posits that the model adequately fits the data at an acceptable level, while the alternative hypothesis (H1) contends that the model does not precisely fit the data. By applying this test, researchers can ascertain the robustness of their logistic regression model, ensuring that it effectively captures the dynamics influencing e-bike adoption and usage patterns. The demographic profile of the respondents is detailed in Table 2, which provides an overview of the key socio-demographic characteristics of the 403 participants in this study. The sample is composed of 46.15% male and 53.85% female respondents. Among e-bike users, the gender distribution is relatively balanced, with males comprising 48.17% and females 51.83%, suggesting no significant gender disparity in e-bike adoption. In terms of age distribution, the largest proportion of respondents falls within the 30–39 age group (45.66%), followed by those aged 16–29 (40.69%), while only 13.65% are 40 years or older. Family-size data reveals that the majority of respondents (61.04%) reside in households consisting of three to four members, while smaller households (1–2 members) account for 15.63%, and larger households (5 or more) make up 23.33%. Occupation is another significant variable, with most respondents (59.06%) working in office jobs, followed by workmen (23.08%) and students (17.87%). Educational attainment shows that nearly half of the respondents (49.38%) have a level of education below college, 29.28% hold a college degree, and 21.34% possess a bachelor’s degree or higher. Personal monthly income is fairly evenly distributed, with 34.74% earning less than RMB 2500, 34.99% earning between RMB 2500 and RMB 5000, and 30.27% earning RMB 5000 or more. The descriptive analysis further identifies significant variations between e-bike users and non-users. Males represent a slightly lower proportion of e-bike users (48.17%), though the overall gender distribution among users and non-users remains balanced. Age-wise, the largest share of e-bike users is concentrated in the 30–39 age group (45.03%), followed by those aged 16–29 (40.31%), indicating that younger and middle-aged individuals are more likely to adopt e-bikes. Household size also appears to influence e-bike usage, with smaller households (1–2 members) showing a higher percentage of users (18.32%) compared to non-users (13.21%). Notably, occupation and education show distinct trends, as office workers and those with a college-level education or higher are more likely to use e-bikes, suggesting that higher education and professional employment may facilitate e-bike adoption. Interestingly, income distribution reveals little variation between users and non-users, indicating that personal income may not be a significant barrier to e-bike usage within the surveyed population.",
    "The results of the binary logistic regression are presented in Table 3. In this regression model, variables are grouped into distinct categories to explain the factors influencing e-bike usage. The first category encompasses socio-demographic characteristics such as gender, age, occupation, education, income, and family size. The second category focuses on the perceived advantages of e-bikes, which include ease of use, convenience, safety, cost savings, and environmental friendliness. The third category examines neighborhood environmental attributes, such as infrastructure for e-bikes and accessibility to subway stations. Lastly, the fourth category addresses vehicle ownership characteristics, covering gas car ownership, electric car ownership, and e-bike ownership. For the sake of brevity, only the significant variables are discussed in detail in this section. Among the socio-demographic characteristics, family size and occupation emerge as key determinants. Specifically, individuals from medium households (3–4 members) are significantly less likely to use e-bikes, as indicated by the negative and significant coefficient (−0.703, p < 0.05). Occupation plays a crucial role, with workmen being more inclined to adopt e-bikes compared to office workers (0.654, p < 0.05). Educational attainment also positively affects e-bike usage, as respondents with a college education exhibit a higher likelihood of e-bike adoption (0.541, p < 0.1), while those with higher degrees do not show a statistically significant difference. Regarding perceived advantages, cost savings is the strongest motivator for e-bike use, with a highly significant positive coefficient (1.155, p < 0.01), suggesting that individuals who prioritize financial benefits are more likely to adopt e-bikes. However, environmen- tal friendliness has a counterintuitive negative impact (−0.665, p < 0.1), indicating that environmental concerns may not be a primary driver in this context. Infrastructure-related variables significantly influence e-bike adoption as well. The availability of charging stations demonstrates a strong positive effect (0.881, p < 0.01), reinforcing the importance of supportive infrastructure in facilitating e-bike usage. Simi- larly, dedicated e-bike lanes (0.497, p < 0.1) positively affect e-bike adoption, underlining the role of safe and accessible cycling infrastructure. However, accessibility to subway stations shows a negative but insignificant relationship with e-bike usage (−0.382), aligning with the expectation that access to alternative modes of public transport may reduce the likelihood of e-bike adoption. E-bike ownership is a highly significant predictor of e-bike usage (1.027, p < 0.01), suggesting that once individuals have access to e-bikes, they are more likely to use them regularly. Conversely, gas car ownership exerts a negative but insignificant effect (−0.264), indicating a potential, though not decisive, deterrent to e-bike adoption. Table 4 presents the results of the Likelihood-Ratio (LR) test, which reveals a statistically significant chi-square value (χ2(25) = 87.84, p < 0.0000). This finding leads to the rejection of the null hypothesis, confirming that the inclusion of a range of predictors—including socio- demographic characteristics, the perceived benefits of e-bikes, neighborhood attributes, and vehicle ownership—significantly enhances the likelihood of e-bike adoption. These results underscore the essential role that these factors play in shaping e-bike usage behavior. In the Expectation–Prediction Evaluation, the model achieved a correct classification rate of 68.73%, indicating a satisfactory level of accuracy in predicting e-bike usage. However, the moderate sensitivity (64.92%) and specificity (72.17%) highlight the potential for further refinement of the model to enhance its predictive capabilities. The model’s fit was further evaluated using the Hosmer–Lemeshow test, where the null hypothesis (H0) posits that the model adequately represents the data, while the alternative hypothesis (H1) suggests otherwise. The Hosmer–Lemeshow chi-square statistic was χ2(8) = 10.99, resulting in a p-value of 0.2025, which exceeds the conventional significance threshold of 0.05. This outcome supports the null hypothesis, indicating that the model fits the data adequately. This study contributes to the growing body of literature on sustainable transporta- tion by examining the key factors influencing e-bike adoption, with a focus on socio- demographic characteristics, perceived advantages, neighborhood environmental attributes, and vehicle ownership. Utilizing data from an online survey, the research employed a binary logistic regression model to conduct an empirical analysis of e-bike usage behav- ior; the findings provide several critical insights into the dynamics shaping e-bike usage, offering implications for both policymakers and urban planners aiming to promote more environmentally friendly and cost-effective modes of transportation. First and foremost, socio-demographic variables, particularly family size and occupa- tion, were found to play a significant role in e-bike adoption. Individuals from medium- sized households (3–4 members) were notably less likely to use e-bikes, perhaps due to logistical constraints or alternative transportation needs within such families. Interest- ingly, workmen demonstrated a higher propensity to adopt e-bikes compared to office workers, possibly due to the greater flexibility and practicality that e-bikes offer for short- to medium-distance commuting in jobs requiring mobility [42]. Moreover, educational attainment also emerged as a significant determinant of e-bike adoption, with respondents holding higher education levels showing a greater willingness to use e-bikes. This suggests that higher educational attainment, possibly due to increased environmental awareness and knowledge of sustainable transport options, may amplify the likelihood of adopting e-bikes across various occupational categories [43]. These findings suggest that targeted campaigns promoting e-bikes could benefit from focusing on specific occupational groups and educational segments to maximize their impact.",
    "The perceived advantages of e-bikes also significantly influenced usage patterns. Cost savings emerged as the strongest motivator, highlighting that financial considerations are a primary driver for e-bike adoption. This aligns with previous research suggesting that affordability and economic efficiency are key factors in the adoption of sustainable transportation modes, particularly in developing regions [44]. However, contrary to ex- pectations, environmental concerns had a negative effect on e-bike usage. This finding suggests that while e-bikes are generally viewed as environmentally friendly, their adoption is not necessarily driven by eco-conscious motives, but rather by practical and financial benefits. This indicates a potential gap in the public’s understanding of the environmental benefits of e-bikes, which could be addressed through more targeted awareness campaigns emphasizing their role in reducing carbon emissions and alleviating urban congestion. Infrastructure-related factors further reinforced the importance of a supportive envi- ronment in facilitating e-bike usage. The availability of charging stations and dedicated e-bike lanes positively influenced e-bike adoption, underscoring the critical role that ac- cessible and well-maintained infrastructure plays in promoting sustainable transportation. Urban planners should prioritize the development of such facilities to encourage greater e-bike use, particularly in densely populated urban areas where congestion and limited parking spaces present significant barriers to car ownership [45]. The insignificant relation- ship between subway station accessibility and e-bike usage suggests that e-bikes and public transportation may serve complementary roles rather than competing ones, particularly in suburban areas where public transportation options may be limited. Therefore, enhancing the integration between e-bike networks and public transport could further improve urban mobility and reduce reliance on private cars [46]. Vehicle ownership characteristics, particularly e-bike ownership itself, proved to be a significant predictor of e-bike usage. This is consistent with the notion that once individuals invest in e-bikes, their likelihood of regularly using them increases. Conversely, gas car ownership had a negative, though statistically insignificant, impact on e-bike usage, suggesting that while car owners may perceive e-bikes as less attractive, they are not entirely dissuaded from adopting this mode of transportation. This finding is crucial for policymakers aiming to shift urban mobility patterns away from car dependency. Incentives that lower the barriers to e-bike ownership, such as subsidies, tax reductions, or loan schemes, could be particularly effective in accelerating the transition toward more sustainable transportation systems [47]. In conclusion, the findings of this study suggest that while socio-demographic char- acteristics and practical advantages like cost savings are key drivers of e-bike adoption, infrastructural improvements and targeted awareness campaigns could further accelerate the shift towards sustainable transportation. The study also reveals that despite the po- tential of e-bikes to contribute to environmental sustainability, they are primarily adopted for their financial and practical benefits rather than for eco-conscious reasons. This un- derscores the need for more comprehensive policies that not only improve the practical aspects of e-bike usage, such as infrastructure, but also foster a greater understanding of their environmental benefits. In Henan Province, the rapid urbanization and the growing demand for affordable, efficient transportation in urban areas have made electric bikes an especially attractive mobility solution. However, it is important to note that this re- search was limited to Henan Province, and therefore, its conclusions may not be fully generalizable to other regions with different socio-economic or infrastructural contexts. In contrast, rural areas possibly face challenges related to infrastructure development, which hinder the widespread adoption of e-bikes. Additionally, the socio-cultural norms and economic conditions in Henan place a strong emphasis on cost savings, a key factor driving the use of electric bikes. These insights underscore the importance of tailoring policies and infrastructure investments to meet the specific needs of different regions, thereby promoting sustainable urban mobility. As urban areas worldwide continue to grapple with challenges related to traffic congestion, air pollution, and rising transportation costs, e-bikes offer a promising solution that can contribute to more sustainable urban mobility systems. Future research could explore the long-term environmental impacts of widespread e-bike adoption, particularly in terms of reducing carbon emissions and alleviating pressure on urban transportation networks. Moreover, comparative studies across different regions could provide a broader understanding of the factors driving e-bike adoption and inform strategies to adapt these findings to diverse urban and rural contexts. By addressing both practical barriers and informational gaps, policymakers and urban planners can better promote e-bikes as a viable and sustainable transportation option, contributing to broader efforts toward achieving sustainability goals in urban mobility.",
    "Nevertheless, several limitations are inherent to this study. The reliance on online surveys may have introduced a bias, particularly skewing the sample towards younger individuals who are more likely to engage with digital surveys. This potentially overlooks older age groups, who may be less inclined to participate in online research or adopt e-bikes. Furthermore, the data collected were based on self-reported usage, which, while valuable, may not accurately reflect actual e-bike traffic patterns. This discrepancy between declared behavior and real-world use represents a key limitation in capturing the full extent of e-bike adoption. In addition, while the study highlights the practical benefits of e-bikes, it does not fully explore the environmental trade-offs between e-bikes and traditional bicycles, an issue that could influence ecological attitudes and perceptions. Finally, e-bikes, with their narrower lane requirements, offer the potential to free up space for other sustainable transport modes, such as walking and cycling, thus contributing to more efficient urban mobility. This aspect, however, was not thoroughly examined in this study. These limitations highlight valuable directions for future research, including the integration of traffic data to more accurately capture e-bike usage patterns and a more comprehensive evaluation of the factors influencing e-bike adoption. Building on the insights from this study, future research could address several key limitations to provide a more comprehensive understanding of e-bike adoption. First, integrating traffic measurement data alongside survey-based findings would enhance the accuracy of e-bike usage patterns and help validate self-reported behaviors. This calibration could provide a more detailed picture of real-world usage and further inform policy recommendations. Second, to mitigate potential age-related biases in online surveys, future studies should employ a diverse range of data collection methods, such as face-to-face interviews or telephone surveys, to ensure broader demographic representation, particularly among older populations who may be underrepresented in digital surveys. Additionally, while this study focused primarily on the practical benefits of e-bikes, future research should explore the environmental trade-offs between e-bikes and traditional bicycles to better understand the ecological implications of shifting from one mode to the other. Finally, a further exploration of the spatial efficiency of e-bikes, particularly in terms of freeing up space for other sustainable transport modes, such as pedestrians and bicycles, could provide valuable insights into how e-bikes contribute to more sustainable urban mobility systems. Understanding these dynamics will help refine policies aimed at promoting Author Contributions: Conceptualization, X.Z., M.C. and E.S.L.; methodology, X.Z. and M.C.; software, X.Z. and E.S.L.; validation, X.Z. and M.C.; formal analysis, X.Z.; investigation, X.Z. and E.S.L.; resources, X.Z.; data curation, X.Z. and M.C.; writing—original draft preparation, X.Z.; writing—review and editing, M.C.; visualization, X.Z. and M.C.; supervision, M.C. All authors have read and agreed to the published version of the manuscript."
]