[
    "Abstract: Land requisition and resettlement of migrants are two major parts of ﬂood control projects. After a large land area was allocated for ﬂood control projects, livelihood resilience of resettlers became a great challenge. In this paper, Puyang County, Taiqian County, and Fan County, Henan Province, China, are chosen for a household survey. An index system to assess farming house- holds’ livelihood resilience is constructed. After that, regression analysis and variance analysis are adopted to examine inﬂuencing factors of resettlers’ livelihood resilience. Results suggest the following: (1) Livelihood resilience of resettled farming households is on the whole lower than that of non-resettled farming households; (2) Response to policies, family scale, livelihood strategy, and skill training are major inﬂuencing factors of resettled farming households’ livelihood resilience; (3) Compared with other types of farming households, livelihood resilience of farming households with land expropriated is signiﬁcantly different. In order to enhance resettlers’ livelihood resilience, the government should expand the application scope of follow-up support policies of reservoir resettlement, enhance capability construction of resettlement management departments, strengthen support for resettlers’ employment, combine resettlement with rural revitalization strategy, and improve the social security system for ﬂood control project resettlers. Citation: Duan, Y.; Chen, S.; Zeng, Y.; Wang, X. Factors That Inﬂuence the Livelihood Resilience of Flood Control Project Resettlers: Evidence from the Lower Yellow River, China. Sustainability 2023, 15, 2671. https:// doi.org/10.3390/su15032671 The Yellow River is the second longest river in China, extending for 5464 km from the Qinghai–Tibet Plateau to the Bohai Sea by the way of nine provinces, including Qinghai, Sichuan, Gansu, Ningxia, Inner Mongolia, Shaanxi, Shanxi, Henan, and Shandong. Over the past 3000 years or so in the history of the Chinese nation, the Yellow River Basin remains the political, economic, and cultural center of China. Moreover, the Yellow River is also one of the rivers with the highest sediment content and most serious ﬂoods. Since the written record of the Chinese civilization, the Chinese nation has never ceased their ﬁghting with ﬂoods and droughts of the Yellow River. Copyright: © 2023 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). Thanks to unremitting efforts, the Chinese government has established a relatively complete ﬂood control project system. Nevertheless, due to inadequate investment, the Lower Yellow River is still faced with problems, such as low ﬂood control standards for some levee segments and incomplete channel training works. The risk of ﬂoods exceeding the warning line caused by extreme weathers remains. Once the levee of the Lower Yellow River is breached, the lives and property security of the people living on two sides will be seriously jeopardized. To ensure prolonged security of the Yellow River, the Chinese government started the implementation of the “13th Five-Year” ﬂood control project of the Lower Yellow River in 2015. This project covered Henan Province and Shandong Land requisition and resettlement of migrants are two major parts of ﬂood control projects. After a large land area was allocated for ﬂood control projects, livelihood resilience of resettlers became a great challenge. First, the land used for engineering construction caused a direct reduction in the land ownership of farming households, which was not beneﬁcial to their long-term livelihood. Second, to make more space for engineering construction, some farming households’ houses were removed. Since compensation fees for land requisition cannot catch up with the consumer price inﬂation, some families with poor economic capability are faced with the shortage of housing funds. Third, the village collective land requisition and adjustment could affect the livelihood of local non- resettled farming households. Therefore, this paper proceeds from the background of ﬂood control projects in the Lower Yellow River to examine factors inﬂuencing resettled farming households’ livelihood resilience. Early research attempts of poverty issues mainly focused on the phenomenon of income-triggered poverty, such as a low-income level, weak spending power, and food shortages [2]. The idea of sustainable livelihood originated from methodological research of scholars represented by Sen [3] and Chambers [4] about how to address poverty issues in the 1980s and the 1990s. Apart from investigating the income-triggered poverty in the traditional sense, these scholars laid great emphasis on the poverty resulted from limited development abilities. So far, three analysis frameworks for sustainable livelihood have been established, including the sustainable livelihood analysis framework by the Depart- ment for International Development (DFID) [5], farming household livelihood security framework by the Cooperative for American Relief Everywhere (CARE) [6], and sustainable livelihood approaches by the United Nations Development Program (UNDP) [7]. Among them, the sustainable livelihood framework established by the DFID has found the widest application [8]. This framework regards impoverished farming households as groups surviving or making a life with a fragile background. These farming households have certain livelihood capitals, including natural capitals, physical capitals, ﬁnancial capitals, human capitals, and social capitals, but their livelihood capitals are subject to the inﬂuence of factors, such as policies and processes.",
    "In 1973, the ecologist, Holling [9], introduced resilience theory to the ﬁeld of ecology to describe the capability of the ecosystem to cope with an external disturbance. In recent years, resilience theory has been widely applied to the ﬁeld of social and ecological systems, and disaster prevention [10,11]. As an important theoretical framework that studies farming households’ response to external environmental changes, livelihood resilience has gained wide attention from scholars [12–14]. Scoones [15] pointed out that a resilient livelihood sys- tem is reﬂected not only as the utilization of its own resources to address adverse changes, but also as summary of practical experience, development of self-organization capacity, and improvement of learning capacity. Connecting the livelihood research with resilient thinking can facilitate the comprehension of the dynamic changing process of livelihood and achieve a better measurement of the livelihood system [16,17]. Speranza et al. [18] constructed a livelihood resilience theoretical framework from the perspective of buffer capacity, self-organization capacity, and learning capacity, and expounded on the mea- surement methods of each index. Compared with the traditional research into sustainable livelihood, livelihood resilience attaches greater emphasis on the potential capacity of the livelihood system to recover from the disturbance [19,20]. Hence, livelihood resilience theory can describe livelihood characteristics of farming households comprehensively and accurately. Over the past few years, livelihood resilience theory has been widely used to study resettled farming households. Based on survey data of southern Shaanxi, Li et al. [21] quantitatively analyzed livelihood resilience of impoverished farming households after relocation. Liu et al. [22] constructed a livelihood resilience assessment system for impover- ished farming households after relocation to analyze their livelihood resilience level and inﬂuencing factors. Ji et al. [23] used follow-up survey data of Zhenfeng County, Guizhou Province, China to comparatively analyze livelihood resilience of farming households before and after relocation. Mallick [24] made use of survey data from ﬁve coastal villages in Bangladesh to examine the inﬂuence of livelihood resilience on farming households’ migration decision making. Gautam [25] examined the drivers of seasonal migration in the context of climate change and migration’s role in food security and livelihood resilience in the district of Humla, Nepal. All the above research ﬁndings concentrate on farming households who voluntarily migrate. Little research attention has been paid to livelihood resilience of involuntary resettlers. Liu et al. [26] carried out ﬁeld survey to discuss about the inﬂuence of post-disaster resettlement on livelihood resilience of rural families in China. Through a survey of ﬁve post-2004 Indian Ocean tsunami relocated villages from Indone- sia, Sina et al. [27] developed a framework for measuring livelihood resilience in cases of post-disaster displacement. Li et al. [28] took farming households in Minqin County, Gansu Province who were affected by the implementation of the comprehensive restoration plan of the Shiyang River Basin to discuss about the possibility livelihood vulnerability to convert to livelihood resilience. Jiang et al. [29] used survey data of farming households in Wuhan, Hangzhou, and Jieyang to examine inﬂuencing factors of livelihood resilience of farming households after land requisition. Resettlers of ﬂood control projects are typically involuntary resettlers; however, re- search concerning their livelihood resilience is lacking. Li et al. [30] and Jia et al. [31] discussed land requisition and resettlement of migrants of ﬂood control projects in the Lower Yellow River, but their research ﬁndings lack the evidence provided by quantitative analysis. Based on previous research ﬁndings, this paper further studies the following issues. First, an assessment index system which can reﬂect farming household livelihood resilience is built, combining the existing literature and the practical situations of ﬂood con- trol projects in the Lower Yellow River. Second, farming households’ livelihood resilience is calculated to realize inter-ground comparison of farming households’ livelihood resilience. At last, regression analysis and variance analysis are conducted to identify major factors inﬂuencing resettled farming households’ livelihood resilience. The geographical conditions of the Yellow River are complex, which have posed a great challenge to its ﬂood control. The main challenge facing the ﬂood control of the Yellow River is that the water and sediment are from different sources and that the water is inadequate while the sediment is too much. Around 62% of the water source for the Yellow River is contributed by upper reaches above Lanzhou; 90% of the sediment is from the middle reaches. The different sources of water and sediment have resulted in the water and sediment imbalance. Among the sediment ﬂowing to the lower reaches, around one-fourth is deposited in the channel of the lower reaches, thus lifting up the channel of the lower reaches by 5 cm to 10 cm every year. In this way, the lower reaches have been known as the “suspending river on the ground”. The Yellow River ﬂows from Tongguan, Shaanxi into Henan Province. The Henan section of the Yellow River is a section from the mountainous area to the plain, which is characterized by a wide channel, signiﬁcant difference of height, large ﬂoodplain area, and highest population density. All these characteristics have made this section the top priority of ﬂood control for the Yellow River.",
    "In 2015, the Lower Yellow River ﬂood control project (Henan section) was kicked off. This project involved 16 counties (districts) of ﬁve cities in Henan Province, including a total population of 25.97 million, a total land area of around 30,400 km2, and average population density of 857.58 person/km2. In terms of agricultural development, this project is located in the alluvial plain of the Yellow River. This area features a ﬂat land, fertile soil, and a high land utilization rate. The main grains of the project area include wheat, corn, paddy rice, and soybeans. Economic crops include cotton, peanuts, oilseed rape, watermelons, herbal medicine, etc. As to the development of the secondary and tertiary industries, the project area combines the local resources to gradually establish a series of pillar industries dominated by characteristic processing, large-scale cultivation, and sightseeing. Regarding infrastructure development, the project area boasts a conve- nient and complete transport network with national highways and provincial highways playing a main role. All administrative villages are installed with telephone, radio, and television services. Land requisition and resettlement of migrants are important parts of the Lower Yellow River ﬂood control project (Henan section). The permanent land requisition of this project was 3691.44 mu (1 mu = 666.667 m2), and the temporary land requisition was 17,063.71 mu. A total of 134,076.45 m2 of houses were demolished. Among them, Puyang County, Taiqian County, and Fan County under the administration of Puyang City are key areas of land requisition and resettlement of migrants. The permanent land requisition of three counties takes up 44.13% of the total; the temporary land requisition of three counties accounts for 38.10% of the total; the demolished housing area reached 76.58% of the total. Therefore, this research project adopts the three representative areas, including Puyang County, Taiqian County, and Fan County, for ﬁeld survey. The research area is located to the northeast of Henan Province, and the geographical location is shown in Figure 1. In 2019, our research group went to Henan Province for a ﬁeld survey of Puyang County, Taiqian County, and Fan County by stratiﬁed random sampling. Below are spe- ciﬁc steps: (1) Numbered villages and identiﬁed 13 villages by probability sampling; (2) Numbered selected villages and identiﬁed sample households via simple random sam- pling; (3) Carried out a door-to-door interview. If no one was in the sample household, it would be replaced by its neighbor. Finally, 200 questionnaires were issued, of which 186 valid questionnaires were collected, with abnormal value or without responses elim- inated, which registered a response rate of 93%. Among the valid responses, 134 were resettled farming households, including 53 farming households with land expropriated, 53 farming households with house expropriated, 28 farming households with both land and house expropriated, and 52 non-resettled farming households. The survey covered basic situations of farming households, their land requisition and resettlement, employment and skill training, etc. Basic situations of household samples are presented in Table 1. Those aged above 50 years old took up 68.27% of the total, indicating that heads of these farming households were generally not young. Respondents graduating from primary school or middle school took up 68.81% of the total. Those holding a degree of junior college or above accounted for only 6.99%. This suggested that the household heads had a generally low educational degree. Concerning professions of household heads, farmers took up around 68.28% of the total, suggesting that agriculture remained a way for a majority to make a living. Analyzed by the number of labors, 79.57% of families were found with two or fewer than two labors. So there were not many labors in every family. The concept of resilience can help understand how a person protects his livelihood more effectively under the inﬂuence of adverse changes [32]. Resettlers of ﬂood control projects, after experiencing involuntary land requisition or resettlement, are faced with changes to their livelihood. Therefore, it is necessary to examine which core factors can inﬂuence the livelihood resilience of ﬂood control project resettlers and how these factors can be managed and optimized. Referring to Speranza’s [18] livelihood resilience frame- work and combining practical situations of ﬂood control projects in the Lower Yellow River, this paper constructs the farming household livelihood resilience assessment index system from three dimensions, including buffer capacity, self-organization capacity, and learning capacity. The aforesaid three dimensions are chosen for the following two causes. First, the three dimensions have been extensively adopted by scholars for examination of issues from different perspectives and discussions of different research objects. Second, the three dimensions are highly operable, whose corresponding indexes can be easily quantiﬁed.",
    "Buffer capacity is deﬁned as the capacity of the system to maintain its organizational structure and functional attributes under external disturbances [33]. From the livelihood perspective, buffer capacity means the capacity of farming households to make use of their resources to resist against livelihood risks [34]. Buffer capacity of farming households is usually indicated by ﬁve kinds of livelihood capitals, including natural capitals, physical capitals, ﬁnancial capitals, human capitals and social capitals [35]. In this paper, the arable land area is chosen to represent natural capitals; the housing area and homestead area to stand for physical capitals; the per capita income to indicate ﬁnancial capitals; and the number of labors and health status to represent human capitals. Self-organization capacity refers to the impact of self-management, policy systems, and social network on their resilience [36]. Milstad [37] deﬁned self-organization of the agricultural system as the network established by farming households or agricultural operators for mutual exchange and support, and their ability to be integrated into the local society, economy, and systems. Combining the practical situations of the survey areas, this paper chose infrastructure conditions, production conditions, and borrowing capacity to measure a farming household’s capacity of organization and production; using rural endowment insurance and non-farming employment opportunity to measure a farming household’s response to policies and social participation. After a large land area was allocated for ﬂood control projects, resettlers might be faced with the problem of livelihood transformation. In other words, some resettlers might turn to non-farming industries. So the index of non-farming employment opportunity is more representative than the index of actual employment. Learning capacity means the ability of individuals or organizations to create, acquire, spread, and memorize knowledge [38]. Farming households should constantly acquire new knowledge and skills from other farming households and the external environment so that they can adjust their livelihood strategies in time against external disturbances [39]. Therefore, this paper chooses educational expenditure, educational degree of household head, rural mental working experience, number of migrant workers, and length of time to work away from hometown to indicate farming households’ learning capacity. Assessment indexes listed in Table 2 demonstrate different dimensions and degrees of change. The maximum difference normalization method is used to process the original data. The data after processing are dimensionless, making it possible for different indexes to be compared with each other. The equation can be written as below: where X’ij denotes data in the j column of the i row after normalization; xij denotes the raw data of the j column of the i row; λjmin stands for the minimum of the raw data of the j column; λjmax represents the maximum of the raw data of the j column. There are many assessment indexes chosen in Table 2, and these indexes are all correlated. The software, SPSS25, is employed for the principal component analysis (PCA). Several principal components are extracted to measure a farming household’s livelihood resilience. Before the PCA, feasibility analysis is conducted on factor analysis. Results show that the KMO value is 0.648, suggesting that the data have a high sampling adequacy. The value of Bartlett’s test of sphericity is 733.901, and sig = 0.000. This indicates that the data are signiﬁcant on the signiﬁcance level of 1%. Therefore, the data are feasible for PCA. To start with, 16 indexes are chosen for PCA, six principal components are extracted, and their accumulated variance contribution rate is 66.65%, meaning that the six principal components can explain the population variance by 66.65%. In order to make PCA results more direct, this paper combines the factor loading matrix to list indexes whose correlation coefﬁcient is higher than 0.5. As shown in Table 3, major factors affecting a farming household’s livelihood resilience include working away from hometown, human capitals, infrastructure conditions, and production conditions. The correlation coefﬁcient of the number of migrant workers is 0.796. This means that the number of migrant workers is the most important factor that can inﬂuence farming households’ livelihood resilience. The correlation coefﬁcient of the length of time to work away from hometown is higher than 0.7, which suggests that the length of time to work away from hometown plays an important role in promoting livelihood resilience. Infrastructure conditions and production conditions are two factors whose correlation coefﬁcient is the highest among the variables of the second principal component. The correlation coefﬁcient of the two factors are both above 0.7, which can provide solid evidence for the important role of favorable infrastructure and production services in a farming household’s livelihood resilience.",
    "According to PCA results, the variance contribution rate is adopted as the weight and scores of six principal components as variables. The farming household livelihood resilience index can be given by the following equation: where LRI indicates the livelihood resilience index; Yk denotes the variance contribution rate of the k principal component; Fk denotes the scores of the k principal component. Referring to the literature [29,32,35,40,41] and combining ﬁeld survey, this paper selects six explanatory variables to represent resettlement, family, and social factors. Land requisition and resettlement of migrants are two major parts of ﬂood control projects. This can inﬂuence farming households’ livelihood resilience. So being resettled or not and land requisition type are chosen as the explanatory variables. Family exists as a basic decision-making unit of livelihood activities, so family characteristics can inﬂuence farming households’ livelihood resilience. Therefore, family scale, livelihood strategy, and skill training are pinpointed as explanatory variables. In addition, farming households are part of the speciﬁc economic and social structure, whose livelihood resilience is subject to the inﬂuence of policies and systems. Hence, response to policies is adopted as the explanatory variable. Major variables are explained in Table 4. In order to explore inﬂuencing factors of farming household livelihood resilience, this paper deﬁnes the linear regression model as below: where LRI denotes the farming household livelihood resilience index; α represents the constant term; βi (i = 1,2, . . . ,5) stands for the regression coefﬁcient of the i explanatory variable; Xi indicates all potential inﬂuencing factors of livelihood resilience, including being resettled or not, response to policies, family scale, livelihood strategy, and skill training; ε stands for disturbance. Though ﬂood control projects can inﬂuence resettled farming households and non- resettled farming households to different degrees, the livelihood capital losses and social environmental changes can exert a greater impact on resettled farming households than on non-resettled farming households. Therefore, it is expected that the regression coefﬁcient of the being resettled or not is negative. The stronger the response to policies is, the faster it is to obtain government support, and the more likely the policies can positively promote livelihood resilience. The regression coefﬁcient of the response to policies is expected to be positive. The larger the family scale is, the higher the household income is, and the more beneﬁcial it is to respond to environmental changes. Therefore, it is expected that the regression coefﬁcient of the family scale is positive. The more diversiﬁed the livelihood strategies are, the stronger the ability will be to resist against environmental changes. It is expected that the regression coefﬁcient of the livelihood strategy is positive. The more frequent the skill training is, the more beneﬁcial it is to enhance professional skills. The regression coefﬁcient of the skill training is expected to be positive. In order to more directly compare the livelihood resilience differences between re- settled farming households and non-resettled farming households, this paper carries out an inter-group comparison of farming household livelihood resilience. Figure 2 reveals that the livelihood resilience density curve of all farming households, resettled farming households, and non-resettled farming households is all very steep, meaning that their livelihood resilience ﬂuctuations are not obvious but concentrate around the mean. Among them, the livelihood resilience of all farming households reaches the peak at around 0.38; the livelihood resilience of resettled farming household reaches the peak at around 0.37; the livelihood resilience of non-resettled farming household reaches the peak at around 0.41. The livelihood resilience peak of resettled farming household is all lower than that of all farming households and non-resettled farming households. It means that the liveli- hood resilience of resettled farming households is lower than that of non-resettled farming households on the whole. To better recognize characteristics of farming household livelihood resilience, the K-means clustering is used to divide farming households of the research regions into three types, including farming households with a low livelihood resilience, a medium livelihood resilience, and a high livelihood resilience. The F statistics of the one-way analysis of variance is 454.360, and p value is 0.002. This means that the three types of livelihood resilience are signiﬁcantly different. The average of the low livelihood resilience, medium livelihood resilience, and high livelihood resilience is 0.226, 0.379, and 0.519. The livelihood resilience distribution of farming households of different types is shown in Figure 3. Only 15.38% of non-resettled farming households have a low livelihood resilience; the medium and high resilience of non-resettled farming households take up 48.08% and 36.54%, respectively. Among resettled farming households, the low livelihood resilience accounts for 31.34% of the total, the medium and high livelihood resilience account for 41.04% and 27.61%, respectively, which are both lower than the medium and high livelihood resilience of all farming households and non-resettled farming households. The analysis suggests that the livelihood resilience of a majority of resettled farming households is of the medium or low level. The livelihood resilience structure of resettled farming households is poorer than that of non-resettled farming households.",
    "The correlation between farming household livelihood resilience and potential in- ﬂuencing factors is presented in Table 5. D-W test value is 1.801, meaning that data are mutually independent, which is consistent with conditions to ensure an independent linear regression. When the VIF is within 1.451, it means that the model is free of the problem of collinearity. JB test is conducted on the dependent variable. Results show that p = 0.841 > 0.05, meaning that the dependent variable follows normal distribution. Results of model veriﬁcation reveal that the F statistics is 37.278 (p = 0.000 < 0.05), suggesting that the regression model constructed has statistical signiﬁcance. As shown in Model 1, resettlement factors include being resettled or not; family and social factors include family scale, livelihood strategy, and skill training. The inﬂuence of all the aforesaid variables on farming household livelihood resilience is all signiﬁcant at the signiﬁcance level of 10%. Among them, being resettled or not has a negative inﬂuence on farming household livelihood resilience. In other words, land or house requisition caused by ﬂood control projects can weaken a farming household’s livelihood resilience. This ﬁnding also shows good agreement with the inter-group comparison results of farming household livelihood resilience. Family scale has a positive inﬂuence on livelihood resilience; therefore, the larger the family scale is, the stronger the household livelihood resilience is. Livelihood strategy has a positive impact on farming household livelihood resilience at the signiﬁcance level of 1%. This ﬁnding can lead to the conclusion that the more diversiﬁed the livelihood strategies are, the more beneﬁcial it is to improve farming household livelihood resilience. The inﬂuence of skill training is positive as well. This suggests that the more frequent the skill training is, the more likely it is to improve farming household livelihood resilience. Model 2 controls resettlement, family, and social factors and then increases response towards policies to conduct a regression analysis of farming household livelihood resilience. Response to policies can reﬂect farming households’ acceptance of policies, which is re- ﬂected as resettled farming households’ willingness to implement relevant policies and accept management. To non-resettled farming households, response to policies refers to their acceptance of the resettlers to move to their own village group as well as their collabo- ration with relevant resettlement policies. Results suggest that the inﬂuence of response to policies on farming household livelihood resilience is signiﬁcant at the signiﬁcance level of 10%. Hence, it is apt to say that active response to policies has a positive inﬂuence on farming household livelihood resilience. In this section, the difference of livelihood resilience between non-resettled farming households and different types of resettled farming households is examined by variance analysis. The homogeneity of variance test shows that p = 0.410 > 0.05, which satisfies the conditions of the homogeneity of variance. Thereby, variance analysis can be conducted. ANOVA results show that F statistics is 6.128, and p value is 0.001, which are far lower than the significance level. This means that the livelihood resilience between non-resettled farming households and different types of resettled farming households is significantly different. To deepen the knowledge of the difference between non-resettled farming households and three types of resettled farming households, this paper compares them two by two. As one can notice in Table 6, the mean difference (p = 0.207) between non-resettled farming households and farming households with house expropriated fails to reach the statistical signiﬁcance level. The mean difference between farming households with land expropri- ated and other three types of farming households is negative, being −0.051, −0.077, and −0.141, respectively, and p < 0.05. This means that the livelihood resilience of farming households with land expropriated is signiﬁcantly lower than that of the other three types of farming households. Referring to the existing literature and combining practical situations of ﬂood control projects of the Lower Yellow River, a farming household livelihood resilience assessment index system is constructed to work out the farming household livelihood resilience index. The clustering analysis is employed to divide farming household livelihood resilience into three levels, namely low, medium, and high. Additionally, inter-group comparative analysis is conducted on resettled farming households and non-resettled farming households. On that basis, regression analysis and variance analysis are adopted to discuss inﬂuencing factors of resettled farming household livelihood resilience. Results suggest: (1) Livelihood resilience of resettled farming households is on the whole lower than that of non-resettled farming households. (2) Response to policies, family scale, livelihood strategy, and skill training are major inﬂuencing factors of resettled farming households’ livelihood resilience. (3) Compared with other types of farming households, livelihood resilience of farming households with land expropriated is signiﬁcantly different.",
    "Combining the analysis results above, the government can make efforts in the follow- ing ﬁve aspects to improve livelihood resilience of resettled farming households. According to the Regulation on Land Requisition Compensation and Resettlement of Mi- grants for Large and Medium Water Conservation and Power Construction Projects, follow-up support policies are applicable to resettlement caused by large and medium water con- servation and power construction projects. The analysis above shows that, though land requisition and resettlement caused by large ﬂood control projects construction have their own characteristics, there are no essential differences between these problems and resettle- ment problems caused by water conservation and power construction projects. A shared characteristic is that land requisition and resettlement caused by project construction have both exerted a negative impact on resettlers. So it is necessary to expand the application scope of follow-up support policies to cover ﬂood control project resettlers as well. Research indicates that resettlers’ response to policies is signiﬁcantly correlated with their livelihood resilience. Land requisition and resettlement leadership groups and ofﬁces set up by relevant counties and cities are still temporary management institutions. Major management personnel are designated from other departments to work concurrently for land requisition and resettlement. So, they may lack scientiﬁc and professional experience in land requisition and resettlement. This can seriously impair their working efﬁciency. Hence, it is necessary to enhance capability construction of resettlement management departments, improve professionalism of management personnel, innovate the ways for publicity of resettlement policies, and upgrade resettler participation mechanisms. Research suggests that livelihood strategy and skill training are major factors inﬂu- encing resettlers’ livelihood resilience. The government should think about how to help resettlers with their employment challenges. The government can encourage resettlers to engage in projects with local characteristics, including growing local vegetables and fruits, give resettlers living under economic embarrassments access to discounted loans and petty initial funds. Additionally, spending on education and training of resettlers should be increased to turn resettlers into educated and skilled new-type farmers, and improve their self-accumulation and self-development abilities as well. Research reveals that favorable infrastructure and production conditions can sig- niﬁcantly improve resettlers’ livelihood resilience. Improvement of water conservancy, transport, and other infrastructure can effectively lower the production cost of resettlers and strengthen the connection between resettlers and the outside world. All this is of vital importance to the improvement of resettlers’ self-organization capacity and learning capacity. Therefore, local governments should make good use of different funds, better infrastructure and public service facilities, actively develop the modern agriculture, foster new-type agricultural operators, and explore effective channels of rural revitalization. The Law of the People’s Republic of China on Land Administration, amended in 2020, clearly stipulates that local governments should include farming households with land expropriated into the social security system. The current ﬂood control project resettler social security system construction is still backward, which is still far behind resettlers’ expectations. Local governments of where ﬂood control projects are located should extend the coverage of the social security system to farming households with land expropriated. At the same time, special attention should be paid to those who are losing their ability to work, or those living in poverty. Author Contributions: Conceptualization, Y.D.; methodology, S.C.; formal analysis, S.C. and Y.Z.; investigation, Y.D. and X.W.; data curation, Y.D.; writing—original draft preparation, Y.D.; writing— review and editing, S.C. and Y.Z.; funding acquisition, Y.D. All authors have read and agreed to the published version of the manuscript."
]