[
    "Coal miners’ unsafe behavior is the primary reason for accidents. This research aims to examine the effect of male coal miners’ shared work crew identity on their safety behavior. A 2-2-1 multilevel mediation model is established based on social identity theory and safety climate theory. To validate the model, a paper-and-pencil survey with male coal miners was carried out in Henan Province, China. A total of 212 valid responses from male coal miners nested in 53 work crews were secured, and Mplus was used to analyze the data. Results show that work crew safety climate fully mediates the effect of male coal miners’ shared work crew identity on their safety behavior. In theory, the findings support that social identity brings a safety climate. In practice, the findings highlight that making safety part of work crew norms improves male coal miners’ safety behavior. Limitations and future research are also discussed. Citation: Hu, Z.; Li, S.; Shen, Y.; He, C.; Hon, C.K.H.; Xu, Z. Male Coal Miners’ Shared Work Crew Identity and Their Safety Behavior: A Multilevel Mediation Analysis. Sustainability 2025, 17, 6762. https://doi.org/10.3390/ su17156762 Copyright: © 2025 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https://creativecommons.org/ licenses/by/4.0/). In reviewing and synthesizing publications using the Accident Mapping (AcciMap) technique, Salmon et al. [1] found that unsafe acts are a prominent cause of accidents. In the coal mining industry, unsafe behavior is also the predominant reason for accidents [2–4]. Wang et al. [2] classified the contributing factors to coal miners’ unsafe behavior into two categories: individual and organizational factors. The former covers individual character- istics and perceptions. The latter includes environment support and safety management systems. Safety climate, reflecting the importance of safety compared with other production goals, is listed as an environment support factor. Furthermore, Wang et al. [2] compared the importance of those contributing factors, and found that individual perceptions and en- vironmental support are more important. Li et al. [3] investigated the relationship between safety attitudes and safety behaviors in the coal mining industry in China. They viewed safety climate as one dimension of safety attitudes, and found that team safety climate directly affects safety behaviors (i.e., safety compliance and participation). Management commitment to safety is a primary component of the safety climate [4,5]. The positive link between management commitment to safety and safety behavior has received unanimous empirical support. It can be explained from the competency and motivation perspective. For example, Neal et al. [6] found that safety knowledge and motivation mediate the safety climate–safety behavior relationship. However, other authors (e.g., [7]) failed to find such a mediation effect. Ye et al. [4] attributed this inconsistency to the research context. In the context that is conducive to cultivating competence and motivation, the link can be explained by the two mediators (i.e., safety knowledge and motivation). However, in the context that blocks employees’ motivation, the mediation effect may disappear. The antecedents of safety climate have received attention from academia since 2000. Despite that, the antecedents are not yet well established. Given this shortcoming, He et al. [8] conducted a meta-analysis of 136 studies, and organized 38 safety climate an- tecedents into three broad categories: situational factors, interpersonal interactions, and personal factors. They conceptualized situational factors as job, organizational, coworker, and supervisor characteristics. This paper extends these situational factors by introducing another antecedent—social identity. Social identity theory proposes that when acting in groups, “individuals define themselves in terms of their group membership, and perceive their own group values more positively than those of other workgroups” [9] (p. 24). So, in organizations with strong social identity and safety as part of group norms, employees are more likely to sense the importance attached to safety by management. Social identity and safety climate are multilevel in nature [9]. Since coal miners usually work in crews, this paper specifically focuses on work crew identity and work crew safety climate, i.e., social identity and safety climate at the work crew level. Additionally, the majority of coal miners are male. This paper, therefore, aims to examine the impact of male coal miners’ shared work crew identity on their individual safety behavior, and the possible mediating role played by the work crew safety climate.",
    "This study attempts to develop the current literature in three ways. First, it enriches safety climate theory by introducing another safety climate antecedent, group identity (i.e., work crew identity), and explores the mechanism underlying the impact of male coal miners’ shared work crew identity on their safety behavior. Second, group level phenom- ena are rooted in the perceptual experiences of individuals [10]. They can significantly influence individual-level phenomena through mechanisms such as group dynamics and social context [11]. Many empirical studies involving cross-level effects opt to focus on a single level [12]. The cited reasons usually include data unavailability, time constraints, methodological complexity, etc. [11]. This paper, however, employs a cross-level analysis to uncover the cross-level mechanism. Third, it tries to explore more actionable and targeted measures to enhance male coal miners’ safety behavior in China. Unsafe behaviors such as accident coverups are still rampant in China’s mining sector [13,14]. Beyond China, mining remains one of the most dangerous sectors across the globe [15]. Unsatisfactory safety performance due to unsafe behaviors in mining undermines the sustainability of the sector, and even the whole economy. Therefore, it is quite urgent to investigate possible measures to improve male coal miners’ safety behavior. Around 1970, the social identity approach was proposed to account for group processes and intergroup relations [16]. Before the social identity approach, individuals defined themselves in terms of personal characteristics. Social identity theorists, however, maintain that in addition to personal characteristics, individuals also define themselves by group membership. When the group is salient in their mind, they would tend to believe that they represent the group, and hence they would willingly internalize and adhere to the group norms [16]. Therefore, individuals’ social identity shapes their perceptual, affective, and behavioral responses to the environment [9,17]. Coal miners usually work as a member of groups (e.g., a work crew, a mine, or a company). A coal mining company usually runs several mines. A mine often hosts numerous work crews and subcontractors. A mine work crew usually consists of a supervisor, electricians, fitters, laborers, etc. Therefore, coal miners often develop multi-level identities. Coal miners’ unique work conditions shape their identity at different levels [18]. Specifically, dangerous work conditions force coal miners to rely on their colleagues for safety and support, and this in turn reinforces their group identity. Similarly, construction workers also have many objects of identity (e.g., group, trade, union, company, and project). Andersen et al. [9] found that construction workers’ group identity is much stronger than their project identity, because workers have direct and intense interactions within the workgroup on a daily basis. Safety climate refers to employees’ shared perceptions of policies, procedures, and practices regarding safety in the workplace [19]. It is multilevel in nature [20]. Work crew safety climate refers to safety climate at the work crew level. Safety climate has multiple components/dimensions, such as management commitment, supervisor support, coworker communication, and work pressure [5]. Given that previous research investigated organi- zational climates at the organization and subunit levels separately, Zohar and Luria [21] tested a multilevel model of safety climate, covering both organization and subunit levels. They found that organization-level and group-level safety climates are globally aligned, and the effect of the organization-level safety climate on safety behavior is fully mediated by the group-level safety climate. Furthermore, there is meaningful group-level variation in the safety climate within a single organization. Zohar and Luria [20] attributed the group-level variation in the safety climate to supervisory discretion. Different subsectors of the mining industry have different patterns of safety climate as well. The National Institute for Occupational Safety and Health assessed mineworkers’ perceptions of several safety climate dimensions, and found that compared to miners in other mining subsectors (e.g., industrial mineral, stone/sand/gravel), coal miners have significantly less favorable safety climate perceptions [22]. Work crew identity may have positive impact on work crew safety climate. This proposition has received empirical support from the construction sector, which is quite similar to the coal mining industry. Like coal miners, construction workers also have multi- level identities, such as union, trade, workgroup, project, and company [23]. An increase in construction workers’ project identity is conducive to aligning safety norms between workers and the project manager [23,24]. Such alignment helps construction workers make sense of the project managers’ safety actions (i.e., safety climate) [23]. Therefore, social identity is related to safety climate at both the work crew and site (project) levels [23,24]. Moreover, Andersen et al. [9] found that the association between social identity and safety climate is stronger at the work crew level than at the site (project) level. He et al. [25] found significant differences in safety climate scores between construction workers and their supervisors, attributed to their social identity. Xia et al. [26] found that group identification facilitates transforming the safety climate at the individual level to safety climate at the group level. Therefore, we hypothesize that: Safety climate guides and shapes employees’ safety behavior, because safety climate sends them a signal that safety behavior would be rewarded and recognized [21]. This proposition has received widespread empirical support from a wide range of industrial sectors [4,27]. It is widely accepted that Zohar’s 1980 empirical study [28] marked the inception of safety climate. Since its inception, although numerous scholars have reviewed the safety climate literature, the mechanism of how safety climate impacts performance is not yet well understood. Given this shortcoming, Syed-Yahya et al. [27] reviewed 162 studies in 16 industrial sectors. Those reviewed articles grouped safety performance into three categories (i.e., safety-related behavior, safety-related events, and work-related illness), and a majority of them focused on safety-related behavior. In other words, most of them defined safety performance as safety behavior. Furthermore, Syed-Yahya et al. [27] found that safety climate predicts safety behavior, with 23 theories accounting for the prediction. Therefore, we hypothesize that: An individual’s social identity dominates and guides the individual’s behavioral response to the environment [29]. Construction workers work closely with peers in a work crew on a daily basis, and hence develop stronger identification with the work crew than with their company/managers [29]. The stronger their identification with the work crew, the more they are committed to the shared norms of the work crew. A central way to form work crew (in-group) identity is to differentiate from other work groups (out-group), and social categorization describes such a cognitive process of identification [30]. Social categorization is a process of grouping people according to shared characteristics. Through social categorization, the world is divided into “them” and “us” [30]. Consequently, the ingroup (“us”) tends to be viewed more favorably and outgroup more negatively (i.e., ingroup favoritism and outgroup bias). Hence, the process of social categorization (i.e., identification) affects perceptions of and behaviors to others in the workplace [31]. In a laboratory experiment, Gioia [32] found that group identity affects the magnitude of peer effects on an individual’s risk behavior. Pandit et al. [33] found that construction crews with high levels of cohesion have superior safety communication levels. Hence, we hypothesize that: As mentioned earlier, identification affects behaviors. However, such impacts may be indirect. Taking accident reporting as an example, Andersen et al. [9] found that safety climate mediates the impact of social identity on accident reporting at both work crew and site/project levels. Furthermore, social identity has three components, i.e., cognitive, affective, and evaluative [34]. Bergami and Bagozzi [35] found that the impact that the cognitive dimension of social identity has on workers’ organizational citizenship behavior is mediated by the affective and evaluative components. Consumers’ social identity impacts their green food purchase intention through the mediation of psychological distance and green perceived value [36]. Team cohesion is usually taken as an index of team identification. Although Pandit et al. [33] did not find evidence to support that safety climate mediates the relationship between construction work crew cohesion and safety communication, they admitted that a “synergetic effect exists between safety climate and crew cohesion in improving safety communication levels” (p. 1). Therefore, this paper proposes that: Group identity is part of an individual’s self-concept, and it originates from group membership [37]. Group identity has three dimensions (i.e., cognitive, affective, and evaluative). Choi et al. [17] adopted nine items to measure group identity, with three items for one dimension. Accordingly, this paper selected six items from Choi et al. [17], and intended two items to measure each dimension. Sample items were “Being a member of my crew is an important part of who I am”, “I feel a strong sense of belonging to my crew”, and “Being a member of my crew is an important source of self-esteem”. This paper used a five-point Likert scale, ranging from “strongly disagree” to “strongly agree”, to measure work crew identity.",
    "Group safety climate reflects the priority of safety in the group. Zohar and Luria [21] used 16 items to measure group safety climate, and derived three factors (i.e., active practices, proactive practices, and declarative practices) based on exploratory factor analysis. This paper chose three items from Zohar and Luria [21], with each item from one factor. The three items read: “My direct supervisor refuses to ignore safety rules when work falls behind schedule”, “My direct supervisor frequently checks to see if we are all obeying the safety rules”, and “My direct supervisor frequently tells us about the hazards in our work”. A five-point Likert scale, ranging from “strongly disagree” to “strongly agree”, was adopted to measure each item. Safety behavior refers to the actions and practices that employees take to prevent acci- dents and injuries in the workplace. This paper adopted three items from Neal et al. [6] to measure safety behavior. The three items read: “I use the correct safety procedures for carry- ing out my job”, “I ensure the highest levels of safety when I carry out my job”, and “I help my coworkers when they are working under risky or hazardous conditions”. They were also rated on a five-point Likert scale, ranging from “strongly disagree” to “strongly agree”. Demographic variables, including age, education level, industry experience, and current project experience, were used to control safety behavior at the individual level for two reasons. First, the demographics–safety relationship awaits more studies in order to formulate targeted measures [38]. Second, existing studies show conflicting findings about the impact of demographic characteristics on employees’ safety behavior. Some studies found a positive relationship. For example, Li et al. [3] found that older and senior coal miners exhibit positive safety attitudes, while highly educated coal miners do not necessarily exhibit positive safety attitudes. Young coal miners are more likely to take safety risks [39]. Ali and Pal [40] suggested that younger coal miners with little or no experience The research team requested top management of a coal mining company in Henan Province, China, to recommend two representative sites. With approval, the research team accessed the two recommended sites and distributed 300 hard-copy questionnaires during a training session. Before filling out the questionnaire, the research team assured prospective respondents that the questionnaire survey was anonymous, and the information would be used only for research purposes. Finally, valid responses from 212 male coal miners nested in 53 work crews were obtained. The response rate was 70.7%. A total of 76.4% of the respondents were aged 26 to 40 years. Around 86% had received fewer than 12 years of formal education. About 65% had less than five years of industry experience. Details of the 212 respondents are shown in Table 1. In order to secure reliable and valid measures, this paper conducted exploratory and confirmatory factor analyses. In carrying out the exploratory factor analysis (EFA), those unqualified items (i.e., communalities less than 0.5 and factor loadings less than 0.7) were deleted [42]. As a reflective measurement model was used to measure those constructs, items were deemed exchangeable, and hence could be deleted without undermining the focal constructs [42]. After EFA, confirmatory factor analysis (CFA) was conducted at the individual level. As the hypotheses involved cross-level effects, this paper employed multilevel analysis. In order to account for the nested structure of the data (i.e., 212 coal miners nested in 53 work crews), a multilevel path analysis was conducted with Mplus 8.3 to test the hypotheses [43]. Before the multilevel path analysis, we needed to aggregate coal miners’ individual work crew identities and individual work crew safety climate perceptions to the work crew level. To justify the aggregation, three indicators, i.e., intraclass correlations (ICC(1)), reliability of mean group score (ICC(2)), and within-group agreement (rWG(j)), were calculated. For work crew identity, ICC(1) = 0.377, ICC(2) = 0.707, and the range of rWG(j) was [0.933, 1]. For the work crew safety climate, ICC(1) = 0.387, ICC(2) = 0.716, and the range of rWG(j) was [0.833, 1]. According to LeBreton and Senter [44], the two level-1 constructs (i.e., work crew identity and work crew safety climate) could be aggregated to level-2 constructs. Together, Tables 2–4 show the EFA and CFA results at the individual level. Table 2 shows results of comparing possible measurement models of the three variables (i.e., work crew identity, work crew safety climate, and safety behavior). A model’s goodness- of-fit should be assessed through the following fit indices: the Chi-square value and the associated degree of freedom, one absolute fit index (e.g., root mean square error of approximation (RMSEA)), one incremental fit index (e.g., comparative fit index (CFI)), and one goodness-of-fit index (e.g., the Tucker–Lewis index (TLI)) [42]. The fit indices of the three-factor model satisfy Hair et al.’s [42] criteria. Additionally, Delta Chi-square tests of differences support the three-factor model. Therefore, the three-factor model is optimal. In Table 3, all factor loadings are above 0.6 and Cronbach’s a of each latent variable is above 0.7; so, the measures secure reliability. Moreover, all average variances extracted (AVEs) of latent variables are above 0.5, and hence all the latent variables secure convergent validity [2]. Table 4 shows descriptive statistics and zero-order correlations. As the correlation coefficients between any pair of the three latent variables (i.e., work crew identity, work crew safety climate, and safety behavior) are smaller than square root of AVEs of corresponding latent variables, the measures secure discriminant validity [42]. In addition, zero-order correlations suggest that except for age, the other three demographic variables (i.e., education level, industry experience, and current project experience) are positively and significantly related to the three latent variables.",
    "Note: (1) A = shared work crew identity; B = work crew safety climate; C = safety behavior. (2) df = degree of freedom; RMSEA = root mean square error of approximation; CFI = comparative fit index; TLI = Tucker–Lewis Index. (3) ∆χ2 is the Chi-square difference between the corresponding model and the baseline model (i.e., the three-factor model). Note: (1) SWCI = shared work crew identity; WCSC = work crew safety climate; SB = safety behavior; AVE = average variance extracted. (2) *** p < 0.001. Table 5 reports the regression coefficients in the multilevel model shown in Figure 1. In Model 1, work crew safety climate (WCSC) is regressed on shared work crew identity (SWCI), and the regression coefficient is 0.408 (p < 0.05). This supports H1. In Model 2, safety behavior (SB) is regressed on WCSC, controlling for demographics. The regression coefficient is 0.883 (p < 0.001). This supports H2. Model 3 regresses SB on SWCI, control- ling for demographics. The regression coefficient is 0.408 (p < 0.05). This supports H3. When Model 4 regresses SB on both SWCI and WCSC, controlling for demographics, the regression coefficient of SB on SWCI turns insignificant, and that of SB on WCSC turns smaller yet still significant. This suggests that WCSC may mediate the relationship between SWCI and SB [45]. Monte Carlo and bootstrapping confidence intervals are often used to test mediation effects (i.e., the product of the regression coefficients of SB on WCSC and WCSC on SWCI) [46]. Using an online interactive tool for creating confidence intervals for the cross-level mediation effect provided by Preacher and Selig [47], we calculate the 95% Monte Carlo confidence interval (with 10,000 replications) as (0.045, 0.503). The 95% boot- strapping confidence interval (500 draws) of the mediation effect size (default at Mplus 8.3) is (0.034, 0.454). Both of the confidence intervals exclude zero, and hence the product is significant [48]. This suggests that WCSC plays a fully mediating role in the relationship between SWCI and SB [45]. Therefore, H4 is supported. Note: (1) SWCI = shared work crew identity; WCSC = work crew safety climate; SB = safety behavior. (2) * p < 0.05; ** p < 0.01; *** p < 0.001. Identity is a “root construct” for a great variety of organizational phenomena and outcomes, and provides a basis for action [49]. Mining is one of the most dangerous sectors around the world [15]. Unsafe behavior is one primary reason for unsatisfactory safety performance in mining, and hence undermines the sustainability of the sector and even the economy as a whole. To gain a more nuanced understanding of the relationship between male coal miners’ shared work crew identity and their safety behavior, this study adopted a cross-level research design and obtained the following findings. Experimental psychology supports that social identity affects perceptions [50]. In the safety domain, previous research (e.g., [9,23,24]) has also found that social identity has an impact on safety climate. Unlike previous research, this paper took both work crew identity and safety climate as collective phenomena, and found that coal miners’ shared work crew identity is positively related to work crew safety climate. This suggests that strengthening male coal miners’ sense of belonging to their work crew can help them perceive the importance of safety in their daily jobs. This study found that work crew safety climate is positively associated with coal miners’ safety behavior. The positive impact of safety climate on safety behavior has garnered much empirical support [19]. However, most of the previous research focused on a single level. For example, in construction, Xia et al. [12] observed that most previous studies on safety climate focus on the individual level. This study, however, used a cross-level research design, and found that work crew safety climate (level-2 collective phenomenon) has an impact on male coal miners’ safety behavior (level-1 individual behavior). This study found that coal miners’ shared work crew identity does not directly affect individual safety behavior. Instead, the impact is fully mediated by work crew safety climate. The more employees identify with a group, the more the group’s norms are incorporated into employees’ self-concept and the more likely employees are to act for the interest of the group [9,29]. However, the full mediation role of work crew safety climate indicates that coal miners’ shared work crew identity does not necessarily lead to their safety behavior directly. Work crew safety climate accounts for the influence of coal miners’ shared work crew identity on their safety behavior. Definitely, there may be some other mediators. For example, accountability drives individual behavior, because individuals seek approval in the eyes of others [51]. Chen et al. [52] found that psychological safety mediates the relationship between employees’ organizational identification and their proactive workplace behaviors. All of these necessitate more research efforts.",
    "From zero-order correlations, it can be seen that except for age, the other three demo- graphic variables (i.e., education level, industry experience, and current project tenure) are positively and significantly correlated with the three latent variables (i.e., work crew identity, work crew safety climate, and safety behavior). However, when used as control- ling variables in predicting coal miners’ safety behavior, almost none of the demographic variables exert a significant impact. Therefore, it is likely that some other variables account for the impact of demographics on safety behavior [39]. This study contributed to the safety domain in three ways. First, although empirical studies on safety climate have been conducted for more than four decades, the antecedents of safety climate have not been well established [8,12,53]. This study confirms that work crew identity (a variant of group identity) serves as an antecedent of work crew safety climate for male coal miners, contributing to the safety climate theory. Second, most identity research has focused on a single level of analysis, be it the individual, group, or organization [48]. This study, however, takes work crew identity as a group-level concept, and attempts to explore its cross-level impact on coal miners’ individual safety behavior. Therefore, this study enriches the social identity literature. Third, organizational identification has a unique value in explaining individual attitudes and behaviors in organizations [54]. This study shows that male coal miners’ shared work crew identity does not directly impact their safety behavior; instead, with the full mediation by work crew safety climate, male coal miners’ shared work crew identity influences their safety behavior. Hence, this study extends the current safety behavior research. The findings also have practical implications. First, for a safety management system, like an accident reporting scheme, to be effective, employees must develop ownership [55]. As a first step to develop such ownership, employees must form strong bonds with their work crews (i.e., group identity). This paper shows that enhancing male coal miners’ belongingness to their crews is conducive to developing their safety behavior. However, as strong group identity may resist change in some circumstances [56,57], this paper reminds practitioners to always develop a pro-safety work crew identity among male coal miners. This necessitates making safety part of work crew norms and values, and strengthening male coal miners’ identification with work crews. Second, work crew safety climate is an essential conduit for male coal miners’ shared work crew identity to spur their safety behavior. Staff in coal mines, from managers to supervisors, should not only espouse safety, but more importantly also enact safety. Coal mine managers should ensure that safety rules and regulations do not weaken coal miners’ work crew identity. In this regard, eliciting coal miners’ suggestions in formulating safety policies would be wise. This study has limitations as well. First, like other safety climate studies, a self-report survey method was adopted, and might incur common method bias [28]. However, the common method bias in this study is limited. The involved constructs secured reliability and both convergent and discriminant validity (refer to Section 4.1). Furthermore, self- report measures are appropriate in some circumstances [58]. Despite that, supervisor and observer ratings are suggested to be adopted if possible in future. Second, like other safety climate studies, a cross-sectional research design was adopted, and hence precluded causal inference [28]. Future research is suggested to adopt a longitudinal research design. Third, this paper found that work crew safety climate fully mediates the relationship between coal miners’ shared work crew identity and their individual safety behaviors. There must be other mechanisms to explore in the safety climate–safety behavior link [28]. Fourth, although the two survey sites were representative in the company, the sample is admittedly a convenience sample in nature. Hence, whether the findings can be generalized to other regions needs more studies in future. Fifth, this paper focused on male coal miners. As one reviewer reminded us, some tasks are performed by females, and the findings should not be generalized to all coal miners. Improving coal miners’ safety behavior is a top priority for coal mine managers. Based on social identity theory and safety climate theory, this paper examined the effect of coal miners’ shared work crew identity on their safety behavior. This study found that coal miners’ shared work crew identity has impact on their safety behavior through the full me- diation of work crew safety climate. This paper contributed to the safety behavior literature, since it employed a multilevel analysis to investigate male coal miners’ safety behavior. Furthermore, this study confirmed work crew identity as an antecedent of work crew safety climate, enriching safety climate theory. These findings help practitioners formulate more targeted and effective measures to increase male coal miners’ safety behavior. Limitations and future research were also discussed.",
    "Author Contributions: Conceptualization, Y.S. and C.H.; methodology, Z.H.; software, S.L.; validation, Y.S. and C.K.H.H.; formal analysis, S.L. and C.K.H.H.; investigation, S.L. and Z.X.; writing—original draft preparation, Z.H. and S.L.; writing—review and editing, C.K.H.H.; vi- sualization, Y.S.; supervision, Z.H. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement: The questionnaire survey was conducted in accordance with the Declaration of Helsinki and obtained approval from the Institutional Review Board of Shanghai Normal University (Approval code: 2023-018; 23 April 2023)."
]