[
    "Citation: Zhao, C.; Chen, G.; Wang, P.; Ding, T.; Wang, X. Does Sustainable Development in Resource-Based Cities Effectively Reduce Carbon Emissions? An Empirical Study Based on Annual Panel Data from 59 Prefecture-Level Cities in China. Sustainability 2023, 15, 8078. https://doi.org/10.3390/ su15108078 Abstract: This study presents an analysis of the impact of the National Plan for the Sustainable Devel- opment of Resource-based Cities (2013–2020) on urban carbon emissions and explores the underlying mechanisms of this policy’s effect. Panel data from 59 prefecture-level cities in the Shandong, Henan, Hunan, and Hubei provinces in China for the period between 2007 and 2019 were used to perform a DID (difference-in-differences) method analysis and conduct various robustness tests, including counterfactual testing, a PSM-DID (propensity score matching-difference-in-differences) method analysis, and a placebo test. The ﬁndings demonstrate that The Plan effectively reduces urban carbon emissions, with its effects varying across provinces and classes of resource-based cities. Speciﬁcally, Henan Province shows the most signiﬁcant effect in reducing carbon emissions compared to the other three provinces. The Plan is more successful in regenerative and recessionary resource-based cities than in mature ones. Furthermore, it reduces carbon emissions by decreasing cities’ dependence on resources, improving citizens’ quality of life, and limiting the pace of industrial development. This article provides important policy implications for promoting the sustainable development of China’s resource-based cities and achieving carbon emission reduction goals amidst the carbon peak and carbon neutrality contexts. Copyright: © 2023 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). In 2013, the State Council of China released The National Plan for the Sustainable Development of Resource-Based Cities (2013–2020) (hereinafter called The Plan), which was the country’s ﬁrst national, special plan aimed at promoting the sustainable development of resource-based cities. The Plan is designed to address the actual development needs of resource-based cities and outlines the following ﬁve key tasks, namely, the orderly development and comprehensive utilization of resources, the construction of a diversiﬁed industrial system, the effective protection and improvement of people’s livelihoods, the strengthening of environmental governance and ecological protection, and the enhancement of supporting capabilities. The Plan also sets four clear goals to be achieved, including a signiﬁcant increase in the levels of resource conservation and intensive use, a signiﬁcant improvement in the capacity for sustainable development, a signiﬁcant improvement in environmental quality, and a signiﬁcant increase in the incomes of urban and rural residents [1–3]. China’s urbanization is undergoing a transformation from a speed-oriented to a quality-oriented model, and promoting the green, circular, and low-carbon development of cities is essential to support their sustainable growth. Resource-based cities face the challenge of effectively reducing carbon emissions in their sustainable development path [4]. The Plan provides a framework for addressing this challenge by identifying 262 resource- based cities across the country and categorizing them into four types based on their resource security and sustainable development capabilities: growing, mature, recessionary, and regenerative. Growing-type resource-based cities are in the stage of increasing their resource devel- opment, with great potential for resource security and sufﬁcient momentum for economic and social development. Mature-type resource-based cities are in a stable stage of resource development, with strong resource security capabilities and a high level of economic and social development. Recessionary-type resource-based cities are facing resource depletion, lagging economic development, prominent livelihood issues, and great ecological, environ- mental pressure. Regenerative-type resource-based cities have basically freed themselves from resource dependence and are stepping into a virtuous circle of economic and social development [5]. Reducing carbon emissions is crucial for the sustainable development of resource- based cities, but they face immense pressure from both internal and external sources during this process [6,7]. The issue of “resource depletion leading to urban decline” is becoming more severe [8]. By analyzing the effectiveness, mechanism, and policy impact of reducing carbon emissions in resource-based cities during The Plan’s implementation, subsequent policies for the sustainable development of these cities can be better implemented. This paper investigates the extent to which The Plan has reduced carbon emissions in resource-based cities and examines the underlying mechanisms. Moreover, a heterogeneity analysis is conducted to identify variations in the effects of carbon emission reductions among resource-based cities in different provinces and of different types.",
    "It is important to clarify some relevant concepts. “A resource-based city” is a city that has been built and developed due to resource development and whose dominant industries are based on the exploitation and processing of local natural resources, such as minerals and forests [9]. “A quasi-natural experiment” refers to an intervention that individuals receive in response to the environmental changes they face, which makes the intervention random and controlled, similar to a randomized controlled experiment. Such interventions are termed quasi-natural experiments [10]. “A resource-depleted city” is a type of resource- based city in which the mineral resource development has entered the late [11], ﬁnal, or end stage, and the cumulative extractable reserves have reached a certain proportion of the recoverable reserves (usually 70%). Therefore, a resource-depleted city is fundamentally a resource-based city. “A coal resource-based city” is a city that gradually developed due to the local coal-mining industry, which plays an important role in the city’s industrial structure [12]. “A non-resource-based city” is a city whose primary economic activity does not rely on the exploitation and processing of natural resources relative to those cities whose main economic support is based on the development of natural resources [13]. “Green development” refers to a new type of development model that has the basic tenets of recycling, low-carbon emissions, and sustainability [14]. According to the deﬁnition given by the Organization for Economic Cooperation and Development (OECD) and the European Union’s statistical ofﬁce, environmental indus- try refers to an industry that provides products and services for measuring, preventing, restricting, and minimizing damage to the water, air, and soil in the environment as well as waste, noise, and ecosystem problems. “Economic instability” means that the overall economic environment is uncertain and volatile, and there may be economic downturns, inﬂation, rising unemployment rates, stock market crashes, and other situations. “The sense of acquisition” refers to the sense of satisfaction that arises from the objective material and mental gains of residents [15]. Passive improvement of the city’s green development level refers to the measures taken by the city to promote environmental protection and sustainable development under external pressure or conditions. Active improvement of the city’s green development level refers to the city’s active measures, such as improving energy efﬁciency, promoting renewable energy, optimizing urban planning and construction, and promoting the ecological, environmental protection and sustainable development of the city. Resource dependence refers to the squeezing out of factors that promote long-term economic growth during the development process of an economic entity under conditions of abundant resources, leading to a trend of backward industrial development and hinder- ing green transformation [16]. The price of pollution factors refers to an economic measure that incorporates the environmental and health costs of pollution emissions into the pricing of products or services to reﬂect their true cost. Eliminating backward production capacity refers to the elimination of a production capacity that does not meet the requirements of coordinated economic and environmental development under current economic and technological conditions [17]. An advanced industrial structure refers to an economic structure in which high-tech, high-value-added, and high-efﬁciency industries occupy a dominant position in a country or region. The Plan provides a quasi-natural experiment to study the effects of carbon reduc- tion measures on resource-based cities. In this paper, the implementation of The Plan is considered a natural experiment, based on the theory of quasi-natural experiments. The experimental group consists of resource-based cities in the four provinces, while non- resource-based cities serve as the control group. A two-way ﬁxed-effects DID method is employed to examine the effectiveness of The Plan in reducing carbon emissions in resource-based cities and to identify differences among different provinces and types of resource-based cities. The mediating effect is used to demonstrate how The Plan has contributed to a reduction in carbon emissions in resource-based cities. cities, with most of them concentrating on a number of issues such as upgrading man- ufacturing industries, economic development, unemployment, policy evaluation, and environmental degradation in resource-depleted cities. There are also some studies on the stages of evolution of transformation policies for resource-based cities, policy evaluation, and the impact of coordination with other policies. Currently, there is a lack of sufﬁcient re- search on the impact of The Plan on carbon emissions in resource-based cities. For example, Yu Linhui et al. (2022) found that the implementation of the resource-depleted city support policy had a signiﬁcant effect of enhancing the manufacturing complexity of the selected regions [18]; Sun Tianyang et al. (2020) found that the resource-depleted city support policy signiﬁcantly increased the regional GDP per capita and employment rate [19]; Du Chunli et al. (2018) constructed a new indicator system based on the systematic analy- sis method of combining qualitative and quantitative multi-objective decision-making to evaluate the performance of transformation policies for resource-exhausted cities [20]; Bai Xuejie et al. (2014) found that science and education support signiﬁcantly improved trans- formation efﬁciency, energy conservation, and emissions reduction in resource-depleted cities [21]; Zhang Wenzhong et al. (2023) summarized the evolution of policies on the transformation and development of resource-depleted cities in China over the past 20 years and the focus of transformational development at different stages [22]; Wang Hongjin et al. (2015) studied the impact of tax policies on the transformation and structural adjustment of coal-resource-based cities [23]. For the study of resource-based cities, there are certain limitations in the previous research studies, most of which analyzed the transformation policies of resource-based cities nationwide or in a certain region, and there is a lack of joint research on provincial aspects. For example, Ju Wenjing et al. (2022) used Hegang City in Heilongjiang Province as an example to explore the transformation and development of resource-based cities [24]; Feng Chao et al. (2022) constructed an evaluation system for the transformation efﬁciency of resource-based cities from the perspective of urban vitality to quantitatively evaluate the transformation efﬁciencies of 114 prefecture-level resource-based cities in China [25].",
    "In summary, the current research is less directly concerned with the impact of The Plan on carbon emissions, and the assessment of the sustainable development of resource-based cities is mainly carried out through the construction of an evaluation index system and an efﬁciency measurement and less through an analysis of the policy itself; in terms of the path of sustainable urban development, the impact of the policy on carbon emissions is explored less from the perspectives of quality of life and industrial development. In the analysis of heterogeneity, there are few analyses on the development stage of resource-based cities and the province where the resource-based city belongs. Thus, the contributions of this paper are as follows. Firstly, regarding the selection of the study sample, this paper selects provinces as the basis for the research sample, using resource-based and non-resource-based cities as the research subjects. After analyzing the effects of The Plan across central and eastern China and considering the variations in the release of key carbon emission units across different provinces [26], this paper chose the Shandong, Henan, Hubei, and Hunan provinces for study due to their relatively equal distributions of resource-based cities and large variations in the number of key carbon emission units. Although many studies have examined the transformation policies of resource-based cities, most only analyzed policies in a single region, which limits the generalizability of the ﬁndings to other provinces. Secondly, in terms of the research perspective, this paper explores the heterogeneity of different types of resource-based cities and provinces to investigate the differential characteristics of policies on the efﬁciency, temporal evolution, and causes of carbon emissions. By examining the stages of development and types of resource-based cities, this paper comprehensively explores the differences in the implementation effects of policies, providing insight into the focus of future green development for resource-based cities. Thirdly, regarding the selection of mediating variables, this paper selects resource dependence, quality of life, and industrial development as mediating variables based on an in-depth theoretical discussion of the mechanisms to analyze the effect of policies on reducing carbon emissions in resource-based cities. This approach provides new ideas for the path to reducing emissions in resource-based cities. The clear logical chain of “whether the implementation of The Plan has reduced carbon emissions—analysis of the mechanisms by which The Plan works—heterogeneity in the effects of The Plan” provides a more objective and rational understanding of the sources of policy-induced carbon reduction. From the perspective of ﬁnancial support policies, The Plan mainly supports the sustainable development of resource-based cities and their industrial transformation in four aspects so as to achieve the effect of reducing carbon emissions: resource development compensation, ﬁnancial transfer payment, declining industry assistance, and alternative industry support [27]. From the perspective of the evaluation system, The Plan clearly factors the ecological environment of resource-based cities into the system of evaluating sustainable development, which will help regions passively or actively improve the cities’ green development, thus reducing carbon emissions [28]. Resource dependency is one of the key elements affecting the transformation of the industrial structure of resource-based cities. The intensity of the extractive industry (min- ing) is an important indicator of a city’s resource dependency, which means that resource industries occupy an important position in the development of the city. On one hand, the booming resource industry has low requirements for labor quality, leading resource- based cities to underestimate human capital investment and hinder technological inno- vation [29,30]. Backward production technologies will exacerbate resource consumption, thereby increasing carbon emissions. On the other hand, as “rational people”, enterprises will invest a large amount of funds into resource industries that generate high profits but cause serious pollution, falling into the trap of “industrial structure rigidity” [31] and further increasing carbon emissions. However, The Plan supports resource-based cities in terms of ﬁnancial subsidies, the business environment, and the layout of industrial projects, increasing their focus on technology and human capital. On one hand, The Plan can stimulate enterprises to innovate production technology and improve resource utilization, thus reducing the direct input of resources in the production process and reducing excessive dependence on resources. On the other hand, The Plan promotes the development of new industries, such as modern service industries and high-tech industries, reduces the proportion of resource industries with high-carbon characteristics, reduces resource dependence, and thus may reduce carbon emissions.",
    "With the annual global climate conference, the importance of reducing carbon emis- sions has become a worldwide consensus, and carbon reduction is not limited to economic considerations. In a way, low carbon has effectively been translated into a factor of human well-being. The quality of life of urban residents is reﬂected in their consumption and income levels, the development of their city’s infrastructure, their social security, living environment, science, education, culture, and health, and other aspects, and an increase in the residents’ consumption levels is a direct indicator of the improvement in their quality of life. Environmental pollution poses a serious threat to human health, hinders the improve- ment of labor productivity and the increase in residents’ incomes, reduces talent attraction, and is not conducive to the healthy development of cities [32]. The Plan is conducive to strengthening the constraints and supervision of the resource-based urban environment, improving local environmental quality, enhancing the attractiveness of the city, promoting high-quality economic development, and ultimately promoting the overall income and consumption levels of residents. Residents’ consumption levels are increasing, and residents will have higher require- ments for the natural environment and the living environment, will pay more attention to the impact of their own behavior on the environment, and will become increasingly low-carbon in their consumption philosophy and low-carbon consciousness [33], which will help reduce carbon emissions. All in all, the public’s environmental gain is conducive to the reduction of carbon emissions. The Plan emphasizes the need to accelerate the construction of a diversiﬁed industrial system, nurture and develop successive alternative industries, encourage enterprises to explore industrial models suitable for local development, and promote the development of an advanced industrial structure. The implementation of The Plan will raise the price of polluting factors and eliminate the backward production capacity of pollution-intensive enterprises. The green barriers arising from the Policy have hindered the entry of polluting manufacturers in traditional industrial sectors, resulting in an increase in the number of clean enterprises [34]. Different industrial structures directly affect the level of environ- mental pollution, with the secondary sector considered to be the main source of emissions causing environmental pollution. Through the low-carbon orientation of The Plan, the government encourages the development of clean industries such as service industries and new industries and, to a certain extent, inhibits the development of traditional industries. The rapid development of industry has a positive impact on carbon emissions. Zhang Jianhua et al. (2012), in their study on the impact of petrochemicals on carbon emissions in China, indicated that China’s petrochemical industry causes a large amount of direct carbon dioxide emissions, and its large consumption of electricity adds to the large amount of carbon dioxide emissions [35]; Xu Shichun et al. (2012) illustrated that the main source of carbon emissions in China is the industrial sector, of which the power and oil-processing sectors are the main industrial sector sources of carbon emissions in China [36]. In order to complete the study, this paper combined data from CEADs (ceads.net) [37–40] and the EPS database, obtaining information on urban CO2 emissions from the former and control variable data and mediation variable data from the latter. This paper chose annual panel data for 59 prefecture-level cities from 2007 to 2019. Using the KNN algorithm and the China Urban Statistical Yearbook, missing data were ﬁlled in. As for control variables, this paper selected the following data by referring to the common practice in the previous literature [41–43]: the degree of government intervention—local fiscal general budget expenditure/GDP, abbreviated as POV; envi- ronmental regulation—the proportion of employees in the water, environmental, and public facility management industries to the total population, abbreviated as ENR; population density—the logarithm for population density was taken, abbreviated as LNPOP; financial development—the loan balance of financial institutions at the end of the year/GDP, abbreviated as FIN; infrastructure—urban road area/total population, abbreviated as LNINF; degree of openness to the outside world—foreign direct invest- ment/GDP, abbreviated as FDI; and the market ability degree—the proportion of private employees, abbreviated as MD. This paper took necessary logarithmic transformations of variables to reduce the difference between variables, making the data easier to handle and interpret while achieving the effect of improving the model’s properties. For the mediating variables, this paper selected the following data: resource dependency—the number of employees in the mining and quarrying sector/total num- ber of employees, abbreviated as MI; the consumption level, which represents the living standard—total retail sales of consumer goods/GDP, abbreviated as TRS; and the industrial development level—the added value of secondary industry/GDP, abbreviated as SI.",
    "The precise computations and descriptive statistical analyses for each variable are shown in Table 1. For the 767 data included in the study, the mean value of carbon dioxide after taking the logarithm (lnEMI) is 3.386, with a maximum value of 5.223 and a minimum value of 0.677, demonstrating a more uniform distribution of cities’ carbon emissions. The balanced panel data contains fewer data within the range of policy effects than those unaffected by the data, as indicated by the core explanatory variable’s mean value of 0.156 for the main explanatory variables. This paper attempted to build the following econometric model based on the afore- mentioned research background and data selection in order to investigate the effect of The Plan on carbon emissions in 59 cities in the Shandong, Henan, Hunan, and Hubei provinces. This paper then used the DID model to evaluate The Plan. Cities deﬁned as resource-based cities were included in the “experimental group” in the available data, whereas cities not classed as resource-based cities were included in the control group. Considering that the policy was released in late 2013, this paper set the ﬁrst year of policy implementation to 2014, i.e., the data from the cities in the experimental group before 2014 were set to did = 0, those from 2014 and after were set did = 1, and all sample data in the control group were set to did = 0. Based on the model construction ideas and the presentation of the above text, Equa- tions (1) and (2) were constructed using the double difference method. In Equation (1), ln EMIit is the explained variable, with subscripts i and t representing the i-th prefecture- level city and year t, respectively. The term γt denotes the time ﬁxed effects, and µi denotes regional ﬁxed effects for each prefecture-level municipality. In Equation (2), control variables are added compared to Equation (1), and Xit denotes control variables. The effect of The Plan on carbon emissions is represented by the estimated value of β1. If the predicted value of β1 is signiﬁcantly negative, from the evidence analyzed, a conclusion can be drawn that The Plan has signiﬁcantly promoted the reduction of carbon emissions in resource-based cities. In the process of model construction and data analysis, this paper drew upon the literature authored by JIA Caiyan et al [44]. The magnitude and signiﬁcance level of the coefﬁcients for the bi-directional ﬁxed effects DID model used to examine carbon dioxide emissions can be seen in Table 2. In the model (1) in Table 2, only the dummy variable (didit) was added, and both the year ﬁxed effect and the city ﬁxed effect were controlled. In the model (2) in Table 2, further control variables were added. Based on the regression analysis and parallel trend testing, this paper concluded that The Plan has a signiﬁcantly negative impact on carbon emissions at a level of 1% to 5%. The results of these analyses, aligned with the principles of characteristic development, coordinated development, and harmonious development outlined in the National Plan for the Sustainable Development of Resource-based Cities (2013–2020), as well as the objectives of achieving a high-quality living environment and improving ecological conditions, have made outstanding contributions to promoting the sustainable development of resource-based cities. It is worth noting that the strong promo- tion of carbon emission reduction policies in resource-based cities will play a signiﬁcant role in achieving China’s dual carbon goals. To utilize the DID model, it is necessary to meet the parallel trend assumption, which requires the treatment and control groups to share a similar trend prior to intervention. Failure to meet this requirement can lead to biased estimates and potential overestimation. In practical investigations, the temporal trend graph method and the event study method are commonly used to assess the parallel trend assumption. Among them, the event analysis method is considered more reliable and scientiﬁcally rigorous. To evaluate whether the sample satisﬁed the parallel trend assumption, this paper utilized the event study method. Equation (3) was created to perform parallel trend testing. Treati indicates whether city i in a single piece of data is included in the processing group. If so, Treati = 1; if not, Treati = 0. TIt indicates whether the year in a single piece of data is t years. If so, TIt = 1; if not, TIt = 0.",
    "As shown in Figure 1, there is a lag period in the impact of The Plan on the reduction of carbon emissions in resource-based cities, as there was no signiﬁcant difference in carbon emissions between the treatment and control groups from 2 to 7 years prior to The Plan’s implementation. However, a signiﬁcant reduction in carbon emissions was observed from the fourth year after The Plan’s implementation. Moreover, the parallel trend assumption between the treatment and control groups was essentially satisﬁed, indicating that the use By changing the timing of policy occurrence to conduct a counterfactual test, this paper advanced the policy action period by one, two and three periods respectfully and conducted a regression analysis, as shown in Table 3. As can be seen from the analysis in Table 3, after the policy time is advanced for one, two, and three years, the absolute value of core explanatory variable coefﬁcient becomes smaller, and it also becomes insigniﬁcant and does not pass the signiﬁcance test. The policy effect decreases in signiﬁcance and effect intensity. Therefore, the validity of the results is veriﬁed. This indicates that, in the counterfactual test, constructing the ﬁctitious did term cannot conclude that the policy can signiﬁcantly reduce carbon emissions. The conclusion obtained via the above baseline regression is non-random, that is, The Plan implemented in 2014 does indeed reduce the carbon emissions of resource-based cities. This paper randomly assigned the experimental group to a control group and ran- domly speciﬁed the point in time at which the policy would act to produce the wrong estimator ˆβrandom. This process was repeated 500 times to produce 500 ˆβrandom values, and their distribution was then observed. Due to the randomness, if a ˆβrandom = 0, it indicates that the incorrectly estimated coefﬁcients have no effect on the results, indirectly indicating that the baseline estimates remain valid even in the presence of some unobservable factors, as shown in the Figure 2 below. It can be seen from Figure 2 that most of the estimated coefﬁcients are on the right side of the vertical red dotted line, and most of the data points are distributed above the horizontal red dotted line with p = 0.1, which indicates that the policy signiﬁcance result and effect intensity are greatly reduced after the double random treatment, proving the robustness of the aforementioned benchmark regression results. Through the following formula, the PSM (propensity score matching method) can greatly lessen the gap between the experimental and control groups. In the process of constructing the PSM-DID model, this study refers to the approach adopted by SHI Daqian et al [45]. where Xi denotes the set of covariates for the ith prefecture-level city, i.e., the control variables described earlier. Pi(X) is the probability that the ith city is within the policy area, and the control group was obtained after matching the many non-policy area cities selected for the study that were close to the propensity score of the cities in the strategic area. The PSM-DID technique regresses the control variables on the dummy variable of whether the city is within the scope of the policy measures to obtain a propensity score. By using this technique, the sample data may be kept reasonably intact, and the paired cities that fall under The Plan’s implementation purview are those with the closest propen- sity scores. This work ﬁrst obtained the fundamental regression results and then used common hypothesis testing, balancing testing, matched score plots, and kernel density distribution plots to demonstrate the robustness of the results. This research used the PSM-DID approach for robustness testing to lessen systematic discrepancies in the trends of changes in resource-based and other cities as well as to lessen the estimate bias of the DID method. The results in Table 4 demonstrate that The Plan still considerably reduces carbon emissions with a coefﬁcient of −0.25, similar to the coefﬁcient reported in the baseline regression (−0.20), even after accounting for sample selectivity bias using the PSM-DID approach. Regarding the size and importance of the policy effect, the same conclusions as those of the two-way ﬁxed effects DID model were achieved. This conﬁrms the robustness of the prior model and ﬁndings. The model’s validity before applying the PSM-DID must be evaluated. Here, de- termining whether the variables in the experimental group and control group become balanced after matching was given priority. The ﬁndings in Table 5 and Figure 3 conﬁrm the validity of the use of PSM-DID in this study by demonstrating that the model supports the common hypothesis test and that only the outcome variable LNEMI is signiﬁcant, while other variables, such as POV and ENR, are not conspicuously different. Additionally, the majority of variables are “On support,” as shown in Figure 3.",
    "To further demonstrate the applicability of the PSM-DID technique, an additional equilibrium test was performed after the common support test. All variables were non- signiﬁcant after matching, as shown in Table 6. This result further proves the applicability of PSM-DID to this paper’s research topic. Moreover, this paper output the kernel density distribution map before and after matching results. Figure 4 shows that the propensity score worth the probability density of the experimental group and the control group is close after matching, and the matching effect of this paper is good. On the basis of the balance test and the common support test, the robustness of the PSM-DID results is further veriﬁed. With the use of the DID model and a series of robustness tests, this paper conﬁrmed the validity of Hypothesis 1, which states that The Plan signiﬁcantly reduces carbon emissions in resource-based cities. The baseline regression results indicate that The Plan has a signiﬁcant impact on reducing carbon emissions. To further investigate how The Plan achieves this reduction, this study explores its effects on resource dependency, quality of life, and industrial de- velopment, as posited in the theoretical hypotheses. A mediation analysis was used to examine whether these variables serve as mediators of the relationship between The Plan and carbon emissions. The mediation model is as follows: Mit represent the mediating variables, which include resource dependency, quality of life, and industrial development. Equation (6) examines the impact of the mediating variables on carbon emissions, while Equation (5) assesses the impact of The Plan on the mediating variables. The precise estimation results of the mediation effect model are shown in Table 7. The bootstrap test was used in the mediating model, and the test results are shown in Table 8. In terms of the resource dependence effect, The Plan is able to reduce resource depen- dence, as shown in column (1) of Table 7; because the coefﬁcient of resource dependence in column (2) is only signiﬁcant at the 10% level, it was further examined using the bootstrap test. According to the results of the bootstrap test in Table 8, resource dependence has a 38.596% relative mediating effect between The Plan and carbon emissions, with a 95% con- ﬁdence interval (CI) of (−0.130, −0.011). This suggests that resource dependence mediates the relationship between The Plan and carbon emissions to some extent. Over-reliance on resource extraction and processing industries is a common feature of resource-based cities, but The Plan can encourage enterprises to innovate production technologies and improve resource utilization, reducing the direct input of resources in the production process and reducing overdependence on resources. It can also lessen the proportion of resource-based industries with high-carbon characteristics, thereby reducing resource extraction and carbon emissions. In terms of the effect on the quality of life, The Plan can enhance citizens’ quality of life, as shown by column (3) of Table 7. The coefﬁcient for the level of quality of life in column (4) was further examined using the bootstrap test because it is only signiﬁcant at the 10% level. According to Table 8, the relative mediating effect of quality of life on The Plan’s relationship with carbon emissions is 18.250%, with a 95% conﬁdence interval (CI) of (−0.066, −0.005). This result suggests that quality of life mediates The Plan’s relationship with carbon emissions to some extent. The Plan aims to guide resource-based cities in restructuring their economic growth and enhancing sustainable development. The general quality of life of the population is increased as a result of the improvement in environmental quality, which also increases the location’s appeal to talent. Residents’ consumption habits change to shift toward low-carbon behaviors as the quality of life increases, which helps reduce carbon emissions. Residents are also more aware of the effects of their actions on the environment. In terms of the industrial development effect, The Plan is able to suppress industrial development, as shown by column (5) of Table 7. The bootstrap test was used to further analyze the coefﬁcient on the degree of industrial development in column (6) because it is only statistically signiﬁcant at the 10% level. The relative mediating effect of industrial development between The Plan and carbon emissions is 22.084%, with a 95% conﬁdence interval (CI) of (−0.078, −0.006), according to the signiﬁcant Bootstrap test results in Table 8. This suggests that industrial development partially mediates the relationship between The Plan and carbon emissions. The Plan proposes to vigorously cultivate and develop successive alternative industries as well as encourage the development of environmental industries, which is conducive to improving the advanced development of the industrial structure, evolving from the dominant share of the secondary industry to the dominant share of the tertiary industry step by step, and curbing the development of polluting manufacturers in traditional industrial sectors. The Plan lowers carbon emissions by restricting the growth of the secondary industry, which is the primary source of emissions causing environmental damage.",
    "This study segmented the raw data, enabling an examination of the variations in The Plan’s carbon reduction mechanism across different provinces. The subsequent ﬁndings are presented in Table 9. The heterogeneity analysis provides crucial understanding about regional disparities in The Plan’s impact on carbon emission reduction in resource-based cities. Particularly notable are the signiﬁcant results from Henan Province, suggesting that The Plan has had a more substantial impact on carbon emission reduction in this province compared to the others investigated in this study. As the province with the second highest number of resource-based cities, Henan has devoted signiﬁcant efforts to reducing carbon emissions. By reviewing the support policies for sustainable development in the transition of resource-based cities during the \"Plan\" implementation period in Henan, this paper ﬁnds that the province places a high importance on emissions reduction from resource-based cities. Two months following the release of the “Plan”, the Henan provincial government announced 15 resource-based cities within the province (seven of which are prefecture-level cities and eight are county-level), speciﬁcally highlighting Jiaozuo is one of the 64 declining cities nationwide. In 2016, Henan sup-ported resource-exhausted cities such as Jiaozuo, Puyang, and Lingbao to focus on key areas and adopt new technologies, industries, formats, and models, constructing diversiﬁed industrial systems for an intelligent transition, thus accelerating urban transformation and the relocation of industrial and mining areas. Today, Henan, through its transformation strategy from a coal city to a digital economy city, continues to push hard in industries and has forged a path of reform where numerous emerging industries replace traditional ones. The \"Henan Path\" in the transition of resource-based cities provides a model that other policy implementers can learn and draw lessons from. Table 10, which follows the detailed categorization outlined in The Plan, displays regression results of heterogeneity analysis, providing valuable insights into the effects of policy implementation in different types of resource-based cities. Speciﬁcally, in mature resource-based cities, the policy’s inﬂuence on carbon emission reduction appears to be negligible. In contrast, it signiﬁcantly curtails carbon emissions in regenerative and recessionary resource-based cities. This approach to studying the heterogeneity of carbon emission reduction across different types of resource-based cities draws upon the research of XU Wei-xiang et al [46]. Mediation effect analysis reveals that regenerative and recessionary resource-based cities can stimulate carbon emission reduction by decreasing resource reliance and limiting industrial growth. Conversely, for mature resource-based cities with a well-rounded and robust industrial and economic configuration, the strategy of fostering green transitions by restraining their primary conventional industries encounters certain impediments. On a comprehensive scale, it appears that within The Plan, mature resource-based cities may weigh more heavily on their own economic progression, thereby demonstrating policy in- sensitivity. Implementing stringent restrictions may potentially lead to economic instability. Promoting the sustainable growth of resource-based cities is crucial for achieving carbon emission reductions, carbon neutrality, and a peak in carbon emissions. This study scrutinizes the impact of The Plan on urban carbon emissions using the Difference in Differences (DID) model and annual panel data from prefecture-level cities to delve into CO2 emissions. The primary conclusions are as follows: First, the implementation of The Plan has been effective in signiﬁcantly lowering car-bon emissions. Second, the sustainable development impacts in resource-based cities vary signiﬁcantly across provinces and among various categories of resource-based cities. In particular, Henan Province shows more pronounced policy effects compared to the other three provinces. Additionally, the roles of declining and regenerative cities are more conspicuous in encouraging sustainable development in resource-based cities than mature cities. Third, the mechanism analysis reveals that The Plan mitigates carbon emissions by reducing cities’ dependence on resources, enhancing residents’ quality of life, and curbing industrial expansion. The Plan’s substantial potential to cut urban carbon emissions implies it can help China in reaching its dual carbon goals. Given these ﬁndings, this study presents the following recommendations: Firstly, it’s advisable to think about setting up model pilot provinces for the policy execution process. Regions like Henan Province, which performed well during The Plan’s implementation, should be recognized for their positive policy effects. They could serve as models for other regions by sharing their successful reform experiences, providing guidance on policy adoption, and boosting the policy’s effectiveness. The government should direct the demonstration effect of resource-based cities in cutting emissions, stimulating regional economic interaction, and promoting timely attainment of China’s carbon peak and neutrality targets. Establishing a long-term mechanism to back the sustainable development of resource-based cities is crucial.",
    "Secondly, various resource-based cities should choose the most sustainable devel- opment models based on their local resource endowment, urban positioning, industrial structure, growth strategy, and development stage. Mature-type resource-based cities should strive to lessen the negative effects of resource industry path dependence, promote industrial diversiﬁcation, and enhance urban development resilience. Regenerative-type resource-based cities should increase their agglomeration power, focus on boosting develop- ment and innovation capacity, and optimize the functional architecture of the urban ecology and environment to reduce resource dependence. Recessionary-type re-source-based cities should expedite the shift in their economic development mode. Thirdly, in future policies, the focus should be on the reform of mature-type resource- based cities and delegating power to local governments within reasonable limits. While recessionary and regenerative type resource-based cities play a signiﬁcant role in carbon reduction, the majority of resource-based cities in China are mature, and their reduction efforts will directly impact the achievement of dual carbon goals. Decentralization could be used as a speciﬁc implementation measure to allow mature resource-based cities to consider positive economic development while also restraining industrial development and minimizing the negative impact of resource dependence on the economy for further carbon reduction. Fourthly, to lessen the excessive reliance on resources, the government can raise the threshold for accessing resource extraction, incentivize businesses to adopt innovative production techniques, and enhance resource utilization. These measures can reduce the direct input of resources into the production process. Moreover, the government should invest more in low-carbon technologies, speed up the diffusion and application of carbon capture, storage technologies, and energy-efﬁcient technologies through incentive mechanisms, reduce the dependency of resource-based cities on fossil energy. Fifthly, regarding the quality of life effect, enhancing the living standards of residents should be attached much more attention. On the one hand, we should focus on elevating the material well-being of residents, lifting their sense of acquisition, which would further stimulate their demand of a better living environment and motivate their carbon reduction awareness; on the other hand, we should emphasize enriching the spiritual well-being of residents, so that they would gradually increase their low-carbon awareness and adopt a more “low-carbonized” consumption concept. Enterprises need to intensify their R&D and supply capacities of low-carbon products, jointly facilitate the green transition of residents’ consumption structure, and thereby decrease carbon emissions resulting from consumption. The mechanism of sustainable development of resource-based cities to reduce carbon emissions by improving the living standards of residents is worth maintaining and deepening. Lastly, fostering the development of alternative industries can improve the effective- ness of sustainable development policies in driving industrial development. Government departments can play an active role by setting appropriate environmental quality goals and assessing urban environmental quality. This will compel local governments to act against environmental pollution, reduce the proportion of heavily polluting and energy-intensive traditional industrial sectors, vigorously promote the growth of modern ser-vice sectors and high-tech sectors, and strengthen the integration and development of traditional industries with new ones. This study provides solid evidence of the link between CO2 emissions and sustainable development in resource-based cities. Nevertheless, the study has some limitations. For in- stance, future research could explore how sustainable development in a city with abundant natural resources affects carbon dioxide emissions in adjacent areas. Additionally, carbon emissions studies should consider suitable control indicators such as intensity, concentra- tion, and pollution indices, besides total indicators. Given the unknown future effects of sustainable development implementation in resource-based cities, research on the use of dynamic econometric models for policy modeling is urgently needed. Further research examining the relationship between sustainable development and carbon emissions in resource-based cities would be of interest. Author Contributions: Methodology, software, formal analysis, data curation, writing—original draft preparation, and supervision, C.Z.; validation, investigation, resources, writing—review and editing, and project administration, X.W.; visualization, writing—review and editing and conceptual- ization, G.C. and P.W.; supervision, T.D. All authors have read and agreed to the published version of the manuscript."
]