[
    "Abstract: Foodwastehasbecomeaglobalproblem,causingwidespreadconcerninallsectorsofsociety. Many scholars and institutions have researched this issue from diﬀerent perspectives, but theoretical and empirical research on food waste from the perspective of consumer perception is still limited. Therefore, this study constructs a theoretical framework based on food waste behavior of households and empirically analyzes the eﬀect of consumer perception on food waste by 273 Chinese urban households eating at home. The reliable urban household food waste data are based on a combination of household questionnaire surveys, bookkeeping surveys, weighing surveys, and semi-structured interviews in 2018. The survey site is Zhengzhou City in Henan Province. The results show that the higher urban household consumer perception positive index, the smaller the amount of food waste per capita per meal, and the higher urban household consumer perception negative index, the greater the amount of food waste per capita per meal. These results suggest consumer perception aﬀects urban household food waste behavior signiﬁcantly. We need to encourage consumers to form a joint eﬀort to change consumer perception about food waste in order to reducing food waste. Food waste is a global problem causing widespread concern. Globally, around one-third of the world’s food produced for human consumption (about 1.3 billion tons) is wasted or lost per year [1]. Currently, food waste is widespread and since it is a burgeoning problem, it has been the subject of much research. Food waste has been studied in the United States [2], Switzerland [3], Finland [4], Germany [5], Spain [6] and China [7]. Food waste is a signiﬁcant problem in China, where the food waste per capita per meal in 2015 is 79.52 g in the catering industry [8] and the annual food waste in 2009 is estimated to be around 120 million tons [9]. According to a report jointly issued by the World Wide Fund for Nature (WWF) and the Institute of Geographic Sciences and Natural Resources Research, Chinese Academy of Sciences (IGSNRR, CAS), food waste in the urban areas of China is around 17–18 million tons in 2015 alone, which is equivalent to 3% of the national food production [10]. Food waste means not only the waste of food itself, but also an ineﬃcient and wasteful input of the water, land, and other resources needed to produce the food. Therefore, food waste not only consumes global resources [11–13], but also contributes to severe resource and environmental pressures [14–16]. Various resources are used for the production of food, so the waste of food also means the loss or waste of those input resources, like land resources and water resources. According to the Food and Agriculture Organization of the United Nations, global food waste means the opportunity loss of arable land, surface water, and carbon dioxide emissions. For instance, when converted into greenhouse gases, the food discarded annually by Finnish households is approximately equal to the annual carbon dioxide emissions of 100,000 cars [17]. Even today, more than 820 million people in the world are still hungry [18]. If food loss and waste reduction could be achieved, by redistribution of the wasted food and/or by utilizing scarce input resources eﬀectively, it would gradually help to reduce the numbers of hunger-stricken people from a global perspective. Food waste occurs in all stages of the food supply chain and around 35% of the food loss and waste occur from the consumer side [19]. Household food waste accounts for the most signiﬁcant part of total food waste in developed countries [20,21]. Globally, this part is expected to increase with growing middle classes in emerging countries [22]. For example, around 130 million kg of food waste is generated each year (23 kg per capita/year) by the household sector in Finland [17]. The annual average food waste of households is estimated to be 65.49 kg per capita in Hungary [21]. In Germany, household food waste accounts for a large share of total food waste [23]. In Tehran, every consumer in household wastes about 27.6 kg of edible food annually and about 25 million tons of food go wasted or lost in Iran [24]. Because of the importance attached to this issue, an increasing number of studies on household food waste have been published in recent years [25–30]. Generally, food waste at the consumer level is the result of consumer behavior, which is inﬂuenced byconsumerperception. Toreducefoodwaste, itisthereforenecessarytodevelopaclearunderstanding of its root causes at the individual level [31]. Currently, the situation and causes of food waste are not entirely clear, as there is a lack of ﬁrst-hand survey data. Over half of existing publications are based only on secondary data [32], which signals the data on food waste in existing publications are also inconsistent, and the estimated results are quite diﬀerent. Further, few studies analyze the food waste behavior of households eating at home based on consumer perception. Consequently, based on the theory of allocation time proposed by Becker [33], this study attempts to construct food waste theoretical framework eating at home. Based on reliable food waste data from ﬁeld surveys of urban households, the eﬀect of consumer perception on food waste behavior of urban households eating at home is empirically and quantitatively analyzed. This study will help broaden food waste research and provide scientiﬁc support for food waste reduction.",
    "This study constructs a theoretical framework for the study of household food waste, based on a theory of allocation time proposed by Becker [33]. On this basis, the study analyzes the eﬀect of consumer perception on the food waste behavior of urban households eating at home. The speciﬁc purpose of the theoretical framework deduction is to show that consumer perception is an important factor aﬀecting food waste. According to traditional and improved selection theories, households maximize their utility functions during meals. We deﬁne U as the total utility of the household during the process of decision-making meal and dining at home. Based on the assumption of rational individual in economics, households should also maximize their total utility in the process of decision-making and eating. The maximum total utilities can be expressed as Umax. According to the Becker model, households use their time and the products available in the market to produce basic products, which can be directly incorporated into the households’ utility functions. Households are aﬀected by consumer perception when producing basic products, therefore consumer perception should be included in a household’s utility function. Consumer perception is indicated by the symbol δ. We deﬁne y as the basic commodity produced by household using time and market commodities. They include household food intake x and household food waste w. During household decision-making meal and dining at home, the optimal combination of a household’s products is selected to maximize the total utility of meals: where y is a function of market products and time and yi represents the i-th basic commodity produced by the household’s comprehensive use of time and market goods, zi represents the food raw materials purchased by the household from the market, and Ti represents the household raw food materials used along with time to produce household basic commodities. We deﬁne x as the household’s food intake, which aﬀects its overall utility U, where x belongs to y. Based on the basic attributes of urban households eating at home, the quantity of food prepared by urban households is greater than or equal to the expected food intake, that is, yi ≥ E(xi). The utility of these urban households can be divided into the utility from simple food intake by household members and the utility from food waste in the household. We deﬁne Ueat as the utility derived from simple food intake by household members. Its eﬀect is based on the physiological functions of urban households. When household members have dining needs, this variable measures the eﬀect of the simple food intake on them. Ueat is generally aﬀected by both household food intake and the consumer perception of household, which is expressed as: Duetothephysiologicallimitsoffoodbeingconsumedbyhouseholdmembersandtheassumption of economic rationality, the total utility of household meals should be maximized so there is a maximum household food intake during meals. The utility from simple food intake Ueat, for household members should meet the following conditions: The utility from food intake by household members ﬁrst increases and then decreases, and its marginal eﬀect is decreasing. If there exists xα i so that ∂Ueat/∂xi = 0, the utility from simple food intake < 0. for household members begins to decline, ∂Ueat/∂xi As rational individuals, when household members eat xα i , their simple food intake has the greatest < yi exists at this time, there is a waste of food in the household. If we deﬁne wi as the utility. If xα i amount of food waste in the household, then: At this time, household utility comes from two aspects: The utility from food consumption for household members and the utility from food waste for household members. We deﬁne Uwaste as the eﬀect of food waste on households. The w is the amount of food wasted by the household and Uwaste is part of the overall utility U. Uwaste is aﬀected bythe amount of household food waste and the consumer perception of household food consumption. Its formula is as follows: We deﬁne x i as the household’s optimal amount of meals to maximize the total utility of the household dining at home, Umax. When the problem of food waste has no eﬀect on the household, that is, when the household’s perception level of food waste is zero (δ = 0), the household can maximize its eﬀect by adjusting the amount of food consumed. When the amount of household meals reaches xα ∗ = xα their utility is maximum. At this time, there exists x i , When the problem of food waste has a negative eﬀect on the household, the household has two ways to compensate for the negative eﬀect. The ﬁrst is when the household controls the number of prepared meals, yi, so that a small amount of food is prepared to prevent waste; the second is when the number of prepared meals is greater than the amount of the meals, meaning that the household reduces food waste by increasing meal amounts.",
    "In the ﬁrst case, yi ≤ xα i , and when yi ≤ x i, then the household consumes all the prepared food and there is no food waste. In the second case, yi > xα i , and when yi the size of meals and maximize its utility. The x > x i, the household will reduce food waste by increasing ∗ ∗ < xi i is the optimal meal quantity. When x i < yi, if the household chooses to increase the amount of meals to reduce food waste, the increased meals, ∆xi = xi − x ∗ i, will have negative eﬀects on the household (e.g., physical discomfort). At this time, the amount of food waste in the household will also change due to changes in the amount of meals. As households seek to maximize the utility of their own meals, when a household chooses to increase the amount of meals to reduce food waste, the changes in its utility come from two aspects: The ﬁrst is the decline in the utility caused by increased meals and the second is the increase in utility caused by waste reduction. When the marginal increase and decrease of the household meal utility are equal, the meal amount is the optimal meal amount of the household. In the ﬁrst case, the utility level is less than the utility level of the optimal meal amount, indicating that there is a loss of utility. In the second case, since the actual amount of meals is greater than the optimal amount and a certain amount of food waste is generated, the utility level is less than the utility level of the optimal meal, meaning that there is a loss of utility. Rationally, households will choose the lower utility loss. Function y shows that the household is not only a unit of utility maximization, but also a unit of production. The household comprehensively uses time and market products to produce the basic product yi through production function y, and selects the optimal combination of household products to maximize this utility function. Household needs raw materials and time to prepare food so the household meals are maximized also constrained by commodities and time. where pi represents the unit price vector of yi (i.e., xi and wi), Tl represents the time vector for work, l represents the remuneration per unit of Tl, V represents other income, Ifood represents the total household expenditure on food, and Iunfood represents the total non-food expenditure of household. The time constraints for maximizing the utility of household meals are: where T represents the total amount of time available, Tfood is the time vector used by the household for food consumption, and Tunfood is the time vector for activities other than the working and the consumption of food. Time vector Tl, which represents the time constraint used for work, is included into the commodity constraint and a single constraint is obtained as follows: Then, ∂δ is the eﬀect of consumer perception on household food waste behavior when eating at home. It should be pointed out that consumer perception is reﬂected by the consumer perception positive and negative indexes. Consumer perception positive index refers to a series of factors that can promote consumers to reduce food waste. Consumer perception negative index refers to a series of factors that cause consumers food waste. The urban household food waste data were based on combination of household questionnaire surveys, bookkeeping surveys, weighing surveys, and semi-structured interviews. Stratiﬁed random sampling is used to obtain the urban household food waste sample. The surveyed site is Zhengzhou City, Henan Province and the surveys take place from April to May in 2018. First of all, according to the ranking of per capita disposable income of urban residents in Zhengzhou, municipal districts of Zhengzhou were divided into three levels, from which Jinshui District, Erqi District, and Huiji District were randomly selected as research areas, and the sample size of each district was determined according to the proportion of households in each urban area. Secondly, based on the level of community development in each research area, the communities in the research area were divided into high, medium, and low levels, and sample communities were randomly selected from the communities with diﬀerent levels. Finally, several residential areas were randomly selected from each sample community, and the sample households are determined according to the principle of equal distant sampling based on the household register of the residential area.",
    "There was a total of 309 households that participated in the survey and 273 households completed the questionnaires and provided reliable data at a response rate of 88.35%. Table 1 shows the surveyed areas. Each household was followed-up for three consecutive days. Due to the diﬀerences in food consumption and waste behaviors between weekdays and weekends, the three consecutive days included two consecutive weekdays and one weekend day. Speciﬁcally, the investigator visited the household every day to obtain its food waste data by weighing and recording the edible food discarded by the household during meals and the food discarded due to expiry or deterioration. Uniform electronic scales are used to weigh the waste materials. The unit of measurement of the electronic scales was grams and the maximum load was 5 kg. This study uses the amount of food waste per capita per meal of urban households eating at home as dependent variable to empirically analyze the food waste behavior of urban households eating at home. Since part of food waste per capita per meal data of the respondents is equal to 0, a Tobit model is adopted to overcome the data interception of the dependent variable. This model is considered that the dependent variable has a lower limit, and the upper limit or the existence of the limit value has already received extensive attention in the academic community. This model is a restricted dependent variable model in which the explanatory variable is not only continuous, but also tailed. We deﬁne y as a continuous random variable representing the amount of food waste per capita per meal of urban households. Only when y ∗ is greater than 0, is y = y ∗ . When y ∗ is less than or equal to 0, y = 0. At the same time, a series of exogenous variables x is chosen to explain the behavior of y. In this way, the standard Tobit model is formed. In the above formula, F and f are the distribution and density functions of the standard normal distribution, respectively. The log-likelihood function of this model is as follows: In this model, yi represents the amount of food waste per capita per meal of the i-th sample and xi represents the factors that aﬀect food waste. In this study, we focus on analyzing the eﬀect of consumer perception on food waste behavior. The food waste measured in this study is the edible and non-liquid portion of the residual food. Inedible constituents of the food surplus like excipients, bones, and liquids are excluded. Because during the cooking process, food may absorb water, dehydrate, or absorb fat, we convert the measured weight of waste into the weight of food raw materials. Urban household consumer perception is reﬂected by the urban household consumer perception index, which consists of the positive and negative consumer perception index. Deﬁnitions of the main variables are shown in Table 2. The consumer perception positive index consists of 10 survey questions, as does the negative index. Values assigned to each reply are in the number sequence from ﬁve to one, where ﬁve represents strong agreement and one represents strong disagreement. The questions of the positive and negative perception indexes are shown in Tables 3 and 4, respectively. The overall per capita per meal food waste in urban households is shown in Table 5. This study divided food into eight categories: Staples, meat (including aquatic products), vegetables, soybeans and their byproducts, eggs, dairy products, dried fruits/nuts, and fruit. The per capita per meal food waste of urban households eating at home was 5.54 g, including per capita per meal waste of 1.04 g of staple products, 0.83 g of meat (including aquatic products), 2.60 g of vegetables, 0.05 g of soybeans and their byproducts, 0.13 g of eggs, 0.46 g of dairy products, 0.04 g of dried fruits/nuts, and 0.39 g of fruit. The percentage of vegetables waste per capita per meal in urban households was as high as 46.97%, while the percentage of staple waste per capita per meal in urban households was 18.75%. Further, the percentage of meat (including aquatic products) waste was 15.02%, that of dairy products was 8.35%, and that of fruits was 7.07%. The percentages of eggs, soybeans and their byproducts, and dried fruits/nuts waste per capita per meal in urban households accounted for a relatively small proportion.",
    "The descriptive statistics of the main variables are shown in Table 6. The amount of food waste per capita per meal of urban households eating at home in China was 5.54 g. The minimum value of the consumer perception positive index of urban households was 24 and the maximum was 49; the minimum value of the consumer perception negative index of urban households was 16 and the maximum was 45. The sample size was 273. There were a few interesting ﬁndings. The mean value of gender was 0.21, indicating that more women participated in the survey. The average age of the respondents in the questionnaire was 50.64. During the survey process, the research team found that the age of urban household residents who cook and eat at home was on the high side, since an increasing number of young people prefer to eat out or order takeout. The data showed that 48.4% of the respondents had farming experience. There were 273 urban households surveyed in this study, of which 83 households’ food waste amount was not zero. The empirical results of Tobit model are presented in Table 7. The results show that urban household consumer perception had a signiﬁcant eﬀect on food waste behavior. The higher urban household consumer perception positive index, the smaller the amount of food waste per capita per meal, and the higher urban household consumer perception negative index, the greater the amount of food waste per capita per meal. Food waste behavior of urban households was not only aﬀected by consumer perception, but also by other factors. For instance, food waste behavior in urban households was also aﬀected by the employment status of the respondents. The food waste per capita per meal of an urban household with a full-time employment status was 8.35 g. For a household with part-time employment status, the waste was 6.15 g, and for unemployed households, food waste was 5.10 g. Retired households wasted 3.10 g of food, while homemaker households wasted 3.41 g, and those performing odd jobs wasted 6.07 g. Urban households’ food waste with an employment status of other was 1.88 g. Further, the food waste of urban households with pets was signiﬁcantly lower than those without pets. To test the robustness of the results, this study used the food waste frequency of urban households eating at home instead of the amount of food waste per capita per meal as the dependent variable. Since the frequency of food waste eating at home for urban households was an integer value that is not less than 0, a counting model was used for estimation. The empirical results of the counting model are shown in Table 8, highlighting that consumer perception still had a signiﬁcant eﬀect on food waste behavior in urban households. Therefore, the original conclusions were deemed robust. The amount of food waste per capita per meal of urban households eating at home is 5.54 g, which is lower than that found in middle schools’ [34], university schools’ [35], and restaurants’ food waste in China [36]. This discrepancy may be attributable to the change in dining environment or place. What we study is eating at home, while eating in schools and restaurants is categorized as dining out. When eating at home or dining out, people may be in diﬀerent psychological states, which results in diﬀerent food waste behaviors. In the process of dining out, consumers may also be unfamiliar with the dining environment. They may not fully anticipate the served quantities of the ordered dishes and may be unaware of the quality of the food, resulting in asymmetric information and more food waste. In the process of eating at home, due to a thorough understanding of the taste and amount of meals eaten by family members, households can avoid food waste in this respect. In our study, we ﬁnd several interesting points that deserve our attention. First, in the face-to-face interviews conducted with household members, we ﬁnd that consumer perception related to food waste varies from person to person and diﬀerent households have diﬀerent food waste behaviors. Second, due to the lack of relevant food storage knowledge, urban households sometimes have poor food preservation methods, resulting in unnecessary food waste. Third, when urban households have guests, they tend to prepare more food than necessary to entertain the guests in the name of hospitality and “face culture” in China, especially as it is more diﬃcult to grasp the tastes and meals of visitors, which results in greater food waste. Fourth, most urban household residents report one major cause for food waste as the leftovers being too less to be stored and eaten at a later time. Finally, some household members are unable to reuse leftovers eﬀectively and some foods are less likely to be reused even when stored.",
    "The ﬁndings of the study provide useful suggestions for reducing household food waste. It is found that when consumers are conscious of reducing food waste, they will do their best to reduce food waste. In other words, individuals who have a higher intention to reduce food waste have lower levels of food waste, which is consistent with previous literature [37]. There are many factors that aﬀect consumers’ food waste behavior. In order to reduce food waste, we need to intervene in these factors to encourage people to reduce food waste. Among these measures to reduce food waste, we think it is an easy and low-cost way to interfere with consumer perception. Improving consumers’ perception of the importance of reducing food waste, such as through media promotion or through organizing events will contribute to the sustainability of food system. The food waste behavior of urban households eating at home may be inﬂuenced by other information and factors, such as the psychological state of households when eating, which requires further analysis. In the future, additional and in-depth research is necessary to identify consumer food waste behavior. Further urban-level research and a larger sample group are needed. This study uses primary food waste survey data on households eating at home in Zhengzhou, and obtaining additional research data from other cities is imperative. There is a growing body literature on food waste. However, most existing studies are mainly focused on descriptive statistical analysis, while fewer empirical models are used for analysis. Most studies also relied on the secondary data, while a handful of studies are based on ﬁrst-hand data that are obtained mainly by using self-reporting method. We believe that the amount of food waste calculated by this method appears to be overestimate or underestimate. In our analysis, we quantiﬁed food waste by weighing method and converted the wasted food into raw food materials, which provides a high resolution of insights on a speciﬁc food category. The food waste data are estimated more accurately by weighing method. The results show that consumer perception aﬀects urban household food waste behavior signiﬁcantly and also demonstrate the relevance of the theoretical framework. The food waste behaviors of urban households are not only aﬀected by consumer perception, but also by other factors such as the employment status of respondents. Further, the food waste behaviors of urban households who have pets are signiﬁcantly diﬀerent from food waste behaviors of urban household with no pets. Food waste of urban households with no pets is lower than urban households who have pets. To test the robustness of the results, we substituted the average amount of food waste per capita per meal with the frequency of food waste eating at home in urban households. Counting model regression results show that consumer perception still has a signiﬁcant impact on food waste behaviors in urban households. Therefore, the original conclusions are robust. In addition, paying attention to the eﬀect of consumer perception on household food waste behavior is important for exploring possible measures to reduce food waste. Our results conﬁrm the eﬀect of consumer perception on household food waste behavior. When proposing reduction measures of food waste, the results should be taken into account in order to reduce food waste at the individual consumer’s level. Therefore, it needs the participation and actions of consumers to reduce food waste. In other words, to reduce food waste at the consumer segment, we need to encourage consumers to form a joint eﬀort to change consumer perception about food waste. Author Contributions: Data curation, P.Z. and D.Z.; funding acquisition, D.Z.; investigation, P.Z. and D.Z.; methodology, P.Z.; resources, S.C.; supervision, S.C.; writing—original draft, P.Z.; writing—review and editing, D.Z. All authors have read and agreed to the published version of the manuscript. Acknowledgments: We deeply appreciate the cooperation of researchers from the Institute of Geographical Sciences and Natural Resources Research, Chinese Academy of Sciences, student volunteers from China Agricultural University, Beijing Institute of Technology, Zhengzhou University, Henan Agricultural University, Henan University of Animal Husbandry and Economy, Shaanxi University of Science and Technology, and Zhengzhou Institute of Finance and Economics, and all interviewed questionnaire respondents in our ﬁeld survey. We especially appreciate Junfei Bai from the College of Economics and Management in China Agricultural University for his suggestions and contributions to this study."
]