[
    "Abstract: As China’s anti-corruption campaign intensifies, several of those involved in various capaci- ties in the public sector are demonstrating slackness, a lack of moral awareness, and a weakened sense of responsibility. This study analyzes the multiple mechanisms influencing the responsible behavior of public sector personnel by combining certain key factors, such as managers’ moral leadership style, psychological security, and the notion of interactive justice. Based on social information processing theory and social exchange theory, this study constructs a dual mediation model (psychological secu- rity and interactive justice) to explore the mediating psychological mechanism of moral leadership influencing employees’ responsible behavior. The results of a two-stage paired survey and structural equation modeling analysis of civil servants from 48 departments and eight units in Shandong and Henan provinces show that moral leadership positively impacts responsible behavior. Moreover, psychological security and interactive justice play a mediating role between them. Furthermore, this study elaborates upon the mechanism of moral leadership affecting the responsible behavior of employees, which is of great value for improving the efficiency of government management and guiding civil servants to behave more responsibly. Citation: Zhang, Z.; Mao, Y.; Liu, W. The Psychological Mechanism of Moral Leadership Influencing Responsible Subordinate Behavior. Systems 2024, 12, 408. https:// doi.org/10.3390/systems12100408 Copyright: © 2024 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). China is currently going through a critical period of institutional reform and social transformation, and its impact has been felt by the public sector. Some leading cadres of Chinese government departments have caused great damage to China’s development, and even its social welfare, due to their moral deficiency and selfish pursuits. This has had a huge impact on the working state and behavior of civil servants, resulting in the lack of a responsible consciousness displayed by public sector personnel. In particular, “inaction” as a behavioral phenomenon constantly emerges in the current context. Behavioral researchers have always paid too much attention to the traits and behaviors of leaders and not enough attention to leadership virtues [1,2]. In recent years, there have been frequent incidents wherein leading officials of the Chinese government have damaged China’s development and social well-being with their lack of ethics and vested interests. Therefore, academics and policymakers have begun to reflect on ideas discussed previously by the scholarship on leadership and devoted themselves to the connotation construction and influence process analysis of moral leadership. When the behavior of moral leaders is close to traditional culture, and the current social reality is consistent with the values and expectations of their subordinates, moral leaders will naturally gain the recognition and acceptance of subordinates and have an impact on their attitudes and behaviors [3,4]. In this regard, academic and political circles have begun to reflect on the prior research on leadership. This subfield is devoted to the connotation construction and influence process analysis of moral leadership. Although moral leadership emerged in the business environment [5], it should be studied as an important factor influencing subordinates in the public sector. Moral leadership refers to managers who exhibit personal moral behavior in the process of communicating with subordinates and practice such moral behaviors among subordinates through management processes such as two-way communication, reinforcement, and decision-making [6]. A series of domestic and foreign studies have shown that moral leadership behavior has a positive impact on employees and organi- zations, including improving employees’ job satisfaction [1] and promoting their voice behavior [7]. Meanwhile, moral leadership can also effectively reduce bad behavior and interpersonal conflict within the organization [8–10]. The influence of moral leadership on employees is primarily reflected in two ways: setting a moral example and establishing a high-quality interaction mode with subordinates [8,11,12]. Existing studies show that the impact of leadership on employees’ behavior and creativity is mainly realized by influ- encing employees’ psychological states [2]. In the extant literature, researchers explain the impact of moral leadership on employees’ work results based on two theories: First, social learning theory emphasizes the power of role models [13]. By setting up moral examples of leaders, subordinates can also demonstrate similar characters, values, and behaviors as leaders. Second, the social exchange theory emphasizes that leaders need to establish a high-quality communication mode for their subordinates [14].",
    "With the support of the two aforementioned theories, research on moral leadership has achieved rich results [2,3,8,12]. However, both social learning and social exchange theories face a common problem when explaining the effect of moral leadership. It is impossible to analyze how moral leadership changes employees’ work performance from the perspective of employees’ self-cognition. Social learning theory focuses on the power of role models, while social exchange theory emphasizes the importance of reciprocity. How- ever, existing research shows that employees’ self-cognition and evaluation are important sources impacting their intrinsic motivation [15]. Thus, only when the intrinsic motivation is clear can we better understand whether moral leadership can have a positive impact on employees continuously. Moral leadership sets an example for employees through its noble character and moral conduct and fosters a relationship of trust with employees through fairness, respect, and care. When moral leadership is combined with the two mediating variables of interactive justice and psychological safety, they jointly influence job performance and conscientious- ness: (1) The combination of moral leadership and interactive justice: Moral leaders en- hance employees’ sense of interactive justice through fair and transparent decision-making processes and respectful communication styles. This sense of justice, in turn, promotes em- ployees’ trust and organizational commitment, thereby stimulating higher job performance and conscientiousness [16]. (2) The combination of moral leadership and psychological safety: Moral leaders create a supportive and inclusive work environment that fosters psychological safety among employees. This sense of safety encourages employees to ac- tively express their opinions, seek feedback, and take on responsibilities, thereby enhancing their innovation capabilities and voice behaviors, which further promote job performance and conscientiousness. As crucial mediating variables between moral leadership and job performance or conscientiousness, interactive justice and psychological safety play signifi- cant roles in promoting positive employee behaviors and enhancing job performance and conscientiousness. Therefore, leaders should prioritize nurturing and maintaining these two mediating variables to better harness the positive effects of moral leadership [17]. Most existing research has concentrated on the direct connections or mediating factors between moral leadership and employee behavior, with little exploration into the under- lying psychological mechanisms. This study bridges this gap by analyzing the bridging role of psychological factors such as psychological safety and psychological empowerment between moral leadership and subordinate responsible behavior. Specifically, it reveals how moral leadership stimulates stronger responsible behavior by reinforcing subordinates’ psychological safety and empowerment, offering a novel perspective for understanding the effectiveness of moral leadership. While the Western literature is rich in research on moral leadership, studies in the context of Chinese culture are relatively scarce. Rooted in Chi- nese cultural soil, this study delves into the specific mechanisms of how moral leadership influences employee responsible behavior, thereby enhancing the universal applicability and explanatory power of moral leadership theory across different cultural environments. Social exchange theory has its roots across multiple disciplines, such as classical utilitarianism, anthropology, and behaviorist psychology [18]. According to this theory, when individuals exchange resources with others, they decide whether to exchange by measuring the perceived benefits and costs emanating from the exchange process [19] and pursue the maximization of benefits and the minimization of costs [20]. The theory holds that all human social activities can be regarded as exchange behavior and that the relationship of exchange is formed on the foundation of mutual benefit. In other words, one party provides help and support to the other party but cannot predict the return behavior of the other party, making the exchange relationship uncertain and risky [21]. Only when based on trust can it develop into a long-term exchange relationship. Referring to the research of Sweeney and Soutar [22], psychological security in this study primarily refers to the psychological pleasure and satisfaction that individuals obtain from the process of exchange. The positive evaluation, support, and sense of belonging obtained by individuals in the exchange of resources with others meet the benefits of individual social interaction needs [23]. Social exchange theory emphasizes that individuals and organizations (leaders) promote voice behavior in the form of social exchange (contract). However, facts have proven that even in a relaxed, independent, and supportive environment, there are still many people who are not willing to take the initiative of responsibility or give back to organizations [24]. Therefore, based on the social exchange theory, this study has as its point of departure the internal cognitive processes of individuals, particularly the internal mechanisms governing responsible behavior.",
    "Moral theory is a theoretical system that systematically studies and elaborates on moral phenomena, principles, norms, and judgments. It aims to reveal the essence, source, function, value, and application laws of morality in social life. Moral theory involves multiple aspects, including but not limited to the concept of morality, the establishment of moral principles, the formation of moral norms, the standards for moral judgment, and guidance for moral practice. It provides a theoretical framework for people to understand and evaluate moral phenomena through in-depth exploration of these aspects. A moral theory provides a solid theoretical foundation for understanding the psychological mecha- nisms at play. It helps to explain why and how moral leadership influences subordinates’ responsibility behavior by outlining the moral principles and values that guide human actions. Moral theory delves into the processes of moral reasoning and judgment. It can shed light on how subordinates interpret and respond to moral leadership, particularly in situations that require them to make responsible decisions or take responsible actions. Understanding the moral motivations behind responsibility behavior is crucial. Moral theory can elucidate how subordinates’ intrinsic values and moral beliefs are activated by moral leadership, leading to increased responsibility behavior. Moral theories acknowledge the role of contextual factors in shaping moral behavior. By considering the organizational context, a moral theory can help explain how moral leadership interacts with other or- ganizational factors to influence subordinates’ responsibility behavior. In short, moral theory can provide a richer and more comprehensive explanation of this phenomenon by explaining moral principles, values, reasoning processes, and developmental aspects, which are the foundation for responsible behavior in response to moral leadership. On the one hand, moral leadership comprises good personal qualities such as honesty, integrity, and altruism. On the other hand, in the process of managing subordinates, a good code of moral conduct must inspire others [6,25]. Moral leadership refers to the personal behavior of managers following certain moral standards in communicating with subordinates and then passing on such work behavior through two-way interaction and guidance [26]. Relevant studies show that moral leadership behavior positively affects employees’ job satisfaction and productivity [10,12,27]. At the same time, moral leadership can effectively reduce interpersonal conflicts and negative behavior in organizations [8,11,26]. Responsible behavior is one of the important manifestations of employees’ work results. Responsible behavior is derived from civic responsibility, which is an important category of both organizational citizenship behavior and altruistic behavior [3]. According to the theory of social information processing, when individuals perceive those factors from their social environment that affect their work attitude and behavior, their behavior is determined by their interpretation of these factors. In the workplace, the leader is the most important source of social information for subordinates. Employees will work with the leader as the core, seeking both direction and guidance [28]. Moral leadership pays attention to the interests of others, follows the principle of putting the interests of the organization first, cares about the development of subordinates, pays attention to the cooperation between colleagues, and takes into account the needs and interests of customers. At the same time, moral leadership also punishes and avoids unmoral behaviors that harm the interests of the organization and damage relationships between colleagues. According to social information processing theory, when such behaviors exhibited by moral leaders are known to employees, employees will recognize that behaving altruistically is both realistic and beneficial for the company as a whole. This will encourage employees to engage in more altruistic behaviors that benefit the organization and strengthen the relationship between colleagues. At the same time, moral leadership tends to lead by example and persuade others by virtue. Responsible behavior itself is a kind of moral behavior that leads by example and voluntarily pays. It can make employees voluntarily make contributions to the organization, behave more altruistically, and adopt a generally conscientious and responsible outlook on life. At the same time, “setting an example” of moral leadership will stimulate the moral perception of subordinates so that they can maintain their enthusiasm for work in the process of work, and it becomes easier to motivate them to behave more responsibly toward the organization. Therefore, moral leadership will not only make employees respected by leaders but will also be influenced by the values of the leadership’s moralism and altruism, motivating employees to behave in a way that is beneficial for the organization. Relevant studies show that when leadership is moral, it is easier to motivate employees to pay extra effort and behave responsibly [11,26]. Based on the analysis above, Psychological security refers to the tendency of employees not to pay too much atten- tion to the subjective perception that their self-image, identity, status, or self-interest will be adversely affected if they express themselves [17]. The psychological security of employees is one of the psychological conditions exhibited in the workplace and can be regarded as a type of atmosphere of safety surrounding the process of work; to the employees, it brings a sense of safety and assures them that the working environment will not pose risks [29]. Based on the theory of social information processing, leadership style is an important factor affecting employees’ situational perception, and employees often choose appropriate behaviors to imitate by interpreting the behavior of their leadership [26]. A psychological sense of security, therefore, is conducive to effective communication between employees, leadership, and staff, thus reducing the need to guard against mental harassment and effectively improving self-efficacy, motivation, and active learning. Possessing the courage to try to change individual behavior makes the work more conducive to the development of organizational behavior [1].",
    "Leadership is regarded as an important factor affecting the psychological ownership of subordinates [2]. In the process of getting along with employees, moral leaders will make employees feel the moral standards and value requirements of the leaders themselves, thus reducing the power distance between the two groups and enhancing the psychological communication and emotional interaction between them. This is because leaders with high moral standards tend to promote the psychological security of the organization and essentially treat the organization as a big family [25,30]. The relationship between moral leadership (sometimes interchangeably used with ethical leadership) and psychological safety is an important one. Moral/ethical leadership involves setting a high standard of ethical behavior and promoting an environment where employees feel comfortable speaking up, challenging norms, and taking risks without fear of retaliation. Psychological safety, on the other hand, refers to an individual’s perception of the consequences of taking interpersonal risks in a particular context. When leaders demonstrate moral/ethical behavior and foster an environment of trust and respect, employees are more likely to feel psychologically safe and, therefore, more engaged, innovative, and productive. Thus, improving the relationship between moral leadership and psychological safety can lead to positive outcomes for individuals, teams, and organizations [26,31,32]. Employees feel secure when they are free to use their talents in an organization without fear of negative consequences. This kind of safe atmosphere can help employees achieve a relaxed working state, making them willing to do more for the organization, and enthusiastically at that. Leaders with high self-recognition ability and good internalized moral standards can guide employees toward behaving more responsibly by improving their job security. An excellent leader should have a correct understanding of his abilities and understand his subordinates’ work characteristics and abilities as well. They should further have a clear understanding of the employee’s “responsibilities” and “obligations” beyond those required by the job. A high moral level of moral leaders at work will directly improve the job security of employees [8,26]. Since responsible behavior can be understood as a type of extra-role behavior, more “responsibility” is often accompanied by more “risk” awareness. Maslow’s theory on the hierarchy of needs also posits that it is only after the physiological and safety needs of people are satisfied or satisfied that people can have higher needs, such as social communication or self-realization [33]. When it comes to behaving responsibly, employees will only behave responsibly under the premise of security perception. Therefore, it can be inferred that employees with high psychological security are more likely to take responsible actions toward the organization or others. Based on the analysis above, we propose the following: Interactive justice refers to the perception of fair treatment that subordinates feel in interacting with their leaders [16]. Interactive justice is related to the performance and comprehensive competitiveness of an organization and reflects its most important characteristics [34,35]. It is found that interactive justice can effectively reduce turnover in- tention and enhance employees’ perception of responsibility and organizational citizenship behavior [1,30]. Morally just leaders can also communicate better with their employees, leaving their subordinates with a sense of just treatment. In the context of Chinese culture, organizations are more humanized. We believe that interactive justice, compared with procedural variables such as distributive justice and procedural justice, better reflects the interactive relationship between leaders and employees and, therefore, better predicts individual work performance and workplace behavior. Leaders’ moral behavior plays an important role in stimulating employees’ perception of interactive justice. In management practice, moral leadership can increase subordinates’ sense of interactive justice in various ways [35]. First, moral leaders are honest, reliable, fair, and just and can treat subordinates equally with respect to both resource allocation and interpersonal interactions. Therefore, they are easily regarded as role models by subordinates to learn from and follow, creating a good working environment and a fair cultural atmosphere for the organization’s development. Second, moral leadership attaches more importance to equality, freedom, and fraternity in interpersonal interactions, encourages employees to speak out freely in organizational decisions, and shows respect and support to employees and subordinates, thus effectively promoting the generation of interactive justice. At the same time, moral leadership can effectively reduce interpersonal conflicts within an organization, thus promoting behaving in an altruistic manner [1,6]. Therefore, in the process of interaction with subordinates, moral leadership signals interpersonal fairness.",
    "Studies have shown that perceived interactive justice has a positive impact on em- ployees’ self-evaluation and job responsibility [36]. At the same time, interactive justice is an ante-factorial variable of managers’ responsibility and can be a mediating variable of leaders’ behavior affecting subordinates’ positive and effective work [37]. According to social exchange theory, the interpersonal relationships within an organization are effective embodiments of the social exchange relationship. The behavior of employees is the result of exchange after the operation of the relationship. The premise of this relationship is that employees’ self-needs must be met to a certain extent before they can give corresponding feedback and return. In the process of organizational management, moral leadership, characterized by ethical behavior, integrity, and a commitment to fairness, sets the tone for how leaders interact with their subordinates. When leaders demonstrate moral leadership, they are more likely to treat their employees with respect, listen to their concerns, and provide clear explanations for decisions that affect them. This fosters a sense of interac- tional justice, where employees feel valued, heard, and respected. As employees perceive greater interactional justice, they are more likely to reciprocate by engaging in responsible behavior [27]. This might include increased job performance, greater organizational citi- zenship behaviors (e.g., helping colleagues, going above and beyond job requirements), and reduced counterproductive work behaviors (e.g., absenteeism, theft, sabotage). Thus, the mediating role of interactive justice suggests that moral leadership indirectly promotes responsible behavior by creating a positive interpersonal environment where employees feel that they are treated fairly and with respect [36]. Based on the analysis above, we propose the following: All methods were carried out in accordance with relevant guidelines and regulations. All experimental protocols were approved by Academic Ethics Committee of Shanghai University of International Business and Economics (SUIBE 2024-004), written informed consent was obtained from all participants, and no minors were included in this study. The data in this study were selected from 48 leaders of public departments and 400 civil servants in eight national units in the Shandong and Henan provinces. The recruitment period begins on 24 April and ends on 6 June 2024. The questionnaire primarily includes two different versions, namely, the leaders’ questionnaire and the employees’ questionnaire. This study used a two-stage questionnaire to obtain sample data: The first stage was a questionnaire for employees who answered questions about moral leadership, psycholog- ical security, and interactive justice. Six weeks later, the second stage of the survey was conducted, and a leadership questionnaire was issued, wherein the department leaders objectively evaluated the responsible behaviors of their six to eight subordinates. In the first stage, 50 questionnaires were distributed to each unit, and 400 questionnaires were distributed in total. In the second stage, each unit issued 6 questionnaires to leaders, a total of 48 questionnaires were issued, and they were coded prior to issuance. All English scales were translated into Chinese following standard translation and back-translation procedures. Among all the collected questionnaires collected and matched, the unqualified questionnaires were deleted. Finally, 279 sets of employee–leader questionnaires were suc- cessfully matched, including 40 leaders’ questionnaires and 279 employees’ questionnaires, with effective recovery rates of 83% and 80%, respectively. In this study, the maturity scale widely used at home and abroad was used to measure variables. All questionnaires in this study were measured using a six-point Likert scale, with scores ranging from one to six, representing personal opinions ranging from “strongly opposed” to “strongly agreed”. This study used the 10-item scale used by Brown et al. [5]. A sample item was “Morally, my supervisor is a model who knows how to do things the right way”. The Cronbach’s alpha was 0.73. The evaluation of moral leadership emerges, before all else, from the subjective evaluation of the leadership style of a particular department. Considering that department leaders may have different styles for their subordinates, or even though the leaders have the same style with each employee, each employee may have different subjec- tive feelings and evaluations regarding their leaders, which may lead to certain differences in their behaviors. In this study, based on a one-way analysis of variance of moral leader- ship, the intra-group correlations ICC(1) and ICC(2) and intra-group consistency coefficient Rwg were tested, and it was found that the intra-group correlation and consistency were not significant. Therefore, moral leadership is discussed at the individual level rather than at the hierarchical level.",
    "This study used the three-item scale used by Edmondson [38]. A sample item was “I think it is safe to speak in an organization”. The Cronbach’s alpha was 0.86. This study used the nine-item scale used by Colquitt [39]. Four items measure interper- sonal fairness, expressing those situations wherein leaders interact with subordinates with more care and respect. One sample item was “Your supervisor is very polite with you”. The five remaining items measure information fairness and express the sincerity and fair treatment of leaders and subordinates in the interaction process. Another sample item was “Your leader is very honest when interacting with you”. The Cronbach’s alpha was 0.78. This study used the four-item scale used by Farh [3]. A sample item was “he works seriously and responsibly when he works equally well”. The Cronbach’s alpha was 0.71. As a dependent variable, responsible behavior also needs to be tested to explain the significance of inter-group differences within responsible behavior so as to determine whether statistical analysis can be carried out at the individual level. Therefore, this study conducted a within and between (WAWB) analysis of responsible behavior to test the independence of the individual measurements [7,10]. As shown in Table 1, the F value of responsible behavior in the analysis results for WAWB is not significant, indicating that there is no significant difference between or within groups when it comes to employees behaving responsibly. According to the results, there is no need for a group discussion in this study. Only 279 sets of data matching 319 questionnaires (40 leaders’ questionnaires and 279 employees’ questionnaires) are needed for statistical analysis at the individual level. The control variables in this study include three demographic variables: age, sex, and education level: (1) sex is treated as a dummy variable, where “1” represents male, “2” is for female; (2) age is divided into the following categories: “1” represents under 20 years of age, “2” means 21–30 years old, “3” means 31–40 years old, “4” means 41–50 years old, and “5” means 51 or older; (3) education level can be divided into five categories: “1” means junior college or below, “2” stands for undergraduate, “3” stands for master students, and “4” stands for doctoral students and above. This study tested four variables: moral leadership, psychological security, interactive justice, and responsible behavior. Confirmatory factor analysis was conducted before hypotheses testing to evaluate the discriminant validity among variable measurements. The evaluation results are shown in Table 2: the fitting degree between the observed data and the four-factor model is good (χ2 = 1480.063, df = 334, RMSEA = 0.067, CFI = 0.966, IFI = 0.933) (see Table 2). In addition, three alternative models were evaluated. The three-factor model primarily combines psychological security and interactive justice. The two-factor model combines moral leadership, psychological security, and interactive justice. The single-factor model combines all variables. The results show that the fitting index of the four-factor model is significantly better than that of other alternative models, indicating that the variables measured in this study have good discriminative validity. Note: “+” indicates the combination of two factors into one. ML stands for moral leadership, PS stands for psychological security, IJ stands for interactive justice, and CON stands for conscientiousness. Table 3 includes the mean and standard deviation of each variable, as well as the correlation between variables. Through descriptive and correlation analysis of moral leadership and psychological security, interactive justice, and responsible behavior, it can be seen that moral leadership is significantly correlated with psychological security (R = 0.537, p < 0.01) and interaction justice (r = 0.445, p < 0.01). It was also significantly correlated with responsible behavior (R = 0.478, p < 0.01). There was a significant cor- relation between psychological security and responsible behavior (R = 0.426, p < 0.01). There was a significant correlation between interactive justice and responsible behavior (r = 0.519, p < 0.01). Therefore, the theoretical predictions proposed in Hypotheses 1, 2, and 3 were preliminarily verified. This study analyzes the values of the average variance extracted (AVE). For the average variance extracted (AVE), the moral leadership was 0.642, psychological security was 0.653, interactive justice was 0.556, conscientiousness was 0.694, and these values were all greater than 0.5.",
    "Note: * p < 0.05, ** p < 0.01, N stands for sample number, ML stands for moral leadership, PS stands for psychological security, IJ stands for interactive justice, and CON stands for conscientiousness. This study uses structural equation model analysis to verify the proposed theoretical hypotheses. The structural equation can control for measurement error during model estimation, and the mediation effect can be tested by comparing the advantages and disadvantages of the alternative and the hypothetical models. First, a variety of control variables should be added to the responsible behavior for regression analysis, the residual values of the responsible behavior variables should be saved, and further path analysis and hypotheses testing should be carried out on the structural equation model. Second, in the structural equation modeling process, the advantages and disadvantages of the alternative and hypothetical models are compared by controlling the measurement error, and then the hypothesis is tested. This study used the coefficient product method in the mediation effect test, which is a statistical method used to analyze the role of mediating variables in the relationship between independent and dependent variables. The core idea of this method is to evaluate the size and significance of mediation effects by calculating the product of mediation effect coefficients. Specifically, the coefficient product method involves the following key steps: Firstly, construct three regression models: the first model analyzes the total effect of the independent variable (moral leadership) on the dependent variable (conscientiousness), the second model analyzes the effect of the independent variable (moral leadership) on the mediator variable (psychological security/interactive justice), and the third model analyzes the effect of the mediator variable (psychological security/interactive justice) on the dependent variable (conscientiousness) after controlling for the influence of the independent variable (moral leadership), as well as the direct effect of the independent variable (moral leadership) on the dependent variable (conscientiousness) after controlling for the influence of the mediator variable (psychological security/interactive justice). Then, calculate the product of the mediation effect coefficients. This product represents the indirect effect of the independent variable on the dependent variable through the mediating variable. If the product is significant, it indicates the existence of a mediating effect. Next, conduct a significance test. This study estimated four competitive models with nested relationships while evaluat- ing the mediation model, as shown in Table 4. Model 1 is the theoretical hypothetical model of this study. Models 2, 3, and 4 represent competing models with potential relationships. Model 2 is primarily a fully mediated model for testing. Model 3 tested only the direct relationship between moral leadership, psychological security, and interactive justice and responsible behavior without mediating effects. Model 4 tests that there is no significant effect between mediating variables and responsible behaviors. The results show that Model 1 has the best fitting validity compared with the three competing models. Note: ML stands for moral leadership, PS stands for psychological security, IJ stands for interactive justice, and CON stands for conscientiousness. The path coefficient estimation results of Model 1 are shown in Figure 2. For the sake of simplicity, complete data results are not reported for the measurement model, but only the γ coefficient of the relationship between the latent variables of the reaction is listed. The relationship between moral leadership and psychological security was significant (γ = 0.520, p < 0.001). The path coefficients to interactive justice were also significant (γ = 0.386, p < 0.001). The two pathways from psychological safety to responsible behavior (γ = 0.167, p < 0.01) and interactive justice to responsible behavior (γ = 0.378, p < 0.01) were also significant. The results showed that psychological security (γ = 0.087, p < 0.05) and interactive justice (γ = 0.146, p < 0.001) had significant mediating effects between moral leadership and responsible behavior, and the 95% confidence interval of bootstrap = 10,000 did not include 0, which were [0.031, 0.145] and [0.093, 0.209], respectively, indicating that psychological security and interactive justice mediate the relationship between moral leadership and responsible behavior. Therefore, both Hypotheses 2 and 3 are supported. The total effect of moral leadership on responsible behavior is significant (γ = 0.443, p < 0.001), and the 95% confidence interval of Bootstrap = 10,000 does not contain 0, which is [0.340, 0.536], indicating that moral leadership has a significant positive effect on responsible behavior. Therefore, Hypothesis 1 has been verified.",
    "In the process of exploring how ethical leadership influences subordinate’s respon- sible behavior, the importance of psychological safety and interactive justice, as two core mediating variables, cannot be overlooked. This paper aims to reveal the psychological mechanisms underlying the influence of ethical leadership on subordinate’s responsible behavior through an in-depth analysis of these two mediating effects, and to propose new insights by comparing with existing research. Psychological safety refers to an individual’s psychological state of feeling free to express opinions and not fearing negative consequences within an organization. In the context of ethical leadership, leaders create a safe and open work environment for subordinates by demonstrating moral traits such as honesty, fairness, and respect. This environment en- courages subordinates to bravely propose new ideas, point out problems, and dare to take responsibility. Interactive justice refers to an individual’s perception of fair and equal inter- action with leaders and colleagues within an organization. Under the guidance of ethical leadership, a mode of interaction based on fairness and respect is formed within the organiza- tion, which has a profound impact on subordinate’s responsible behavior. Psychological safety and interactive justice, as dual mediating variables influencing subordinate’s responsible behavior under ethical leadership, interact and complement each other. Psychological safety provides subordinates with a safe environment where they dare to express themselves and try new things, while interactive justice stimulates subordinates’ motivation and sense of responsibility through procedural, distributive, and interactional fairness. Existing research often focuses on the analysis of a single mediating variable, such as psychological safety or interactive justice. However, by introducing the concept of dual mediation effects, this study provides a more comprehensive understanding of the psychological mechanisms underlying the influence of ethical leadership on subordinate’s responsible behavior. This dual mediation effect not only enhances the explanatory power of the research but also offers more specific guidance for organizational practice. conclusion, the dual mediation model offers a comprehensive framework for understanding the influence of moral leadership on consciousness. It highlights the mediating roles of moral climate and moral identity, providing insights into how organizations can cultivate a culture of ethics and integrity through effective leadership. Future research could further explore the dynamics of this model, including the interactive effects of moral climate and moral identity, as well as the contextual factors that may influence its effectiveness [40–42]. In The theoretical contributions and practical implications of this study are as follows: First, combined with the new public management theory, this study puts responsible behavior in the public sector for research. It breaks through the previous analysis of responsible behavior as organizational citizenship behavior and work results of enterprise departments [4]. Therefore, this study carries out research from the perspective of moral ethics and self-cognition, organically combining leadership style with the responsible behavior of employees. Leaders and subordinates should make joint efforts toward the country’s development, protecting citizens’ rights, and being responsible for the public. Second, this study adopted a multi-source vertical research design. We used cross- region and cross-department data and divided the investigation of department leaders and department employees into two stages and cross-time nodes. The study itself is based on a multi-source longitudinal data survey conducted across periods. Compared with the previous data survey conducted at the same time, the research process and data collection can more accurately verify the causal relationship among moral leadership, psychological security, interactive justice, and responsible behavior. Finally, this study expands on the impact of moral leadership on whether employees behave responsibly. Based on public sector employees’ dependence on organization and leadership, this study proposes a dual mediation model of moral leadership influencing re- sponsible behavior from the perspectives of psychological safety perception and interactive justice perception, thereby expanding the original framework. This study also has important practical significance. Considering the current moral atmosphere in Chinese society, the importance of the impact of moral leadership on subor- dinates cannot be understated. There is a serious lack of responsibility in China’s public sector. It is, therefore, urgent to guide and motivate employees in order to improve their working attitude and encourage them to behave responsibly, and this task falls to leaders. At the same time, in China’s special national conditions, we should advocate giving full play to the role of leaders in the process of building a moral atmosphere. We should not only act accordingly in practice and set an example but also emphasize the establishment of a moral code of conduct and good organizational atmosphere in the management process, which is very necessary for the long-term development of the organization.",
    "This study has limitations: First, the working conditions of civil servants in different regions of China may differ to varying degrees. Due to the limitation of sample size, the statistical test of empirical research is also limited in accuracy. In future studies, scholars may fully consider expanding the sample size and conducting a comprehensive nationwide survey of public sector personnel. Second, the mechanism of moral leadership affecting subordinates’ responsible behavior may also be influenced by boundary conditions. There- fore, possible regulatory mechanisms may be explored from other theoretical and practical perspectives. Finally, considering the special cultural background of China, the moral leadership model may be constrained by the situation. As described in this paper, the influence of moral leadership over subordinates’ behavior requires personal perception and understanding before the leader can be judged. In this process, the different degrees of perception and understanding of each subordinate may lead to different outcomes. Mean- while, China is a country with high power disparity, such that employees may pay more attention to and be sensitive to moral leadership. Future research should focus on cross- cultural and individual values relevant to the argument. The challenge of sustainability and dynamism lies in the influence of ethical leadership being a continuous and dynamic process. Research may not fully reveal the changes in the impact of moral leadership on subordinates’ responsible behavior in different time periods and contexts. Therefore, managers need to continuously monitor and adjust their management strategies to adapt to changing environments and employee needs. Author Contributions: Conceptualization, Z.Z.; Methodology, Z.Z. and W.L.; Software, Y.M.; Val- idation, W.L.; Investigation, Z.Z. and Y.M.; Data curation, Z.Z.; Writing—original draft, Y.M. and W.L.; Writing—review and editing, Z.Z. and W.L.; Visualization, Y.M.; Supervision, Z.Z.; Project Funding: This research was supported by National Social Science Planning Youth Project (22CZZ030) and Shanghai Philosophy and Social Sciences Planning Youth Project (2020EGL021). Data Availability Statement: The datasets used and/or analysed during the current study are available from the Academic Ethics Committee of Shanghai University of International Business and Economics on reasonable request. Acknowledgments: The authors would like to thank the handing editor and anonymous reviewers for their useful comments and constructive suggestions."
]