[
    "1School of Civil Aviation, Zhengzhou University of Aeronautics No. 15 Wenyuan West Road, Zhengdong New District, Zhengzhou, Henan, China E-mail: xyguo@zua.edu.cn; sun011110@163.com; lizhen@zua.edu.cn; siqingmin@163.com 2School of Environmental and Municipal Engineering, North China University of Water Resources and Electric Power No. 136 Jinshui Road, Zhengdong New District, Zhengzhou, Henan, China E-mail: 798280676@qq.com; Corresponding author* Aviation emergency rescue plays a crucial role in the emergency management of various emergency events. Consequently, the processes of identifying relevant constraints of aviation emergency rescue ability, analyzing the interactive relationship among factors, and putting forward an economical and effective improvement strategy for aviation emergency rescue capabilities have become widely popular among scholars. To greatly improve the economic input efficiency of aviation emergency rescue capabilities, 18 relevant influencing factors were screened and identified from four perspectives: system institutionalization, technological advancement, rescuer professionalism, and operation safety. Then, the causal relationship among the influencing factors and the feedback mechanism were analyzed via the system dynamics (SD) method, and the influencing factor weights were calculated via the entropy weight method. Then, the equations of state variables and constants among the influencing factors were determined, and an SD model of aviation emergency rescue was built. Finally, a case study based on a practical construction condition of an aviation emergency rescue in Henan Province, China was analyzed. The variation trend of rescue ability was predicted from the temporal dimension, and the optimal economic input strategy for effectively improving the rescue ability was determined. Results demonstrate that the efficacy level of aviation emergency rescue ability in Henan Province is 44.97. The aviation rescue ability level on the 49th month can be improved to 90 if the monthly input into the aviation emergency rescue is raised to 3 million RMB. Additionally, the aviation rescue project can be significantly improved if the input proportions of operation safety, rescuer professionalism, system institutionalization, and technological advancement are 0.4, 0.2, 0.2, and 0.2, respectively. This work can provide an economic decision reference for building and perfecting public safety systems. According to the global natural disaster assessment report of 2021, a total of 313 great natural disasters occurred in 2020, further leading to 15,082 deaths. Many studies have demonstrated that the frequency of natural disasters, such as catastrophic flood disasters, may increase further in the future given the current state of global warming (Baranowski et al., 2020; Kljucanin et al., 2021; Li et al., 2023). Amidst a situation in which the survival rate of affected people after emergency events decreases gradually over time, rescue tasks in emergency management should be able to rescue trapped individuals at the shortest period while transferring injured persons for treatment in a timely manner (Zhang et al., 2012; Guo et al., 2022). However, certain geographic features, damaged road traffic, and poor traveling conditions in affected areas hinder the traditional rescue modes from meeting the increasingly complicated and changing disaster characteristics (Feng et al., 2019). As for improving the accessibility and speed of rescue scope, recent aviation emergency rescue has played an important role in global emergency management owing to its merits of high efficiency, maneuverability, and strong environmental adaptation (Johnsen et al., 2020; Pedersen et al., 2020). Nevertheless, aviation emergency rescue engineering in most countries, especially in developing countries, is still in the primary stage and far from the development stage of the United States or Germany (Kim & Son, 2021; Wang et al., 2018). Knowing how to scientifically and effectively formulate economic input strategies to improve aviation emergency rescue ability is a problem that needs to be urgently solved. The aviation emergency rescue system is a three- dimensional and comprehensive operation system (Zhang & Liao, 2022). It not only involves different technology and equipment types, such as aviation rescue devices, airworthiness technology of aircraft, or number of professional rescue aircraft, but is also related to the system’s institutional indices, such as supporting regulation policies of rescue and the government and private institutions’ rescue systems, and so on. All constraints are influenced in a mutual and cooperative manner, and they jointly influence the construction and development of aviation emergency rescue projects (Ruppert et al., 2017; Shao et al., 2019). The existing studies on improving aviation emergency rescue ability have mainly focused on the analysis of influencing factors, the construction of index systems, and the planning of emergency procedures (Guo et al., 2022; Thompson et al., 2018); however, they lack a comprehensive understanding of the nonlinear coupling relations among the index factors that influence rescue construction. The existing studies have also overlooked the constraints of emergency rescue ability. Moreover, previous works have mainly interpreted improvements in aviation emergency rescue ability from the aspect of macroscopic policy formulation (Meadley et al., 2022; Lv et al., 2023), their focus is on the technical equipment development of aviation emergency rescue capabilities and the economic compensation mechanism. Few studies have explained the dynamic mechanism of the improvement of aviation emergency rescue capabilities and the benefits of capability improvement from the perspective of economic input. Hence, in this study, the influencing factors of aviation emergency rescue ability are screened from the perspectives of system institutionalization, technological advancement, rescuer professionalism, and operation safety. Then, it analyzes the causal relationships of the different factors and the feedback effect. Moreover, the improvement effect of aviation emergency rescue ability with different economic input is predicted by a system dynamics (SD) model. The findings of this work can provide a practical reference for building and perfecting aviation emergency management systems.",
    "Existing studies have identified and analyzed the influencing factors of aviation emergency rescue ability by focusing on the interaction degree of factors via mathematical statistics, from which the influences of the factors on improving rescue ability are determined, and relevant measures to enhance it are eventually proposed (Lee et al., 2023). Worley (2015) investigated and analyzed the causes of 47 aviation emergency rescue accidents between 1980 and 2013 and determined the consequences of aviation emergency rescue accidents as being more serious than those of general aviation accidents. They recommended that prior attention be paid to guarantee the safe operation of rescue aircraft during aviation emergency rescue. Hinkelbein et al. (2011) reviewed 99 aviation rescue accidents in Germany and found that 43.4% of them were caused by aircraft colliding with obstacles during landing, take off, or hovering. They established that the landing stage during rescue is the flight stage in which accidents mostly occur. Thus, rescue ability can be effectively improved if the safe operation of aircraft is guaranteed in the rescue process. Alderson et al. (2021) analyzed the practices of aviation emergency rescue as part of COVID-19 control and found that the perfectness of a specific protective equipment is a key constraint against the effective spread of COVID-19. This finding indirectly proves the importance of rescuer professionalism and technological advancement during emergency rescue. Hu et al. (2019) acquired the flying state (position, speed, and technology called automatically dependent surveillance- broadcast system to improve the A* algorithm. Then, they proposed a trajectory prediction algorithm to infer the flying state and intention of rescue aircraft and formed its real-time dispatch plan to guarantee the smooth implementation of aviation emergency rescue tasks. Zhang et al. (2016) developed an effective systemic rescue chain by employing demand buffering and fuzzy clustering methods for optimized dispatching, along with establishing a goods dispatch planning model and algorithms. This rescue chain effectively addresses the dynamics and complexities of aviation rescue demands in major natural disasters. It has shown significant effectiveness in dynamically adapting to the forecasted demand for goods and materials in disaster-affected areas, as well as managing the timeliness and complexity of large-scale dispatching within the rescue network. Yu et al. (2018) adopted the modeling technology of colored Petri network discrete events to establish an aviation emergency rescue model in CPN based on the relationship between rescue processes and rescue activities. A case study on rescue task allocation was conducted based on the emergency rescue drill data of Weifang Nanyuan Airport in China to obtain the time function of different tasks. Their research can provide a reference for increasing the rescue efficiency of aviation emergency rescue managers. Karaca et al. (2017) discussed the potential uses of unmanned aerial vehicles (UAVs) to search and locate victims and maneuver the transportation of search and rescue equipment in mountainous environments. They conducted 20 experiments and used UAVs to rapidly search extensive areas and locate victims. This initiative highlights the importance of advanced rescue aircraft technology. Kottmann et al. (2018) found that the existing rescue in snowslide accidents is mainly accomplished by helicopter emergency medical services, including complicated medical rescue with specialized technology, under difficult conditions. Meanwhile, a practical case study established the importance of rescuer professionalism and the close relationship between aviation emergency rescue and the rescue skills of flight crew. Li et al. (2019) analyzed the idea of standardized system construction of aviation emergency rescue and proposed a standard system construction framework with internal logic correlation and system coverage from the perspectives of time, space, element, and level by combining the four components of man, machine, environment, and management. Pi et al. (2022) built a model to analyze the influencing factors in the selection and layout of aviation emergency rescue In summary, the research concerning the influences and improvement of aviation emergency rescue ability has mainly focused on aviation rescue system development, equipment optimization, and professional ability enhancement. In terms of formulating strategies for improving rescue ability, the previous studies tended to ignore the dynamic feedback of aviation emergency rescue systems by simply using weight calculation and problem summarization as the reference of ability improvement. As a result, the strategic effect and rescue ability remain poor. summarization as the reference of ability improvement. As a result, the strategic effect and rescue ability remain poor. In addition, the existing studies about the dynamic optimization of aviation emergency rescue ability have mainly focused on improving influencing factors at the local levels. Karatas et al. (2017) established a mixed method by combining the schedule optimization of rescue tasks, the simulation of task allocation, and the dispatch of helicopter rescue at sea. In particular, the optimal deployment of rescue helicopters was explored via the simulation analysis of an integral linear programming model, which was subsequently verified by overseas rescue activities in the Aegean Sea. Sun et al. (2020) proposed the “report, evaluate, agree, do” training evaluation, also named the R-E-A-D model, via virtual reality (VR) to evaluate the effects of complicated multi- task, multi-scene, and multi-object aviation emergency rescue tasks. The real task component in the process of aviation rescue was transformed into a virtual scene via the scene mapping of VR technology for aviation emergency drills, consequently increasing emergency rescue ability. Andreeva et al. (2015) developed a dynamic operation support system for aircraft rescue task matching. A robust particle model to reflect various helicopter characteristics and rescue task features was proposed for this system. The rescue task allocation of this model was verified by real data involving great earthquakes and tsunami in Eastern Japan in 2011 and proposed certain optimization measures. Chen et al. (2015) designed and developed a virtual training environment for a helicopter emergency rescue task training system to improve the helicopter emergency rescue drill effect. They also built an evaluation method based on the Kirkpatrick model to evaluate the training effect. Fiuk et al. (2022) analyzed the rescue task on Baltic Sea area and proposed a model for the dynamic selection of air rescue bases and transport tools by analyzing the influencing factors of emergency cargo transportation efficiency and combining the relevant characteristics of a variety of rescue aircraft. In conclusion, the existing studies have successfully estimated the ability of single aviation emergency rescue subsystems and analyzed their respective influencing efficiency, thus helping to perfect the rescue ability by improving relevant measures and technological formulation. However, an aviation emergency rescue system is a complex system composed of several subsystem frameworks, and the coupling relations among the relevant influencing factors are complicated. This situation implies that measures can be formulated to improve aviation emergency rescue ability the relevant influencing factors of aviation emergency rescue were identified and reviewed based on SD theory. After the weights of influencing factors were determined, the causal relationships among the factors and the dynamic feedback effect were analyzed. Then, the SD model for improving aviation emergency rescue ability was built. Finally, the aviation emergency rescue ability levels under the different effects of improvement strategies were predicted using the Anylogic version 8.7.3 simulation software, with the objective of providing a decision reference for building and perfecting the aviation emergency rescue system. AnyLogic was selected as the modeling and simulation tool in this study for its extensive multi-method simulation capabilities, encompassing system dynamics, discrete event, and agent-based modeling. This versatility facilitates a nuanced and comprehensive simulation of aviation emergency rescue operations. Moreover, the intuitive interface of AnyLogic, coupled with its rich repository of pre-configured objects and templates, markedly simplifies the modeling workflow, enabling the efficient development and evaluation of simulation scenarios.",
    "The reminder of this paper is organized as follows. Section 3 elaborates the methods for screening the influencing factors of aviation emergency rescue ability prior to building the SD model and modelling parameter settings. Section 4 presents the simulation and comparative analyses of the improved schemes for rescue ability under the different combination strategies. Section 5 summarizes the conclusions of this study. emergency rescue ability analysis. In particular, the constraints of aviation emergency rescue ability were determined by assessing several subsystems. Emergency rescue ability not only involves subsystems related to emergency management, such as laws and regulation, support facilities, and rescue team, but also the safety problem of different aircraft types during the rescue process. This extraction of influencing factors is a prerequisite of the smooth implementation of rescue tasks. Thus, by means of grounded theory, literature review, and expert interview, the influencing factors of aircraft operation safety were added into the rescue ability analysis system framework. This study innovatively considered the division standards of the Henan International Joint Laboratory for Civil Aviation Safety and Reliability, including the man, machine, environment, and management” framework (Hermosilla & Magal, 2022), the man, machine, thing, law, and environment framework (Lu et al., 2015), the crisis management 4R model (Lu et al., 2015), the pressure, state, and response model (Meng et al., 2020), and so on. A total of 18 influencing indices were extracted from the four perspectives of operation safety, rescuer professionalism, system institutionalization and technological advancement (Figure 1). The methodology can be further described as follows. The entropy weight method quantifies the degree of disorder and uncertainty of information (Xu et al., 2022) In determining the weights of indices, the entropy weight method has a stronger objectivity compared with the subjective valuation method. Therefore, in this research on aviation emergency rescue ability, the entropy weight model was selected. Its specific calculation involves the following steps: the normalized data of the jth evaluation indices by the ith group of evaluation experts. In this manner, the proportion of this index (Pij) can be obtained. 1) Build the initial matrix of the aviation emergency rescue ability analysis index system. Then, normalize the original data. In the calculation of weights, assume the presence of m groups of evaluation experts, with each group involving experts belonging to a specific field. Then, judge the n evaluation indices of general aviation emergency rescue ability based on the comments of experts. The initial evaluation matrix can be expressed as The aviation emergency rescue system is a dynamic and complicated system incorporating the four subsystems of system institutionalization, technological advancement, rescuer professionalism, and operation safety. In aviation rescue projects, the rescue technology, professionalism of rescue teams, and safety of the rescue operations are the three most important components; they are coordinated mutually, and each rescue task is completed via their joint implementation (Chen et al., 2021). System institu- tionalization, which should match emergency management, needs to be formulated based on development policies and the characteristics and relations of the abovementioned three subsystems. Additionally, the number of technologies and equipment should be guaranteed, and the professionalism of fleet-scale rescue teams need to be enhanced to accommodate the intensifying emergency events and increasing aviation rescue demands. The increase in number of rescue aircraft also requires professional teams and program specifications to meet practical needs; otherwise, resource wastage and rescue risk may occur, consequently restricting the rescue projects (Tuśnio & Wróblewski, 2021). Besides, various security events pertaining to the use of aircraft have become apparent in recent years, and they need to be anticipated to control risk from the perspectives of the man, machine, environment, and management framework during the aviation emergency rescue process, the aim of which is to avoid air crash accidents. Here, a system flowchart was built to guide the analysis of system institutionalization, technological advancement, rescuer professionalism, and operation safety, as well as their interactive relations. In this paper, the situation of aviation emergency rescue in Henan Province, China, serves as the case study. The data for this research were primarily derived from the China National Knowledge Infrastructure (CNKI) database, official government documents, the China Emergency Rescue National Statistical Yearbook, and various websites pertaining to the civil aviation sector in China. The original data were reprocessed via the statistical data method, and linear regression was performed on the different variables in SPSS. After the four level-1 influencing indices of aviation emergency rescue ability were determined, the parameters of the level-2 influencing factors under each level-1 index and the quantitative equations were determined. The details are listed in Table 2.",
    "An SD flowchart of aviation emergency rescue ability was built by combining variable sets listed in Table 2. The flowchart is shown in Figure 2. In this study, the case study on the existing situation of aviation emergency rescue in Henan Province, China was analyzed. The initial values of SD simulation and the values of certain constants were determined according to an expert survey (Table 3). Then, the construction and operation status of the four subsystems of aviation emergency rescue ability in Henan Province were evaluated objectively to obtain the initial value of the efficacy level (44.97). As mentioned earlier, this study attempts to achieve an objective judgment and analysis of the improvement strategies of aviation emergency rescue ability. Hence, the target value of the efficacy level for China’s aviation emergency rescue was set to 90 in this study to guarantee the aforementioned capability. Subsequently, the strategies for improving aviation emergency rescue ability were determined by adjusting the relevant inputs. For all strategies, the monthly input to aviation emergency rescue was set at 3 million RMB, and the simulation period was selected as 48 months. Finally, the variation level of aviation emergency rescue ability in Henan Province was calculated. To ensure the accuracy of the evaluation results due to the multitude of factors affecting aviation emergency rescue, this study, supported by the Henan Provincial Civil Aviation Safety and Reliability International Joint Laboratory, invited four groups of experts from various fields within China to quantitatively assess the impact factors within constructed indicator system. The first group of experts, scholars in the field of emergency management, hail from prestigious domestic research institutions such as Renmin University of China's School of Public Safety and Tsinghua University's Emergency Management Research Base. The second group consists of senior managers from emergency rescue and general aviation industry, employed by the Civil Aviation Administration of China, the China International Rescue Center, and other leading domestic airlines and rescue organizations. The third group comprises professionals with extensive experience in civil aviation, the the including senior pilots and aviation engineers from China Eastern Airlines and Hainan Airlines. The fourth group includes practitioners from the public safety and health sectors, from organizations such as the Chinese Center for Disease Control and Prevention, the Red Cross Society of China, and the Henan Provincial Emergency Management Department. With 15 experts in each group, totaling 60, this diverse assembly ensures the professionalism and practicality of the evaluation system, making the analysis of the weight of factors influencing aviation emergency rescue capabilities more comprehensive and accurate, thereby laying a solid foundation for in-depth research on the enhancement of aviation emergency rescue capabilities across various provinces in China. For ease of calculation, the average scores of the experts from the four groups were calculated first, and the weights of indices were determined using the entropy weight model. The results are listed in Table 4. By referring to the entries in Table 4, the values from QZ1 to QZ4 and those from QZ11 to QZ47 (Table 5). The calculation method can be briefly described as follows. The value of QZ11 is equal to the weight of A11 divided by the sum of weights of A11, A12, A13, and A14. The value of QZ1 is equal to the sum of weights of A11, A12, A13, and A14. Thus, QZ11=0.1546. According to the simulation trend, the target efficacy level (i.e., 90 in this study) can be achieved between the 49th and 50th month after inputting the distribution proportion of factors in the original scheme. The variation trends of the subsystem capacities before reaching 90 can also be plotted via simulation, as shown in Figure 3. Clearly, the growth rates of rescuer professionalism and system institutionalization are lower than the other subsystems. The rising trend pertaining to the efficacy level of technological advancement is the most apparent. According to the simulated SD results, the efficacy levels of rescuer professionalism and system institu- tionalization improve more slowly compared with those of technological advancement and operation safety. Aimed at enhancing the two slowly improving efficacy levels as a means of subsequently perfecting the aviation emergency rescue ability in Henan Province, this study performed strategic experiments and allocated certain input proportions for the different subsystems. Then, the optimal path for improving aviation emergency rescue ability was explored according to the simulation results. The relevant input proportions are listed in Table 6. The simulation trends of the four schemes can be obtained based on the SD simulation (Figure 4).",
    "schemes were compared. Scheme 1 achieved the target efficacy level between the 37th and 38th months, whereas scheme 2 achieved it in the 33rd month. Scheme 3 achieved the target efficacy level between the 35th to 36th months, whereas scheme 4 achieved it between the 55th and 56th month. Except for scheme 4, the other three schemes took a shorter time to achieve the target efficacy level of rescue ability (i.e., 90 in this study) with respect to the original scheme. The comparison of the four schemes with the original scheme also indicate that aviation emergency rescue ability under scheme 2 is the most efficient. Additionally, under the premise of setting a fixed input for aviation rescue projects, an appropriate increase for rescuer professionalism is conducive to improving the comprehensive aviation emergency rescue ability, and increasing the input for technological advancement should not be blindly insisted. Guo et al. (2022) and Guo et al. (2022) have elaborated and demonstrated this from different levels and methods. In other words, improving the aviation emergency rescue ability in Henan Province should focus on developing the aviation rescue professional team, perfecting the aviation emergency rescue program, further developing the delivery capability of aviation emergency rescue, and ensuring the richness of aviation emergency material reserves. Aiming to address the ability improvement and economic input of aviation emergency rescue, this study identifies the relevant influencing factors from the perspective of system institutionalization, technological advancement, rescuer professionalism, and operation safety. The causal relationships among the influencing factors are reviewed based on SD theory. An SD flowchart of aviation emergency rescue is built, and the weights of factors are calculated based on entropy weight theory. Finally, the rescue level is predicted using the Anylogic simulation software while considering the existing current situation of aviation emergency rescue in Henan Province, China. The relevant construction and economic input strategies are also proposed. To ensure the accuracy and scientific validity of the \"human-machine-environment- management\" dimension indicators in our system dynamics model, we employed literature reviews and expert consultations to validate the effectiveness of these indicators. We also utilized historical data and case studies to assess their real-world performance. Through iterative model refinement, we aimed to ensure that these macro- level indicators precisely capture the key risk points and dynamic changes in aviation emergency rescue operations, thereby providing robust decision support for enhancing aviation emergency rescue capabilities. In this study, we conducted an in-depth exploration of the interdependence and coordination between rescue technologies, professional rescue teams, and operational safety, as well as effective management of technological equipment, team sizes, and \"human-machine-environment- management\" dimension risks in the context of increasing rescue demands to mitigate safety hazards during rescues. This systematic analytical approach not only revealed the comprehensive impact of various factors on aviation emergency rescue capabilities but also highlighted the replicability and wide applicability of our findings. It provides a scientific foundation and practical guide for improving aviation emergency rescue systems across different global regions, ensuring the flexibility and adaptability of strategies to meet the specific needs of diverse areas. The conclusions are drawn as follows. (1) Taking the actual situation of aviation emergency rescue construction in Henan Province of China as an example, the weight analysis and system dynamics modelling of 18 influencing factors restricting aviation emergency rescue capabilities are carried out, and the current efficiency level of aviation emergency rescue capabilities in Henan Province is obtained as 44.97. Then adopt the method of strategy experiment to set the economic investment ratio of different subsystems, and get the investment ratio of 3 million yuan per month and the investment ratio of operation safety, rescue professionalism, system and technological advancement are 0.4, 0.2, 0.2, 0.2, the effect of improving the rescue ability is the most significant. (2) The aviation emergency rescue system is a complicated system, and it has a coupling effect of the influencing factors. The SD method can integrate the “microscopic” network of indices and the “macroscopic” system of rescue ability improvement through the causal relationship among the factors. The mechanism for improving aviation emergency rescue ability can be derived by the SD method from the network analysis viewpoint by building the horizontal state equations of the influencing factors. (3) The combination of rescue ability improvement schemes can be expressed quantitatively by the combining SD method with the variable relations of the factors and calculated weights. The economic input optimal decisions for improving rescue ability are further derived via simulation in Anylogic. According to analysis of the influences of subsystems on aviation rescue ability, some improvement measures with strong specificity are proposed, the economic input efficiency are improved, through which aviation rescue ability can be further improved via dynamic feedback.",
    "(4) The aviation emergency rescue level under the different selected schemes in this study is predicted via the SD method from time perspective. On the premise that the input to aviation emergency rescue is fixed, aviation emergency rescue ability can be improved effectively by strengthening the professionalism of rescuers. Key attention should be paid to the construction of the aviation team, perfecting the aviation emergency rescue program, guaranteeing the delivery capability development of aviation emergency rescue, and ensuring the richness of aviation emergency material reserves. Here, the SD and entropy weight methods were both applied to the research of aviation emergency rescue. With this approach, the causal relationships among the influencing factors and the feedback mechanism of each subsystem could be determined. The economic input decision effects on improving aviation emergency rescue ability were effectively analyzed via simulation prediction in Anylogic and strategic regulation. Li et al. (2020) established a quantitative evaluation system for the aviation medical emergency rescue capabilities in Shenzhen, providing a methodological foundation for enhancing aviation medical emergency rescue capabilities across various provinces in China. Zhou et al. (2023) from the perspective of constructing and developing regional aviation emergency rescue centers, used the Southern Sichuan area as a case to propose a facility site selection strategy based on rescue demands. Through a comparative analysis of these two studies, the applicability and effectiveness of methods for improving aviation emergency management capabilities in different regions can be explored in depth. This not only validates the results of our research but also offers insights for the enhancement of aviation emergency management capabilities in other provinces of China. In addressing the strategic development for augmenting rescue capabilities, our research encountered certain constraints. Notably, the strategy formulation for enhancing rescue capabilities did not encompass a diverse array of strategic combinations, potentially curtailing a holistic assessment of the impact on rescue effectiveness. Future investigations will seek to expand and deepen this initial groundwork. We aim to meticulously craft an assortment of strategies for bolstering rescue capabilities, thereby enabling a more exhaustive evaluation of their potential impacts. This endeavor will entail a nuanced calibration of investment allocations across the four critical subsystems: regulatory framework, technological sophistication, professional expertise, and safety protocols. Employing orthogonal experimental designs, we intend to refine the interventions for elevating the efficacy of aviation emergency rescue operations, with the objective of deriving findings that are both empirically robust and pragmatically viable. These advancements are anticipated to furnish more nuanced and evidence-based recommendations for the strategic planning and financial allocations within the domain of aviation emergency rescue initiatives. This study was funded by the National Natural Science Foundation of China (No. 72304253) and Humanities and Social Sciences Research Project of the Ministry of Education of China (No. 22YJC630027) and Science and Technology Planning Project of Henan Province in China (No. 232102320049, 222102320454) and Training Plan for Young Backbone Teachers in Higher Education Institutions of Henan Province (No. 2020GGJS174)"
]