[
    "2 Health School Attached To Shanghai University of Medicine&Health Sciences, Shanghai, China 3 The Research Center for Central Plains Agricultural Civilization, Henan Agricultural University, This study explores the link between adolescent mobile phone snubbing Accepted:21 January 2025 behavior and college students' mobile phone addiction, considering parental and peer snubbing behaviors and self-control as mediators. A survey of 510 Keywords: college students in Henan Province revealed key findings. Adolescent mobile phone snubbing behavior; mobile phone addiction; self-control snubbing behavior negatively correlates with self-control but positively with parental and peer snubbing, as well as mobile phone addiction. Self-control, in contrast, negatively correlates with these factors. Parental snubbing behavior positively correlates with peer snubbing and mobile phone addiction, while Corresponding Author: Tipeng Zhang peer snubbing behavior also positively correlates with mobile phone addiction. Notably, self-control and peer snubbing behavior play significant mediating roles between adolescent snubbing behavior and mobile phone Copyright 2025 by author(s) addiction. Adolescent snubbing behavior not only directly impacts mobile This work is licensed under the phone addiction but also indirectly through self-control and peer snubbing CC BY NC 4.0 behavior. Although parental snubbing behavior does not directly mediate this relationship, it still influences it through these factors. In the era of rapid information development, mobile phones have deeply integrated into people's daily lives. For the college student group, while mobile phones bring convenience and entertainment, the problem of addiction has followed closely and has become a social phenomenon that cannot be ignored. Mobile phone addiction not only seriously interferes with the normal learning process of college students, causing distraction and reduced learning efficiency, but also causes various damages to their physical and mental health. On the social level, excessive dependence on mobile phones leads to the degradation of real interpersonal communication abilities, being immersed in virtual social interactions and ignoring real emotional interactions. Thoroughly exploring the root causes and influence mechanisms of mobile phone addiction and seeking effective prevention and intervention strategies are of crucial importance for ensuring the healthy growth and all-round development of college students, which is also the key significance of this study focusing on this issue. humanity has stepped into the era of mobile terminals. As per the report released by the China Internet Network Information Center in August 2022, the number of mobile phone netizens has surged to 1.047 billion, constituting 99.6% of the total netizen population. The number of mobile phone netizens has soared to 695 million, and has maintained a growth rate of over 10% for three consecutive years. The advantage of mobile phones in the field of Internet access devices has become more and more prominent, gradually squeezing the use space of other Internet access devices[1]. Although smartphones have brought many conveniences to people’s lives, they do not always bring positive changes, and many negative situations may occur[2]. For the adolescent group, if a large a significant amount of time is dedicated to mobile phone usage, psychological and adaptability problems such as mobile phone addiction may be triggered[3]. Mobile phone addiction denotes the phenomenon where individuals are cognizant that the excessive utilization of mobile phones will inflict harm, yet they struggle to effectively govern their behaviors, thereby leading to impairment in their psychological and social functioning[4]. A large quantity of research results have confirmed that adolescents with mobile phone addiction may face physical problems such as neck and back pain, distraction, vision loss, and severe insomnia[5-8], and may even have social problems such as academic procrastination, aggressive behavior, self-harm, and suicide[9-10], and social problems such as academic procrastination, aggressive behavior, self-harm, and suicide[11-14]. As an emerging group of mobile phone users, college students, due to their relatively limited self-control ability, the problem of mobile phone addiction has brought a chain of negative effects on their studies and physical and mental health. Survey data indicates that the rate at which mobile phone addiction is detected among college students falls within the range of 4.05% to 27.4%.[15], and the potential addiction ratio is as high as 58.33%[15]. This also highlights the harm that mobile phone addiction poses to college students currently. Therefore, it is of great value and significance to conduct an in-depth analysis of the underlying mechanisms and formation paths of mobile phone addiction with the aim of alleviating the symptoms of mobile The term “phubbing” sprang up in the context of the swift development of smartphones and Internet technology. It is formed by combining “phone” and “snubbing” and specifically refers to the phenomenon in social situations where an individual is overly focused on their mobile phone, thus ignoring or snubbing the people and things around them[16]. The Pew Research Center pointed out in the 2018 report “How Teens and Parents Cope with Screen Time and Device Distractions” that as high as 72% of parents noticed that their children were distracted by mobile phones during conversations[17], which fully indicates that mobile phones have already had a significant negative impact on face-to-face communication among teenagers. Mobile phone snubbing behavior can cause teenagers to be addicted to the virtual world for a long time, which in turn leads to the gradual weakening of their self-control and thinking abilities, and they become disconnected from real society[18]. At the same time, it also harms interpersonal relationships and social mentality[19-20]. More importantly, with the increasing spread of mobile phone snubbing behavior, it has gradually become a relatively common social phenomenon[21]. Previous studies have shown that many parents nowadays are worried about the potential harm that mobile phones may bring to their children, consequently, they will make efforts to manage the frequency at which their children use mobile phones in their daily routines. However, unfortunately, a considerable number of parents themselves also find it difficult to resist the powerful temptation of mobile phones, which also indirectly increases children's dependence on mobile phones. Specifically, in their daily communication with their children, they often pay excessive attention to the information transmitted by mobile phones, thus inadvertently neglecting the education, guidance, and emotional communication with their children, which will undoubtedly damage the maintenance of an intimate relationship between parents and children. The socialization theory points out that if parents make frequent use of mobile phones during the course of parent-child communication, it will lead to the snubbing of the parent-child relationship. This kind of snubbing not only transmits negative values and emotions in the parent-child relationship, but also the behavior of parents frequently using mobile phones will subtly hurt children’s behavior habits, and finally result in children falling into the plight of mobile phone addiction[22]. When teenagers enter adolescence, they gradually begin to come into contact with the external environment and various social groups, and their communication and activities with peers are becoming more and more frequent. In this process, teenagers’ problem behaviors are largely formed under the influence of their peers. Some studies have found that peer mobile phone snubbing behavior can positively predict college students’ social network addiction problems [23]. Although numerous studies have been conducted on the harm of adolescent mobile phone snubbing behavior and the research has also disclosed that the phenomenon of mobile phone snubbing may give rise to mobile phone addiction, nevertheless, the specific impact of parental and peer mobile phone snubbing behaviors in the relationship between mobile phone snubbing and addiction remains undetermined. For this reason, this study delved into the action path between mobile phone snubbing behavior and mobile phone addiction and put forward Hypothesis 1: The mobile phone snubbing behaviors of parents and peers can positively predict college students’ mobile phone addiction, and play a mediating role between adolescents’ mobile phone snubbing behavior and college students’ mobile phone addiction.",
    "Self-control implies an individual's faculty to change or transcend their internal responses. Specifically, it includes the ability to consciously interrupt one's existing train of thought, control one’s emotional state, and suppress unwelcome impulses or impulsive behaviors[24]. The findings of certain studies suggest that there exists a close correlation between self-control and mobile phone snubbing behavior. People with high self-control can effectively resist various temptations (such as mobile phones, the Internet, delicious food, etc.). By contrast, those with low self-control are prone to immerse themselves in mobile phones, leading to the occurrence of mobile phone snubbing and addictive behaviors[25]. The results of a survey show that college students spend at least six hours a day indulging in mobile phones. Consequently, the proportion of mobile phone addiction among college students is as high as 14.50% - 23.43%[26]. Numerous research findings also suggest that mobile phone addiction not only affects people’s interpersonal relationships and social skills in real life but also their communication abilities in the virtual world. Despite the wide range of social interactions students may have in the mobile phone world, they still experience a series of negative emotions such as loneliness and depression in real life[27]. Moreover, mobile phone snubbing behavior and mobile phone addiction are the most important predictors of each other, meaning they can positively predict the occurrence of each other’s behaviors[28]. Mobile phones play a crucial role in daily life, with diverse functions and forms, resulting in the widespread phenomenon of mobile phone dependence. Research endeavors have unearthed the fact that self-control can effectively reduce mobile phone dependence and the neglect of social interactions. Enhancing an individual’s self-control is expected to significantly reduce the occurrence of social-neglecting behaviors. The present study is designed with the intention to conduct an in-depth exploration into the mediating role of self-control between mobile phone social-neglecting behavior and mobile phone dependence. Hypothesis 2 is proposed: Self-control can negatively predict mobile phone addiction as well as the mobile phone snubbing behaviors of peers and parents. Moreover, it acts as a mediator in the relationship between mobile phone addiction and the behavior of snubbing others due to mobile phone use. The Compensatory Internet Use Theory posits that when people encounter psychosocial dilemmas in real life, they are likely to resort to mobile phone use to soothe their inner pain. Imagine that if an individual is ignored by those around them, a strong sense of loneliness can easily arise, which can further develop into a lack of belonging. In such a psychological state, the individual must seek other means to meet their psychological needs. The virtual world created by mobile phones happens to provide them with an outlet to release their inner helplessness and desolation. Over time, this dependence deepens, and ultimately, it is highly likely to lead to severe mobile phone addiction. In addition, the Self - regulation Deficit Model suggests that individuals facing psychosocial problems need to consume a large amount of their own psychological energy when coping with negative emotions. This continuous self-depletion gradually weakens the individual’s self-awareness and control abilities. When these abilities decline to a certain extent, individuals find it difficult to effectively regulate their mobile phone use and thus fall into a state of unrestrained mobile phone use. According to the Social Role Theory, there are differences in society's role expectations for men and women. These differences give rise to different gender - role expectations, which in turn influence an individual's gender - role performance in society. Eventually, these differences permeate an individual's social behavior, causing individuals of different genders to exhibit their own characteristic behavior patterns. In conclusion, This research regards college students as the research subjects, aiming to deeply explore the hazardous factors of mobile phone addiction and its related psychological mechanisms. Through an in-depth analysis of these factors, we hope to profoundly reveal the underlying reasons why students are currently addicted to mobile phones, as well as the mechanisms and paths of self-control and mobile phone snubbing behavior. This will provide valuable references for subsequent prevention and intervention efforts. Using the convenience sampling method, the students of a certain university in Henan Province were selected as the research subjects. A total of 550 questionnaires were distributed, and 510 valid questionnaires were obtained, resulting in an effective recovery rate of 92.7%. Within this group, there were 193 male students (37.8%) and 317 female students (62.2%); 192 freshmen (37.6%), 172 sophomores (33.7%), and 146 juniors (28.6%). There were 155 students with urban household registration (30.4%) and 355 students with rural household registration (69.6%). Among them, 325 were the masses (63.7%), 173 were Communist Youth League members (33.9%), and 12 were Communist Party members (2.4%).",
    "The “Short Version of the Smartphone Addiction Scale” redeveloped by Kwon et al. in 2013[29] was adopted. This scale uses a 6-point scoring system. The greater an individual’s total score, the more profound their smartphone addiction. An abundance of empirical studies have confirmed that this scale exhibits excellent reliability and validity[30]. In this study, the Cronbach’s α coefficient of this scale was 0.926. The scale developed by Karada et al. in 2024[28] was used. This scale is designed from four dimensions: self-immersion, others' feedback, lack of control, and communication interference. It contains a total of 19 items and adopts the Likert 5-point scoring method. The score range is from 1 (completely inconsistent) to 7 (completely consistent). In this study, the Cronbach’s α coefficient of this scale was 0.934. The GSBP developed by Chotpitayasunondh et al.[31] was adopted. Through multiple translations and back-translations by two graduate students majoring in mental health and two graduate students majoring in English, a questionnaire with the same items and scoring methods as the original scale was finally obtained. This scale can be divided into three dimensions: perceived norms (Items 1 - 9), sense of being neglected (Items 10 - 17), and interpersonal conflict (Items 18 - 22). It consists of a total of 22 items and uses the Likert 7-point scoring method, with a score range from 1 (never) to 7 (always). In this study, the Cronbach’s α coefficient of this scale was 0.942. The Mobile Phone Snubbing Behavior Scale was revised by Ding Qian et al.[32] was used. This scale is mainly used to measure the degree of adolescents’ perception of their parent’s mobile phone snubbing behavior. It was revised based on the “phubber” scale developed by Roberts and David[19]. It consists of one dimension and nine items, such as “When my parent is having a meal with me, she/he will play with the mobile phone”. A 5-point scoring system is adopted, where “1” = “never do this” and “5” = “always do this”. The reliability of this scale is good. In this study, the Cronbach’s α coefficient of this scale was 0.84. The scale revised by Baxter et al.[33]was adopted. This revised scale contains a total of 19 items, covering five dimensions: temptation resistance, impulse control, healthy habits, work focus, and moderate entertainment. It is scored using the Likert 5-point scoring method. Among them, 15 items are reverse-scored. The total score is obtained by adding up all the items. The higher the score, the lower the individual's self-control ability. The Cronbach’s α coefficient of this questionnaire was 0.742. In this study, the SPSS 26.0 statistical software was used for data analysis, which specifically included independent samples t-test, Pearson correlation analysis, and multiple regression. The aim was to deeply explore the relationship between mobile phone snubbing and mobile phone Since all the data in this study are derived from the self-reports of the subjects, the possibility of common method bias is relatively high[34]. To verify whether there is a common method bias, this study adopted the Harman single-factor test method. The test results show that there are a total of 13 factors with eigenvalues greater than 1. Among them, the explanatory rate of the first common factor is 27.82%, which is lower than the critical value of 40%. Therefore, it can be considered that there is no common method bias in the data of this study. After controlling for demographic variables (such as gender, age, grade, etc.), This study conducts an in-depth analysis of the correlations among mobile phone addiction, mobile phone snubbing behavior, parental mobile phone snubbing behavior, peer mobile phone snubbing behavior, and self-control. The results revealed that adolescent mobile phone snubbing behavior was negatively correlated with self-control (p < 0.01). Adolescent mobile phone snubbing behavior was significantly positively correlated with parental mobile phone snubbing behavior, peer mobile phone snubbing behavior, and mobile phone addiction (ps < 0.01). Self-control was significantly negatively correlated with parental mobile phone snubbing behavior, peer mobile phone snubbing behavior, and mobile phone addiction (ps < 0.01). Parental mobile phone snubbing behavior was significantly positively correlated with peer mobile phone snubbing behavior and mobile phone addiction (ps<0.01). Peer mobile phone snubbing behavior was significantly positively correlated with mobile phone addiction (p<0.01). For detailed information, please refer to Table 1.",
    "Based on the results of the above correlation analysis, it is known that there are significant correlations among the five variables: adolescent mobile phone snubbing behavior, peer mobile phone snubbing behavior, parental mobile phone snubbing behavior, self-control, and mobile phone addiction. Therefore, in this study, the PROCESS plugin Model 6 in the SPSS program was used to test the chained mediating model. Gender, grade, etc. were used as control variables, adolescent mobile phone snubbing behavior was used as the predictor variable, mobile phone addiction was used as the outcome variable, peer mobile phone snubbing behavior, parental mobile phone snubbing behavior, and self-control were used as mediating variables, and all variables were standardized. The results of the regression analysis show that adolescent mobile phone snubbing behavior significantly and negatively predicted self-control (β = -0.561, p < 0.001), and positively predicted parental mobile phone snubbing behavior (β = 0.299, p < 0.001), peer mobile phone snubbing behavior (β = 0.278, p < 0.001), and mobile phone addiction (β = 0.152, p < 0.001). Self-control negatively predicted parental mobile phone snubbing behavior (β = -0.115, p < 0.001), peer mobile phone snubbing behavior (β = -0.299, p < 0.001), and mobile phone addiction (β = -0.171, p < 0.001). Parental mobile phone snubbing behavior positively predicted peer mobile phone snubbing behavior (β = 0.828, p < 0.001) and mobile phone addiction (β = 0.102, p < 0.05). Peer mobile phone snubbing behavior positively predicted mobile phone addiction (β = 0.190, p < 0.001). For details, please refer to Table 2 and Figure 1. Based on this data, Hypothesis 1 and Hypothesis 2 can be examined and verified. However, to ensure the reproducibility of the data results, the model will be tested subsequently. sampling method for a more in-depth examination. Generally speaking, if the 95% confidence interval (95% CI) of Bootstrap does not include 0, it indicates that the corresponding mediating effect is significantly established. Through rigorous analysis, the results clearly show that among multiple paths, the 95% CIs of two paths include 0 (adolescent mobile phone snubbing behavior → parental mobile phone snubbing behavior → mobile phone addiction; adolescent mobile phone snubbing behavior → self-control → parental mobile phone snubbing behavior → mobile phone addiction). This finding strongly suggests that parental mobile phone snubbing behavior fails to serve as an effective mediating variable and cannot establish a mediating link between adolescent mobile phone snubbing behavior and mobile phone addiction. In stark contrast, the 95% CIs of the remaining paths do not include 0. This provides solid evidence for the chained mediating model of self-control and peer mobile phone snubbing behavior, demonstrating that the model is valid and statistically significant. Specific data show that the direct effect value of adolescent mobile phone snubbing behavior on mobile phone addiction is 0.152, accounting for 35.6% of the total effect. The total indirect effect value of self-control, parental mobile phone snubbing behavior, and peer mobile phone snubbing behavior in the process of adolescent mobile phone snubbing behavior's impact on mobile phone addiction reaches 0.275, accounting for 64.4% of the total effect. This fully highlights the important role of the indirect effect in the entire influence mechanism. Upon further analysis, it is found that the seven indirect effect paths each contribute a unique proportion to the total effect. Specifically, “adolescent mobile phone snubbing behavior → self-control → mobile phone addiction” accounts for 22.5%, “adolescent mobile phone snubbing behavior → parental mobile phone snubbing behavior → mobile phone addiction” accounts for 7.3%, “adolescent mobile phone snubbing behavior → peer mobile phone snubbing behavior → mobile phone addiction” accounts for 12.4%, “adolescent mobile phone snubbing behavior → self-control → parental mobile phone snubbing behavior → mobile phone addiction” accounts for 1.5%, “adolescent mobile phone snubbing behavior → self-control → peer mobile phone snubbing behavior → parental mobile phone snubbing behavior → peer mobile phone snubbing behavior → mobile phone addiction” accounts for 11.0%, and “adolescent mobile phone snubbing behavior → self-control → parental mobile phone snubbing behavior → peer mobile phone snubbing behavior → mobile phone addiction” accounts for 2.3%. For detailed data, please refer to Table 3. Table 3:Significance Test of the Chain Mediating Effect of Self-Control, Parental and Peer Mobile Phone Snubbing Behaviors in the Relationship between Adolescent Mobile Phone Snubbing Behavior and Mobile Phone Addiction This study employed the method of constructing a chained mediating effect model comprehensively and deeply analyze the emerging environmental factor of adolescent mobile phone snubbing behavior and its underlying mechanism. The research results indicate that there is a significant predictive relationship between adolescent mobile phone snubbing behavior and college students’ mobile phone addiction, suggesting that this behavior can directly affect the degree of college students' mobile phone addiction. In addition, in terms of the mediating effect, self-control ability, parental mobile phone snubbing behavior, and peer mobile phone snubbing behavior all play a significant mediating role in the process of college students’ mobile phone addiction, revealing the crucial positions of these factors in the formation and development of mobile phone addiction. Among them, the mediating effect of self-control ranks first among the three, which means that the level of self-control ability has a crucial impact on whether college students become addicted. When adolescents can better control their behavior and resist the excessive use of mobile phones, the risk of their falling into mobile phone addiction will be reduced; otherwise, they are more likely to become addicted. The mediating effect of peer mobile phone snubbing behavior ranks second. This result profoundly reveals the important position of 202 International Theory and Practice in Humanities and Social Sciences | www.wisvora.com to peer factors in shaping the behavior of college students. In the daily lives of college students, the mutual influence among peers is extensive and profound. If peers frequently exhibit mobile phone snubbing behavior, college students may be subtly influenced, thus increasing the likelihood of their mobile phone snubbing and addiction. This further indicates that, in addition to an individual’s habits, the behavior patterns and attitudes of peers act like a powerful “catalyst”, having a non-negligible promoting effect on the behavioral trends of college students. They often imitate the behaviors of their peers inadvertently and thus fall into the quagmire of mobile phone addiction.",
    "the college student group, There is a substantial positive correlation between the incidence of mobile phone snubbing behavior and the likelihood of mobile phone addiction. That is, the more frequent the mobile phone snubbing behavior is, the greater the possibility of addiction. This research result is highly consistent with the previous research findings of Karada et al.[28], this further substantiates that mobile phone snubbing behavior has a negative impact on the psychological and behavioral patterns of college students. From the perspectives of behavioral manifestations and psychological mechanisms, mobile phone snubbing behavior easily causes college students to fall into a long-term state of indulging in the virtual world, gradually becoming disconnected from interpersonal communication and interaction in real society. This disconnection is not only reflected at the social level but also deeply affects their psychological state and behavioral habits. Upon further exploration of the different dimensions of adolescent mobile phone snubbing behavior, we find a close and complex internal connection between it and mobile phone addiction. Take the self-immersion dimension as an example. In social situations, the use of mobile phones often brings a sense of relaxation and comfort to adolescents. When they encounter stress, setbacks, or other negative emotions in real life, they unconsciously use their mobile phones as a tool to escape reality and seek consolation, thus being more inclined to immerse themselves in the virtual space constructed by mobile phones. This excessive self-immersion leads them to spend a large amount of time and energy in the virtual world, ultimately resulting in the problem of mobile phone addiction. Looking at the communication interference dimension, during social interactions, some college students use their mobile phones frequently. This behavior directly leads to a significant decline in their ability to receive and respond to information in real social situations. The ineffective information exchange makes it difficult for them to build an effective communication bridge in interpersonal relationships, thus triggering disharmony in real-life relationships. When they encounter failures or setbacks in real social interactions, they will experience negative emotions such as frustration and anxiety. To get rid of these negative emotions, they tend to turn to the virtual online world, trying to seek positive emotional experiences and a sense of satisfaction there. However, this behavior pattern of excessive reliance on the virtual network further intensifies their dependence on mobile phones, A detailed analysis of the research results clearly shows that self-control plays a crucial role in the path of mobile phone addiction, accounting for a considerable proportion. This research conclusion is highly consistent with many previous related research findings. Looking back at past research materials, it is not difficult to find that college students with strong self-control often demonstrate extraordinary rationality and a mature attitude when dealing with the issue of mobile phone use. They possess sharp cognitive abilities and can deeply and accurately analyze the potential pros and cons behind the behavior of excessive mobile phone use. In daily practical scenarios of mobile phone use, these college students will give full play to the advantages of their rational thinking and conduct a comprehensive and in-depth analysis of each of their mobile phone use behaviors. They can clearly distinguish which specific mobile phone use behaviors are based on the actual need to obtain necessary information or to achieve reasonable and valuable social interaction purposes, and which are merely meaningless entertainment activities that only waste time and energy. Precisely based on this clear understanding and accurate judgment of mobile phone use behaviors, they can purposefully optimize and adjust their existing mobile phone use habits. In this way, they successfully ensure that their mobile phone use behaviors are more scientific, reasonable, and productive, effectively avoiding the problem of addiction caused by over-reliance on mobile phones. Moreover, the self-control ability of college students is significantly and fully demonstrated in various life scenarios. College students with strong self-control show excellent adaptability to different situations. They can flexibly and reasonably control their mobile phone use according to the characteristics of the occasions they are on. This behavior of appropriately and reasonably controlling mobile phone use in different situations comprehensively and profoundly highlights the crucial role and core value of self-control ability in guiding college students to use mobile phones rationally. At the same time, it also strongly reflects the important influence of self-control ability on the behavior regulation and habit formation of college students from the side, further emphasizing the necessity and urgency of cultivating and enhancing the self-control ability of college students.",
    "Adolescent mobile phone snubbing behavior can influence college students’ mobile phone addiction through the mediating role of self-control. That is, the more severe the adolescent mobile phone snubbing behavior is, the lower the self-control ability is, and the greater the possibility of mobile phone addiction becomes. Self-control represents an individual's internal motivation to resist external temptations and achieve goals. It is also a protective factor against mobile phone addiction. When a person has a strong self-control ability, they can face various pressures, manage their emotions, cognition, and behavior well, and solve problems in more appropriately, thus exhibiting fewer problem behaviors, such as mobile phone addiction. Therefore, in the subsequent process of improving and adjusting students’ mobile phone addiction behaviors, intervention measures such as mindfulness therapy can be used. By enhancing people’s self-control ability, the occurrence of mobile phone addiction can be reduced. Although adolescent mobile phone snubbing behavior cannot influence mobile phone addiction through the mediating role of parental mobile phone snubbing behavior, parental mobile phone snubbing behavior can exert an impact on self-control and peer mobile phone snubbing behavior, thereby affecting mobile phone addiction. Previous studies have shown that parental mobile phone snubbing behavior can affect children’s mobile phone use. However, perhaps since current college students are relatively far away from their parents and their social groups mainly consist of peers and teachers, the impact of parental mobile phone snubbing behavior on college students' mobile phone addiction has been reduced. Nevertheless, we cannot directly deny the negative Adolescent mobile phone snubbing behavior can influence college students’ mobile phone addiction through the mediating role of peer mobile phone snubbing behavior. That is, adolescent mobile phone snubbing behavior increases the likelihood of mobile phone addiction by increasing peer mobile phone snubbing behavior. Bandura’s observational learning theory indicates that adolescents are good at observing and imitating. If an individual has some bad behaviors, it will cause peers to follow suit. If peers who are together every day have behavior problems, it will also increase one’s bad behaviors. This is consistent with the research of Altner[35] and others. Adolescents seek a sense of belonging in peer relationships. Nowadays, college students have the most contact with their peers. If peers pay excessive attention to their mobile phones, they may become the “role models” for imitation, thus triggering their mobile phone use problems. Self-control and peer mobile phone snubbing behavior play a chained mediating role between adolescent mobile phone snubbing behavior and college students’ mobile phone addiction. This result reflects the close connection between self-control, adolescents’ behaviors, and their peers’ behaviors. The more mobile phone snubbing behaviors college students exhibit themselves, the lower their self-control ability is, which leads to an increase in peer mobile phone snubbing behavior, thereby increasing the risk of mobile phone addiction. When age、gender、political status and place of origin were used as control variables to deeply explore the mediating role of self – control、peer mobile phone snubbing behavior and parental mobile phone snubbing behavior between adolescents’ mobile phone snubbing behavior and mobile phone addiction, the study found that gender had a significant impact in self-control between adolescents’ mobile phone snubbing behavior and mobile phone addiction, Specifically, female students demonstrated stronger self-control ability compared to male students. In contrast, the age、political status and place of origin factor did not show a significant impact in this process. The study found that the gender factor had a significant impact in this process. Specifically, compared with male students, female students believed that peer mobile phone snubbing behavior would have a greater impact on their own mobile phone snubbing and mobile phone addiction. The age factor also showed a significant impact in this process. Specifically, the older they were, the more they felt that their peers would affect their mobile phone snubbing behavior and mobile phone addiction problems. In contrast, the political status and place of origin factor did not show a significant impact in this process. In addition, we found that the place of origin has a certain influence in the chain mediating model. Specifically, students from rural areas are more prone to mobile phone addiction. This may be related to students’ hobbies. Urban students have more opportunities to experience life, so they develop a variety of hobbies and special skills during their growth, while rural students do not. In the future, we can further investigate the impact of the place of origin on mobile phone addiction and carry out targeted interventions for different groups to reduce the occurrence of mobile phone addiction and mobile phone snubbing behavior.",
    "Through the method of questionnaire survey, this study delved deep into the relationship between adolescent mobile phone snubbing behavior and mobile phone addiction. In the process, self-control, and parental and peer mobile phone snubbing behaviors were analyzed as mediating factors to explore the underlying mechanisms between mobile phone addiction and mobile phone snubbing behavior. The results showed that adolescent mobile phone snubbing behavior can not only directly affect college students’ mobile phone addiction, but also exert an influence through self-control, parental mobile phone snubbing behavior, and peer mobile phone snubbing behavior. Although the mediating role of parental mobile phone snubbing behavior was not established, it can still have an impact through peer mobile phone snubbing behavior and self-control. In conclusion, mobile phone snubbing behavior and mobile phone addiction, as phenomena emerging alongside the era of the Internet and smartphones, still have many underlying influences that are not fully understood. There remains a vast area of the unknown waiting to be further Although this study has thoroughly analyzed the internal relationships among adolescent mobile phone snubbing behavior, mobile phone addiction, self-control, and parental and peer mobile phone snubbing behaviors, opening up new perspectives and ways of thinking to understand the potential consequences, it is undeniable that this study also has certain limitations. First, all the data used in this study were collected through self-report methods. This data collection method may lead to a certain degree of deviation between actual behaviors and the behaviors perceived by individuals, thus affecting the accuracy and reliability of the research results to some extent. Second, given the high popularity and frequency of mobile phone use at present, some students may have become accustomed to their excessive dependence on mobile phones and are not aware that they may have fallen into a state of mobile phone addiction. This lack of awareness undoubtedly adds difficulty to the accurate identification and assessment of mobile phone addiction problems and may also cause some omissions in the data collection and analysis process of this study. Third, this study is a cross-sectional research design, which only reflects the static relationships among variables at a specific point in time. It fails to effectively capture and reveal the dynamic trends of the relationships among these variables as time passes. This is undoubtedly a shortcoming for comprehensively and deeply understanding the development and evolution processes of mobile phone snubbing behavior and mobile phone addiction problems, and it also limits the universality and forward-looking nature of the research conclusions. Fourth, it should be clear that the influencing factors of the complex phenomenon of mobile phone addiction are by no means limited to self-control and mobile phone snubbing behavior, there are numerous other potential factors and mechanisms, such as the social environment, family parenting styles, and individual psychological traits. These factors are intertwined and interact with each other, jointly influencing the occurrence and development of mobile phone addiction problems. Therefore, more in-depth and extensive research is still needed in the future to further explore these potential factors and mechanisms, to construct a more comprehensive and systematic theoretical model of mobile phone addiction. Fifth, from a practical perspective, the problem of mobile phone addiction has already had a serious negative impact on the current students’ studies and lives. How to effectively intervene in mobile phone addiction and guide students to better return to real life has become an important social issue that urgently needs to be solved. In this field, there is a lot of room for in-depth discussion and research in terms of choosing intervention methods and means, formulating and implementing intervention strategies, and evaluating the intervention effects. Future research can focus closely on these issues and strive to find more practical, feasible, and efficient intervention measures and methods to help students get rid of the trouble of mobile phone addiction and re-establish healthy and positive lifestyles and learning habits."
]