[
    "Abstract. This study utilized descriptive analysis to assess the implementation of green practices within durable goods and FMCG companies in Henan Province, China. Interviews with management, employees, and stakeholders were conducted via questionnaires to comprehensively understand the current status of green implementation and the challenges faced. The investigation covered various aspects, including production processes, social responsibility fulfillment, green addition and subtraction practices, and their impact on operations and communities. Respondents identified hurdles such as gradual buy-in from managers and employees due to delayed economic benefits, difficulty in convincing consumers of environmental commitment, and governmental policy influence. Addressing these challenges requires a collaborative approach involving employees, government, and consumers. The study categorized green behaviors into green addition and subtraction, highlighting the need for tailored strategies aligned with business profiles. Consequently, a three-year green strategic development plan was devised for both durable goods and FMCG enterprises, focusing on production processes, green practices, operations, and community impact. The implementation of these plans aims to facilitate companies in achieving their green development objectives and fostering sustainable growth. As environmental concerns escalate and consumer consciousness regarding environmental protection grows, companies increasingly turn to environmental advertising as a key component of their green marketing strategies. By showcasing their environmental efforts, companies aim to bolster their eco- friendly image and stimulate consumers' inclination toward green purchases, portraying themselves as socially responsible entities committed to environmental stewardship. However, the effectiveness of these initiatives is not guaranteed, as consumers may perceive certain environmental behaviors as insincere or as attempts at \"greenwashing,\" undermining the trust and credibility of these companies in the eyes of environmentally conscious consumers (Sheng et al., 2019). Hence, it becomes imperative for businesses to adopt genuine and transparent environmental practices to cultivate positive consumer responses and establish sustainable competitive advantages. Such endeavors not only contribute to long-term success but also foster positive relationships with environmentally aware consumers, aligning with the broader goals of sustainable development. In marketing, a growing number of businesses are embracing green strategies, offering eco-friendly products and services to fulfill their environmental responsibilities while capitalizing on the burgeoning market demand for sustainable goods (Wang Min, 2020; Wang Wenbo, 2017). These green strategies, rooted in the principles of environmental protection and ecological preservation, encompass various aspects of business operations, from sourcing and production to packaging and waste management. However, the adoption of such strategies also comes with risks, as some consumers may view these efforts skeptically, perceiving them as opportunistic attempts to capitalize on the green trend for financial gain rather than genuine environmental commitment (Szabo & Webster, 2020). Thus, striking a balance between genuine environmental efforts and consumer perceptions is crucial for businesses seeking to navigate the complexities of green marketing effectively. This study employed a descriptive research method. Descriptive research design involves the observation and collection of data on a specific topic without the intention of deducing cause-and-effect relationships. The objective of descriptive research is to present a comprehensive and accurate depiction of the population or phenomenon under investigation, outlining the relationships, patterns, and trends inherent in the data. Purposive sampling was employed in this study, a non-probability sampling technique chosen based on population characteristics and research objectives. The primary aim of this approach, as defined by Lavrakas (2008), is to select samples in a non-random manner, focusing on those capable of representing a cross-section of the population. Categories were chosen from the target population using purposive sampling, and samples were selected from both Durable Goods companies and FMCG companies located in Henan province. The study involved business managers and employees as respondents. This study surveyed business managers and employees from companies in Henan Province, focusing on those involved in producing durable goods and FMCGs. Thirty businesses were included in the research, with one interview conducted with a manager or employee from each, with a total of 30 respondents. The study was conducted in Henan Province, China, which is renowned for its diverse range of scenic spots, including mountains, spring resorts, lakes, and ancient temples, providing pleasant weather and high-quality air attributed to its abundant forest coverage. The majority of respondents' businesses, 93.33%, were categorized as corporations, while only 6.67% were single proprietorships. In corporations, crucial decisions regarding green initiatives, such as greening production processes and fulfilling corporate social responsibility, are made by the board of directors. This underscores the significance of obtaining board approval for implementing green policies, as significant capital investment is often required. 3.1.2 Nature of Business The respondents were evenly split between durable goods companies (50%) and FMCG companies (50%), with both types of businesses comprising 15 respondents each. Durable goods companies prioritize initiatives aimed at reducing overall costs and minimizing hazardous emissions, while FMCG The enterprise offered a diverse array of products, with durable goods companies presenting a wider range, including motor vehicles, home appliances, specialized equipment like batteries, abrasive, and medical devices. Conversely, FMCG companies primarily focused on food products, particularly meat, beverages, and dairy items, showcasing varied approaches to sustainability and green innovation within their respective industries.",
    "The data indicates that the vast majority of respondents primarily operate within the national market, reflecting the significant expansion of China's Internet and logistics infrastructure. However, notable exceptions include DG14 and FG15, which have successfully penetrated global markets. DG14's new energy vehicles have found markets in countries such as the UK, France, and Saudi Arabia, while FG15 has established stores in various countries across Asia. 3.1.5 Employees The data reveals a relatively even distribution of employees among the surveyed businesses, with a significant proportion having 500 employees or more, indicating a substantial workforce. This finding is consistent with the scale of operations observed earlier. As the majority of these businesses operate at the national level, spanning both durable goods and fast-moving consumer goods enterprises, a larger workforce is required to support sales, operations, and production activities, reflecting the scale of the national market. The data reveals that the largest proportion of businesses in the study, accounting for 36.67 percent, had an asset size ranging between RMB 500,001 and 1,000,000. This concentration indicates a commonality among enterprises in Henan Province, indicating a similarity in their scale of development and background. The analysis of green implementation among respondents indicates a strong commitment to green production processes. Durable goods enterprises prioritize innovation in production technology, while FMCG companies focus on greening raw materials, especially the biodegradability of packaging materials. Overall, both sectors demonstrate dedication to reducing environmental impact through their respective green initiatives. The analysis highlights that both durable goods and FMCG companies demonstrate a moderate commitment to CSR, particularly in their efforts to be environmentally friendly. However, there is room for improvement in providing details of green products, suggesting a need for more proactive engagement in environmental sustainability practices. The analysis indicates that durable goods companies predominantly engage in green practices through the green subtraction method, particularly in their production processes. Conversely, FMCG companies demonstrate a stronger inclination towards green addition practices, particularly in their promotion processes. The analysis indicates that both durable goods and FMCG companies have experienced positive impacts from implementing green behaviors in their operations, including improvements in green R&D capabilities and reductions in pollution emissions. Specifically, durable goods companies have seen enhanced green R&D and innovation capacities, while FMCG companies have expanded their product market share and increased raw material utilization rates. The analysis reveals that both durable goods and FMCG companies have experienced positive impacts on their communities through the implementation of green behaviors. Durable goods enterprises have seen increased satisfaction among stakeholders, while FMCG companies have witnessed expanded market share and recognition from consumers for their green initiatives. This aligns with Yu Fei's (2014) perspective, emphasizing the importance of considering the impact on both internal and external stakeholders in corporate green behaviors. The analysis highlights significant green implementations in both durable goods and FMCG companies, with durable goods enterprises focusing primarily on green subtraction and FMCG companies having a notable impact on the community. Durable goods companies prioritize research and development investments in production technology, aligning with previous research findings. In contrast, FMCG companies contribute to a more environmentally friendly community through their green addition practices and accessible household products. The analysis reveals that both durable goods enterprises and FMCG companies face challenges in implementing green practices, with a common concern being management's reluctance to deviate from traditional processes. Specifically, managers express apprehension about bearing responsibility for the failure of green initiatives and prefer sticking to conventional production methods. Additionally, FMCG firms encounter obstacles such as conflicts with The data highlights significant challenges faced by both durable goods enterprises and FMCG companies in gaining consumer trust regarding their green initiatives. Specifically, consumers find it difficult to perceive the sincerity of a company's green behavior, leading to skepticism and reduced trust. This aligns with previous research indicating that consumers assess the authenticity of environmental efforts, impacting their purchasing decisions and brand loyalty (Grunert, 2005). The data underscores significant challenges faced by both durable goods and FMCG companies in complying with existing laws and policies related to green initiatives. Specifically, obstacles related to tax incentives and outdated regulations hindering innovation received the highest scores for both sectors. To overcome these challenges, it is recommended that the government implements a robust labeling and certification system for green products and provides incentives for enterprises aligned with green consumption development, as emphasized in Angie's (2022) study.",
    "The data highlights significant challenges faced by both durable goods and FMCG companies in achieving their green goals and objectives. Durable goods companies struggle with quantifying the economic performance of their green initiatives, while FMCG companies find it difficult to adjust their goals in compliance with evolving green regulations. These challenges underscore the importance of flexibility and technical capabilities in adapting to changing environmental standards and achieving corporate greening objectives. The data indicates that both durable goods and FMCG companies encounter significant challenges in their green implementation efforts, particularly in complying with existing laws and policies. This underscores the increasing stringency of government environmental regulations and the need for continuous technological advancements by enterprises to meet these requirements. Despite these challenges, addressing compliance issues remains crucial for businesses to effectively navigate the evolving landscape of environmental protection regulations. The green strategic plan serves as a comprehensive roadmap for achieving green, low-carbon, and high-quality development, enabling companies to protect the environment while simultaneously enhancing profitability. The study reveals several key findings regarding the green implementation and challenges faced by both durable goods and FMCG enterprises. Firstly, the majority of these enterprises adopt the corporate form and operate nationally, with assets generally exceeding 500,000 RMB. Secondly, while both sectors focus on green processes and CSR, durable goods companies emphasize green subtraction, while FMCG companies focus on green addition. Moreover, FMCG companies outperform durable goods firms in terms of community impact. Thirdly, challenges encountered during green implementation include risk aversion among durable goods managers and cultural conflicts for FMCG companies. Finally, a Strategic Greening Business Plan (2025-2027) has been developed, tailored to address the specific needs and challenges of each sector, focusing on various aspects such as production processes, CSR, and community behaviors. The researcher extends sincere gratitude to the NEUST Graduate School for their steadfast professional support, profound expertise, and invaluable recommendations, all of which greatly enriched the quality of this study. Their guidance and insights were instrumental in shaping the research's direction and depth, embodying a collaborative pursuit of academic excellence. References"
]