[
    "Abstract: Coordinating the “green” and “gray” infrastructure construction and the socioeconomic development is essential to sponge city construction. Most previous research has investigated the structural and non-structural approach for urban water management, such as operational practice, engineered measures, technical solutions, or planning management. However, there is a shortage of strategic management approaches to identify pilot sponge cities, which is essential to cities in developing countries under huge ﬁnancial pressures. Hence, this paper proposed a coupling coordination evaluation index system to assess the coordination degree between economic development and infrastructure construction in Henan Province in central China. Then, the paper analyzed the diﬀerences of the coordination level and its spatial statistical pattern of the coupled and coordinated development of sponge city construction in Henan Province. The results show that: (1) from the perspective of comprehensive level, the problems of inadequate and unbalanced development of infrastructure construction and economic development level are prominent; (2) from the perspective of coordinated development level, the level of coupling and coordination development in Henan Province increased during the sample period, but the level of coupling and coordination development in each region was small; (3) from the perspective of relative development, Zhengzhou City is lagging behind in infrastructure, indicating that economic growth is faster than infrastructure construction, and other regions are lagging economic development, indicating that infrastructure construction is faster than economic growth; and (4) from the spatial statistical analysis, there is spatial positive correlation, that is, the area with high coupling degree of infrastructure construction and economic development level tends to be signiﬁcantly concentrated in space. Studies have shown that Henan Province should focus on strengthening the construction of “green” infrastructure and increasing the inﬁltration of the underlying surface to counter the precipitation in urban areas in extreme climates. In recent years, the acceleration of urbanization in China has caused to the change of underlying surface. Due to the increasement of extreme climate and the backwardness of urban rainwater management system, the increasing of surface runoﬀ is the inevitable consequence of frequent urban ﬂooding. The water problem has become a common urban problem in China, posing a serious threat to the safety of life and property of urban residents, and has resulted in a huge impact on the environment and social economy [1]. For instance, on 21 July 2012, a serious waterlogging disaster occurred in Beijing, causing 79 deaths and 11.64 billion CNY in economic losses [2]. The 2015 Environmental Status Report conducted water quality assessments of groundwater monitoring sites in 202 cities. Among them, 9.1% had good water quality, and 61.3% had poor water quality [3]. Other studies have also shown that life-saving threats and economic losses caused by urban ﬂoods are on the rise [4]. In order to solve the urban water disaster and water environment problems, in 2013, China’s central urbanization work conference oﬃcially proposed the construction of the sponge city [2]. Sponge city means that the city can be like a “sponge”. It has good “elasticity” in adapting to environmental changes and coping with natural disasters. When it rains, it absorbs water, stores water, seeps water, and cleans water. When necessary, it releases stored water [5]. In addition to improving the absorption and storage of rainwater, the sponge city combines “green” infrastructure to enhance ecological functions, enhance urban aesthetic value, and create additional comfort spaces [6]. In addition, the construction of China’s sponge city also draws on the experience of some developed countries in urban rainwater drainage facilities, such as the United States’ Low Impact Development (LID) [7]; the UK’s Sustainable Urban Drainage System (SuDs) [8]; Australia’s Water Sensitive Urban Design (WSUD) [9]; and New Zealand’s Low Impact Urban Development Design (LIDUD) [10]. Chinese scholars have made a lot of progress in the exploration of sponge city construction, combined with local favorable conditions to shape the experience of surrounding landscape system and rainwater system management, and extract the surrounding landscape (river and lake) from the macro level by using modern technology (Geographic Information System, Remote Sensing, etc.). The system, from the microscopic level to the landscape design (green roof, etc.), combined with water landscape reconstruction, can achieve the sustainable development of human-water relationship [2,11–14]. However, in the face of unprecedented climate change and urbanization, it is more important to strengthen the elasticity of urban infrastructure [15–17]. But most of the research is limited to describing the ﬂood recovery capacity of urban drainage systems [18,19]. Changes in climatic conditions, such as increased precipitation intensity, changes in precipitation patterns, and more extreme weather events, have caused urban drainage systems to be frequently hit by heavy rains [20,21]; urbanization has increasedtheconcentrationofpopulationandeconomicactivity, plustheburdenofexistingurbansocial development systems on sewage, urban runoﬀ and water pollutant types [22]. A sustainable urban infrastructure system should be eﬀective and adaptable in an uncertain future, which will contribute to the ﬂexibility of green and grey infrastructure in the future, and to carry out sustainable development assessments of urban drainage systems [23]. Numerous studies have evaluated the role of diﬀerent types of green infrastructure in stormwater management and carbon emission control and compared the performance of grey infrastructure, which is considered to be mitigating and adapting to climate change and urbanization. Interferences contribute to the eﬀectiveness of sustainable development [23–25], but grey infrastructure is also a necessary condition for dealing with extreme rains [26]. The mutual development and application of grey infrastructure and green infrastructure has been used in many countries to mitigate urban ﬂoods [27,28]. Green infrastructure is an important measure in many common stormwater management strategies, such as low-impact development, best management practices, and water-sensitive urban design [29]. The study of China’s sponge cities also evaluated the eﬀects of green infrastructure [30] and evaluated the performance of low-impact development practices as a means of reducing water ﬂooding in urban small watersheds [31]. However, the investment and income mechanism of Sponge City is currently in the exploration stage [32], and the proportion of gray infrastructure and green infrastructure investment is also rarely considered. Therefore, this requires urban managers to plan the rainwater management infrastructure from an economic perspective and Sponge city construction, as a comprehensive ecological project, should be evaluated from the aspects of cost, social, and economic beneﬁts, hydrology, and water quality. Lack of adequate ﬁnancial support and eﬀective market incentives is one of the main obstacles to sustainable storm water management [34]. To solve this problem, the United States introduced the Stormwater Utility Fees (SUF) in the 1970s, as user fees; SUF has increasingly been used by local governments as an alternative source of income for implementing sustainable rainwater projects [35]. In China, some researchers are also exploring revenue sources for sustainable stormwater management, and the research results show that 76% of the respondents agreed to pay for life-cycle maintenance of sponge city facilities, and the median amount of willingness to pay was 16.57 CNY (2.53 USD) per month [36]. In addition, under the guidance of ecological civilization construction, the green infrastructure in China’s sponge city construction should be incorporated into the ecosystem service value, consider cities as a coupled nature-human system, for such a system, diﬀerent urban ecosystem structures, such as lakes, wetlands, rivers, and parks, are an integral part, providing important services for the landscape, including water conservation and runoﬀ regulation, and also helping urban residents to support social welfare [37]. The recycling of rainwater for the gray infrastructure of sponge city construction provides services for the community and green infrastructure. On the one hand, it promotes the eﬃciency of recycled water use in the community. On the other hand, it supports the water demand for green infrastructure.",
    "Chinese scholars rarely conduct research on economic development level and infrastructure, and the construction of sponge city is a comprehensive process, establishing a perfect “gray” infrastructure and “green” infrastructure system, actively promoting the fact that the pilot work of sponge city construction is the key to solving the problem of domestic embarrassment. To this end, this paper attempts to analyze thecouplingandcoordinationdegreeofinfrastructureandeconomicdevelopmentin18prefecture-level cities in Henan Province, as well as provide a new research idea for the construction of the sponge city and a theoretical basis for the future development of the sponge city. region and the northern region. It has a large span from north to south. From the west to the east, the Yellow River runs through. There are many rivers in Henan Province, which provide a surrounding landscape (rivers and lakes) for the construction of the sponge city. Wetland and green space provide good carriers for the construction of sponge city. Henan Province has diverse terrain, most of which is dominated by mountains and plains. The “green” infrastructure construction in diﬀerent regions is also very diﬀerent. Most of Henan’s climate is dominated by temperate monsoon climate, and some regions are transition from subtropical monsoon climate to temperate monsoon climate. In the zone, aﬀected by the monsoon climate, the impact of the formation of the mountain microclimate is more obvious, and the diﬀerences between the regions are greater. Therefore, the construction of sponge cities in diﬀerent regions varies from region to region; Henan Province has more latitudes, and most of the region belongs to the “northern region (dividing line between subtropical and temperate monsoons climate, northern region belongs to the temperate monsoon climate)”; however, Xinyang and Nanyang cities in the southern part of Henan province have subtropical climates, because they are near the Qinling Mountains-Huaihe River line (the boundary between temperate and subtropical monsoon climates). The diﬀerence between the south and the north of the south is obvious. The problems faced by various regions in Henan Province are similar to those faced by China at this stage of development. They are called “the epitome” of China (Figure 1); the construction of sponge cities in Henan Province can be studied. The commonality of the sponge city provides practical experience for the construction of China’s sponge city. The research area is the smallest scale of 18 prefecture-level cities in Henan Province. The diﬀerences in climate, precipitation, and urban development between the regions are more obvious, but precipitation is mainly concentrated in the summer and autumn, more often with short-term heavy rain, annual average the temperature is about 16 degrees Celsius, and the annual precipitation is about 650 mm (Figure 2). In addition, most of the terrain in the southeast of Henan province is plain, with monsoon climate in summer and short-term precipitation, the precipitation is relatively large, and the terrain is low and ﬂat, with slow surface runoﬀ and inﬁltration, where it is easy to cause waterlogging. Due to the inﬂuence of climate and topography, the precipitation in the study area decreases from southeast to northwest. However, in recent years, due to unreasonable development and utilization, as well as the impact of extreme climate, some rivers and lakes are seriously deﬁcient in water. In the summer and autumn, the urban drainage capacity is insuﬃcient, and the urban shackles occur, which also hinders the development of the city to a certain extent. The construction of the sponge city not only requires the support of science and technology to change the landscape of the underlying surface but also requires a large amount of funds to build a “gray” infrastructure system and a “green” infrastructure system. The use of “green” and “gray” infrastructure can enhance urban resilience, and “green” infrastructure can provide greater adaptability and resistance to the unpredictability of future climate forecasts. In the face of unsustainable urban drainage practices, a good strategy is to integrate green and gray infrastructure into a cyclic utilization control system, which will bring more advantages and reduce problems, while improving existing elasticity of urban drainage systems [23]. In view of this, this study selected the road area, drainage pipe length, road length, sewage treatment rate, and number of bridges in the “gray” infrastructure system; the green area in the “green” infrastructure system, the per capita park green area, the park area; and the main indicators, such as water reuse rate and green coverage area, economic development level of GDP, ﬁxed investment in garden green space, ﬁxed drainage investment, urban population, and urbanization rate, to be analyzed (Table 1). The missing data of some indicators were simulated by linear interpolation. In this paper, the missing indicators are the ﬁxed investment in Kaifeng garden green space and drainage in 2016, as well as the ﬁxed investment in Luohe garden green space and Xinxiang Drainage in 2014. In this paper, linear interpolation is used, that is, a function method that is used to calculate an unknown quantity between two endpoints of a line, because the interpolation accuracy on nodes can be guaranteed to be higher, and it is more convenient than other interpolation methods, such as parabolic interpolation. The data mainly came from China Urban Construction Statistical Yearbook 2012–2016 and Henan Statistical Yearbook 2013–2017.",
    "Coupling refers to the phenomenon that two or more systems interact and inﬂuence each other, while coupling degree is used to describe the degree of mutual inﬂuence of multiple systems. In general, the degree and quality of coupling action, using coordination to judge. Coordination is a benign embodiment based on coupling eﬀect, and the coordination degree is used to measure the coordination degree of multiple systems in the coupling process. Both have a connection already and have distinction. The degree of coupling reﬂects the degree of system interaction, and the degree of coordination reﬂects the degree of coupling coordination [38]. The construction of sponge city is a composite system composed of green infrastructure, gray infrastructure, and economic development level, which interact and form a symbiotic coupling relationship. In China, with ecological civilization, green infrastructure is the leading driving force for the construction and development of sponge cities, and this driving force can improve the material structure of the underlying surface and increase the inﬁltration of rainwater, which, to a certain extent, is conducive to dealing with urban waterlogging caused by extreme climate. Inaddition,theconstructionofgreeninfrastructurecanprovideecosystemservicesvaluetosurrounding communities. The construction of grey infrastructure restricts the improvement of the underlying surface but promotes the management of rainwater, domestic water, and sewage, which is conducive to the economical utilization of water resources and provides water demand for green infrastructure. The level of economic development is the material guarantee for the construction of green infrastructure and gray infrastructure, and it can provide ﬁnancial support for the construction of green infrastructure and gray infrastructure through the investment eﬀect (PPP, Public-Private Partnership model or willingness to pay) and the value of ecosystem services. Therefore, the three form a multiple correlation interaction coupling eﬀect, which has both positive and negative eﬀects. The sustainable development of sponge city can be realized only when the three cooperate and coordinate with each other. Green Infrastructure construction in a sponge city references LID (low-impact development), an ecologically-based planning and engineering design approach to managing stormwater runoﬀ and stormwater treatment technologies. In the practice of SuDS (Sensitive urban drainage system design) in Western Europe, SuDS sustainable stormwater management measures mitigate and adapt to climate change through carbon sequestration and urban cooling, with multiple ecological and environmental beneﬁts, based on such a concept, as much as possible to restore the natural and pre-development drainage system. The construction of grey infrastructure in a sponge city is mainly used for sewage treatment and watercourse pipe network construction. In stormwater management, management systems link non-structural approaches to structural deployment for pollution prevention and drainage. Basically, similar to Best Management Practices (BMPs) in the United States and Canada. WSUD (Water-Sensitive Urban Design) is mainly to protect and strengthen the natural water system of urban development, better integrate rainwater into the landscape, minimize impermeable water surface, reduce the peak ﬂow brought by urban development, and protect water quality, reduce the development costs of drainage infrastructure, while adding value at the same time, and all urban water systems should be better integrated in urban design [29]. And sponge city is a systematic framework with methods to improve urban water problems. Therefore, based on the coupling coordination mechanism, this paper provides a basis for decision-making and management of sponge city construction. The sponge city construction evaluation is a diagnostic analysis of the drainage capacity of an area and the environmental impact of the underlying surface. The sponge city construction evaluation is based on the construction of the infrastructure system and economic development level model. Among them, gray infrastructure is a traditional municipal infrastructure dominated by single-function municipal engineering, consisting of roads, bridges, pipelines, and other networks that ensure the proper functioning of the industrial economy [39]. However, the construction of road infrastructure the infrastructure that has a great impact on urban residents’ travel. In general, drainage pipeline network is under road infrastructure. In the construction of sponge cities, gray infrastructure facilities providemunicipalentitiesandresidentswithmunicipalinfrastructureservices, suchasﬂoodprotection, stormwater drainage, and wastewater treatment [39]. The “gray” infrastructure system reﬂects the traditional drainage system and the foundation of a good operation of the city. Green infrastructure refers to a green space network consisting of natural areas and other interconnected open spaces, including natural areas, public protected areas, and productive land with conservation values; it also represents a protected open system network that protects the value of natural resources and maintains the survival functions of humans, animals, and plants [40,41]. The development of green infrastructure is the result of joint promotion of parks, park systems, open spaces, greenways, ecological networks, biological corridors, and storm-water management [39]. The “green” infrastructure system reﬂects the sustainable development model of improving the underlying surface and is the basis of a good ecological environment of the city. The level of economic development reﬂects a city’s strong support for the construction of sponge cities. Based on these evaluation methods and models, combined with the individual indicators that can reﬂect the construction of sponge cities in Henan Province, the index system for sponge city construction was initially determined (Table 1).",
    "Entropy was ﬁrst introduced into the information theory by Shannon. It has been widely used in engineering, social, and economic ﬁelds. It hypothesizes that the quantity or quality of information is an important factor in determining the reliability and accuracy of decision-making [42]. Entropy is often used to measure the amount of useful information provided by the dataset itself and is therefore considered to be a suitable indicator for use in various evaluation cases. Weights can be determined based on the data itself, thereby reducing decision bias and increasing the objectivity of the decision process [43]. The entropy weight method is also to calculate the comprehensive index by the size of the selected index information. The index weight is determined by the judgment matrix composed of the evaluation indicators. Since the evaluation system has positive and negative indicators, the sample matrix needs to be dimensionless [44]. The main indicators selected in this paper are studied through positive and negative indicators. Assume that there are n research objects (mainly cities) in the study area, including m evaluation indicators, and the deﬁnition P is the original data matrix, expressed as: Among them, Pnm is expressed as the m item of the n city (m = 1, 2, 3, 4, 5, 6······; n = 1, 2, 3, 4, 5, 6, 7, 8 9, 10, 11······). Because the dimension of each index coeﬃcient is not uniform, the index coeﬃcient is standardized by the method of extreme diﬀerence. The main indicators selected in this paper are studied by the forward index and the reverse index. When the positive index is larger than the index value, the better the index. The normalization method is: Ynm = (Xnm − minxm)/(maxxm − minxm); the inverse index, that is, shows that, the smaller the index value, the better the index, and the normalizationmethodis: Ynm = (maxxm − Xnm)/(maxxm − minxm).Inthenormalizedmethodformula, Xnm is expressed as a speciﬁc value, minxm is represented as the minimum value of the m index, and maxxm is expressed as the maximum value of the m index. The value is between Ynm∈[0, 1] after normalization [45,46]. In information theory, the larger the entropy value, the smaller the diﬀerence between the values of the evaluation indicators, and the smaller the weight of the index; the smaller the entropy value is, and vice versa [46], to calculate the information entropy of each index, assuming that Em represents the m. The information entropy under the indicator is calculated as: According to the calculation formula of information entropy, the information entropy E1, E2, ... , Em of each index is calculated. The weight of each index is calculated by information entropy. Wm is the entropy weight of the m evaluation index, and then the weight of the index is calculated. The method is [45,46]: Among them, S represents the comprehensive index of infrastructure construction or economic development; Wm represents the weight of each index within the system; Yk represents the evaluation value of each indicator. Coupling refers to the phenomenon in which two or more systems or forms of motion interact and interact with each other through some means. This paper establishes a coupling model of infrastructure and economic development. The calculation method is: Among them, C is the coupling degree between infrastructure construction and economic development, and the value range is [0, 1]. The larger C, the stronger the interaction between infrastructure construction and economic development; S1 and S2 are infrastructure construction and economy, respectively. The comprehensive index of development, k as the adjustment factor, in practice, should make k ≥ 2; this paper takes k = 2. The coupling degree model can only indicate the existence of interaction between systems and cannot reﬂect the level of coupling coordination between systems. Therefore, this paper further constructs a coupling coordination model of infrastructure construction and economic development. The calculation method is: √ where D is the coupling coordination degree; T is the inter-system comprehensive coordination index; α and β are undetermined coeﬃcients, and α + β = 1. This paper assumes that infrastructure construction and economic development interact, so take α = β = 0.5. Based on the relevant classiﬁcation criteria proposed in the existing research [47,48], the median segmentation method is used to divide the D value into four stages. The classiﬁcation criteria are shown in Table 2.",
    "This paper introduces Moran’s I to analyze the imbalance and spatial autocorrelation of the coupling and development of infrastructure construction and economic development between adjacent regions. The calculation formula of Moran’s I is as follows: —\\2 where I represents the overall degree of correlation between regions, Sf = } @,4(¥:- Y) ; Y= ; Hany Yj; Yi represents the degree of coupling coordination of the i region; n is the number of regions, and w;, represents the element of the spatial weight matrix W. I, indicates the degree of correlation between the coordination degree of the i region and the surrounding area, and the local spatial features are displayed by using the Moran scattergram. According to the coupling evaluation model of infrastructure construction and economic development, the comprehensive index of infrastructure construction (S1) and the comprehensive index of economic development (S2), and the coupling coordination degree (D) of the two are calculated. This paper will be in the process of empirical analysis. Infrastructure construction and economic development are regarded as two subsystems of equal importance. Therefore, the undetermined coeﬃcients of the two are all 0.5, that is, α = β = 0.5. Therefore, the comprehensive harmonic index of the two is T = 0.5 × S_1 + 0.5 × S_2, combined with the coupling coordination degree model for calculation; the obtained empirical results are shown in Table 3. Comparing the coupling and coordination of infrastructure and economic development in each city in 2013 and 2017, we can ﬁnd that the average system coupling coordination degree of 18 cities in Henan Province in 2016 is 0.6105, which is slightly higher than the average of 0.6036 in 2013. The infrastructure construction of each city and overall average level of economic development level coupling coordination is in the low and medium coupling coordination stage. Among them, the coordination degree of Zhengzhou City, Luoyang City, Jiaozuo City, Xuchang City, Nanyang City, and Zhumadian City is higher than the average level of Henan Province. The coupling coordination degree of most regions is rising continuously. Among them, the coupling coordination degree of Pingdingshan City, Nanyang City, and Jiyuan City shows a downward trend. the coupling and coordination degree between infrastructure construction and economic development in various regions. Figure 3 shows that the overall evolution of regional infrastructure construction and economic development level coordination can be divided into two types in 2013–2017: the ﬁrst category is the area where the coupling coordination degree is between 0.8 and 1, namely Zhengzhou City. Zhengzhou City has been at a relatively high level of coupling and coordination in 2013–2017, indicating that the infrastructure construction and economic development level are at an eﬀective coupling development stage. In recent years, Zhengzhou Zheng Dong New Area has been built and developed according to the concepts and ideas of sustainable “ecological city”, “metabolic city”, and “sponge city”. Among them, the completed water area covers 18 square kilometers, and the green area covers 39 square kilometers, and the green coverage rate in the urban core area is nearly 50%. Drawing on the experience of modern urban construction in the west, the sustainable water cycle is realized through tracking and integrating low impact development (LID) and rainwater utilization. According to the climate characteristics of the Zhengzhou Zheng Dong New Area, the PP module storage device is used to collect and purify rainwater for green irrigation, creating a sustainable green landscape [49]. The construction of Zhengzhou Zheng Dong New Area is inseparable from the strong economic support. The second category is the area where the coupling coordination degree is between 0.5 and 0.8. Although these areas are in a highly coupled and coordinated development stage, the infrastructure construction and economic development level are relatively insuﬃcient, and the infrastructure construction and economic development level are relatively weak. The two have not yet formed a benign interactive coupling development model, and there is still much room for improvement in the coordinated and coordinated development. Government departments in various regions should formulate corresponding infrastructure construction and economic development level strategies according to local actual conditions, as well as upgrade infrastructure and economic Inordertobetteranalyzethespatialpatternanddynamicevolutionofthecouplingandcoordinated development of inter-regional infrastructure construction and economic development level, this paper uses 2014 and 2017 as time nodes, combined with Table 3, through ArcGIS 10.2 software, respectively, for an inter-regional 2014, 2017 spatial visualization of the system coupling coordination level for the year (Figure 4).",
    "Combined with Table 3 and Figure 4, it can be seen that the spatial pattern of infrastructure construction and economic development level is obviously diﬀerent. The coupling and coordination distributionofHenanProvinceisbasicallyconsistentwiththespatiallocationofeconomicdevelopment, and the degree of system coupling coordination is relatively high in regions with relatively developed economy in areas with low levels of economic development. During the study period, the coordination degree of Zhengzhou City, Nanyang City, Luoyang City, and Xuchang City has been maintained at a high level, while the coupling coordination degree of Hebi City, Zhumadian City, Zhoukou City, and Shangqiu City is in a rising trend state. The degree of economic development of the region is closely related. With the development of the economy, the investment in infrastructure construction is also increasing; the coupling coordination degree of Puyang City, Xinxiang City, Kaifeng City, and Pingdingshan City is declining, which is related to the development of the region and policy. Overall, the infrastructure construction and economic development level of Henan Province presents a spatial pattern of “high west and low east”. However, the classiﬁcation shows that the coupling degree between infrastructure construction and economic development level in Henan Province has not changed, but each prefecture-level city ﬂuctuates in the grade interval. ThroughtheglobalMoran’sIstatistic,itcanbeseenthatthecouplingandcoordinateddevelopment ofinfrastructureconstructionandeconomicdevelopmentlevelinHenanProvincehassigniﬁcantspatial agglomeration, as well as the correlation and concentration between regions, the spatial correlation with the surrounding areas, the degree of spatial diﬀerence. The distribution of the spatial pattern, on whether there is heterogeneity, in this paper, is analyzed by Moran scatter plot (Figure 5). It can be observed from Figure 5 that the level of coupling and coordination between infrastructure construction and economic development level in most regions in the past ﬁve years is in a stable upward and downward ﬂuctuation state. Compared with 2014, the ﬁrst quadrant of 2017 Moran’s I is reduced, and the fourth quadrant is increased. And the Moran’s I index is greater than 0, indicating that there is spatial positive correlation, that is, the area where the coupling degree of infrastructure construction and economic development level is higher (or lower) tends to be signiﬁcantly concentrated in space, and the correlation is stronger; if Moran’s I = 0, it means that the space is not correlated, and the distribution is in a random state. Table 4 reports the relative development degree and relative development type. The results show that Henan Province is generally synchronous development, Zhengzhou City is lagging behind infrastructure, indicating that economic growth is faster than infrastructure construction; other regions are economic development. The lag type indicates that the economic growth is slower than the infrastructure construction, and the construction of infrastructure is more advanced than consumption. Therefore, to promote economic growth, it is necessary to increase investment in land resource conservation and intensiveness in order to realize infrastructure construction and economy. Coordinated development levels and simultaneous development are important ways to achieve coordinated and coordinated development. Based on the coupling coordination degree model, relative development degree model, and spatial statistical analysis, this research work studied the diﬀerence of horizontal and spatial statistical analysis of the coupled and coordinated development of sponge city construction in Henan Province. The results show that: (1) From the perspective of comprehensive level, the problems of inadequate and unbalanced development of infrastructure construction and economic development level are prominent. (2) From the perspective of coordinated development level, the level of coupling and coordination development in Henan Province increased during the sample period, but the level of coupling and coordination development in each region was small. (3) From the perspective of relative development, Zhengzhou City is lagging behind in infrastructure, indicating that economic growth is faster than infrastructure construction; other regions are lagging economic development, indicating that economic growth is faster than infrastructure construction. Slowly, (4) from the spatial statistical analysis, the Moran’s I index is greater than 0, indicating that there is spatial positive correlation, that is, the area with high coupling degree of infrastructure construction and economic development level tends to be signiﬁcantly concentrated in space. location advantages, historical background, social inﬂuence, and policy conditions of various regions, the coordinated development of sponge city construction in Henan Province requires diﬀerentiated regional infrastructure construction and economy development policy. In areas with better economic development, it is necessary to increase the proportion of investment in “green” infrastructure and “gray” infrastructure, as well as appropriately increase the proportion of investment in “green” infrastructure; in areas with insuﬃcient economic development level, it is necessary to adapt to local conditions. In the built-up area, the proportion of “green” infrastructure and “gray” infrastructure will be created to reduce the frequent ﬂooding in the city and to continuously improve the renewal and construction of the drainage system. At the same time, sponge buildings and residential areas should be promoted, and measures, such as roof greening, rainwater storage, collection and utilization, and micro-topography, should be taken according to local conditions to improve the rainwater storage and retention capacity of buildings and residential areas. Rainwater collection and recycling, on the one hand, can provide water for the vegetation of green infrastructure, and, on the other hand, they can providetheuseofreclaimedwaterforthecommunity. Theconstructionofgreeninfrastructureinsponge cities increases the vegetation cover and water area of cities, eﬀectively weakens the urban heat island eﬀect, and thus aﬀects the precipitation process. Therefore, the construction of green infrastructure in sponge cities can conserve water resources, regulate runoﬀ, purify water quality, save water resources, improve the carrying capacity of regional water resources, and enhance the capacity of natural water storage and drainage. Sustainable sponge city construction needs to coordinate the coordination and development of green infrastructure, grey infrastructure, and economic development.",
    "Author Contributions: Conceptualization, L.Z. (Lijun Zhang); methodology, K.W. and L.Z. (Lijun Zhang); software, K.W.; validation, K.W., L.Z. (Lulu Zhang); Formal Analysis, K.W.; Investigation, K.W., S.C., and L.Z. (Lulu Zhang); Resources, L.Z. (Lijun Zhang); writing—original draft preparation, K.W.; writing—review & editing, K.W. and L.Z. (Lijun Zhang); visualization, K.W.; project administration, L.Z. (Lijun Zhang). All authors have read and agreed to the published version of the manuscript. Funding: The present study is supported by the Key Scientiﬁc Research Projects of Institutions of Higher Learning in Henan Province in 2017 (Grant No. 17A170006)."
]