[
    "Citation: Chen, Z.; Kong, F.; Zhang, M. A Case Study of the “7-20” Extreme Rainfall and Flooding Event in Zhengzhou, Henan Province, China from the Perspective of Fragmentation. Water 2022, 14, 2970. https://doi.org/10.3390/w14192970 Abstract: Disaster crisis management is the last defensive line in the face of extreme rainstorm disasters. However, fragmentation undermines the effectiveness of disaster crisis management, and the “7-20” extreme rainfall ﬂooding disaster in Zhengzhou, Henan province, China in 2021 revealed a series of fragmentation problems. The effectiveness of China’s emergency storm ﬂooding management must be seriously considered. We used the “7-20” extreme rainfall event in Zhengzhou, Henan province in China as a case study to perform an inductive, qualitative investigation to understand what fragmentation is and how fragmentation reduces efﬁcacy. Most of the data used for this research were gathered from Chinese ofﬁcial records and online news articles. This study ﬁrst highlights pertinent studies that have been performed and then presents a comprehensive theoretical framework of fragmentation in catastrophe crisis management, which consists of ﬁve aspects: fragmented emergency legislation, emergency organization, information, perception, and services. Second, we have deduced which human responses in the “7-20” event represent the fragmentation issues, and we have examined the detrimental effects of fragmentation in ﬂood crisis management. Finally, suggestions are made for China to increase the effectiveness of disaster crisis management, including encouraging regulatory convergence, matching emergency responsibility and authority, establishing an information-sharing platform, bolstering emergency education and raising risk perception, and changing the dualistic system in disaster crisis management. Keywords: fragmentation in disaster crisis management; disaster crisis management effectiveness; the “7-20” extreme rainfall event in Zhengzhou; disaster management; China Copyright: © 2022 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). The world is now entering the era of “risk society” and “Anthropocene”: the proba- bility of emergencies has increased greatly, and more and more countries are concerned about the potential threat of crises and disasters [1]. Effective and timely disaster crisis management can mitigate damage to people, communities, infrastructure, and the envi- ronment, and there is an urgent need to improve disaster crisis management capabilities. However, the ubiquitous fragmentation problem in disaster crisis management undermines its effectiveness. This fragmentation is rooted in the division of labor-based hierarchy and generally describes the situation of lacking coordination between various govern- ment departments and agencies, as well as decision-making entities involved in disaster crisis management when facing wicked problems, which are cross-administrative levels, cross-sectoral boundary, and cross-policy areas [2]. Fragmentation problems have led to conﬂicting and offsetting disaster crisis management operations [3], wasteful duplication of emergency resources, delayed rescue response, and inadequate support for emergency decision-making. Therefore, it is necessary to examine how to optimize disaster crisis management strategies from a fragmentation perspective by using management tools to achieve an integrated model and maximize the effectiveness of disaster crisis management. Extreme weather events that surpass preparedness criteria and have a greater impact than anticipated provide a challenge to the capability of disaster crisis management in light of global warming and the growing likelihood of extreme weather [4]. On a worldwide scale, China has experienced the most cumulative total ﬂood frequency over the past ten years, and the frequency of heavy precipitation there exhibits an upward tendency [5,6]. While fast-growing urban areas have high population density and high-risk exposure and rural areas have poor ﬂood-proof infrastructures and high vulnerability [7,8], the predicted economic losses and damage to communities caused by heavy rainfall and ﬂooding in- crease [9,10], the Chinese government is thus expected to strengthen its capacity for disaster crisis management in the event of major rainfall catastrophes. Most of the current research on rainfall and ﬂooding management focuses on ﬂood modeling analyses, such as the use of big data and optimal algorithms to provide de- cision support for emergency escape routes and emergency infrastructure siting [11,12], the potential of unmanned aerial systems for emergency information collection [13], and the technology of two-dimensional hydrodynamic modeling for stimulating ﬂood behavior and predicting inundation depths and areas [14–16]. These studies show the potential of state-of-the-art technological research to be theoretically applied for improving emergency decision support systems. Emerging socio-hydrological research focuses on the interre- lationship between social systems and hydrological systems, with particular attention paid to the factors inﬂuencing government and household perceptions of ﬂood risk and their impact on disaster crisis management [17–20]. However, there is a lack of empirical research on social systems, especially governmental disaster crisis management capaci- ties, so the next step should be to focus on how to put risk mitigation into practice and analyze how to optimize disaster crisis management, increasing its efﬁcacy in light of governmental administration of reliable emergency methods, institutional structures, and legal frameworks.",
    "The disaster crisis management of extreme rainfall involves various government departments and agencies, administrative levels, and decision-making entities. The number of emergency response entities is large, and the lack of coordination mechanisms makes the fragmentation problem obvious. In July 2021, the city of Zhengzhou in China’s Henan Province, a relatively dry inland city in northern China, experienced extreme rainfall (called the “7-20” event), which in- evitably caused damage by exceeding the rainfall standards, but the failure of disaster crisis management artiﬁcially led to avoidable deaths and injuries. The problem of fragmented disaster crisis management is prevalent in the emergency operations of decision-making entities. The research question in this paper is: How does fragmentation profoundly affect the effectiveness of disaster crisis management in Henan’s rainstorm disaster? Fragmented management led to fragmented rescue responses, such as a lack of collaboration and infor- mation sharing among emergency response entities, which further caused conﬂicting and offsetting actions, missing the golden time for prevention and pre-control, and so on. In this paper, we will identify the dimension of fragmentation shown in the “7-20” event and analyze its negative impact. The following logical structure was created in this study to address the problems raised above (Figure 1). This article examines the fragmentation in disaster crisis man- agement in this catastrophe and the detrimental effects it resulted in using the case of the “7-20” excessive rainfall event in Zhengzhou, Henan Province, as a case study. Firstly, this paper uses an inductive approach to propose a systematic and universal theoretical frame- work of fragmentation in disaster crisis management based on the analysis of previously conducted research on fragmentation. Secondly, this framework is then used to analyze the fragmentation and negative consequences of disaster crisis management in the “7-20” case from a deductive approach. Finally, recommendations are provided for government practitioners and emergency decision-makers to integrate fragmented dimensions and improve the efﬁciency and effectiveness of disaster crisis management in China. The theoretical framework of fragmentation in disaster crisis management proposed in this paper is all-embracing and adds value for conducted fragmentation-related studies. Aside from application in rainfall disasters, the framework is transferable to the analysis of other emergencies. In addition, this paper supplements the empirical research on disaster crisis management of extreme rainfall disasters from the perspective of government management, providing lessons for other cities in China. Fragmentation is an institutional problem that affects the effectiveness of govern- ment [2]. Western scholars’ reﬂections on the shortcomings of New Public Management (NPM) reforms have brought fragmentation research to a climax. By focusing on per- formance management and single-purpose organizations, NPM ignores the problem of horizontal coordination and may have produced too much fragmentation, hence hamper- ing efﬁciency and effectiveness [21]. It has been argued that fragmented governments are formed when different departments work in isolation, lacking communication and coordination when faced with a common social problem, which ﬁnally leads to the failure to achieve overall policy goals [3]. The polar position of fragmentation is deﬁned as the situation in which policies which undermine each other can be eliminated, better use can be made of scarce resources, synergies may be created through the bringing together of different key stakeholders in a particular policy ﬁeld, and citizens can receive seamless rather than fragmented access to a set of related services [22]. Studies have examined the manifestations, causes, and governance measures of fragmentation, suggesting that government fragmentation is manifested by structural devolution, i.e., excessive division of labor leading to a large number of agencies, and excessive separation of powers lead- ing to a loss of central authority to intervene. For instance, ﬁre services, transportation agencies, emergency management departments, hospitals, etc. are typically involved in crisis management in emergencies such as ﬁres, explosions, ﬂoods, etc. According to their tasks, various departments are involved in crisis management. This division of labor results in mutual ignorance and hinders coordination and communication between organi- zations [21]. Blurred boundaries of responsibility and performance management systems that encourage competition rather than collaboration are the reasons for the hindrance of departmental collaboration. According to Chen Kelin, China had a signiﬁcant epidemic spread in the ﬁrst half of 2020 as a result of local governments’ lack of incentives to work together to avoid disease in the context of their rivalry. Local governments did, however, quickly collaborate after the central government got involved [1,22–24]. Solutions include structural reorganization, hierarchical coordination, i.e., pressure from senior leadership on sectoral agencies to break down organizational boundaries to coordinate [21]; creating an institutional environment and resources that support collaboration [22,24]; and focusing on synergistic goals as much as departmental goals [25].",
    "Disaster crisis management continues the logic of fragmentation, and the problem of fragmentation has become more pronounced as the uncertainty and complexity of emer- gencies have increased signiﬁcantly and conventional administrative systems have become ineffective in emergencies. Related studies have enriched the connotation of fragmentation in disaster crisis management, expanding from the shortcomings of collaboration within government to the lack of collaboration in the governance networks between government, society, and the market. Many scholars have discussed the government-dominated char- acter of emergency management in China, arguing against the lack of roles for social organizations and the public in emergency management. In addition, the fragmentation of emergency information and facilities refers to the lack of sharing mechanisms [26–30], for an illustrative example, emergency rescue forces are built according to the type of disaster and there is a lack of cooperation between rescue teams [31]. Among emergency decision-making entities, there is a lack of a holistic picture of danger [32–34]. There is also fragmentation in the emergency process, such as a mismatch between rescue reaction and warning [35–37]. Chinese scholars have investigated the deﬁciency of Emergency Contin- gency Plans (ECPs), which are the core emergency guidelines for every administrative level, department, and agency in China, suggesting the implementation of ECPs is defective for the lack of rehearsals, risk assessments, and practical responsibility arrangements, resulting in poor operability [38]. While conducted research has provided a more comprehensive analytical perspective for understanding the issue of fragmentation in disaster crisis management, most of the current research has remained at the stage of analogical research, with conclusions being repetitive and biased depending on the purpose of the research and the individual’s knowl- edge structure, and generally lacking in theoretical research to systematically understand fragmentation, and in practical gains for research progress. Therefore, based on the anal- ysis of existing perspectives, this paper aims to propose a systematic and all-embracing theoretical framework of fragmentation in disaster crisis management from the perspective of management and organizational disciplines, which is applicable to analyze most of the fragmentation in disaster crisis management fragmentation, in the hope of adding theoretical gains to fragmentation research. 3. The Theoretical Framework of Fragmentation in Disaster Crisis Management 3.1. Components and Interrelationships of Fragmentation in Disaster Crisis Management Fragmentation in disaster crisis management refers to a situation in which the mecha- nisms, institutions, and legal frameworks for disaster crisis management are not systematic, the emergency decision-maker’s perception and operations are not holistic, and there is an unequal supply of emergency services, all of which ultimately prevents the overall objective from being met. According to the deﬁnition, this paper argues that fragmentation in disaster crisis management consists of ﬁve aspects: fragmented emergency regulations, fragmented emergency organization, fragmented emergency information, fragmented emergency perception, and fragmented emergency services. This paper argues that the organizational environment, rather than individual char- acteristics, determines organizational behavior, and that the organizational environment mainly includes regulations and organization. Therefore, organizational and institutional fragmentation is the root cause of the fragmented emergency information and services, for example, the fragmented emergency information is formed due to various departments holding scattered information as a result of organizational sectionalization, and the weak participation of other subjects, such as communities and markets in emergency manage- ment, may derive from the monolithic governance of China’s government, which led to the lack of collaboration between subjects. Meanwhile, fragmented emergency perception is a cultural environment subtly affecting government, society, community, and individuals, whose formation is related to historical tradition and path dependence, not determined by institutional and organizational factors. However, the integration of emergency perception can be promoted through management tools such as proactive emergency education poli- cies, as emergency decision-makers at many levels, from government ofﬁcials to families, will be impacted by perception. While institutional and organizational systems can deter- mine the behaviors of an organization, the public perception from the cultural dimension has an incalculable inﬂuence on social behaviors. The emergency regulation system is the basis and guideline for the organization to decide what to do when emergencies erupt. China’s emergency regulation system mainly includes emergency laws, management rules, and Emergency Contingency Plans (ECPs), which provide the responsibility arrangements and coordination mechanisms for governmental response to various types of natural and social crises. The fragmented emergency regulations include the following situations: (1) The incoherence of internal logic of the emergency regulations, i.e., goal A is deﬁned but not supported by the correct means. (2) The disconnections of the work process shaped by emergency regulations. Theoretically, policies and institutions must operate through a process of formulation, rehearsal or experimentation, implementation, and evaluation. The absence of any link in the process results in fragmentation. (3) The missing part of crucial arrangements such as practical responsibility lists, and collaboration mechanisms to support integrated emergency response. (4) The lack of articulation in terms of emergency response standards and conditions.",
    "The arrangement of authority and responsibility of disaster crisis management form the organization, which deﬁnes “who is responsible for what emergency response” and “who oversees emergency authority”. The fragmented emergency organization includes the following situations: (1) Excessive distribution of emergency responsibilities led to a fragmented number of departments. (2) Multiple leaders oversee emergency authority resulting in conﬂicting decisions. (3) Mismatched emergency authority and responsibility led to the inability of some departments or hierarchies to carry out their due duties in a holistic manner and to accomplish overall objectives. Fragmented emergency information refers to the lack of overall information on emer- gencies. The causes of it include both management deﬁciency, i.e., lack of information- sharing mechanisms between government, enterprises, and the public on the disaster spot who have access to disaster information, and the complexity of collecting real-time crisis information and predicting the crisis trends, which makes it difﬁcult to obtain the overall information. Fragmented emergency perception refers to the different interpretations of the impor- tance of disaster crisis management and the urgency of emergencies by decision-making entities such as government ofﬁcials and household individuals, in addition to the mis- match between risk perception and risk reality. Emergency perception inﬂuences the decisions and actions of emergency subjects, for example, a disaster prevention-active government will pursue proactive mitigation policies, while disaster-aware rational house- holds (individuals) will take the initiative to avoid risks and cooperate with pre-disaster relocation, etc. Factors such as disaster experience, level of emergency education, and socio- demographic characteristics are closely related to emergency perception status [18]. Some studies have shown that government and household mitigation actions signiﬁcantly inﬂu- ence ﬂood risk and vulnerability trends [19], so it is important to study the fragmentation of emergency perception. Fragmented emergency services are reﬂected in the unequal quality and quantity of emergency services received by different regions and groups. This paper regards disaster crisis management as a type of public service provided by the government, the market, the third sector, and the communities. While the goal of realizing equalization in public services is widely acknowledged by China’s government, disaster crisis management service is far away from equalization as this paper points out, for example, rural areas have received less disaster crisis management services than urban areas in China, as most of the emergency resources are gathered in cities. This kind of relationship between rural and urban is also transferable to other dualistic counterparts such as capital cities and non-capital cities, middle-aged groups and childhood and elder groups. From 17 to 23 July 2021, Henan Province was hit by a historically extreme rainstorm, which was long-lasting and extensive. The worst-hit areas of this disaster event were the Zhengzhou metropolitan area and the northern part of Henan Province [39]. The cumulative process rainfall in Zhengzhou was 543 mm, with a maximum process point rainfall of 993.1 mm and 24-h precipitation of 552.5 mm, exceeding 80% of the local annual precipitation. The highest rainfall amount reached 201.9 mm at 16–17 h, and this round of rainfall amounted to nearly 4 billion m3 of water, which is the widest range and strongest rainstorm in the history of meteorological observation in Zhengzhou. The waterlogging situation in the urban areas of Zhengzhou was severe, with most areas (479.0 km2, ac- counting for 45.3% of the total area) having a maximum inundation depth exceeding the requirements for urban ﬂood control (0.25 m), and some areas (116.0 km2) even having a maximum inundation depth of 2.00 m or more, with an area of 272.4 km2, or 25.8%, having an inundation depth of 0.50 to 2.00 m [16]. The city’s 2607 underground spaces and important facilities were ﬂooded, several areas were cut off from water, electricity, and the Internet, and communication and access facilities were damaged. The extreme rainstorm event caused 14,786,000 people to be affected in 150 counties (cities and dis- tricts) across Henan Province, with 398 people killed and missing because of the disaster, The storm disaster exceeded the preparedness standards and impact expectations, but the fragmentation problems in disaster crisis management in Zhengzhou worsened disaster losses. At 21:59 on 19 July, the Zhengzhou Meteorological Department issued a red warning signal representing the highest level of heavy rainfall disaster, and a second red warning signal was issued at 06:00 on 20 July, but Zhengzhou City’s Flood Control and Drought Relief Headquarters (FCDRHs), which is the commanding authority in Zhengzhou city, did not activate the highest-level emergency response as required. During the period from 10:30 to 18:00 on 20 July, the Changzhuang Reservoir experienced a dangerous situation of pipe surge, ﬂooding eruption, and serious waterlogging in the Jingguang Expressway North Tunnel and Zhengzhou Metro Line 5 Train occurred, with most of the casualties concentrated in this period; on the 21st, the Guojiazui Reservoir was ﬂooded due to the occupied ﬂoodway. Inadequate emergency actions by the relevant authorities during this period led to tragedies that could have been avoided.",
    "Reﬂecting on the failed disaster crisis management behind this extreme rainstorm, the issue of fragmentation has surfaced. The division of jurisdiction among several depart- ments and a lack of coordination are both signiﬁcant contributors to the fragmentation of urban ﬂood control emergency management. The general command of ﬂood control and drought control at all levels should be fully utilized, and the system of forecasting, warning, and planning should be improved. The emergency administrative department should take the initiative to establish and improve the inter-departmental coordination mechanism of urban ﬂood control. Using the “7-20” event as a case study, this paper analyses the reﬂections and negative consequences of fragmentation in this extreme rainfall disaster crisis management. The data for this paper were collected mainly from Chinese government documents and online news reports, including the “Investigation Report on the “7-20” Extreme Rainfall Event in Zhengzhou, Henan Province” issued by the State Council Disaster Investigation Team, and the national-level and municipal-level laws, regulations, and ECPs related to emergency management and ﬂood control. The data collection is mainly from secondary sources, lacking in ﬁeld research and interviews, and the collectors of secondary data may have reservations or exaggerations due to their preferences, so the data sources are inade- quate. This paper will try to select objective data sources and analyze the fragmentation problems of this rainstorm event. The ﬂood control disaster crisis management system in Zhengzhou City is cross- boundary, with governments at all levels, different functional departments, and related agencies having to prepare their ﬂood control Emergency Contingency Plans (ECPs) and set the workﬂow and response conditions within their departments. As a result, many ﬂood-control regulations lack connections with each other, leading to the lack of synergies in response. The following are speciﬁc reﬂections on this case: activating the highest level of emergency response, Zhengzhou City’s Flood Control and Drought Relief Headquarter (FCDRH), as the ﬂood control command agency, did not activate the highest-level emergency response as required until 16:30 on the 20th, by which time 18.5 h had passed since the ﬁrst red warning, and most of the disasters had already occurred, with emergency rescue responses seriously lagging. Besides the FCDRH, functional departments such as the Zhengzhou Transport Department, the district and county governments, and government agencies such as the Zhengzhou Metro Enterprise did not respond to the meteorological department’s warning signals in a pre-controlled manner. After the FCDRH launched the highest-level emergency response, the Subway Line 5 Train ﬂooded, but the Zhengzhou government and the Metro Enterprise lacked a linkage mechanism, and the Metro Enterprise was late in launching the emergency response, resulting in the underground drowning accident. Emergency Contingency Plans (ECPs) are supposed to go through the process of formulation, rehearsal, and assessment, and the absence of any link results in fragmentation. The “7-20” case has reﬂected a signiﬁcant fragmentation problem in terms of the absence of the ECPs process. First, the absence of formulation means some disaster crisis management entities do not even prepare their ECPs as required by law, so when the “7-20” extreme rainfall event occurred those subjects had no plan to follow and responded messily or had no response at all. Second, the absence of ECPs’ rehearsal contributed to the poor disaster crisis management experiences of decision-makers, which further caused them to neglect the working procedures set out by ECPs. During the “7-20” rainfall event, many subjects did not take timely and appropriate measures as required by ECPs (Table 2), even though the conditions for activating are clear, resulting in a serious lag in emergency response. Finally, the absence of assessing the early warning efﬁciency shaped the action of the Zhengzhou Meteorological Department, which only focused on issuing warning signals, rather than considering how other departments and the public will react to the warning signals [37]. In this case, the Zhengzhou Meteorological Department issued a red warning signal with only rainfall forecasts and no defense guides for the public, enterprises, and governments. This makes it difﬁcult for the public who has no weather expertise to judge the disaster consequences only according to the rainfall. The fact that people continued to go to work and school and other sectors continued to operate reﬂects that they did not take the Meteorological Department’s red warning seriously or did not know the red warning at all.",
    "The content of Zhengzhou’s ﬂood-control ECPs is fragmented because of the missing responsibility arrangement and coordination mechanism. The State Council requires that local government ECPs should “clarify the responsibility for predicting, warning, alerting, receiving, response, rehabilitating and rebuilding; clarify the leading organization, com- manding organization, daily duty organization, collaborating departments, participating units, responsibilities and authority for emergency response in the administrative region”, however, Zhengzhou ﬂood-control ECPs only clariﬁed commanding bodies and participat- ing units, and the emergency responsibility arrangement is largely duplicated with regular responsibilities, which is not useful in the face of extreme rainstorm emergencies. Besides, the ECPs did not include enough emergency participating member units, or enough respon- sibility lists, for example, the ECP designed by Zhengzhou Urban Management Department did not clarify the ﬂood-control responsibility of Metro Enterprise, which was proved to be an important member in the “7-20” case, and the responsibility list of Zhengzhou Trans- port Department only contains safeguarding emergency transport, without road condition management under rainstorms. In addition, Zhengzhou ﬂood-control ECPs did not clarify practical emergency coordination mechanisms, which cannot guide the emergency subjects to collaborate. The blurred, incomplete emergency responsibility arrangement for Zhengzhou city’s FCDRH contributed to the absence of effective leadership. When the extreme rainfall continued, with some reservoirs surging and areas ﬂooded, most of the leaders went to the disaster site. Some of them were stuck in trafﬁc, and some of them could not acquire the latest disaster information as the communication facilities were damaged by ﬂooding. No one could study the overall disaster situation and collect news from all sides, so the leadership is ineffective. The mismatch between emergency authority and responsibility describes a situation in which “Those who should not be in charge are blindly in charge, those who should be in charge have no responsibility, and those who want to be in charge have no authority.” In the “7-20” case, the fragmentation of emergency organization is reﬂected as follows: Reservoir was at major risk of roiling due to the spillway being blocked by a temporary construction road, and the construction unit, Henan Wujian Construction Group (referred to as Wujian), built a construction road within the spillway in 2018, which seriously affected the safety of the reservoir’s ﬂood discharge. In 2021, the Zhengzhou Erqi District Government requested Wujian to restore the spillway to its original state and clean up the abandoned soil and slag before the ﬂood, but Wujian rejected it with the excuse that their construction was not under the control of the district government but the Zhengzhou Municipal government as a key project [41]. The Zhengzhou Municipal Government has the power to manage infrastructure planning but not the responsibility for local ﬂood control. The construction of infrastructure has caused negative ﬂooding effects in the short and long term. Yet, the district government, responsible for local ﬂood control, has no power to interfere with municipal projects. The fragmented emergency organization has resulted in a lack of ﬂood prevention considerations in infrastructure development and the overall goal of building a ﬂood- resilient city cannot be achieved. Emergency decision-makers are faced with the conﬂicting emergency ethics of eco- nomic operation and safety assurance, and therefore need sufﬁcient information to support emergency decisions, yet the fragmentation of emergency information has led to insufﬁ- cient support for that. Functional departments have access to information on rain-storm disasters, for example, the meteorological department monitors rainfall, the emergency management department has risk assessment data, and the water resources department monitors water conditions such as water level and ﬂow rate in rivers, lakes, and reser- voirs, etc. The lack of information sharing between departments and the fragmentation of information sources exacerbates the complexity of emergency decision-making. The post-disaster investigation was difﬁcult, complex, and professional, based on the scattered responsibilities of disaster crisis management subjects, the large number of regulations and documents, and the wide scope of the disaster. The State Council Disaster Investigation Team conducted a comprehensive and detailed investigation into the extreme rainfall event in Zhengzhou, Henan Province, and published an investigation report. This is the ﬁrst region-wide survey of natural disasters in China and is of special signiﬁcance. The investigation team reviewed more than 90,000 pieces of information, explored the site more than 100 times, conducted nearly 200 discussions and research, and interviewed more than 450 people, which entails a huge workload; and the investigation team was composed of academicians and authoritative experts in various professional ﬁelds, and the investigation team was divided into several special working groups according to different investigation themes. The fragmentation of storm emergency information has increased the difﬁculty of post-disaster investigation and learning.",
    "The government and the public are prone to underestimate the probability and severity of extreme rainstorms, thus, there is a mismatch between risk reality and risk perception, forming the fragmentation of perception. Perception will further determine decision making, for example, a government with low-risk perception will produce a passive disaster prevention policy, demolishing the environment with no restraint for development until a crisis erupts; the ofﬁcials with bounded-rational perception may make a wrong judgment about disaster reality and misdirect disaster crisis management; the households and individuals with low awareness about risk may not be inclined to take prevention measures. In the “7-20” case, the Zhengzhou leading ofﬁcials from the commanding department subjectively judged that the inland northern areas in China will not suffer from rainstorms, even with the red warning signals from the Meteorological Department, which directly led to the lagging emergency response of all sectors. In addition, the public is reliant on ofﬁcial measures and the majority will continue to work and go to school if the notice for closing classes and business is not issued ofﬁcially. Emergency-related regulations are the guidebook for governments and institutions to take emergency actions in the face of extreme rainfall events. Holistic regulations shape a comprehensive emergency response, while fragmented regulations shape fragmented emergency operations. The fragmentation problem in the “7-20” case provides ideas for emergency practitioners to optimize the emergency regulations system. Firstly, a warning-led emergency response mechanism should be established, and the commanding department should be synchronized with the warning department to keep disaster information and emergency operations in sync, to prevent the warning department from being siloed from others. Drawing on Beijing’s experiences, in which a holistic emergency regulations system was developed after the 2012 rainstorm, the meteorological department is required to obtain the consent of the commanding authority to issue a warning above the yellow level, thus ensuring that the command authority is kept abreast of rainfall information and keeps in touch with warning actions [42]. In addition, detailed emergency operations of commanding agencies and members corresponding to the warning levels are explicitly formulated to ensure that all functional departments act correctly upon receiving the warning signals. These arrangements are designed to ensure that warning actions are closely linked to the emergency pre-control response operations. Secondly, the land development department should be incorporated into the ﬂood- control emergency system to achieve whole-process disaster crisis management. Infras- tructure and housing construction will change the condition of the city’s subsurface, thus affecting ﬂood production and conﬂuence. Reducing ﬂood risk requires ensuring that infrastructure is built to meet ﬂood resilience requirements. Beijing has set up a special sub-command for housing and urban-rural construction to manage the prevention of storm ﬂooding and geological hazards in housing, transport, rail, and underground space, incorporating land development into the ﬂood-control emergency system to achieve a combination of prevention and rescue. Thirdly, ﬂood control emergency pre-drills and drills are of great signiﬁcance. ECPs are the guidelines for emergency rehearsal in China, so they should be strictly imple- mented, and emergency coordination mechanisms should be explicitly formulated. It is better to practice it once than talk about it a thousand times. Therefore, the following recommendations for ﬂood control emergency pre-drills are made: ﬁrst, creating sound material reserves, such as medical supplies and emergency maintenance for daily necessi- ties; second, using big data technology to analyze the best transfer routes and construction locations for emergency facilities; third, for ﬂood-prone areas, developing ﬂood control drills for the active population and key transportation sectors; fourth, to stay up to date on ﬂood disaster information and maintain emergency management operations in sync, collaboration mechanisms should connect various government departments, the public, and other government agencies like city transportation companies. The fragmented emergency organization has led to a situation in which those who should not be in charge are blindly in charge, those who should be in charge have no respon- sibility, and those who want to be in charge have no authority. Matching the ﬂood-control emergency responsibility and authority requires that the departments with responsibilities have sufﬁcient authority and resources to intervene in the irregularities, while at the same time compacting the ﬂood-control responsibility of the authority departments. Besides, it is important to promote the matching of managerial powers with professionalism to reduce the interference of administrative disadvantages in the professional work of ﬂood-control emergency management.",
    "Obtaining holistic ﬂood disaster information can reduce information asymmetry and uncertainty, thus providing scientiﬁc support for emergency decision-making. To tackle the problem of fragmented information, ﬁrstly, it is necessary to establish a disaster information sharing platform to synchronize information from all sides. For example, the Department of Homeland Security Science and Technology Directorate (DHS-S&T) in the United States has launched the Social Media Alert and Response to Citizen Threats (SMART-C) program using big data technology to collect real-time disaster information from the public at disaster sites, enabling information sharing between the government and the public [43]. Secondly, as the disaster information from the spot is hard to collect due to the ﬂooded transportation and damaged communication facilities, advanced technology can be used to collect real-time information and analyze ﬂood trends. For instance, satellite images, wireless communications, unmanned aerial vehicles, and remote sensing technology will help to recover real-time information on ﬂood threats, assisting in the issuance of early warnings and the gathering of disaster information. The government should strengthen the education of emergency response knowledge for managers of government departments, grassroots government executives, enterprises, and institutions, as well as the public, and do a good job in emergency response publicity and education to raise awareness of the crisis, as well as prevention and response among all parties. For government personnel, it is important to improve their emergency sensitivity and emergency expertise and to take timely emergency action; for the public, it is important to improve their awareness of prevention and their ability to make judgments and to provide emergency self-help training. Besides, the government should announce risk sources to the public. Urban and rural areas, provincial and non-provincial cities, ﬁrst-tier and non-ﬁrst-tier cities, middle-aged and non-middle-aged groups, etc. These ‘pairs’ are strong on one side and weak on the other, forming a dichotomous structure. The binary structure is not only deeply rooted in people’s minds but is also hidden in the system to entrench further the dichotomy, such as in the urban-rural hukou system. Emergency services are also inﬂuenced by the dualistic concept and system, which leads to the inequality of services. The strong side of the dualistic structure usually has better access to emergency resources and receives a better level of emergency services than the weak side. To solve the problem of fragmentation of emergency services, the dualistic concept and system of disaster crisis management should be broken down to equalize emergency services. Previous discussions on the division between urban and rural areas, ﬁrst-tier cities, and non-ﬁrst-tier cities have aggravated the recognition of the binary structure in the social consciousness, so it is necessary to break the binary pattern in the construction of the discourse, focus on regional integration, dilute the binary concept from the consciousness, and balance the public attention, to promote the disadvantaged side to receive more emergency resources, especially social donations and government attention. In terms of institutions, the administrative boundaries of emergency services should be broken down and emergency services should be reshaped to focus on the needs of the public; support should be given to the construction of disaster prevention, relief, and mitigation systems and capacities in rural areas, to improve their preparedness. The problem of emergency fragmentation emerges from the failed emergency man- agement in the “7-20” extreme rainfall event in Zhengzhou, Henan Province. This paper takes this as a case study and innovatively uses the theoretical framework of emergency fragmentation to analyze the human response to the “7-20” event, and the following is a summary of the key content: First, fragmentation in disaster crisis management consists of ﬁve aspects: fragmented emergency regulations, fragmented emergency organization, fragmented emergency infor- mation, fragmented emergency perception, and fragmented emergency services. Among them, fragmented regulation is the key issue, which both underpins the functioning of the organization and inﬂuences other aspects of emergency response fragmentation. This analytical framework of fragmentation is beneﬁcial for the academic community as it ﬁlls a gap in the current study of emergency fragmentation and ﬂood disasters and provides the- oretical support for the reform of China’s disaster crisis management system, mechanism, and legal system. Second, the “7-20” case study revealed harmful effects of fragmentation: fragmented emergency organization, or the mismatch between emergency authority and responsibility, contributed to the lack of authority to carry out duties and interference with professional work; fragmented emergency information exacerbates the complexity of decision-making and post-disaster learning; fragmented emergency perception lowers risk awareness; and fragmented emergency regulations led to the lack of synergies and experience in emergency operations. These ﬁndings offer emergency management expertise to other Chinese cities, enhancing the human response to storms and ﬂoods that occur on a regular basis.",
    "Third, measures for holistic ﬂood-control disaster crisis management include pro- moting the convergence between regulations, matching the emergency responsibility and authority, establishing the emergency information-sharing platform, strengthening emer- gency education and raising risk perception, and changing the dualistic system in disaster crisis management. These recommendations will help policymakers encourage the de- velopment of an intersectoral, collaborative, and whole-process approach to emergency management, with the hopes of strengthening emergency management capabilities, en- hancing the efﬁciency of disaster responses, and defending lives and property. This paper discusses the negative impact of the fragmentation of emergency manage- ment of heavy rainfall and ﬂoods on the effectiveness of emergency management, but is limited by the lack of government information and does not analyze in depth the inter- action between the various types of fragmentation and how they are manifested in the presented case. For example, the fragmented emergency regulations and the fragmented emergency organization, although manifested in different ways, affect each other, and an in-depth discussion of the interactions between fragmentation issues would be useful in proposing more realistic governance measures. In addition, most of the case studies in this paper were sourced from secondary sources and face-to-face interviews could not be conducted with the relevant ﬂood control emergency decision-makers in Zhengzhou, Henan Province, so there is still much case-related emergency management information yet to be explored. Future research will further explore the interrelationships and causes of emergency fragmentation, dig deeper into the information related to the emergency management measures in Zhengzhou, Henan Province, during the “7-20” disaster, and propose more speciﬁc policy recommendations to provide a basis for policymakers to reform emergency management mechanisms, institutions, and legal systems. Author Contributions: Conceptualization, F.K. and Z.C.; methodology, Z.C. and F.K.; validation, Z.C., F.K. and M.Z.; formal analysis, Z.C. and F.K.; writing—original draft preparation, Z.C.; writing—review and editing, F.K., M.Z. and M.Z.; visualization, Z.C.; supervision, F.K. and M.Z.; project administration, F.K. and M.Z.; funding acquisition, F.K. and M.Z. All authors have read and agreed to the published version of the manuscript. Funding: This research was funded by the National Key Research and Development Program of China, grant number 2018YFE0109600; Higher Education Scientiﬁc Research Planning Project of China Higher Education Society for 2022, grant number 22DL0302; the National Natural Science Foundation of China, grant number 61901471, 41801064, and 71790611; the Beijing Social Science Foundation Project, grant number 19JDGLA008. Data Availability Statement: No new data were created or analyzed in this study. Data sharing does not apply to this article. Acknowledgments: The authors would like to acknowledge the helpful comments of the anonymous referees of the journal, who have helped to improve this paper."
]