[
    "Abstract: The concepts of resilience and livelihood resilience are growing in prominence with water resource development that aims to measure and build resilience to speciﬁc disturbances and shocks. However, practical frameworks to measure livelihood resilience are needed, not just a theoretical framework. In this paper, we introduce the livelihood resilience measurement (LRM) framework, which draws on Hooke’s law; use the state vector method to calculate livelihood resilience scores; and test the eﬀectiveness of the method by correlation analysis. We illustrate the framework by using it to measure livelihood resilience in Henan Province, China, and assess the strategies that build livelihood resilience. The advantages and limitations of the framework are explored and discussed by drawing on empirical examples. Besides illustrating how to apply the LRM framework in a practical case, we discuss how to communicate with stakeholders to identify and strengthen the factors that build resilience. In this study, land ownership, housing and property value, and emergency cost are the most signiﬁcant of these factors. Thus, the LRM framework has the potential to help reservoir-aﬀected families protect their livelihood capital and to help governments improve social welfare. It can thus serve as a tool for monitoring and improving the eﬀectiveness of policies and practices aimed at building livelihood resilience. The Sustainable Development Goal 6.5 proposed by the United Nations is to implement integrated water resources management at all levels by 2030, including cross-border cooperation as appropriate [1]. This shows that countries all over the world attach great importance to the development and utilization of water resources and promote the construction of large-scale water conservancy infrastructure, such as large dams, large hydropower stations, and extensive irrigation networks [2]. The construction of water conservancy facilities not only controls and manages water resources, but also aﬀects national policies and plans. It is vital to the development of the nation, society, and people [3]. For example, the construction of the Logan Dam in Tajikistan can enhance the people’s sense of national identity and patriotism and is also conducive to social unity and stability [4]. In Turkey, water resources development is considered a strategic tool to achieve food and energy security, as well as a strategic tool to strengthen domestic peace and stability and foreign inﬂuence [5]. However, the development of water resources also brings about water politics issues, which will aﬀect the results of interactions, conﬂicts, and cooperative relations between the actors involved [6]. Although water infrastructure projects can help regulate and utilize hydropower resources [7], they often involve displacing and resettling local people. For example, in China, most of the groups forced to resettlement due to the water conservancy projects live in economically underdeveloped areas with low productivity and weak livelihood capital. Moreover, their livelihood can be changed as a consequence of the restructuring of economic activities resulting from displacement [8]. Not only can they not reasonably share the beneﬁts of water resources development, but they may fall into poverty [9]. We usually call the families who are forced to leave their original residence due to the construction of water conservancy projects and are resettled to the new resettlement sites for production and living as “reservoir-aﬀected families” (RAFs) [10,11]. Existing studies focus more on the RAFs’ vulnerability, displacement-induced problems, and the development results after resettlement [12,13], rather than their performance and ability to deal with risks during relocation. We summarized the holes in existing research: First, the RAFs’ ability to be aware of and respond to risks is neglected. Many studies only consider vulnerability of livelihoods [14–16]. This vulnerability represents the possibility that livelihoods will be damaged in the future, without considering the possibility of early warning and adjustment [17]. Second, the meaning of resistance and adaptation are confused. Resistance focuses on the RAFs’ action to facing risks based on their situation, but adaptation is a long-term process. In this process, RAFs will receive attention and help from the outside world, which provides them more learning opportunities and resources [18–20]. Therefore, the results of adaptation do not fully represent the ability of RAFs to resist risks. Finally, the study of sustainable livelihoods focuses more on livelihood capital and livelihood strategies [21,22], without delving into livelihood behavior and livelihood ability to deal with risks in the short term. In summary, the existing research on the short-term responsiveness and resistance of RAFs when facing risks is insuﬃcient. Therefore, this article pays attention to the performance and ability of RAFs to respond to and resist risks and maintain livelihoods during the relocation period, so as to ﬁll the gaps in existing research.",
    "Resilience research has become a focus of the international development agenda and an essential criterion for measuring the development potential of individuals or regions [23]. We argue that combining resilience thinking with livelihood issues can help us assess RAFs’ ability to cope with external pressures and threats, as well as to return to the steady state of livelihood [24–27]. Especially for RAFs in China, they are mainly aﬀected by the forced relocation policy and need to be resettled to villages or towns original residence. Generally speaking, excluding the inﬂuence of natural disasters and other irresistible factors, the major challenge for Chinese RAFs is whether they can resist risks and resume as soon as possible to maintain their livelihoods when their livelihood activities are forcibly suspended and their livelihood strategies are forced to change. The development of the research on resilience since 1970 can be divided into ﬁve stages [28]. In the 1970s, researchers studied resilience from the perspective of energy. The concept originated in the ﬁeld of materials; in physics it represents the ability to store energy [29]; in engineering it is called ﬂexural elasticity [30]. By extension, in ecology, it was considered to have the characteristics of persistence, absorption, and maintenance [31]. Resilience was related to the meaning of persistence and absorption. In the 1980s, the focus of resilience research shifted to recovery; that is, the speciﬁc behavior of the research object during the recovery process. Resilience at this stage included the characteristics of coping, learning, rebounding, and restoring balance [32]. Resilience meant bouncing back and returning to equilibrium. In the 1990s, researchers deeply analyzed the root causes of resilience, including resilience structure, active response, self-organization, and endogenous changes. Now resilience meant prevention, anticipation, and adaptation [19]. Prevention measures can reduce or minimize the scale or severity of the disaster impact [33,34]; anticipation represents early warning and active response; and adaptation, which had gradually become one of the core concepts, is the ability to cope with stressors [35,36]. In the 2000s, resilience researchers followed the logic of complex system evolution. That is, they believed that research methods should go beyond linear and causal relationships and focus on multilevel changes in complex systems [37]. Resilience was related to ﬂexibility, rebound, and transformation. In the 2010s, we are encouraged to use innovative ideas to explore the development of resilience. Resilience gradually evolved into a neoliberal construct. That is, when the system is in an unstable state and exceeds the level of self-organization, it will develop in a new direction [28,38]. Thus, there are two main ways to understand resilience: some research describes it as an ability or capacity; other research regards it as an attribute. Capacity refers to the possible actions and eﬀects of individuals or systems to solve disaster problems [28]. Resilience as an ability can be used to describe the whole process of an individual or system responding to, recovering from, and learning from a disturbance and even adapting to its new environment [39,40]. However, some sociologists have also emphasized the importance of unique processes such as adaptation and transformation [41], and these processes can be regarded as inconsistent with the notion of resilience as “bouncing back”. Therefore, Holling proposed that resilience, potential, and connectedness are the three attributes, which shape the adaptive cycle and the future state of a system [42]. On the other hand, Walker believed that resilience, adaptability, and transformability were the three attributes of social-ecological systems which would jointly determine the direction of future evolution of the system [43]. Resilience reﬂects performance in maintaining function, structure, characteristics and feedback. Adaptability is the capacity of actors in the system to manage resilience, and transformability means fundamental change [44]. We concluded that there are still some diﬃculties in measuring livelihood resilience [45]: The theoretical frameworks of livelihood resilience based on the researcher’s experience and knowledge are subjective and one-sided; it is diﬃcult to determine the determinants and structural eﬀects of livelihood resilience [46], and research has trouble identifying the dynamic results of livelihood resilience [47]. Still, researchers are continually enriching the concept of resilience [47–49] and have changed their assumptions about resilience from abstraction to an accurate reﬂection of how resilience can be realized in practice [9,23,28,50]. Based on the above research trends, this article pays attention to how microsocialsystemsrespondtorisks, especiallytheRAFs’livelihoodsystem, whichisanopen, dynamic, and complex system. In their livelihood systems, households have the ability to adjust behaviors and adopt strategies to cope with the external disturbance [51,52]. Therefore, we assume that resilience is one of the attributes of the RAFs’ livelihood system, but we also put clearer bounds on resilience. First, resilience is not the opposite of vulnerability. Vulnerability emphasizes the characteristics of susceptible and unsustainable, while resilience research takes into account the system’s response, which transforms passive acceptance of crisis into active response to change [17]. Second, the elements of resilience do not include adaptability and transformability; resilience takes precedence over adaptability and transformability in the stage of responding and resisting risks [49]. Finally, we take it that learning, organizing, and resourcefulness are inherent capabilities of the system and thus are only used as inputs to realize resilience, not as part of the resilience framework [28]. Resilience is very important in describing the performance of individuals or groups in coping with risks, and there is an urgent need for practical methods to measure it [40,46,53–55].",
    "To sum up, on the basis of existing research, this article introduces a fresh look at deﬁnitions of livelihood resilience and its measurement. Speciﬁcally, this article uses “livelihood resilience” for the ﬁrst time to analyze the performance of the RAFs’ livelihood system in responding, resisting, and absorbing risks during relocation and resettlement and proposes an operable and veriﬁable quantitative method to measure their livelihood resilience— the livelihood resilience measurement (LRM) framework, which draws on Hooke’s law, uses the state vector method to measure livelihood resilience scores, and uses examples to test and analyze the model. This research has two contributions tothecurrentliterature: (1)Intermsoftheoreticalresearch, thisstudyinnovatestheresearchperspective and evaluation method of livelihood resilience. It has used the principles of dealing with complex nonlinear problems in physics and applied them to the analysis and measurement of livelihood resilience. (2) In terms of practical application, we believe that by analyzing RAFs’ livelihood resilience, their response to risks can be estimated in advance, which is vital in identifying susceptible families Therefore, this article focuses on three questions: (1) What is the deﬁnition of RAFs’ livelihood resilience, and how does it function in the livelihood system? (2) How to quantitatively assess the RAFs’ livelihood resilience? (3) What are the key factors that have a signiﬁcant impact on livelihoods resilience among the internal elements of the livelihood system. Four sections follow this introduction. Section 2 introduces the livelihood resilience measurement framework. Section 3 explains the data sources and methods. Section 4 presents the results. Section 5 discusses the advantages and limitations of the model, and the eﬀects of livelihood capital, livelihood transfer and livelihood buﬀer on livelihood resilience. Section 6 concludes with implications for policy and practice. As mentioned above, some scholars have realized the importance of the unique processes of adaptation and transformation, and these processes are regarded as inconsistent with the process of resistance and recovery [41,44]. Yarveisy et al. (2020) pointed out that adaptation is seen as an independent capability of the system, not as part of the absorption or recovery process [56], and the challenge in the actual situation is how to determine the period of each process. Unlike many current quantitative research eﬀorts, this paper combines with the actual situation of RAFs in China and provides a fresh look at the research boundaries and deﬁnition of livelihood resilience. We assume that the RAFs began to relocate at T1 and completed their relocation at T2. Before the relocation, the RAFs’ livelihood was at the initial development stage (T0 ~T1). The involuntary relocation is a policy intervention in the form of an external shock (F in Figure 1), so RAFs face problems such as reduction of land area, loss of production places, and the suspension or unemployment of workers [9,57]. Livelihood activities are therefore suspended or changed, and livelihood capital is lost. During the relocation, they need to rely on their own ability to weather risks, and their livelihood level is reduced (∆X in Figure 1). That is, RAFs are in the response and resistance stage, where the inherent resilience of their livelihood system takes priority eﬀort (∆T in Figure 1). After the relocation, they rebuild their livelihood systems with external help and support, such as community activities, welfare policies, and ﬁnancial assistance. This is the adaptation or transformation stage (after T2). The whole process is sketched in Figure 1. This article focuses on the RAFs’ performance in the response and resistance stage. At this stage, there are external forces acting on each RAFs’ livelihood system, the system is changed. For this we use the analogy of the Hooke’s law, which is a basic element of mechanical elasticity theory. Hooke’s law states that within the limits of elasticity, the deformation of an object is proportional to the external force that causes the deformation [58]: where k is the elastic coeﬃcient, which is determined only by the nature of the material [59]. The tensile (compression) properties of an object per Hooke’s law are similar to the characteristics of individual response and resistance to risks in social science issues. Thus, we consider livelihood resilience as one of the properties of the livelihood system: its resistance to alteration. This deﬁnition builds on early socio-ecological concepts of resilience, centered on the ability of the system to maintain core functions in the presence of threats [31,60]. Therefore, we deﬁne livelihood resilience as an attribute of the livelihood system that characterizes the capacity of RAFs in responding to, absorbing, and resisting risks and maintaining their livelihoods under the impact of forced resettlement. That is, livelihood resilience reﬂects the short-term actions of RAFs to resist risks, rather than long-term adaptation or transformation after their relocation.",
    "The signiﬁcance of Hooke’s law is that it has created an important research method that can linearly simplify the complex nonlinear phenomena in the real world [58]. Therefore, it seems logical to model livelihood resilience on Hooke’s law. That is, livelihood resilience is positively correlated with the size of the external shock and negatively correlated with the magnitude of the decline in livelihood. However, the livelihood recovery mechanism after the shock are more complicated than simple physical phenomena, it is diﬃcult to explain or measure the interaction relationship of the internal elements of the livelihood system with a single indicator. We establish the concept of the spatial state of the livelihood system and use the state vectors to describe the state and change of the independent variables in the livelihood system [61,62]. The state vector is a set of variables describing the dynamic behavior of the system and the state of the system at a speciﬁc moment. Let x1(t),x2(t),...,xn(t) be a set of state variables of the system. Then the state vector has this set of state variables as components [63]: and K is a matrix of size n × m. The matrix is a way to analyze the state of the system. The magnitude and direction of the change of the system state can be represented by the features of the matrix [46]. Thus, K is used to describe the status of the RAFs’ livelihood system in the response and resistance stage. By solving the matrix K, a series of variable relations can be converted into constants. Multiplying both sides of Equation (3) by KT, we get: Since Equations (3) and (5) have the same solution, the description of matrix K can be transformed into the measure of the square matrix KTK. The square matrix describes the state when the system is resisting, and the eigenvalue of the square matrix can reﬂect the speed of system movement or change. We use the maximum eigenvalue of the square matrix to characterize the measurement results of livelihood resilience (LR): This article screens the indicators based on the following basic steps: First, we sort out relevant literature and list indicators related to the research question. Secondly, we screen and supplement the indicators based on the actual situation learned from the ﬁeld survey. Then, we asked two Chinese experts (Kaiwen Yao and Dan Zhang) to score the indicators and remove the inconsistent indicators. Finally, we calculate the collinearity of the indicators to further screen out highly relevant indicators. According to the LRM framework, we need to construct two state vectors to describe the impact of the external stresses and the changes in the RAFs’ livelihoods. The state vectors describe the state of the system [58], so the selection of state variables must conform to the realization. Therefore, based on the facts of the reservoir aﬀected resettlement in China, we conduct a comprehensive investigation and analysis of the various impacts and pressures on their families’ livelihoods, as well as the change of livelihood results shown by the families, to select speciﬁc indicators that can describe the state of RAFs’ livelihood system. Although RAFs receive monetary compensation before relocation, their losses in terms of social adaptation and livelihood production cannot be quantiﬁed [58,64]. During the relocation period, RAFs’ livelihood capital is lost, livelihood strategies are forced to change, and livelihood capacity is limited. Forced relocation has a profound impact on RAFs’ primary livelihood, which is mainly reﬂected in the reduction of production places [65], the loss of ﬁnancial and physical capital, the inconvenience of public services and welfare [66], and the decline of individual initiative to develop production [67]. Therefore, the state variables for the impact of the external stresses include reduction of cultivated land area; economic losses in housing, property, and income; decline in production convenience; and degree of worry about future development. The changes in livelihood are the result of the interaction between external stresses and system resilience, mainly reﬂected in living standards and quality of life [68]. In light of the 12 indicators proposed by the Organization for Economic Co-operation and Development [69], we use food consumption level, employment rate, income, and expenditure as the measurement standards, based on the RAFs’ survey responses [57,58,70,71]. “Quality of life” is diﬀerent from “living standard” and refers to the satisfaction of social needs [72]. The state variables for the change of livelihood (after versus before relocation) include increase of the Engel’s Coeﬃcient, decline of the employment rate, decline rate of per capita net income, and decline of production satisfaction.",
    "Hooke’s law states that the elasticity coeﬃcient is determined only by the nature of material. In the same way, we focus on the internal structure and characteristics of family when we study the generation mechanism of livelihood resilience. In recent years, structural dynamics has been widely used as an essential tool for understanding complex social ecosystems [46]. Structural dynamics is a structural analysis method to study the dynamic response of the system and identiﬁes structural eﬀects through analysis of three parameters: mass, damping, and stiﬀness [73]. First, mass is a basic attribute of matter and exists in all physical systems [73]. The quality of the livelihood system is regarded as a collection of assets owned by the family and is the basis for supporting the evolution of the system [42,74,75]. Therefore, the various capitals stored in the livelihood system play a role in absorbing interference. The more capital stock, the greater the shocks the system can absorb. Second, damping is an inherent attribute of a material, which is derived from the internal resistance to movement between diﬀerent layers of the material itself [73]. The damping of a livelihood system can be regarded as controlling the ﬂexibility of the interaction between the components within the system and between the system and the external environment [42,76], which can promote the transformation and utilization of resources when the livelihood system responds to external risks. Third, stiﬀness makes a structure more rigid, which can reduce the eﬀect of external forces [73]. The stiﬀness of a livelihood system can reduce the eﬀect of external interference and help maintain the original state. The stiﬀness of the livelihood system is mainly determined by the structure of the system, which acts as a buﬀer. A more robust livelihood system can resist stress more eﬀectively. In general, livelihood capital (corresponding to the mass matrix), livelihood transfer (corresponding to the damping matrix), and livelihood buﬀer (corresponding to the stiﬀness matrix) play the role of absorbing, responding to and resisting risks respectively, and they are the determinants of livelihood resilience. In term of livelihood capital (corresponding to the mass matrix), we use livelihood capital to characterize the mass of the system, including natural capital, ﬁnancial capital, physical capital, human capital, and social capital [77]. As in other studies, the indicators to quantify the system’s capital stock (land ownership, per capita disposable income, housing and property value, population size, dependency ratio, average labor skills, health status, and social network added value) are organized around these ﬁve categories [78–81]. In term of livelihood transfer (corresponding to the damping matrix), we focus on the RAFs’ ability to control their livelihood behaviors and use social welfare to support their livelihood when responding to risks. Speciﬁc quantitative indicators include utilization of infrastructure and resources, information recognition capabilities, participation in welfare projects, social cooperation, and social trust [47,82–84]. In term of livelihood buffer (corresponding to the stiffness matrix), we recognize the importance of system structure, because the livelihood system’s ability to resist risks is related to its structure [46,85]. Quantitative indicators include diversity of livelihood strategies, proportion of stable income, emergency cost, probability of labor transfer, and relocation attitude [86–89]. The LRM framework is shown in Figure 2, and Table 1 details the description of factors inﬂuencing livelihood resilience. This paper considers families relocated for the Chushandian Reservoir in Henan Province of China. In 2017 (the year before the relocation), the total population of Xinyang City was 8,805,300, and the urbanization rate is 46.05%. The annual GDP in 2017 was 222.655 billion yuan, and the structure of the primary, secondary and tertiary industries was 20.6: 38.8: 40.7. In 2017, the per capita disposable income of rural residents was 11,663 yuan, and the per capita consumption expenditure of rural residents was 8,972 yuan [90]. Chushandian Reservoir is a large-scale water conservancy project for ﬂood control, water supply, irrigation, and power generation. The construction aﬀected 39,170 people in 43 villages in 7 local townships. According to the guidance of the local government, people aﬀected by the reservoir need to relocate from their original places to nearby villages or towns. Therefore, their social identity is still farmers, and their administrative area remains unchanged. In addition, the socio-economic conditions and natural environmental conditions of the resettlement sites have a smaller gap with the original residence. However, the project has had a signiﬁcant impact on the livelihoods and lifestyle of these families (Figure 3).",
    "The data used in this study come from a special investigation by the research team. The team selected 14 villages as sample villages and conducted quantitative surveys of households selected by stratiﬁed random sampling, obtaining valid data on 307 RAFs before and after the relocation (from 2017 to 2019). The questionnaire mainly solicited basic information on the families, their production activities, income and consumption, and welfare. Before relocation, there were 1585 people in these 307 households. Respondents’ average working years was 7.4 years; the average household had 5.2 members; the average dependency ratio was 0.76; the average cultivated area was 7.6 hectares; and disposable income was 11,743 yuan per capita. In the local area, most of the elderly were farming at home and they mainly planted rice, and young people were more likely to work in economically developed cities. According to the survey data, these 307 households’ agricultural income accounted for 30.8% of the total income, their wage income accounted for 64.8% of the total income and 4.3% of other income. In general, these 307 households’ production eﬃciency is lower, and their incomes are not stable enough. To analyze the livelihood resilience of diﬀerent groups of RAFs, we classify households as follows. (1) In terms of income composition, the Chinese Ministry of Agriculture divides families into pure peasants(forwhomagriculturalproductionprovidesmorethan80%ofhouseholdincome), theﬁrsttype of part-time farmers (50–80% of household income), the second type of part-time farmers (20–50% of householdincome), andpurenon-farminghouseholds(lessthan20%ofhouseholdincome)[11]. (2)The location of resettlement is classiﬁed as near a village (rural) or in a town (urban). (3) Engel’s coeﬃcient is the ratio of total food expenditure to total personal consumption expenditure [91]. According to the criteria proposed by the FAO (2001), households can be divided into poorer (Engel’s coeﬃcient over 59%), poor (50–59%), rich (40–50%), richer (30–40%), and wealthy (under 30%). According to the LRM framework, the practical procedures for quantitatively assessing RAFs’ livelihood resilience are divided into the following four steps. Step 1: non-dimensional indicators. Deviation normalization method is used for data processing, in order to eliminate the eﬀect of the dimension and variance of each state variable and indicators and improve the comparability of diﬀerent variables and indicators [46]. Step 2: constructing the state vectors. Based on the state variables selected above, we constructed the state vectors of 307 RAFs, including the state vector of the impact on livelihood (F) and the state vector of the change of livelihood (∆X) of each family. Step 3: measuring results of RAFs’ livelihood resilience. According to Equations (3) and (6), the maximum eigenvalue of the KTK matrix can be calculated by Matlab software, so we can obtain the livelihood resilience scores of 307 RAFs. Step 4: estimating the contribution of inﬂuencing factors to livelihood resilience. Taking livelihood resilience scores as dependent variable and using the 18 indicators in Table 1 as independent variables, we carry out multiple linear regression analysis to further explore the inﬂuencing factors that have signiﬁcant contribution to the livelihood resilience. The standardized coeﬃcients and signiﬁcance are regarded as the basis for judging the contribution of indicators. The survey data and the classiﬁcation criteria mentioned above give us the following basic information on the 307 surveyed RAFs. Forty-two (14%) of the families are pure peasants, 31 (10%) the ﬁrst type of part-time farmers, 110 (36%) the second type of part-time farmers, and 124 (40%) pure non-farming households; 199 households (65%) resettled in a town and 108 (35%) in a village, and there were 15 poorer households (5%), 86 poor (28%), 150 rich (49%), 56 richer ones (18%), and no wealthy ones. Thus, pure non-farming households, rich households, and households who chose to be resettled in a town are prominent in the total sample, indicating strong local urbanization. We used MATLAB software to program and calculate (based on the equation of the LRM framework) livelihood resilience scores for the 307 RAFs, representing their relative livelihood resilience within the group. Per our assumptions, families with high scores have greater livelihood resilience. The highest score in the sample was 1.8252, and the lowest was 0.0662. The diﬀerence between the mean and the median is small, indicating that the concentration of the data is acceptable. The skewness is 0.4993, so the peak of the data distribution shifts in the direction of lower livelihood resilience. The kurtosis is 0.3783, indicating that there are fewer extreme data. The probability density curve is narrowly distributed, and the probability of scores between 0.6 and 0.7 is high, indicating that the livelihood resilience of the 307 RAFs is uneven, but the degree of diﬀerentiation is not serious (Figure 4).",
    "Grouping the families according to livelihood strategies, resettlement locations, and living standards as described above, we ﬁnd that the groups vary greatly in livelihood resilience scores and show some heterogeneity (Figure 5). The variation in livelihood resilience scores of pure peasants is wider than that of the other three livelihood types (Figure 5a). Comparing the average scores of the four types, the groups with higher proportions of agricultural income have higher scores, suggesting that livelihood strategy has an impact on livelihood resilience. Moreover, the eﬀects of relocation on RAFs’ agricultural production will be timely compensated. Non-agricultural work is less stable, so it is diﬃcult to maintain during relocation or resume quickly after. Householdswithhigherlivingstandardshavelowermedianlivelihoodresiliencescores(Figure5c). That shows that RAFs’ living standards do not completely determine their livelihood resilience. This is probably because families with higher living standards have more trouble maintaining them through the transition. Figure 5. Box plots of the 307 RAFs’ livelihood resilience scores by livelihood strategy, resettlement location, and living standards. (a) A box plot of livelihood resilience scores for 307 RAFs with diﬀerent livelihood strategies; (b) A box plot of livelihood resilience scores for 307 RAFs with diﬀerent resettlement locations; (c) A box plot of livelihood resilience scores for 307 RAFs with diﬀerent living standards. Source: designed by the authors. It is important to assess how successful our model is in measuring livelihood resilience. As a check, we consider the correlation between our livelihood resilience score, the overall livelihood capital index [81], and the subjective self-evaluated resilience score (SERS) [72,92]. Thesustainablelivelihoodframeworkisatooltohelppeopleunderstandtheirlivelihoodproblems. Many scholars regard sustainable livelihood capital as the basis for quantitative analysis of livelihood resilience or as a tool for constructing an indicator framework [26,81,93,94]. Here we use the household livelihood resilience approach, with the equal weight method [81,95], to calculate the overall livelihood capital index of 307 RAFs before relocation (Table 2). Correlation of this measure with our livelihood resistance score is signiﬁcant (the coeﬃcient is 0.450). To understand the true resilience, it is also necessary to track changes in happiness over time and solicit people’s judgment on the resilience of the family’s livelihood [72]. In the subjective self-evaluated resilience score (SERS) method, respondents evaluate their families through a series of ability-related questions, and researchers can choose any combination of capabilities according to a speciﬁc background. We select six capabilities for our survey of RAFs (Table 3). To ensure the simplicity and transparency of the calculation, answers to the six questions are scaled to a range of 1 to 5 (ﬁve-valued), and an average weighted score is calculated. Then we compare our livelihood resilience score with the SERS and ﬁnd a signiﬁcant correlation (the coeﬃcient is 0.581). In summary, the livelihood resilience scores obtained in this paper are comparable to the results from two other methods, and the coeﬃcients indicate that it is true and eﬀective to use the LRM framework to measure livelihood resilience. Based on multiple regression analysis, we calculated the goodness-of-ﬁt R2 is 0.780, and the overall goodness of ﬁt and prediction accuracy are good. The F statistic is 73.785, which passes the signiﬁcance test (1% statistical level). The expansion factor test shows no multicollinearity between independent variables (Table 4). Statistical tests show no eﬀect on livelihood resilience of social network added value, per capita disposable income, dependency ratio, or health status of the family. The other 14 indicators are all signiﬁcant at 1%. Land ownership, house and property value (livelihood capital), social cooperation, participation in welfare projects (livelihood transfer), emergency cost, and relocation attitude (livelihood buﬀer) are the indicators that have the most impact, collectively contributing to more than 60% of the RAFs’ livelihood resilience (Figure 6). This paper proposes a model of livelihood resilience based on Hooke’s law and illustrates the measurement process using survey data on 307 relocation-aﬀected households from the Chushandian Reservoir in China. This section will further discuss the feasibility of the method and the eﬀects of livelihood strategies on livelihood resilience. At the livelihood capital level, we ﬁnd that natural and physical capital are more important in absorbing risks during the relocation period than other types of capital. The largest contributing factor, land ownership, has a signiﬁcant positive impact on livelihood resilience. Land has not only economic value but also pension value for rural residents [96]. For the RAFs in rural areas, the availability of natural resources determines the accumulation of original livelihood capital [97]. Moreover, families with more land get more compensation for land acquisition, which can help them smoothly negotiate the transition period, in which their livelihood activities are suspended or forced to change, and help them reinvest in new methods of production as soon as possible.",
    "These results are also consistent with the conclusion in Section 4.2, which further illustrates that agricultural resources are the basis for RAFs’ livelihood transformation in the context of urbanization and aging. House and property value also has an important impact on livelihood resilience. There are substitution eﬀects and complementary eﬀects between physical capital and other capital [97], higher values of housing and property can provide more backup options for RAFs to maintain their livelihood over a short time. In summary, both physical capital and natural capital can serve as a buﬀer for RAFs. dividend [98]; a family with a simple population structure can adjust its livelihood strategies more ﬂexibly to deal with the change, and work experience, especially skills in agricultural production, has a restraining eﬀect on the timely adjustment of production mode. Therefore, the local government needs to make every eﬀort to protect the livelihood capital of RAFs from loss, and especially to provide adequate compensation for land and houses. At the same time, we should recognize the long-term economic, environmental, and social costs of reduced land resources, and suggest that the central and local governments need to take further actions and make plans to support RAFs in upgrading their livelihood strategies. Surprisingly, we ﬁnd that per capita disposable income and demographic characteristics have no signiﬁcant impact on livelihood resilience, in contrast to previous studies [99,100]. Although families with greater incomes have more initiative in consumption and investment, this does not guarantee that RAFs can quickly resume their livelihood activities or maintain their livelihood unaﬀected. Moreover, China’s social security system has gradually improved, which has weakened the impact of family demographic characteristics (including dependency ratio and health status) on livelihoods. At the livelihood transfer level, we find that participation in welfare projects, social trust, information recognition capabilities, and utilization of infrastructure and resources have significant positive effects on livelihood resilience, indicating that effective organization, learning and decision-making can help RAFs respond to risks in time, and also help them make full use of external resources to ensure the development of livelihood activities. Speciﬁcally, families with high participation in welfare programs have more channels through which to get livelihood support, which also helps transform social and economic welfare into a boost for production. Social trust expresses the reciprocal way strong social networks and broad social relationships can improve RAFs’ livelihood resilience [101]. Information recognition capabilities are the RAFs’ understanding of and response to relocation policies, which are mainly reﬂected in their choices of compensation packages and resettlement locations. Families who can make correct decisions generally have adequate preparation and plans for future development [65], and utilization of infrastructure and resources is reﬂected in the use of local infrastructure, natural resources, and social services by RAFs, which is more conducive to the transformation of external resources into livelihood capital [46]. However, social cooperation has a signiﬁcant negative eﬀect on livelihood resilience. In China’s rural areas, although most village cadres hold more active power relations in the village collective, they also rely on the local social relations and social order before relocation, but their positions do not bring more policy dividends to families. Therefore, the government should strengthen the communication of policy to help RAFs make decisions to adapt to future development, and it should also improve local welfare by providing RAFs a basic guarantee of livelihood and more opportunities for RAFs to participate in welfare projects, to reduce their cost of restoring production and life. At the livelihood buﬀer level, we ﬁnd that the ability and attitude to ﬂexibly adjust livelihood strategies are important in resisting risks. Emergency cost has a signiﬁcant negative eﬀect, which means that the more funds the RAF needs to restart livelihood activities, the more diﬃcult it is to restore their livelihood. Relocation attitude, diversity of livelihood strategies, proportion of stable income, and probability of labor transfer also have signiﬁcant positive eﬀects on livelihood resilience. Relocation attitude refers to the psychological acceptability to RAFs of changing their production methods and lifestyle. The higher the expectation for future development and the less constraint from the customs of the original residence, the stronger the subjective initiative of family members to develop production. Diversiﬁed livelihoods are useful in timely adjusting livelihood strategies. The proportion of stable income is income that is not aﬀected by relocation, so it improves the robustness of RAFs’ livelihood [98]; the higher the proportion, the higher the eﬃciency of recovery. The higher the probability of labor transfer, the less likely it is that workers will be unemployed after relocation, so such families can adjust their livelihood strategies as soon as possible. Therefore, the government should provide skills training courses and employment opportunities for workers, which can help RAFs improve their income and living standards by improving production eﬃciency. The government should also attach importance to ﬁnancial incentives, career development, and personal recognition and appreciation [46].",
    "First, the LRM framework provides a fresh look at deﬁnitions of livelihood resilience and its measurement. After combing the literature, we can divide the concept of resilience into two categories: one is described as a capacity, referring to the dynamic process of subject or system recovery, self-improvement, adapting to the environment, or changing the environment [26,39,102,103]; the other is regarded as an attribute used to describe the performance of a system to absorb disturbance and reorganize while undergoing change, so as to still retain essentially the same function, structure, identity, and feedbacks [43]. Based on socio-ecological system theory, we infer that resilience is an attribute of the livelihood system and reﬂects the performance of aﬀected families in responding to risk, absorbing interference, and restoring and maintaining livelihoods, during the stage of response and resistance. The idea of resilience emphasizes the active resistance and response of the system over vulnerability and adaptability [103,104]. The equation of the LRM framework inspired by Hooke’s law is logically consistent with the deﬁnition of livelihood resilience, and the solution of the equation can represent the response and resistance characteristics of the system itself. Second, the LRM framework is an objective and practical method for the quantitative assessment of livelihood resilience, rather than a theoretical framework or indicator system. We use the state vector method to calculate livelihood resilience scores, which avoids the subjectivity of structural eﬀect analysis. Taking the sample households of the Chushandian reservoir as an example, we can present the complete measurement procedures and calculation results. On the one hand, these scores can clarify that each family has a diﬀerent performance in risk perception and livelihood change due to diﬀerent livelihood resilience. On the other hand, the scores can be used as dependent variables in multiple regression analysis to identify the key factors that aﬀect the resilience of RAFs. What’s more, we propose that livelihood capital, livelihood transfer, and livelihood buﬀer are the determinants of livelihood resilience and play a role in absorbing, responding to and resisting risks, respectively. The metrics proposed based on structural dynamics are explained and tested with the case study. Thus, this framework can be applied to the assessment of families’ livelihood resilience in a wider range of ﬁelds. Third, the LRM framework can calculate the relative strength of families’ livelihood resilience within a group, and this result can be veriﬁed by correlation analysis with other subjective and objective resilience assessments. We calculated the livelihood resilience score of each family according to their situation before and after resettlement, and compared it with the overall livelihood capital index [81] and SERS [72], respectively, and the correlations were statistically signiﬁcant. That shows that the method proposed in this paper is eﬀective in the actual situation of the study area and that the calculation results are true and reliable. Lastly, the LRM framework describes and evaluates the resilience of the livelihood system from the perspective of systems science. Many scholars call for the use of nonlinear methods to deal with complex social science problems from the systems perspective, to better understand the dynamic feedback, interaction, and evolution of the system [14,17,43,105]. This paper is inspired by physical methods to deal with complex systems science problems. Therefore, our livelihood resilience model is based on Hooke’s law and uses the state vector method to describe the state and change of variables in the system. To analyze the mechanism of livelihood resilience, we focus not on causal relationships but on the composition, institutions, and characteristics of the system based on the principle of structural dynamics. This article proposes a method for assessing livelihood resilience. Taking 307 RAFs from the Chushandian Reservoir in China as an example, we deﬁned and measured their livelihood resilience and identiﬁed factors that could improve it. Our LRM framework is based on the idea of Hooke’s law and uses the state vector method to calculate livelihood resilience scores. Empirical analysis shows that RAFs with a higher proportion of agricultural income have higher average livelihood resilience. The correlation of our livelihood resilience scores with the overall livelihood capital index and with the subjective self-evaluated resilience score is 0.450 and 0.581, respectively, suggesting an accurate method. We ﬁnd that land ownership, house and property value (parts of livelihood capital), social cooperation, participation in welfare projects (parts of livelihood transfer), emergency cost, and relocation attitude (parts of livelihood buﬀer) are the factors with the greatest impact on livelihood resilience. The framework could be applied to predict and classify the livelihood resilience of RAFs in wider range of ﬁelds. It could also help governments or organizations estimate RAFs’ livelihood resilience in advance and thus help them recover their livelihood as soon as possible.",
    "The limitation of the research is that the factors proposed in this article as aﬀecting livelihood resilience are limited. Based on structural dynamics, we used 18 inﬂuencing factors from the system’s livelihood capital, livelihood transfer, and livelihood buﬀer. However, due to the complexity of the livelihood system, there are many confounding factors in the system. Therefore, future research should focus on optimizing the indicators used in the multiple regression analysis to identify more suitable inﬂuencing factors and improve the accuracy of livelihood resilience assessment. Author Contributions: Conceptualization, Y.G., R.Z., and K.Y.; data curation, Y.G., B.L., and F.W.; formal analysis, Y.G.; investigation, B.L. and F.W.; methodology, Y.G.; supervision, R.Z. and K.Y.; writing—original draft, Y.G.; writing—review and editing, R.Z. and K.Y. All authors have read and agreed to the published version of the manuscript. Acknowledgments: The authors thanks all the participants in the survey and seminar and thank Roy Sablosky for reading and editing the language of this article. We thank the anonymous reviewers for their comments, which helped us improve the article."
]